[{"handle":"RepKarenBass","text":"Today we celebrate the resilience of #Dreamers and recognize the contributions of millions of undocumented immigrants to this country, but we also must recommit to passing permanent solutions for the many undocumented folks who call the United States home. 3/","date":"Wed Jun 15 22:21:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have already passed the #DreamAct in the House to give Dreamers a pathway to citizenship and there are other pieces of legislation like the US Citizenship Act that we must get passed. \n\nI will always fight for the immigrant communities in this country. \n\n#HomeIsHere \n\n4/4","date":"Wed Jun 15 22:21:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"When I worked at Community Coalition in South LA, I worked with young people who didn't know they were undocumented until they applied for college. \n\nI’ve seen the pain a winding path to citizenship can cause for a family and a community. \n\nThis is a personal fight for me. 2/","date":"Wed Jun 15 22:21:58 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"10 years ago today, President Obama announced the Deferred Action for Childhood Arrivals (DACA) Program, allowing Dreamers to study, work and live in the only country many of them have ever known as home.","date":"Wed Jun 15 22:21:58 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Financial Services Racial Equity, Inclusion, and Economic Justice Act will:\n\n✅ Invest in communities of color and other underserved communities\n\n✅ Promote access to fair housing and lending\n\n✅ Promote diversity &amp; inclusion through new data collection\n\nI'm voting YES.","date":"Wed Jun 15 17:52:44 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Promoting security, prosperity and democracy in the Western Hemisphere and all around the world has a direct impact on the people in L.A. that I’m so proud to represent in Congress. \n\nGreat to see @POTUS at the Summit of the Americas this week pushing our country forward! https://t.co/9qvaMcG97T","date":"Sun Jun 12 16:18:16 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The choice before us is whether or not we want to save lives. \n\nI choose safety. \n\nI choose life. \n\n#MarchForOurLives #EnoughIsEnough","date":"Sun Jun 12 02:39:58 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our children will not be safe until we change our country’s gun laws. AR-15s do not belong in our community.","date":"Fri Jun 10 14:15:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last year, I voted to impeach President Trump for inciting the insurrection at the Capitol.\n\nTonight's hearing serves as a reminder of Trump’s attempt to dismantle our democracy.","date":"Fri Jun 10 03:11:05 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today was an incredibly important step in the fight against homelessness in Los Angeles.\n\nThank you @SecFudge for coming to our city to continue talks with folks on the ground and to examine ways to leverage HUD resources to produce quality housing in our communities. https://t.co/QstCcUrbab","date":"Fri Jun 03 03:04:15 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"One group that’s incredibly prone to falling into homelessness is people who were formerly incarcerated. \n\nToday, @SecFudge and I are meeting with service providers to find ways to make changes that will ultimately get people in housing faster. https://t.co/nVGbANHoEq","date":"Thu Jun 02 22:47:31 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have to be solution-oriented when it comes to this crisis. \n\nThe Hilda L. Solis Care First Village serves as a steppingstone for unsheltered Angelenos through housing, wellness, employment. \n\nThank you @HildaSolis for joining me and @SecFudge today. https://t.co/4BL8uD0pQ6","date":"Thu Jun 02 19:37:33 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"More than 60,000 people are experiencing homelessness across Los Angeles County. \n\nI invited @SecFudge here to get a first-hand look at the homelessness crisis and to see what more we can do on the federal level to get people housed. https://t.co/dBjaQmcunN","date":"Thu Jun 02 15:43:44 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"A grocery store. \n\nA church. \n\nAn elementary school.\n\nNow a hospital. \n\nAll in the span of 3 weeks. How many people will die before the gun lobby and Republicans get out of our way and stop blocking our bills?\nhttps://t.co/AJRgploRYV","date":"Thu Jun 02 05:33:02 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Students all across the country should not go to school wondering whether or not they’ll be safe. \n\nWe have to do more to keep our young people safe.","date":"Thu Jun 02 03:11:21 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you @SecFudge for agreeing to come to Los Angeles tomorrow to see first-hand the extent of the homelessness crisis here and the urgent need for additional housing assistance. \n\nI look forward to meeting with you.","date":"Wed Jun 01 21:39:41 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Memorial Day, we mourn all who have served -- those who died on the frontlines of war, as well as those who died unhoused on our streets after returning home from serving this country.\n\nOur gratitude will never match the sacrifice made, so we must honor them with action.","date":"Mon May 30 22:15:35 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The executive order I worked on with the White House will set the tone for states and cities across this country. \n\nPresident Joe Biden signing the executive order is a step in the right direction and we still have more work ahead of us. https://t.co/ijGCtcggkr","date":"Mon May 30 16:08:30 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must protect our schools, our children, and the future of this country. \n\nWeapons of war do not belong in our classrooms.","date":"Sat May 28 21:35:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"How many babies need to die before the Senate is willing to act? https://t.co/2nPybgWSYS","date":"Sat May 28 03:42:40 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"When we come together, we will always find a way to make change. https://t.co/iLbdEG6kV0","date":"Fri May 27 02:31:47 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"It should not be harder to buy baby formula than it is to buy an AR-15.","date":"Thu May 26 16:53:44 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, President Joe Biden signed our executive order modeled after the George Floyd Justice in Policing Act.\n\nThe Senate refused to act so we made a way out of no way.\n\nWe will never stop fighting for change. https://t.co/j23bX1eWkW","date":"Thu May 26 01:49:09 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Like my friend Congressman John Lewis used to tell me — we have to make a way out of no way.\n\nToday, we did just that. https://t.co/qYlAVx4J4w","date":"Wed May 25 21:14:34 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, we honor the two year anniversary of the murder of George Floyd with action. \n\nWhen the Senate stalled on our bill to raise policing standards, we made a way out of no way and got our executive order to the President’s desk.\n\nWe must never stop fighting. Change will come. https://t.co/Xf8Z94O2T3","date":"Wed May 25 20:40:12 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, on the second anniversary of the murder of George Floyd, I'll be at the White House with President Biden as he signs this historic executive order. \n\nThis is about public trust and public safety in our communities. \n\nWe can have safety and justice at the same time. 3/3","date":"Wed May 25 14:17:57 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"When the Senate failed to act, @SenBooker and I went to the President and asked him to act. \n\nWe worked closely with the White House and came up with an executive order that will help bring transparency and accountability to law enforcement. 2/","date":"Wed May 25 14:17:25 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I successfully led the passage of the George Floyd Justice in Policing Act twice in the House of Representatives, but both times it stalled in the Senate. \n\nI refuse to take no for an answer. I believe that change will always find a way – and today is evidence of that. 1/","date":"Wed May 25 14:16:09 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Teenagers shouldn’t be able to buy weapons of war anywhere in this country.","date":"Wed May 25 12:17:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"14 children and a teacher had their lives cut short today because of the absolute cowardice of the Republican Party, which refuses to pass our gun reform legislation. \n\nWe cannot grow numb to these shootings. \n\nWe must continue our fight. \n\nWe need to pass reforms NOW.","date":"Tue May 24 21:51:37 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I said it over the weekend, I'll say it again today:\n\nWe will not allow our country, our state or our city to move backwards. All women deserve the right to have control over their bodies. \n\n#BansOffOurBodies https://t.co/3Vhu9C4OrF","date":"Mon May 16 16:27:48 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"My heart breaks for Laguna Woods and the congregation and community of Geneva Presbyterian Church. \n\nIn honor of the victims and their families today, we continue our fight. 2/2","date":"Mon May 16 03:48:14 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are at a devastatingly unacceptable point in our history where mass shootings are happening less than 24 hours apart and Republicans in the Senate STILL refuse to pass common sense gun reform laws. 1/","date":"Mon May 16 03:48:01 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"As we learn more about what happened today, one thing remains clear: \n \nBlack people in Buffalo were sought out and murdered because of a racist indoctrination that has been disseminated by extremists in this country.\n \nThis was a terrorist act, and it must be addressed as such.","date":"Sun May 15 04:33:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"What we learned from the leaked Supreme Court decision is that we cannot take any progress for granted. That’s why it was so inspiring to see tens of thousands of Angelenos making their voices heard today.\n\nWe must keep fighting. \n\nWe will never go back. \n\n#BansOffOurBodies https://t.co/UtTgMAfpag","date":"Sun May 15 03:09:11 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The mass shootings in Milwaukee and Buffalo happening over the past 24 hours are heartbreaking and infuriating. \n\nThe reality is that we can stop the rising gun violence in this country — Republicans just refuse to help us pass common sense legislation.\n\nSo much for “pro-life”.","date":"Sat May 14 22:12:10 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"1,000,000 people in the United States have died due to COVID-19. \n\nToday marks an absolutely horrific and shocking milestone. We cannot grow numb to this tragedy and must continue to do all we can to keep our communities safe. https://t.co/qOGIipIB2k","date":"Fri May 13 02:10:25 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"In May, we honor the contributions our country’s #AAPI communities and we celebrate the contributions they’ve made to our society. Happy Asian Pacific American Heritage Month! \n#APAHM2022","date":"Wed May 11 16:00:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last month, I secured hundreds of thousands of dollars to support violence prevention efforts in Los Angeles. Our community needs a holistic, culturally responsive and trauma informed approach to reduce crime, violence, and incarceration.","date":"Wed May 11 12:00:01 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Investing in the community &amp; providing job training necessary to acquire employment with competitive wages is essential to preparing future leaders for success. \n\nThank you Consul General Muto &amp; Dr. Thomas A. Parham for facilitating our discussion today at @DominguezHills https://t.co/X0Hpv1hFko","date":"Tue May 10 02:03:11 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"What’s happening in the Supreme Court didn’t just happen overnight — it took years and years of Republican activism and donations to get them to the brink of taking away the rights of millions of women in this country.\n\nWe must fight back.","date":"Fri May 06 22:32:43 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The goal of overturning the court precedent of Roe v. Wade is to take rights away from women. Period.","date":"Thu May 05 17:30:09 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"To be clear, this is an assault on women throughout our country, but especially low income women.\n\nNow more than ever we need leaders at every level of government to stand up and fight for women’s rights and the right to choose.\nhttps://t.co/Yoa1jvTbfc","date":"Tue May 03 04:53:47 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"After years of working with community organizations to ban menthol, I’m glad to see the FDA is taking historic and long-overdue action to protect our nation’s kids, advance health equity and save lives. https://t.co/Wks2pwm7fC","date":"Mon May 02 22:42:01 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"May is #NationalFosterCareMonth. \n\nAs the founder and co-chair of the Congressional Caucus Foster Youth, one of the largest bipartisan caucuses in Congress, I will continue to fight to transform our child welfare system for a better future for all. https://t.co/mJvLltu4Ip","date":"Mon May 02 00:28:07 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"What started as a response to injustice turned into a tragic display of economic desperation and inequity in our city. \n\n30 years ago I watched in horror as our entire city burned. But today I stand with hope — not just because of how far we’ve come, but how far I know we can go. https://t.co/0CoUHgtbpf","date":"Sat Apr 30 02:13:34 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Rooting for LA’s newest professional soccer team @weareangelcity tonight! The team is a beacon of inspiration for young women and all young athletes in our city. Congratulations to @juhrman, @karanortman, @MiaHamm and the countless others who worked to make this happen. #Volemos","date":"Fri Apr 29 17:37:30 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Dominic Ng’s experience leading the largest publicly-listed independent bank based in Southern California will help him serve our country well on the U.S. Asia-Pacific Economic Cooperation Business Advisory Council. \n\nI applaud @POTUS on this appointment. https://t.co/xpSXWYQAKf","date":"Fri Apr 29 16:47:29 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I will never stop fighting for children separated from their families.","date":"Fri Apr 29 00:09:58 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, and every day, I stand with the Jewish community throughout Los Angeles and throughout the world. \n\n#NeverAgain","date":"Wed Apr 27 22:20:14 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"“Never Again” is active, not passive -- we must apply that to what we see around us. \n\n“Never Again” means combatting the growing ignorance regarding the Holocaust and it means taking firm action against anti-Semitism that seeps into our neighborhoods and communities.","date":"Wed Apr 27 22:19:42 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today on Yom HaShoah, we remember the more than six million Jews and millions of others murdered during the Holocaust.\n\nI had the honor of visiting @hmla1961 this month and saw the vital work done to educate people from all over the world about one of humanity’s darkest chapters. https://t.co/zXmEG5PaC8","date":"Wed Apr 27 22:18:31 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud that we passed the Small Business Development Centers Improvement Act today. \n\nThis bill will allow Small Business Development Centers to market their services to their communities and broaden their reach to more small businesses, helping them create jobs. https://t.co/Cb6XRiEElE","date":"Wed Apr 27 00:12:20 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today I stand with the Armenian American community in mourning the 1.5 million lives lost during the Armenian genocide. https://t.co/fdQBDUtgv1","date":"Sun Apr 24 21:17:26 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to @SEIU on 101 years of fighting for the PEOPLE! \n\nI am glad to have partners like you in the fight to advance social and economic justice in this country.","date":"Sat Apr 23 23:23:55 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"JUSTICE.","date":"Fri Apr 22 23:09:03 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"This #EarthDay we recommit ourselves to the fight for: \n\n✅ Climate action\n✅ Environmental justice\n✅ Clean air &amp; water\n✅ A clean energy future\n✅ Public &amp; sacred lands protections\n\nWe only have one home. We need to act like it.","date":"Fri Apr 22 15:09:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to have earned a 100% on the @eqca 2021 legislative scorecard. \n\nI will always stand with the LGBTQ+ community not just in Los Angeles and California, but throughout the nation. https://t.co/jKPGcr0h0D","date":"Mon Apr 18 18:20:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I hope everyone who celebrated today had a very happy #Easter! \n\nIn the middle is my grandson Henry and on the right is my partner Melvin. \n\nWishing happiness to you and yours! https://t.co/0BNKJsOJeH","date":"Mon Apr 18 04:28:10 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"There is no place for anti-Semitism in Los Angeles. This cannot be tolerated and should be aggressively investigated and prosecuted. \n\nThis week, the Jewish community should be celebrating Passover with family and friends — not worrying about their safety.\nhttps://t.co/S87i2rUFRR","date":"Mon Apr 18 01:56:07 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"This week I was officially sanctioned by Russia’s Foreign Ministry. \n\nI will not be intimidated or deterred from continuing to speak out against humanitarian abuses committed by Russia both in Ukraine and throughout the world.","date":"Sun Apr 17 05:31:02 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"In November, I sent a letter to the White House requesting action be taken to provide lifesaving protections for Cameroonians living in the United States. Thank you President Biden for hearing our call. https://t.co/OYM0Yk0rxx","date":"Sat Apr 16 16:27:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I hope everyone’s seder tonight is filled with happiness and peace. Chag Sameach and happy #Passover to those who are celebrating all over the world!","date":"Sat Apr 16 01:12:18 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to stand with my colleagues today at the state and local levels coming together to get ghost guns off of our streets. https://t.co/GoUBubqC0l","date":"Fri Apr 15 17:56:23 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is #Vaisakhi, one of the most significant days of the year for the world's fifth-largest religion. \n\nWishing our Sikh community and neighbors a very happy #Vaisakhi!","date":"Thu Apr 14 16:06:35 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are seeing the greatest single year of job creation in American history right now. \n\nThat's what real leadership can do.","date":"Thu Apr 14 14:25:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Such an honor to participate in the grand opening of the Debbie Allen Dance Academy Rhimes Performing Arts Center over the weekend! \n\nThank you to @msdebbieallen for opening such an AMAZING facility right in the heart of our community. https://t.co/zHUnUFYhqL","date":"Tue Apr 12 19:12:18 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"When I speak with LAPD, they tell me that ghost guns are a part of the increase in homicides and shootings.\n\nI’m proud to stand with the White House as we address a critical gap in the our ability to track these weapons.\n\nThese reforms will save lives.\n\nhttps://t.co/8BMMELxOOK","date":"Tue Apr 12 03:16:53 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"This week, I voted to add funding for the Restaurant Revitalization Fund to ensure that the 170,000 eligible restaurants that applied for relief but couldn't access support due to oversubscription will finally have access to funding.","date":"Sat Apr 09 18:35:56 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The first, but not the last. https://t.co/ealvi3COH2","date":"Fri Apr 08 19:28:42 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need to reinvest in and reimagine our approach to innovation.\n\nI look forward to working with my colleagues in the House and the Senate on both sides of the aisle to deliver a bill that’s best for the people of L.A.\n\nThank you @SpeakerPelosi for this appointment.","date":"Fri Apr 08 16:23:45 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The pandemic hasn't stopped which means our relief efforts shouldn't stop. \n\nThat's why today, we passed legislation that would provide billions of dollars to replenish the Restaurant Revitalization Fund and funds for small businesses hit hard by COVID.","date":"Thu Apr 07 21:54:13 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Qualified.\n\nConfirmed.\n\nUnited States Supreme Court Justice Ketanji Brown Jackson.\n\nAll rise. https://t.co/7yOa2M4xtt","date":"Thu Apr 07 18:21:44 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Mail delivery issues are consistently one of the top problems I hear from constituents about.\n\nToday, President Biden signed our Postal Service Reform Act into law, which will improve the reliability of USPS for families and small businesses throughout our district.","date":"Wed Apr 06 21:20:13 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, on Transgender Day of Visibility, we celebrate the courage, power and resilience of all trans people to live authentically. \n\nTrans people exist and belong everywhere, and our laws must reflect that. #TransDayofVisibility","date":"Fri Apr 01 03:40:49 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I grew up in a labor house that stood in solidarity with the farm workers during the Delano Grape Boycott.\n\nCesar Chavez was a hero to me. \n\nToday, on his birthday, we recommit to standing with the workers of @UFWupdates and continuing the fight for social and economic justice. https://t.co/O9czWC7vYT","date":"Thu Mar 31 23:11:03 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Allenco oil drilling site was causing neighbors to have nosebleeds, headaches and respiratory issues like asthma.\n\nWe took action and Allenco stopped operations.\n\nI’m glad regulators are working to ensure that folks living near this plant are safe.\nhttps://t.co/wBYcvQavGo","date":"Wed Mar 30 14:01:48 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, @RepBarbaraLee addressed the @UN to commemorate the abolition of slavery and the transatlantic slave trade.\n\nSome in this country want to deny history. \n\nThat's wrong. \n\nAs Rep. Lee said, we must EMBRACE this occasion as a clarion call to engage and to move forward.","date":"Tue Mar 29 23:43:02 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, the President of the United States will sign the Emmett Till #AntilynchingAct to designate lynching as a hate crime under federal law. \n\nFinally.","date":"Tue Mar 29 19:53:22 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to always stand with @SEIU2015 in the fight to ensure that every Californian has access to safe, quality care—either in their own home or in a high standards skilled nursing environment. \n\n#PutCareFirst https://t.co/4epmhbX0bu","date":"Mon Mar 28 21:01:13 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, the House of Representatives passed the Emmett Till Anti-lynching Act to designate lynching as a hate crime under federal law. \n\nFinally. https://t.co/2ZkgkjE1wC","date":"Thu Feb 27 02:31:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to wish everyone celebrating today in Los Angeles and around the world a very happy Nowruz!\n\nI hope that today brings you and your family new energy and fresh strength for the coming year.","date":"Sun Mar 20 23:44:20 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Barbara Morrison gifted us with her voice and her service. Our city, and especially our Leimert Park community, will miss both her music and her spirit.  \nhttps://t.co/CalR9wPgIe","date":"Thu Mar 17 14:15:50 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I stand with the AAPI community in condemning anti-Asian hate and believe perpetrators should be charged with hate crimes. \n\nWe must have no tolerance for this hatred in our city.\n\n#StopAsianHate #StopAAPIHate \n\n4/4","date":"Wed Mar 16 15:03:57 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The impact of these incidents stretches further than the direct victims - the fear among our AAPI neighbors here in Los Angeles of being targeted by a racial attack is very real. 3/ https://t.co/Cz6vXApIfg","date":"Wed Mar 16 15:02:33 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Just this week, a woman in New York was punched more than 125 times and called a racial slur.\n\n125 times. \n\n 2/\nhttps://t.co/d1c7lFkt3G","date":"Wed Mar 16 15:01:50 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks one year since eight people at three Atlanta area spas were killed in a vile assault on the Asian American community not just in Atlanta, but nationwide. 1/","date":"Wed Mar 16 15:00:35 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are record breakers.\nWe are coalition builders.\nWe are opinion makers.\nWe are world leaders.\n\nWe are the future.\n\nHappy #InternationalWomensDay","date":"Wed Mar 09 03:22:26 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Great to see President Joe Biden and Housing and Urban Development Secretary Marcia Fudge tonight. \n\nI look forward to continuing our work together on behalf of the people of Los Angeles and this country.\n\n#SOTU2022 https://t.co/2kAtpKVIXT","date":"Wed Mar 02 02:47:30 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tonight, on the first day of Women's History Month, the President of the United States will begin his State of the Union address with:\n\n\"Madam Speaker. Madam Vice President.\"\n\nHistory in the making.\n\n#SOTU2022 #WomensHistoryMonth","date":"Wed Mar 02 01:28:36 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The nomination of Judge Ketanji Brown Jackson is a proud moment for this country.\n\nA fair jurist with an unyielding commitment to justice, I look forward to supporting her through this nomination process and ensuring she becomes the first Black woman to sit on our highest court.","date":"Fri Feb 25 15:51:46 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Vladimir Putin has chosen to launch a premeditated war of choice that will bring catastrophic loss of life and human suffering. \n\nI stand with the people of Ukraine in the face of this assault on their sovereignty.","date":"Thu Feb 24 21:16:36 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Forcing schools to out LGBTQ children is not just atrocious and cruel — it also puts the lives of the students at risk.\n\nYoung people should be embraced and taught to love and celebrate their differences.\n\nThis is the opposite of that.\nhttps://t.co/PDQ4QTxDN7","date":"Tue Feb 22 16:40:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Happy #PresidentsDay to everybody, but especially these two -- looking forward to continuing our work to make Los Angeles the best city it can be. https://t.co/ZTh5KUBf8v","date":"Mon Feb 21 23:54:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"It was one of the highest honors of my life to bring John Lewis to South Los Angeles.\n\nHappy birthday, Congressman Lewis.\n\nWe miss you. https://t.co/ZeMyv3Abio","date":"Mon Feb 21 18:59:42 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"80 years ago today, Executive Order 9066 was signed to savagely remove 120,000 Japanese Americans from their homes &amp; communities just because of their heritage.\n\nTheir imprisonment, as well as the way many families were treated after, remains one of America's most shameful acts.","date":"Sat Feb 19 18:30:02 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Pamela Moses received a 6 year sentence in prison for trying to register to vote.\n\nKim Potter received a 2 year sentence and a $1,000 fine for killing Daunte Wright.\n\nWhere is the justice?","date":"Sat Feb 19 05:42:41 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"When we work together on the federal level, our state and our communities are the ones that benefit. \n\nLos Angeles is receiving more than $21 million for permanent supportive housing for people experiencing homelessness because of that work.\nhttps://t.co/iXrY0bYsgv","date":"Wed Feb 16 22:22:59 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks four years since the deadliest high school shooting in US history.\n  \nAs we remember this tragedy, let us never forget the lives lost and those impacted that day.\n\nIn their memory and honor, we must continue fighting to keep our communities safe. \n\n#MSDStrong","date":"Mon Feb 14 17:15:32 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"👀 👀 👀 #RamsHouse","date":"Mon Feb 14 03:09:47 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tomorrow’s the big game. @RepSteveChabot I’ll bet you a box of See’s chocolates that tomorrow the @RamsNFL will be lifting that trophy. You in?","date":"Sat Feb 12 20:07:45 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Security efforts leading up to the Super Bowl should not include ICE monitoring street vendors who are just trying to make a living selling food. Period.","date":"Fri Feb 11 19:37:50 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We secured $56,789,406 for California to install electric vehicle charging stations along key roads and highways.\n\nInvestments like these mean jobs for Los Angeles but are also important in the fight against climate change.","date":"Fri Feb 11 16:02:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have to do everything we can to ensure that the US Postal Service is able to meet the needs of everyone in Los Angeles. \n\nThat's why we passed the Postal Service Reform Act this week. https://t.co/BjTo5Hw1OY","date":"Thu Feb 10 22:13:12 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We cannot simply call our nurses heroes, we need to stand with them for better wages and safer working conditions. \n\n#ThankYouNurses https://t.co/AQcm9FaaJm","date":"Wed Feb 09 15:17:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We depend on USPS to deliver our medication, our benefits, our letters from loved ones and more.\n\nThat’s why today I voted YES on the Postal Service Reform Act to improve the reliability of USPS’s services and put the Postal Service on stronger financial footing.","date":"Wed Feb 09 04:12:24 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every day, more than 110 people in America die by gun violence and over 200 are wounded. \n\nEach of their stories deserve to be heard.\n\nAs #GVSurvivorsWeek comes to a close, join me in uplifting survivors’ voices and honor them with action to end gun violence.","date":"Mon Feb 07 19:41:27 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"#LunarNewYear is a time of celebration for so many people here in Los Angeles and millions around the world. \n\nI am proud to support legislation making it a federal holiday and was proud to recognize this important day on the House Floor this week. https://t.co/huqs69WRR9","date":"Sun Feb 06 01:39:17 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"2021 was the greatest year of job growth in American history.\n\nI will never stop fighting for good-paying jobs in Los Angeles.","date":"Wed Feb 02 14:58:44 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"There is no American history without Black history -- and while we celebrate this month, we remember all year long. \n\n#BlackHistoryMonth https://t.co/7kuehbU6bX","date":"Wed Feb 02 01:36:58 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Though many will not be able to gather in person with our families and our elders, we continue to forge ahead in our recovery from the pandemic. \n\nI want to wish everyone warm wishes of health, success and happiness in the year ahead. 4/4","date":"Tue Feb 01 17:14:50 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's also a time of celebration, which is why this year I've cosponsored new legislation to make Lunar New Year a federal holiday in the United States. 3/","date":"Tue Feb 01 17:13:48 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"As we welcome the #YearOfTheTiger – a symbol of bravery – we honor the history and heritage of AAPI communities across America and stand in support and active defense in the face of challenges – like the rise of anti-Asian violence and hate. 2/","date":"Tue Feb 01 17:13:23 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"#LunarNewYear is a time of celebration for so many people here in Los Angeles and millions around the world. 1/ https://t.co/VO4TN9Rdcs","date":"Tue Feb 01 17:12:54 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Neo-Nazi rally in Orlando over the weekend should be universally condemned. \n\nThis is not complicated. \n\nThis anti-Semitic hate must be eradicated and unwillingness to call it out allows violence to fester.\nhttps://t.co/nrlN5XLnDN","date":"Tue Feb 01 05:02:05 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"77 years ago today, Allied forces liberated Auschwitz, exposing evil there for the world to see.\n\nToday on #HolocaustRemembranceDay, we remember the 6 million Jews murdered, we pledge to continue to fight anti-Semitism wherever it appears, and we say with commitment: Never Again","date":"Thu Jan 27 19:59:39 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"No one knows how to get resources to our communities better than the communities themselves. \n\nProud to assist @KYCCLA in securing vital funding to help Korean American small business owners with in-language services to ensure that COVID relief is reaching everyone in our city. https://t.co/ITw1MmFP7n","date":"Thu Jan 27 05:19:45 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you Justice Breyer for your service to this country.","date":"Wed Jan 26 19:45:21 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"49 years ago, the Supreme Court protected the right to choose with its decision in Roe v. Wade.\n\nToday, that right is being threatened like never before.\n\nI will continue to fight against any attempt to reverse reproductive freedoms in this country.","date":"Sun Jan 23 01:16:49 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"So on today's anniversary, I want to recognize every single frontline worker in our health care system. For the past two years they have sacrificed so much to keep each one of us safe. \n\nThank you for all you've done and all you do. 4/4","date":"Fri Jan 21 00:42:56 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"No medical personnel or any other staff should have to deal with outrageous behavior. 3/","date":"Fri Jan 21 00:42:46 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I know what it's like to work in the ER. I can only imagine what it's been like during this pandemic.\n\nI'm sad that instead of praise for medical staff that was popular 2 years ago, health care workers now have to endure attacks from the very people they are trying to save. 2/","date":"Fri Jan 21 00:42:20 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"January 20, 2020: The first known case of COVID-19 in the U.S. is reported. 1/","date":"Fri Jan 21 00:40:17 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Anyone who quoted Dr. King this week should vote to pass the Freedom to Vote: John R. Lewis Voting Rights Act this week.","date":"Wed Jan 19 20:17:36 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"New date, same website for more information! \n\nHope to see you February 22, 23, and 24.\n\nhttps://t.co/q9BoyWMdzK","date":"Wed Jan 19 03:06:19 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is not a day off, today is about service — a day to recommit to the fight for social and economic justice in this country. \n\nHappy #MLKDay","date":"Mon Jan 17 18:12:38 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"“I think the tragedy is that we have a Congress with a Senate that has a minority of misguided senators who will use the filibuster to keep the majority of people from even voting.” \n\n- Martin Luther King Jr. in 1963","date":"Mon Jan 17 18:06:50 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Especially on the Sabbath, this is a heinous attack on the Jewish community. \n\nI’m thankful for the first responders who are working to rescue the rabbi and congregants of Congregation Beth Israel in Texas. \n\nMy office will continue to monitor this situation as it unfolds.","date":"Sun Jan 16 01:23:01 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Greater Los Angeles Homeless Count helps get services to where our unhoused neighbors need them most. It's volunteer-based and how we know how many people are unhoused.\n\nIf we want to end this crisis, it will take all of us.\n\nTo sign up to help, visit https://t.co/q9BoyWuCIc https://t.co/FLvfGbUcYq","date":"Thu Jan 13 22:33:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Korean American community has enriched LA for more than a century. Koreatown is not only a neighborhood I’ve lived in &amp; worked with – it’s also a place I’ve had the privilege to represent in Sacramento and DC. I look forward to continuing our work together. #KoreanAmericanDay","date":"Thu Jan 13 17:43:11 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"In order to fully address homelessness, we have to prevent it from happening in the first place. https://t.co/cd26IgN0tn","date":"Thu Jan 13 04:29:13 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"The House of Representatives passed the John R. Lewis Voting Rights Advancement Act 141 days ago.\n\nIt's time for the Senate to act.","date":"Wed Jan 12 23:21:42 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is #NationalHumanTraffickingAwarenessDay – a time to recommit in our fight against trafficking. I’ve led the passage of legislation to help combat trafficking and also to help protect kids in the child welfare system who are disproportionately impacted. The work continues.","date":"Wed Jan 12 01:33:11 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"His efforts were both domestic and international including fighting against apartheid in South Africa and to free Nelson Mandela. His courageous contributions to our society endure and we are better for them. 2/2","date":"Mon Jan 10 21:50:37 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Sidney Poitier was an activist both on screen and off, who opened doors with grace and humility for so many to follow. His thumbprint remains on much of Hollywood but also on much of this country through his fight for racial justice and civil rights. 1/ https://t.co/n3hIJVWqQk","date":"Mon Jan 10 21:50:26 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"We will continue the quest for justice and peace.","date":"Thu Jan 06 23:35:21 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"My thoughts are also with the families of the five officers who responded that day and later passed away as well as the hundreds of officers injured that day, some of whom have not yet healed.","date":"Thu Jan 06 23:33:06 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to thank those who protected the Capitol one year ago – and their families and loved ones who also shoulder the ongoing trauma from that day.","date":"Thu Jan 06 23:32:53 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Healing is not beyond our reach and unity not is out of our grasp – we just have to work for it, and that’s what we must continue to do.","date":"Thu Jan 06 23:32:32 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s important to understand that this fight is not over. We must be active in our duty to protect what we hold dear here in this country. \n\nI have the utmost faith that the House Select Committee, historically chaired by Congressman Bennie Thompson, will do just that.","date":"Thu Jan 06 23:31:52 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"I remember watching the violence that was taking place in the halls of Congress – in the very building I had assured my family was the safest place in the country.","date":"Thu Jan 06 23:30:40 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"What happened one year ago today was a national tragedy. \n\nI had just returned to my office from watching the proceedings in the House Chambers and saw the rioters breaking in the building on television.","date":"Thu Jan 06 23:30:23 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"On January 6, 2021, I wasn’t sad, I wasn’t scared -- I was mad. \n\nOne year later, I’m determined. \n\nPC: Erin Schaff, New York Times https://t.co/K8f2UaFJy1","date":"Thu Jan 06 23:30:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"A year ago today, a Black man and a Jewish man were elected to serve in the United States Senate on behalf of the state of Georgia.\n\nRemember that though our fight is long, change will come.","date":"Thu Jan 06 04:01:02 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"Starting this week, legislation we passed will go into effect to eliminate surprise medical bills that can bankrupt patients. The risk that an out-of-network doctor or hospital will send an extra bill after your stay is done.\nhttps://t.co/f4JdPpPv5Y","date":"Wed Jan 05 18:33:00 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is what happens when mental health services are scarce and difficult to access. \n\nIt is a tragedy that we find the resources to incarcerate but do not find the resources to treat mental illness. https://t.co/90SDFeRWDo","date":"Wed Jan 05 03:12:57 +0000 2022","user_id":"239949176"},{"handle":"RepKarenBass","text":"In 2021 we continued our attempts to return to a semblance of normal. While the coronavirus continues to deal us some setbacks, we have made undeniable progress this year.\n\nI hope everyone has a good weekend as we turn the page to a new year! https://t.co/hKG9hqaseO","date":"Fri Dec 31 21:25:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"After a second year of loss due to the pandemic, I know that this time of year is especially hard for so many families in Los Angeles. Wishing all who are celebrating today warmth and comfort. Merry Christmas.","date":"Sat Dec 25 18:06:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"And I love calling!\n\nIf you want to join me for upcoming events, sign up here: https://t.co/AhDJYUn6og","date":"Thu Dec 23 02:31:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Anti-Semitism has no place in our city, our state, or our country. https://t.co/5v4abun8PZ","date":"Thu Dec 23 01:57:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This year we've distributed hundreds of millions of doses of the vaccine, gotten grants and loans out to help millions of small businesses, passed legislation to bring jobs to L.A, and more.\n\nJoin me tonight for our End of Year Telephone Town Hall!\n\nMore: https://t.co/mMU4r53vnw https://t.co/RIDZhAaurp","date":"Tue Dec 21 19:53:55 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our businesses should not have to put up barbed wire to prevent crimes in their stores which is why I’ve just cosponsored legislation suggested by retail industry leaders in our area to make it harder for people to resell stolen merchandise, specifically online.","date":"Wed Dec 15 19:04:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to @esrailian, chief of @UCLA's Division of Digestive Diseases, for being recognized by Pope Francis last month for exceptional service to the Roman Catholic Church and becoming the first person of Armenian descent to receive the Benemerenti Medal. https://t.co/sqIpMkDXap","date":"Mon Dec 13 23:29:13 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every single Dreamer, TPS holder, farmworker, and essential worker in this country deserves a chance at the American Dream — and we have a chance to make that dream a reality.\n \nThe Senate must deliver a pathway to citizenship, because #TheMomentIsNow. https://t.co/yO8Tob74ke","date":"Tue Dec 07 18:02:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"RSVP below! \n\nENGLISH: Tuesday, December 7th at 11:00AM PST: https://t.co/i2wxtEFuaa\n\nSPANISH: Tuesday, December 7th at 6:00PM PST: https://t.co/LHw9fHfJa2","date":"Mon Dec 06 16:19:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Small businesses are a crucial component of our economy. \n\nTomorrow, @RepRoybalAllard and I will be hosting two online workshops — one in English, and one in Spanish — focused on providing resources for small business owners and non-profits recovering from the pandemic. https://t.co/UdXlsvoDiP","date":"Mon Dec 06 16:16:47 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"“Pro-life”","date":"Sun Dec 05 21:38:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Students across our country deserve to be safe in their schools. Families across this country deserve a government that will act. How many CHILDREN is too many? https://t.co/hXfVPcmx3y","date":"Fri Dec 03 15:54:59 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Those responsible must be held fully accountable. \n\nMy thoughts are with Mr. Avant, Nicole and Ted, Alex and the rest of the Avant family as they mourn the loss of such a wonderful wife, mother and friend. 3/3","date":"Wed Dec 01 18:13:07 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The devastating events of last night along with recent reports of brazen crime in Los Angeles rupture the expectation of safety we have for our friends, families and fellow Angelenos. \n\nAll of us have a right to be safe and last night was an absolute violation of that right. 2/","date":"Wed Dec 01 18:12:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’m heartbroken by this morning’s news of this tragic and shocking murder. \n\nMrs. Avant was a force of compassion and empowerment locally and nationally for decades, as well as a model of service and giving back to those who needed it most. 1/","date":"Wed Dec 01 18:12:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"When the Build Back Better Act is signed into law, no matter your insurance, you won't pay more than $35 out-of-pocket for insulin.","date":"Tue Nov 30 00:19:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wishing everyone celebrating the first night of Hanukkah tonight an evening of joy, peace and light. Hanukkah sameach!","date":"Mon Nov 29 01:43:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Those responsible must be held accountable. \n\nPublic safety and protecting the public’s health are my top priorities.","date":"Sun Nov 28 17:42:08 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today I’m thankful for family and I’m thankful for community. \n\nI hope everyone has a happy holiday!","date":"Thu Nov 25 19:08:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"My thoughts are with the friends and family of Ahmaud Arbery during this time, I wish them healing and comfort. \n\nMy full statement: https://t.co/Zw1kPH5LjE","date":"Wed Nov 24 22:27:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is illegal in this country to chase down a man in the middle of the street for no reason and kill him. \n\nIt is exhausting to have to hope this hard for something that simple to be affirmed in the court of law. \n\nI am glad the jury reached the right verdict.","date":"Wed Nov 24 22:26:20 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Missed tonight’s call but want to join our next one?\n\nSign up here: https://t.co/AhDJYUn6og","date":"Tue Nov 23 04:38:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There were more than 15,000 people on the telephone town hall I just hosted tonight about the Build Back Better Act.\n\nI asked them if they wanted to see the Senate pass our bill. 98% of them said yes.\n\nLet’s get this done.","date":"Tue Nov 23 03:34:47 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Friday, we passed the Build Back Better Act, which will make transformational investments in affordable housing, childcare, paid leave, climate action, and immigration reform. \n\nJoin me tonight to discuss the ways our communities will benefit: https://t.co/isELL3pFIf https://t.co/1Pto6skOQw","date":"Mon Nov 22 19:56:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thousands will protest this injustice throughout the country to express the pain and hurt caused by this verdict. \n\nI urge those participating to be peaceful, with purpose and hope.\n\nJustice will be won. 2/2\n\nFull statement: https://t.co/HAiDihpMMD","date":"Fri Nov 19 22:25:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The verdict in this trial gives a green light to people throughout the country who want to bring weapons to protests and murder people.\n\nIt emboldens vigilantism.\n\nWhere this jury had an opportunity to hold a person who killed two people accountable for his actions, it failed. 1/","date":"Fri Nov 19 22:22:43 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, we passed legislation with transformational investments in affordable housing, childcare, paid leave, climate action, and immigration reform.\n\nThis bill will impact millions. We need swift action in the Senate so we can cut costs and deliver for the people.","date":"Fri Nov 19 16:01:48 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I said it on Monday, I'll say it again on Friday: \n\nNever doubt Madam @SpeakerPelosi!","date":"Fri Nov 19 15:40:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It made no sense that the people living in our neighborhoods couldn't be prioritized for the jobs in our neighborhoods. \n\nWith my local hire provision signed into law, the people of Los Angeles can be prioritized for the jobs in Los Angeles. https://t.co/S7jRy3FmUB","date":"Wed Nov 17 18:28:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to give my heartfelt condolences to the victims, their families, and the people of Uganda. I will continue to support the people of Uganda and the government’s investigation in bringing those responsible to justice.","date":"Wed Nov 17 01:31:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"If there’s a transit or highway project that’s being paid for by local taxpayer dollars in West Los Angeles, West Los Angeles residents should be able to be first in line to get the jobs that are being created. \n\nWith the local hire provision signed into law, they can be. https://t.co/DLemV6aZ6A","date":"Mon Nov 15 23:58:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The biggest investment in these areas in DECADES.","date":"Mon Nov 15 22:36:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Bipartisan Infrastructure Deal is now law.","date":"Mon Nov 15 21:35:07 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"A historic day here at the White House as President Biden signs the Infrastructure Investment and Jobs Act into law.\n\nNever doubt Madam Speaker! https://t.co/knia0Gex2m","date":"Mon Nov 15 20:54:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"When President Biden signs the infrastructure bill in a few hours, he will also be signing my bill to allow transit agencies to prioritize the hiring of community members who actually live in the community where the transit project is happening.\n\nWe're bringing jobs home to L.A. https://t.co/7BL1URqX2W","date":"Mon Nov 15 19:24:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"If you didn’t file taxes in the last two years, TODAY is the LAST DAY in 2021 to see if you qualify to join the 61 million families receiving this monthly check. \n\nCheck to see if you qualify for hundreds of dollars here:\nhttps://t.co/ugF02gwRcA","date":"Mon Nov 15 16:17:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Transit agencies should be able to prioritize the hiring of community members who actually live in the community where the project is happening.\n\nTomorrow, President Biden will sign the Infrastructure Investment and Jobs Act into law, which includes my bill to make that happen. https://t.co/UP1B5ZTwdJ","date":"Sun Nov 14 18:14:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"To all who served — thank you for your service.","date":"Thu Nov 11 18:32:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"A few years ago, Fmr. Army Specialist William Manheim reached out to my office for assistance with an issue he was facing.\n\nIn 2019, he came to one of the last in-person events our office did before the pandemic. This is what he said. https://t.co/WietTvlohl","date":"Thu Nov 11 18:31:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Happy #VeteransDay to all who have served. \n\nUnfortunately too many of our Vets are unhoused. Last month we urged the White House to take action and after meeting with my colleagues and I in Los Angeles, they did.","date":"Thu Nov 11 18:24:16 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tonight I’m hosting a telephone town hall about the once-in-a-generation investment in the infrastructure of this country. We’ll be joined by LA Metro CEO Stephanie Wiggins. RSVP before 4pm to make sure your number is on our call list! \n\nRSVP: https://t.co/TfmfZfUOsJ https://t.co/LBynKCwHj9","date":"Mon Nov 08 20:34:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I've worked to improve our child welfare system for decades. If we don't extend resources for foster youth as we recover from the pandemic, that will mean more people on the street.\n\nIn order to fully address homelessness, we have to prevent it from happening in the first place. https://t.co/cd26Ih4BRX","date":"Sat Nov 06 17:44:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"AND about the passage of the once-in-a-generation infrastructure bill. \n\nThis isn’t just about roads and bridges -- this is about bringing jobs home and enhancing the very fiber of our city.\n\nTune in around 8:15 AM PT this morning!","date":"Sat Nov 06 14:16:43 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This means billions of dollars for projects like the Purple Line extension in L.A. and also JOBS. \n\nThe people of Los Angeles have demanded action and tonight that’s exactly what we’ve delivered.","date":"Sat Nov 06 03:49:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The economy gained more than half a million jobs last month.","date":"Fri Nov 05 22:11:59 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Los Angeles Times looked at 44,000 bike stops logged by the Sheriff’s Department since 2017. \n\n7 in every 10 of those stops involve Latino cyclists. That’s absolutely unacceptable. \n\nWhy would you even need to stop and frisk a bike rider?\nhttps://t.co/ThLNHm72MG","date":"Thu Nov 04 21:52:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to support this effort -- the risk of not appropriately addressing climate change outweighs any other risk we are facing.","date":"Tue Nov 02 20:21:08 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Violence intervention workers are on the front lines of gun violence prevention around the country. \n\nThank you for meeting with me yesterday to talk about strategies to address rising crime that actually work. https://t.co/APxvoRHO5j","date":"Fri Oct 29 23:39:30 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Anti-Semitism is real. In some form or other, it affects the Jewish community every day. We must not forget that, especially as we remember those lost three years ago. May their memories be a blessing. 7/7","date":"Wed Oct 27 22:09:56 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"May 18th, 2021: Diners outside a sushi restaurant just north of my district were attacked by people shouting slogans against Israel. The incident was being investigated by Los Angeles police as an anti-Semitic hate crime. 6/ https://t.co/wJngOMBjFo","date":"Wed Oct 27 22:09:39 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"December 28th, 2019: An intruder broke into a Rabbi’s home during a Hanukkah party, stabbing and wounding five in New York. 5/ https://t.co/klcew3AudO","date":"Wed Oct 27 22:08:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"December 14th, 2019: A man vandalized Nessah Synagogue in Beverly Hills. 4/ https://t.co/NFujgndHf0","date":"Wed Oct 27 22:08:27 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"April 27th, 2019: A 19 year-old opened fire while shouting anti-Semitic slurs on the last day of Passover, killing a 60 year-old woman, and injuring the Rabbi and two others at a synagogue in Poway, California. 3/ https://t.co/QXoHjHmnk4","date":"Wed Oct 27 22:08:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Everyone in this country deserves to feel safe in their homes, in their neighborhoods, and in their places of worship – but anti-Semitism is on the rise. 2/","date":"Wed Oct 27 22:07:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks 3 years since the mass shooting at the Tree of Life Synagogue in Pittsburg, Pennsylvania -- the deadliest anti-Semitic attack in our nation’s history. 1/ https://t.co/1U5I7Emqbv","date":"Wed Oct 27 22:07:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We’ve been calling for action to assist the unhoused veterans sleeping next to the VA in West L.A. \n\nSecretary McDonough was willing to answer our call — he was willing to have us show him the situation and then work with us as we follow through with action. 1/","date":"Thu Oct 21 00:14:31 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am currently working on different pieces of legislation that would increase access to clean and renewable energy, protect our oceans and forests, and reduce our carbon emissions. \n\nThese are all crucial elements in the fight against climate change.","date":"Wed Oct 27 18:54:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Earlier this year, I chaired a hearing examining ways we can combat climate change with our international partners. We must act on this important issue. 2/2 https://t.co/ZFBKqw782U","date":"Wed Oct 27 18:44:54 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Federal policy is crucial in combating climate change. Congress should be doing all it can to address this crisis. That means passing legislation that takes this crisis seriously. That also means collaborating internationally. 1/","date":"Wed Oct 27 18:43:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This existential threat deserves bold action -- that's why I support the Biden administration’s plan to cut climate pollution in at least half by 2030.","date":"Wed Oct 27 18:34:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It also allows Americans to legally fight back against policies that disproportionally impact marginalized communities. 3/3 https://t.co/5IMXPXKYuV","date":"Wed Oct 27 18:15:39 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"That’s why I’ve cosponsored the Environmental Justice for All Act. This bill directs federal programs to work with marginalized communities as we move towards new energy sources. 2/ https://t.co/b8Hf6Ozv1F","date":"Wed Oct 27 18:14:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The US officially re-entering the Paris Agreement was a crucial step in claiming our leadership role in the global fight to save our planet. \n\nBut there’s still work to be done. We must do this in a just &amp; equitable way. 1/","date":"Wed Oct 27 18:14:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The site was shut down and will not be able to reopen until standards are met to guarantee the safety of our community. \n\nThe people have the power. 3/3","date":"Wed Oct 27 18:03:36 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"In 2013, families in my district were getting sick because of a nearby urban drilling site. When I visited the site, I was shocked to see what was occurring and called for federal intervention. 2/ https://t.co/qythmHVZmw","date":"Wed Oct 27 18:03:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Individual action leads to change. \n\nWe will only successfully address this issue if the people make their voices heard. 1/","date":"Wed Oct 27 18:02:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today we are introducing the Public Service Freedom to Negotiate Act to ensure public service workers have the right to stand together and demand better work conditions. \n\nI #StandWithPublicWorkers.","date":"Tue Oct 26 19:31:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Disproportionate and excessive use of force by police is detrimental to our children's trust in law enforcement. https://t.co/CNOyRkBSgy","date":"Mon Oct 25 18:03:49 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is why Congress acted earlier this year to pass a bill to counter the rise in anti-Asian hate crimes across this country. \n\nThis is absolutely unacceptable.","date":"Mon Oct 25 16:34:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Yesterday, there was a news story written about a 6 year-old girl who couldn't be handcuffed by law enforcement because her wrists were too small. \n\nToday, I asked the Attorney General about it. https://t.co/KfTaQPX4M6","date":"Thu Oct 21 18:24:54 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"LEADERSHIP.","date":"Thu Oct 21 13:39:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"7 years ago today, Laquan McDonald was shot 16 times while walking away from a police officer.\n\nThe House passed the George Floyd Justice in Policing Act twice but we were stopped in the Senate. We’re now working with the White House to do everything possible to curb brutality. https://t.co/1cdrD39oYn","date":"Thu Oct 21 03:55:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This crisis is not going to go away overnight, it's going to take concerted efforts at all levels of government in collaboration with outside groups to get this done. Addressing this crisis cannot wait. \n\nThank you @SecVetAffairs for your action today. 4/4","date":"Thu Oct 21 00:19:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"What the Secretary is announcing today is ambitious but the exact kind of leadership needed to get folks in homes. 3/\nhttps://t.co/Ji251VYpeu","date":"Thu Oct 21 00:18:36 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"When he toured the VA Greater Los Angeles Healthcare System earlier this month, my colleagues and I urged him to take bold and swift action on the crisis on our hands here in Los Angeles. 2/\nhttps://t.co/afQ259gBNy","date":"Thu Oct 21 00:16:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We’ve been calling for action to assist the unhoused veterans sleeping next to the VA in West L.A. \n\nSecretary McDonough was willing to answer our call — he was willing to have us show him the situation and then work with us as we follow through with action. 1/","date":"Thu Oct 21 00:14:31 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Earlier this week I toured the VA Greater Los Angeles Healthcare System with @SecVetAffairs and House Committee on Veterans’ Affairs Chairman @RepMarkTakano to discuss what’s working and what’s not in our effort ensure those who served our country have access to housing. https://t.co/ZedivJi6wP","date":"Fri Oct 08 21:59:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Attorney General Merrick Garland will be testifying before the House Judiciary Committee tomorrow and I intend on entering this report into the hearing record. \n\nThese are CHILDREN. We have to do better.","date":"Wed Oct 20 21:32:06 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Immigrants are essential — to our economy, and to our recovery from COVID-19.\n\nIt's past time we deliver real immigration reform.\n\n#TheMomentIsNow https://t.co/0aNfa1Ieoj","date":"Wed Oct 20 15:41:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you @SenatorMenendez, @SenatorRisch, Senator @ChrisVanHollen, and @SenatorRounds for advancing the YALI Act to strengthen our partnership with Africa.\n\nThe Young African Leaders Initiative invests in the next generation and our future.\n\nLet’s get this bill to @POTUS's desk.","date":"Tue Oct 19 21:23:33 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want everyone to remember that this is not the trial of Ahmaud Arbery. This is the trial of three men who killed him. \n\nMy thoughts are with Ahmaud’s family during this impossibly difficult time. \n\nThere will be justice. https://t.co/KsQEv5xWAc","date":"Mon Oct 18 23:53:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The #FreedomToVote Act will restore the promise of democracy for all Americans. \n\nThe Senate must pass this legislation to protect the fundamental right to vote.","date":"Mon Oct 18 18:56:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I agree with @POTUS. \n\n“The contributions that Indigenous peoples have made throughout history — in public service, entrepreneurship, scholarship, the arts, and countless other fields — are integral to our Nation, our culture, and our society.”\n\n#IndigenousPeoplesDay","date":"Mon Oct 11 16:22:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Attacking this crisis requires response from all levels of government. \n\nThank you Secretary McDonough for coming to Los Angeles and making this issue a priority.","date":"Fri Oct 08 22:01:24 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Earlier this week I toured the VA Greater Los Angeles Healthcare System with @SecVetAffairs and House Committee on Veterans’ Affairs Chairman @RepMarkTakano to discuss what’s working and what’s not in our effort ensure those who served our country have access to housing. https://t.co/ZedivJi6wP","date":"Fri Oct 08 21:59:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Malaria kills approximately 500,000 people annually. \n\nI’m encouraged by the @WHO endorsing a vaccine and I hope that this will lead to expansive and equitable distribution of the vaccine throughout Africa.","date":"Thu Oct 07 19:28:58 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I urge the Government of Ethiopia to commit to the preservation of life and dignity and work with the United Nations and humanitarian organizations to deliver food, medicine, and other lifesaving aid to those who need it most.","date":"Sun Oct 03 21:03:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am deeply concerned by the decision of the Government of Ethiopia to expel seven United Nations officials. These actions only frustrate international efforts to support the millions of civilians who have been displaced and face famine conditions because of the current conflict.","date":"Sun Oct 03 21:03:23 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to earn a 100% mark on the @HumaneSociety’s legislative scorecard – reflecting a commitment to animal protection and making the world a more humane place. https://t.co/XvBG1UqSly","date":"Fri Oct 01 21:57:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Voted to keep the government OPEN today to make sure our seniors keep getting their social security checks, our veterans keep getting their benefits, and our city's ability to recover from this pandemic continues.","date":"Thu Sep 30 22:33:27 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tomorrow, an estimated 20,000 foster youth will abruptly lose access to care in a single day because pandemic resources for transition-age foster youth were not extended. \n\nCongress must pass our bill to extend Chafee COVID relief for foster youth. #ReUpChafee #FosterYouthVoices","date":"Thu Sep 30 16:48:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, I signed on to a letter led by @RepJudyChu asking the Department of Defense for answers and information regarding this strike in hopes of preventing deadly mistakes like this in the future.\nhttps://t.co/KYpl0CWGsV","date":"Wed Sep 29 17:31:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Registering to vote and updating your voter registration information are the first steps to making your voice heard in upcoming elections. Register to vote at https://t.co/2Ue8lRgIJ1","date":"Tue Sep 28 14:49:20 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is #NationalVoterRegistrationDay! This year, I voted for #HR1 to expand online, automatic, and same-day voter registration nationwide, and #HR4, the John R. Lewis Voting Rights Advancement Act of 2021.","date":"Tue Sep 28 14:49:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to @JNkengasong on being appointed by to lead @PEPFAR. \n\nMost PEPFAR programs are in Africa and having a renowned virologist from the continent shows the United States’ commitment to renew &amp; strengthen our mutual strategic partnership.\nhttps://t.co/wyW4io4nSu","date":"Tue Sep 28 00:55:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last week, I hosted a telephone town hall with more than 15,000 constituents. \n\nThe number one issue brought up was homelessness. \n\nThis is a humanitarian crisis and needs to be treated as such.","date":"Mon Sep 27 18:09:33 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to support my friend @RepJudyChu in this important effort.","date":"Fri Sep 24 19:29:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We now call on President Biden and the White House to use the full extent of their constitutionally-mandated power to bring about meaningful police reform.","date":"Thu Sep 23 04:26:06 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We passed the George Floyd Justice in Policing Act more than 200 days ago.\n\nI’m not asking our communities to wait 200 more.","date":"Thu Sep 23 04:23:57 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I was proud to join Speaker Pelosi in welcoming President João Lourenço of Angola to the United States Capitol yesterday. \n\nTwo weeks ago, I led a delegation to Angola to strengthen commercial and economic relations and I was pleased to follow up on our previous discussions. https://t.co/QmGJIfkEn9","date":"Wed Sep 22 14:55:04 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I got vaccinated to protect myself and those around me. We have to come together to protect our communities. \nhttps://t.co/wQj7H0mGUX","date":"Tue Sep 21 15:26:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today also marks the beginning of #HispanicHeritageMonth -- an important time to come together and recognize the rich contributions of Hispanic communities throughout our country, and their influence on the history, culture, and achievements of the United States.","date":"Thu Sep 16 05:47:39 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Feliz bicentenario to the people of Costa Rica, El Salvador, Guatemala, Honduras and Nicaragua living in Los Angeles, and all over the country, celebrating 200 years of independence today!","date":"Thu Sep 16 05:28:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"As the sun sets on Los Angeles this evening, I want to wish all those observing Yom Kippur a reflective and peaceful holiday and a meaningful fast. \n\nG'mar chatimah tovah.","date":"Thu Sep 16 02:02:32 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We remember.\n\n#NeverForget. https://t.co/Fd4Xijkzw4","date":"Sat Sep 11 15:34:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"A pathway to citizenship for undocumented people will advance our economic recovery from the pandemic, reduce our national deficit, and raise wages.\n\nThis is something that helps everyone.\n\nLet’s get it done. https://t.co/WiCBDU2xBo","date":"Thu Sep 09 22:03:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The COVID-19 vaccine is scientifically proven and safe. That’s not all you need to do to stay healthy, though. We want you to stay well. For that, you need coverage.\nhttps://t.co/XSOSwtiojv","date":"Thu Sep 09 18:51:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last week, I introduced bipartisan legislation to put $1.6 billion over five years to combat trafficking in the United States. \n\nIt is not enough just to rescue people. You have to prevent trafficking from happening again. That's what we seek to do. \nhttps://t.co/K4DdlJB4CQ","date":"Thu Sep 09 02:32:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us tonight for this important discussion! \n\n@CHIRLA @CoCoSouthLA #WeAreHome https://t.co/FKdm9lbI3Q","date":"Wed Sep 08 19:43:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to lead on this important issue with @RepAdams, @SenatorWarnock, and our Senator @SenAlexPadilla. \n\nWe have to address disparities in our health care system.","date":"Wed Sep 08 18:34:39 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wishing everyone celebrating Rosh Hashanah a joyous and sweet new year full of hope, faith and community. L’Shanah Tovah!","date":"Tue Sep 07 14:00:23 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"To all who marched, advocated, organized and sacrificed -- thank you.\n\nHappy Labor Day. https://t.co/WAC6iI3yVi","date":"Mon Sep 06 15:19:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Pop quiz.\n\n#BansOffOurBodies https://t.co/5X1mRFhEfy","date":"Sun Sep 05 17:13:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"My thoughts are with Louisiana as they recover from this horrendous storm. \n\nI’m grateful they have strong leaders like @RepTroyCarter to get them through. \n\nIf you have family or friends in the state, make sure they have access to the below information.","date":"Sat Sep 04 15:38:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The housing crisis impacts our young people too. \n\nThanks to @SafePlace4Youth for showing me around and for providing important resources to young people in our area. https://t.co/fXOZxfDMuz","date":"Sat Sep 04 13:10:54 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is absolutely unacceptable that young people in this country have to go to school in fear of gun violence in our schools and gun violence in our communities.\nhttps://t.co/kj6MekRWaA","date":"Fri Sep 03 01:55:04 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There is no circumstance in which law enforcement officers are qualified to do this----only licensed medical professionals should order or administer medications. \n\nThe indictment of these officers is the first step toward justice for Elijah McClain. 2/2","date":"Thu Sep 02 15:00:33 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Elijah's death revealed police officers in several cities across the country are ordering paramedics to administer medications to subdue people they determine are out of control. \n\nThat’s unacceptable. 1/\nhttps://t.co/qXQX8jNnJU","date":"Thu Sep 02 15:00:19 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This applies to all children – no matter what they look like or where they grow up. I’m proud to join my colleagues in introducing the Second Chance For Justice package to narrow the pipeline of children entering the criminal justice system. 2/2","date":"Fri Aug 13 16:46:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"After decades of increasingly punitive and failed juvenile justice policies, it’s time to take a step in a direction that recognizes that children have enormous potential for rehabilitation, change, and growth, and that we can do better to meet their developmental needs. 1/ https://t.co/uoWQHlvtZd","date":"Fri Aug 13 16:38:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I hope these convictions bring the friends and family of Gemmel Moore, Timothy Dean, and others, whose names we may never know, a small bit of comfort and peace. 5/5","date":"Wed Jul 28 19:42:01 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you to the community that tirelessly sought justice — especially activists like Jasmyne Cannick — and to the courageous victims and survivors who shared their stories and spoke their truth. 4/","date":"Wed Jul 28 19:41:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Timothy Dean might be alive today and so many others wouldn’t have had to be subjected to Ed Buck’s violently racist traumatic abuse if justice had been served. 3/","date":"Wed Jul 28 19:41:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is an absolute tragedy he was allowed to continue to prey on vulnerable, young Black men and that he wasn't arrested and stopped immediately after he killed Gemmel Moore. 2/","date":"Wed Jul 28 19:41:24 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"FINALLY murderer Ed Buck is convicted after mountains of evidence, including 2,400 videos on his computers and phones, were brought to light. 1/\nhttps://t.co/itp7TseLNA","date":"Wed Jul 28 19:41:05 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"After decades of underinvestment, our roads, bridges, transit, and rail are in trouble. Congress must step up to answer the call. \n\nThe #INVESTAct will fix our ailing infrastructure AND transform it for the future.","date":"Tue Jul 27 18:34:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need a permanent solution NOW. Congress must provide a pathway to citizenship. It can’t wait.","date":"Fri Jul 16 22:25:19 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Parents, help is here! Many families will be receiving a tax cut under the expanded Biden #ChildTaxCredit thanks to the American Rescue Plan. Go to https://t.co/kzROP7dHpH to find out more!","date":"Fri Jul 16 17:51:07 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Learn more at https://t.co/kzROP7vihf","date":"Thu Jul 15 18:52:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to stand with @SpeakerPelosi and my colleagues on such an important day for so many families across this country.","date":"Thu Jul 15 16:41:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Mark July 15th on your calendar! Eligible families will receive monthly payments (via direct deposit or mail) up to $250/child between the ages of 6-17 or up to $300/child under the age of 6. Find out more at https://t.co/kzROP7vihf.","date":"Wed Jul 14 19:14:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us tonight!","date":"Tue Jul 13 21:37:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We worked to expand the #ChildTaxCredit and help families make ends meet while raising children. \n\nEvery single Republican in Congress voted against it.\n\nFind out more about this major tax cut for working families at https://t.co/kzROP7vihf.","date":"Mon Jul 12 18:01:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I'll be hosting a virtual town hall on Tuesday with @SenAlexPadilla and @JonesSawyerAD59 to discuss the latest in DC and Sacramento.\n\nRSVP today: https://t.co/ZBXSWcIl6K https://t.co/NvUZgSeu8f","date":"Fri Jul 09 17:00:58 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I offer my condolences to the people of Haiti on the assassination of President Moïse. Those responsible for this unthinkable act of violence should be brought to justice. It is important that all parties involved find peaceful solutions to their political differences.","date":"Thu Jul 08 20:03:36 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"In addition to celebrating today, we must continue to fight for a country in which everyone is free and everyone is equal. Happy July 4th!","date":"Sun Jul 04 19:23:15 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This morning I voted YES on our transportation and water infrastructure bill focused on improving and repairing roads, bridges, transit and rail, and ensuring clean drinking water.\nhttps://t.co/o1tV27ETjU","date":"Thu Jul 01 19:33:13 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The United States House of Representatives has twice passed the George Floyd Justice in Policing Act – the first time was one year ago today. \n\nWe have to get this bill to the President’s desk. 2/2","date":"Fri Jun 25 23:42:40 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Derek Chauvin murdered George Floyd in broad daylight and acted with impunity. The sentencing today represents progress but there is still a long way to go. \n\nAccountability for murdering an unarmed Black man should not come as a surprise, it should be expected. 1/","date":"Fri Jun 25 23:42:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud of my friend @HampDellinger for being nominated to be the next Assistant Attorney General for the Office of Legal Policy at the Department of Justice.\n\nHe’s a man of great character and I look forward to working with him as he pushes for greater diversity in the judiciary.","date":"Wed Jun 23 16:40:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Excited about the first-ever Los Angeles County Youth Commission, which will work to transform Los Angeles County's child welfare and juvenile justice system through youth empowerment. \nhttps://t.co/vrE1Af5NFW","date":"Wed Jun 23 15:33:01 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The #ChildTaxCredit is coming to working and low-income families on July 15. These payments will help families:\n🍲 put food on the kitchen table\n⛽ put gas in the car\n🧒🏻 pay for child care services.\n\nLearn more: https://t.co/kzROP7dHpH","date":"Mon Jun 21 18:21:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Part of addressing these impacts is understanding the honest history of this country, which is what makes today so important.\n\nHappy #Juneteenth!","date":"Sat Jun 19 14:38:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Slavery to this day is talked about and discussed as an institution of the distant past -- a mistake that our country has made right and fixed.\n\nBut the truth is, the legacy of slavery lives on and has shaped, in part, the world we live in today. 2/","date":"Sat Jun 19 14:37:42 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"For centuries, the sometimes dark history of this country has been sanitized or even flat-out denied. \n\nSome state legislative bodies are actively trying to continue those efforts as we speak. 1/","date":"Sat Jun 19 14:37:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It was an honor to watch @POTUS sign the Juneteenth National Independence Day Act into law yesterday. https://t.co/i4G7TOuKTd","date":"Fri Jun 18 13:08:01 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is are absolutely inexcusable and has no place in our district.","date":"Wed Jun 16 19:14:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"#Juneteenth should be a federal holiday.","date":"Wed Jun 16 16:56:36 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Looking forward to participating in this important discussion!","date":"Wed Jun 16 16:19:48 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"9 years ago, DACA was created to protect young people who have known only this country as their home. \n\nWe must get the Dream &amp; Promise Act and the #USCitizenshipAct signed into law.","date":"Tue Jun 15 21:45:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to introduce the Community-Based Response Act with @ChrisVanHollen today. \n\nMany crisis situations don’t require a police response. \n\nThis bill will provide new community-based alternatives.","date":"Mon Jun 14 22:53:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"600,000 people have died from COVID-19 in the United States. \n\nAbsolutely devastating.\nAbsolutely unacceptable.","date":"Mon Jun 14 16:34:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The unemployment rate is the lowest since the pandemic started.","date":"Fri Jun 04 16:20:35 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is a step towards ending the pandemic worldwide. I applaud the Biden administration for making this decision. This is what global leadership looks like.","date":"Thu Jun 03 20:27:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, we honor and remember those who made the ultimate sacrifice as a grateful nation. #MemorialDay","date":"Tue Jun 01 00:16:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is absolutely unacceptable. Acts of anti-Semitism must be condemned and prosecuted to the furthest extent of the law.\nhttps://t.co/ZPrZ7DHqYt","date":"Sun May 30 04:05:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to commend the Biden administration and the @DFCgov for making this important move that represents a welcome shift towards promoting trade between the United States and Africa while working tirelessly with our global partners to bring an end to the COVID-19 pandemic.","date":"Fri May 28 19:06:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"My heart breaks for the San Jose community and the families impacted by this tragedy.\n\nGun violence has plagued this country for too long. President Biden is ready to sign a bill to address this issue. \n\nLet’s get this done.","date":"Wed May 26 22:28:46 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I would like to express my deepest condolences to the families, the government, and the people of Nigeria on the sudden deaths of Lt. General Ibrahim Attahiru and the other victims during a tragic plane crash. https://t.co/P8zIj2spHO","date":"Tue May 25 20:26:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Assistant Attorney General Kristen Clarke.\nhttps://t.co/9cjFu2cUAR","date":"Tue May 25 20:14:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Since George Floyd’s murder one year ago today, there have been hundreds of officer-involved deaths in the U.S. \n\nTo stop this, we need to bring transparency and accountability to policing. \n\nThe George Floyd #JusticeInPolicing Act does that. We need to get it signed into law.","date":"Tue May 25 11:31:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The judge didn’t even consider George Robinson's life to be worthy of a trial.\n\nThis is why we need reform.\nhttps://t.co/0IMwrd4dK1","date":"Tue May 25 00:58:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Additional footage of what appears to be a Jewish man on foot being chased by cars waving Palestinian flags is abhorrent.\n\nEvery member of our community should feel safe walking down the street no matter their faith, origin or background. This rash of violence and fear must stop.","date":"Fri May 21 23:35:41 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Based on allegations and video evidence of what transpired at Sushi Fumi this week, I support the investigation being conducted and fully expect justice to be served.","date":"Fri May 21 23:35:06 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There is absolutely no place for hate crimes or anti-Semitism in our city.\nhttps://t.co/Rxsx6wydDO","date":"Fri May 21 23:33:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"OK, OK. I'm sorry. I'm scared. Officer, I'm scared, I'm your brother, I'm scared.\"\n\nWe need to get legislation that will hold officers accountable signed into law.","date":"Thu May 20 21:36:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Michael Brown would have turned 25 years old today.\n \nWe have not forgotten you. There must be justice. https://t.co/LN17PKRcVC","date":"Thu May 20 18:31:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"These obstacles without adequate resources make it more likely for people to reoffend. \n\nThe bill we have introduced today fights back against that statistic and helps people get back on their feet and reintegrated into society in a productive way. 2/2\nhttps://t.co/xAV5NUlZcj","date":"Thu May 20 15:04:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our society presents countless obstacles for individuals who have already paid their debts to society: it’s harder for them to find jobs, it’s harder for them to find housing, and it’s harder for them to be able to pay for a quality education. 1/","date":"Thu May 20 15:02:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"According to the American Academy of Diplomacy, out of 189 ambassadors recently serving overseas, only 3 were African American career diplomats, and just 4 were Hispanic.\n\nAt its core, this bill seeks to bolster the number, caliber, and skills of our diplomats. https://t.co/d4kY9CO9jk","date":"Wed May 19 22:40:05 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to support @RepJudyChu, @RepGraceMeng and so many others in this important effort.\n\nI will be voting YES.","date":"Tue May 18 17:05:23 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you to @SylviaFowles for sharing your story.\n\nStream the full discussion about what we can do to reform police practices in this country on @RISEtoWIN’s page on Wednesday at 7p ET / 4p PT.","date":"Mon May 17 17:55:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Children should not be criminalized for being children. \n\nThank you Bryan Stevenson for your testimony today. @eji_org https://t.co/ncvsqW9eUI","date":"Fri May 14 03:05:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"#EidMubarak to all of those celebrating. Wishing wellness and peace for you and your loved ones. https://t.co/KYbpvO8xyg","date":"Thu May 13 22:52:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you @ClimateEnvoy @JohnKerry for ensuring that the United States gets back to leading in the fight against climate change. https://t.co/LEB86GHqQf","date":"Thu May 13 20:16:40 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Good.","date":"Fri May 07 20:02:57 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"One week ago, Derek Chauvin was convicted of his crimes. \n\nOur work is not done. \n\nWe need #PoliceReformNOW. \n\nWe need the George Floyd #JusticeInPolicing Act signed into law.","date":"Tue Apr 27 18:07:42 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It shouldn't take the torture and murder of someone for over nine minutes to bring about change.","date":"Tue Apr 27 15:04:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have to find a way to hold officers accountable so they will stop shooting people.","date":"Mon Apr 26 18:51:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"They’re not.","date":"Sun Apr 25 13:45:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks 106 years since the murder of 1.5 million Armenians in the first genocide of the 20th century. \n\nThat’s what happened. \n\nI am proud to stand with President Biden in acknowledging the truth. \nhttps://t.co/yR5uXGR1bh","date":"Sat Apr 24 15:25:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"How many more videos of people being killed by police do we need to see before Congress acts?","date":"Sat Apr 24 05:41:29 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"REMINDER: Police officers are in favor of police reform.","date":"Wed Apr 21 16:53:49 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must continue the fight to get the George Floyd Justice in Policing Act signed into law so that a verdict like the one today doesn’t come as such a surprise or such a relief.\n\nAccountability should be expected.\n\nAccountability should be the law.\n\n#PoliceReformNOW https://t.co/0wIaJEeb1T","date":"Wed Apr 21 11:57:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The United States House of Representatives has twice passed the George Floyd Justice in Policing Act. \n\nWe must continue this fight – so that rulings like today’s verdict, don’t come as such a surprise or such a relief. \n\nJustice in this country should come as expected, for all.","date":"Tue Apr 20 23:07:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"But as we exhale from the relief of justice finally being delivered in a case like this, we have to remain focused on the sentencing, which I believe should be the maximum.","date":"Tue Apr 20 23:06:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thirty years ago, Rodney King was brutally beaten by police. The video of the assault shocked the world, but not the jury, who let every single police officer responsible roam free.\n\nToday is different. \n\nDerek Chauvin murdered George Floyd and has been convicted of his crimes.","date":"Tue Apr 20 23:05:07 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"GUILTY.\n\nGUILTY.\n\nGUILTY.","date":"Tue Apr 20 22:06:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Freddie Gray was killed in the back of a police van and died six years ago today. All of the officers were let off. \n\nThe George Floyd #JusticeinPolicing Act will hold officers accountable. https://t.co/xFhwMSSdFs","date":"Mon Apr 19 20:01:32 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Proud to be in Minnesota today with the @NAACP and President Derrick Johnson to meet with community leaders and discuss local and federal steps we can take to bring change to our policing system. https://t.co/BJdDKA0FvQ","date":"Mon Apr 19 14:40:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have got to come up with a solution to curb police brutality. Congress has got to act. Lives depend on it. https://t.co/6vfqRzeLPm","date":"Sun Apr 18 15:44:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Preventing gun safety measures from being signed into law has real consequences. \n\nI’m devastated for the Indianapolis community. https://t.co/U5K1nCCa4E","date":"Fri Apr 16 18:29:27 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Adam Toledo was 13 years old. \n\nThose responsible for taking the rest of his life away from him must be held accountable. \n\nWe have to get the George Floyd Justice in Policing Act signed into law.","date":"Thu Apr 15 22:17:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Carbon monoxide???\n\nTHERE. WAS. A. KNEE. ON. GEORGE. FLOYD’S. NECK. \n\nDEREK. CHAUVIN. MURDERED. GEORGE. FLOYD.","date":"Wed Apr 14 17:04:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Dr. David Fowler is a paid witness currently being sued for covering up the murder of Anton Black. This man has blamed Black men for their own death in the past.  \nhttps://t.co/rG4VYJVjK6","date":"Wed Apr 14 16:22:32 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The officer that shot Jacob Blake in the back 7 times was allowed to go back to work because there’s no national standard for policing. \n\nThe George Floyd #JusticeinPolicing Act would change that.","date":"Wed Apr 14 01:10:49 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Daunte was pulled over and tragically killed all because he had air fresheners in his rearview mirror. \n\nWe need to reform our system NOW. \n\nWe need to pass the George Floyd Justice in Policing Act into law NOW.","date":"Mon Apr 12 23:31:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Then the police said it was because of expired tags.\n\nDMVs across the country have a backlog because of the pandemic. \n\nIt’s hard for me to believe that officers are pulling over every car that they see with expired tags.","date":"Mon Apr 12 23:30:59 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The @ACLU released a statement yesterday saying that police use this air freshener law often to target Black people. https://t.co/AXJy4bfJwI","date":"Mon Apr 12 23:29:16 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Daunte’s mother said that her son called her after being pulled over and told her he had been stopped because of air fresheners hanging from his rearview mirror. \n\nAir fresheners. \nhttps://t.co/Guorzd5g1U","date":"Mon Apr 12 23:28:31 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The question about how you could grab the taser and not the gun is necessary and important but to really reform the system of policing, we have to ask:\n\nWhy was Daunte Wright even stopped in the first place?","date":"Mon Apr 12 23:27:17 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to wish all who are celebrating Ramadan a peaceful fast that brings you closer to your community and closer to your faith. As this pandemic continues, I know you won’t be able to celebrate together as in years past, but know that we are almost through! Ramadan Mubarak! https://t.co/3OzyapiAtG","date":"Mon Apr 12 22:18:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The George Floyd Justice in Policing Act makes it so that when an officer is reckless and kills or brutalizes someone, they are prosecuted and convicted.\n\nThe police officer who killed Daunte Wright should be prosecuted and convicted.","date":"Mon Apr 12 19:33:30 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The police officers that assaulted Lieutenant Caron Nazario should be held accountable for their actions. We must pass the George Floyd Justice in Policing Act to curb police brutality in this country.","date":"Sat Apr 10 23:34:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must not only remember the devastating impact of the Holocaust, but also teach to future generations to ensure those horrors never happen again. #YomHaShoah  #HolocaustRemembranceDay","date":"Thu Apr 08 06:25:32 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congressman Hastings was a leader, a mentor, a fighter for justice, and a friend. We worked on child welfare issues and Africa policy together. He was one of the first people I reached out to when I arrived in DC. He leaves behind an incredible legacy of service and strength. https://t.co/w7k8iH1ya7","date":"Wed Apr 07 17:27:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The trial of Derek Chauvin has been gut-wrenching to watch.\n\nCongress is capable of passing laws to ensure that bad officers are held accountable for killing people.\n\nWe must get the George Floyd Justice in Policing Act signed into law. https://t.co/12EOAAGmiu","date":"Sun Apr 04 18:47:24 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wishing a happy Easter to all who are celebrating this morning. \n\nI’m full of hope that we can all be together in person soon but until it is safe for all of us to celebrate together, please wear a mask and social distance. \n\nWe will get through this!","date":"Sun Apr 04 17:23:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Very saddened to see what happened today at the United States Capitol. This is the fourth Capitol Police Officer to die since January.\n\nMy thoughts and the thoughts of a grateful nation are with the families of each of those who died keeping us safe. \n\nMay they rest in peace.","date":"Fri Apr 02 20:49:19 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’m devastated by the reports of another mass shooting. There are concrete actions we can take to minimize the risk of these events. The House has acted. We must get a bill to President Biden’s desk.","date":"Thu Apr 01 16:19:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This trial shouldn't be about if Derek Chauvin meant to kill George Floyd. I don't care what was on his mind. He was reckless and he killed him and he should be held accountable.\n\nThat's what the George Floyd Justice in Policing Act would do.\n#JusticeInPolicing #PoliceReformNow https://t.co/GCiJOIZo2P","date":"Mon Mar 29 19:55:27 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Derek Chauvin murdered George Floyd. \n\nWhat today’s trial could show is just how close this country’s justice system is to administering actual justice. \n\nWhat we must do is act. \n\nWe must get the George Floyd Justice in Policing Act signed into law.","date":"Mon Mar 29 15:36:59 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"For many, this Passover will be different from all others. Now more than ever, we must remember the importance of family, community and our strength to overcome. \n\nChag Sameach and happy #Passover to those who are celebrating all over the world.","date":"Sun Mar 28 03:02:56 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"In solidarity and in strength:\n\n#StopAsianHate","date":"Fri Mar 26 22:13:20 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to thank my colleagues for supporting this resolution. \n\nWe all want this pandemic to be over, but this simply cannot happen unless we act in collaboration and coordination to fight COVID-19 throughout the world. https://t.co/MIPVYliMXi","date":"Thu Mar 25 22:06:54 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I stand with my friend @RepJudyChu. I also believe this was a hate crime.\n\nThat man targeted Young's Asian Massage and then drove 27 miles to hit two more spas. He didn't stop anywhere else - he intentionally targeted these places.\n\nCall it for what it is.\n\n#StopAsianHate","date":"Wed Mar 24 17:50:41 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"One year ago, Daniel Prude needed help.\n\nInstead of getting it, he was brutalized by police and then died a week later after he was taken off life support.\n\nNo one was held accountable. \n\nThe George Floyd Justice in Policing Act will hold officers accountable. \n\n#PoliceReformNow","date":"Tue Mar 23 20:39:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must get a bill to President Biden’s desk to take a step towards safety and away from fear.","date":"Tue Mar 23 04:31:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We should be able to feel safe in our grocery stores. \n\nWe should be able to feel safe in our schools. \n\nWe should be able to feel safe in our movie theaters. \n\nWe should be able to feel safe in our places of worship.","date":"Tue Mar 23 04:31:04 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am devastated for the Boulder community this evening. \n\nMy thoughts are with the families of the victims as well as the shoppers, the frontline grocery store employees, and the first responders, who saved many lives this afternoon at the risk of their own.","date":"Tue Mar 23 04:30:47 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Especially in Los Angeles, DREAMers are students, teachers, coaches, mentors, entrepreneurs and community leaders.\n\nThey are American in every way except on paper.\n\nToday, we vote on the #DreamAndPromiseAct to provide justice and fairness for our nation’s DREAMers. #HomeIsHere https://t.co/loClt2YNYC","date":"Thu Mar 18 18:35:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations, Mr. Secretary. https://t.co/HSmc0N46r3","date":"Thu Mar 18 17:09:12 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Three years ago today, police shot Stephon Clark because they thought he was armed. \n\nAll he had was a cell phone. \n\nThe George Floyd Justice in Policing Act holds officers accountable. \n\nWe cannot wait any longer. We need #PoliceReformNow","date":"Thu Mar 18 14:11:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Violence Against Women Act provides protection from violence and abuse and works to ensure victims and survivors get the support they need.\n\nThis critical reauthorization will safeguard and further strengthen life-saving protections for women across the country.\n\nI voted YES.","date":"Wed Mar 17 21:08:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This hatred and violence is absolutely unacceptable. \n\nAt a time when anti-Asian hatred is spiking, I stand in solidarity with the Asian American community throughout this country.\n\nWe are with you.\n\n#StopAsianHate","date":"Wed Mar 17 15:17:42 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"One year later. \n\nStill true.\n\nSign the George Floyd Justice In Policing Act into law.","date":"Sat Mar 13 22:07:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The House of Representatives passed legislation to stop the use of the warrant that led to Breonna Taylor's death last week.\n\nWe can turn this pain into hope. #PoliceReformNow #JusticeInPolicing","date":"Sat Mar 13 18:49:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks one year since Breonna Taylor was killed by police conducting a no-knock warrant in her own home. \n\nThe George Floyd Justice In Policing Act would eliminate no-knock warrants. \n\nThe Senate must act. We need #PoliceReformNow","date":"Sat Mar 13 15:03:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Honoring the life of Breonna Taylor today with @essence on their Facebook page at 6pm et. \n\n#SayHerName https://t.co/vffa3EUxwF","date":"Fri Mar 12 21:54:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to our newest State Senator. Proud to continue to work alongside you @sydneykamlager! https://t.co/Z6u6J48CYO","date":"Fri Mar 12 04:59:26 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today the American Rescue Plan was signed into law.\n\nHelp is here.","date":"Fri Mar 12 04:50:58 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I look forward to tackling the issue of houselessness with Secretary Fudge and applaud President Biden on this historic nomination. Let’s get to work!","date":"Thu Mar 11 03:50:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We promised the American people that we would fight for the big, bold COVID19 relief they need – and we’re not going to let them down. \n\nWe need to get shots in arms, money in pockets, children in schools, &amp; people in jobs. That’s why I supported the #AmericanRescuePlan.","date":"Thu Mar 11 03:46:40 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The American Rescue Plan is a bill about our future. https://t.co/OplfdBhW6I","date":"Wed Mar 10 12:11:07 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, Congress is voting to pass the #PROAct – the most significant upgrade for workers’ collective bargaining rights in more than 80 years. \n\nWe must protect workers’ right to negotiate for better wages, benefits, and working conditions.","date":"Wed Mar 10 00:09:41 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"New data shows that huge majorities of groups surveyed — 67% of Black people, 71% of Latinos — are willing to take the vaccine.\n\nIt's access that's the issue. \n\nThanks to @MARCMORIAL and Dr. Cheryl Grills for joining me in this fight.\nhttps://t.co/RFGUFGRG24","date":"Tue Mar 09 22:33:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Without police accountability, we will continue to see instances of police brutality over and over and over again.\n\nThe George Floyd Justice in Policing Act must be signed into law.\n\n#PoliceReformNow https://t.co/fl4ste74LD","date":"Sun Mar 07 20:14:24 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"More people have been arrested for protesting the murder of Breonna Taylor than for the actual murder of Breonna Taylor.","date":"Thu Jul 16 15:35:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"At a certain point, we need to ask ourselves how many more videos of police violence do we need to see before we act.\n\nYesterday, the House of Representatives passed the George Floyd Justice in Policing Act because my colleagues and I believe the answer is zero.\n\nOnward.","date":"Thu Mar 04 15:02:56 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Over the past 30 years, there have been countless videos documenting police brutality throughout this country. \n\nWe are at a moral moment for this country.\n\nToday, exactly 30 years after Rodney King was beaten, we will pass the George Floyd Justice in Policing Act. https://t.co/CYYdlTZlfN","date":"Thu Mar 04 00:43:56 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"30 years ago today, Rodney King was beaten by police in the middle of the street. When the video came out, we thought that we finally had the proof we needed to end police brutality.\n\n30 years later, we are yet again at a moral moment in our history. We must act. We must succeed.","date":"Wed Mar 03 17:56:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tomorrow, the House of Representatives will vote on the George Floyd Justice in Policing Act. \n\nThough traumatic, it’s important to remember why we are in this fight.\n\nPolice brutality exists in this country. We must do something about it. https://t.co/RLksDTy9UT","date":"Wed Mar 03 15:34:57 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"At some point, we as a nation need to make a decision about how many more instances of police brutality do we need to witness before we act.\n\nI say it's zero.\n\nWe must pass the George Floyd Justice in Policing Act.","date":"Tue Mar 02 02:34:43 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's time.","date":"Mon Mar 01 17:47:46 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"“Do Black lives matter in the United States? Congress has a moral obligation to demonstrate that they do.”\n\nIt’s time to pass the George Floyd Justice in Policing Act.\n\nhttps://t.co/zi7UNqT6bd","date":"Mon Mar 01 14:06:39 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is our time to transform our nation's system of policing. We have the House. We have the Senate. We have the White House. \n\nWe cannot wait any longer. We must pass the George Floyd Justice In Policing Act. https://t.co/yABJvx7uKv","date":"Mon Mar 01 01:40:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"More than 100 unarmed people have been brutalized or killed by police since George Floyd was murdered last summer.\n\nThe George Floyd Justice in Policing Act holds police accountable and is needed now more than ever.\n\n#JusticeInPolicing https://t.co/8kKWbM405X","date":"Sun Feb 28 16:44:58 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"One of my priorities as Chair of the House Foreign Affairs Subcommittee on Africa is changing the way we perceive the continent. \n\nThe continent of Africa is not hopeless. It’s a place of opportunity and partnership.\n\nThanks @Russian_Starr for having me. https://t.co/n6lT5CHmPv","date":"Sun Feb 28 00:47:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The American people have waited far too long for additional relief.\n\nTonight, I'm voting YES on better testing.\nI'm voting YES on housing assistance.\nI'm voting YES on more vaccines.\nI'm voting YES on additional payments.\n\nI'm voting YES on the #AmericanRescuePlan Act of 2021.","date":"Sat Feb 27 03:35:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need police officers that kill unarmed individuals to be held accountable. Period. We need police reform NOW.\nhttps://t.co/1RdwqbwcDJ","date":"Sat Feb 27 00:45:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"More about the bill here: https://t.co/aWPX1nx8La","date":"Wed Feb 24 22:31:57 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Never again should the world be subject to witnessing what we saw happen to George Floyd in the streets in Minnesota. 6/","date":"Wed Feb 24 21:45:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Never again should a family have to watch the murder of their loved one over and over again on the TV. 5/","date":"Wed Feb 24 21:45:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Never again should an unarmed individual be murdered or brutalized by someone who is supposed to serve and protect them.  4/","date":"Wed Feb 24 21:43:59 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last year, the George Floyd Justice in Policing Act passed the House of Representatives with bipartisan support but was neglected in the Senate and by the White House.\n\nAfter we marched, we voted, and today we re-introduce the bill with renewed hope that it will become law. 3/","date":"Wed Feb 24 21:43:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"For more than 100 years, Black communities in America have sadly been marching against police abuse and calling for the police to protect and serve us as they do others. 2/","date":"Wed Feb 24 21:42:32 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last summer, hundreds of thousands demanded change that ends police brutality, holds police officers accountable and calls for transparency in our system of policing. \n\nDue to inaction, more than 100 unarmed people have been killed or brutalized by police since then. 1/","date":"Wed Feb 24 21:41:55 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This confirmation sends a message that the United States is back and that our foreign service is back. \n\nWe as a country and as a world are safer with her serving as the United States Ambassador to the United Nations.","date":"Tue Feb 23 21:17:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Ambassador Thomas-Greenfield is a lifelong diplomat who is dedicated to bettering this country and the relationships this country has with others throughout the world. \n\nWe traveled to the continent together many times and I’ve always admired her leadership.","date":"Tue Feb 23 18:04:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Biden administration’s push to put racial equity and diversity at the center of reforms is crucial to our success as a nation.\n\nTo have a successful foreign policy, our foreign service must look like America. \n\nProud to reintroduce this bill today. \nhttps://t.co/b7JXG38f9N","date":"Fri Feb 19 03:17:48 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Over the last four years, we saw immigration policies result in kids being separated from their parents, families held in cages, and African refugees abused at our border in violation of asylum laws.\n\nToday we introduced the #USCitizenshipAct to restore our immigration system. https://t.co/PrN1fAfosU","date":"Thu Feb 18 19:01:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Saddened to learn about the passing of Rev. Dr. Frederick K.C. Price. I know that his legacy will continue to live on in South LA and beyond.","date":"Sun Feb 14 23:01:54 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There was a bipartisan vote to impeach.\n\nThere should be a bipartisan vote to convict.","date":"Tue Feb 09 22:14:48 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Black moms in the US are 3-4x as likely to die from pregnancy-related complications, and Hispanic, Native American, &amp; AAPI people experience disproportionate mortality and morbidity rates as well. The #Momnibus addresses the root causes. Proud to join my colleagues on this bill.","date":"Tue Feb 09 21:11:12 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I'll be hosting a virtual event with @MalcolmNance next week on Wednesday at 6 PM PT. We’ll discuss the insurrection, its aftermath, and its international implications.\nRSVP: https://t.co/dboQ7yIHr2 https://t.co/2LDNzQQeFv","date":"Fri Feb 05 23:23:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am excited that the Biden-Harris Administration is leading the way on resetting our relationship and partnership with Africa, and I am especially excited that he intends to strengthen our support of the African Union.\n\nMy full statement: https://t.co/X2uv0Imu9A","date":"Fri Feb 05 17:54:41 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The trauma of police brutality and child abuse can last an entire lifetime. It happens because there’s no accountability. That’s got to stop.\nhttps://t.co/SlzqtmBmXV","date":"Thu Feb 04 13:58:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"@Ilhan Omar is a dedicated public servant working every day for the people that sent her to Congress.\n\nMarjorie Taylor Greene has endorsed the assassination of the Speaker of the House.\n\nThere is no comparison between these two individuals.","date":"Wed Feb 03 20:28:36 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Raising the minimum wage to $15 nationwide would benefit nearly 32 million workers. \n\nIt’s time.","date":"Tue Feb 02 23:03:19 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"What Donald Trump did to those children at the border was a crime against humanity.\n\nPresident Biden is taking steps begin to address those harms and I will continue to work here in Congress to legislate solutions. https://t.co/e7hgrukmst","date":"Tue Feb 02 17:51:05 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Suspended? For child abuse? \n\nThe officer involved should be fired.","date":"Tue Feb 02 15:38:37 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Handcuffing, pepper spraying, and placing a child in the back of a police car is child abuse under the color of law and should be illegal. \n\nThe officers involved should be fired for abusing a child.","date":"Mon Feb 01 22:50:38 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to my former foreign policy advisor Eric Williams – best of luck on this new adventure. https://t.co/H7YKqZNZbU","date":"Mon Feb 01 22:38:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I look forward to working with both the Senate and the White House to ensure that we get police reform done. https://t.co/IjKj841jQz","date":"Mon Feb 01 21:24:50 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"One month after the insurrection, I'll be hosting an event with @MalcolmNance about the insurrection, its aftermath, its international implications, and why we cannot ignore its deep roots in white supremacy and centuries of domestic terrorism.\n\nRSVP: https://t.co/dboQ7yIHr2 https://t.co/iVf0LajXSr","date":"Fri Jan 29 17:37:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Your legend will live on in all of those touched by your passion. You will be truly missed.","date":"Fri Jan 29 06:30:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Cicely Tyson was a pioneer who broke open doors for Black women on the screen and off, with grace and glamor. \n\nShe was committed to fighting for justice both at home and abroad - someone who was outspoken in the civil rights movement and the anti-apartheid struggle. https://t.co/Jpa8XAPzSg","date":"Fri Jan 29 06:29:51 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks the 76th anniversary of the liberation of Auschwitz. On this International Holocaust Remembrance Day, we must remain resolved in our rejection of the resurgence of Nazism and white nationalism here at home and abroad to ensure that these atrocities never happen again.","date":"Thu Jan 28 00:28:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Linda Thomas-Greenfield is more than qualified to serve this country as Ambassador to the United Nations. I urge my colleagues in the Senate to swiftly confirm her. \n\nAny partisan delay based on petty politics makes our country less safe.","date":"Wed Jan 27 19:38:42 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Ambassador Thomas-Greenfield is a lifelong diplomat who is dedicated to bettering this country and the relationships our country has with others throughout the world. \n\nHer experience on the international stage commands deserved respect from all corners of the world.","date":"Wed Jan 27 15:50:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to urge @POTUS to join the 163 member countries of @WTO in supporting the nomination of @NOIweala to head the World Trade Organization. \n\nShe is uniquely qualified and has the vision to help the WTO evolve during these unprecedented times.","date":"Wed Jan 27 01:33:12 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It was great to see @AmbassadorRice behind the podium once again and I look forward to working with the Administration and my colleagues here in Congress on these issues.","date":"Tue Jan 26 23:15:13 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"In redressing racially discriminatory federal housing policies and ending the Department of Justice’s use of private prisons, the Biden administration today took a concrete step towards advancing racial equity.\nhttps://t.co/qNwBglnm8V","date":"Tue Jan 26 23:14:29 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The key to reducing this surge of violence is supporting community-based gang intervention specialists. \n\nWe must also embrace a safety net that secures housing, combats food insecurity, and provides viable employment opportunities. https://t.co/o9qYHg0Vco","date":"Tue Jan 26 17:09:16 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are in the middle of two crises: a health crisis and an economic crisis.\n\nWe absolutely need another COVID relief package to provide additional assistance to communities that need it most. https://t.co/w74BwMpt8i","date":"Mon Jan 25 21:24:09 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This makes our country stronger. https://t.co/RiHImIYceu","date":"Mon Jan 25 17:46:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is the day that the Lord has made! \nI will rejoice and be in glad in it! https://t.co/25PsYsCFk5","date":"Wed Jan 20 17:08:05 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wear a mask. https://t.co/ovhKeneIwk","date":"Wed Jan 20 15:32:46 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"A new day for America.\n\nA new day for the world. https://t.co/rTwbeP135D","date":"Wed Jan 20 15:28:14 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The arc of the moral universe is long, but it bends toward justice. #MLKDay https://t.co/RFW4R174JS","date":"Tue Jan 19 01:34:55 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today we stated unequivocally that Donald Trump is unfit to be President of the United States. https://t.co/NzSzDB81Xw","date":"Thu Jan 14 00:11:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I just voted to impeach President Trump for incitement of insurrection against our democracy.","date":"Wed Jan 13 21:08:31 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I voted yes.","date":"Wed Jan 13 16:12:40 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There were terrorists in the United States Capitol and Donald Trump said \"we love you\". \n\nEvery day that he is in the White House is a day that he is a clear and present danger to this country. https://t.co/N23Sp5wheH","date":"Mon Jan 11 18:42:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There were Capitol Police officers taking selfies with violent insurrectionists.\n\nThere must be a full scale investigation into what happened on January 6th. https://t.co/hk7fn3NuZE","date":"Sat Jan 09 18:07:22 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"After a tragic week, I still feel hope for this country. One of the reasons I am hopeful is because of @StaceyAbrams - who I didn’t get the chance to publicly recognize for her work in Georgia.\n\nThank you for all you’ve done.\nThank you for all you will do. https://t.co/rHS8HOGwo4","date":"Sat Jan 09 03:18:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is an atrocious, anti-Semitic statement and must be condemned.","date":"Sat Jan 09 00:01:02 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why are journalists able to find these terrorists and write articles about them faster than the FBI can arrest them?","date":"Fri Jan 08 04:42:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Can you imagine if the rioters were Black? https://t.co/jC9LYbI6Ee","date":"Fri Jan 08 03:12:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Don't resign. Remove.","date":"Fri Jan 08 02:19:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest Elizabeth. https://t.co/cl3LAWHCY8","date":"Fri Jan 08 01:24:23 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"You should have stayed at your post and invoked the 25th amendment instead of quitting your job 9 days early.","date":"Thu Jan 07 19:15:03 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Found one. https://t.co/Cx7obp0p61","date":"Thu Jan 07 14:37:47 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Everyone in this picture should be found and arrested. \n\nTonight. https://t.co/IwZCBeAazN","date":"Thu Jan 07 04:14:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Did they think that their attempted coup was going to stop us from doing the work on behalf of the people who elected us to be here?\n\nDid they think we would bend? \n\nDid they think we would break? \n\nThey chose the wrong one.","date":"Thu Jan 07 01:02:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I urge my colleagues to take Rep. McMorris Rodgers's lead.","date":"Thu Jan 07 00:59:30 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"These are not harmless objections. In light of the riots and the attempted coup we just endured, we should all be able to see that. \n\nJoe Biden will be President of the United States because he was elected President of the United States.","date":"Thu Jan 07 00:03:45 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I call on my Republican colleagues to drop their nonsense and certify the will of the American people. \n\nJoe Biden won in Arizona. \n\nJoe Biden won in Georgia. \n\nJoe Biden won in Michigan. \n\nJoe Biden won in Nevada. \n\nJoe Biden won in Pennsylvania. \n\nJoe Biden won in Wisconsin.","date":"Thu Jan 07 00:03:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest everyone in this picture. https://t.co/OiQpvSyNTf","date":"Wed Jan 06 23:20:56 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/rW1VJvhklG","date":"Wed Jan 06 22:42:11 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/w03iXytqX4","date":"Wed Jan 06 22:41:53 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/YQLwhwHwkn","date":"Wed Jan 06 22:41:44 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/DxHif02nBb","date":"Wed Jan 06 22:41:34 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/cIYWMOFn6R","date":"Wed Jan 06 22:33:42 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/rovmMxcMX8","date":"Wed Jan 06 22:30:25 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest this man. https://t.co/fnfgSqtG5e","date":"Wed Jan 06 22:30:00 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"When this is all over, we will respond and our response will be forceful. \n\nThis is the United States of America and this will not stand.","date":"Wed Jan 06 21:21:13 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every single person that scaled the Capitol with rope should be arrested. \n\nEvery single person that broke into Speaker Pelosi’s office should be arrested. \n\nEvery single person that broke into the Senate Chamber should be arrested.","date":"Wed Jan 06 21:21:05 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"There will be thousands of videos and photos from this incident. That’s all evidence. \n\nEvery single person that broke into the Capitol should be arrested.","date":"Wed Jan 06 21:20:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The people breaking into the Capitol are the same people that scream about law and order when there are Black Lives Matter protests. \n\nThe people that are attacking Capitol Police officers right now are the same people that say they stand with the police.","date":"Wed Jan 06 21:20:10 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am safe in a secure location. \n\nThe President of the United States is inciting a coup.\n\nWe will not be intimidated. We will not be deterred.","date":"Wed Jan 06 20:15:52 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last night, Georgia gave us the majority in the Senate.\n\nToday, we will defend the will of the American people in Congress.\n\nOn January 20th, President Joe Biden and Vice President Kamala Harris will walk into the White House.","date":"Wed Jan 06 18:31:28 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"If the George Floyd Justice in Policing Act was law, this officer would have been held accountable. \n\nI am relieved that we will soon have a President who understands that.","date":"Tue Jan 05 23:51:27 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"The officer in this situation was reckless. The officer did not need to shoot Mr. Blake seven times in the back in front of his kids, leaving them forever traumatized.\n\nThe man who tried to murder Jacob Blake should be held accountable for his actions.","date":"Tue Jan 05 23:51:13 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to my friend Senator @SteveBradford on your election to serve as Chair of the California Legislative Black Caucus. \n\nI look forward to supporting your work in Sacramento - starting with addressing the disproportionate impact this pandemic has had on our community.","date":"Tue Jan 05 22:04:18 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"As my term comes to an end, I want to send a special shout out and Congratulations to @RepBeatty -- Chairwoman for the 50th Anniversary of the Congressional Black Caucus. \n\nWith her leadership, @TheBlackCaucus will continue to be the Conscience of the Congress.","date":"Mon Jan 04 04:29:33 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations, Madam Speaker. https://t.co/wmBLI3cigK","date":"Mon Jan 04 01:07:31 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to thank the CBC Executive Committee of the 116th Congress – @RepBeatty, @RepLawrence, @RepHankJohnson, @RepMcEachin, @RepHorsford, @RepDwightEvans, and @RepWilson – for their tireless work over the past two years.","date":"Sun Jan 03 21:50:29 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"It has been the honor of a lifetime to Chair the Congressional Black Caucus, especially during such a critical moment in our nation's history.\n\nhttps://t.co/rrZKOJiVgN","date":"Sun Jan 03 21:44:08 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"As this year comes to a close, I want to recognize the winners of this year’s High School Congressional Art Competition. Visit https://t.co/bBVb0KbN5Z to view our full gallery. \n\nCongratulations to all – the future is bright. https://t.co/aq2E8y4oqj","date":"Fri Jan 01 00:08:21 +0000 2021","user_id":"239949176"},{"handle":"RepKarenBass","text":"This year has been unlike any other. Join me this Saturday to review 2020 and talk about plans for the coming new year. \n\nhttps://t.co/6sI00QbNb8 https://t.co/uD15Xk2rqA","date":"Thu Dec 31 00:46:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump has put three Black men to death since he lost and has more executions scheduled before he leaves office.\n\nIsn’t it enough for him that his lack of concern for the American people contributed to the deaths of almost 350,000 people? Why does he want to kill more?","date":"Mon Dec 28 23:58:03 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I urge the Government of Uganda to release Nicholas Opiyo and investigate his unlawful detention by the Ugandan Security Forces. Mr. Opiyo must be given due process. His unlawful arrest sends a strong message that the country has no regard for basic human rights and the law.","date":"Mon Dec 28 00:28:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I hope that everyone stays safe today. I have a great deal of hope for what the new year will bring. \n\nMerry Christmas.","date":"Fri Dec 25 20:31:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Christmas 2020 is a Christmas like no other. \n\nToday I am thinking all who have been impacted by the COVID-19 pandemic, especially those who have lost loved ones and are marking their first holiday season without their loved ones.","date":"Fri Dec 25 20:31:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I look forward to continuing our fight for progress and representation in all facets of our government and am excited to work with Senator Padilla in the years to come.","date":"Tue Dec 22 20:00:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"After then-Senator Harris’s historic election in 2016 as the first woman of color to represent California, we now have another historic barrier shattered as Alex will be the first Latino to serve California in the United States Senate.","date":"Tue Dec 22 20:00:02 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, our state gains yet another champion following a distinguished line of individuals who have shattered glass ceilings and hurdled obstacles in their way.","date":"Tue Dec 22 19:59:42 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As our Secretary of State, Alex modernized our electoral process and led the effort to provide ballots by mail statewide so Californians could safely vote in this year’s election.","date":"Tue Dec 22 19:59:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We served together in the State legislature where he passed landmark legislation to make California the first state in the nation to require chain restaurants to post calorie information directly on menus.","date":"Tue Dec 22 19:58:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I want to congratulate Alex Padilla -- someone I've known dating back to when he served our city as the youngest-ever President of the Los Angeles City Council.","date":"Tue Dec 22 19:58:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Talk of martial law. Seizing voting machines. Politicized prosecutors.\n\nWhen we see other countries trying to invalidate elections this way, we do all we can to stop them. It's absolutely tragic. https://t.co/LBaK3fhrfQ","date":"Tue Dec 22 03:08:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I received the first dose of the COVID vaccine about 24 hours ago.\n\nI have no fever.\nI have no headache.\nI have no other side effects.\n\nOther than a sore shoulder I feel great. Please be safe and get the vaccine when it is available to you and your family! https://t.co/se5x3bJyCy","date":"Sat Dec 19 22:36:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I was skeptical about getting the vaccine right away.\n\nIt's hard to listen to an administration that lies so much and the research seemed rushed. That along with the health disparities Black people endure made me nervous.\n\nHere's why I decided to take it and think you should too. https://t.co/MBj4ZjWr8m","date":"Sat Dec 19 03:23:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"At the recommendation of the Office of the Attending Physician, I received the COVID-19 vaccine.\n\nThis vaccine is the culmination of decades of scientific research applied to a new virus that has claimed the lives of so many.\n\nI trust it and you should too. \n\nThis is how we win. https://t.co/se5x3bJyCy","date":"Fri Dec 18 21:39:20 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This morning I joined the @JFedLA for their virtual celebration ahead of the final night of Hanukkah.\n \nIn this dark time, I hope that the full hanukkiah brings light to all those celebrating tonight.\n \nHanukkah Sameach! https://t.co/fOm4ZP2ClO","date":"Fri Dec 18 01:55:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I know her integrity and I know her passion. \n\nI look forward to working with her in her capacity as Secretary of the Interior.","date":"Thu Dec 17 23:19:16 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’ve worked closely with @RepDebHaaland  in her capacity as Co-Chair of the Congressional Native American Caucus to address the disproportionate impact this pandemic is having on our communities and I’ve also worked alongside her in the fight for environmental justice. 2/","date":"Thu Dec 17 23:19:06 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This appointment is historic. To have a Native woman be responsible for the management and conservation of federal land, including the well-being of the nation’s nearly 2 million Indigenous people, bends our moral arc back towards justice. 1/","date":"Thu Dec 17 23:17:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Right before he resigned in disgrace, I sent Bill Barr a letter requesting information about the scope of ketamine use during arrests and what the Department of Justice has done in reaction to the deaths that have been caused. https://t.co/URmLad8Lhm","date":"Wed Dec 16 16:12:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is OUTRAGEOUS and NEVER appropriate that a non-medical person, like a police officer, would tell a medical professional, like an EMT, when and how to administer medication. \n\nIt is illegal. 1/","date":"Wed Dec 16 16:10:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am deeply concerned about the recent abduction of more than 300 students in Katsina State in northern Nigeria.\n\nI urge the Government of Nigeria to investigate, bring these attackers to justice, and for the attackers to release the boys and return them safely to their families.","date":"Tue Dec 15 17:09:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donte couldn't testify at our hearing on COVID in prisons this month but his words must be heard.\n\n“In the end, I became infected with the virus. At that moment, I felt as if I was sentenced to death for a first-time marijuana offense.”\n\nHis full testimony is below. https://t.co/nhrf2uZBII","date":"Mon Dec 14 22:26:50 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"America’s diplomats should look like America.","date":"Mon Dec 14 15:14:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Especially in this time of crisis, it would be an honor to be appointed to serve my state in the United States Senate. https://t.co/RZUGGHlW8E","date":"Sun Dec 13 17:42:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last year, the Government Accountability Office confirmed that Superfund sites across the country are not equipped to withstand the threat of climate change.\n\nUnless the EPA takes climate into account, we are all in danger.\n\nProud to introduce this bill with @repcleaver.","date":"Sat Dec 12 03:34:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need a national strategy to fight this disease and to distribute the vaccine widely when it becomes available.\n\nWhat that must include is focused, concentrated intervention in communities of color.\n\nThank you @NYGovCuomo for having us at today's press conference. https://t.co/bTdQes6ORd","date":"Fri Dec 11 18:07:08 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’m wishing those celebrating the first night of Hanukkah a joyful evening full of light in these dark times. \n\nMy thoughts are with those who will be marking tonight as the first holiday without a loved one due to this pandemic. \n\nWe will get through this.","date":"Fri Dec 11 01:22:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Yesterday, on the eve of #HumanRightsDay, I hosted a hearing focusing on the closing of civic spaces worldwide as some governments impose legal and extralegal restrictions on civil society.\n\nToday we reaffirm our commitment to fighting for human rights for all. https://t.co/383hc0zDHc","date":"Fri Dec 11 00:12:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every year, more than 650,000 people are released from custody.\n\nFinding housing, job training, or even a hot meal can be nearly impossible.\n\nToday the House passed my bill to establish centers to help returning citizens successfully rejoin their families and communities. https://t.co/5OPUSmKZLB","date":"Wed Dec 09 02:50:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In California, we adhere to scientific guidance. https://t.co/dSGXMGMfdF","date":"Tue Dec 08 19:17:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In Congress I’ve traveled to 30 African nations. On those trips, I've often found that the staff of our embassies are overwhelmingly made up of white men. \n\nAmerica’s diplomats should look like America. \n\nHere's my op-ed about we're going to do about it.\nhttps://t.co/b7JXG2QDLd","date":"Sun Dec 06 22:16:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"One year ago today, the House of Representatives passed the Voting Rights Advancement Act of 2019.\n\nCongressman John Lewis presided. \n\nWe miss you, Mr. Lewis. https://t.co/zrpTLEkc1y","date":"Sun Dec 06 18:43:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There is a long history of purposeful medical abuse of communities of color in this country. \n\nThere needs to be a massive public education campaign with trusted messengers from our communities about this vaccine. https://t.co/6w70tPxth0","date":"Sun Dec 06 15:50:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Is the Bureau of Prisons doing enough to protect those who are incarcerated from COVID-19? \n\nNo. \n\nYesterday I chaired a hearing to find solutions that will improve protection for those behind bars and also those that work at these facilities. https://t.co/U5IecUg1BE","date":"Fri Dec 04 05:56:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"When the study is done on the Trump administration, there's going to be a list of at least 100 things that we can never allow to happen again. \n\nWe have to tighten up the checks and balances in this country. https://t.co/avtNHAYqdw","date":"Fri Dec 04 02:16:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are reports that more than 252,000 people have contracted COVID-19 while in federal, state, and local custody. \n\nMore than 1,400 of them have died.\n\nI called today's hearing to make it clear that this is absolutely unacceptable. https://t.co/uhOj9SELTd","date":"Wed Dec 02 19:21:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Justice Department is investigating a potential crime related to funneling money to the White House or related political committee in exchange for a presidential pardon.\n\nDonald Trump has normalized this behavior since his first day in office. It's a culture of corruption. https://t.co/jKKFQG5dXx","date":"Wed Dec 02 02:45:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is a day to raise awareness, reflect on our progress, and recommit our resolve to fight HIV/AIDS throughout the world.\n\nWe must ensure that everyone – including the most vulnerable in the world – have access to preventative education and also treatment. \n\n#WorldAIDSDay","date":"Tue Dec 01 20:51:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"”If they don’t give you a seat at the table, bring a folding chair.”\n\nHappy birthday, Shirley Chisholm https://t.co/UuYxdNdCvU","date":"Tue Dec 01 03:16:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Please be safe. Please follow local health guidelines. \n\nWe will get through this. 4/4","date":"Thu Nov 26 21:33:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am grateful to the hundreds of thousands of first responders and frontline workers – many of whom will work today to keep this country moving and to provide the same lifesaving support that they’ve been providing for the entire span of this pandemic. 3/","date":"Thu Nov 26 21:33:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The safety of the people should always be the absolute priority of the government. I’m relieved to say that we are transitioning back to that mentality as we speak. 2/","date":"Thu Nov 26 21:33:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, I’m thinking of the families of the more than 250,000 Americans who will mark their first holiday without a loved one because of the mismanagement of this coronavirus. 1/","date":"Thu Nov 26 21:32:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is the International Day for the Elimination of Violence against Women. \n\nThe Violence Against Women Reauthorization Act was passed by the House 601 days ago. \n\nA great way to commemorate this day would be passing it in the Senate and signing it into law.","date":"Wed Nov 25 18:12:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Seeing the team that Joe Biden has pulled together made me exhale. \n\nWe're back. \n\nToday we took a tangible step in restoring our standing in the world. https://t.co/c7v4LdcLFd","date":"Wed Nov 25 03:35:47 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Exhale. https://t.co/58VKxghAG4","date":"Wed Nov 25 00:33:20 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Linda Thomas-Greenfield grew up in a town where the KKK burned crosses on lawns.\n\n\"But I had the hopes and dreams of my mother who taught me I could face any challenge in my path by being compassionate and kind.\"\n\nNext year, she will serve as our ambassador to the United Nations. https://t.co/tlEkvMMAnQ","date":"Tue Nov 24 19:24:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today my office received a letter from an 8 year old wondering what she can do to be politically active until she can legally vote. \n\nThe future is bright.","date":"Tue Nov 24 04:10:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"To know @LindaT_G is to know an incredibly smart, caring, and insightful diplomat dedicated to bettering this country and the relationships our country has with others throughout the world. \n\nHer grace and her wit will serve this country well.","date":"Mon Nov 23 22:10:36 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We all looked to Shuwanza's leadership when she served as Floor Director.\n\nShe was integral to helping us pass legislation to provide vital COVID relief to the American people, protect the integrity of our elections, and raise the minimum wage.\n\nSo well deserved, congratulations!","date":"Mon Nov 23 16:49:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I think they’re refusing to show President-elect Biden the intelligence briefings because the briefings might show that the greatest threat to the country right now is Donald Trump.","date":"Sat Nov 21 21:12:51 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Republicans have stalled pandemic relief for 189 days. \n\nSince then, there have been 10,350,379 new cases of COVID-19 in the United States.","date":"Sat Nov 21 03:47:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Happy birthday Mr. President-elect! https://t.co/cLGSHobAz9","date":"Fri Nov 20 22:59:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump is using tax payer dollars to attempt an illegal seizure of power. \n\nHe must be held accountable for the possibly permanent damage he is causing to this country.","date":"Fri Nov 20 20:30:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is an absolute disregard for public health and safety. Those responsible for failing to isolate nearly 100 individuals who tested positive for COVID-19 must be held accountable. https://t.co/7zF5jFaM3I","date":"Fri Nov 20 01:32:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"President-elect Joe Biden appointed 9 people to senior White House staff positions today. \n\nNone are his children. \n\nNone are married to his children. \n\nAll are qualified.","date":"Tue Nov 17 21:57:06 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Inaction at local levels has handed death sentences to people who hadn’t even been convicted of a crime all because they couldn't afford bail. \n\nCriminal justice reform is COVID relief.\n\nIt’s needed now. https://t.co/2lXMbkwC4K","date":"Tue Nov 17 00:09:47 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Vice President-elect Kamala Harris sounds so good.","date":"Thu Nov 12 22:12:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is an honor and a privilege to represent so many brave veterans in Congress. \n\nTo them and their families - happy #VeteransDay. \n\nThank you for your service.","date":"Thu Nov 12 01:16:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Rene Talbott honorably served in Vietnam and only recently found out he had been recommended for a Bronze Star for bravery.  \n\nI had the opportunity to speak with him and present a Congressional Record recognizing his service to our country. https://t.co/oAZqoJKqKO","date":"Thu Nov 12 01:16:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Deporting someone to a country where they will be at imminent risk of death is outrageous and unacceptable.","date":"Tue Nov 10 21:22:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations to President-elect Joe Biden and Vice President-elect Kamala Harris.\n\nLet’s get to work.","date":"Sat Nov 07 17:13:20 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are more than one million ballots that haven’t been counted yet. \n\nIt’s moments like this when scared dictators declare victory and threaten the fabric of the democracies they claim to lead and represent. \n\nIt’s moments like this when the people must reject it.","date":"Wed Nov 04 21:51:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"VOTE.","date":"Tue Nov 03 20:38:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This instance of voter suppression in Jefferson Park must be fully investigated and the ballots taken must be returned.  \nhttps://t.co/GtESxTuI9o","date":"Tue Nov 03 17:18:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wishing Tanzania free, fair &amp; safe elections with democracy on the line. \n\nWe hope for the same next week here in the United States.\nhttps://t.co/XbieP86uam","date":"Wed Oct 28 16:59:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"CHAMPIONS.","date":"Wed Oct 28 03:55:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The election is 8 days away. Absolutely shameful.","date":"Tue Oct 27 00:12:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tonight I'm hosting the second of two urgent town halls focused on voting safely and securely in the middle of a pandemic. \n\nJoin us at 6:30 PM by RSVPing here: https://t.co/DrgKYOvhyw \n\n#VotingTownHall","date":"Wed Oct 21 18:10:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Investing in non-policing solutions is a crucial contribution to broader efforts to reimagine public safety.\nhttps://t.co/ku3Y41Yvuq","date":"Tue Oct 20 19:39:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Happy birthday @SenKamalaHarris! Looking forward to continuing to work alongside you in the years to come.","date":"Tue Oct 20 19:34:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We're live! \n\nJoin us now: https://t.co/aE5Q54vk0a","date":"Sat Oct 17 17:15:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I'll be hosting the first of two urgent town halls tomorrow morning at 10 AM focused on voting safely and securely in the middle of a pandemic. \n\nRSVP here to reserve your spot: https://t.co/aE5Q54vk0a\n\n#VotingTownHall https://t.co/67bJuuNFf3","date":"Fri Oct 16 20:08:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Missed us this morning? Watch here: https://t.co/ycaYOjqPOF\n\n#HerPower2020","date":"Thu Oct 15 20:44:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"So many in the child welfare system are facing the same issues Deshala is facing. \n\nThe bipartisan Pandemic Protection for Foster Youth Act will prevent youth from aging out of foster care and Chafee services during the COVID-19 pandemic response.\nhttps://t.co/gNa9n6WrUk","date":"Thu Oct 15 20:31:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Looking forward to joining @XantheScharff tomorrow at the #HerPower2020 @ForeignPolicy Digital Summit to discuss the future of democracy on an international scale. \n\nJoin us at 7:30 AM PT / 10:30 AM ET here: https://t.co/nOPEQC8fXA https://t.co/mSLo62RgYv","date":"Wed Oct 14 20:13:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Trump administration is halting the census to purposefully deprive communities of color federal resources. Period.","date":"Wed Oct 14 01:10:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The disbanding of SARS does not address demands for accountability and justice for abuses committed. \n\nI call on the government of Nigeria to continue these reforms and to protect peaceful protests against brutality. \n\n#EndSARS \nhttps://t.co/g6VGocHwRj","date":"Tue Oct 13 18:40:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You can’t “discover” a land where people had been living for thousands of years. \n\nToday we observe #IndigenousPeoplesDay so that their past is not forgotten, but also so that their progress is protected.","date":"Tue Oct 13 00:21:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I will never stop fighting for what is right.\n\nI’m honored to receive a perfect score from the @HRC. https://t.co/ozK91QpwpY","date":"Thu Oct 08 17:21:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"All 4 officers charged in the killing of George Floyd have now been released on bond.\n\nWe need to change the laws in this country so that families like George Floyd's family can finally see justice. \n\nThe George Floyd #JusticeInPolicing Act needs to be signed into law.","date":"Wed Oct 07 17:39:07 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today the House of Representatives passed my bill to provide a national standard of care for incarcerated women during pregnancy, labor, delivery and postpartum periods so that no one else has to go through what Diana went through.","date":"Fri Oct 02 01:34:07 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Yesterday I chaired a hearing focusing on countries that may be turning away from democratic processes.\n\nIt felt disingenuous to NOT bring up our own. So I did.","date":"Thu Oct 01 13:46:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Kano State of Nigeria must overturn this death sentence and ensure the safety of Yahaya Sharif Aminu during an appeal.\n\nApplication of the death penalty for artistic expression must not be allowed.","date":"Wed Sep 30 00:08:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wishing a meaningful observance for Kol Nidre tonight and Yom Kippur tomorrow. \n\nG'mar Hatima Tova.","date":"Sun Sep 27 22:33:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"A vote to confirm Donald Trump's nominee to the Supreme Court is a vote to take health care away from millions of Americans and to rewind the progress of women’s rights in this country by decades.","date":"Sun Sep 27 19:40:36 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need to pass the George Floyd Justice In Policing Act to make sure that police officers aren't only getting prosecuted for shooting at walls when they are also shooting at an unarmed civilian in her home. https://t.co/w1JTxAAZSe","date":"Thu Sep 24 02:32:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is a video of Diana Sanchez receiving an “absorbent pad” that looks like a napkin after her water broke in her jail cell. \n\nShe was then forced go through hours of labor alone. \n\nNo help. \n\nNo doctor. \n\nNo anything.\n\nThis is an issue of human rights. https://t.co/cz3GI6wAgo","date":"Fri Aug 30 15:32:39 +0000 2019","user_id":"239949176"},{"handle":"RepKarenBass","text":"These charges are an affront to the movement for justice and peace in this country and conveys loud and clear that Breonna Taylor’s life does not matter to the legal system of the United States.","date":"Wed Sep 23 22:05:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The main motivation for Donald Trump to fill the Supreme Court vacancy is to take away health care from millions of Americans in the middle of a pandemic.","date":"Wed Sep 23 00:26:47 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"While this year’s celebration will be different from previous years, what remains is the sweet joy and strong hope of a coming new year. \n\nTo all of those celebrating Rosh Hashanah tonight, l’Shanah Tovah!","date":"Fri Sep 18 23:57:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Bill Barr comparing the sale of human beings to public health professionals trying to save lives is abhorrent but consistent with Trump's desire to stoke racial tension in this country. \n\nDespite their efforts, we will come together. \n\nI have faith in the American people. https://t.co/J6nh0zUOIg","date":"Thu Sep 17 22:06:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If we want to protect the front lines, we need to #FundtheFrontLines. \n\nThe Senate must act.","date":"Thu Sep 17 13:04:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Absolutely irresponsible and dangerous. The unnecessary deportation of 300,000 family members, neighbors, and co-workers in the middle of a pandemic will help the spread of COVID-19.  \nhttps://t.co/WGsLYPUa9F","date":"Thu Sep 17 02:01:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Giving detained women hysterectomies without any reason or even proper anesthesia is not simply medical malpractice -- it is a human rights abuse and a crime against humanity. https://t.co/S43Kgek9Q1","date":"Wed Sep 16 18:34:03 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest the police officers who murdered Breonna Taylor.","date":"Wed Sep 16 14:54:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Sexist slurs being used during interviews should not be tolerated by news agencies or audiences of any kind. \n\n@SpeakerPelosi is the only person running the country right now, she doesn’t have time for this nonsense and neither do we.","date":"Wed Sep 16 03:54:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This year, we mark #HispanicHeritageMonth as we confront a pandemic that has disproportionately impacted communities of color.\n\nI join in celebrating the contributions of Latinos and Latinas throughout this nation’s history, including those on the frontlines fighting every day.","date":"Wed Sep 16 01:35:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’m thankful and relieved that the two L.A. County sheriff's deputies that were senselessly shot over the weekend are expected to recover. \n\nThe tape is absolutely horrendous to watch. Violence like this is never acceptable. \n\nMy prayers are with the officers and their families.","date":"Tue Sep 15 15:14:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Never forget. https://t.co/b9FcK5wDE2","date":"Fri Sep 11 15:21:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump knew COVID-19 was dangerous. \nHe knew it was contagious.\nHe knew it was airborne.\nHe knew it was deadly.\n\nHe just didn't care. \n\nThe first job of the Commander in Chief is to protecting and defending the United States. \n\nHe failed.","date":"Wed Sep 09 16:41:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As #LaborDay comes to a close, we have to remember our commitment to taking tangible actions to support our workers. \n\nThe House passed the Heroes Act months ago - it’s time for it to be taken up in the Senate and signed into law.","date":"Tue Sep 08 00:50:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The NIH and the companies working on stage-three vaccine trials must urgently recruit Black, Latino, Native American and Asian Pacific Islander participants, using strategies endorsed and supported by the communities they are targeting.\nhttps://t.co/dCs0vcHZQk","date":"Thu Sep 03 02:34:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If it’s not safe for students to go back to school, it’s not safe for families to be evicted from their homes.","date":"Thu Sep 03 00:07:07 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s shootings like this one, like the one that took the life of Andres Guardado, and like the ones that have taken the lives of so many others, that have resulted in Angelenos organizing a Sheriff Civilian Oversight Commission with subpoena power.\n\nThe people are fed up. Enough.","date":"Tue Sep 01 18:10:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"What bike violation is so severe that they needed to stop Dijon Kizzee?\n\nWhat bike violation is so severe that they needed to chase him?\n\nWhat bike violation is so severe that they needed to shoot him as many times as they did?\n\nIf he dropped a weapon, why was he then shot?","date":"Tue Sep 01 18:10:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump is visiting Kenosha, Wisconsin to agitate violence.","date":"Tue Sep 01 15:45:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I've been saying that this was their plan for months.\n\nIt's disastrous and has cost lives. https://t.co/AYqEvZiqMY","date":"Mon Aug 31 21:49:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tom understood that there were going to be no good solutions for either side and put the good of the state over the political pressure of the time, which showed his courage and also his decency. \n\nMy thoughts are with Tom’s family during this challenging time. 2/2","date":"Mon Aug 31 03:16:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tom Berryhill was a friend and colleague from the other side of the aisle who was always committed to improving the quality of life of all Californians. When we served together in Sacramento, we were charged with closing a $40 billion deficit. 1/ https://t.co/wdkwa9DckN","date":"Mon Aug 31 03:15:50 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you Mayor @tedwheeler for condemning Donald Trumps’s provocation of violence in your city and standing up to the racial divide he is encouraging in this country. https://t.co/FGDJJYD8qo","date":"Sun Aug 30 21:21:06 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The House of Representatives passed transformative legislation to hold police officers accountable more than two months ago.\n\nThe time for it to be signed into law is NOW. https://t.co/khkuOSHykY","date":"Sun Aug 30 14:41:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Rest in power Chadwick Boseman. 4/4","date":"Sat Aug 29 22:29:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In Black Panther, we saw the first major film about a Black superhero.\n\nThe movie depicted beautiful images of Black people as strong and brilliant and the continent of Africa was portrayed in all its beauty, opportunity and power.\n\nBlack people around the world were inspired. 3/ https://t.co/qCn0iQsFh6","date":"Sat Aug 29 22:27:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The characters he played allowed America to see Black people on the silver screen in positive roles — we saw the strength of Jackie Robinson and the brilliance of Thurgood Marshall. 2/ https://t.co/xEgBkkPTsn","date":"Sat Aug 29 22:26:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Chadwick Boseman brought Black legends, both of this world and beyond, to life for generations to come. 1/ https://t.co/cWqq2KdqK7","date":"Sat Aug 29 22:16:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Making the decision to force hundreds of my constituents to go to new designated locations for their mail in the middle of a pandemic is absolutely unacceptable.\n\nI am in contact with both the post office and the Housing Authority working to get to the bottom of these changes.","date":"Fri Aug 28 23:42:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Legislation to make it easier to prosecute police officers and hold them accountable for their actions has been sitting on Mitch McConnell’s desk for 63 days. https://t.co/SxCjugTBEp","date":"Thu Aug 27 18:22:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Jacob Blake.\nCOVID-19.\nAssault on our elections.\n\nJoin me and @TIME tomorrow at 1pm ET for #TIME100Talks.\n\nhttps://t.co/2my1JFbs4F https://t.co/Ux8YeZX5J3","date":"Thu Aug 27 01:29:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is Women's Equality Day, celebrated to commemorate the 1920 adoption of the Nineteenth Amendment to the United States Constitution.\n\nWe've come a long way but there is still so much we have to do. \n\nStay involved. We need you.\n\nThanks @khanacademy for this discussion. https://t.co/vJXeZfJNu2","date":"Wed Aug 26 22:51:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Younger people, older people, and everyone in between — wear a mask. https://t.co/iE1jipNtCW","date":"Wed Aug 26 13:36:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We do not live in an equal society. \n\nJacob Blake nearly lost his life because of it. https://t.co/JjjMGQiB6m","date":"Tue Aug 25 23:37:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Jacob Blake broke up a fight and police shot him in the back seven times.\n\nDylan Roof killed nine people at Emanuel AME Church and police bought him Burger King.","date":"Tue Aug 25 22:41:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"$75 billion for testing, tracing, and treatment has been sitting on Mitch McConnell’s desk for 102 days.","date":"Tue Aug 25 20:09:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We can transform our system. \n\nWe must. 3/3","date":"Tue Aug 25 01:41:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Trayford has passed. Jacob is fighting for his life. \n\n60 days ago, we passed legislation to make it easier to prosecute police misconduct and to remove bad actors from departments while also investing in our communities. \n\nThe Senate and the White House could act TOMORROW. 2/","date":"Tue Aug 25 01:40:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Friday, Trayford Pellerin was shot 11 times by police after he walked away from them and tried to enter a gas station store.\n\nOn Sunday, Jacob Blake was shot in the back 7 times by police after he walked away from them and tried to enter his car with his kids in it. 1/","date":"Tue Aug 25 01:39:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's not just about stopping the removal of mail sorting machines, it's about ensuring they are put back.\n\nIt's not just about stopping the removal of the blue boxes, it's about ensuring they are put back.\n\nMillions depend on it. https://t.co/2Ua55RRW6h","date":"Sat Aug 22 21:05:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"More than 173,000 Americans are dead.","date":"Thu Aug 20 21:25:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us!","date":"Thu Aug 20 18:24:02 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I am better because of her friendship and her mentorship. Our community, our state and our country are better because of her work. \n\nHer joyous laugh and her big heart will be most missed. 5/5","date":"Thu Aug 20 15:47:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"She also served on the Small Business Association board and was known nationally for the work she did on the board of the NAACP. 4/","date":"Thu Aug 20 15:47:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"When she served in the California State Assembly in Sacramento, she was responsible for more than 400 bills signed into law. As Speaker of the Assembly, I appointed her to the California State Bar Board of Trustees, where she served for many many years. 3/","date":"Thu Aug 20 15:47:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In that role, I got to see firsthand the work she did on behalf of our community. Throughout her career of service, that work never ceased. 2/","date":"Thu Aug 20 15:47:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"One of the first jobs I ever had was working for Mrs. Moore when she served as Personnel Director for the Greater Los Angeles Community Action Agency. 1/ https://t.co/lwL4VYLbsP","date":"Thu Aug 20 15:46:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Delivered to my office today by the United States Postal Service. https://t.co/wvM0N6ht1K","date":"Wed Aug 19 21:04:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Climate change is real. \n\nClimate change is dangerous. \n\nClimate change must be addressed. \nhttps://t.co/vrNfHi6URd","date":"Tue Aug 18 00:36:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"My father was a letter carrier for 37 years. I would not be where I am today without the sacrifices he made.\n\nAfter World War II, USPS was one of the few areas of the government that employed African Americans.\n\nIt’s in their memory that I'll be voting to protect @USPS.","date":"Mon Aug 17 19:51:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Social Security has offered Americans security in their retirement for 85 years today.\n\nWe must recommit ourselves to enhancing this program and protecting it from President Trump’s attempts to defund it. \n\n#Happy85SocialSecurity","date":"Fri Aug 14 17:44:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"About 10,000 Americans have died due to COVID-19 since this interview aired. \n\n“It is what it is.”\nhttps://t.co/69ZVj2jdHV","date":"Thu Aug 13 22:54:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump is trying to defund the United States Post Office so that less people vote.","date":"Thu Aug 13 15:01:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They have no problem giving billions of dollars to corporations but when it's time to give individuals who have lost their job $600, they throw a fit. It's shameful.","date":"Thu Aug 13 02:58:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If Donald Trump really cared about the American people, he wouldn't have let 160,000 people die. https://t.co/lNhJL6G4fs","date":"Thu Aug 13 00:55:51 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tune in!","date":"Wed Aug 12 22:54:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our prison system was not created with women in mind and as a result, continually fails to provide basic necessities to tens of thousands of individuals who are incarcerated every single day.\n\nThis is a bipartisan issue. Congress must act.","date":"Wed Aug 12 18:24:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Two weeks ago, @GReschenthaler, @RepKClark and I introduced the Protecting the Health and Wellness of Babies and Pregnant Women in Custody Act to provide a national standard of care for pregnancy-related needs of incarcerated women.","date":"Wed Aug 12 18:23:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"Being this was my third child, normally when, you know, you deliver your baby, they set your baby up on your chest... and... they didn't.\"\n\nThis video is hard to watch but we all need to know the abuses happening to pregnant women in prisons and jails across this country. https://t.co/AilITuSdud","date":"Wed Aug 12 18:20:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Let’s go. https://t.co/dXyMpe9qYD","date":"Wed Aug 12 16:37:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The United States needs the United States Postal Service.","date":"Mon Aug 10 17:31:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As we celebrate 55 years of the Voting Rights Act, our work to ensure access to the ballot isn’t over. \n\nCongress must pass the John R. Lewis Voting Rights Act and we must give states the resources they need to #ProtectOurVote amid the COVID-19 crisis. #VRA55","date":"Thu Aug 06 20:37:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"When I worked in a trauma center, sometimes we’d have young patients.\n\nThe thing about young people is they have no choice but to rely on adults for advice and guidance. \n\nIn a hospital, that trust is a matter of life or death.\n\nKids are not immune to COVID-19. Listen to science.","date":"Thu Aug 06 01:34:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I had a telephone town hall last night. 147 of my constituents told me they're at risk of eviction due to the expiration of their COVID benefits. \n\nThat’s 147 too many. \n\nWe passed legislation to address this 82 days ago. The Senate must act. The people need assistance NOW.","date":"Wed Aug 05 18:55:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"“The talk\" is not just for our Black boys, it's for our Black girls too. Children— a 6 year-old Black girl, a 12 year-old Black girl, a 14 year-old Black girl and a 17 year-old Black girl — face down in handcuffs. \n\nThis is child abuse.\nhttps://t.co/0S3Scwqhqt","date":"Wed Aug 05 16:09:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"They are dying. It's true. It is what it is.\"\n\nDo not forget this. This is how the President of the United States feels about the fact that 1,000 Americans are dying every day. https://t.co/69ZVj21Cjl","date":"Wed Aug 05 12:43:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"One of the most important things you can do today is fill out the census.","date":"Tue Aug 04 13:30:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"30,000 Americans have died between the time I recorded this interview a month ago and the time it aired today.\n\nDevastating. https://t.co/xg2yhVMRdN","date":"Tue Aug 04 03:19:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Be counted.","date":"Tue Aug 04 02:02:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Start your morning off right -- watch my full interview with the @breakfastclubam here: https://t.co/1av7cFsFa5 https://t.co/KuJj3XFYhQ","date":"Mon Aug 03 12:49:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No one should be forced to risk their lives in order to vote. https://t.co/Ly3lKoCRjr","date":"Sun Aug 02 21:49:02 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's been 138 days since Breonna Taylor was murdered and none of the officers responsible have been arrested.","date":"Thu Jul 30 01:50:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This picture is from a month and a half ago when I had to tell Louie Gohmert to put his mask on so that we could finally start our hearing. He did so reluctantly. \n\nNow, 44 days later, he's tested positive for COVID-19. \n\nListen to current (and former) health professionals. https://t.co/zeSPGwnfEV","date":"Wed Jul 29 22:08:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"FAILURE. OF. LEADERSHIP.","date":"Wed Jul 29 20:14:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"America deserves accountability. https://t.co/xPk7rky6cf","date":"Wed Jul 29 18:22:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s worse than that. WHILE he wasn’t wearing his mask, he specifically went around telling people he’s tested negative multiple times so there was nothing to worry about. You can test negative one day and positive the next. Listen to science.","date":"Wed Jul 29 17:04:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump is a lawless president. https://t.co/N2fv3EME9G","date":"Wed Jul 29 03:59:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"History made. \n\nIn the largest union election in 20 years, Child Care Providers United is officially recognized in California. \n\n#ChildCareIsEssential #UnionsForAll \nhttps://t.co/m16oze3NCB","date":"Tue Jul 28 22:52:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"James Holmes murdered 12 people and injured 70 others while white.\n\nElijah McClain was walking home while Black.\n\nGuess who was tackled to the ground by police, choked out, and injected with ketamine after he passed out? https://t.co/Xs9xgixxh4","date":"Tue Jul 28 20:34:16 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I just asked Attorney General Bill Barr if he knew who Elijah McClain was.\n\nHe said no.\n\nHelp me educate him.","date":"Tue Jul 28 17:47:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The amount of young black boys being injected with ketamine against their will during an arrest should be zero.","date":"Tue Jul 28 17:14:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, Bill Barr will testify before the House Judiciary Committee for the first time in more than a year because he doesn’t want to answer one question:\n\nDo you work for the American people or is your job to protect, cover up and facilitate corruption committed by Donald Trump?","date":"Tue Jul 28 12:13:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It was an honor to bring Congressman Lewis to South L.A. and to introduce him to the generations of activists there.\n\nHis legacy lives on in each of us. https://t.co/lP4SF3zdhm","date":"Mon Jul 27 11:42:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We passed the Heroes Act 72 days ago in the House of Representatives. There is a tsunami of evictions coming in this country. Why have Republicans waited to act? https://t.co/lk4z2vSkr0","date":"Mon Jul 27 03:21:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The United States accounts for 4% of the world’s population but 23% of reported COVID deaths worldwide. \n\nDonald Trump and Michael Pence are abject failures.","date":"Mon Jul 27 01:04:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last month, Vice President Pence wrote \"we are winning the fight against the invisible enemy.\" \n\n40,000 Americans have died since then. \n\nWe're not testing where we should be. The virus isn't contained. This is the United States of America, when will there be a national strategy? https://t.co/lPCMxYvCdb","date":"Sun Jul 26 18:52:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Watching Congressman Lewis cross the Edmund Pettus Bridge in Selma, Alabama one final time, I'm reminded of his words:  \n\n\"I just tried to help out. Just try to help out.\" https://t.co/S4qj69tmiB","date":"Sun Jul 26 16:31:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are 100 days away from the election in November.\n\nRegister.\n\nVote.","date":"Sun Jul 26 12:04:07 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Emmett Till would’ve turned 79 years old today and still, lynching is not a federal hate crime. https://t.co/JAfOBuevM3","date":"Sun Jul 26 03:57:36 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"May 25, 2020 - George Floyd is murdered.\n\nJune 25, 2020 - The George Floyd Justice in Policing Act passes the House of Representatives.\n\nToday, July 25, 2020 - The Senate continues to do nothing.","date":"Sun Jul 26 00:34:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The United States Capitol building was built by my enslaved ancestors and there are statues inside paying tribute to the people who fought to keep them enslaved. \n\nThey should be removed.\nhttps://t.co/yhE17A0JmY","date":"Fri Jul 24 01:37:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump is incapable of empathy and doesn't believe in science.\n\nHe's the last person who should be briefing the American people about the coronavirus. https://t.co/9Fj2v8bGDl","date":"Thu Jul 23 23:36:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The fight against injustice continues tonight on @BET. Join us. #AmericanInjusticeBET https://t.co/9kdQI2I71w","date":"Thu Jul 23 02:05:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, Donald Trump sent well wishes to Ghislaine Maxwell, who is charged with procuring underage girls to be sexually abused. \n\nHas he sent any well wishes to the families of the more than 140,000 Americans who have died during this pandemic?","date":"Tue Jul 21 23:11:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"What happened to @AOC is completely unacceptable. This was a verbal assault -- something that should never happen in the halls of Congress and something that should never be tolerated in the halls of Congress. https://t.co/WkgL5T7qy5","date":"Tue Jul 21 19:52:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Anti-Semitism, whether it's overt or otherwise, is unacceptable.\n\nConversations of understanding are important but we also must engage in uncomfortable confrontation on this issue with our loved ones, our neighbors, and our communities.\n\nWe must fight back against anti-Semitism.","date":"Mon Jul 20 16:06:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must live up to the legacy that Congressman Lewis has left us. \n\nWe must never stop fighting for social justice. https://t.co/fOPJbdexQB","date":"Sun Jul 19 15:52:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us this morning as we remember our colleague, mentor, and friend.","date":"Sun Jul 19 10:58:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The White House flying the flag at half-staff for one day is insulting. \n\nThe flag should fly at half-staff throughout the entire country until Congressman Lewis is in his final resting place. https://t.co/By9ew3HP4N","date":"Sun Jul 19 00:47:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The House of Representatives passed the Voting Rights Advancement Act 225 days ago. \n\nMonday would be a good day for the Senate to pass it.","date":"Sat Jul 18 23:13:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s now our responsibility to carry on the legacy of Congressman Lewis. https://t.co/gmOYoisvUX","date":"Sat Jul 18 15:44:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":".@realDonaldTrump while the nation mourns the passing of a national hero, please say nothing. Please don’t comment on the life of Congressman Lewis. Your press secretary released a statement, leave it at that. \n\nPlease let us mourn in peace.","date":"Sat Jul 18 15:24:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tonight's loss is a blow to the entire nation.\n\nTwo years ago, I had the honor of taking Congressman Lewis on a tour of @CoCoSouthLA. He was asked about his legacy and the message he wanted to leave behind for future generations. \n\nThis is what he said. https://t.co/6idYnN4YFO","date":"Sat Jul 18 05:02:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Putting a child in juvenile detention in the middle of a pandemic for not completing her homework is child abuse. Grace’s life is now in danger. \n\nIt’s not just our Black sons who are failed by this system, it’s our Black daughters too. \n\nIt’s all of our children.","date":"Fri Jul 17 20:43:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"More people have been arrested for protesting the murder of Breonna Taylor than for the actual murder of Breonna Taylor.","date":"Thu Jul 16 15:35:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"More than 135,000 Americans are dead and the President of the United States is posing for pictures with a can of beans on his desk in the Oval Office.","date":"Thu Jul 16 01:39:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, on the 14th day of July, Los Angeles had the highest number of new cases and hospitalizations reported in a single day during the pandemic.\n\nThe country is not “rocking” again. https://t.co/Xfoj8xUIbA","date":"Wed Jul 15 05:35:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"More than 138,000 Americans have died of COVID-19.\n\nUnconscionable.","date":"Tue Jul 14 19:21:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"“It’s going to disappear. One day, it’s like a miracle, it will disappear.” - Donald Trump, 136 days ago","date":"Tue Jul 14 01:39:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"5 years ago today, Sandra Bland died in jail after being arrested during a traffic stop. \n\nPeople in this country should not have to be scared for their lives if they are pulled over for a traffic stop.","date":"Tue Jul 14 01:24:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Leadership during an outbreak matters. \n\nLives are saved. https://t.co/2xkqw1Cne3","date":"Mon Jul 13 23:55:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Gun violence and police brutality are interconnected. \n\nWe must continue our fight on both issues.","date":"Mon Jul 13 18:07:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The police officers that murdered Breonna Taylor in her sleep will be sleeping in their beds tonight instead of a prison cell because the system in this country is broken.","date":"Mon Jul 13 01:22:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are kids in prison right now because they got caught with some marijuana in their backpack. \n\nRoger Stone lied to Congress, obstructed justice and tampered with witnesses and will not spend one night in prison. \n\nWhere is the justice?","date":"Sat Jul 11 00:06:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us for this critical conversation.\n\nhttps://t.co/xvPEn4TXUM https://t.co/KuiNSBwhvf","date":"Fri Jul 10 13:44:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congratulations @JoyAnnReid!!! We'll be watching!!! https://t.co/6yjfQTHY07","date":"Fri Jul 10 05:06:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’ve known Michael since I was a UC Regent - he was the Chancellor of UC Irvine at the time. He’s made a career of widening access to higher education and I wish him luck and continued success in that crucial effort. \n\nCongratulations Michael — our future is in your hands!","date":"Fri Jul 10 03:30:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s incredibly encouraging to see the University of California - the nation’s largest public school system - make such a historic selection. https://t.co/w8fLE3UiGj","date":"Fri Jul 10 03:29:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Attorney General William Barr is corrupt. https://t.co/9FxH1Nw3cX","date":"Fri Jul 10 02:07:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is a meaningful decision. States should have no authority to reduce federal reservations lying within their borders. \n\nNative land should remain protected.","date":"Fri Jul 10 00:54:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The fact he was released in the first place was outrageous.\n\nThere are thousands of elderly, high-risk individuals who committed non-violent minor crimes who are being forced to risk their lives in prison amid a pandemic.\n\nThey need to be released.","date":"Thu Jul 09 23:54:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Will be live with @JoyAnnReid tonight at 7pm et. Tune in!","date":"Thu Jul 09 22:56:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The President of the United States is not above the law.","date":"Thu Jul 09 14:48:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Police brutality is the symptom. Systematic racism is the root cause. \n\nJoin us on Friday: https://t.co/RG4AHosKFa https://t.co/2yT2UJEMVN","date":"Wed Jul 08 22:57:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The move to withdraw from the World Health Organization in the midst of a pandemic highlights this administration’s gross mismanagement of this global health emergency and a complete abdication of international responsibility and leadership.","date":"Tue Jul 07 22:23:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We as a society cannot incarcerate our way out of the biggest challenges we face. \n\nWe've tried it. It doesn't work. \n\nWe need to invest in our communities.","date":"Tue Jul 07 21:11:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I will never grow numb to the 131k fellow Americans who have died in the last 4 months. \n\nI think of them every single day and my heart breaks for them and their families.","date":"Tue Jul 07 13:07:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is what institutional racism looks like. https://t.co/HRicunmcLE","date":"Sun Jul 05 16:42:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"While we celebrate the progress we’ve made since, it is vital we contextualize the pain gripping the country today. \n\nIt’s the same pain we’ve carried for 400 years. \n\nIt’s the same yearning to be free. \n\nLet us march on, until victory is won.","date":"Sat Jul 04 18:18:59 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Juneteenth, Trump wanted to give a speech where hundreds of African Americans were massacred.\n\nYesterday, he delivered remarks on sacred Native lands.\n\nThe independence promised in 1776 was not for all. It was not for those killed in Tulsa. It was not for the Sioux People.","date":"Sat Jul 04 18:18:36 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Two of the three police officers that were involved in the murder of Breonna Taylor are still employed as police officers.","date":"Thu Jul 02 14:55:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Legislation that would provide a second stimulus check and expand unemployment benefits has been sitting on Mitch McConnell’s desk for 48 days.","date":"Thu Jul 02 12:30:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wear a mask. https://t.co/GYniLq5J6Z","date":"Wed Jul 01 15:11:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Your answers cannot be used to impact your eligibility for any government benefits, including any potential stimulus package. Fill out yours today at https://t.co/Fcg3WPV10f https://t.co/WY3fHY2d0v","date":"Wed Jul 01 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"@JoyAnnReid  \n@RepKarenBass \n@RepValDemings \n@RepJeffries \n\nLIVE https://t.co/3iRZx7CipT","date":"Fri Jun 26 23:07:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Children’s Healthcare. https://t.co/Lv6ko4FvDb https://t.co/EarcB1ToEb","date":"Fri Jun 26 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"For Oscar.\nFor Tamir.\nFor Philando.\nFor Alton. \nFor Atatiana.\nFor Eric.\nFor Michael.\nFor Breonna.\nFor George.\n\nFor all the names we may never know.\n\nThe House of Representatives has just passed the George Floyd Justice in Policing Act of 2020.","date":"Fri Jun 26 03:24:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Police brutality is an issue of human rights. \n\nThe George Floyd Justice in Policing Act is a bill addressing human rights in this country. https://t.co/GZjFfWKJuF","date":"Thu Jun 25 19:05:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tamir Rice would have turned 18 years old today. \n\nVoting age.","date":"Thu Jun 25 16:41:03 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is for the thousands marching in the streets. \n\nThe George Floyd Justice in Policing Act will bring bold, transformative change to the way we are policed in this country. https://t.co/wN4a5VI8LR","date":"Thu Jun 25 14:41:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, the United States House of Representatives will pass the George Floyd Justice in Policing Act of 2020 - one of the boldest pieces of national policing reform legislation in this nation's history.\n\nGood morning.","date":"Thu Jun 25 11:07:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are 1.3 billion people in India. Less than 15,000 people there have died because of the coronavirus.\n\nThere are 328 million people in the United States. More than 120,000 people here have died because of the coronavirus.\n\nAbsolutely outrageous. https://t.co/ITnXrxDl5t","date":"Thu Jun 25 03:16:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Wear a mask. https://t.co/m4xB8HvyIk","date":"Wed Jun 24 22:46:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us this Friday.","date":"Wed Jun 24 18:24:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Senate Democrats just stood up for every single person who has marched against police brutality. \n\nAt this moral moment in this country, we must pass bold transformative change. We don't need studies, we need action.","date":"Wed Jun 24 17:42:19 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"People are not marching for us to study chokeholds. They must be BANNED.\n\nWe need substantive change and the George Floyd Justice In Policing Act provides it. https://t.co/EIIX1VihAn","date":"Wed Jun 24 02:20:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Arrest the police officers that murdered Breonna Taylor.","date":"Wed Jun 24 00:15:02 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Census Bureau will never ask you for your Social Security number, money or donations, anything on behalf of a political party, or your bank or credit card account numbers. Fill out yours today at https://t.co/Fcg3WPDpBF https://t.co/wwoQkDopyX","date":"Tue Jun 23 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s now been more than 100 days since Breonna Taylor was murdered and all that’s happened is one of the officers involved has lost his job.","date":"Mon Jun 22 18:01:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"He's pictured here with my daughter/his first grandchild  Emilia, preparing for her high school prom. 2/2 https://t.co/n7G5nVsOyF","date":"Sun Jun 21 23:32:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On this Father’s Day, I'm missing Pops -- he introduced me to politics and helped me understand the civil rights movement. \n\nHe did not live to see me become an elected official. I only hope he would be proud of his daughter. 1/","date":"Sun Jun 21 23:31:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It must be an international responsibility to protect refugees and resolve the reasons people flee their homelands. #WorldRefugeeDay","date":"Sat Jun 20 18:29:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is already being projected that there will be a miscount of Black people in America by almost 4% in the 2020 Census. We can’t afford to let this happen. Have you completed your Census 2020 form? https://t.co/hc1lHuhCM6 #BlackCensus","date":"Sat Jun 20 05:33:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Race is a part of our nation's history that we need to reckon with. Until we do that, it’ll be difficult for people to understand why we continue to have some of the issues that we have today. The inaction has been because of a lack of historical understanding. #Juneteenth https://t.co/CxfLc3lrEm","date":"Sat Jun 20 01:42:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I’m celebrating #Juneteenth by working all day in my office here in Washington DC to continue the 400-year fight for justice in this country.","date":"Fri Jun 19 23:12:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last night I had a telephone town hall about the George Floyd Justice in Policing Act.\n\nThere were more than 10 thousand constituents on the call.\n\nThis is not the time for symbolic change. This is a time for action.","date":"Fri Jun 19 17:01:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Especially in Los Angeles, DREAMers are students, teachers, mentors, entrepreneurs and community leaders from EVERY continent. \n\nYour home is here. We stand with you.","date":"Thu Jun 18 16:07:55 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Foster Care.  https://t.co/Lv6ko4nUeB https://t.co/BJcqa8i4qU","date":"Thu Jun 18 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The people in the streets are not calling for studies. They're calling for bold transformative change in policing in this country. https://t.co/JqNOic4q4P","date":"Thu Jun 18 05:31:50 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The @HouseJudiciary Committee just voted to send the Justice in Policing Act to the House Floor for a final vote. \n\nWe need to ban chokeholds, not study them.\nWe need to ban no-knock warrants, not study them.\n\nThe people demand action.","date":"Thu Jun 18 02:15:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's been 93 days since Breonna Taylor was murdered and the only arrest made in relation to her death was the arrest of her partner, who was charged for defending himself against the intruders invading their home.","date":"Mon Jun 15 01:43:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They never stopped — and that’s why we need to pass legislation to make lynching a federal hate crime.","date":"Wed Jun 17 18:03:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Now is not the time to study chokeholds, it's time to ban them.\n\nNow is not the time to study no-knock warrants, it's time to ban them.\n\nThe cries in the streets are not for symbolism, they are for substantive action.\n\nWe must pass the #JusticeInPolicing Act.","date":"Wed Jun 17 16:36:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It took me many years to get over the fear of those lights coming on behind me.\n\nIt wasn't fear about getting a ticket. It was fear that my interaction with the police may result in me not surviving.\n\nThis isn't just an issue for Black men. It's an issue for Black women as well. https://t.co/s1zDO3JvdH","date":"Wed Jun 17 15:23:50 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They bought Dylan Roof Burger King after he was arrested for killing 9 parishioners at Emanuel African Methodist Episcopal Church during bible study.","date":"Wed Jun 17 01:25:16 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thanks for having me @RepEscobar!","date":"Tue Jun 16 21:29:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"What we want is to do is decriminalize social, economic and health problems in our society by reinvesting and reimagining the way we address public safety in this country. 5/5","date":"Tue Jun 16 19:48:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Now they’re acting like anyone calling for police reforms wants to eliminate all police everywhere, which is not true and endangers the moral moment this we are on the cusp of in this country. 4/","date":"Tue Jun 16 19:48:08 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Like many, I’m frustrated with the distortion of the defund movement by the Right which is just trying to divide us.\n\nRemember that these are the same people who are always ready to defund healthcare, defund education, defund mental health services. 3/","date":"Tue Jun 16 19:47:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I deeply respect the work of organizers, activists, and protestors, who are speaking loudly to the need for change to this nation's system of public safety. 2/","date":"Tue Jun 16 19:46:55 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Saying that’s the worst slogan ever was the dumbest response ever and I shouldn’t have said it and I’m sorry for saying it. \n\nI would never mean to malign a movement of activists who I know are fighting for transformative change. 1/","date":"Tue Jun 16 19:46:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They could've called Rayshard an Uber.\nThey could've helped him walk home.\nThey could've parked his car.\n\nInstead they shot him in the back.","date":"Tue Jun 16 15:16:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They bought Dylan Roof Burger King after he was arrested for killing 9 parishioners at Emanuel African Methodist Episcopal Church during bible study.\nhttps://t.co/8f7o0hn5fD","date":"Tue Jun 16 15:11:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"8 minutes and 46 seconds. \n\nThat's how long George Floyd was pinned with a knee on his neck.\n\nIt's also about as long as it took Donald Trump to gas protesters for a photo-op.  \n\nWe must find justice. https://t.co/zxR013HviK","date":"Tue Jun 16 00:58:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Justice in Policing Act allows communities to reimagine what public safety should look like. \n\nPolice brutality isn’t it.\nhttps://t.co/PPBFMD1JlF","date":"Mon Jun 15 21:37:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If the courts won't act, then Congress must. \n\nIt is long past time to remove this arbitrary and unlawful barrier and to ensure law enforcement officers are held accountable when they violate the constitutional rights of the people whom they are meant to serve.","date":"Mon Jun 15 19:59:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have not invested in health, social or economic problems in our communities and we leave the police to pick up the pieces. \n\nPolice officers should not be responsible for cleaning up society's problems. \n\nWe need to rethink public safety and invest in solutions that work. https://t.co/m414Z03Iex","date":"Mon Jun 15 18:31:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Online and phone responses can be completed in 13 languages: English, Español, 中文, Tiếng Việt, 한국어, русский, العربية, Tagalog, Polskie, Français, Kreyòl Ayisyen, Português, and 日本語. Fill out yours today at https://t.co/Fcg3WPV10f https://t.co/6ayhMCz0BZ","date":"Mon Jun 15 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's been 93 days since Breonna Taylor was murdered and the only arrest made in relation to her death was the arrest of her partner, who was charged for defending himself against the intruders invading their home.","date":"Mon Jun 15 01:43:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The idea that you can improve public safety by increasing investments in militarized police forces across the country is wrong.\n\nIt's time to rethink this idea and focus on community-based solutions that make communities safer.\n\nIt's time to pass the #JusticeInPolicing Act. https://t.co/S3vr8XaZJf","date":"Sun Jun 14 21:09:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"A profession where you have the power to kill someone should be a profession that requires highly trained individuals who are accountable to the public. Period.","date":"Sun Jun 14 19:00:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We don't think police officers should be our first line of defense against mental illness or the housing crisis and neither do the officers themselves.\n\nWe must pass legislation to allow communities to reimagine public safety. \n\nThe #JusticeInPolicing Act is the way forward. https://t.co/PPBFMD1JlF","date":"Sun Jun 14 17:12:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If our bill was law, Breonna Taylor would be alive because no-knock warrants for drugs would've been banned. https://t.co/PAUlHwwOzq","date":"Sat Jun 13 21:50:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This time is different. \n\nWe must pass the #JusticeInPolicing Act. https://t.co/1j1FR6tri3","date":"Sat Jun 13 19:20:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Yesterday marked 4 years since 49 people were killed and 53 were wounded in a mass shooting inside Pulse nightclub in Orlando, Florida.\n\nWhen will enough be enough?\n\n#HonorThemWithAction https://t.co/0ZS4dsdCQX","date":"Sat Jun 13 15:52:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The #JusticeInPolicing Act will assist police departments to change the culture of policing, raise the standards of the profession and hold those officers accountable. \n\nThis is our opportunity to reimagine public safety so that it is just and equitable for all. https://t.co/cxngc8S4kj","date":"Sat Jun 13 13:29:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you to @aliciagarza and @OsopePatrisse for joining  @TheBlackCaucus for a forum on police brutality this morning. Congress needs to act. https://t.co/FzUv9sB5O3","date":"Thu Jun 11 17:12:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Philonise Floyd laid his brother George to rest yesterday and came to testify before Congress today. \n\nHe told us that we must make sure that his brother's death will not be in vain. \n\nWe must act. https://t.co/tr2xzajfKh","date":"Thu Jun 11 02:07:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If our bill was law, Tamir Rice would've graduated high school last month.\n\nThere needs to be a database so that police that have already been fired for inappropriate conduct are not rehired by different departments.\nhttps://t.co/PAUlHwwOzq","date":"Wed Jun 10 17:42:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"George called for help and he was ignored. Please listen to the call I'm making to you now.\" - Philonise Floyd, brother of George Floyd https://t.co/3qdq0Ivo9m","date":"Wed Jun 10 15:59:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If our bill was law, George Floyd would be alive because chokeholds would've been banned. \n\nIf our bill was law, Breonna Taylor would be alive because no-knock warrants for drugs would've been banned. \n\nIf our bill was law, Tamir Rice would've graduated high school last month. https://t.co/PAUlHwwOzq","date":"Wed Jun 10 14:57:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Nutritional assistance resources for mothers and children. https://t.co/Lv6ko4nUeB https://t.co/hQj1W15OcT","date":"Wed Jun 10 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Justice in Policing Act will save lives by holding police officers accountable. https://t.co/XbSmK1OcSD","date":"Tue Jun 09 19:40:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The chokehold used to kill Eric Garner should be illegal. \n\nThe warrant used to kill Breonna Taylor should be illegal. \n\nPutting a knee on someone’s neck for 8 minutes and 46 seconds should be illegal. \n\nThe Justice in Policing Act must become law.","date":"Tue Jun 09 13:17:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Never again should the world be subjected to witnessing the slow murder of an individual by a uniformed police officer.\n\nWe must push for transformative change. https://t.co/gaTuohkeM5","date":"Tue Jun 09 10:52:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Justice in Policing Act will hold abusive police accountable, increase transparency, and help communities reimagine public safety and policing. \n\nThe world is watching. Congress must act. https://t.co/qzxXsIea4u","date":"Tue Jun 09 05:59:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"To a nation crying out: \n\nWe hear you. \n\nWe must pass the Justice in Policing Act. https://t.co/WzYHLQu01D","date":"Mon Jun 08 21:39:51 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Justice in Policing Act of 2020 will hold abusive law enforcement officers accountable, change the culture of law enforcement and build trust between law enforcement and our communities.\n\nIt establishes a bold, transformative vision of policing in America.\n\nToday we act.","date":"Mon Jun 08 15:01:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"A profession where you have the power to kill should be a profession that requires highly trained officers who are accountable to the public. https://t.co/1NNqmIN3f3","date":"Mon Jun 08 15:01:19 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"For Ahmaud.\nFor Breonna.\nFor George.\n\nWe kneel. https://t.co/kiTgvMH6nS","date":"Mon Jun 08 14:29:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is a moral moment for this country to ACT.","date":"Sun Jun 07 17:35:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's time for police culture in many departments throughout the country to change. \n\nThe bill we are introducing tomorrow will help this country take a major step forward in that direction. https://t.co/oneNcf32CS","date":"Sun Jun 07 15:25:17 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Laws need to change in order to hold police officers accountable.\n\nTomorrow, @TheBlackCaucus is introducing legislation to do just that. https://t.co/q9rRrV9gNm","date":"Sun Jun 07 13:04:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We need to re-envision what policing looks like in America. https://t.co/iZTW9iXQNu","date":"Sat Jun 06 18:24:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"They will be. They have to be.","date":"Fri Jun 05 14:31:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Federal law prevents the U.S. Census Bureau from sharing your information with law enforcement. Fill out yours today at https://t.co/Fcg3WPV10f https://t.co/ZlHaMOp2Z9","date":"Fri Jun 05 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Breonna Taylor was murdered 83 days ago. \n\nEvery single one of the officers who were involved still roam free.","date":"Thu Jun 04 21:05:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are hosting a nation-wide town hall meeting tomorrow to discuss what it is like to live while Black in America.\n\nCOVID-19 stopped everything... except for racism.\n\nhttps://t.co/RG4AHoKlwI https://t.co/f1qMISpVub","date":"Thu Jun 04 17:04:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":".@TheBlackCaucus will be introducing legislation to change policing in this country. https://t.co/pSOvUDGVfM","date":"Thu Jun 04 15:43:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are protests happening all around the world against what is happening in the United States. \n\nAs we fight for human rights on the international stage, we absolutely have to fight for human rights at home.\n\nThis is a moral moment. Congress must take a stand. https://t.co/p7OTjd6UzL","date":"Thu Jun 04 03:59:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our nation needs Congress to act.","date":"Thu Jun 04 02:10:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you to my former @theblackcaucus colleague, now the AG of Minnesota, @keithellison for doing the right thing and charging all of the men who participated in the murder of George Floyd. \n\nWe must continue to work towards structural change.","date":"Wed Jun 03 21:26:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"George Floyd was murdered 9 days ago. \n\nThree police officers who helped facilitate his murder still roam free. \n\nBreonna Taylor was murdered 82 days ago. \n\nEvery single one of the officers who were involved still roam free.","date":"Wed Jun 03 15:39:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"How were you scared for your life as a police officer if you shot someone in the back as they were running away from you?\n\nPolice officers must be able to be held accountable and they must be able to be prosecuted. @TheBlackCaucus is working on legislation to address both issues. https://t.co/ZJwBDd5jsT","date":"Wed Jun 03 05:56:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"George Floyd was pinned with a knee on his neck for 8 minutes and 46 seconds. \n\nThat’s about as long as it took Donald Trump to gas protesters for a photo-op.  \n\nWhere is the justice? https://t.co/PrOkyW97Dd","date":"Wed Jun 03 02:01:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We are in a moral moment. Congress must act. https://t.co/Sy91tl4tY4","date":"Tue Jun 02 13:49:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Funding for low-income schools.  https://t.co/Lv6ko4FvDb https://t.co/Y6no3RpGYw","date":"Tue Jun 02 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Found one. https://t.co/WnMupTLVSW","date":"Tue Jun 02 03:53:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We want to end the careers of abusive law enforcement officers so that in the rare instance they actually do lose their job, they can’t go work for another department.","date":"Tue Jun 02 00:38:19 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We will also address the structural conflict of interests of relying on DAs to charge officers from police departments that they work with every day.","date":"Tue Jun 02 00:38:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":".@TheBlackCaucus will be introducing legislation to address laws that shield police officers from ever being accountable for murdering citizens. https://t.co/yO27jBb782","date":"Tue Jun 02 00:37:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It feels like it's open season on Black folks not just because of the police murders, but because of the police brutality.\n\nWe're stopped if we're not wearing medical masks. Meanwhile, armed vigilantes are taking over the Michigan state capitol unbothered.\n\nWhere is the justice? https://t.co/W5fgVYASKu","date":"Mon Jun 01 16:44:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":".@TheBlackCaucus will be hosting a nation-wide town hall on Friday. \n\nCOVID-19 has stopped everything except for racism. \n\nJoin us: https://t.co/RG4AHosKFa https://t.co/7vnMM092xO","date":"Mon Jun 01 02:57:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If you’re mad, if you’re distraught, if you’re angry, if you’re hurting: fight back against the system that killed George Floyd, don’t destroy our communities and neighborhoods. \n\nThey want to see us burn. Don’t do their work for them.\n\nWe have to build. We have to survive. 2/2","date":"Sun May 31 03:48:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"To the white allies and supporters of this movement in the streets: Thank you.\n\nTo the white rioters and agitators using the pain of this movement as cover to trash our communities: Get out. 1/","date":"Sun May 31 03:47:06 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"How many times do we have to see a Black person killed on video for there to be an immediate arrest? https://t.co/7HTTSVJokA","date":"Sat May 30 05:13:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Those who beat Rodney King never paid the price for their violence, but the violence that happened in LA in 1992 was not the answer.\n\nThe answer is action. 2/2","date":"Thu May 28 17:36:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every officer involved in the murder of George Floyd should be immediately arrested. \n\nI understand the despair and the anger that comes from the absence of justice - I watched that despair and anger in 1992 in Los Angeles. 1/","date":"Thu May 28 17:34:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No words... https://t.co/HD1jXVbyCA","date":"Thu May 28 16:40:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Federal law prohibits the U.S. Census Bureau from asking about religious or political affiliation. Fill out yours today at https://t.co/Fcg3WPV10f https://t.co/YQhZxd3guB","date":"Thu May 28 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"100,000 people in the richest country in the history of the world have died because of COVID-19.\n\nIf we had acted aggressively and much earlier, how many of the 100,000 would be alive today?\n\nFailed leadership.\n\n100,000 lives.\n100,000 stories.\n100,000 loved ones.\n\nGone.","date":"Wed May 27 18:10:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The President votes by mail so why can't you? https://t.co/VFQTf9YGzJ","date":"Wed May 27 15:15:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We've extended our Congressional Art Competition deadline to this Thursday! \n\nSubmit here: https://t.co/YnMKQLlcQt https://t.co/FWJSRAlf1l","date":"Tue May 26 16:19:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, we mark Memorial Day amid great loss and great sacrifice in our country. \n\nAs we mourn those who have served this country with bravery and courage both abroad in war and domestically in crisis, we express our humble gratitude. \n\nThank you.","date":"Mon May 25 15:42:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Meals for child and adult day care programs.  https://t.co/Lv6ko4FvDb https://t.co/dsuNqg1rta","date":"Mon May 25 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There should be a disproportionate amount of resources for geographic areas that have disproportionate death and infection rates. \n\nIf a house is on fire, don't hose down the whole neighborhood. Go to where the fire is an put it out. https://t.co/V6F7VwzvI2","date":"Sat May 23 16:56:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Access to Medicaid could’ve prevented Jasmine from being homeless. \n\nSadly, that’s the case for many foster youth nationwide. \n\nMedicaid should cover foster youth until they turn 26. We must raise #FosterYouthVoices. https://t.co/exSLuZFRMh","date":"Fri May 22 19:07:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We must honor #DJaysLegacy.\n \nWe must never stop raising #FosterYouthVoices. \n\n5/5 https://t.co/8BeRmxS19p","date":"Wed May 20 23:28:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"DJay’s death is a sad reminder that there is no time to waste to act on behalf of our nation’s foster youth. As this pandemic continues, it’s critical that we make sure everyone in this vulnerable population has the coverage and the care they need. 4/","date":"Wed May 20 23:22:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last week, DJay passed away due to complications with COVID-19.\n \nOn Friday, @RepGwenMoore and I will be reintroducing legislation to immediately ensure that eligible former foster youth have access to Medicaid until the age of 26 in his honor. 3/","date":"Wed May 20 23:22:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"He was an advocate through and through – a champion for health care reforms for current and former foster youth and other changes to our child welfare system. He wanted to make the world a better place than he found it.\n\nAnd he did. 2/","date":"Wed May 20 23:22:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I first met DJay when he was in Washington, DC participating in our Foster Youth Shadow Day program. His smile lit up dim meeting rooms and his laugh bounded through sometimes-hollow hallways. 1/","date":"Wed May 20 23:21:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You can fill out the 2020 Census online, by mail or by phone. Fill out yours today at https://t.co/Fcg3WPV10f https://t.co/wcLASatAQ2","date":"Wed May 20 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are 90,000 dead from COVID-19 in the richest country in the world.\n\nThere are 1.5 million confirmed cases of COVID-19 in the richest country in the world.\n\nThere are 36 million initial unemployment claims because of COVID-19 in the richest country in the world.\n\nWhy?","date":"Tue May 19 21:15:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The deadline for submitting art to our Congressional Art Competition is this Thursday! \n\nFind out how you can win a free trip to DC here: https://t.co/YnMKQLlcQt https://t.co/Ie1MakdO3M","date":"Tue May 19 18:39:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I wonder if the President knows that hydroxychloroquine can damage your heart. I wonder if he knows people have died trying to treat themselves with this drug that medical science rejects as a treatment for COVID.","date":"Mon May 18 23:35:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tomorrow, @TheBlackCaucus will be hosting a town hall with educators throughout the country. \n\nMore info: https://t.co/RG4AHosKFa https://t.co/R0vCY1NTBJ","date":"Mon May 18 21:16:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The impact this pandemic is having on our nation's foster youth cannot be overlooked. We must raise #FosterYouthVoices. https://t.co/w5L7uLJAHT","date":"Sat May 16 00:42:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census?  Temporary assistance for families who need it most. https://t.co/Lv6ko4nUeB https://t.co/cz44CbqZjh","date":"Fri May 15 13:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Are you a teacher during this pandemic? @TheBlackCaucus wants to hear from you.\n\nhttps://t.co/RG4AHosKFa https://t.co/TQv0JR5JGZ","date":"Thu May 14 16:56:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Breonna was sleeping.","date":"Thu May 14 15:23:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Breonna Taylor was working as an EMT helping to save lives while trying to protect her own. \n\nShe was shot 8 times when plainclothes police officers burst into her apartment with no warning while she was asleep. \n\nWe run with Ahmaud. We stand with Bre.\nhttps://t.co/1YFgG6McYy","date":"Thu May 14 03:31:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Census Data is not released to the public until 72 years after its collection. Fill out yours today at https://t.co/Fcg3WPDpBF https://t.co/zJqoqCQKNf","date":"Tue May 12 23:45:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Ebony's father has been in prison for 31 years. He told her men have been making masks out of underwear from the commissary to protect themselves during this pandemic. \n\nThis is absolutely unacceptable. https://t.co/hGuxhncbtZ","date":"Tue May 12 21:31:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us tonight! #SpeakUpSpeakOut\n\nhttps://t.co/RG4AHosKFa https://t.co/8omlhleVoW","date":"Mon May 11 16:29:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Friday, the Trump administration vetoed a United Nations resolution that called for a global ceasefire in conflicts to collectively focus on the COVID-19 pandemic.\n\nWe have the most deaths and the most infections in the world.\n\nWhat will it take for this to be taken seriously?","date":"Sun May 10 16:35:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Under the leadership of this administration during this pandemic, the United States now has the most CASES of COVID-19 in the world, the most DEATHS from COVID-19 in the world, and the highest unemployment rate since the Great Depression.","date":"Fri May 08 20:16:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You can't tell the general public to do social distancing, wear masks and wash their hands and then have the exact opposite in a prison.","date":"Fri May 08 14:42:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? Funding for school lunch for kids who can’t afford it. https://t.co/Lv6ko4FvDb https://t.co/zL8nQbl03F","date":"Fri May 08 14:32:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Black lives lost for no reason. Years ago you weren't prosecuted for lynching Black people.\n\nToday, the noose has been replaced with a gun.\n\nStill no justice. https://t.co/zJ4mxOb6qJ","date":"Thu May 07 20:07:12 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Trayvon was walking home.\nOscar was riding the train.\nTamir was playing outside.\nCharleena, Atatiana, Aiyana and Botham were all at home.\nEric and Philando were following orders.\n\nAhmaud was jogging.","date":"Thu May 07 20:06:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This Monday, the @TheBlackCaucus will be hosting a town hall to hear the needs of essential workers throughout the country. \n\nJoin us: https://t.co/RG4AHosKFa https://t.co/V7EmNTND8a","date":"Thu May 07 18:34:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The disproportionate impact this pandemic is having on our communities will be exacerbated in states opening before health officials are advising them to. https://t.co/9vFuUMWnle https://t.co/ptcvIgpHOK","date":"Wed May 06 22:50:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Tomorrow at 9:30 AM PT, I'll be joining a virtual town hall with experts and service providers who will be reviewing programs for small businesses and nonprofits in LA. \n\nSign up here: https://t.co/ZuSMoRQCjt","date":"Wed May 06 18:00:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We're in a pandemic. No one should be in jail because they violated parole by missing a meeting. No one should be in prison because they couldn't make $1,000 bail.\n\nThanks to @theonlyjasonlee, @MissMelyssaFord, @TheRealDJDAMAGE and the @HollywoodUL team for raising this issue. https://t.co/WwlDZnZsOd","date":"Wed May 06 17:43:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Census counts everyone living in the U.S. regardless of immigration status. Fill out yours today at https://t.co/H8DEojxLf6 https://t.co/ANaGvjul7U","date":"Mon May 04 20:31:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You answered the call to serve, now we're answering to you.\n\nThe @TheBlackCaucus is hosting a virtual town hall tomorrow with first responders throughout the country. More here: https://t.co/RG4AHosKFa https://t.co/quisDB45rI","date":"Sun May 03 20:58:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No one's 18 year-old daughter should have to go every day wondering if her mother is going to die from COVID-19 while serving a 60-month sentence in prison. https://t.co/4KvGv7llgz","date":"Fri May 01 23:14:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census?\n\nFunding for higher education.\n\n#2020Census \n\nhttps://t.co/dfYwaRGkmZ https://t.co/hxjm6Y8UyI","date":"Fri May 01 18:19:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This May, we come together to celebrate the experiences of the youth who are in, or have been in, the child welfare system and raise awareness about their needs -- especially in the wake of the COVID-19 pandemic.\n\nIt is critical now more than ever to raise #fosteryouthvoices. https://t.co/mMl9SlqWaO","date":"Fri May 01 15:20:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The @TheBlackCaucus is hosting a virtual town hall on Monday with first responders throughout the country. \n\nYou answered the call to serve, now we're answering to you.\n\nhttps://t.co/RG4AHosKFa https://t.co/aqDM00IrC6","date":"Fri May 01 13:56:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Missing my friend Mischa who passed away last year. https://t.co/EAJJA1dWjI","date":"Fri May 01 00:47:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Pregnant women who are incarcerated should not be in tiny prison cells during a global pandemic.\n\nAndrea Circle Bear should not be dead right now and neither should the 30 other federal prisoners who have passed away due to COVID-19. https://t.co/gcTTBtRN7M","date":"Thu Apr 30 13:43:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"My partner is serving 12 years for a drug charge. He needs your help so this doesn't become a death sentence.\" \n\nAlice is a nurse on the frontlines of this pandemic. \n\nShe should not have to wake up every day and wonder if her partner is going to die of COVID-19 in prison. https://t.co/3kkkRsuNhZ","date":"Wed Apr 29 18:41:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Due to the COVID-19 outbreak, the deadline to fill out the census has been extended to October 31st. Fill out yours today at https://t.co/H8DEojg9Qw https://t.co/nmoRcOsXna","date":"Mon Apr 27 19:48:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our event for small business resources will be starting shortly! Check out https://t.co/xvPEn4TXUM for more information. https://t.co/Ehl3rvPvRz","date":"Mon Apr 27 16:04:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The Paycheck Protection Program will reopen tomorrow morning at 10:30 AM ET with new funding that Congress allocated last week.\n\nThe Congressional Black Caucus is having a town hall at 2:00 PM ET to discuss how to get some of that money.\n\nRSVP: https://t.co/RG4AHosKFa https://t.co/F9rF1l64VD","date":"Mon Apr 27 00:08:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Congress just allocated additional funds to relief for small businesses and non-profits. I'll be participating in a telephone town hall with @TheBlackCaucus on Monday to discuss access to these resources.\n\nFind more information here: https://t.co/IJ8M7BMw0v https://t.co/CvcLTlfFXK","date":"Sat Apr 25 03:55:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today marks the 105th anniversary of the Meds Yeghern and the first since Congress officially recognized the Armenian Genocide. We join in solidarity, honoring those systematically expelled and killed and are reinvigorated in our efforts to protect human rights around the world.","date":"Sat Apr 25 02:57:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"African Americans make up 14% of this country but 33% of the reported deaths due to COVID-19.\n\nThat’s wrong. https://t.co/rr8Lc4Xm35","date":"Sat Apr 25 01:47:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"For Muslim communities across the country, tonight marks the beginning of the Holy Month of Ramadan—a time of fasting, reflection and renewal.\n\nWhile iftar and taraweeh traditions will be different this year, we wish health, peace and blessings to all observing. Ramadan Mubarak!","date":"Fri Apr 24 01:33:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The bill passed today begins the process of addressing the disproportionate impact COVID-19 is having on Black America.\n\nWhen we gather again to pass another bill, we must include targeted resources that support aggressive interventions. https://t.co/6pDW9dUTcV","date":"Thu Apr 23 23:09:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Given health issues faced by African Americans, I wonder how Black folks fair when these decisions are made?\n\nThis crisis is not over we need ventilators here in US hospitals. 3/3 https://t.co/Tr8qiDxS49","date":"Thu Apr 23 02:46:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Hospitals give priority to healthy people who are in better condition to recover. 2/ https://t.co/XAIHHvveUn","date":"Thu Apr 23 02:45:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why are we sending ventilators overseas when hospitals in the US are making decisions to prioritize who gets ventilators because there aren’t enough? 1/\nhttps://t.co/eUY7aOjvM0","date":"Thu Apr 23 02:42:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If a house is on fire, the fire department doesn't go visit every house in the neighborhood -- they go to the house that's on fire.\n\nOur community is on fire in this pandemic. \n\nWe need focused and concentrated testing. https://t.co/GEUU5QVc0m","date":"Wed Apr 22 18:55:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As we saw last night, earthquakes do not wait for pandemics to be over. \n\nNow is the time to prepare: https://t.co/CjMrbvjiiu","date":"Wed Apr 22 16:51:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census?\n\nInfrastructure.\n\nhttps://t.co/dfYwaRGkmZ https://t.co/aZhjJ2cGDN","date":"Wed Apr 22 03:31:51 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You can't socially distance in a prison.","date":"Wed Apr 22 00:47:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Our population without homes, our population in the child welfare system, our population in prisons -- they're interconnected. \n\nNow we have a pandemic and the most vulnerable populations in society are being hit the hardest. https://t.co/tf2xbLg04g","date":"Tue Apr 21 21:55:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On Yom HaShoah, the world comes together in grief and remembrance for the millions of Jews murdered in the Holocaust, a permanent scar on the body of human history.  \n\nIn community and in solidarity, we say: Never Again","date":"Tue Apr 21 19:45:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"You can't tell the general public to do social distancing, wear masks and wash their hands and then have the exact opposite in a prison.\n\nYou can't socially distance in jail, masks aren't always being provided, and sometimes you don't have access to running water.\n\nThis is wrong. https://t.co/G3DtusK5hv","date":"Mon Apr 20 23:26:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The history of institutional racism in this country is a pre-existing condition for Black America.\n\nCOVID-19 is putting that on display for all to see. https://t.co/maIRDVsRuo","date":"Fri Apr 17 21:14:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The 2020 census form does not include a citizenship question. Fill yours out today at https://t.co/Fcg3WPDpBF https://t.co/c4Niv9lDbm","date":"Fri Apr 17 18:15:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No one should die in jail from COVID-19 because they were driving on a suspended license due to an unpaid traffic ticket.","date":"Fri Apr 17 01:37:03 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This pandemic has exposed the deficiencies and inequalities of our healthcare system that Black communities know all too well, and have experienced for generations. \n\nNow is the time to use race-based data to finally address these disparities.\nhttps://t.co/kAjrq6vTI0","date":"Thu Apr 16 17:39:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Six years ago yesterday, 276 girls were abducted from their school in Chibok, Nigeria by Boko Haram. Their stories will not be forgotten. #BringBackOurGirls","date":"Wed Apr 15 17:14:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Black America is being disproportionately impacted by COVID-19. We need focused and concentrated testing and we need funding for our communities and after this pandemic is over, we need to attack the longstanding structural inequalities in this country that have led to this. https://t.co/ju0u9e9JH0","date":"Wed Apr 15 03:56:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This administration should be taking every single step possible to build a coalition to defeat this virus. \n\nAnd we must. 5/5","date":"Tue Apr 14 23:33:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"More brothers and sisters will be infected, more mothers and fathers will be admitted to already struggling hospitals and more grandparents will die. \n\nThis is an attempt by the administration to shift blame away from its own failure to heed internal warnings. 4/","date":"Tue Apr 14 23:31:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"To abandon this international effort days after our country has officially suffered the world’s largest death toll at the hands of COVID-19 is especially insidious. 3/","date":"Tue Apr 14 23:30:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As past administrations have done successfully prior, we should be investing in our response capacity and rallying the entire world to respond unified to the crisis before us. 2/","date":"Tue Apr 14 23:29:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Donald Trump’s absolute abdication of international responsibility and leadership is now unequivocally apparent.\n\nTonight’s move to halt funding to the World Health Organization in the middle of a global pandemic is the exact opposite of what this country should be doing. https://t.co/rCT86qpwl0","date":"Tue Apr 14 23:29:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Why fill out the census? \n\nFood access. \n\nhttps://t.co/Lv6ko4FvDb https://t.co/bVP0wJW8Cc","date":"Mon Apr 13 21:47:26 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I hope everyone has a joyful, happy and safe Easter!","date":"Sun Apr 12 21:47:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Powerful. Thank you ⁦@BarbraStreisand⁩.  https://t.co/EzO8dclWEI","date":"Sat Apr 11 19:25:35 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The disproportionate COVID-19 infection and death rates among Black America are manifestations of longstanding structural inequalities in this country.","date":"Sat Apr 11 02:30:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Nursing home and home care workers continue to work on the front lines during this healthcare crisis. \n\nThey deserve personal protective equipment as they work to save lives every day. \n\n#ProtectAllWorkers #GetMePPE","date":"Thu Apr 09 16:08:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The discussion about combatting the spread of COVID-19 in this country must include a discussion about those in jails and prisons in this country. \n\nThank you @llcoolj for elevating this issue. https://t.co/vYVZYjdcyx","date":"Thu Apr 09 02:54:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As Jews around the country begin their Passover celebrations this evening, there is another reason to feel that this night, in this year, is different from others. What remains constant, though, is the hope and joy of the season and the celebration of perseverance. Chag Sameach!","date":"Wed Apr 08 22:29:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"When a child ages out of the foster care system by turning 18 or 21, they're sometimes kicked out of where they were living, given their possessions in a trash bag, and told good luck. \n\nIt was wrong to do it before this pandemic, and it’s especially wrong to do it now. #UpChafee","date":"Wed Apr 08 15:28:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The disproportionate COVID-19 infection and death rates among African Americans are manifestations of longstanding structural inequalities in this country.\n\nThank you @drsanjaygupta for understanding of these health disparities amongst African Americans in this country. https://t.co/uhBaikOl8y","date":"Wed Apr 08 01:55:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's Public Health Awareness Week.\n\nThere should be COVID-19 tests being performed right now in every single prison and jail in this country.","date":"Wed Apr 08 00:17:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is because of genocide, neglect and abandonment by the US government. \n\nThere must be a sustained, concerted effort to properly and effectively assist the sovereign nations as we combat this disease.   \nhttps://t.co/KVY808dy4k","date":"Tue Apr 07 19:06:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"These disparities are replicating throughout the country. We must act intentionally to address these disparities if we are serious about preventing the further spread of this disease.\nhttps://t.co/0kZjUWdlqb","date":"Tue Apr 07 16:13:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"African Americans account for 35% of COVID-19 cases and 40% of COVID-19 deaths in Michigan. \n\nWe make up only 14.1% of the state’s population. 1/","date":"Tue Apr 07 16:13:08 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"People in prison can't practice social distancing. \n\nHow can you maintain proper hygiene without access to soap and water? \n\nWe need to test people in prison. \n\nWe need to protect high risk individuals. \n\nThis is not that.\nhttps://t.co/ZVlBZi1VB8","date":"Mon Apr 06 22:15:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No one should die in jail from COVID-19 because they couldn’t post a $1,000 bail.","date":"Mon Apr 06 14:20:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Leadership during an outbreak matters. https://t.co/T4BR7buN7v","date":"Sun Apr 05 19:37:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Some, times in our lives, \nwe all have pain,\nwe all have sorrow;\nBut, if we are wise,\nwe know that there's,\nalways tomorrow.\n\nLean on me.\n\nThank you Bill Withers for your voice, your words and your songs, which remind us in the end, joy, happiness and love will transcend time. https://t.co/qxueTFfFtn","date":"Fri Apr 03 17:37:55 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We MUST ensure they receive the assistance they need if we want our public health to recover. 2/2","date":"Thu Apr 02 23:38:18 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are hundreds of thousands of immigrants in this country that are on the frontlines of this pandemic. \n\nThey are in our hospitals, our factories, and our grocery stores. \n\nThe latest stimulus leaves many of them out, especially our #Dreamers. 1/","date":"Thu Apr 02 23:37:55 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s the beginning of the month.\n\nLandlords in the City of Los Angeles are prohibited from evicting residential tenants during this emergency period if the tenant is unable to pay rent due to circumstances related to the pandemic.\n\nKnow your rights: https://t.co/kl63cJltyp","date":"Thu Apr 02 17:55:34 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Millions of people have lost their job in the past month, and with it - their health coverage. A special enrollment period could have extended the opportunity for them to seek out newly-needed coverage.\n\nThe President is incapable of feeling empathy for another human being.","date":"Thu Apr 02 15:25:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"“We can’t seek achievement for ourselves and forget about progress and prosperity for our community... Our ambitions must be broad enough to include the aspirations and needs of others, for their sakes and for our own.”\n\nToday, we honor a leader, an activist &amp; more - Cesar Chavez","date":"Wed Apr 01 03:58:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, on the one year anniversary of his death, we celebrate the life he lived and the spirit he left. \n\nThe legacy of Nipsey Hussle endures. \nhttps://t.co/WzXh0WKf4D","date":"Tue Mar 31 18:22:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We still feel that love and we show it right back.\n\nYou can see our love for him on our clothes.\n\nYou can see our love for him in our work.\n\nYou can see our love for him in the murals on our walls throughout the neighborhoods of South LA. https://t.co/k4RGVLyd4R","date":"Tue Mar 31 18:16:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Nipsey Hussle was a visionary.\n\nYou can see the love he had for the community in his investments.\n\nYou can see the love he had for the community in his philanthropy.\n\nYou can see the love he had for the community in initiatives like @destinationshaw, which just broke ground. https://t.co/w4HL28MZ4Z","date":"Tue Mar 31 18:14:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Focus on getting people their much-needed checks like Congress has ordered you to do. \n\nFocus on following the recommendations of the health professionals around you. \n\nFocus on coordinating an INTERNATIONAL coalition to address this crisis. \n\nFocus on doing your JOB.","date":"Sun Mar 29 21:20:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Here’s an idea: \n\nFocus on getting our hospitals respirators. \n\nFocus on getting our medical professionals sufficient equipment. \n\nFocus on taking central command of resources so states don’t have to bid against each other for supplies.","date":"Sun Mar 29 21:19:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Having people confined in close quarters becomes a breeding ground for the virus. We must do everything we can to combat this spread. 6/6","date":"Sun Mar 29 20:06:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Those who are in jail because they can not afford bail and are not a flight risk should be released from prison as well. 5/","date":"Sun Mar 29 20:06:31 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Resources should be given to organizations that work with the formerly incarcerated to ensure these individuals actually have a place to go so that we are not increasing the homeless population. 4/","date":"Sun Mar 29 20:06:13 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Those who test positive should be isolated and treated. \n\nThose who test negative and are senior citizens, pregnant women, or children who are not convicted of violent crimes should be released in a secure manner. 3/","date":"Sun Mar 29 20:05:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every single person in federal prison - employees and incarcerated individuals - should be tested immediately. 2/","date":"Sun Mar 29 20:05:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Failing to take drastic measures to combat the spread of this disease in prison will result in a magnified impact on ALL of society. 1/\nhttps://t.co/qJBTZyhMvs","date":"Sun Mar 29 20:04:55 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The idea of a check for relief was great but especially in LA, it's only going to go so far. If you lose your job and spend your check, then what? \n\nThat's why we made sure to include increased unemployment benefits in the stimulus package. \n\nLearn more: https://t.co/q660xo5Na4 https://t.co/MPVNRjVfjv","date":"Sun Mar 29 04:19:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We will never forget his legacy and we will continue to advocate for all that he fought so hard for. \nhttps://t.co/Icca4CsKuz","date":"Sun Mar 29 00:44:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"\"Help us to make choices on the side of love, not hate; on the side of inclusion, not exclusion; tolerance, not intolerance.\"\n\nReverend Joseph Lowery dedicated his life to fighting racism and inequality as an activist, an organizer, and a leader of the civil rights movement. https://t.co/ZL7U7U4jwH","date":"Sun Mar 29 00:41:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"A week ago, there were around 8,000 cases of COVID-19 in the United States. Since then, that number has multiplied by ten. \n\nIt is shameful that the world's richest country has the most cases in the world. \n\nThis was mishandled from the beginning and left our country unprepared. https://t.co/vb4YVdsHWM","date":"Sat Mar 28 20:59:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last week, there were 15,219 reported cases in the US of COVID-19. \n\nNow, there are nearly 85,000.\n\nLast week, 206 people in the US had died because of COVID-19. \n\nNow, it's more than 1,000. \n\nBe careful and be safe. Nothing is more important than your health.","date":"Thu Mar 26 23:37:47 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We have to stay strong.\n\nWe have to follow public health guidelines.\n\nWe have to make sure we do everything we can to make sure our community gets through this crisis. \n\nhttps://t.co/z08Mh8MeDS https://t.co/KGfS1smHtV","date":"Thu Mar 26 18:10:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"To our medical professionals, our postal workers, our grocery store employees, our police officers, our pharmacy workers, our store clerks, our firefighters, and everyone else who is showing up for work day after day to make sure that our system continues to work...\n\nThank you.","date":"Thu Mar 26 02:21:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As we see the impact this virus is having on communities, we want to make sure that vulnerable populations don't fall through the cracks. \n\nI'm worried about the people that don't necessarily have a voice in the Oval Office. https://t.co/H25NNDegYn","date":"Thu Mar 26 00:14:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I used to work in an ER that was frequently low on supplies. During this pandemic, we've been sending health care workers to war to fight a war with pool noodles instead of swords. Hospitals need our help. https://t.co/p0HTUItDWO","date":"Wed Mar 25 21:35:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In the midst of a pandemic, only taking advice from certified medical professionals can be a matter of life or death.\nhttps://t.co/Auj5adc2Wr","date":"Wed Mar 25 20:05:20 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is a crime that we were not prepared when this administration knew that this outbreak was on the horizon. \n\nI used to work in an ER that often was often low on supplies. We've been sending health care workers to war to fight a war with pool noodles instead of swords. https://t.co/np1ADkhHBO","date":"Tue Mar 24 18:25:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It's great if we can include checks in this stimulus package, but if you've been laid off from your job and you've already spent your check, what are you supposed to do?\n\nWe MUST ensure that we beef up unemployment insurance. https://t.co/kriNFI8gnN","date":"Tue Mar 24 16:58:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"LAUSD will continue to provide nutritious meals to all students who need them during the temporary closure of schools. \n\nTo find the closest Grab &amp; Go Food Center to you, click here: https://t.co/GSJH7JxBSI","date":"Mon Mar 23 17:47:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"No.","date":"Sun Mar 22 15:14:46 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Join us at noon PT!","date":"Sun Mar 22 15:00:45 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If we're thinking about a bailout for the airlines, we need to include the flight attendants, the folks who clean the planes, and the folks that work at the restaurants in the airports.\n\nIf we leave them out, this won't work. https://t.co/IOAaR6n1cX","date":"Thu Mar 19 23:45:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"LAUSD will continue to provide nutritious meals to students who need them during the temporary closure of schools. Grab &amp; Go Food Centers will be open beginning tomorrow. For more info and to find the closest center to you, click here: https://t.co/GSJH7JxBSI","date":"Tue Mar 17 13:55:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"During this pandemic, Fareed Zakaria said it best:\n\nInstead of the intelligence and expertise of South Korea, Donald Trump is emulating the sycophancy, incompetence and propaganda of North Korea. \nhttps://t.co/Lf7c4a4sVD","date":"Sun Mar 15 22:47:21 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"South Korea has tested more than 230,000 cases with a population of about 50 million. \n\nTo be on track with South Korea, we would have needed to test about 1.5 million people. \n\nWe’ve conducted less than 20,000 tests.","date":"Sun Mar 15 22:46:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"When colleges and universities close due to this pandemic, there MUST be a plan in place for students who may have nowhere to go. \n\nFoster youth will be disproportionately affected if there isn’t. \n\n#FosterYouthVoices","date":"Sun Mar 15 17:48:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last night we passed legislation to provide free coronavirus testing, strengthens food assistance programs, enhances unemployment aid and establishes paid leave. \n\nThis bill needs to be signed into law immediately. https://t.co/YXMow7MesJ","date":"Sun Mar 15 01:00:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We just voted to expand access to free testing, provide $1 billion in food aid and extend sick leave benefits to vulnerable Americans in the midst of this pandemic.\n\nWe just voted for the American people.","date":"Sat Mar 14 05:05:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s sad the President of the United States continues to be so disrespectful of women, especially women of color. \n\nIt’s interesting he only says “nasty” when he talks about us or the things we say. \n\nReminder: we are in the midst of a global pandemic. https://t.co/YS7KD2SE0k","date":"Fri Mar 13 22:52:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Disinformation can cost lives during a worldwide pandemic. https://t.co/eMDQwRf7bV","date":"Fri Mar 13 02:04:28 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I worked in an emergency room for years. There is CONSENSUS in the medical field: if we can’t get enough people tested, we will not be able to combat this disease. \n\nRight now there are not enough tests.  \n\nWe are not prepared.\n\nINEXCUSABLE.","date":"Thu Mar 12 02:48:25 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"What happens this year with the census is going to impact us not just for the next 10 years, but potentially for a generation. https://t.co/CdLKTJH5Tz","date":"Wed Mar 11 20:24:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The 2020 census could lead to the worst undercount of Black and Latinx people in 30 years. \n\nBe prepared to ensure your community gets counted! \nhttps://t.co/YHaRwIdhjt","date":"Tue Mar 10 18:26:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The resolution I introduced on this issue was JUST passed, which means it is now the sense of the entire House of Representatives to encourage reunions of divided Korean American families. Never let someone tell you that your voice does not matter. 2/2","date":"Mon Mar 09 23:03:19 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last year, I met with Kyung Joo Lee, a 90-year-old Korean American who has not seen four of his siblings since he fled North Korea more than 70 years ago. He cried as he held my hands and urged me to do what I can to help Korean families to be reunited. 1/ https://t.co/E2gcpcldUw","date":"Mon Mar 09 23:02:20 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Increase the capacity of our medical system — we must use our emergency response mechanisms to mobilize resources and facilities in order to respond to surges in demand.\n\nIt's time to act. 9/9","date":"Mon Mar 09 20:21:41 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Anti-price gouging protections — we must ensure that Americans are protected from price gouging of medical and non-medical essentials during this emergency 8/","date":"Mon Mar 09 20:21:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Affordable treatment for all — patients must be reimbursed for any non-covered coronavirus-related costs, or else the epidemic will be worsened because Americans will fear they cannot afford the costs associated with treatment 7/","date":"Mon Mar 09 20:21:14 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Widespread and free coronavirus testing — the administration must ensure that all Americans who need an evaluation are able to access locations for cost-free testing and rapidly increase the unacceptably low daily test processing capacity inside the U.S. 6/","date":"Mon Mar 09 20:21:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Clear protections for frontline workers — we must have clear standards &amp; sufficient distribution of necessary protective equipment for health care &amp; other workers who are in contact with people who have been exposed as well as the people who clean those facilities 5/","date":"Mon Mar 09 20:20:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Food security — we must expand SNAP, WIC, school lunch and other initiatives and suspend implementation of any regulations that weaken federal food assistance, in order to ensure vulnerable populations do not lose access to food during this epidemic 4/","date":"Mon Mar 09 20:18:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Enhanced Unemployment Insurance — we must ensure unemployment insurance benefits are available and sufficient for workers who may lose their jobs from the economic impacts of the epidemic 3/","date":"Mon Mar 09 20:18:09 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Paid sick leave — workers impacted by quarantine orders or responsible for caring for children impacted by school closures must receive paid sick leave to alleviate the devastating consequences of lost wages. 2/","date":"Mon Mar 09 20:17:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"[THREAD]: In the midst of this outbreak, the administration must prioritize the health and safety of American workers and their families over corporate interests. \n\nHere's how: 1/","date":"Mon Mar 09 20:17:42 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If we want to stop the spread of this disease, there needs to be paid sick leave and free testing. Period.","date":"Mon Mar 09 03:27:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This will add to the trauma already experienced by the child but also data shows that cases become unreasonably and unacceptably unfair when they take place by video. \n\nThe Department of Justice must suspend this attempt to further traumatize children in its care. 3/3","date":"Fri Mar 06 21:17:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"My office just got word that in 3 days, the Department of Justice will begin piloting this technique for immigrant children detained in Houston. Instead of being in the same courtroom as the judge, they will see their judge, who will be 800 miles away in Atlanta, on a screen. 2/","date":"Fri Mar 06 21:16:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Imagine you’re an 8 year old child in a country you’ve never been to hundreds of miles from a home you will never see again and you’re walked into a courtroom with zero people in it. \n\nAll that’s there is a TV screen showing you a judge, an ICE attorney and your interpreter. 1/","date":"Fri Mar 06 21:15:19 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The #2020Census starts one week from today.\n\nKnow what to expect. Know what's at risk.\n\nhttps://t.co/Lv6ko4FvDb https://t.co/ApJI85Co6V","date":"Thu Mar 05 22:52:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The World Health Organization predicted there would be more than 1.4 million cases of Ebola by January 2015.\n\nThe actual amount recorded turned out to be less than 2% of that because of Obama’s international fight against the disease.\n \nThat’s how a real President leads. 2/2","date":"Wed Mar 04 22:59:38 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Trump on the coronavirus: “One day, it’s like a miracle. It will disappear.”\n\nObama on Ebola: “Don't standby thinking that somehow because of what we’ve done... it’s taken care of. It’s not.”\n\nThe ignorance of this President is a threat to the health and safety of this country. https://t.co/T4BR7buN7v","date":"Wed Mar 04 22:58:42 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Thank you to @MayorOfLA Eric Garcetti and the LA Board of Supervisors for taking the #coronavirus outbreak so seriously. \n\nYou can find updates from the Centers for Disease Control and Prevention here: https://t.co/ciDHwLaX2b 2/2","date":"Wed Mar 04 20:11:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It is important to note that a State of Emergency does not mean that there is a massive outbreak of the coronavirus in Los Angeles. \n\nThis is an important preventative step to combat the further spread of this disease. 1/","date":"Wed Mar 04 20:11:10 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today: VOTE\n\nTomorrow: @mhdcd8 and the City of Los Angeles Personnel Department will be hosting an event where you can learn about the Civil Service process in the City and begin an the application process right on the spot!","date":"Tue Mar 03 22:05:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today's the day!\n\nFind your voting center here: https://t.co/5PUXJWmGAI\n\n#CaliforniaPrimary","date":"Tue Mar 03 18:10:32 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The reason why being dishonest for 3 and a half years is so dangerous is that at some point, there is a time when lives depend on the truth. \n\nThat's where we are with the Coronavirus. https://t.co/1NNGsCo40S","date":"Tue Mar 03 03:20:44 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"What better way to end #BlackHistoryMonth than with a reminder that we are living it? Go Bruins! #BlackGirlMagic \n\nhttps://t.co/tKJhOHtqIu","date":"Sat Feb 29 22:09:48 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"One year and one day ago, I stood on the House Floor and voted to pass gun violence prevention legislation to help address the crisis that has impacted millions.\n\nOne year and one day later, still no action from the Senate. https://t.co/KKECgKYZxh","date":"Fri Feb 28 23:54:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The marketing of flavored cigarettes is the 2020 version of Joe Camel and candy cigarettes. \n\nToday, Congress takes action. https://t.co/y2zJJOi93T","date":"Fri Feb 28 17:10:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"As I write this, the youth tobacco epidemic is surging, driven on by new products like e-cigarettes. \n\nToday, Congress takes action.\n \nTune in at 9 am ET as Democrats discuss the Reversing the Youth Tobacco Epidemic Act ahead of today’s vote: https://t.co/782QLkrjLt","date":"Fri Feb 28 13:01:33 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, I called a hearing focusing on the challenges and opportunities of reentry after prison. No one knows our system better than those who have served time and the consensus today was clear: \n\nIf you wait to combat recidivism until someone is released, you could be too late. https://t.co/jjLLq8PcUA","date":"Fri Feb 28 00:42:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, the House of Representatives passed the Emmett Till Anti-lynching Act to designate lynching as a hate crime under federal law. \n\nFinally. https://t.co/2ZkgkjE1wC","date":"Thu Feb 27 02:31:54 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Every time there is a mass shooting in this country, we ask why.\n\nToo many times, the answer is because a lack the courage to act.\n\nTomorrow marks 365 days that gun reform legislation we passed has been sitting on Mitch McConnell's desk.\n\nMilwaukee is in our hearts tonight.","date":"Thu Feb 27 00:03:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"NO child should EVER be zip-tied, handcuffed or restrained in any way and then perp-walked out of their elementary school.\n\nThere is NEVER a good reason to arrest a baby.","date":"Wed Feb 26 23:05:15 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"“What are those for?” – Kaia, age 6\n\n“They’re for you.” – An Officer\n\n“Don’t put handcuffs on!” – Kaia, age 6\n\n“I want to stay at school!” – Kaia, age 6\n\n“Help me, PLEASE!” – Kaia, age 6\n\n“PLEASE! HELP ME!” – Kaia, age 6\n\n“PLEASE LET ME GO!” – Kaia, age 6\n\nThis is CHILD ABUSE. https://t.co/tOcDWO2NAq","date":"Wed Feb 26 22:28:22 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"A constituent called my office last week to ask whether she’d be able to ever see her husband again since he was in Nigeria when Trump expanded his Muslim Ban. \n\nThat’s the kind of terror this ban has caused. \n\nThat’s the kind of terror we must act to stop. \n\n#NoBan https://t.co/qPFn3LWM96","date":"Wed Feb 26 15:42:36 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last month I met with Maurice Kamto to discuss democracy and human rights in Cameroon. Now as he returns there, he is concerned for his safety. Democracy can't survive under threat of violence. I urge President Biya to allow Mr. Kamto to exercise his civil liberties without fear.","date":"Tue Feb 25 01:21:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"“God knew they couldn’t be on this Earth without each other.” – Vanessa Bryant\n\nThey loved our city. \n\nToday, we return their love. \n\nThe legend of Kobe and GiGi Bryant will live on forever. \n\n#KobeFarewell https://t.co/sCh61kLz9e","date":"Mon Feb 24 19:31:40 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today we celebrate a hero. Happy birthday Congressman Lewis. https://t.co/DrkMtgK2qX","date":"Fri Feb 21 23:44:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Rita you will be missed. \n\nYour spirit fights on in all of us. 3/3\nhttps://t.co/VpqmUlZMRR","date":"Fri Feb 21 19:07:49 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"From serving as the only Black member of a school board whose majority opposed forced integration to serving as the first Black woman elected to the LA City Council, Rita’s commitment to fighting for a better city blazed the trail for so many of us who grew up in LA schools. 2/ https://t.co/K4e2f4710h","date":"Fri Feb 21 19:06:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Rita Walters was a close friend of my family and a mentor who encouraged my involvement in public service every step of the way starting with nominating me to serve as a student representative to a Board of Education Task Force when I was in middle school. 1/ https://t.co/XCAXfTfUwN","date":"Fri Feb 21 19:05:05 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Next week, the House of Representatives, which once included owners of enslaved Africans and Ku Klux Klan members, will vote on legislation to finally designate lynching as a hate crime under federal law. \n\nIt's time. We cannot wait any longer. https://t.co/Kdm1vyzr0p","date":"Fri Feb 21 00:31:37 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If you were concerned about corruption, would you pardon a bunch of people convicted of corruption? https://t.co/6f2Gh9yo6U","date":"Thu Feb 20 22:48:56 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"78 years today, Executive Order 9066 was signed. \n\nWe can never commit these mistakes again. https://t.co/HYk1CX0g5f","date":"Thu Feb 20 01:56:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Remember when we had a President we could be proud of? 8 years and no scandals, no indictments, no articles of impeachment — seems like a long time ago but it was only about 3 years ago. \n\nDon’t forget what a real President is like. November is in only 9 months. #PresidentsDay https://t.co/mpR2gZ2NDi","date":"Mon Feb 17 19:28:04 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We will never forget those who lost their lives at school that day. \n\nWe will never forget the tens of thousands who become victims of gun violence every year. \n\nWe will never forget to honor them all with action. \n\n#EnoughIsEnough \n\n3/3\nhttps://t.co/OKz32D4CPZ","date":"Fri Feb 14 16:41:24 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today, we remember their names.\n\nCarmen\nLuke\nNicholas\nPeter\nAaron\nAlaina\nJoaquin\nHelena\nAlex\nMeadow\nMartin\nGina\nAlyssa\nChris\nCara\nJaime\nScott\n\n2/ https://t.co/aLKQ9CX05B","date":"Fri Feb 14 16:35:52 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"2 years ago today, 17 students and teachers were killed at Stoneman Douglas High School in Parkland, Florida. \n\nOut of the tragedy, survivors have turned their pain into action, pushing Congress, states, and cities across the country to act to ensure this never happens again. 1/ https://t.co/L69RX6d7uy","date":"Fri Feb 14 16:33:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"How will history judge this President for proposing a 26% cut to the Environmental Protection Agency as the world burns?","date":"Fri Feb 14 03:31:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Last week, Trump said he'd protect Medicare.\n\nThis week, he proposed to cut it by $850 billion. https://t.co/U4otfoJqUY","date":"Thu Feb 13 23:01:03 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The #TrumpBudget is going to INCREASE student loan debt costs. \n\nIt won’t matter who you voted for. It won’t matter where you went to school. \n\nThe trillion-dollar crisis will RISE.","date":"Wed Feb 12 20:35:16 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In November, I went to the border to see the effects of this policy firsthand. \n\nThe #remaininmexico policy must end.","date":"Wed Feb 12 20:20:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We cannot continue to preach about democracy, the freedom of speech and the freedom of religion when we ban people from this country because of the faith they practice. https://t.co/C7VPkChaFa","date":"Wed Feb 12 18:48:11 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This is who Donald Trump is -- a corrupt politician who has violated the Constitution and feels emboldened by his phony exoneration. \n\nThis President is a clear and dangerous threat to our democracy. https://t.co/xU0f1Y8XtW","date":"Wed Feb 12 15:32:07 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"There are nearly 60,000 people that will sleep in LA without a home tonight. \n\nYesterday, Trump proposed a $8.6 billion CUT to the Department of Housing. \n\nNot a chance.","date":"Tue Feb 11 23:08:42 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In our district, groups like the In The Meantime Men’s Group, the Black AIDS Institute, and the OASIS Clinic work tirelessly towards these vital goals. Thank you for all the work you do. We’re in this, together. #NBHAAD","date":"Fri Feb 07 14:05:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Today is National Black HIV/AIDS Awareness Day – a day we remember to work collectively to reject stigmas surrounding HIV and encourage prevention, testing, and treatment in our communities.","date":"Fri Feb 07 14:05:30 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"On the day of the State of the Union, a magnitude 5 earthquake struck Puerto Rico. \n\nIt was the 11th earthquake of at least that size in the past 30 days. \n\nNow, the American President is threatening to withhold aid from affected Americans.\nhttps://t.co/220U0bAr7Y","date":"Thu Feb 06 22:10:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"We remember you Trayvon. https://t.co/eBciYEpVH0","date":"Thu Feb 06 00:39:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The world watched today as Donald Trump got away with abusing the power of his office and obstructing this country’s legislative body. \n\nThe world will take note and act accordingly. This is a significant and perhaps irreparable day in our history.","date":"Wed Feb 05 22:10:53 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Somebody get my Speaker a trash can. https://t.co/dPuMjBfCgh","date":"Wed Feb 05 03:45:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"I was in Sudan last week and Eritrea last year. Nigeria has the largest economy in Africa.\n\nBanning countries because of the religion of the people there or the color of their skin makes us no better than the evil the Trump administration is allegedly trying to shut out.","date":"Sat Feb 01 02:44:57 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"This just happened. Again.","date":"Fri Jan 31 23:37:29 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Kenya is a strong and vital partner to our country.\n\nThis morning @Ilhan and I met with @HonAdenDuale about wildlife and environmental conservation, regional security and ways our two countries can continue to work together.\n\nLooking forward to continuing that work. https://t.co/iyFnA5Bl5b","date":"Wed Jan 29 17:20:27 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"If we are collaborating internationally on combatting the SYMPTOMS of climate change, why aren’t we also collaborating internationally on combatting the CAUSES of climate change?\nhttps://t.co/FOwyG4sZpY","date":"Tue Jan 28 16:52:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"It’s really as simple as this:\n\nSenate Republicans: “There’s no evidence!”\n\nJohn Bolton: “I’ll testify and provide additional corroborating evidence” \n\n*Senate Republicans refuse to call for witnesses or further evidence.*\n\nSenate Republicans: “There’s no evidence!”\n\nYikes.","date":"Tue Jan 28 14:02:23 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Three years ago today, Donald Trump issued his Muslim immigration ban. Reports now indicate he may expand the bigoted order to include Sudan, Nigeria &amp; others. \n\nThis sends the wrong message to the people of these countries, to our allies, and to the rest of the world.","date":"Tue Jan 28 04:22:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"https://t.co/OdAzcaZz7d","date":"Tue Jan 28 00:56:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"In 2020, there is too much at stake. \n\nNext week, @TheBlackCaucus is bringing together leaders from across the country to discuss how we will prepare, how we will fight, and how we will make sure we are counted. \n\nJoin us. \n\n#CBC2020Summit https://t.co/1iGgE2TJ7s","date":"Mon Jan 27 23:33:00 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"75 years ago today, Allied forces entered and liberated the concentration camps at Auschwitz-Birkenau. \n\nWe must come together with one voice to say never again. \n\n#WeRemember. We will never forget. https://t.co/VO1y7VaKn1","date":"Mon Jan 27 21:27:01 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"My thoughts are with Vanessa and the rest of the Bryant family, in addition to all of the friends and family of others on board this morning.\n\nWe are with you. 3/3","date":"Mon Jan 27 04:43:39 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"His legacy is what the city will never forget. \n\nHis legacy is why kids around the world yell his name whether they’re shooting a basketball into a hoop or a piece of paper into a trash can. \n\nHis legacy is why tonight, our city mourns. 2/","date":"Mon Jan 27 04:41:43 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"Less than a year after winning his 5th championship, Kobe and Vanessa announced they would be stepping up to address the issue youth homelessness in Los Angeles.\n\nThis was before it was popularly viewed as a crisis or an epidemic. 1/ https://t.co/0RHjIpCeap","date":"Mon Jan 27 04:40:58 +0000 2020","user_id":"239949176"},{"handle":"RepKarenBass","text":"The fear that led to these masked, armed men marching through the streets of Virginia’s Capitol on Monday is being actively stoked by the President of the United States. https://t.co/kXwhb2sBPj","date":"Sat Jan 25 01:23:00 +0000 2020","user_id":"239949176"}]