[{"handle":"RepKClark","text":"A quiet tragedy in this country is that half of all gun deaths are by suicide. But we also know that we can save lives with red flag laws that allow people to intervene if someone poses a danger to themselves. This is an important step we can take to help #EndGunViolence https://t.co/IBqZ0uPH2A","date":"Fri Jun 17 01:45:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Major corporations are using the war in Ukraine to hike prices &amp; pocket record profits. And families are footing the bill.\n \n@HouseDemocrats are helping families by lowering fertilizer costs, increasing competition in the meat &amp; poultry industries &amp; bringing down gas prices.","date":"Thu Jun 16 16:53:29 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Moms have always understood the importance of child care. Now, the magnitude of the child care crisis has brought businesses to the table too. It’s time to fundamentally change the way we view, and fund, the care economy. #ChildCareIsInfrastructure  https://t.co/by0l6WyUbq","date":"Thu Jun 16 12:42:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"My friend &amp; colleague @RepLucyMcBath is one of our most outstanding members, especially when it comes to curbing gun violence. She's turned her own tragedy into action &amp; inspires me every day. In her words, this is our moment to #EndGunViolence. https://t.co/xusgapA953","date":"Wed Jun 15 22:07:43 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Gender-neutral restrooms ensure that every person - no matter their gender identity - feels safe in our nation's Capitol. I am proud to lead this effort and to partner with @RepJeffries to ensure that the People's House is a welcoming space for all.","date":"Wed Jun 15 16:56:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"For a decade, #DACA has given young Dreamers relief from the constant fear of deportation -- but it is only a band-aid on our broken immigration system. It’s time for a permanent solution.\n \n#NoSonOlvidados - you are not forgotten.","date":"Wed Jun 15 14:02:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As @HouseDemocrats work to lower costs for families, from groceries to gas, we also have to talk about the price of gun violence. Every year in America, gun violence costs $280 BILLION. We can save money, and more importantly, save lives, by fighting to #EndGunViolence. https://t.co/jY9KpG8NZq","date":"Tue Jun 14 22:37:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"✔️Cutting fertilizer costs for farmers\n✔️Boosting competition in the meat market\n✔️Reducing our dependence on foreign oil\n \nThis is how @HouseDemocrats are continuing to lower costs for families.","date":"Tue Jun 14 20:11:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"June is #PrideMonth &amp; there’s so much to celebrate — but we also have to recognize that the LGBTQ community suffers disproportionately from gun violence. We have the opportunity to do something about it, so this Pride Month, let’s pass bills that can #EndGunViolence &amp; save lives. https://t.co/xFWsigyklh","date":"Mon Jun 13 22:45:35 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight, @HouseDemocrats will send the #OceanShippingReformAct to the President's desk. It will lower costs for families by cracking down on ocean shipping fees that are driving up the costs of goods. Let’s get it done, #forthepeople.","date":"Mon Jun 13 21:57:37 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Congratulations @RepGraceMeng and all of @capac on the signing of this historic new law! It is long past time we celebrate the contributions of the #AAPI community &amp; memorialize the barriers they faced so we never repeat them.","date":"Mon Jun 13 19:49:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today marks 6 years since the Pulse shooting. Today we also learned of a deal in the Senate on a series of bills that could save lives &amp; help #EndGunViolence. Let’s honor those lost at Pulse &amp; every day in this country due to gun violence by making sure these bills become law. https://t.co/fbFm1CLAEF","date":"Sun Jun 12 21:52:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Two-thirds of women killed by an intimate partner are killed with a gun. Existing loopholes in federal and state law - like the boyfriend loophole - allow access to guns by abusive partners and stalkers, often with deadly results. It’s time we act to #EndGunViolence. https://t.co/TFh3InbURt","date":"Sat Jun 11 23:28:38 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I’m so proud of my Democratic colleagues who came together &amp; passed bills that can save lives &amp; #EndGunViolence. Now they’re off to the Senate where I hope my colleagues heard the words of the victims at our hearings &amp; will do everything they can to make our kids safer. https://t.co/hpYXYTqORl","date":"Fri Jun 10 22:30:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"From gas to groceries, I know rising prices are forcing families to make difficult decisions. I promise you, @HouseDemocrats are doing everything we can to help. Next week, we’ll address supply chain shortages &amp; competition in the meat market.","date":"Fri Jun 10 18:57:04 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As a mom, as a Congresswoman, and as an American, I refuse to accept inaction when it comes to the fight against gun violence.\n\nWill you join me in calling for Republican action? #EndGunViolence #GunViolenceAwarenessMonth","date":"Fri Jun 10 15:41:37 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every American should see for themselves the facts of what happened on January 6th. How close we came to losing our democracy. And what we are up against to save it. #January6thCommitteeHearings https://t.co/C1Qxecuoy1","date":"Fri Jun 10 02:16:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @HouseDemocrats passed a #RedFlagLaw to help temporarily remove firearms from individuals who are a risk to themselves or others. From MD to VT, we know these laws are highly effective. This is how we save lives. This is how we #EndGunViolence. https://t.co/YvBocD2wW9","date":"Thu Jun 09 21:22:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We will not back down in the fight for accessible child care. We will not be told we don’t belong in the economy. We will not be told that child care is not a public good. We will give our children a future worthy of them. #SolveChildCare https://t.co/oKNTZvgGLB","date":"Thu Jun 09 20:26:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"My response to the “Mapping Project”:\n\n@BostonJCRC @CJPBoston @ADL_NewEngland https://t.co/gbhKfVg5Di","date":"Thu Jun 09 16:49:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The freedom to live should always matter more than the freedom to carry.\n\nToday, @HouseDemocrats voted to enact red flag laws that would prevent guns from ending up in the wrong hands and keep Americans safe. #EndGunViolence","date":"Thu Jun 09 15:59:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight, I voted YES to protect our families and YES to save lives. #EndGunViolence #ProtectingOurKidsAct https://t.co/Oyr8J5fl5E","date":"Wed Jun 08 23:27:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"On my way to vote YES for commonsense measures to #EndGunViolence and save lives. Can I count on my Republican colleagues to do the same? https://t.co/sWiI50jRff","date":"Wed Jun 08 21:29:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our young people should be out playing sports, attending prom, and getting ready for summer break -- not pleading with their representatives to save them from gun violence. Grateful for the bravery and leadership of @AMarch4OurLives. Will the @gop finally listen this time? https://t.co/kCUHVpyzjc","date":"Wed Jun 08 17:04:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let me get this straight:\n\nThe @GOP believes gunning down varmint &gt; saving gun downed kids \n\nCommon sense gun reform provides us a path forward in place of these ridiculous false choices.","date":"Wed Jun 08 16:04:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Last night, I met with the incredible ⁦⁦@alexismcgill⁩, President &amp; CEO of ⁦@PPFA⁩. Like so many of you, she knows what’s at stake at this critical moment for reproductive freedom: everything. \n\nI’m proud to stand with her &amp; PPFA, and for abortion #BansOffOurBodies https://t.co/ToV9nQZXrl","date":"Wed Jun 08 13:31:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"In today’s GOP, if you come out for commonsense, lifesaving gun safety reform, you’ll be run out of town. Join me in telling your representatives that enough is enough. It’s time to #EndGunViolence. https://t.co/pQ7xZDXLud","date":"Tue Jun 07 21:09:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"11-year-old Miah smeared her classmates' blood on herself to play dead while the shooter in Uvalde killed her friends. Today, she joins the grim cohort of students, from Virginia Tech to Columbine to Parkland, who have come to Congress to beg for change. Will the @GOP listen?","date":"Tue Jun 07 15:33:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let’s be real. Strengthening mental health care was core to: \n-The Affordable Care Act\n-The American Rescue Plan\n-The Build Back Better Act\n\nAnd the GOP voted against all three.","date":"Tue Jun 07 13:23:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Access to a gun in the home increases the likelihood of death by suicide by 300%.  \n\nThis week, the House will be voting on a Red Flag bill - a vote YES is a vote to save lives &amp; keep guns out of the hands of those who may be a danger to themselves &amp; others. https://t.co/uqBitlyRfJ","date":"Mon Jun 06 23:20:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The 44% of Republicans who accept gun violence as the status quo have prioritized the freedom to carry over the freedom to live. That’s not what a free society looks like to me.","date":"Mon Jun 06 17:57:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"1 week. 18 mass shootings. This cannot continue. \n\n#EndGunViolence","date":"Mon Jun 06 12:30:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This week, let’s vote YES for the security of our kids and families. #EndGunViolence https://t.co/kUISboBdBh","date":"Mon Jun 06 01:18:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Prison time for pregnancy loss. In America.\n\nAnd without Roe, it will only get worse. We can’t sit on the sidelines. https://t.co/KKWBNrf9QS","date":"Sun Jun 05 15:46:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I'm in the airport headed home to see my family. In 2022, not a single week has gone by where we haven’t had at least 4 mass shootings. Think of all those families missing a loved one. Enough is enough. #EndGunViolence https://t.co/PcLVzHuZEE","date":"Fri Jun 03 18:14:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Moms demanding action. Moms demanding that we finally #EndGunViolence. https://t.co/YKOZ5ClNgZ","date":"Fri Jun 03 16:37:12 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Background checks \nRed flag laws \nSafe storage \nRaise the purchasing age \nClose the gun show loophole\nBan Assault weapons \n\nYes @potus. These policies will save lives. Let’s get it done.","date":"Fri Jun 03 00:37:45 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"1705 days since a mass shooting at a country music festival in Las Vegas killed 58 people and injured hundreds more. Republicans refused to act then but the @gop can act NOW to #EndGunViolence and save lives. We’re ready - are you?\n\n#GunViolenceAwarenessMonth https://t.co/Vrd4yww5e1","date":"Thu Jun 02 23:15:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Next week, @HouseDemocrats will vote on a package of gun safety bills. Will Republicans join us and protect American lives?","date":"Thu Jun 02 13:49:38 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Minutes after I posted this - another shooting in Oklahoma. Enough.","date":"Wed Jun 01 23:52:43 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"June is #GunViolenceAwarenessMonth. Join me every day as I call on Republicans to finally #EndGunViolence and save lives. Retweet. Share with friends. Post your own video. Demand action. https://t.co/I07r0zhUnK","date":"Wed Jun 01 22:59:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"June is #GunViolenceAwarenessMonth. Join me every day as I call on Republicans to finally #EndGunViolence and save lives. Retweet. Share with friends. Post your own video. Demand action. https://t.co/I07r0zhUnK","date":"Wed Jun 01 22:59:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"238 anti #LGBTQIA bills have been filled in legislatures across the country in 2022. During #PrideMonth and every month we must stand for equality and against these efforts to legalize hate. We must enact the Equality Act.  \nhttps://t.co/QWkAOigclX","date":"Wed Jun 01 16:36:36 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"13 years ago, Dr. George Tiller was murdered for providing abortions. The extremism of the anti-abortion movement continues today, including violence, criminalization of health care &amp; forcing rape &amp; incest victims to continue a resulting pregnancy. We won’t let them succeed.","date":"Tue May 31 22:15:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans have blood on their hands. Every time they vote against commonsense, popular measures like background checks and limiting magazine size, they put American lives at risk. They care more about their power than our safety -- and it’s despicable.","date":"Tue May 31 19:17:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republican action in the face of gun violence? Attending the annual NRA conference. You don’t need any more evidence of their indifference to our pain.","date":"Tue May 31 11:58:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today is the first #MemorialDay since ending America’s longest war, and it serves as a solemn reminder of loss for many. To those grieving today, we grieve with you. Your sacrifice is not forgotten. https://t.co/sD9pTDMKQF","date":"Mon May 30 14:24:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans have voted against affordable health care - including mental health care - again and again and again. It’s a smoke screen.","date":"Sun May 29 15:42:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Right now, I’m thinking about my friend John Lewis. He never backed down in the face of tragedy or violence or hate. He found a way to get in the way. We must do the same. https://t.co/vfalY8E9pL","date":"Fri May 27 16:34:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The leading cause of death for American children is a firearm.\n\nThe leading cause of inaction is the GOP.","date":"Fri May 27 14:08:43 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Ted Cruz defines American exceptionalism as the regular slaughter of our school children. Terrifying to watch the radical takeover of the #GOP. https://t.co/EV3tHp98Lj","date":"Thu May 26 19:12:44 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The time for excuses is over. https://t.co/nJG9wpe5Y9","date":"Thu May 26 16:02:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"During this Congress, Republicans have voted against...\n\ngun safety reform\nbaby formula\nthe Child Tax Credit\naffordable child care\nfunding to reopen schools\n\nSafety, schools, food — you name it. The GOP is standing in the way of progress for families. This is their agenda.","date":"Thu May 26 12:13:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"90% of Americans support common sense gun reform.\n\n100% of Republican Senators are blocking commonsense gun reform bills.\n\n#StopGunViolence \n#GunViolencePrevention","date":"Wed May 25 20:17:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Guns are the leading cause of death for children and teens in America.\n\nGuns have killed more kids than cancer, pneumonia, influenza, asthma, AIDS, and opioids COMBINED. \n\nIT DOESN’T HAVE TO BE THIS WAY.","date":"Wed May 25 16:02:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We can’t allow our children to grow up in a country that allows this to happen again and again.","date":"Tue May 24 20:38:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let’s start by taxing billionaires and mega-corporations to pay for the Child Tax Credit, affordable child care, universal pre-k, and school lunches.","date":"Tue May 24 15:08:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Overturning Roe has always been the @gop plan – and it’s a preview of what comes next. https://t.co/4JPE9uTYdS","date":"Mon May 23 20:55:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We are facing a mental health crisis. I’m proud that my bills to provide mental health resources to moms &amp; school-based mental health resources to students in public schools both passed out of committees, putting families one step closer to getting the supports they need.","date":"Fri May 20 19:52:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As people struggle with high gas prices, oil &amp; gas CEOs are lining their pockets. That's why @HouseDemocrats just passed a bill to investigate price manipulation in the gasoline market. We will not stand idly by as Big Oil keeps #RippingOffAmericans &amp; families face rising costs.","date":"Thu May 19 16:31:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"There is nothing more critical than being able to feed your baby — that families can’t find the formula they need is an outrage. That’s why @HouseDemocrats just took action to loosen WIC restrictions for buying formula and help the FDA end the current shortage. #FeedOurInfants","date":"Thu May 19 02:19:26 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"🎉🎉🎉","date":"Wed May 18 15:56:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We need answers from Abbott Nutrition about when families can expect to see formula back on shelves. Proud to lead this letter with @RepLoriTrahan &amp; @RepPressley to get families the help they need. https://t.co/3quEVXWf88","date":"Tue May 17 18:16:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Breastfeeding is not free &amp; it's not the solution to the formula crisis. @HouseDemocrats are voting this week on real solutions to address the national shortage -- solutions that acknowledge the costs of motherhood. https://t.co/NCPq21U2yI","date":"Tue May 17 16:52:39 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our hearts are with Buffalo as it reels from this massacre. How does the GOP continue to allow this? Are they immune to our anguish? Will they renounce white supremacy &amp; those in their party who embrace it? Will they finally act to keep guns away from dangerous criminals?","date":"Mon May 16 11:47:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This moment is exactly what I feared when I shared my miscarriage story earlier this year. All maternal care is under assault without Roe. The @gop doesn’t care about reproductive rights and they don’t care about motherhood. https://t.co/BeUoDkN6gn","date":"Sat May 14 15:45:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Poverty is a policy failure. Today, @HouseDemocrats voted to increase funding and administration of support services for low-income communities to ensure that every family has a fair shot at success.\n\nThanks to my friends @BostonABCD for their continued advocacy and support!","date":"Fri May 13 19:50:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@ParisHilton and I are committed to protecting kids in abusive situations. Grateful for her leadership and advocacy on Capitol Hill. https://t.co/EAxdVKuoQW","date":"Fri May 13 18:05:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"There is no reason that TSA agents shouldn't have the same rights as any other federal employee. Thanks to my friend @BennieGThompson for ensuring that TSA agents receive the workplace protections they have earned.","date":"Thu May 12 19:49:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every single Republican in both chambers has voted against legislation to enshrine the right to abortion into federal law. The @gop is hellbent on controlling our bodies and stripping away our rights. It’s despicable.","date":"Wed May 11 20:52:07 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"While @TheDemocrats work to protect abortion rights &amp; create an economy that works for everyday families, the @gop is devising plots to prevent women from traveling to access care. The party of “small government” wants to control your body &amp; even your movement — it’s terrifying.","date":"Wed May 11 15:28:32 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As we build an economy that works for everyday families and workers, we can't leave anyone behind. I support the rights of all workers to collectively bargain and that includes Congressional staff.","date":"Wed May 11 01:43:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Abortion is about personal autonomy. It’s about health care. AND it’s about economic freedom.","date":"Tue May 10 19:24:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Decisions about whether, when, and how to grow a family often include questions about your ability to care for a child. The @GOP wants to deny you the choice and the support you may need. https://t.co/dciVskpi0G","date":"Tue May 10 14:35:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, it's abortion and #Roe. Tomorrow, it could be any right that protects our autonomy, freedom, and medical decision-making. This is a five-alarm fire. https://t.co/NJeUYRNRWF","date":"Mon May 09 20:52:40 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #MothersDay! This year, we need more than chocolate and flowers - moms, caregivers, and American families deserve an economy that works for them. #CareCantWait 💐 https://t.co/66ZfqCQYO9","date":"Sun May 08 16:54:45 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Staff on Capitol Hill make all of our work possible -- they shouldn’t have to live in poverty in order to do it. As we build an economy that works for everyday families and workers, we can't leave anyone behind.","date":"Fri May 06 14:44:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This  #AAPIHeritageMonth &amp; #SmallBusinessWeek, I was thrilled to join #AAPI small business owners from across Malden to celebrate their contributions to MA and our country. From food to style and fashion to health care, AAPIs make our community strong. https://t.co/oCLJsG5pUU","date":"Thu May 05 18:42:52 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"5 Supreme Court Justices, appointed by Presidents who lost the popular vote &amp; confirmed by 50 Senators who represent less than half the country, are poised to overturn #Roe, despite the fact that Americans in every single state support the right to abortion. #AbolishTheFilibuster","date":"Wed May 04 17:14:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The GOP votes against:\npaid leave\naffordable child care\nhealth care \nmental health care\nfood assistance \nmaternal health care\nsex education\nfamily planning \naffordable housing\nthe Child Tax Credit…\n\nThey’re not pro life. They’re pro poverty, pro oppression, and pro control.","date":"Wed May 04 14:31:57 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A note of good news in the midst of so much grief and anger. Congratulations to the workers, activists &amp; @BostonSBWU who made this win possible!","date":"Tue May 03 18:41:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Don't listen to the GOP's gaslighting about concern for families &amp; their economic stability. Ending #Roe will widen the disparity between those with access to opportunity &amp; those in despair.","date":"Tue May 03 16:05:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Americans in every state overwhelmingly support the right to an abortion. But this Court is poised to ignore the Constitution and the people it represents to further an agenda that seeks to control our bodies and our freedom. Tune in to @GBH this morning to hear more from me.","date":"Tue May 03 13:11:44 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is devastating. Overturning #Roe would create a second class of citizens &amp; make the dystopian horrors of forced pregnancy a reality, especially for low-income women. But that is exactly the goal: to take away our rights, agency, and humanity. We will not go quietly.","date":"Tue May 03 02:20:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#EidMubarak! Wishing our Muslim neighbors and friends peace, joy, and good health ✨","date":"Mon May 02 22:50:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy Asian Pacific American Heritage Month! This month, we celebrate the rich history &amp; culture of the AAPI communities and acknowledge the heightened discrimination they have faced since the beginning of the pandemic. Today &amp; every day, let us all recommit to #StopAsianHate.","date":"Sun May 01 16:32:12 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @HouseDemocrats voted to deliver critical aid to Ukraine so their government can continue to defend the nation’s sovereignty &amp; protect their people. The US will not stand by while global peace &amp; democracy are threatened &amp; innocent lives are lost. #StandWithUkraine️","date":"Thu Apr 28 20:48:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Public education is the bedrock of our democracy. In partnership with @SecCardona, we’re working to create an education budget that puts young people on a path toward success by strengthening early education, expanding access to mental health services &amp; valuing our LGBTQ+ kids. https://t.co/3IFxPRIARL","date":"Thu Apr 28 17:39:06 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Over $93.7 million is headed to MA for the Carbon Reduction Program! Thanks to the #InfrastructureLaw, this initiative will increase funding for public transit to reduce commute times, carbon emissions, and costs for families. ☀️ https://t.co/wYZYmuNlnC","date":"Wed Apr 27 20:19:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care keeps our economy running. Investing in care workers is an investment in our families, our children, and our future.","date":"Wed Apr 27 16:27:29 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Thrilled to join @RepDonaldPayne in Newark today to talk about how the #InfrastructureLaw is delivering for American families.","date":"Tue Apr 26 19:26:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#EarthDay may be over, but we're feeling the effects of climate change every day. @potus signed the #InfrastructureLaw to strengthen our resilience to extreme weather, clean up pollution, expand clean drinking water &amp; invest in public transportation. A greener future is coming.","date":"Tue Apr 26 12:58:29 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Teens are in crisis; from historic loss to isolation from friends &amp; family, the pandemic turned their worlds upside-down. @SenJeffMerkley &amp; I introduced legislation to increase school-based mental health services so kids can get the care they deserve - it can't come soon enough.","date":"Mon Apr 25 21:50:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"If they can afford to buy Twitter, they can afford to pay their fair share in taxes. RT if you’re ready for @potus’ Billionaire Minimum Income Tax.","date":"Mon Apr 25 13:09:37 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"On the 107th anniversary of the Armenian Genocide, we recognize this dark chapter in our world’s history &amp; speak truthfully about these crimes against humanity. I stand shoulder to shoulder with the Armenian people to fight for truth, justice, and peace.","date":"Sun Apr 24 13:59:06 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let me get this straight: The @GOP is so obsessed with attacking LGBTQ+ kids that they’re raising taxes on families who live near a company that dared to disagree with their bigotry. Got it.","date":"Fri Apr 22 20:00:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The myth of the \"model minority\" has left lower-income AAPIs out of studies on COVID-19 hardships. But we know now that they have suffered a triple threat of illness, financial stress &amp; hate during the pandemic. We must continue to fight stereotypes in research to #StopAsianHate.","date":"Fri Apr 22 15:50:06 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #EarthDay! Today and every day, @housedemocrats are fighting for clean air, safe water, and a planet we can continue to enjoy for generations to come 🌎","date":"Fri Apr 22 14:07:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"No community has been untouched by the opioid epidemic. Saving lives means prioritizing harm reduction &amp; increasing access to treatment, and I'm proud to see my student loan repayment program for the SUD workforce included in @potus' plan to tackle this crisis.","date":"Thu Apr 21 15:10:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As Democrats work to tackle rising costs at the pump, Big Oil’s answer is hiking up prices &amp; #RippingOffAmericans. We cannot stand by as companies take advantage of working families just to make a profit.\n\nIt has never been more urgent to transition to a cleaner, greener future🌎","date":"Thu Apr 21 13:18:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The criminalization of #marijuana is inherently racist in its enforcement, unscientific in its foundation, and out of step with public opinion. This 4/20, let's #LegalizeIt","date":"Wed Apr 20 16:24:40 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"In all 50 states, the lack of affordable child care continues to hold back our economic recovery. Red or blue, progressive or conservative, families know that child care isn’t a private matter or a “woman’s issue” – it’s the path to success for us all. https://t.co/FkxSgGosgo","date":"Wed Apr 20 13:24:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Housing is a human right. That’s why @housedemocrats invested $54B for everything from housing assistance to the development of affordable housing to targeted support for vulnerable communities. This #FairHousingMonth, let's commit to getting every person a home.","date":"Tue Apr 19 17:19:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We are working to get the #COMPETESAct over the finish line! This bill means good-paying jobs, more domestic manufacturing, investments in innovation, and lower costs. This is how @HouseDemocrats are #BuildingABetterAmerica.","date":"Tue Apr 19 15:00:06 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"My favorite sign from today’s #BostonMarathon? “50 years of badass women running the marathon”\n\nWho run the world ✨ https://t.co/BQ2iquDYZ5","date":"Mon Apr 18 19:08:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Good luck to all the #BostonMarathon runners! And a big thank you to the volunteers, staff, and first responders who make this beloved tradition possible 💙💛","date":"Mon Apr 18 12:37:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Wishing a Happy Easter to all those observing here in Massachusetts and across the world. May this season be filled with hope, forgiveness, and strength. https://t.co/frBg0D1m14","date":"Sun Apr 17 12:28:01 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Advancing equity is not a one-year project—it is a generational commitment.\" From gender equality to environmental justice to health equity, removing systemic barriers is a major step in securing a stronger future for the next generation. TY @potus &amp; @vp! https://t.co/sXNWyG5sO3","date":"Sat Apr 16 16:06:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Chag Sameach to all those beginning #Passover tonight! As Jewish people around the globe gather together around the table or virtually for their Seders, let us all recommit ourselves to a world free of oppression.","date":"Fri Apr 15 21:33:05 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As we honor those lost and injured on #OneBostonDay we also celebrate the #RedSox opener and the fact that we will always be #BostonStrong.","date":"Fri Apr 15 19:56:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"One of my priorities in Congress is helping families devastated by substance use disorder. I spoke with @wbur about the barriers to receiving treatment &amp; how my student loan repayment program for recovery professionals is helping alleviate this crisis. 🎧 https://t.co/XU2YQfgyqw","date":"Fri Apr 15 13:28:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans want to slash Medicare, Medicaid &amp; Social Security. They ban abortion, ban books &amp; ban LGBTQ kids from being themselves. They even vote against capping the price of insulin. \n\nThe @gop is the party of obstruction &amp; billionaires, not families &amp; workers.","date":"Thu Apr 14 20:47:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Teachers shouldn't be paying more in taxes than billionaires. @HouseDemocrats know this, and so do working parents. We’re crafting a budget that supports workers, supports families, and will build an economy that works for everyone.","date":"Thu Apr 14 13:36:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We continue to stand with the people of #Ukraine in their fight for sovereignty and democracy.","date":"Wed Apr 13 20:41:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Unemployment is down. Wages are up. Unions are winning. That’s how Democrats are #BuildingAStrongerAmerica. https://t.co/V3K5J9nAgp","date":"Wed Apr 13 18:42:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Here’s what the headline left out: “The report, based on 2019 median annual earnings, doesn’t reflect the impact from the pandemic.” \n\nThe over 1 million women who have left the labor force since Feb 2020 and have yet to return would like to have a word. \nhttps://t.co/buq4N8sITn","date":"Wed Apr 13 12:38:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As Oklahoma becomes the latest state to pass a near-total abortion ban, this is a timely reminder “that Roe never fully protected Black women — or poor women or so many others.” Grateful for this thoughtful perspective on reproductive justice when so much is at stake.","date":"Tue Apr 12 21:59:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"ICYMI: Last week, @potus signed a law to help @USPS address mail delays &amp; invest in their long-term stability. It will ensure everything from Rxs to unemployment assistance to COVID tests make it to you on time. The postal service is a public service! 📬 https://t.co/wTmlHZKrLM","date":"Tue Apr 12 12:38:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Ghost guns are untraceable, sold without background checks &amp; are extremely easy to buy or build. @TheJusticeDept is right to require background checks, inventory &amp; serial numbers for all commercial firearm sales. This is a step toward reducing violence &amp; saving lives.","date":"Mon Apr 11 16:56:11 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"From the ​​Melrose School Committee to Assistant Speaker, I get it done by building consensus &amp; leaning on my friends in Congress. My experience raising 3 kids &amp; taking care of my sick parents fuels my fight to give every American family a fair shot. https://t.co/rR3UQi3NlU","date":"Mon Apr 11 15:10:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our economy is making a comeback under @potus!\n✅ 431k jobs in March\n⬆️ Wages up 5.6%\n❌ Unemployment dropped to 3.6% \n⬇️ Lowest jobless claims since 1968\nhttps://t.co/PL9oYvgU5e","date":"Mon Apr 11 12:13:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is exactly what anti-choice Republicans claimed wouldn’t happen, but we knew better. Criminalizing abortion is a dangerous attempt to control pregnant people, and it will have grave consequences.  https://t.co/MrOIF7eQdT","date":"Sat Apr 09 23:58:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Always proud to work with @DemWomenCaucus and @RepBonamici, @RepBowman, @RepKatiePorter, @RepSherrill, @SenWarren &amp; @SenTinaSmith on behalf of families. They are all incredible partners in the fight for affordable child care because they understand that #ChildCareIsInfrastructure","date":"Fri Apr 08 21:39:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Signed! The ACA has ensured that millions of families have the health care they need and this week, we built on that progress. Fixing the “family glitch” means lowering costs and expanding coverage - that's how Democrats are #BuildingABetterAmerica https://t.co/D75XdEZhoW","date":"Fri Apr 08 13:07:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"MLK reminded us that “the arc of the moral universe is long, but it bends toward justice.”\n \nToday, it bends toward Justice Jackson and lifts us all toward a more perfect Union. \n\n#AJustice4All","date":"Thu Apr 07 18:20:33 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Restaurants &amp; small businesses are the hearts of our communities - but they’ve been hurt hard by the pandemic. @HouseDemocrats just voted to make sure that the Restaurant Revitalization Fund is strong enough to keep businesses open, workers paid &amp; employment up. #ReplenishRRF","date":"Thu Apr 07 16:22:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, the Senate joined @HouseDemocrats in voting to hold Putin’s regime accountable for their violent invasion of Ukraine. We will not stand by &amp; allow Russia to participate in normal trade relations while democracy is threatened &amp; lives are lost. #StandWithUkraine","date":"Thu Apr 07 15:25:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Addressing the child care crisis is how we help moms get back to work, lower costs for families, and give every kid a chance to succeed. I'm leading the fight to ensure that every parent can afford and access child care - and we're going to get it done. #ChildCareIsInfrastructure","date":"Thu Apr 07 12:49:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"No one is above the law. Today, I voted to hold two former Trump officials in contempt of Congress for refusing to participate in the #January6th investigation. We must put our democracy &amp; the truth above all else.","date":"Wed Apr 06 22:58:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"You heard @potus! Every worker deserves the right to organize - including at Amazon. May the Staten Island Amazon warehouse workers’ victory be an inspiration to every worker fighting for better wages &amp; labor standards. #UnionStrong","date":"Wed Apr 06 20:53:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"If oil prices are decreasing, gas prices should too. \n\nToday, @HouseDemocrats are bringing CEOs from Big Oil to Congress to answer our questions about increasingly high costs at the pump and stop them from #RippingOffAmericans.","date":"Wed Apr 06 15:44:11 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, I tested positive for COVID-19. I am vaccinated and boosted, experiencing mild symptoms, and will quarantine in line with CDC guidance. I am grateful to our health care professionals and researchers who have given us the tools to manage this deadly virus. Get vaccinated!","date":"Wed Apr 06 13:33:35 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Across the country, abortion rights are under attack. It’s unconstitutional and a threat to every aspect of reproductive care. Abortion is health care and we won’t stop fighting until it’s accessible, affordable, and legal for all. https://t.co/Zd5d7nexUc","date":"Tue Apr 05 20:39:26 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today @potus announced an extension of the pause on student loan repayments through August 31. This is an important step to bring down costs and make life a little easier for young people and families trying to make ends meet.","date":"Tue Apr 05 18:23:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Universal Pre-K, Childcare and Paid Leave Aren’t Just for Women and Families—They’re Key to Economic Recovery. Read more about why I think it's time for a nationwide reckoning on behalf of women and families. https://t.co/2a26sudQVj","date":"Tue Apr 05 17:35:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats work for working families. \nRepublicans work for corporate billionaires.","date":"Tue Apr 05 14:54:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We’ve all been there, @Chasten and @SecretaryPete! Whether you’re a trucker, a teacher, or a White House Cabinet Secretary, parents need and deserve affordable child care.","date":"Mon Apr 04 20:19:58 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every report from the @ipcc_ch tells the same dire story -- the climate emergency is at code red.\n\nWe have the power to prevent disaster if we act now. Transitioning to a clean energy future has never been more urgent. https://t.co/PmrXeZTYhK","date":"Mon Apr 04 17:08:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Unemployment is down to just 3.6% and the economy has created over 7.9 million jobs under @potus. The #AmericanRescuePlan fueled this comeback — and we’re just getting started.","date":"Mon Apr 04 15:09:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#RamadanMubarak to the Muslim community in Massachusetts and around the world! May this month be filled with reflection, joy, rejuvenation and renewal!","date":"Sat Apr 02 15:49:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Graduate students provide invaluable insight to universities as researchers, mentors &amp; so much more. I stand in solidarity with @MITGradUnion in their effort to unionize &amp; secure fair wages &amp; working conditions. All workers deserve the right to organize – including our students.","date":"Fri Apr 01 19:00:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The U.S. economy has now regained 93% of all jobs lost since February 2020. #BidenBoom","date":"Fri Apr 01 14:16:09 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning ☀️ Today, @HouseDemocrats will vote to decriminalize marijuana. #MOREAct","date":"Fri Apr 01 12:10:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"What does it say about a party when only 12 out of 210 House Republicans voted to lower prescription drug costs for Americans?\n\nA LOT. https://t.co/lEGBjB3KIJ","date":"Thu Mar 31 22:27:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"When Dr. Frederick Banting sold the patent for insulin over 100 yrs ago, he said “Insulin does not belong to me, it belongs to the world.”\n\nBUT Americans pay more than 10x for insulin compared to other countries.\n\nToday, we vote to cap the cost at $35/month. #AffordableInsulinNow","date":"Thu Mar 31 17:34:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #TransDayOfVisibility! \n\nWhile bigoted Republican politicians push their discriminatory agenda, we celebrate the trans, nonbinary, and gender-nonconforming community with joy and love — because all people deserve respect and equality. Nothing less. https://t.co/uxVaQgXkqV","date":"Thu Mar 31 13:37:38 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Teachers and firefighters pay their fair share in taxes. So should billionaires. That's the #BidenBudget.","date":"Wed Mar 30 20:22:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The 5 biggest oil companies made $75B in profits last year. Now, they're using their enormous profits for stock buybacks and executive bonuses instead of lowering costs for Americans at the pump. \n\nIt’s time to end our dependence on oil and stop the cycle of corporate greed.","date":"Wed Mar 30 16:23:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Too many moms throughout American history lived the horror that Mamie Till Mobley experienced. \n\nToday, we finally say no more with the signing of the Emmett Till #AntilynchingAct. Hate has no place here. \nhttps://t.co/NLLLP92kLb","date":"Tue Mar 29 23:56:33 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This week, @HouseDemocrats are lowering costs for families by capping the cost of insulin at $35/month.","date":"Tue Mar 29 17:42:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Solidifying Justices Sandra Day O’Connor and Ruth Bader Ginsburg's legacy on the bench and place in history #WomensHistoryMonth \nhttps://t.co/h5KYbzVqlw","date":"Tue Mar 29 15:58:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS: The #BidenBudget excludes the Hyde Amendment — that means people enrolled in Medicaid &amp; Medicare would finally be covered for abortion care. This would be a MAJOR step forward for reproductive justice. Let's get this done. #BeBoldEndHyde","date":"Mon Mar 28 21:39:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"To @GovRonDeSantis and his Republican accomplices in hate — we will never stop fighting for equality and the rights of every LGBTQ+ person and child to live and love freely.","date":"Mon Mar 28 18:55:52 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats sent nearly $2 Trillion of aid to families through the American Rescue Plan. \n\nRepublicans spent $2 Trillion giving corporations and the wealthy a tax break. \n\nThat’s the difference.","date":"Sun Mar 27 14:08:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Final stop on this week's #MA5 Community Projects tour: the Wonderland Connector in #Revere! With this $4M federal investment, we're one step closer to connecting the Commuter Rail &amp; Blue Line — aka reducing traffic &amp; carbon emissions and increasing opportunity &amp; accessibility 💚 https://t.co/jrCamQYwx3","date":"Fri Mar 25 21:32:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The child care crisis, summed up in a headline. https://t.co/rHUSZgV3iw","date":"Fri Mar 25 13:17:54 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"In 1969, the Beatles held their last public performance, two Americans walked on the moon for the first time, Woodstock rocked the world, and PBS was established. It was also the last time unemployment was this low.\n\nThat's how #DemocratsDeliver #ForThePeople.","date":"Thu Mar 24 21:57:32 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Meet #MA5 trailblazers, Tanya McCloskey &amp; Marcia Kadish. In 2004, they became the 1st same-sex couple to be legally married in the US. Love like theirs paved the way for marriage equality nationwide. We celebrate them during #WomensHistoryMonth &amp; proclaim every day: #LOVEISLOVE🏳️‍🌈 https://t.co/ym4fz8Ett4","date":"Thu Mar 24 12:34:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Madeleine Albright was a trailblazer who changed the world through her diplomacy and advocacy. Her legacy will continue to steer our nation through international conflict and inspire women in America and around the world. May she rest in peace.","date":"Wed Mar 23 23:20:10 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Thanks to the #AffordableCareAct:\n\n✔️More Americans than ever have coverage\n\n✔️Birth control is covered by insurance\n\n✔️Pre-existing conditions are covered\n\n✔️Moms have access to free care\n\n✔️Mental health &amp; substance use disorder care are health care\n\nProgress #ForThePeople.","date":"Wed Mar 23 19:58:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every worker deserves the right to unionize. From Starbucks to Capitol Hill, I support collective bargaining efforts that empower workers and help us build a stronger, more just economy. Standing with you, #Watertown &amp; every worker organizing for justice! \nhttps://t.co/6mcRQE9W4n","date":"Wed Mar 23 18:31:01 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Next stop on the #MA5 Community Projects Tour: Hurld Park in #Woburn! I secured $262k to design a park that'll make the neighborhood climate resilient, reduce water pollution &amp; provide a beautiful space for the community. #ClimateAction is here. Tune in: https://t.co/ASukFODLmB","date":"Wed Mar 23 15:19:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I’m at the #Waltham Embassy Parking Lot celebrating the $280k in federal funding I secured to improve our climate preparedness and our community's infrastructure. Tune in to learn more ⬇️ https://t.co/jYqMFPJLbm","date":"Wed Mar 23 14:10:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is the Republican Party. In 2022. \n\nWhen they tell you who they are, believe them.","date":"Tue Mar 22 21:36:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Fact. Now, someone tell Texas 👀","date":"Tue Mar 22 18:20:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Something more: $20,000 in Massachusetts","date":"Tue Mar 22 16:35:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#JudgeKetanjiBrownJackson understands the struggle of women, of moms, of kids — she sees all of us. \n\nThis is a voice we need on the Highest Court.","date":"Tue Mar 22 15:07:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy opening day to the #GreenLineExtension! Better T access is one of the best ways to tackle carbon emissions, expand economic opportunity &amp; improve climate justice —  we're on track to a greener future! 🛤️ https://t.co/gVNPBNnJh5","date":"Mon Mar 21 21:32:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@Ammallon Couldn't hold back my excitement, @Ammallon! #ClimateAction has me like💃🏼👋🏼🥳","date":"Mon Mar 21 21:06:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"All aboard the #GreenLineExtension! Next stop: climate resiliency 🎉🚊","date":"Mon Mar 21 16:03:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Last week, @POTUS signed a new budget that included over $10 mil I secured for 10 projects across MA-5. Today, I’m at the Mystic Dam in Arlington to see that money in action —almost $1 mil to improve climate resiliency. Tune in ⬇️ https://t.co/pnIY6kM8UH","date":"Mon Mar 21 13:10:40 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"In just 12 months, the American Rescue Plan has paved the way for our recovery:\n\nAdded 7.4M jobs\nGrew GDP to 5.7% \nMade wages go ↗️ \nCut unemployment to 3.8%\n\nDemocrats are building a better America.","date":"Sun Mar 20 22:48:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We're repairing bridges, improving commute times, and supporting the success of local businesses through the #infrastructurelaw — great to see this work #forthepeople on the ground in Florida!","date":"Sun Mar 20 13:40:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Saddened to learn of the loss of my colleague and the Dean of the House, @repdonyoung. He spent much of his life serving our country as a dedicated member of The People’s House. Grateful for his service to our nation and his commitment to our democracy.","date":"Sat Mar 19 14:35:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans once again stood in the way of Democrats eliminating the Hyde Amendment from the federal budget.\n\nBut let's be clear: we will never back down from the fight for abortion access. Health care justice cannot be achieved if the Hyde Amendment stands.","date":"Fri Mar 18 18:55:07 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Race-based hair discrimination is white supremacy in action. \n\nToday, @HouseDemocrats vote for the #CrownAct &amp; a world where being yourself is safe, respected &amp; celebrated.\n\nTY @RepBonnie, @RepGwenMoore, @RepBarbaraLee, @RepPressley &amp; @Ilhan for leading the hair love revolution.","date":"Fri Mar 18 14:42:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"NEW 🚨 the number of Americans filing for unemployment is even lower than it was before the pandemic began in 2019. \n\nWe're building a stronger America.","date":"Thu Mar 17 15:48:10 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats know that high costs are a big headache for families across America — especially energy costs. We're taking action. As Putin’s war continues to push prices up, I'm leading 88 Members in calling on @HHSGov to help ease energy costs for low-income households. https://t.co/DgHuczIWZT","date":"Thu Mar 17 13:53:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Putin's war is causing gas prices to soar. As Democrats work to reduce costs for families, American oil companies should be doing the same. There is no reason prices should be going up when the cost for a barrel of oil is going down.","date":"Wed Mar 16 22:19:54 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Day 2 at the @WhiteHouse! Yesterday, we celebrated #WomensHistoryMonth and the urgent need for pay equity. And today, @POTUS signed #VAWA into law. Democrats know that when women are successful, America is successful. https://t.co/Akf6D1jUqz","date":"Wed Mar 16 20:45:04 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A year after a shooter targeted #AAPI women in Atlanta, there's so much more to be done to end discrimination &amp; gun violence. On this dark anniversary, let us recommit to tackling these intertwined crises &amp; continuing the fight for justice. #StopAsisanHate","date":"Wed Mar 16 15:44:58 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"President Zelensky and the Ukrainian people continue to show incredible bravery in the face of Putin’s unprovoked, illegal war. \n\nAmerica stands with you in your fight for peace and democracy, #Ukraine. https://t.co/hf5xqSeqPN","date":"Wed Mar 16 13:41:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Women of Soccer and Women of the House: we fight for pay equity on and off the field. 💪🏻💪🏼💪🏽💪🏾 💪🏿 #equalpayday2022 #WomensHistoryMonth @WhiteHouse https://t.co/dJ7SgfZFtA","date":"Tue Mar 15 23:04:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This funds the government &amp; FINALLY reauthorizes #VAWA, including\n\n- My amendment to combat cybercrimes &amp; online harassment\n- Protections for Indigenous, LGBTQ &amp; immigrant survivors\n- $ to reduce the rape kit backlog\n- Housing for DV, assault, dating violence &amp; stalking survivors","date":"Tue Mar 15 19:36:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every single Republican Senator voted against equal pay for women just nine months ago. \n\nThey're not partners in improving the economy. They are part of the problem. #EqualPayDay https://t.co/gSbGpXwuiu","date":"Tue Mar 15 15:05:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"White women make 83% of what men earn. Women of color are paid even less. \n\nIf the gap continues to close at the current rate, women won't achieve equal pay until 2111❗️\n\nNot on my watch. We've waited long enough. Paid equity now. #EqualPayDay","date":"Tue Mar 15 12:41:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let’s cut costs for families and pass universal pre-k.","date":"Mon Mar 14 21:04:17 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepDean Thinking of you, @RepDean! 💙","date":"Mon Mar 14 21:02:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@LexingtonHSHist @NationalHistory @NatHistoryDayMA Congrats, Ryan, Isabel, Rachel, Angie, and Jason! Making #MA5 proud!","date":"Mon Mar 14 19:43:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Sarah Bloom Raskin is an accomplished lawyer &amp; economist. She understands that addressing climate change isn't a choice if our country &amp; economy are going to thrive. Standing in the way of her confirmation is to choose profits over people, the planet &amp; our future. Confirm her.","date":"Mon Mar 14 18:20:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Working families pay more for child care than a billionaire does in federal income taxes — which is $0. \n\nIt's time for that to change. \nhttps://t.co/iKGLS6MpoZ","date":"Mon Mar 14 17:21:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Problem: Nearly 460,000 families are being pushed out of the workforce because of the child care crisis.\n\nSolution: Universal pre-K and affordable child care for all. \nhttps://t.co/MRgmCQgmF3","date":"Sun Mar 13 19:28:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The youth mental health crisis needs our attention today if we are going to build a better tomorrow. \n\nThat’s why Democrats invested $4B in mental health care through the #AmericanRescuePlan to support the work of hospitals like @challiance who serve struggling kids &amp; families. https://t.co/0dbVqDrT16","date":"Sun Mar 13 13:09:26 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#MA residents using the @HealthConnector had their premiums cut by an average of 31% thanks to the #AmericanRescuePlan — making care more affordable &amp; accessible than ever before. Proud to celebrate 1 yr of this law with @SpeakerPelosi, @RepPressley &amp; @RepLoriTrahan in Cambridge! https://t.co/Skbjow582E","date":"Sun Mar 13 00:18:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"WATCH LIVE: I’m with @SpeakerPelosi, @RepPressley, and @RepLoriTrahan at the @challiance to discuss how the #AmericanRescuePlan helped support hospitals during COVID, lower health care costs, and address the youth mental health crisis — Tune in! ⬇️\nhttps://t.co/xGyCMGqP2N","date":"Sat Mar 12 19:55:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Investing in green infrastructure like the Waltham Embassy Parking lot is an investment in our future. If Republicans like @SteveDaines don’t understand the value of health equity, gun prevention, climate readiness &amp; community funding that tells Americans all they need to know.","date":"Sat Mar 12 01:48:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The Texas Supreme Court just sided against the Constitution. You heard that right. \n\nWe won't back down from this fight. Not now, not ever.","date":"Fri Mar 11 22:26:45 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"YEAR 1 LATER: The #AmericanRescuePlan at work - \n\n✅Schools are open\n✅Job #s are up\n✅Unemployment is down\n✅COVID infections are low\n✅Health care is cheaper\n\nWe're working every day to build on our progress and create a better America #forthepeople.","date":"Fri Mar 11 13:46:43 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I promise you: Democrats are working every day to lower energy costs — and insulin costs, and child care costs, and housing costs, and health care costs.\n\nAnd we won't stop until every American can get ahead.","date":"Thu Mar 10 22:47:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A maternity hospital bombed. Over 2 million refugees. There's no clearer call for urgent action.\n\nTonight, I voted to ban Russian oil and energy imports and impose further sanctions.\n\nAmerica stands with you, #Ukraine, and against Putin’s unprovoked and heinous war.","date":"Thu Mar 10 04:28:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A BUDGET FOR WORKING FAMILIES = PASSED ✅\n\nWe just passed funding to expand child care, improve maternal health care, create green jobs, expand affordable housing, feed the hungry, reauthorize VAWA, &amp; much more.\n\nThis is what's possible when families are front &amp; center in DC.","date":"Thu Mar 10 03:27:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is the act of a monster.","date":"Wed Mar 09 21:22:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"One year ago this week the #AmericanRescuePlan was signed into law, providing stimulus checks and tax cuts for families.\n\nAnd guess who voted against these cost cuts for Americans? https://t.co/W9FujA4ngI","date":"Wed Mar 09 18:38:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As we close out #InternationalWomensDay, I’m thinking of all the women bravely leading their communities in the face of violence &amp; conflict, comforting kids in bomb shelters &amp; finding strength amid the unknown. Let us secure a peaceful future for every woman, everywhere.","date":"Wed Mar 09 03:24:17 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Best way to celebrate women?\n\nChild care 👩‍👧‍👦\nEqual pay ♀️\nPaid leave 💰\nRepro rights 💪🏾\n#InternationalWomensDay #IWD2022 #InternationalWomensDay2022","date":"Tue Mar 08 21:24:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The @GOP plan for schools? \n\nBan books. Vote against funding to reopen schools. Endorse child hunger. And now #DontSayGay.","date":"Tue Mar 08 19:26:33 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"What makes me hopeful...\n\nHappy #InternationalWomensDay! https://t.co/F8Ob9Us0e7","date":"Tue Mar 08 17:04:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"No better way to start the day than with @IAFFPresident and Massachusetts’ very own Ed Kelly and our incredible MA firefighters. Thank you for visiting Washington and for all of your selfless service during the pandemic and beyond! https://t.co/QqMaftU101","date":"Tue Mar 08 14:46:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@SenRickScott wants to raise your taxes. \n\n@SenRonJohnson wants to take away your health care. \n\nNo need to read between the lines when the @GOP says the quiet part out loud. https://t.co/zfJXzJMda4","date":"Tue Mar 08 02:16:26 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@MassStatePolice 💔","date":"Mon Mar 07 23:45:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Universal pre-k for all 3 and 4-year-olds will cut costs for families by $13,000 a year. Let’s get it done.","date":"Mon Mar 07 19:57:32 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"While we work to reduce the cost of gas at the pump for Americans, Putin’s war has made it clear that our reliance on fossil fuels is a threat to our national security. We need to get serious about renewable energy. Now.","date":"Mon Mar 07 16:30:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Representation matters — case in point. \n\nProud to serve with you in the People's House, @RepSaraJacobs.","date":"Mon Mar 07 14:02:57 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"To every young person whose identity is under attack from the onslaught of anti-LGBTQ bills, know that you are loved simply for being yourself.\n\nAnd to every politician pushing hate as policy, know that you're failing America's children and our journey to justice.","date":"Fri Mar 04 16:27:29 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our community has lost a local hero. Trooper Tamar Bucci gave her life while serving others. Thinking of her family and friends as they mourn this tragic loss.","date":"Fri Mar 04 13:46:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @POTUS is signing @RepCheri’s Ending Forced Arbitration Act. \n\nWe are stopping forced arbitration clauses from denying survivors their day in court and shielding abusers from accountability. \n\nThis is justice through action.","date":"Thu Mar 03 21:39:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Remember this moment: 174 Republicans voted against veterans and their ability to access health care.","date":"Thu Mar 03 16:45:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We can't be afraid to say 'abortion' in the fight to protect reproductive freedom.","date":"Wed Mar 02 18:15:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#BuildingABetterAmerica means affordable, quality child care for all.","date":"Wed Mar 02 15:01:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight, @POTUS spoke directly to every American who is worried about high costs &amp; international unrest and provided empathy &amp; a plan of action to fight for everyday families.\n\nTomorrow, we continue our work to build a better America where every woman, worker &amp; child can succeed.","date":"Wed Mar 02 04:24:01 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's get it done, @POTUS! #SOTU https://t.co/KHCu030ION","date":"Wed Mar 02 03:20:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"And America is going to love when we cap insulin prices at $35/month for Joshua and for every person with diabetes","date":"Wed Mar 02 02:46:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"You heard @POTUS: many families pay up +$14,000 a year for #childcare — per child! Families shouldn’t have to pay more than 7% of their income for child care.\n\nOur plan will cut the cost by HALF. That's how we build a stronger America.","date":"Wed Mar 02 02:41:39 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We're going to lower your costs, not your wages.","date":"Wed Mar 02 02:34:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"👏🏼👏🏼👏🏼\"We're done talking about infrastructure weeks. We're now talking about an infrastructure decade.\" - @POTUS #SOTU2022 #SOTU","date":"Wed Mar 02 02:26:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Light over darkness. That will always be America's message. We stand with you, #Ukraine. #SOTU2022","date":"Wed Mar 02 02:14:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"My #SOTU guests are hometown heroes: our #MA5 public health officials. With the help of the #AmericanRescuePlan, these local officials provided free vaccines, contact tracing, food assistance, &amp; so much more. Our work is a partnership — but today, I had one message: thank you. https://t.co/1LjnCygkGz","date":"Tue Mar 01 20:34:10 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is your reminder that under President Biden, 2021 saw the biggest one-year gain for job creation in U.S. history.\n\nDemocrats are fighting for more jobs, lower costs and an economy that works for working families. \n\nWe are building a better America. #SOTU","date":"Tue Mar 01 18:06:28 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning 🌞 and happy first day of #WomensHistoryMonth! \n\nLet's celebrate by making the #childcare crisis a thing of the past.","date":"Tue Mar 01 13:29:12 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight, Republicans voted down the #CROWNAct and the Women’s Health Protection Act. \n\nThe @GOP is sending a clear message: they don't believe you should have control over your own body.","date":"Tue Mar 01 02:07:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"News: the @SenateGOP just blocked #WHPA. \n\nNOT News: the GOP doesn't care about freedom for all. Only power over people. #abortionrights","date":"Mon Feb 28 23:45:12 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Hair justice is racial justice. Thank you, @RepBonnie, for leading the hair love revolution. \n\nLet's get this done for women, girls, and for equality. #CROWNAct","date":"Mon Feb 28 20:47:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Time is running out. We can't wait to #ActOnClimate.   https://t.co/uIXnPMdpz6","date":"Mon Feb 28 19:12:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS 🚨Today, the Senate is voting on @RepJudyChu's #WomensHealthProtectionAct. The Senate must join the @HouseDemocrats and vote to make abortion access a reality for all — no matter your zip code or income. \n\nRetweet if you agree.","date":"Mon Feb 28 16:20:07 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS: Only 11% of workers have access to employer-provided child care. \n\nI commissioned a study to better understand why we are falling short and how to improve access to care — because we know that #childcare is essential for workers and our entire economy. More here ⬇️","date":"Fri Feb 25 21:39:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Black women have always been on the frontline of the fight for justice. It's about time we honored that tireless work with the title: Justice.","date":"Fri Feb 25 17:00:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"👏👏 A graduate of Harvard Law and a former public defender with a historic record of protecting civil rights. And now, the first Black female nominee to the Supreme Court.\n\nMake way for JUSTICE Ketanji Brown Jackson ✨","date":"Fri Feb 25 14:50:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"America is united with our allies across the globe in support of the Ukrainian people as they defend their country &amp; their right to democracy. I stand with President Biden &amp; support his new actions that make clear our solidarity with Ukraine and its sovereignty and security. 3/4","date":"Fri Feb 25 00:31:57 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We must continue to use severe and strategic actions to impose significant costs on Russia and hold Putin accountable for his brutal aggression. \n\nThe desperate actions of one despot will not stop our commitment to global democracy and peace. 4/4","date":"Fri Feb 25 00:31:57 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Vladimir Putin’s unprovoked invasion of Ukraine is a direct assault on international security. His war will bring human suffering and catastrophic loss of life. Already, the Ukrainian people are being terrorized by violence, and lives have been lost. 1/4","date":"Fri Feb 25 00:31:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Further, Putin’s equating of the Ukrainian government – run by a Jewish leader – with the Nazis and the systemic extermination of millions of people is blatantly false and fans the flames of anti-Semitism. 2/4","date":"Fri Feb 25 00:31:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Putin has illegally and callously threatened the sovereignty and security of Ukraine. My thoughts and prayers are with the Ukrainian people in this perilous time. \n\nAccountability for Putin and peace for Ukraine must be our goal.","date":"Thu Feb 24 14:36:40 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The @GOP wants you to believe that they’re fighting to allow parents to make the best choices for their children. But this is their real agenda. \nhttps://t.co/tYr9rqkFLS","date":"Wed Feb 23 21:37:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Affordable, accessible care is central to the success of families and our economy. It's this simple: #CareCantWait. https://t.co/WNoXmQC1Tc","date":"Wed Feb 23 19:50:41 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I support the sanctions announced by @POTUS in response to Russia’s unprovoked and dangerous actions against #Ukraine. America and its allies abroad must use every diplomatic tool we have to stop further aggression by Putin that threatens Ukraine’s sovereignty and its people.","date":"Tue Feb 22 21:30:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"VICTORY! @mPinoe, @alexmorgan13, and the entire @USWNT fought for equal pay — and won. Congrats to these champs for change. Now, let's level the playing field for every woman and worker. #EqualPay","date":"Tue Feb 22 15:10:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Reminder: The @HouseGOP voted against lower health care costs, lower child care costs, lower taxes &amp; union jobs. \n\nWhile Republicans tweet about high costs, @Housedemocrats enact plans to lower them.","date":"Sun Feb 20 19:07:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Thanks to the #AmericanRescuePlan, Lexington school buses are going electric! Protecting our students and our planet – now, that’s a good day. ⚡️🚍 https://t.co/WDwl6acT8O","date":"Fri Feb 18 16:19:54 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Would you want to drink water out of this lead pipe? \n\nMe neither. \n\nSo we're eliminating them ALL. #InfrastructureLaw https://t.co/va625KbodD","date":"Wed Feb 16 20:35:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#Waltham's @CharlesRiverCH has been able to expand its staff, upgrade medical equipment, and increase services &amp; outreach thanks to the #AmericanRescuePlan. AKA. the Democratic agenda in action.","date":"Wed Feb 16 16:53:33 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, I visited #Waltham's @CharlesRiverCH where funding from the #AmericanRescuePlan is being used to lower health costs, hire new staff &amp; expand access to care. S/O to the incredible health center staff working every day to serve our community! https://t.co/bWaEZU7frc","date":"Wed Feb 16 00:30:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is a long-awaited moment of accountability for gun manufacturers who market violence without consequences. To the #SandyHook families who lived through incredible heartbreak and demanded justice, your bravery is remarkable. Standing with you in the fight to #EndGunViolence.","date":"Tue Feb 15 20:19:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"With prices on the rise, @HouseDemocrats took action. The #AmericanRescuePlan lowers energy costs and helps weatherize homes for families from Flint, MI to Framingham, MA! Great to see our work #forthepeople in action.","date":"Tue Feb 15 12:56:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Roses are red. \nViolets are blue.\n\nLet’s make child care affordable,\nAnd Pre-K free, too! ❤️","date":"Mon Feb 14 14:30:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The GOP handed tax cuts to the wealthy but drew the line when it came to working families. \n\nWhen they voted against the #AmericanRescuePlan, they voted against you.","date":"Sun Feb 13 19:30:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepBonamici @RepClark ❤️❤️❤️","date":"Fri Feb 11 21:17:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@Kim_Janey Welcome to the other side of the river, @Kim_Janey!!","date":"Fri Feb 11 21:16:01 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We are facing a mental health crisis among our young people. It's more important than ever that we make care more accessible to students. Grateful to our counselors, and ready to make school based mental health care a reality with @SenJeffMerkley.","date":"Fri Feb 11 19:21:45 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Too many parents (especially moms) have been forced to choose between a paycheck and child care. \n\nWe can and must do better. #BuildBackBetter","date":"Fri Feb 11 14:24:40 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@a_i_w1 @ReproRights So sorry to hear about your loss, Amy💔. We are in this fight together.","date":"Thu Feb 10 21:46:38 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"When I miscarried, I received compassionate care &amp; for women of privilege like me, that'll probably always be the case. To protect the right to #abortion &amp; access for all, we have to acknowledge we're up against a coordinated campaign to hold onto the existing hierarchy. Op Ed⬇️","date":"Thu Feb 10 19:36:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Years ago, I had a miscarriage. It was crushing. Today, anti-abortion politicians are doing everything in their power to restrict access to basic care and family first policies. It's a campaign of control and against our Constitution. My story. \nhttps://t.co/9Fa5DlZGli","date":"Thu Feb 10 14:05:11 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepBrownley @jonstewart @TheProblem I'd say effective and determined — but yes, props to @jonstewart for shouting out @RepBrownley's incredible work on behalf of our veterans!","date":"Wed Feb 09 21:57:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Honored to meet today with Angelina Jolie, Special Envoy for UN @Refugees, to discuss our shared work on trauma-informed care and advocacy on behalf of women and kids. Looking forward to our continued off-screen work together! https://t.co/iUAtoX7jIs","date":"Wed Feb 09 18:58:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Male workers regained all the jobs they'd lost since Feb 2020. But the same could not be said of women... 1.1 million who left the labor force have yet to return.\"\n \nIt's no mystery why: child care. We need to build an economy that lifts women up instead of leaving them behind.","date":"Wed Feb 09 16:57:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Young people experiencing homelessness &amp; in foster care face unbelievable barriers while trying to do their homework, attend classes &amp; improve their futures. My bill will help these students access info and financial aid, helping to give everyone a fair shot at a bright future.","date":"Wed Feb 09 14:44:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@RepSusanWild is right: we can protect kids by standing up for internet safety and against dangerous content. Kids over profits — it's an easy choice. #SaferInternetDay","date":"Tue Feb 08 20:15:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"What @repmarkpocan said","date":"Tue Feb 08 18:49:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#SCOTUS — the highest level of our justice system — is suppressing the vote instead of protecting the vote. That should scare all of us.","date":"Tue Feb 08 14:42:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Forced arbitration clauses are a tool of oppression — silencing survivors and giving power to abusers. Enough is enough. Tonight, @HouseDemocrats voted with workers, with women, and for justice. #EndForcedArbitration https://t.co/i960qoYe2p","date":"Tue Feb 08 00:44:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every worker should have the right to collectively bargain — including Capitol Hill staff.","date":"Mon Feb 07 21:56:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Last week, the @HouseGOP voted against the #COMPETESAct. That means they voted against:\n\n👎improving our supply chain \n👎creating American manufacturing jobs \n👎lowering costs for families \n\nWhen it comes to inflation, they're all talk &amp; no action.","date":"Mon Feb 07 14:23:07 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@CapehartJ Great to be on @TheSundayShow — Let's do it again soon, @CapehartJ!","date":"Sun Feb 06 23:19:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"American jobs, fully stocked shelves, and lower costs — that's the heart of the #COMPETESAct and how we're delivering #forthepeople. https://t.co/XhwsbgEn4z","date":"Sun Feb 06 16:21:07 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans are defending violent insurrections. \n\nDemocrats are delivering American jobs. \n\nFacts.","date":"Sat Feb 05 16:14:57 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#January6th was domestic terrorism — not \"legitimate political discourse\".\n\nUndermining democracy is officially the Republican Party's agenda.","date":"Fri Feb 04 22:25:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"By passing the #COMPETESAct, Democrats are tackling supply chain challenges, creating high-paying jobs here at home, and greeting families with lower costs and fully stocked shelves. #DemocratsDeliver. https://t.co/BbuGWj36bP","date":"Fri Feb 04 18:34:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Parents need safe, reliable #childcare. That's why I led a letter to @POTUS calling for early ed providers to be included in the Administration's plan to expand access to testing &amp; masks to K-12 schools. Child care is essential — for kids, parents, and our economy. https://t.co/lpwQuJhvx1","date":"Fri Feb 04 16:22:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"January Jobs Report:\n\n➕ 467,000 jobs added in January\n➕ More than 700,000 jobs added in Nov &amp; Dec\n📈 Wages are up\n \nGreat news for American workers. Great news for America!","date":"Fri Feb 04 14:47:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"...Said on the 152nd anniversary of the 15th Amendment which gave Black men the right to vote. \n \nProgress is the point. https://t.co/q3VntOg70Q","date":"Fri Feb 04 01:12:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Presiding over the House as we debate the #COMPETESACT — a huge investment in research, U.S. manufacturing, and our supply chain. You’ll feel the benefits at the gas pump, the car dealership, and the grocery store. That’s how Dems deliver #ForThePeople! https://t.co/AHMNQgU3uD","date":"Thu Feb 03 20:29:53 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Throughout our nation’s history, Black women have been denied and overlooked to serve on our nation’s highest court. And it’s America that has lost out.","date":"Thu Feb 03 14:50:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Clean water is a human right. The #InfrastructureLaw is making it a reality.","date":"Wed Feb 02 18:30:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"It's Black History Month, and racism is alive and well in the @SenateGOP. https://t.co/vcmimItlQb","date":"Wed Feb 02 16:23:52 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The campaign against abortion access in Washington is led by the same politicians who are voting down policies that promote racial, economic, and gender justice. Why? Because it's always been about control.\nhttps://t.co/EdySHQvTkW","date":"Wed Feb 02 14:35:33 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Celebrating the artist, the activist and her new 🪙, #MayaAngelou! She’s the first Black woman on the quarter — a historic milestone to honor an incredible person who made our nation more just and more beautiful. https://t.co/ILG8NlQizS","date":"Wed Feb 02 02:36:58 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We mark the start of #GVSurvivorWeek with another school shooting. \n \nTragically, it's a day like every other in America. \n \nWe do not have to live in violence. We are not powerless. All we need is the will to enact commonsense #gunreforms &amp; end this cycle.","date":"Tue Feb 01 23:14:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Every day, over 110 Americans are killed due to gun violence.\n\nIt's a tragedy that leaves no community or family untouched.\n\nFor every survivor and in honor of every victim, we cannot accept inaction. #GVSurvivorsWeek","date":"Tue Feb 01 21:46:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #LunarNewYear! This is a time of celebration, joy, and reflection as we prepare for the year ahead. Wishing everyone a happy and healthy Year of the Tiger! https://t.co/qkPGuItuLw","date":"Tue Feb 01 18:32:45 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The headline says it all: Moms can’t afford to work. \n\nOur child care system doesn’t have to be this way. \nhttps://t.co/XKDe0jFDAW","date":"Tue Feb 01 16:25:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Maus banned from schools. Swatikas on public buildings. And now, Nazi flags in Florida.\n\nAnti-Semitism doesn't exist just in the depths of the internet or in the shadows, but marches in our streets. \n\nIf we refuse to denounce it and ignore the past, we’re doomed to repeat it.","date":"Mon Jan 31 22:19:00 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit proves that childhood poverty is a policy choice. And we don’t have to allow it. #BuildBackBetter","date":"Mon Jan 31 16:29:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Ron Johnson reminds us how out of touch Republicans are with the needs of American families. Pass it on.","date":"Mon Jan 31 13:59:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, as we celebrate 13 yrs since President Obama signed the Lilly Ledbetter Fair Pay Act, don't forget that just 7 months ago the @SenateGOP filibustered the #PaycheckFairnessAct. \n\nInjustice is the GOP agenda. So, we have to choose: Senate procedure or progress? #equalpay","date":"Sat Jan 29 19:06:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The blizzard is here and bringing heavy winds. Charge electronics, stay safe, and stay warm!","date":"Sat Jan 29 15:48:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The @GOP has the American people in their rearview mirror — Democrats are delivering the solutions families are looking for. https://t.co/tLuuuFooFB","date":"Fri Jan 28 20:21:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The missing link between working families and an economy that works for everyone? Child care.\n\n👇YES        👇YES          👇YES","date":"Fri Jan 28 14:24:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A historic 14.5 million Americans enrolled in health care through the #ACA during open enrollment —  yes, the law the @HouseGOP tried to repeal over 50 times.","date":"Thu Jan 27 22:59:04 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#SCOTUS is going to make life-changing decisions for families in the coming years, from abortion to voting rights. @POTUS knows the Court must be a true representation of the American people to do that job well. Promises made, progress delivered.\nhttps://t.co/fmFBQ2nvDh","date":"Thu Jan 27 18:23:44 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We are getting one step closer to nine. #SCOTUS","date":"Thu Jan 27 15:25:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Building Back Better!","date":"Thu Jan 27 14:50:12 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Tackling the climate crisis is how we #BuildBackBetter. If we don’t, there will be nothing left to build on. #ClimateCantWait","date":"Wed Jan 26 20:18:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"The money went towards whatever seemed most urgent: Electric bills. Groceries. Debt payments. A refill on an asthma inhaler...\" \n\nThe #ChildTaxCredit helped 1 million children in #MA &amp; reduced food insecurity by 26%. Families need #BuildBackBetter.\nhttps://t.co/uwnOv9zCxg","date":"Wed Jan 26 16:04:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Homecare workers like the folks I met with today from @1199mass are on the frontlines of #COVID19  — caring for families while risking their own health. That's why Democrats enhanced their wages in the #AmericanRescuePlan &amp; why we must pass #BuildBackBetter.📢#CareCantWait! https://t.co/b4SjmdI7fH","date":"Tue Jan 25 21:40:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit is an investment in families and in our future. And we have the data to prove it. #AmericanRescuePlan #BuildBackBetter","date":"Tue Jan 25 14:17:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, I toured #Framingham's School Street Bridge — it's 97 yrs old &amp; 1 of MA's 472 bridges that need repair. Through the new #infrastructurelaw, we secured over $1 B to repair our bridges which will improve safety,  commute times, and lower costs for drivers. #BuildBackBetter https://t.co/pXrbYRkTsC","date":"Mon Jan 24 23:36:39 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We all do better when we all do better. That's the heart of the #BuildBackBetter agenda.","date":"Mon Jan 24 15:35:54 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Protecting the right to abortion &amp; the ability to access reproductive care will take all of us acknowledging the systems of oppression that persist in America. The fight for reproductive freedom is a fight for equality &amp; justice. #RoeVWade #RoeAnniversary \nhttps://t.co/cxpVuetUnX","date":"Sat Jan 22 20:35:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Anti-abortion politicians are hell-bent on controlling our bodies as a means to maintain power. \n\nThe same people who vote against abortion stand in the way of #childcare, paid leave &amp; pay equity. \n\n49 yrs after #RoeVWade, our fight for reproductive justice continues.","date":"Sat Jan 22 16:17:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"What's more infuriating here: \n\nThe refusal to acknowledge all \"people\" in this country having a right to equality, \n\nOr the fact that the GOP doesn't give a damn about kids after they're born (see votes on: child care, Child Tax Credit, paid family leave, food assistance, etc.) https://t.co/yvfwUHdzA6","date":"Fri Jan 21 17:37:46 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"No community should have to live in fear of hate crimes or targeted violence. In the US, as anti-Semitic attacks continue to rise, I’m proud to stand with my colleagues in unequivocally condemning all forms of religious bigotry.","date":"Fri Jan 21 14:52:13 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Listen to @RepKatiePorter explain @POTUS’ rapid economic recovery ⬇️","date":"Fri Jan 21 12:33:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Thanks to @npr's @ailsachang, @BrianMannADK &amp; @Harvard's @davideddiephd for this important story about the racial &amp; economic disparities that impact recovery — and the reasons to be hopeful.\nhttps://t.co/4J8XDRbl11","date":"Thu Jan 20 21:24:08 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"January 20, 2021: 18 million Americans on unemployment, &gt;1% of adults vaccinated against #COVID19\n\nJanuary 20, 2022: Unemployment rate below 3.9%; 75% of adults vaccinated, 6.4 million new jobs, 5 million more Americans have health coverage\n\nThat's how we #BuildBackBetter.","date":"Thu Jan 20 18:21:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Keep the faith.","date":"Thu Jan 20 03:47:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Just now Every Single @SenateGOP member voted to block:\n\nEarly voting\nElection Day as a holiday\nMail-in voting\nSame-day &amp; online voter registration\nBanning partisan gerrymandering\nCurbing dark $$ from elections\n\nThey voted against democracy &amp; your right to the ballot box.","date":"Thu Jan 20 01:58:49 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@POTUS' \"radical\" plan to [checks notes] make child care affordable and lower health care costs... 🧐.","date":"Wed Jan 19 23:04:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"No idea, but here's what they've voted against just this year:\n\n$$ to reopen schools\nChild care\nFree Vaccines\nLower energy costs\nChild Tax Credit\nAffordable housing\nFood assistance\nPaid family leave\nPay equity\nVoting Rights\nClimate justice\nGun reform\nLower health care costs","date":"Wed Jan 19 21:52:26 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"A majority of Americans support:\n\nclimate action\ngun reform\npaid leave\nuniversal pre-k\nvoting rights\n\nBut the Democratic Majority in the Senate can't bring the will of the people to life with the filibuster in place.  \n\nWe need #VotingRightsForThePeople. Now.","date":"Wed Jan 19 17:17:29 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans don’t have a problem amending the filibuster. They have a problem with you voting.","date":"Wed Jan 19 14:25:10 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@HouseDemocrats have a new fighter #forthepeople —  Welcome to the People's House, Rep. @sheila4congress!","date":"Wed Jan 19 00:38:17 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Senate Republicans would rather keep people from the polls than go on record on where they stand on #VotingRights.","date":"Tue Jan 18 20:56:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats are building a bridge to a stronger America with a $27 billion investment. \n \nRepublicans have built a wall of obstruction. #infrastructurelaw #BuildBackBetter \nhttps://t.co/P0Vg4YHtSK","date":"Tue Jan 18 17:47:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"If you want to honor the legacy of Dr. #MLK today, then support #votingrights tomorrow. End of discussion. #VotingRightsNow #EndTheFilibuster","date":"Mon Jan 17 22:06:15 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"We will not be satisfied until justice rolls down like waters and righteousness like a mighty stream.\" - #MLK  \n\nLet his legacy of compassion, courage, and perseverance guide us forward. #MLKDay2022 #MLKDay","date":"Mon Jan 17 15:32:10 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Grateful that the members of Congregation Beth Israel are safe. \n\nI stand in solidarity with the Jewish community in #Colleyville and across the country in the difficult days ahead. \n\nHate as no place here or anywhere. \nhttps://t.co/LrnjvwVIA4","date":"Sun Jan 16 13:59:34 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The gaslighting here is too much to handle. There’s no equivalent btw #January6th — when a mob attempted to hang you, Mike Pence — and defending our democracy by enacting voting rights. I'd dismiss this as more @GOP garbage if your lies weren’t such a threat to nation’s future. https://t.co/sBTNSsEFkE","date":"Sat Jan 15 21:16:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit is the largest tax cut for working families. It's a proven tool to fight childhood poverty and food insecurity. \n\nWhy won't Republicans help our youngest Americans who are most in need? #BuildBackBetterAct","date":"Sat Jan 15 17:47:54 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Embracing the silver was clearly a journey for me! And yes — honest dialogue is how we get to a place where every woman feels beautiful and empowered being themselves.","date":"Fri Jan 14 22:34:23 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Child poverty is a choice in the richest nation in the world. And we can choose to eliminate it with policies that work like the #ChildTaxCredit. This is our moment to #BuildBackBetter.","date":"Fri Jan 14 19:05:59 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#SCOTUS is refusing to uphold vaccine requirements while they chip away at abortion protections. So, \"personal freedom\" doesn’t apply to everyone? 🧐","date":"Fri Jan 14 14:32:09 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@aekelley13 Team #GrayHair 👩🏻‍🦳❤️","date":"Fri Jan 14 13:16:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Remember a month ago when Every Single Democratic Senator voted for a filibuster carve out to lift the debt ceiling \n\n...Why wouldn't you be willing do to the same to protect our democracy?","date":"Fri Jan 14 01:43:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@Tenpintux Love it!!!","date":"Fri Jan 14 00:08:47 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Newsflash: Bipartisanship only works when one party isn’t actively trying to undermine our democracy. Otherwise, it's an empty talking point.","date":"Thu Jan 13 17:31:06 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, we answered President Biden's call — we answered the people’s call: @HouseDemocrats once again passed #votingrights protections.\n\nNow, all eyes on the Senate — and the future of our democracy. https://t.co/AnvbTlpnJ7","date":"Thu Jan 13 16:31:01 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"When did protecting the right to vote become partisan? When it became about the powerful, not the people. We can’t sit on the sidelines while the most precious, sacred tool in our society is eroded.\" https://t.co/0vPrL75zHV","date":"Thu Jan 13 15:03:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"It was 2015 &amp; my life was chaos. Something had to give. For me, it was dying my hair. My personal decision quickly became political. My message: wear your hair with pride &amp; challenge the notion that women should be anything other than equal &amp; empowered👩🏻‍🦳✨\nhttps://t.co/yke4lSHEol","date":"Thu Jan 13 13:11:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Our democracy isn’t a given. It isn’t self-executing. We, as citizens, have to nurture and tend it. We have to work at it. And in that task, we have to vigilantly preserve and protect our most basic tool of self-government, which is the right to vote.\"","date":"Thu Jan 13 01:07:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"It comes down to this: what are Republicans afraid will happen if everyone gets an equal vote?","date":"Wed Jan 12 19:34:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"While the @GOP talks about inflation, they vote 'No' for policies that help to lower costs:\n\n#AmericanRescuePlan that brought businesses back to life \n\n#InfrastructureLaw that's improving our supply chain\n\n#BuildBackBetterAct that'll lower health care, child care &amp; energy costs","date":"Wed Jan 12 16:40:58 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"I'm on the side of John Lewis. How about you?","date":"Tue Jan 11 21:49:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This is important: @SenateGOP Members are refusing to even DEBATE voting rights protections. \n\nWhat are they so afraid of? The power of the people.","date":"Tue Jan 11 21:33:48 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"They want chaos to reign. We want the people to rule\" - @POTUS","date":"Tue Jan 11 21:25:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The Republican party sure is.","date":"Tue Jan 11 20:52:05 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"As #Omicron rages, Members breaking House rules by refusing to #maskup are threatening our dedicated staff and Members. Fines are not enough. I'm calling for unmasked Members to attend the floor and vote from the isolation boxes in the House Gallery. Read more⬇️ https://t.co/UTDAJDlqiE","date":"Tue Jan 11 17:50:22 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"1⃣9⃣ Republican led state legislatures have passed 3⃣3⃣ voter suppression laws.\n\nThese laws have 1⃣ goal: take power from the people. \n\nThe future of our democracy depends on enacting the #FreedomToVoteAct &amp; the John Lewis #VotingRightsAct to protect against this @GOP assault.","date":"Tue Jan 11 16:58:42 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Universal pre-k will be life-changing. Lower insulin prices will be lifesaving. \n\nWe need the #BuildBackBetterAct now.","date":"Tue Jan 11 14:05:17 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The first woman to win $1 million on Jeopardy? Who is #AmySchneider — and she's still competing! (Woo!)\n\nWhat is transphobia, when you qualify her success and say anything that isn't congratulations.\n#TransRightsAreHumanRights \nhttps://t.co/UgLEc5o45b","date":"Mon Jan 10 21:55:55 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"In case it's lost on anyone: we have to change the filibuster because ZERO Republican Senators will support protecting voting rights — not the minimum of 10, not 2, ZERO.","date":"Mon Jan 10 14:23:19 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"We can't allow the rules of Congress to be weaponized against progress. #AbolishTheFilibuster #VotingRightsNow https://t.co/LDIqtQelLd","date":"Mon Jan 10 00:09:51 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"What if I told you there was a bill that would:\n✅Cap insulin to $35/month\n✅Provide universal pre-k for all 3 and 4 year olds \n✅Make an historic investment to fight #climatechange\n\nWhat if I also told you that it was entirely paid for. \n\nTHAT’S the #BuildBackBetterAct.","date":"Sat Jan 08 15:51:02 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"3.9% unemployment is a big win for our economy. Don't believe me? Take it from Mike Huckabee. https://t.co/5Yl7WVtD3Q","date":"Fri Jan 07 19:19:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"When @POTUS took office, unemployment was at 6.7%. Today, unemployment is at 3.9%, the fastest decline in history. Before the #AmericanRescuePlan, @USCBO estimated we wouldn't reach this milestone until 2026. \n\nThis is what happens when families are front &amp; center in Washington.","date":"Fri Jan 07 19:00:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Today’s @GOP: if you acknowledge the truth about #January6th, you have to go on Tucker Carlson to grovel and eat your words. Pathetic, and terrifying.\n\nCC: @TedCruz","date":"Fri Jan 07 15:19:56 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democracy cannot survive voter suppression laws that substitute the will of the people for the will of a few.\nhttps://t.co/2dejDtTTDV","date":"Fri Jan 07 03:19:04 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Still true. https://t.co/7gWCT3X9lm","date":"Thu Jan 06 21:40:31 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"\"My dear friends: Your vote is precious, almost sacred. It is the most powerful nonviolent tool we have to create a more perfect union.” — #JohnLewis","date":"Thu Jan 06 18:50:03 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":".@HouseGOP voted against the establishment of the #January6thCommittee. And voting rights. And impeachment of the former president who incited the #January6thInsurrection. Now, they're absent from today's remembrance. \n\nThey're afraid of the truth &amp; their role as enablers.","date":"Thu Jan 06 17:20:25 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our country’s future depends on our ability to be honest about what happened on #January6th, the state of the Republican Party, and the ongoing threats to our democracy.","date":"Thu Jan 06 15:55:14 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The insurrectionists weren't in service of one nation. They were in service of one man.\n\nThis is everything our democracy stands against.","date":"Thu Jan 06 14:33:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"This summer peaceful protesters demanding racial justice were tear gased and arrested. \n\nToday, a seditious mob stormed the Capitol and then was allowed to leave. \n\nThe difference is skin color.","date":"Thu Jan 07 01:49:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"\"This wasn't a group of tourists. This was an armed insurrection. They weren't looking to uphold an election. They were here to overturn one.\"  - @POTUS","date":"Thu Jan 06 14:23:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans in the House &amp; Senate refuse to put our democracy ahead of their own pursuit of power. So, we must defend voting rights on our own. The future of the republic depends on it. My reflection one year after #January6th.\nhttps://t.co/ssyMBlvuYB","date":"Thu Jan 06 13:48:20 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Do not let Republicans rewrite history. Here are the receipts:","date":"Wed Jan 05 20:20:24 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"One year later, Republicans are still gaslighting Americans about what happened on #January6th.","date":"Wed Jan 05 18:39:30 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Democracy cannot survive voter suppression laws that substitute the will of the people for the will of a few. #HR1 #VotingRightsNow #AbolishTheFilibuster","date":"Wed Jan 05 13:51:39 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Meanwhile, the #BuildBackBetterAct would ensure the wealthiest Americans pay their fair share in taxes while lowering costs for working families. \nhttps://t.co/yFDLxjrARb","date":"Tue Jan 04 23:09:52 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"If turning the Senate into the House means enacting #BuildBackBetter and voting rights protections, then hell yes.","date":"Tue Jan 04 20:49:18 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#January6 was a staggering attack on America. And every day that Republicans promote the #BigLie and undermine voting rights, they continue their campaign against our democracy.","date":"Tue Jan 04 17:09:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Our #childcare system is essential to the economy &amp; stability of families. We need to act fast to raise wages for workers &amp; increase funding for providers so they can withstand the onslaught of challenges they're facing during #COVID &amp; beyond. \n\nWe need the #BuildBackBetterAct.","date":"Tue Jan 04 15:03:27 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"The Republican party claims to defend “family values” while voting against affordable child care, paid leave, and tax credits for working parents. \n\nGot it. 🤨","date":"Tue Jan 04 00:30:38 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Now let's make it national. #RaisetheWage","date":"Mon Jan 03 22:09:21 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"@MayorSiddiqui Congrats, @MayorSiddiqui! Ready to continue our partnership on behalf of the people of Cambridge and justice for all.","date":"Mon Jan 03 18:34:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"New year, same resolution for the Senate: #Abolishthefilibuster.","date":"Mon Jan 03 14:16:58 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Mood as we enter a new year ⬇️ https://t.co/TxHjz2ABng","date":"Sun Jan 02 14:34:16 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Be well, my friend! Thinking of you &amp; wishing you and the many who continued to be impacted by #Covid19 a fast recovery. #GetVaccinatedNow #GetBoostedNow","date":"Sat Jan 01 19:07:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"#HappyNewYear and welcome, 2022! Let this year bring us renewed hope, healing and a more just tomorrow. https://t.co/Jeyeuxvv7B","date":"Sat Jan 01 14:19:50 +0000 2022","user_id":"2293131060"},{"handle":"RepKClark","text":"Here's your year end reminder that in 2021 the @HouseGOP voted against:\n\nChild care\nHome care\nVaccines\nGreen jobs\nClean energy\nAffordable health care\nFood assistance\nLower Rx drug costs\nUniversal pre-k\nTax cuts for families\nHousing assistance\nVoting rights\n\nAnd the list goes on.","date":"Thu Dec 30 22:01:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Harry Reid dedicated his life to public service and improving the lives of those too often left out and left behind. May his legacy light our way forward.","date":"Wed Dec 29 02:37:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Build Back Better will lower energy costs. \nBuild Back Better will lower child care costs. \nBuild Back Better will lower health care costs. \nBuild Back Better will lower prescription drug costs. \n\nWant to fight inflation? Vote ‘Yes’ on the #BuildBackBetterAct.","date":"Tue Dec 28 22:53:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"10 million American households &amp; 400k schools and child care centers lack safe drinking water. The new #infrastructure law modernized our water infrastructure &amp; will eliminate all lead service pipes — moving us one step closer to #climatejustice.\nhttps://t.co/nnSLs4Apfs","date":"Mon Dec 27 17:58:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Racism and misogyny have no place in our politics or in work to combat #COVID19 — and yet are all too common. Standing with @MayorWu and every woman and woman of color who are met with hate instead of respect while serving our communities. \nhttps://t.co/FO7RN70UPE","date":"Sun Dec 26 16:12:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"From my family to yours, #MerryChristmas! Wishing you a joyful, peaceful and safe holiday! https://t.co/xvycPADrQ6","date":"Sat Dec 25 14:00:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As I've said before, it's our democracy or the filibuster — thank you, @POTUS! Now, let's get it done.","date":"Thu Dec 23 16:25:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"4 years ago today, Republicans gave the wealthiest Americans &amp; corporations a $2 trillion tax cut. \n\nAnd this year, every single Republican voted against the largest tax cut for working families -- the #ChildTaxCredit. \n\nAll you need to know.","date":"Wed Dec 22 19:32:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetterAct is going to lower energy bills AND carbon emissions. Good for our economy and good for our planet — let’s get it done.","date":"Wed Dec 22 15:20:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit has already reduced hunger in America by 24%. The tax cut is lifting families out of poverty and providing them financial stability. We can't turn our back on the #BuildBackBetterAct. https://t.co/ZUfgM3TyCB","date":"Tue Dec 21 23:25:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The care investments in #BuildBackBetter help all of us:\n\n👩‍👩‍👧Paid leave for families\n👶🏻Child care for parents\n🧓🏾Home care for seniors &amp; those with disabilities\n\nThere's no time to waste. #CareCantWait.","date":"Tue Dec 21 19:07:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Yesterday, @RepPressley and I visited the @CEOCCambridge where we learned that 55% of families in Massachusetts report using the #ChildTaxCredit to pay for #childcare. \n\nSimply put: the #BuildBackBetterAct is the jobs bill our  economy is waiting for. https://t.co/DYX0QR7qty","date":"Tue Dec 21 16:28:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetterAct is the right thing to do — to lower costs, to support families, and to boost our economy. There's no better proof the #ChildTaxCredit. https://t.co/ZauLV24VwJ","date":"Tue Dec 21 02:44:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. How will it protect against natural disasters?\nA. We're investing $50B to protect our infrastructure from extreme weather. We know that the dramatic increase in extreme weather events is due in large part to climate change &amp; everything in this bill is aimed at addressing it.","date":"Tue Dec 21 01:01:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. How will it help my people like my 81-year-old mother with heating costs?\nA. This law includes $$ for energy &amp; cost-saving programs, like $3.5B for the Weatherization Assistance Program, which helps families protect their homes against weather &amp; optimize energy efficiency.","date":"Tue Dec 21 00:59:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. Will this bill expand internet access?\nA. Yes! MA will receive at least $100M to provide broadband coverage across the state and 19% of people in our state will be eligible for a new benefit that will help low-income families afford internet access.","date":"Tue Dec 21 00:58:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. What provisions in the law will increase the ability for people to charge their EV?\nA: The #InfrastructureLaw includes $7.5B to build a national network of EV chargers to facilitate long-distance travel and provide convenient charging options. MA will receive $63 million! 🚘","date":"Tue Dec 21 00:46:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. How will the law address lead pipes &amp; PFAS?\nA: The law provides $55B to ensure clean, safe drinking water is a right in all communities:\n-$15B to boost lead pipe remediation efforts around the country\n-$1B for MA water infrastructure\n-$10B to eliminate &amp; detect PFAS","date":"Tue Dec 21 00:42:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Q. How will we train workers for these new jobs?\nA: The #InfrastructureLaw allocates $405M in grants to colleges &amp; universities to develop the next generation of transportation professionals. We're investing in our young people to take on the millions of new jobs we're creating.","date":"Tue Dec 21 00:36:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s my job to ensure that you have what you need to be safe today &amp; have a successful tomorrow.\nThe #InfrastructureLaw will send MA:\n-$4B for highway repair\n-$1B for bridge replacement &amp; repairs\n-$3B to improve public transportation","date":"Tue Dec 21 00:30:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you aren’t able to tune into my tele-Town Hall tonight, follow along here as my team live tweets the Q&amp;A so you can still get the information you need!","date":"Tue Dec 21 00:04:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Not only does this reinforce harmful stereotypes about Americans living in poverty, but it's blatantly false. The data is very clear: Americans are using this historic tax cut for basic necessities, like diapers, rent, child care, and food. \nhttps://t.co/5rhfEfjwrC","date":"Mon Dec 20 20:21:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit is the largest tax cut for working families in our nation’s history. Tune in LIVE as @RepPressley &amp; I join the Cambridge Economic Opportunity Committee to talk about how Democrats are putting families first in Washington. #MApoli https://t.co/bbd0j36Ap9","date":"Mon Dec 20 18:07:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Economists are clear: the #BuildBackBetterAct will lower costs for families, get parents back to work by investing in child care, and create good paying, green jobs. \n\nNewsflash: You want a full economic recovery, vote yes. \nhttps://t.co/nhERQmPuNu","date":"Mon Dec 20 16:05:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"TONIGHT @7PM! Join me for a Tele-Town Hall on the new Infrastructure Law and how it will help lower costs, increase energy efficiency, and improve our transportation and water systems! Dial in to join ⬇️ https://t.co/x9Horw997k","date":"Mon Dec 20 15:46:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In Case He Missed it: Does Joe Manchin know that Build Back Better would extend vital aid for sick coal miners?\nhttps://t.co/7uDug2WawZ","date":"Mon Dec 20 13:42:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Get well, my friend! Wishing you a speedy recovery.","date":"Mon Dec 20 03:15:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We cannot allow Joe Manchin to turn his back on the American people, economy, and President. We cannot accept “no” when it comes to the future of our children and planet. #BuildBackBetterAct","date":"Sun Dec 19 18:54:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Grateful that #MA is expanding its #childcare grants w/ federal funding I fought to secure. Providers are struggling to stay open &amp; parents to return to work. This $$ will help us make a full economic recovery w/o leaving parents, kids &amp; educators behind.\nhttps://t.co/zCAhKx6dEo","date":"Sat Dec 18 18:23:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@brikeilarcnn Wishing you a quick recovery, @brikeilarcnn! And yes, #GetBoostedNow, folks!","date":"Fri Dec 17 20:06:55 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"All I want for Christmas is for the Senate to abolish the filibuster.","date":"Fri Dec 17 16:16:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Medication abortion can be safely and effectively provided through telehealth. This is great news from the @US_FDA for women, patient safety, and health equity. #BansOffOurBodies https://t.co/FBaBTvTHz4","date":"Fri Dec 17 14:11:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Sackler family has blood on their hands for their role in the opioid crisis. They never should have been shielded from true accountability, but this is a step towards justice for all the pain and loss the Sacklers have caused.","date":"Fri Dec 17 02:29:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We know the #ChildTaxCredit is working — already it's reducing childhood poverty &amp; hunger. \n\nWe must extend it. AND make it permanent.","date":"Thu Dec 16 20:24:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"UPDATE: My Tele-Town Hall is RESCHEDULED for Monday, 12/20 @ 7PM ET. Looking forward to talking to you about the impact of the new #Infrastructure law!","date":"Thu Dec 16 18:03:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I've visited the amazing staff at @NurturyBoston &amp; heard firsthand about the entire #childcare industry's staff shortages. \n\nIt's simple: our full economic recovery depends on the #BuildBackBetterAct which raises worker wages, invests in providers &amp; lowers costs for parents.","date":"Thu Dec 16 15:40:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's voting rights AND Build Back Better. Not or. \nNot either. \n\nBOTH.","date":"Wed Dec 15 22:12:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This ⬇️","date":"Wed Dec 15 20:33:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Pictured below is the #GOP laughing at a policy that will cut costs for parents and save them over $8,000 a year. \n\nThe only thing that's funny is how out of touch they are with American families.","date":"Wed Dec 15 18:04:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Restaurants are hubs of culture and community. They keep us fed, create jobs, and brighten up our main streets. It’s up to us to stand up for them and their dedicated workers. \n\nWe must replenish the Restaurant Revitalization Fund.","date":"Wed Dec 15 15:24:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Updated link to submit questions: https://t.co/SrsULGP7Zk","date":"Wed Dec 15 14:01:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The frightening rise of Islamophobia can be seen around the world – and in the halls of Congress. If we are sincere in our fight for equality, religious freedom &amp; human rights, we must recognize Islamophobia &amp; do all we can to eradicate it. Proud to vote for this legislation⬇️","date":"Wed Dec 15 13:54:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"No one is above the law. Including Mark Meadows. Tonight, I voted to hold him in Contempt of Congress on behalf of the truth and in defense of our democracy.","date":"Wed Dec 15 04:08:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you aided in a plot to overturn an election, you’re not a patriot. But you are Mark Meadows.","date":"Wed Dec 15 00:06:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Mark your calendars, #MA5! I'm hosting a Tele-Town Hall this Thursday to discuss how the new #Infrastructure Law will create jobs, improve our transportation and water systems, tackle climate change, and lower your costs!\n\nPre-submit questions here:  https://t.co/PgFnrTAOPg https://t.co/SvuENitBvo","date":"Tue Dec 14 19:19:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's been 9 years since the unthinkable tragedy at #SandyHook. Since then:\n# of gun deaths = 346,121\n# of mass shootings = 3,621\n# of moments of silence = too many \n# of bill passed to reduce #gunviolence = 0\n\nHonor with action. #GunReformNow","date":"Tue Dec 14 21:10:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Mark your calendars, #MA5! I'm hosting a Tele-Town Hall this Thursday to discuss how the new #Infrastructure Law will create jobs, improve our transportation and water systems, tackle climate change, and lower your costs!\n\nPre-submit questions here:  https://t.co/PgFnrTAOPg https://t.co/SvuENitBvo","date":"Tue Dec 14 19:19:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Nine years ago, twenty children &amp; six educators were murdered in #Newtown. \n \nSince then, not one #gunreform bill has made it to the president's desk. Why? \n\nRepublican obstruction. #SandyHook #EndGunViolence","date":"Tue Dec 14 15:01:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Reminder: Paul Gosar voted against the American Rescue Plan. In fact, not only did he refuse to provide federal funding to save lives from COVID, he actually threatened the life of a fellow Congress Member. \n\nThere is no level too low.","date":"Mon Dec 13 19:24:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Whether you’re a waitress, a movie star, or an Olympian, harassment &amp; abuse are unacceptable. I hope this settlement continues the healing process for these brave women. Now, we must enact laws to change the culture of silence &amp; abuse, &amp; secure justice for everyone. #BeHEARDAct","date":"Mon Dec 13 18:59:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@crystalhu2003 @conginst Thank you for sharing your incredible talent and creativity with the entire Capitol Hill community — you're making #MA5 proud!","date":"Mon Dec 13 18:48:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats are putting 💵 directly into your bank account. \n\nThe #BuildBackBetterAct will continu the largest tax cut for families in U.S. history by extending the #ChildTaxCut. \n\nWhether it’s groceries or rent or child care, these payments are about lowering your costs!","date":"Mon Dec 13 15:41:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Apply today! ⬇️","date":"Mon Dec 13 15:29:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Reproductive Rights are #HumanRights. \nWomen's Rights are #HumanRights.\nLGBTQ+ Rights are #HumanRights.\nImmigrant Rights are #HumanRights.\n \nTo a world where every day is #HumanRightsDay.","date":"Sat Dec 11 00:07:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our students’ success is about more than test scores — they need social &amp; emotional support to thrive. Proud to introduce the Elementary &amp; Secondary School Counseling Act with @SenJeffMerkley to provide mental health services in school &amp; promote the long term health of students.","date":"Fri Dec 10 21:57:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Join @johnlegend and tell the Senate that this year you deserve it all: the #BuildBackBetterAct.","date":"Fri Dec 10 18:54:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#SCOTUS isn't standing up for our constitutional right to reproductive freedom. So, Congress has to.  \n\nWe must enact the #WomensHealthProtectionAct — now.","date":"Fri Dec 10 17:49:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Families are facing higher prices as a result of the pandemic. Here's the good news: @POTUS has taken action that's already improving the supply chain. And @HouseDemocrats passed a bill to lower costs &amp; taxes: #BuildBackBetterAct.\n\nBut the #GOP? No plan. Only obstruction.","date":"Fri Dec 10 15:56:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Nothing is more fundamental to protecting our democracy than ensuring the integrity of our government. Proud to pass the #ProtectingOurDemocracyAct with my provision to prohibit the President, VP &amp; Cabinet members from contracting with the federal government (hint: Trump).","date":"Thu Dec 09 22:24:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"He was a vital ally in passing my bill, the PAWS Act, that helps victims of domestic violence &amp; their pets, &amp; fought tirelessly for people w/ disabilities. I was honored to attend his memorial today &amp; will carry on his legacy of cooperation &amp; kindness. 2/2\nhttps://t.co/xTv0uODxTb","date":"Thu Dec 09 20:11:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Bob Dole was a patriot and a selfless public servant. His loyalty was first and foremost to the American people, not politics or party. He was an incredible champion for vulnerable people and animals throughout his 46-year career in elected office. 1/2","date":"Thu Dec 09 20:11:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good.","date":"Thu Dec 09 19:05:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"50 years ago today, President Nixon vetoed a bill to fully fund #childcare in America. \n\nWe cannot let this opportunity pass us by again. This is our moment to enact the #BuildBackBetter — for our kids, for our future &amp; for our economy. #ChildCareisInfrastructure https://t.co/5CrfAJyEls","date":"Thu Dec 09 15:04:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congratulations, @DARollins! What a historic day and a major step forward for equal justice under the law.","date":"Wed Dec 08 21:48:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Massachusetts families will save thousands of dollars every year (!) through the #BuildBackBetterAct's #ChildTaxCredit and cap on #childcare costs. \n\nLearn more about how we're lowering costs for you⬇️\nhttps://t.co/XnJ1lmXWaE","date":"Wed Dec 08 21:21:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's been 5 years since the unthinkable tragedy at #SandyHook. Since then:\n# of gun deaths = 170,000\n# of mass shootings = 1,700\n# of moments of silence = 40\n# of bill passed to reduce #gunviolence = 0\n#HonorWithAction","date":"Thu Dec 14 14:21:44 +0000 2017","user_id":"2293131060"},{"handle":"RepKClark","text":"3.4 million Americans would gain health insurance as a result of the #BuildBackBetterAct. \n\nIt will:\n✅expand health care access for children\n✅make insurance more affordable\n✅improve Medicare benefits for the disabled &amp; older Americans\n✅lower Rx costs\nhttps://t.co/XG77ZBaMyv","date":"Wed Dec 08 18:58:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats are passing tax cuts for families, historic infrastructure funding, and creating green jobs.\n \nRepublicans are holding pressers to defend the violent mob that attacked our democracy.\n\nWhen the @HouseGOP shows you who they are, believe them.","date":"Tue Dec 07 21:49:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Big welcome from @IBEW103! Great morning meeting with some of the workers who will be bringing the #infrastructure law to life. Good paying, green jobs — that's how we #BuildBackBetter! https://t.co/B0VfEQCSlB","date":"Tue Dec 07 21:12:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LAntonellis103 @IBEW103 @bostonjatc103 @KatherineClark Thanks for a great visit, @LAntonellis103! #IBEW is leading the way on how we #BuildBackBetter with great, green jobs!","date":"Tue Dec 07 21:07:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"LIVE NOW in Winthrop with local officials &amp; advocates to discuss the historic investments in our state’s water infrastructure to #BuildBackBetter. The $55B in federal funding is going straight to families to provide clean drinking water for MA5! #MApoli https://t.co/Ozh3xZzHTV","date":"Tue Dec 07 18:03:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A toddler takeover is what happened in homes during the pandemic when parents didn't have access to #childcare.\n\n#BuildBackBetter is the solution.","date":"Tue Dec 07 15:38:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"LIVE NOW at the South Natick Dam for a discussion on the need to remove toxic PFAS chemicals from our community’s water sources and ensure we all have clean drinking water. This is how we #BuildBackBetter in MA5! https://t.co/9fEYPoH6U8","date":"Mon Dec 06 18:24:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, I visited @SMOCMA's new Green Jobs Academy. They're teaching workers how to weatherize homes, a process that brings down energy costs &amp; protects the planet. The Infrastructure Law will help families afford to weatherize their homes &amp; fund the creation of new jobs! https://t.co/teWUULP3at","date":"Mon Dec 06 17:38:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Aren’t we in the season of peace and goodwill? What a repulsive, violent message especially in a week when we lost 4 students to gun violence in Michigan. Instead of wishing for ammo, how about working for gun safety so all our kids can be home for the holidays? https://t.co/3o42mKVTJK","date":"Sat Dec 04 21:08:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The new #Infrastructure law helps families save money &amp; save our planet. Cindy’s home was recently weatherized and she has seen a 30% reduction in her energy bill. This is how we #BuildBackBetter! https://t.co/lFXDjfBoM2","date":"Fri Dec 03 22:35:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I’m grateful for the incredible work of these orgs &amp; others who make access &amp; opportunity a reality for all. And I'm proud that the #BuildBackBetterAct includes funding for home &amp; community care services, expanding access &amp; increasing provider wages. (5/5) https://t.co/oxN6X3eBDP","date":"Fri Dec 03 17:18:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Learning Center for the Deaf in #Framingham was the 1st school in #MA for people who are deaf. The Center includes a preschool, sign-language program, a special needs program, and partnered with @BU_Tweets to center research on bilingual-bicultural education. (4/5)","date":"Fri Dec 03 17:18:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The @NECCforautism is a school in #Southborough that helps children with autism spectrum disorder. It is also a leading research center for discovering new &amp; better methods to best teach children with autism, with many of their programs helping educators around the world. (3/5)","date":"Fri Dec 03 17:18:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Founded in 1829, @Perkinsvision was the 1st school in the US for people with visual disabilities. Today, it is located in #Watertown, with services extending all over the world &amp; is a leading researcher &amp; producer of assistive &amp; accessible technologies, including braille. (2/5)","date":"Fri Dec 03 17:18:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today is the International Day of Persons with Disabilities, and I wanted to recognize the incredible work of @Perkinsvision, @NECCforautism, the #LearningCenterForTheDeaf, and all the other orgs in #MA5 who help and advocate for people with disabilities and improve lives. (1/5) https://t.co/7xjRvJppe5","date":"Fri Dec 03 17:18:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"65 million. Women. \nhttps://t.co/R9E5LCgfrG","date":"Fri Dec 03 15:33:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We don’t have a minute to waste. We must enact the #WomensHealthProtectionAct into law. \n\nYou with me? #AbortionIsEssential","date":"Fri Dec 03 00:58:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Funding the government supports Americans. Shutting it down hurts us all. The #GOP gets it, they just don't care.\n\nTonight, @HouseDemocrats vote #forthepeople.","date":"Thu Dec 02 22:18:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Expanded #ChildTaxCredit that you voted against has already helped feed over 3 million hungry kids. \n\nThe @HouseGOP's agenda: chicken tenders.","date":"Thu Dec 02 18:45:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The annual price of insulin for Americans w/ Type 1 diabetes nearly doubled from $2,900 in 2012 to $5,700 in 2016. Why? Greed. \n\nThe #BuildBackBetterAct caps insulin prices at $35 per month — because cost should never get in the way of care.","date":"Thu Dec 02 13:54:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Just hours after four lives were lost at Oxford High School in yet another school shooting, Republican lawmakers who claim to support life are calling on #SCOTUS to dismantle #RoeVWade. Let's ban assault rifles, not health care.","date":"Thu Dec 02 01:04:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Keep your bans off our bodies. \nKeep your laws out of our doctors’ offices. \nKeep our Constitutional rights in place. #AbortionisEssential https://t.co/WkPi3MjQVZ","date":"Wed Dec 01 22:19:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Justice Thomas: “What constitutes abortion as a constitutional right?” \n\nRikelman: “Liberty, your honor.” \n\n👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼\n#SCOTUS #AbortionIsEssential #AbortionIsHealthcare","date":"Wed Dec 01 16:31:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We won’t back down. #AbortionIsEssential https://t.co/Byo182yIvR","date":"Wed Dec 01 15:44:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The stakes have never been higher but we will not back down. \n\n#AbortionIsEssential and must be here to stay.","date":"Wed Dec 01 14:06:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I'm horrified and exhausted by yet another school shooting. My heart goes out to the families and community of Oxford. Thoughts and prayers continue to fall short. It's long past time for commonsense #gunreform.","date":"Tue Nov 30 23:34:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Ty for sharing, Hillary. This is what the #ChildTaxCredit is all about — delivering long awaited and well-deserved financial relief to parents, no strings attached. We're putting families first in Washington.","date":"Tue Nov 30 22:01:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"One might say this is how we \"Bill Back Better\"","date":"Tue Nov 30 21:34:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"To repeat: \"a profound economic and moral victory for the country.\" #ChildTaxCredit","date":"Tue Nov 30 17:13:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @POTUS signed into law the Protecting Moms Who Served Act, the largest investment in history to combat maternal mortality &amp; advance birth equity! TY to @RepAdams, @RepUnderwood &amp; the @BMHCaucus for ensuring that the first #Momnibus bill is now a reality for our veterans.","date":"Tue Nov 30 17:00:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"How will #BuildBackBetter help improve health care access &amp; affordability? \n\n✅Updates medical facilities for veterans\n✅Expands Medicare to cover hearing\n✅Strengthens the ACA\n✅Closes the Medicaid coverage gap\n✅Caps insulin at $35/month\n\nIt's our agenda #forthepeople.","date":"Tue Nov 30 16:31:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The best #CyberMonday deals from Congress?\n\nAffordable child care. \n$35/month insulin cap. \nUniversal pre-k.\nTax credit for families.\nLower health care costs. \n\nThese are the gifts that keep on giving. #BuildBackBetter","date":"Mon Nov 29 20:00:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Fact ⬇️","date":"Mon Nov 29 16:37:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning 🌞. Today is a great day to #GetVaccinated!","date":"Mon Nov 29 13:04:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"For those celebrating Hanukkah, I hope your nights are filled with warmth, light and time spent with friends and family. #HappyHanukkah! https://t.co/tOkVB93IlG","date":"Mon Nov 29 00:22:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Build Back Better Act is a climate justice bill.\nThe Build Back Better Act is a working families bill.\nThe Build Back Better Act is a health care bill.\n\nThe #BuildBackBetter Act is our future reimagined.","date":"Sun Nov 28 16:43:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Rep. Boebert’s repeated &amp; targeted Islamophobic comments against @Ilhan are offensive &amp; dangerous. Kevin McCarthy &amp; the entire #GOP Leadership’s repeated failure to condemn bigoted rhetoric is outrageous. The #GOP must take real action to confront racism within their conference.","date":"Sat Nov 27 01:36:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #Thanksgiving! Today and every day, I am thankful for the opportunity to fight for working families in Congress. May your day be safe, restful, and filled with friends, family, and delicious food! https://t.co/46hqc9uWbB","date":"Thu Nov 25 14:43:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, we breathe relief. Tomorrow, we continue our fight for justice for all. #AhmaudArbery","date":"Wed Nov 24 19:54:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#NativeAmerican history is American history. And we must work to empower Tribes across the country who help us learn and grow and enrich all of our communities. \n\nThe first step is recognition — do you know whose territory you live on? (7/7) \nhttps://t.co/LsLMGPVsqX","date":"Wed Nov 24 18:07:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"For the Wampanoag, after numerous treaty violations and colonist-induced epidemics, their population had declined by as much as 90%. Frustrated by their loss of land and people, the Wampanoag fought back resulting in King Philip’s War. (5/7)","date":"Wed Nov 24 18:07:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, of the original 69 tribes that made up the Wampanoag Nation, only 3 survive, including the Mashpee Wampanoag. \n\nThese Tribes add so much to the Commonwealth's culture and help us to speak truth about our past and celebrate the gift of our natural surroundings. (6/7)","date":"Wed Nov 24 18:07:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Massachusetts lived in Greater Boston. Unprepared early European settlers oft raided them for supplies &amp; forcibly took most of their land. This resulted in severe poverty and population decline. (4/7)","date":"Wed Nov 24 18:07:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"2 Indigenous nations have laid claim to the lands around #MA5. The Massachusett, who's name means “At the Great Hill\" — and who our state is named after — and the Wampanoag, whose name means “People of the First Light”. (2/7)","date":"Wed Nov 24 18:07:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Here long before the Pilgrims, the Wampanoag Nation's ancestral lands extends from Rhode Island, Cape Cod and southern MA. It was the Wampanoag who taught the Pilgrims how to hunt &amp; plant crops, saving them from starvation and leading to the #Thanksgiving myth. (3/7)","date":"Wed Nov 24 18:07:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's #NativeAmericanHeritageMonth and as we prepare for #Thanksgiving, it's time we celebrate the proud history of our Indigenous neighbors as well as acknowledge the injustices faced by Tribes in America, including right here in #MA. 🧵 (1/7)","date":"Wed Nov 24 18:07:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Building Back Better ⬇️🥳","date":"Wed Nov 24 16:16:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Great news — and an historic nomination. Shalanda has long been a leader in Washington, helping us shape a sound and progressive budget. Congrats, \nShalanda!","date":"Wed Nov 24 14:22:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The overdose crisis is a racial justice crisis. \nhttps://t.co/gXn2qYqRnX","date":"Tue Nov 23 22:08:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The average family pays 13% of their income on #childcare. \n\nUnder #BuildBackBetter, families pay no more than 7% of their income. \n\nWe're securing lower costs #forthepeople.","date":"Mon Nov 22 14:53:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"For the children. For our future. #BuildBackBetterAct https://t.co/1k8RmeG5L7","date":"Sat Nov 20 14:42:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There can be no justice without a justice system that applies the law equally. That's not what happened today. #RittenhouseVerdict","date":"Fri Nov 19 20:08:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every single Republican House Member voted against:\n\naffordable child care,\nuniversal pre-k,\naffordable housing,\nlower Rx drug prices,\ngreen jobs,\nand tax cuts for working families.\n\nRemember who they are and who they’re looking out for.","date":"Fri Nov 19 17:18:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetter Act is what’s possible when families are front and center in Washington. Here’s to a stronger tomorrow.","date":"Fri Nov 19 16:42:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, we celebrate women in the economy AND a woman in the White House. ✨\nhttps://t.co/RD2OtgY1iQ","date":"Fri Nov 19 16:14:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, we voted for our future. Tune in ⬇️ #BuildBackBetter","date":"Fri Nov 19 15:12:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@bresreports What's not to enjoy! https://t.co/neqRJjT797","date":"Fri Nov 19 14:47:05 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Done! #BuildBackBetterAct https://t.co/tIS0u0W9YO","date":"Fri Nov 19 14:42:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We're about to make universal pre-k a reality for every child in America. Proud to preside over this historic moment. #BuildBackBetterAct https://t.co/kKOHA2wgT8","date":"Fri Nov 19 13:28:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What did we learn last night from Kevin McCarthy (hint: he's against everything Americans are for) ⬇️ https://t.co/8EeAZSXpUu","date":"Fri Nov 19 13:13:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Kevin McCarthy is making sure America knows he’s against universal pre-k, lower health care costs, and lower taxes for families... Noted.","date":"Fri Nov 19 02:50:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight we put working families first.","date":"Fri Nov 19 00:17:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Build           Back          Better \n👇               👇              👇","date":"Thu Nov 18 23:35:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We've listened to your feedback and we are ready to pass the #BuildBackBetter Act! https://t.co/iOFnpR8wLm","date":"Thu Nov 18 22:02:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Imagine an America where child care is affordable, pre-k is universal, and caregivers are paid a livable wage. \n\nThat’s the Build Back Better Act. That's our reality in the making.","date":"Thu Nov 18 19:25:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Proud to reintroduce the #BeHeard Act with @PattyMurray, @maziehirono, @reppressley, @repsylviagarcia, @repslotkin &amp; @RepStricklandWA to guarantee justice and respect for every worker. No more silence, no more complacency. #MeToo  \nhttps://t.co/X1rUZQVEyX","date":"Thu Nov 18 18:32:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We are meeting this moment of historic challenge with historic progress to give all children an equitable, great start. Our message to working families: we have your back. #BuildBackBetter #CareIsInfrastructure. https://t.co/bLGoBDePJP","date":"Thu Nov 18 17:07:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@GeoffRBennett @NewsHour @MSNBC @NBCNews Congrats, @GeoffRBennett! Great news for @NewsHour  and for all of us watching.","date":"Thu Nov 18 15:34:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, I'm presiding as the @HouseDemocrats debate the #BuildBackBetter Act, moving us one step closer to transformative progress for families! https://t.co/mvMoQwX2vs","date":"Thu Nov 18 15:21:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I stand with the people of Armenia who have suffered another unprovoked attack. Azerbaijan must acknowledge and respect Armenian sovereignty. I condemn this latest act of aggression and urge the government to adhere to last year's peace deal.","date":"Thu Nov 18 14:47:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"207 Republicans just voted to ignore a Member making a death threat against one of their colleagues. \n\nJust like they ignored the insurrection. \n\nThis is the #GOP agenda.","date":"Wed Nov 17 23:12:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today is #ThxBirthControl Day. \n\nAnd every day birth control is basic health care.","date":"Wed Nov 17 23:03:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What started as online white supremacy turned into the deadly #Jan6Insurrection. Now, a Member of this body has once again had her life threatened - but this time, by a colleague who posted a video of killing her on his official account. Enough is enough. #CensureGosar https://t.co/I0tUsCLk4s","date":"Wed Nov 17 21:30:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Why is it so hard for the #GOP to say that threatening the life of a colleague is wrong?\n\nThat's the question before the House.\n\nStanding with you today, @RepAOC.","date":"Wed Nov 17 20:14:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #InfrastructureAct in #MA by the numbers:\n\n$4.2 billion for roads\n$1.1 billion for bridges\n$2.5 billion for public transit\n$1.1 billion for clean water\n\nThank you, @POTUS.\nhttps://t.co/IUzfhSoPIQ","date":"Wed Nov 17 17:13:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats are meeting the challenges families are facing with real solutions: clean energy, lower costs, affordable child care, extended tax cut for families, and more. We're delivering results and building a stronger tomorrow. #BuildBackBetter https://t.co/EkPiP2rvvc","date":"Wed Nov 17 15:24:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The @GOP isn’t just voting against new jobs, cutting taxes, and fixing the supply change — they’re actively rooting against the American people and for higher prices.","date":"Wed Nov 17 01:02:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetterAct will provide every 3 and 4 year old in America access to pre-k — the largest expansion of free education in 100 years. We're investing in families and our future. \nhttps://t.co/fFHlvPubK0","date":"Tue Nov 16 18:21:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Families can't wait. Workers can't wait. #CareCantWait. This week, we #BuildBackBetter. https://t.co/EmapQN4Psv","date":"Tue Nov 16 17:10:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"3 words, 19 letters, so much possibility: affordable child care\n\n#BuildBackBetter #CareCantWait","date":"Tue Nov 16 14:54:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I love what @POTUS just said during the #InfrastructureBill signing: \"the #BuildBackBetter agenda is about one thing: possibility.\" \n\nWhen we invest in America, when we invest in our future and in families, we believe in possibility.","date":"Mon Nov 15 21:28:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #InfrastructureBill is now law. 🙌🏼","date":"Mon Nov 15 21:23:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"100% of Americans will have access to clean water by eliminating 100% of lead pipes. That's building back better. #InfrastructureBill","date":"Mon Nov 15 21:11:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's a VERY Happy Monday. Not only does another round of the #ChildTaxCredit hit bank accounts today, but @POTUS is set to sign the #BipartisanInfrastructureBill into law — #BidenDelivers for families!","date":"Mon Nov 15 18:24:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What's better than #Infrastructure Week? An infrastructure generation.✨","date":"Mon Nov 15 17:14:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Modern roads, bridges and public transportation. Clean drinking water for every American. Universal broadband access. Smart investments against the climate crisis. Today, #BidenDelivers.","date":"Mon Nov 15 14:31:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, more than a million seniors pay more than $6,000 a year in on their prescription drugs. \n\nUnder #BuildBackBetter, seniors will Never pay more than $2,000 a year for their drugs under Medicare Part D.","date":"Sun Nov 14 22:45:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Britney is free.","date":"Fri Nov 12 23:27:40 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"No one is above the law. This is an important step toward getting to the truth.","date":"Fri Nov 12 21:07:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, families pay an average of $8,600 per year on pre-k. \n\nUnder #BuildBackBetter, they will pay $0.","date":"Fri Nov 12 16:53:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Enough violence, hate and complicity from the House #GOP. Rep. Paul Gosar must be censured. https://t.co/aeqISliFlS","date":"Fri Nov 12 15:09:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@gawd2u Good news: The #InfrastructureBill does exactly that — it will remove all lead pipes so that every American has access to clean drinking water.","date":"Fri Nov 12 14:21:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"DYK: The #InfrastructureBill creates 2 million jobs each year over the next 10 years. What’s more, it requires contractors to pay workers on construction projects a fair, prevailing wage. Good paying jobs is how we #BuildBackBetter.","date":"Fri Nov 12 13:56:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"To every single person who has put on a uniform to defend our freedom and democracy: thank you. #VeteransDay2021 https://t.co/HycWqg9jMy","date":"Thu Nov 11 13:44:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Perfect example of the obstacles facing parents who work from home — including World Leaders. And that, yes, the bedtime routine is still everyone's nightmare.","date":"Wed Nov 10 22:23:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Affordable, high-speed internet is about to become a reality for every household and small business in America. #InfrastructureBill #BuildBackBetter","date":"Wed Nov 10 17:37:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The House #GOP:\n\nGOP Member posts video killing a colleague. Crickets.\n\nGOP Members vote for roads &amp; bridges, broadband, and clean water. GOP threatens primaries, kicking them off committees, and worse.","date":"Wed Nov 10 15:13:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is our #ChildCareisInfrastructure dance 💃🏾💃🏼💃🏼 #BuildBackBetter https://t.co/UCgijqvwfs","date":"Tue Nov 09 21:08:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The global #climatecrisis can’t be fixed by one country, or one approach — we must all come #TogetherForOurPlanet. We must #ActOnClimate if we’re going to preserve our planet for families today and for future generations. #COP26 https://t.co/faeor5xajO","date":"Tue Nov 09 18:36:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There should be no place in Congress for this type of violence and Rep. Paul Gosar.","date":"Tue Nov 09 15:37:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Incredible vaccine effort in Arlington this past weekend - 1/3 of eligible kids are now vaccinated! Keep up the great work, #MA5!","date":"Tue Nov 09 14:57:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Going greens means going electric. The #InfrastructureBill will create a nationwide network of electric vehicle charging stations so we can all make the switch — reducing emissions, improving air quality &amp; creating green jobs. Great to see this all in action with @RepDebDingell!","date":"Tue Nov 09 00:02:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Infrastructure: it's electric 🎶. #BuildBackBetter https://t.co/zHNzvNhvIZ","date":"Mon Nov 08 20:41:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #InfrastructureBill means we will remove all lead pipes and ensure every American has access to clean drinking water. That’s how we #BuildBackBetter.","date":"Sat Nov 06 17:33:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Advancing the infrastructure package and the #BuildBackBetter Act puts us on the precipice of progress as we bring to life our shared vision of a safe planet, a just economy, and a strong future for every worker, woman, child, and family. My full statement on tonight's votes ⬇️ https://t.co/FFFFQxKGoA","date":"Sat Nov 06 04:41:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We're modernizing our roads &amp; bridges, \nexpanding broadband, \ngetting lead out of our drinking water, \naddressing climate change — \nAND adding 2 million good paying, green jobs each year over the course of the next decade. \n\nAnd we're just getting started.","date":"Sat Nov 06 03:41:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"All while:\n👷🏾Creating good paying union jobs and a clean energy economy that works for all\n\n⚖️Centering equity and putting historically underserved communities first\n\n💰Ensuring the bill is FULLY paid for by making big corporations &amp; the wealthiest pay their fair share.","date":"Fri Nov 05 16:22:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"AND, the BIGGEST clean-energy investment in U.S. history ☀️ with $555 billion going towards curbing greens house gas emissions, investing in green businesses and manufacturing, and cutting pollution to combat the #climatecrisis.","date":"Fri Nov 05 16:22:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"✅Medicare coverage for hearing\n✅Capped out-of-pocket prescription drugs costs for seniors at $2,000 annually \n✅Reduced insulin costs to $35/month.","date":"Fri Nov 05 16:22:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It addresses the needs of families by providing\n✅Universal Pre-K\n✅Affordable, quality child care for 20 million families\n✅An extended #ChildTaxCredit that puts $$$ into your pocket","date":"Fri Nov 05 16:22:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetter Act invests directly in families, creates green jobs, and lowers costs and taxes. Let’s talk about what’s in this once-in-a-generation bill 🧵⬇️","date":"Fri Nov 05 16:22:40 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If the Americans had any doubt about who has their families’ best interests at heart, House Republicans are trying to adjourn instead of passing the #BuildBackBetter Act — aka. obstructing lower Rx drug costs, lower child care cost, green jobs, and more.","date":"Fri Nov 05 13:34:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning ☀️ Today, we #BuildBackBetter - for women, for workers, for kids, for our climate — for our future.","date":"Fri Nov 05 12:17:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@The1OnlyRichie @KatherineClark 💙","date":"Thu Nov 04 23:47:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Whether you're a job applicant or employee, all workers deserve equal rights &amp; protections. Proud to vote for @RepSylviaGarcia's Protect Older Job Applicants Act to do just that. Thank you for your leadership on this vital bill!","date":"Thu Nov 04 19:42:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A reality that should never be true: “Child care workers are facing food insecurity, eviction, and distress.”\n\n#BuildBackBetter guarantees livable wages for the essential early educators who enable all other work and foster a strong future for our kids.","date":"Thu Nov 04 15:39:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Under President Biden's leadership:\n \n✅ 70% of Americans have been vaccinated\n✅ 80% have received at least one dose\n✅ Covid cases &amp; hospitalizations are ⬇️ by more than 50%\nAND \n✅ 28 million children are now eligible for vaccines\n \nThat's recovery in action.","date":"Thu Nov 04 13:33:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats know All Too Well that working families need us to #BuildBackBetter (Infrastructure's Version) (feat. @HouseDemocrats)","date":"Wed Nov 03 21:50:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"For those watching the Republican party sink another #votingrights bill for the 4th time this year, a reminder that in 2006 the Senate reauthorized the Voting Rights Act voting 98-0.\n\nRepublicans have abandoned our democracy.","date":"Wed Nov 03 20:20:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As if it couldn’t be more obvious that Republicans don’t want your voice to be heard in our democracy, they just filibustered the #JohnLewisVotingRightsAct. \n\nThe filibuster has got to go because the right to vote is here to stay.","date":"Wed Nov 03 19:42:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"80% of private-sector workers don’t have access to paid leave, not a single paid sick day. \n\nFor low wages workers, especially women &amp; people of color, it jumps to 95%. \n\n#Paidleave isn't a vacation or a handout — it's fundamental to a strong economy.\nhttps://t.co/FI7y19mNL7","date":"Wed Nov 03 17:48:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Here's a 3⃣0⃣ second recap of our 3⃣0⃣0⃣ days in the \n@HouseDemocrats majority — and we're just getting started! #ForThePeople https://t.co/wuiYrYOjUN","date":"Tue Nov 02 18:01:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"ICYMI: #BuildBackBetter is the largest climate investment in U.S. history. \nhttps://t.co/fb7pw7CST3","date":"Tue Nov 02 14:59:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@SarahMatMDMPH Thanks for all YOU do as a care provider! Together, we will protect the right💙 #VotingRights #FreedomtoVote","date":"Tue Nov 02 13:58:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Say it with me: \nInvesting in child care saves us money. \nInvesting in families save us money. \nInvesting in climate saves us money. \nInvesting in clean energy saves us money.\n\nBy investing today, #BuildBackBetter saves us money tomorrow.","date":"Mon Nov 01 19:36:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#SB8 is an attack on our constitution and an attack on freedom. \n\nPolitically motivated lawmakers and courts have no role in personal health care decisions. \n\nAbortion is about our right to live freely and fully. #BansOffOurBodies","date":"Mon Nov 01 15:20:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#HappyHalloween2021 ! Found my favorite jack-o-lantern in #MA5. This year, boo and vote! #HR1 https://t.co/wMv7mDtKIQ","date":"Sun Oct 31 16:34:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"President Biden's #BuildBackBetter framework includes $400 BILLION to lower #childcare costs &amp; provide universal pre-k for every 3 and 4 year in America. \n\nThis is huge — for kids, for women, and for our economy. This is child care as infrastructure. \nhttps://t.co/NGk03YvvcL","date":"Fri Oct 29 14:08:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you're wondering how parents get back to work. If you're wondering how we re stimulate the economy. If you're wondering how we ensure a bright future for our kids. All roads lead to child care and universal pre-k. That's why we will get this done. https://t.co/X7dtnZxrto","date":"Wed Oct 27 23:13:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My friend @RepAuchincloss is right: this is our moment to lower health care costs for families. That's how we #BuildBackBetter. Tune in ⬇️","date":"Wed Oct 27 18:53:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“National paid family and medical leave would let families focus on healing, no matter where they or their loved ones live.” That part.  \n\nThank you, @jessemermell for sharing your story and shedding light on the importance of #PaidLeave for all.  \nhttps://t.co/K1ISMz2cKW","date":"Wed Oct 27 16:19:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"3 years ago today, we witnessed the deadliest antisemitic attack in recent American history. Let today be a reminder that we all have a role to play when it comes to spreading love &amp; ending hate. \n\nMay the memory of those taken from us at the #TreeofLife synagogue be a blessing.","date":"Wed Oct 27 14:07:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LilitMakunts @ArmenianCaucus Thank you for a great meeting on our shared commitment to a strong, secure Armenia, Ambassador!","date":"Wed Oct 27 02:15:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is our moment — Let's get it done, @POTUS! #ChildCareisInfrastructure","date":"Tue Oct 26 23:27:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every worker should be treated with dignity and respect, and every workplace should be free from harassment and assault. \n\nStanding in solidarity.","date":"Tue Oct 26 22:43:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1 in 4 women will experience #domesticviolence in their lifetime.\n\nTy @RepLucyMcBath and @RepGwenMoore for your legislation to help fund emergency shelters, counseling &amp; legal assistance to support survivors. We can &amp; must end the violence. #DomesticViolenceAwarenessMonth  #FVPSA","date":"Tue Oct 26 20:02:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans hand out tax cuts to the wealthy and corporations but draw the line at kids.","date":"Tue Oct 26 15:35:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There is nothing spookier this season then having the fate of abortion rights lie in the hands of the Supreme Court. \n\nIt’s time to codify Roe v. Wade and protect reproductive freedom.","date":"Tue Oct 26 14:52:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We need to invest in people. #BuildBackBetter","date":"Mon Oct 25 18:17:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Scotch tape and a prayer — that was my experience trying to find privacy while pumping at work. We can do better. That's why the House just passed the #PumpAct and why we're putting women at the center of our #BuildBackBetter agenda. Gender justice is economic justice. #LetMePump https://t.co/HoMfUyavvU","date":"Fri Oct 22 15:43:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our message to the American people: we see you. We see your struggles and we're answering your calls for progress with lower costs and fairness in our tax code and in our economy. #BuildBackBetter https://t.co/OMbwsIci1p","date":"Fri Oct 22 14:24:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Great to be back in studio with @brikeilarcnn! Tune in to @NewDay now as we discuss how we #BuildBackBetter for American families https://t.co/9IyutQ5gOK","date":"Fri Oct 22 12:34:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's true — #BuildBackBetter is a big... deal.","date":"Fri Oct 22 01:32:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The filibuster has to go. #BidenTownHall","date":"Fri Oct 22 01:10:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"President Biden's care story — balancing work, kids and providing for a sick parent — it's my story, and it's the story of so many families in America. It's the reason why the #BuildBackBetter agenda will transform lives and our economic potential. #BidenTownHall #CareCantWait","date":"Fri Oct 22 00:26:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"How is it that we are the only major country that does not guarantee #paidleave? \n\nThe #BuildBackBetter plan is about giving families the relief they deserve and desperately need, full stop.","date":"Fri Oct 22 00:18:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Steven Bannon has refused to follow the rule of law and participate in the House’s investigation into the #January6th insurrection. \n\nObstruction is unacceptable and inaction is not an option.","date":"Thu Oct 21 20:26:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A question everyone should want answered: What is Steve Bannon trying to hide? #January6th","date":"Thu Oct 21 18:13:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Massachusetts families and providers know first-hand how broken the #childcare system is. \n\nThat's why I am fighting every day to bring the #BuildBackBetter agenda to life.\nhttps://t.co/BqWICwjm5N","date":"Thu Oct 21 16:21:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Yes.","date":"Thu Oct 21 14:37:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every single Democrat is at the negotiating table, working on behalf of American families. But do you know who's missing? https://t.co/UDbgs771pd","date":"Wed Oct 20 20:58:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Senate Republicans just voted against making Election Day a public holiday. Against same-day voter registration. Against banning partisan gerrymandering. \n\nWhat are they for? Voter suppression.","date":"Wed Oct 20 19:47:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Buying a home or affording child care. These are the real struggles facing families. But with the #BuildBackBetter agenda, we are channeling these challenges into solutions. All Democrats are at the table and we're going to get this done — #forthepeople. https://t.co/6F0X2BfNfS","date":"Wed Oct 20 13:32:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Coming up next on @Morning_Joe to discuss our progress on #BuildBackBetter and yesterday’s meeting with @POTUS - let’s get this done! https://t.co/I1RYqzRlaE","date":"Wed Oct 20 11:17:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Just returned from a productive meeting with @POTUS &amp; House Members. We are ready to reach an agreement that ensures a positive vote on both bills in both chambers as quickly as possible, and I am confident we are on that path. #BuildBackBetter https://t.co/m13QyCxHBj","date":"Tue Oct 19 21:56:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Why we must #BuildBackBetter ⬇️","date":"Tue Oct 19 19:31:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Headed back to Washington to meet with @POTUS and get a deal done. This is our moment for progress — to make a meaningful difference in people’s lives. We can and must #BuildBackBetter.","date":"Tue Oct 19 16:24:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LexingtonHSHist I am impressed — These future lawmakers will be ready for the halls of Congress in no time!","date":"Tue Oct 19 01:00:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s time to put child care first. \nClimate change first. \nFamilies first. \n\nIt’s time for the #BuildBackBetter agenda.","date":"Mon Oct 18 13:28:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"So excited to see a Melrose MVP in the @WNBA finals. Good luck, @SheyP11. We’re rooting for you!\nhttps://t.co/WZLlESHEGH","date":"Fri Oct 15 19:39:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"True. #BuildBackBetter https://t.co/jG8VZKb2Es","date":"Fri Oct 15 18:28:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good. https://t.co/svAzAfgVh3","date":"Fri Oct 15 17:48:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@PressSec @SecretaryPete Let's get it done, @PressSec. #PaidLeaveForAll is how we #BuildBackBetter.","date":"Fri Oct 15 15:13:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Going on paternity leave isn't being \"MIA.\" It's called being a parent. And @SecretaryPete  is a new parent no different than the millions of other Americans who also deserve the right to care for their loved ones during birth, sickness and old age.","date":"Fri Oct 15 14:37:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The lack of #childcare facilities costs our economy $84 to  $128  billion in economic activity a year— hurting families, businesses and our entire economy. \n\nFunding for child care infrastructure is vital to our #BuildBackBetter agenda. Read more ⬇️\nhttps://t.co/wRi7XB8kSW","date":"Fri Oct 15 13:35:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Our nation runs on care, so our nation must invest in care\" — @VP 📢📢 \n\n#CareCantWait #BuildBackBetter #CareEconomy","date":"Thu Oct 14 14:54:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If we afford billionaires in space, we can afford universal #childcare on earth.","date":"Wed Oct 13 15:13:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's make every day the #DayOfTheGirl.","date":"Tue Oct 12 23:16:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Right now, Republicans are trying to adjourn Congress and leave town instead of paying the bills they racked up  under Trump. \n\nDon't ever let them tell you they are the party of \"fiscal responsibility\".","date":"Tue Oct 12 21:47:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Heading back to Washington to raise the debt limit and thinking about how today would be a great day to #AbolishTheFilibuster.","date":"Tue Oct 12 19:50:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@mikiebarb asks an important question on #TheDaily this morning: \"Is Child Care a Public Responsibility?\" \n \nImportant, but easy to answer: Yes, Yes, and Yes!  \n\n🔊and hear why #ChildCareisInfrastructure. #BuildBackBetter\nhttps://t.co/PB8hOdbOgO","date":"Tue Oct 12 15:59:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #NationalComingOutDay to all the brave and wonderful #LBGTQ+ people across #MA5 and the US! Our communities are better places when everyone can live authentically 🌈","date":"Mon Oct 11 19:52:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Look who I found at mile 17 — Go, @SecDebHaaland! #BostonMarathon2021 https://t.co/aOX9w7h1Q4","date":"Mon Oct 11 16:46:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Ready to cheer on @SecDebHaaland as she runs the #BostonMarathon through the ancestral homelands of the Massachusett, the Mashpee Wampanoag, and the Pawtucket people. Good luck runners and happy #IndigenousPeoplesDay2021!\nhttps://t.co/yPsw25cV9V","date":"Mon Oct 11 14:14:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We can't wait another minute to sign #WHPA into law. #AbolishTheFilibuster #BansOffOurBodies","date":"Sat Oct 09 15:55:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This. #ChildCareisInfrastructure #BuildBackBetter","date":"Sat Oct 09 14:31:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Restoring protections to these national monuments is a great step in advancing environmental justice and centering Indigenous voices. These sacred lands must be conserved to honor our cultural heritage and planet for future generations. Thank you @SecDebHaaland and @POTUS!","date":"Fri Oct 08 19:28:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“When workers and families have a better shot, America has a better shot.\"\n\nThank you, @potus for recognizing that #ChildCareIsInfrastructure and the path to #BuildBackBetter","date":"Fri Oct 08 17:13:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Listening to @GBH and big TY to @jimbraude and @MargeryEagan for spotlighting the #BuildBackBetter agenda &amp; #childcare. As your callers point out, the current system is failing families &amp; our economy — this is our moment for historic progress. #ChildCareisInfrastructure!","date":"Fri Oct 08 15:42:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@uwoftc @4Paws4Hunger @RepMcGovern @KatherineClark @Mayor_Spicer @Gr8BosFoodBank See you on Monday — so energized by your march to #endhunger Mark &amp; Mocha. This is a fight we can and must win.","date":"Fri Oct 08 14:53:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What does the Sept. Jobs Report tell us?\n \nThat our economy isn't going to recover with a flick of a magic wand. We need to address the challenges we face with historic progress: affordable family care, broadband &amp; so much more. \n\nOur recovery is in the #BuildBackBetter agenda.","date":"Fri Oct 08 14:44:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepAngieCraig Congrats, @RepAngieCraig!!!","date":"Fri Oct 08 13:55:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When we prioritize families, we prioritize our economy — and right now, America is doing neither. #ChildCareisInfrastructure #BuildBackBetter\n\nhttps://t.co/XewCKylwaw https://t.co/Dc6WE5ZGfw","date":"Thu Oct 07 16:32:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Correct answer: all of the above! We can’t move forward without child care.\n\n#BuildBackBetter #ChildCareIsInfrastructure","date":"Thu Oct 07 14:13:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"🚨GOOD NEWS 🚨 A federal judge has stepped in to temporarily stop #SB8 where @SCOTUS failed to. Tonight, people in Texas can breathe a little easier, but our work isn't over. \n\nWe must stop the bans &amp; make reproductive freedom a reality for everyone everywhere. #BansOffOurBodies","date":"Thu Oct 07 02:51:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s the filibuster or gun reform. \nIt’s the filibuster or tackling the climate crisis. \nIt’s the filibuster or voting rights. \nIt’s the filibuster or reproductive freedom. \n\nHow much longer do we prioritize procedure over people? #EndTheFilibuster","date":"Wed Oct 06 19:18:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Fill in the blank: Child care…","date":"Wed Oct 06 14:10:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The party that claims “fiscal responsibility” won't vote to raise the debt limit to pay off their own spending. @POTUS is right — it's hypocritical, reckless and disgraceful.\nhttps://t.co/4YXLgPfj9e","date":"Tue Oct 05 15:24:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Where's @RepKatiePorter's white board? Need it really quick. https://t.co/uomEBvqk4S","date":"Mon Oct 04 21:31:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Because #abortionishealthcare. Thank you, @POTUS.","date":"Mon Oct 04 20:46:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"While we are all stuck on Twitter, here's a reminder that families are stuck without #childcare. #BuildBackBetter","date":"Mon Oct 04 19:40:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's October and the real spooky season is the start of the #SCOTUS term that will dictate the future of reproductive freedom. \n\nEnough. #OurbodiesOurChoice.","date":"Mon Oct 04 17:40:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Team #BuildBackBetter https://t.co/NjHmByHNQR","date":"Fri Oct 01 22:10:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Welcome to the People's House, @POTUS! We're ready to #BuildBackBetter.","date":"Fri Oct 01 20:03:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Correction: The American people's wish list — but appreciate the free advertising for the #BuildBackBetter agenda! https://t.co/WMszBsmbBE","date":"Fri Oct 01 19:11:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"700,000 flags, each one representing a life tragically lost to #COVID19. They were our neighbors, our loved ones, and fellow Americans. Let us honor these lives by getting vaccinated to keep our families and communities safe. #InAmericaRemember https://t.co/KHi0wwMdxn","date":"Fri Oct 01 14:58:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Seems like a good time to remind everyone that the #BuildBackBetterAct costs us $0.00. \n\nYou read that right — zero dollars and zero cents.","date":"Thu Sep 30 20:23:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every woman has their own experience with reproductive care and I am so proud of my colleagues @RepCori, @RepBarbaraLee and @RepJayapal for bravely sharing their abortion stories. Their courage is helping to destigmatize abortion and normalize it for what it is: health care.","date":"Thu Sep 30 17:55:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats just voted to pay our bills and avoid a devastating economic default\n\n...While 210 Republicans voted against paying for the debt they racked up under Trump. \n\nRemember this the next time the #GOP pretends to care about our economy. https://t.co/XrrLiE59J5","date":"Wed Sep 29 22:59:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats raised the debt ceiling 3x during the Trump administration in cooperation with Republicans because it’s what was best for our country.\n \nBipartisanship only works when one party isn’t actively trying to undermine our government.","date":"Wed Sep 29 16:37:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #GOP gave corporations and the wealthiest Americans a $2,000,000,000,000 tax break. \n\nNow, they aren't willing to pay for it. \n\nThat's what's happening.","date":"Wed Sep 29 13:11:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Even during a pandemic, drug companies continued to raise Rx prices. No one should have to choose between medication or buying food. Medicare should have the power to negotiate directly with drug companies for the best possible prices - that's how we #BuildBackBetter. #HR3","date":"Tue Sep 28 20:41:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@Nina_0421 @mylifeincrumbs Yes, @Nina_0421! Child care for every family means giving every kid an equal share of the 🥧. #CareCantWait","date":"Tue Sep 28 18:30:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"2 Facts...\n\n1⃣ Republicans ran up the government credit card and (once again) are choosing obstruction over country by refusing to join us in funding the government and raising the debt ceiling. \n\n2⃣ We must #AbolishTheFilibuster.","date":"Tue Sep 28 16:45:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetterAgenda is the American people's agenda. It's why we're in Washington. And why we will deliver #forthepeople.","date":"Tue Sep 28 15:16:49 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepLucyMcBath Sending you ❤️, @RepLucyMcBath. We honor Jordan's memory by fighting gun violence, registering to vote, and building a stronger, safe tomorrow for every family.","date":"Tue Sep 28 15:00:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Once again the #GOP proves that they will always put political games ahead of our country. Smh.","date":"Tue Sep 28 00:55:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"September 27 marks one year since the start of the Artsakh War — an unprovoked and violent assault by Azerbaijan &amp; Turkey on the Armenian people. My thoughts are with Armenians around the world as they continue their struggle for a just and peaceful resolution to this conflict.","date":"Mon Sep 27 20:51:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What does #DemocratsBuildBackBetter mean? \n\n✅affordable child care\n✅universal pre-k\n✅lower costs for daily goods like Rx\n✅tax breaks for families\n✅green jobs\n\nAnd we're paying for it by ensuring that billionaires pay their fair share.","date":"Mon Sep 27 19:18:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Headed back to Washington with one thing on my mind... https://t.co/0NdpXbYNTw","date":"Mon Sep 27 17:08:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There’s always a tweet. https://t.co/Xat3o4d7aS","date":"Mon Sep 27 13:28:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Women can't wait. #CareCantWait. We're building an economy that works for working families. #BuildBackBetterWithWomen https://t.co/lZe7ZDMbeK","date":"Sun Sep 26 12:36:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RoyChrobocinski Thanks for coming out to support the #BuildBackBetter agenda — we're going to make #childcare a reality for every family!","date":"Sat Sep 25 00:52:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@Ammallon Love the women of @CambMA!","date":"Sat Sep 25 00:51:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Equal access to abortion, Everywhere. 💁🏼‍♀️💁🏿‍♀️💁🏽‍♀️💁🏻‍♀️💁🏾‍♀️#WHPA https://t.co/ygqBI4gtB9","date":"Fri Sep 24 18:34:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1 out of 4 women have been pushed out of the workforce because the #CareEconomy has collapsed. \n\n$57B a year is lost in productivity because families struggle to find care.\n\nWe #BuildBackBetter by making care available to every family who needs it. #BuildBackBetterforWomen!","date":"Fri Sep 24 16:17:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When I was elected to Congress, I was balancing care for my 3 kids &amp; 2 sick parents. I felt like I was failing everyone every day. Too many Americans struggle simply to work &amp; provide for their families. Democrats are building an economy that works for working families. Tune in⬇️","date":"Fri Sep 24 15:39:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Just voted YES on the #WHPA — We are not going back. #AbortionisHealthCare https://t.co/1MgqMNfVZ7","date":"Fri Sep 24 15:32:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"They don’t support gun reform. \nThey don’t support tackling the climate crisis. \nThey don't support women's health care or family planning. \n\nDon’t ever let the #GOP tell you that they are the “pro-life” party. #WHPA","date":"Fri Sep 24 14:10:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The stakes couldn't be higher — attacks against Roe v. Wade keep coming. We can't wait another minute to protect reproductive freedom and abortion access. \n\nToday, @HouseDemocrats will pass #WHPA.","date":"Fri Sep 24 12:33:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Roads, bridges, child care, paid leave — it's all essential infrastructure that allows families to work and our businesses to thrive. This is our moment to build an economy that works for everyone. #BuildBackBetterAct Watch here ➡️\nhttps://t.co/ewtsOZaSZL","date":"Thu Sep 23 19:27:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"ICYMI: @OversightDems released a new Drug Pricing Report outlining how much taxpayers have lost in savings because Medicare can't directly negotiate prices:\n\n💊$25B on 7 drugs in 5 years \n💉$17B on 3 insulin drugs in 7 years\n\nFamilies deserve better. #BuildBackBetterAct","date":"Thu Sep 23 15:45:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Just last year 55 of the largest corporations paid ZERO dollars in federal income taxes on over $40 billion of profits. It’s time for the wealthy and well-connected to pay their fair share and for working families to get a fair shake. \n\nThat's the #BuildBackBetter agenda.","date":"Thu Sep 23 14:33:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I'm confident that we will reach the finish line and bring these transformational economic policies to life. We will meet this moment of historic challenges with historic progress.","date":"Thu Sep 23 00:26:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@POTUS' vision ensures that we are looking forward instead of returning to the status quo, acknowledging the urgent climate crisis and essential role of the care economy — #childcare is and has always been infrastructure.","date":"Thu Sep 23 00:26:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"By creating jobs and lowering taxes and costs for families, we will not only recover, but also build a stronger, more inclusive economy.","date":"Thu Sep 23 00:26:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Left the White House a little while ago. I’m grateful to President Biden for his absolute commitment to delivering results to everyday Americans. As Democrats, we are all dedicated to helping working families thrive.  That’s the heart and soul of the #BuildBackBetter agenda. 🧵","date":"Thu Sep 23 00:26:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I am thrilled that Framingham's own @mariarobinsonMA has been nominated to be the Assistant Secretary of  @ENERGY. Her wealth of expertise and lifelong dedication to clean power makes her the perfect person to bring our country &amp; economy into the 21st century. #mapoli","date":"Wed Sep 22 23:26:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's be clear: the Women's Health Protection Act is just the start to true reproductive freedom. And if you don't get that, you don't support abortion rights. #WHPA #ActForAbortionAccess","date":"Wed Sep 22 22:25:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"📢 #BuildBackBetter means investing in child care facilities. #ChildCareisInfrastructure","date":"Wed Sep 22 18:05:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@chelliepingree is right. RT if you agree that it's time to build an economy that works for everyday Americans.","date":"Wed Sep 22 16:55:49 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Want to understand the #childcare crisis? Read this piece by @clairecm\n\n▪️Providers aren’t paid enough\n▪️Parents can't afford care — and now can't find it\n▪️Leaving them unable to return to work\n\nDon't tell me #childcare isn't an economic issue.\nhttps://t.co/oUQ79EpSXF","date":"Wed Sep 22 13:20:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Just now @HouseDemocrats voted to fund the government, suspend the debt limit and protect our economy, support communities devastated by natural disasters, and help resettle Afghan refugees — And Zero Republicans joined us. They vote against our future every chance they get. https://t.co/TsyLnBLtn9","date":"Wed Sep 22 00:51:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My heart breaks for Gabby Petito and her family — and for every woman and girl who has gone missing but hasn't received a headline. As an epidemic of missing and murdered Indigenous women carries on, we must ensure that we dedicate the same resources to their fight for justice.","date":"Tue Sep 21 21:01:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans ran up the credit card debt. And now they’re trying to walk away from the bill. Think again. This is a shared responsibility and the #GOP must join us in protecting the full faith and credit of the US.","date":"Tue Sep 21 19:19:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In a year when everyday Americans experienced so much loss, billionaires got $1.8 trillion richer. It’s time for those at the top to pay their fair share and for working families to receive one of the biggest tax cuts in U.S. history. This is how we #BuildBackBetter.","date":"Tue Sep 21 17:25:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The horrific mistreatment of Haitians at our border is unconscionable — every person coming to the U.S. seeking refuge should be treated with dignity and respect. \n\nThe Haitian people are fleeing incredible hardship. Let’s meet them with compassion.","date":"Tue Sep 21 15:08:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care is an economic issue &amp; businesses agree. Today, over 50 CEOs of major companies called on Congress to address the lack of affordable, quality child care. The success of our economy depends on it. #ChildCareIsInfrastructure #BuildBackBetter https://t.co/htVfjQuKvu","date":"Tue Sep 21 15:01:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I call this pic “#CareCantWait”— thanks for standing shoulder to shoulder with @HouseDemocrats, @aijenpoo! #BuildBackBetter https://t.co/a3e1cik0YU","date":"Tue Sep 21 01:30:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We knew this was coming. And we know these bans will keep coming. That’s why this week, the House is taking action &amp; passing the Women’s Health Protection Act.\n\n#Abortionishealthcare — no matter your zip code or income. We must defend every woman’s constitutional right to care.","date":"Mon Sep 20 17:36:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Live freely, love freely, serve freely. Ten years since the repeal of #DontAskDontTell and our nation is a better, safer place with it gone.","date":"Mon Sep 20 16:57:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"No one should have to choose between their family &amp; a paycheck.\n\nThat's why our #BuildBackBetter agenda will provide #PaidLeave for every worker. #PaidLeaveforAll","date":"Mon Sep 20 15:00:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"May her legacy be our call to action. #RBG #mybodymychoice #WomensRightsAreHumanRights #AbortionIsHealthcare #EqualPay https://t.co/QehrxD1ym6","date":"Sat Sep 18 16:25:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's true — snacks and naps are infrastructure. #BuildBackBetter #ChildCareisInfrastructure","date":"Fri Sep 17 17:05:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#ChildCare isn’t a partisan issue, it's an economic issue. Americans across the nation understand that supporting kids &amp; families is one of the best investments we can make. \n\nAnd yet, exactly ZERO Republicans supported the #ChildTaxCredit. \nhttps://t.co/KksIC8PTaf","date":"Fri Sep 17 12:15:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"YES ➡️ \"There's a blinking code red out there. Extreme weather just last year cost the American public $99 billion in damage. Unfortunately we are likely to break that record this year. We can't wait to act.\" — @POTUS \n#ClimateCrisis #ClimateActionNow","date":"Thu Sep 16 18:29:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@POTUS is right: long before #COVID19, working families faced an economy rigged against them. \n\nJust think about this: yearly, the top 1% skip out on over $160 billion in taxes that they owe.\n\nIt's time for the wealthy &amp; corporations to pay their fair share. #BuildBackBetter","date":"Thu Sep 16 18:17:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Gemar tov &amp; an easy fast to all who are observing #YomKippur. Practicing forgiveness, setting intentions for a kinder &amp; more just year, and recommitting to tikkun olam - repairing the world - are fulfilling practices for us all. Wishing the Jewish community a meaningful new year!","date":"Wed Sep 15 22:44:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"3⃣ Women are on the frontlines of the care crisis. \n\n1 in 4 women have been pushed out of the economy during #COVID19 and continue to struggle. We won't recover without an inclusive care system — leaving women behind is Not an option.\nhttps://t.co/2ZZWce3eCe","date":"Wed Sep 15 21:06:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"4⃣ The #BuildBackBetterAct will jumpstart our recovery &amp; future.\n\nBusinesses lose over $12 billion annually due to employees being unable to find #childcare. Yet, for every dollar invested in early ed, we gain $7.30 in economic returns over the long-term.","date":"Wed Sep 15 21:06:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1⃣ Early education helps families thrive. \n\nIt provides kids with a healthy place to learn &amp; grow and allows parents to work. Through the #BuildBackBetterAct, no family will pay more than 7% of their income on #childcare &amp; every 3 and 4 yr old will have access to universal pre-k.","date":"Wed Sep 15 21:06:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"2⃣Child care is economic infrastructure. \n\nThe #CareEconomy makes all other work possible. And early ed alone increases the GDP $3 for every $1 invested. The #BuildBackBetterAct will save families $14k per year and help parents get back to work and businesses to thrive.","date":"Wed Sep 15 21:06:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We can’t afford the status quo when it comes to the #careeconomy. \n\n#Childcare is essential economic infrastructure and central to our recovery and our ability to #BuildBackBetter. It comes down to these key facts:","date":"Wed Sep 15 21:06:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@Simone_Biles is right: the system failed her and every other survivor. We have to recognize that sexual harassment and abuse is an epidemic in America and that it's going to take all of us working together to stop this cycle and finally check patriarchy at the door.","date":"Wed Sep 15 17:24:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Utterly selfless. TY @Simone_Biles, @McKaylaMaroney, @Aly_Raisman, and @MagsGotSwag12 for your bravery, your perseverance, and your determination. Together, we will create a culture that stands up to sexual assault and abuse and a system that ensures justice for all.","date":"Wed Sep 15 16:30:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, 60 million kids in America will receive the 3rd #ChildTaxCredit payment, helping families afford the basics from diapers to food. \n\nJust think of what's possible for families when we make this tax cut permanent. #BuildBackBetterAct \nhttps://t.co/jUjtYQWosc","date":"Wed Sep 15 13:59:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"37% of unemployed Americans said they would return to work sooner if their employer offered #paidleave — including 45% of unemployed caregivers.\n\nPolicies that put families first — that's how we are going to #buildbackbetter. \nhttps://t.co/UEyhIPjcBb","date":"Tue Sep 14 19:35:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@davidhogg111 @ewarren @EdMarkey A vital problem for us to fix, @davidhogg111. Last year, the House passed the No Surprises Act which would require HHS to review &amp; recommend options to protect paitents in this situation. But we need results — no one should be denied care bc of cost. Hope your friend is okay.","date":"Tue Sep 14 15:05:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"So we are all clear what's happening here: Purdue Pharma ignited the opioid crisis, got rich off selling #OxyContin, hundreds of thousands have die — and now five of their executives are getting $7.1 million in bonuses. \n\nThis is not justice. It's a disgrace.","date":"Tue Sep 14 14:19:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Fashion is politics.\n\n#MetGala2021 @RepMaloney @RepAOC https://t.co/8DPjGYtlrZ","date":"Tue Sep 14 01:33:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning. Today would be a great day to abolish the filibuster and protect reproductive freedom. #mybodymychoice","date":"Mon Sep 13 13:22:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In many states, #childcare costs more than a family's monthly rent or mortgage. \n\nLack of affordable care has forced millions — predominantly women — out of the workforce and costs the economy $57 billion per year. \n\nThat's the urgency of #BuildBackBetter.","date":"Sun Sep 12 18:12:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1/3 of adults with children struggle to pay for expenses like food, rent, health care &amp; transportation. \n\n1 in 7 children are hungry. \n\nNo more. We must build a stronger, healthier, more just America. #BuildBackBetter.","date":"Sun Sep 12 14:50:36 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There is much to be done to make our country, and our world, a place free from the threats of terrorism and the legacy of that awful day, and today we recommit ourselves to a more peaceful, tolerant, and just future. 3/3 #Remember911","date":"Sat Sep 11 13:29:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today marks 20 years since our nation was attacked and forever reshaped. To the brave service members and first responders who sacrificed their lives, their health, and their wellbeing on that day, and in the years since, we are profoundly grateful. 1/3 #911Anniversary","date":"Sat Sep 11 13:29:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"To the families of those fallen, we honor the memory of your loved ones and your loss. To the Muslim Americans who've suffered discrimination in the wake, we vow to do better. To the children who've grown up never knowing an America not at war, we continue our work for peace. 2/3","date":"Sat Sep 11 13:29:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LisaDeeleySmith You never know... 😉#FreeTheZebras","date":"Fri Sep 10 20:11:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Anti-Semitism has no place in #Framingham or anywhere. During the holiest of Jewish holidays, this attack is especially disturbing. The Jewish community is no stranger to hate, but they are also resilient, and we stand with you all against this attack.\nhttps://t.co/uWSUhWtP9i","date":"Fri Sep 10 19:58:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I ran for Congress to secure universal pre-k for every child in America. Right now, @HouseDemocrats are working in committee to make this a reality through the #BuildBackBetter agenda. \n\nWe're going to get this done.","date":"Fri Sep 10 14:04:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Like @POTUS said: #Getvaccinated. \n\nThis is how we save lives and keep schools and the economy open. We can do this together.","date":"Thu Sep 09 22:36:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Lack of access to quality, affordable #childcare has held our economy hostage for too long. \n\nChild care is essential — it's the vital work that enables all other work.\n\nIt's basic economics. And it's the foundation of how we #buildbackbetter.","date":"Thu Sep 09 21:53:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Clearly unconstitutional\". Enough said.","date":"Thu Sep 09 19:38:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Three-fourths of undocumented immigrants in the labor force are classified as essential. They could also contribute $149 BILLION in spending power each year if they became US citizens. Citizenship isn’t just a moral issue; it’s an economic one. #ImmigrantsSustainUS #WeAreHome","date":"Thu Sep 09 17:50:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"You pay your taxes.\n\nBillionaires and mega-corporations should too. \n\n#BuildBackBetter","date":"Thu Sep 09 15:55:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Co-sign.","date":"Thu Sep 09 15:01:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The filibuster.","date":"Wed Sep 08 19:11:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"\"For Native American mothers, the wage gap is even worse—they receive only 50 cents for every dollar that non-Hispanic white fathers are paid.\"\n\nTY @RepDavids &amp; @Rep_Stansbury — We can't rest until #equalpay is a reality for all. #NativeWomensEqualPayDay \nhttps://t.co/nINwT2ipsH","date":"Wed Sep 08 18:19:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Low and middle income Americans pay their taxes — while the ultra rich use accounting loopholes to cheat the system. \n \nEnough is enough. The wealthy and well connected must pay their fair share. That's how we make the #BuildBackBetter agenda happen. \nhttps://t.co/8MVNA6jbg1","date":"Wed Sep 08 16:09:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #BuildBackBetter Act includes my #ChildCareisInfrastructure Act, providing $15 B for #childcare facilities — a critical investment that'll ensure providers have the resources they need to stay open &amp; safe. \n\nTY Chairman @RepRichardNeal and @WaysMeansCmte!  #BuildUpChildCare","date":"Wed Sep 08 15:24:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Here's a pic from the way back machine for a little #BacktoSchool2021 inspiration — Good luck to all our teachers and families! Stay safe, have fun &amp; remember to smile📸 https://t.co/n121YsNumT","date":"Tue Sep 07 17:07:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“Do not be daunted by the enormity of the world's grief. You are not obligated to complete the work, but neither are you free to abandon it” -Rabbi Targon\n\nThis #RoshHashanah, these words carry a special meaning. #ShanaTova — wishing you a peaceful, joyful and healthy new year!","date":"Mon Sep 06 22:30:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Workers are the engine of our economy. This #LaborDay, let’s recommit to passing the Protecting the Right to Organize Act because strengthening workers’ right to organize will help rebuild America’s middle class &amp; improve the lives of families across the country.\n#PassThePROAct https://t.co/ayGhsk0vJO","date":"Mon Sep 06 14:42:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Without affordable, quality #childcare, parents — and especially women — get left behind in our economy. This is our moment to #buildbackbetter, and we start by investing in working families. https://t.co/IKBStYesaT","date":"Fri Sep 03 20:35:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The August jobs report sends a clear message: we're making progress but our work isn't done. \n\nTo recover and rebuild, we need to invest in working families. Democrats aren't stopping until every worker, every woman and every child has a fair shot at success. #BuildBackBetter","date":"Fri Sep 03 15:26:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care is work, and it enables all other work. \n\nOur path to a robust, inclusive recovery starts with a robust, inclusive #childcare system.","date":"Fri Sep 03 13:55:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Look. We've \"hit the pause button\" on women, working families and our planet for long enough. \n\nIt's time to fast forward relief for everyday Americans.","date":"Thu Sep 02 21:10:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS: The @HouseDemocrats will bring up @RepJudyChu's Women’s Health Protection Act to enshrine reproductive freedom into law for all. \n\nWe. Are. Not. Going. Back. #AbortionIsHealthcare","date":"Thu Sep 02 16:41:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Look around. The climate has changed. \n\nFrom east to west and north to south, our communities are paying the price. \n\nThe only question is how quickly we act. #BuildBackBetter #ClimateEmergency","date":"Thu Sep 02 12:08:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“The Sacklers, who admit no wrongdoing &amp; who by their own reckoning earned more than $10B from opioid sales, will remain one of the wealthiest families in the world...” \n\nWhen the wealthy &amp; the guilty use the law to avoid accountability, the system is broken. This isn’t justice.","date":"Wed Sep 01 21:22:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thinking of the Winston-Salem community. \n\nTragically, back to school in America means back to school shootings. We must pass #gunreformnow.","date":"Wed Sep 01 19:22:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"End the filibuster. \nPass the Women’s Health Protection Act. \nEliminate Hyde for good.","date":"Wed Sep 01 17:52:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I miss Ruth Bader Ginsburg. #TXDeservesBetter","date":"Wed Sep 01 13:58:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let’s be clear: Abortion is health care. The Texas abortion ban is an unconstitutional attack on our rights and will undeniably hurt Black, Latino and low income Texan women most. \n\nBut we won’t back down. #BansOffOurBodies #SB8 #TXDeservesBetter","date":"Wed Sep 01 13:56:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A #GOP Member promoted lies about our election (again), called the insurrectionists 'political prisoners' &amp; advocated for 'bloodshed'.\n\nNone of this is surprising. It's the same playbook that continues to threaten our democracy. \n\nIt's the #GOP playbook.\nhttps://t.co/l88WkreDJf","date":"Tue Aug 31 23:12:05 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In 2020, Massachusetts lost over 2,000 lives to opioid related overdose deaths — the first increase in three years.\n\nThinking of the many families and communities on the frontlines of this fight. Together, we will #EndOverdose. #IOAD21","date":"Tue Aug 31 21:06:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today is the first day my kids know an America not at war. Same is true for millions of Americans.","date":"Tue Aug 31 16:40:55 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"On International Overdose Awareness Day, join me in sending love to the family and friends left behind and support to those still struggling with substance use. \n \nIf you or a loved one needs support, ask for help. #IOAD2021\nhttps://t.co/8y2G2ta72s","date":"Tue Aug 31 16:03:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our hearts are with Louisiana. But we're also ready to get to work - helping with the recovery now, and building a more resilient infrastructure for the future.","date":"Mon Aug 30 16:59:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I'm heartbroken by the death of MA's own Sgt. Johanny Rosario. She lost her life while helping women and children trying to flee Afghanistan, and her service and heroism will never be forgotten.\nhttps://t.co/dCJQgvY3b1","date":"Mon Aug 30 13:48:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"America has long been defined by haves and have nots. But the #AmericanRescuePlan showed what's possible when we invest in working people. This is our time to build an economy centered on livable wages, green jobs &amp; supports for families. #BuildBackBetter \nhttps://t.co/bdq0i7pcWG","date":"Sun Aug 29 15:00:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today would be a great day to #EndTheFilibuster. #MarchOnWashington #MarchOnforVotingRights #HR4 #HR1 #RestoreTheVote","date":"Sat Aug 28 15:48:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Eviction is socially, emotionally &amp; financially traumatic for families - mass evictions are unacceptable during a pandemic. @HouseDemocrats will keep working to ensure that families can access the $45 billion Congress allocated for rental assistance &amp; have the safety of home.","date":"Fri Aug 27 17:05:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"PSA: Unemployed Americans are more likely to find work in states with higher unemployment benefits than in those that provide lower benefits. Good public policy puts people first. #AmericanRescuePlan","date":"Fri Aug 27 14:53:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Devastated by the news coming out of #Kabul. My heart is with the families in mourning and those servicemembers, allies, and civilians still on the ground. We must continue the evacuation mission and urgently bring everyone to safety.","date":"Thu Aug 26 20:07:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"101 years ago, women won the right to vote w the passage of the #19thAmendment. On #WomensEqualityDay, we celebrate the fight for suffrage but also recognize the women who were left behind. Let’s honor the women of our past by securing a future where we all have the right to vote","date":"Thu Aug 26 15:55:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Imagine a world where children never go hungry and are able to receive a quality education. Poverty is a policy failure and no one should live in poverty in the world’s richest country. #BuildBackBetter #AmericanFamiliesPlan","date":"Wed Aug 25 20:00:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s not radical if it’s practical. \nIt comes down to this: without affordable, quality care &amp; paid leave, parents — and especially moms — can’t succeed in the workforce. That holds back our economy &amp; perpetuates inequality. #CareIsInfrastructure\nhttps://t.co/Es7HgiYTx9","date":"Wed Aug 25 17:42:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every #GOP House Member voted against protecting your right to vote. \n\nEvery. Single. Member. https://t.co/m9TFL3Gc8i","date":"Wed Aug 25 02:00:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"For our democracy, for our future, for you, John. #JohnLewisVotingRightsAct #HR4 #RestoreTheVote https://t.co/3vKrnFarn9","date":"Tue Aug 24 23:15:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @HouseDemocrats began a new chapter for our country. We’re meeting this challenging moment with historic progress, recognizing the urgent need to invest in child care, paid leave &amp; climate resiliency. A brighter future for every working family is coming. #BuildBackBetter","date":"Tue Aug 24 21:26:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Voters should pick their politicians -- not the other way around. #HR4 #RestoreTheVote #VotingRightsAct","date":"Tue Aug 24 17:35:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"House Democrats committed to the #BuildBackBetter agenda. We know that this is our moment for transformational change. https://t.co/Q1lq0WNe5r","date":"Tue Aug 24 16:35:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care is infrastructure. \nElder care is infrastructure. \nClimate resiliency is infrastructure. \nPaid family leave is infrastructure. \nAffordable housing is infrastructure. \n\nOur #BuildBackBetter Plan will deliver life-changing benefits for working families. The time is now.","date":"Tue Aug 24 12:08:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is our moment — not just to recover, but rebuild. We need an inclusive, robust economy, built to empower the success of every family, every woman, every child.\nNot the infrastructure of the past but of tomorrow. We can and we will #buildbackbetter.","date":"Mon Aug 23 22:11:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Seriously - you’re not a horse, you're a human, and humans can and should get vaccinated against #COVID19. If you were waiting for full authorization, we’re off to the races with full FDA approval for the #Pfizer shot. Don’t say neigh - get the jab today!","date":"Mon Aug 23 16:08:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s a beautiful week to #RestoreTheVote #forthepeople.  #JohnLewisVotingRightsAct","date":"Mon Aug 23 12:49:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Get Americans back to work and supercharge our economy, you say?\n\nYup, that's our plan. We're putting the #CareEconomy and working families first — right where they belong.  #AmericanFamiliesPlan #BuildBackBetter","date":"Sat Aug 21 13:11:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thrilled to see @AFLCIO make history by electing lifetime-organizer @lizshuler as president!\n\nAlongside new Secretary-Treasurer @STRedmond &amp; EVP @Tefere_Gebre, they’ll be the most diverse leadership team ever at the AFL-CIO &amp; truly represent working Americans. 👊","date":"Fri Aug 20 17:44:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is our moment to get Americans back to work while building an economy that works for every working family. Let's do it, @POTUS! #CareEconomy #BuildBackBetter","date":"Fri Aug 20 14:11:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Low wages and high costs have created a #childcare system doesn't work for #childcare provider, parents or kids. And now the system is at a breaking point. \n\nThat's why we must enact the #AmericanFamiliesPlan and create an economy that works for everyone.\nhttps://t.co/Gce3HLs3E3","date":"Fri Aug 20 12:48:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1) Listen to @kerrywashington \n2) Get your $$$\n3) Share your #MyChildTaxCredit story\n4) Join the fight to make the #ChildTaxCredit PERMANENT by supporting the #AmericanFamiliesPlan","date":"Fri Aug 20 02:17:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The folks who designed the drug, manufactured the drug, and sold the drug say they have nothing to do with the drug epidemic. \n\nSurprised? No. \nDisgusted? Beyond.","date":"Thu Aug 19 20:21:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Capitol is more than just a building or a symbol - it's our office. From staff to food service workers to reporters, so many people come here to serve our democracy. We must stop the violence and threats that have invaded this place and our politics.","date":"Thu Aug 19 17:48:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"On the anniversary of the ratification of the #19thAmendment, let us celebrate the women who fought for suffrage while acknowledging that it was only white women who were granted the fundamental freedom to vote. None of us are free until all of us.","date":"Wed Aug 18 14:26:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you won’t #GetVaccinated for yourself, please do it for our kids.","date":"Wed Aug 18 00:11:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congratulations, @petebuttigieg and @chasten — so proud to be working together to make sure you and every family has access to quality, affordable #childcare! #AmericanFamiliesPlan #ChildCareisInfrastructure","date":"Tue Aug 17 18:28:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Voter suppression, the Big Lie  — we can't sit on the sidelines while the #GOP attacks our very democracy. \n\nIt's time for some #goodtrouble. \n\nProud to stand with @RepTerriSewell in support of #HR4, the John Lewis #VotingRightsAct. We must and we will #RestoreTheVote.","date":"Tue Aug 17 17:03:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Republican campaign to distort and hide our history and promote bigotry has arrived in Massachusetts. Let’s be clear: America is strongest when we teach the truth and confront racism head on — in the classroom, in the courtroom, everywhere.\nhttps://t.co/J8h3gA21eT","date":"Tue Aug 17 14:22:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We must urgently help those in harm’s way in Afghanistan — evacuate Americans &amp; the Afghans who supported us. Let’s get them to safety now &amp; process the paperwork later. Moving forward, human rights, including the rights of women &amp; girls, must be the cornerstone of our diplomacy.","date":"Mon Aug 16 20:41:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My heart is with the people of #Haiti in the wake of the devastating earthquake this weekend. We must do everything we can to help rescue, recover and rebuild.","date":"Mon Aug 16 18:43:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The best way to protect yourself and our communities from the deadly #DeltaVariant is to get vaccinated. The vaccines work. The vaccines are safe. And the vaccines are FREE. \n\nIf you or anyone you know has yet to get vaccinated, sign up today at https://t.co/jjAWfUlq5t #COVID19💉","date":"Mon Aug 16 13:44:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Fighting #ForThePeople ⬇️","date":"Sun Aug 15 17:06:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #AmericanRescuePlan is working — stopping hunger and helping parents recover and rebuild. That's what's possible when we put the needs of families front and center in Washington! \n\nNow let's make this lifeline permanent. #ChildTaxCredit","date":"Sat Aug 14 14:03:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thank you, @potus. Everyone has experienced the importance of child care and that’s exactly why everyone should have equal access to it. No question, #childcare is essential infrastructure. #AmericanFamiliesPlan","date":"Fri Aug 13 19:55:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"🚨The 2nd child tax credit payments begin hitting bank accounts today🚨\n \nDemocrats are delivering #ForThePeople  — and now it’s time to make this tax cut for families permanent.","date":"Fri Aug 13 14:07:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#Medicare works to get the best prices — except when it comes to Rx medicine. In fact, Medicare is prohibited BY LAW from negotiating for the best deal — which results in crippling drug prices for seniors &amp; families. This has to change. \n\n#Retweet if you agree with Democrats.","date":"Thu Aug 12 15:47:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans are fighting to prevent masks in schools — when they could join the fight to prevent #gunviolence. Their policies are dangerous. Period.","date":"Thu Aug 12 11:54:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Important news for moms-to-be: getting vaccinated is the best way to protect yourself and your growing family. #GetVaccinatedNow","date":"Wed Aug 11 19:09:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"2.5 million people have signed up for #healthcare during the 2021 Special Enrollment Period created by @POTUS — have you? \n\nYou can still sign up to receive free or low cost quality, health insurance until August 15. Visit: https://t.co/g40sORLQeY\nhttps://t.co/5Zcrmsc2vU","date":"Wed Aug 11 16:11:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans delivered us 4 years of infrastructure weeks that got us nothing but a hashtag. \n\nDemocrats are delivering - and passing - historic infrastructure bills that will actually get Americans back to work. \n\nThat's the difference. #infrastructureweek","date":"Tue Aug 10 20:20:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Clean water, broadband, trains, roads and bridges — this bill is an important first step in our work to make sure our economy leaves no one behind. \n\nNext up: child care, paid leave, and climate action. #BuildBackBetter","date":"Tue Aug 10 18:19:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thank you to the brave women who came forward and put their careers and safety on the line to shine a light on these abuses of power. \n\nTogether, we will build a culture of accountability and respect.","date":"Tue Aug 10 16:28:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@HousingACTION Equitable access to housing is part of a just economy. Thankful for your partnership in this fight!","date":"Tue Aug 10 15:40:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@AbortionFunds @Simone_Biles This is a 🐐level response. @simone_biles continues to be a champion for women on and off the mat. #MyBodyMyChoice","date":"Tue Aug 10 15:38:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's stop with this division of \"hard\" and \"soft\" #infrastructure. You know what's hard? Trying to get to work without child care. Roads and bridges get people to work, #childcare and #paidfamilyleave get people working. It's all essential and it's all infrastructure.","date":"Tue Aug 10 15:03:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"ICYMI: Here's a recap video of my Community Projects tour from #MA5! The House has passed federal funding to support local bike paths, public transit, and so much more. #CommunityProjectFunding #Malden #Revere #Medford https://t.co/HSkcrlLMVs","date":"Tue Aug 10 13:45:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"7 years ago today, Michael Brown was killed by police in Ferguson, Missouri. \n\nHe should be alive. He must be honored with action.\n#JusticeinPolicingAct","date":"Mon Aug 09 22:35:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Here’s what we know: \n\n1⃣Humans have heated the planet by roughly 1.1 degrees\n2⃣The hotter the planet gets, the greater the risks of irreversible carbon emissions \n3⃣Things are likely to get worse\n4⃣We can’t wait to #ActonClimate. \nhttps://t.co/lOYXeZVPI2","date":"Mon Aug 09 16:33:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Getting Americans back to work. \n\nIncreasing wages. \n\nAnd just getting started. #BuildBackBetter","date":"Sat Aug 07 18:02:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congratulations @allysonfelix on making history! Allyson is a champion on the track and in the fight for #genderjustice. \n\nYou show the world what moms are made of. #OlympicHERstory https://t.co/MnsHobqsLh","date":"Fri Aug 06 15:19:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every American should have the same access to the ballot box — no matter race, gender or zip code.\n\nThat's the heart of the #VotingRightsAct and our fight for the #JohnLewisVotingRightsAct. \n\nAre you with me?","date":"Fri Aug 06 13:38:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Don't tell me we don't need #universalchildcare. \n\nSincerely, \nThe women of America","date":"Thu Aug 05 19:00:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@AFLCIO Richard's legacy lives on in the labor movement and all of us working to build an economy that gives every worker a fair shot. Please know my thoughts are with the entire @AFLCIO family. 💔","date":"Thu Aug 05 17:56:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Richard Trumka dedicated his life to the labor movement and building an economy centered on fairness and equity.\n \nHis legacy lives on in the labor movement and all of us working to build any economy that gives every worker a fair shot. Full statement:  \nhttps://t.co/7IZWcSTbUy","date":"Thu Aug 05 17:35:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We rely on the #CareEconomy every day and yet, the cost of care and the low wages of care workers prevent families from getting ahead. We can do better. That's the #AmericanFamiliesPlan. https://t.co/rEICXtFbEw","date":"Thu Aug 05 16:08:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@POTUS is calling it like it is: #GOP officials are doing everything they can to distract and deceive Americans when it comes to #COVID19. \n\nGet with the science-based solutions — or get out of the way. Because your lies are a death sentence. \nhttps://t.co/Rl5IbLA5Tk","date":"Wed Aug 04 13:48:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The new #EvictionMoratorium is a victory for families and for justice.\n\nThank you @CoriBush and activists across the country for speaking up and camping out. \n\nLives will be saved because of the movement you built.","date":"Tue Aug 03 20:37:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congress has passed over $46 billion in federal housing assistance. We should focus on distributing these dollars— not evicting Americans in need of help. #ExtendTheMoratorium #EvictionEmergency","date":"Tue Aug 03 20:06:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our culture of harassment and assault can only be stopped through accountability. It’s time for Governor Cuomo to resign.","date":"Tue Aug 03 18:47:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"You have a right to feel safe and respected — at work, at home, everywhere. \n\nToday and everyday, you deserve to be heard and believed. #BeHEARDAct","date":"Tue Aug 03 18:47:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Black women make only 63 cents to every dollar earned by white men. \n\nThis impacts every aspect of life: the housing crisis, food insecurity, #careeconomy &amp; more.\n\nJust imagine what would be possible with an economy centered on equity. Now let's build it. #BlackWomensEqualPayDay","date":"Tue Aug 03 16:19:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Two years ago today, 23 lives were taken in an act of domestic terrorism in El Paso, Texas.\n\nHonoring those lost means action: disarming hate and saving lives through commonsense gun reforms. \n\nWe can and we must #EndGunViolence. #ElPasoStrong","date":"Tue Aug 03 14:19:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Another awful tragedy in the aftermath of #January6th. My thoughts are with Officer Hashida’s family, friends and colleagues.\n\nAnyone who continues to spread lies about that horrific day and what led up to it has blood on their hands. \nhttps://t.co/JweKRPwisU","date":"Mon Aug 02 19:47:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We've hit a milestone: 70% of Americans are vaccinated. Now, we can't stop here! The #CovidVaccine is the best way to protect yourself, your loved ones, your community — and to bring this pandemic to an end.  https://t.co/oPJKTFAvFx","date":"Mon Aug 02 18:19:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There's no bottom when it comes to #KevinMcCarthy and the #GOP.\n\nThey're so far from disgraceful — They're dangerous.","date":"Mon Aug 02 17:08:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The White House and CDC must immediately extend the #EvictionMoratorium — this is the surest way to protect families and give states more time to distribute the rental assistance we’ve already passed. Our message is clear: we can't wait another day.\nhttps://t.co/6XdpxVnKOB","date":"Mon Aug 02 14:29:04 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As we continue to battle the #COVID pandemic and work toward economic recovery, no one should be kicked out of their home because they can’t make rent. \n\n@HouseDemocrats and @POTUS agree - we must extend the #EvictionMoratorium.","date":"Fri Jul 30 18:36:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Azerbaijan’s military forces must withdraw from Armenian lands immediately and stop the violence that has already cost multiple lives. Proud to have voted for Chairman @FrankPallone’s amendment to cut off military funding to Azerbaijan and to stand with the Armenian people.","date":"Fri Jul 30 17:15:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@TSannicandro @AppropsDems I did the same, Tom! It’s a horrific practice- and long past time it comes to an end.","date":"Fri Jul 30 16:59:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LittleLobbyists Always will — and always proud to call @LittleLobbyists a partner!","date":"Fri Jul 30 16:58:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@HouseDems are investing in the American people: creating good-paying jobs, growing opportunity, and providing a lifeline to working families, small businesses, and the vulnerable. #ForThePeople","date":"Fri Jul 30 15:37:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I’ve been working for over a decade to stop the use of electric shock devices in schools. And finally this week, I secured language in the @AppropsDems bill to do just that. No student should be subjected to this dangerous and horrific practice. \nhttps://t.co/0NQ0LPW2fF","date":"Fri Jul 30 13:35:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepAngieCraig @summitbeer @RepValDemings @RepLBR @BettyMcCollum04 @RepLawrence While my \"vote\" goes to #MA5's @JacksAbby beer, I'm with you, @AngieCraigMN!🍦","date":"Fri Jul 30 00:32:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Once again, the @HouseGOP is trying to adjourn Congress so they can obstruct funding for Capitol Police. \n\nRemember this. #Jan6Insurrection","date":"Thu Jul 29 19:28:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS: @HouseDemocrats just passed funding for\n\n✅child care\n✅maternal health\n✅repro health \n✅domestic violence prevention &amp; support\n✅climate justice\n✅substance use disorder\n\nand we ❌#Hyde. \n\nThat's what we call a budget #forthepeople.","date":"Thu Jul 29 19:18:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Everyone deserves to attend a college where their entire identity is accepted &amp; celebrated. Proud to introduce The Exposing Discrimination in Higher Ed Act to give every #LGBTQ student the opportunity to excel in the classroom. \nhttps://t.co/xcrsnHpnMk","date":"Thu Jul 29 18:07:52 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Remember this? \n\nWell, I just introduced The Exposing Discrimination in Higher Ed Act to require transparency from schools. TY @RepChrisPappas, @RepDavids &amp; @repmondaire for partnering with me to ensure #LGBTQ students are celebrated for being themselves. \nhttps://t.co/dnpcFVudSa","date":"Thu Jul 29 17:25:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This week, we're passing an @AppropsDems package that celebrates the dignity and humanity of women in America and around the world. We are declaring that #AbortionIsHealthCare. #BeBoldEndHyde https://t.co/Ebpr7gU37s","date":"Thu Jul 29 15:20:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @HouseDemocrats repealed the #HelmsAmendment &amp; #GlobalGagRule, lifting restrictions on abortions around the world.\nThis is HUGE news for global #reproductiverights &amp; couldn't have been done w/out millions of activists.\n\nBecause #reprorights are human rights.","date":"Thu Jul 29 00:28:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congress is at its best when it reflects America. That's why I'm excited to vote Yes tonight on an @AppropsDems bill that will increase funding for paid internships and allow #Dreamers to work in public service. \n\nBecause this is The People's House.","date":"Wed Jul 28 21:20:18 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"No college or university should be able to use taxpayer dollars to discriminate against #LGBTQ students. Stay tuned for my new legislation to address discrimination against students.","date":"Thu Jun 10 14:01:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As it should.","date":"Wed Jul 28 18:07:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's recommit to building a future where survivors are met with support and respect in their journey to recovery. #BeHEARD #SimoneBiles","date":"Wed Jul 28 15:56:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Hey, @HouseGOP: you're supposed to root for Olympians, and against insurrectionists, not the other way around...","date":"Wed Jul 28 15:27:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#GetVaccinated. That's all.","date":"Wed Jul 28 00:21:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Taking care of yourself is winning. \n\nThank you, @Simone_Biles, for once again leading by example. 🤍","date":"Tue Jul 27 20:34:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#January6thInsurrection was domestic terrorism. Period.","date":"Tue Jul 27 16:36:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“Officer Hodges, what were you fighting for that day?” \n\n\"Democracy.\" #January6th #January6thInsurrection","date":"Tue Jul 27 16:26:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Make no mistake: the insurrection was fueled by white supremacy. #January6thCommittee \nhttps://t.co/AvCBLAPHbY","date":"Tue Jul 27 15:12:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"“Democracy is bigger than any one person, or any one party” — Officer Harry Dunn","date":"Tue Jul 27 15:03:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"How can you listen to this horrific testimony and still deny what happened on #January6th?","date":"Tue Jul 27 14:45:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Reminder that Kevin McCarthy refused to meet with Officer Michael Fanone for months. And now, he's refusing to listening to his testimony at the #Jan6Commmittee.","date":"Tue Jul 27 14:33:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This was not a normal day. This was an attack on America. \n\nToday, we memorialize the truth through the voices of those who fought to protect our democracy. #January6thCommittee https://t.co/QcRAtIm1B5","date":"Tue Jul 27 13:46:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The man behind the woman — @SecondGentleman https://t.co/T5lSBXFuKe","date":"Tue Jul 27 01:43:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"West Coast fires that are thousands of miles away are destroying the air quality in Massachusetts. We're feeling the effects of climate change right here, right now. #ActOnClimate\nhttps://t.co/1Nisp1KSXk","date":"Mon Jul 26 22:14:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"There is no equity without disability rights. On the 31st Anniversary of the #AmericansWithDisabilitiesAct, it is more important than ever that we invest in the #CareEconomy today to build an inclusive tomorrow. #ADA31","date":"Mon Jul 26 20:27:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Heading back to Washington to vote on @AppropsDems historic funding bills — We’re increasing 💵 for child care and removing barriers to #reprohealth including the Hyde amendment. \n\nThis is what we call working #ForThePeople.","date":"Mon Jul 26 19:11:01 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Finding quality, affordable #childcare","date":"Mon Jul 26 16:55:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congratulations to #MA's own @DARollins on her appointment to US Attorney! \n\nShe's worked to decriminalize mental health issues &amp; substance use disorders, fought food &amp; housing insecurity &amp; kept us safe. @DARollins is a trailblazer who will keep shattering glass ceilings. #MApoli","date":"Mon Jul 26 15:13:49 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"\"Addressing the #childcare crisis will determine if parents and specifically mothers are able to return to work... The future of child care is the future of our country.\"\n\nTY, @AliciaMenendez — this is everything.\nhttps://t.co/rkeqU3tG8O","date":"Mon Jul 26 13:41:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is @SenMarkey and me 12 years ago when the minimum wage was increased to $7.25 — And a picture of us from just last month. \n\nWhile Ed looks the same (#ForeverYoung), a lot has changed. So why hasn't the minimum wage? #RaisetheWage #12yearchallenge https://t.co/ayBTx3Vu7T","date":"Sat Jul 24 14:26:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In #200Days, we've made historic investments in American families to stabilize our #childcare system and cut poverty in half. \n\nJust think about what we can accomplish in the next 200 days, and beyond, to put women, families, and equity first.","date":"Fri Jul 23 20:06:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The American people see what the #ChildTaxCredit is all about: ensuring every family has a fair shot at success. #200Days\nhttps://t.co/FDvuaeAlgr","date":"Fri Jul 23 17:15:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Your body includes your ears, eyes, and teeth - so why shouldn't Medicare cover dental, vision, and hearing? @Democrats are ready to make that a reality.","date":"Fri Jul 23 14:35:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We're not going back.","date":"Thu Jul 22 22:25:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans are saying the quiet part out loud - they’re only here to obstruct ⬇️ https://t.co/OJAYTwkYsL","date":"Thu Jul 22 13:34:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@CoriBush, you light up every room you enter. So grateful to have your voice and passion helping to guide us in Congress. Happy birthday! 🎉 https://t.co/e6TKrfGsb9","date":"Wed Jul 21 22:19:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My thoughts on adding conspiracy theorists to the #January6SelectCommittee ⬇️ https://t.co/03A4Ix3rGh","date":"Wed Jul 21 21:36:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Coming up next on @MSNBC: joining @AymanM to discuss all things infrastructure &amp; the #January6thCommittee — tune in! https://t.co/65ZeLfv6fB","date":"Wed Jul 21 19:32:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Remember when Democrats tried to establish an independent, bipartisan 9/11 Commission to investigate #January6th and Republicans voted it down? \n\nYah, me too.","date":"Wed Jul 21 18:38:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@SpeakerPelosi has made the right call at the right time. If we are going to get to the bottom of the #January6thInsurrection— an attack on America, we need a Committee of truth tellers, not conspiracy theorists.","date":"Wed Jul 21 18:13:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Join me in wishing ⁦@WhipClyburn⁩’s a happy birthday! Grateful for your leadership and friendship! 🎉 https://t.co/k6MMWiVli6","date":"Wed Jul 21 17:36:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The catastrophic weather events we knew #climatechange would bring are not a generation away—  they're here. And if we fail to #ActOnClimate, it's all of us, not just our children, who will live the consequences. https://t.co/SmV2VtdUa6","date":"Wed Jul 21 14:34:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s always a good day when you’re part of the @usprogressives caucus ✨ https://t.co/v1TEft2spx","date":"Tue Jul 20 22:03:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care was, is, and will always be infrastructure. \nhttps://t.co/BW0rGWJsZg","date":"Tue Jul 20 20:23:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"They don’t want your thanks, they want a livable wage. \n\nPS. Pay your taxes","date":"Tue Jul 20 17:31:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"🔥🔥🔥","date":"Tue Jul 20 15:57:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Up bright and early because #CareCantWait 🌞 https://t.co/tRyJUChdsE","date":"Tue Jul 20 13:48:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"You don’t have to be a rocket scientist to know it’s time for billionaires to pay their fair share.","date":"Tue Jul 20 13:20:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Faris is just 8 years old. Our children shouldn’t have to live like this. #EnoughIsEnough #GunReformNow","date":"Mon Jul 19 17:45:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Not a single Republican senator is attending the Senate Rules Committee field hearing on voter suppression in Georgia. That says it all. #JohnLewisVotingRightsAct #HR1","date":"Mon Jul 19 17:37:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Daily reminder that the #AmericanFamiliesPlan will generate lifetime benefits for:\n🧸3 million kids\n🍼hundreds of thousands of care providers\n👩‍👦‍👦1 million parents, mostly moms, who will be able to enter or reenter the labor force\n\nWe can’t afford NOT to invest in the #CareEconomy","date":"Mon Jul 19 13:54:58 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Your Sunday reminder that the #ChildTaxCredit is the kind of investment that Washington should make to help our kids and our economy succeed. \n\nAnd not a single Republican voted for it.","date":"Sun Jul 18 16:56:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepLoriTrahan Thank you, Lori! Grateful for your friendship and leadership.","date":"Sun Jul 18 00:49:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"All I want for my birthday is #UniversalChildCare","date":"Sat Jul 17 19:38:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LeaderHoyer Thank you, @LeaderHoyer!","date":"Sat Jul 17 15:36:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"On the one year anniversary of my friend John’s death, I am missing him dearly. I also know that he would tell me, tell us all, that the best way to honor his memory is standing up for voting rights #JohnLewisVotingRightsAct","date":"Sat Jul 17 15:09:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is a cruel decision with disastrous consequences. To current #DACA recipients, you are safe here. To our young immigrants, we will not stop our work until very Dreamer is treated as they are: American.  https://t.co/pAXJjcE0Lb","date":"Fri Jul 16 21:51:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Public education is the bedrock of our democracy &amp; the path to success for our kids starts with the #AmericanRescuePlan. This plan ensures that our children can safely return to in-person learning while addressing disparities in the classroom. #HelpIsHere https://t.co/KwEhRPxANS","date":"Fri Jul 16 18:29:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy Friday, #MA5! How will YOUR family benefit from the #ChildTaxCredit? Reply with your favorite family photos!","date":"Fri Jul 16 16:39:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@kasie @WayTooEarly .@WayTooEarly but always worth tuning in! Excited to see the where you head next, @Kasie","date":"Fri Jul 16 15:42:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Decades after #JohnLewis crossed the bridge in #Selma &amp; almost a year after his death, we are still fighting for the right of every person to cast their ballot. Thank you @RepBeatty for your #GoodTrouble. #HR1 #ForThePeople","date":"Thu Jul 15 23:52:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, for the first time in decades, @AppropsDems passed a budget without the #HydeAmendment.✨","date":"Thu Jul 15 19:23:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ChildTaxCredit gives working families the relief they need to get back to work, boosting our economy and helping build better futures — help starts today! https://t.co/oyRXuwVI9E","date":"Thu Jul 15 17:56:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I just spoke out in @AppropsDems against the #GOP amendment to include #Hyde in this year's budget. \n\nLet's get this straight: #Abortion is basic health care. #Hyde targets Black &amp; Latino women. Access shouldn't be based on your insurance or the color of your skin. #BeBoldEndHyde","date":"Thu Jul 15 17:08:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"1 in 7 kids in this country live in poverty.  \n \nWe can't accept the status quo. We must pass bold, progressive policies that change lives. \n\nAnd we start today with the #ChildTaxCredit.","date":"Thu Jul 15 13:14:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Tonight, I joined @Boston25's @KerryKavanaugh to discuss how the #ChildTaxCredit will help families across the country! Tune in to learn more — and here's the link for non tax filers: https://t.co/LkBV7YoXXd https://t.co/8otZJaA5AM","date":"Thu Jul 15 02:00:55 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Every person should be celebrated and free to live safely, regardless of their gender expression. Today, Riley and I are celebrating #InternationalNonBinaryPeoplesDay with a reminder that inclusivity and acceptance make our entire community stronger. We see you. https://t.co/tyrygsAPaf","date":"Wed Jul 14 20:49:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Of the millions of children living in poverty in the US, a disproportionate # are Black, Latino &amp; Indigenous. \n\nPoverty reinforces racial inequality — but the #ChildTaxCredit will cut child poverty in half, boosting our economy &amp; breaking this cycle. \n\nProgress starts tomorrow.","date":"Wed Jul 14 18:13:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Safe drinking water is a basic right — and we're making it a reality for everyone in #Malden and America! #AmericanJobPlan","date":"Wed Jul 14 18:05:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy #OliviaRodrigo Day to all who celebrate - to shots in arms and tunes in headphones! #GetVaccinated https://t.co/JbmOdQ7EwV","date":"Wed Jul 14 17:13:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Even as we begin to make our way out of the #COVID19 pandemic, another crisis still rages on. https://t.co/N2t9qzdqqz","date":"Wed Jul 14 16:30:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Voters are supposed to pick their politicians —  not the other way around. #RestoretheVote #VotingRights #HR1 #ForThePeople #EndTheFilibusterNow","date":"Wed Jul 14 12:05:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When the @RedSox take the field at tonight's @MLB #AllStarGame, remember that they're playing in Denver because @GARepublicans continue to suppress the vote and promote the #BigLie.","date":"Tue Jul 13 21:51:46 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We can end child poverty. And we're starting with the #ChildTaxCredit.","date":"Tue Jul 13 19:14:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Quick reminder: \n\nThe #JohnLewisVotingRightsAct would restore &amp; strengthen the Voting Rights Act.\n \n#HR1, the #ForThePeopleAct, would expand voting rights, reduce dark money in politics, limit partisan gerrymandering &amp; create new ethics rules for electeds.\n\nWe need both.","date":"Tue Jul 13 16:32:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Vaccination rates are up, which means global travel is coming back. Get ready now:\n1. Check the expiration date on your #passport\n2. Don't wait! The renewal process can take 12-18 weeks \n3. Track your passport application status online\n\nMore here: https://t.co/O31QX9DE5w","date":"Tue Jul 13 13:42:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Your daily reminder that Republicans pass voter suppression laws because they'd rather cheat than compete. #ForThePeople #HR1 #S1","date":"Mon Jul 12 22:21:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When the #GOP says they support our heroes in uniform, remember that they're blocking funding for our Capitol Police. https://t.co/qnnGGhQSb2","date":"Mon Jul 12 20:31:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The expanded #ChildTaxCredit in the #AmericanRescuePlan will lift millions of kids out of poverty &amp; support families recovering from #COVID19. And it all starts on July 15. \n\n🎧Learn more about this month's check &amp; making the program permanent here --&gt; https://t.co/tLkRExVxry","date":"Mon Jul 12 18:49:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Did someone say #infrastructureweek?  #AmericanFamiliesPlan #CareEconomy #carecantwait #CareIsInfrastructure https://t.co/sNeUqG0oQg","date":"Mon Jul 12 15:25:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy 125th, #RevereBeach! 🥳","date":"Mon Jul 12 14:32:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Democrats are giving American families a tax cut. \n\nAnd when Republicans had their chance, they gave a tax cut to corporations and the very wealthiest.\n\nThe difference couldn't be clearer. #ChildTaxCredit #AmericanRescuePlan https://t.co/fc6fp5gS88","date":"Sun Jul 11 22:49:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Affordable housing is infrastructure. \nWater is infrastructure. \nBroadband is infrastructure.\nClimate is infrastructure. \nCare is infrastructure. \n\nAnd we’re leaving none of it behind.","date":"Sun Jul 11 13:12:51 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@ScottNoddin8 @SenWarren @ewarren So proud to represent you and #MA5!!","date":"Fri Jul 09 19:41:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Team #UniversalChildCare. You with us? ⬇️ https://t.co/gJL1z0pkMU","date":"Fri Jul 09 19:02:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is so important! If you don’t file taxes, you must register with the IRS to get the #ChildTaxCredit. Notify IRS here: https://t.co/LkBV7YoXXd\n\nPlease spread the word to family and friends so help gets where it's needed most!\nhttps://t.co/95aAvOkHIF","date":"Thu Jul 08 22:08:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The pain, suffering, and loss of life caused by the greed of Purdue Pharma and the Sackler family will never be repaired. But today’s settlement ensures transparency and an end to Purdue as we know it. Grateful to @MassAGO for leading the charge for justice on behalf of families.","date":"Thu Jul 08 19:32:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Not creating jobs. \nNot lowering the cost of health care.\nNot ending the pandemic. \nNot reopening our economy.\n\nObstruction. That's the #GOP's #1 priority...\nhttps://t.co/09vJrbPNAx","date":"Thu Jul 08 17:30:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We can’t build an economy for tomorrow with policies from the past. #CareEconomy #AmericanFamiliesPlan #AmericanJobsPlan","date":"Thu Jul 08 13:36:28 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@LPerille @RepLoriTrahan @RepPressley @CeciliaERouse @NurturyBoston TY @LPerille and the incredible @NurturyBoston team for all that you do for kids and families! #CareEconomy #ChildCareisInfrastructure #CareCantWait","date":"Thu Jul 08 13:24:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"WAY more fun — as we say, the future is female ✨","date":"Thu Jul 08 02:50:06 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@MelisaBarlow15 @SenWarren Rain won't stop our fight for #votingrights! #HR1 #S1","date":"Thu Jul 08 01:55:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When @POTUS says the #CareEconomy is the path to economic recovery 👉🏻👉🏼👉🏾 \n\n#CareIsEssential #CareCantWait https://t.co/L9w3QTxfEC","date":"Wed Jul 07 23:13:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thank you @NurturyBoston for showing @CeciliaERouse, @RepPressley, @RepLoriTrahan &amp; me your incredible early childhood education facilities. We're more committed than ever to passing the #AmericanFamiliesPlan to ensure that Massachusetts families #BuildBackBetter #mapoli https://t.co/Eevo6ECFPj","date":"Wed Jul 07 20:06:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"👀 Tune in to hear @WhiteHouseCEA’s @CeciliaERouse, @RepPressley, @RepLoriTrahan &amp; me discuss the #AmericanFamiliesPlan with @BECMAinc \nhttps://t.co/jOKdP8N0GX","date":"Wed Jul 07 18:03:38 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻| _\n┻┳| •.•)  Care is\n┳┻|⊂ﾉ    infrastructure\n┻┳|","date":"Wed Jul 07 17:22:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS: #GOP would rather do nothing than help the American people. \n\nOh wait...","date":"Wed Jul 07 14:34:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Thrilled to welcome @WhiteHouseCEA's @CeciliaERouse (back) to #MA5 to talk all things #AmericanFamiliesPlan. Get to know her before she joins me in Massachusetts later today ⬇️ https://t.co/aBIYH89F5I","date":"Wed Jul 07 13:36:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#FourthofJuly weekend in the United States:\n180 people dead by gunshot. \nOver 230 people injured by gunshot. \n\nParents, children, friends, neighbors, gone. We can't go on like this. #EnoughisEnough\nhttps://t.co/3kzqsNH9bp","date":"Tue Jul 06 19:06:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Women (who) rule. \nhttps://t.co/CYfM6faNNd","date":"Tue Jul 06 15:50:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"6 months ago today, America was attacked. #TheBigLie drove white supremacists &amp; conspiracy theorists to our Capitol and put our very democracy on the line.\n\nKnow this: @HouseDemocrats will never walk away from truth, justice and accountability. #January6thCommission","date":"Tue Jul 06 13:22:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Louder for the people in the back 📣 📣📣\nhttps://t.co/au6FTrQ4Yq","date":"Tue Jul 06 12:10:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@KerryKavanaugh @boston25 Good to have you back, @KerryKavanaugh!","date":"Tue Jul 06 11:38:34 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The freedom to vote is the freedom to choose our own path. To build tomorrow together. That’s what America is all about. If you don’t get it, get out of our way.","date":"Mon Jul 05 19:17:30 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As Americans, we are all #Dreamers. Today, as we celebrate #IndependenceDay, let us remember what's at the heart of the American story: the belief in a better tomorrow and liberty and opportunity for all. #Happy4th! #IndependenceDay2021 https://t.co/kLxkR1yti2","date":"Sun Jul 04 14:10:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Olympics needs to change its policy to get with the times — and Congress needs to do the same.  #LetShaCarriRun #LegalizeIt","date":"Fri Jul 02 21:21:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #AmericanRescuePlan is working — adding record jobs &amp; raising wages. \n\nBut there's work still to do: women accounted for less than half of job gains &amp; unemployment is higher for Americans of color. \n\nThe #AmericanFamiliesPlan will ensure no one is left behind as we recover.","date":"Fri Jul 02 16:53:57 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A step forward in our fight for justice. #AbolishTheDeathPenalty","date":"Fri Jul 02 15:14:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@CapehartJ Happy birthday, @CapehartJ! 🥳","date":"Fri Jul 02 12:58:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #ForThePeopleAct has one goal: ensure every American has the freedom to vote. \n\nIf an elected official is standing in the way of #HR1, you should really ask why.","date":"Thu Jul 01 23:10:32 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #CareEconomy Caucus! #AmericanFamiliesPlan #carecantwait https://t.co/ZFrIuKwJ0D","date":"Thu Jul 01 18:08:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The implications of today's #SCOTUS decision will impact #votingrights for generations to come, paving the way for restrictions that put people — especially #BIPOC voters — out of reach of the ballot box. It's a slap in the face to our democracy. \n\nWe're fighting back.","date":"Thu Jul 01 15:32:54 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Care is infrastructure. \n \nSincerely, \nThe Women of Congress","date":"Thu Jul 01 15:11:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s more important than ever that Congress pass the #JohnLewisVotingRightsAct to restore and strengthen the Voting Rights Act of 1965. Our democracy literally depends on it.","date":"Thu Jul 01 14:15:45 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Good morning, every family deserve clean water and air. Our work begins today with the #InvestAct.","date":"Thu Jul 01 12:57:26 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We need a full accounting of the #January6thInsurrection to memorialize the truth and address the dangerous rise of white supremacy. We cannot allow questions to go unanswered and accountability to be dismissed. This was a vote to protect our democracy and our future.","date":"Wed Jun 30 20:59:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"190 Republicans — all but 2 — just voted against created a Select Committee to investigate 1/6. \n\nOnce again, the #GOP voted to bury the truth about an attack on America.","date":"Wed Jun 30 19:54:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@annefitzpatrick @ewarren @EdMarkey Good news, Anne: I did! It's called the #BeHEARDAct and I'm working to pass it into law.","date":"Wed Jun 30 19:51:49 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Over 50 women have accused Bill Cosby of assault. Horrific and traumatizing stories. But because of the statute of limitations in most states, many of these women can't even press criminal charges. This isn't just and it must change. #BeHEARDAct #MeToo","date":"Wed Jun 30 18:02:17 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My heart is with survivors. This is why too many don't come forward. This is why we need to build a system that honors justice — instead of system that protects the powerful.","date":"Wed Jun 30 17:17:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our economy has worked against families for too long instead of helping them succeed — I know this struggle firsthand. The #AmericanRescuePlan's expanded #ChildTaxCredit will ensure families have the basic resources they need. That's why I came to Congress and my fight every day. https://t.co/pPQaUDOpj7","date":"Wed Jun 30 16:33:05 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As we close out #PrideMonth a reminder that we must include non-binary people, trans people, disabled LGBTQ+ people, and queer people of color in every celebration, every fight &amp; every space.","date":"Wed Jun 30 14:32:50 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Climate change resilience is infrastructure ⬇️ \nhttps://t.co/8R7AlsNiuN","date":"Wed Jun 30 00:39:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"I’m in @AppropsDems hearing and once again, Republicans are trying to take #healthcare away from women in #DC. So, let's review: \n\n1) Abortion is health care. \n2) We need #DCStatehood.","date":"Tue Jun 29 22:18:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The people we honor represent what we value — so today we replace a segregationist with #ThurgoodMarshall’s bust as a reminder that we all have an equal share in government. #RemoveHate","date":"Tue Jun 29 18:39:39 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepBarbaraLee Appreciate your solidarity, friend. West Coast, East Coast — everywhere. We must stand together to stop hate. #Winthrop","date":"Tue Jun 29 16:41:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"So grateful to @janedoe for this honor but more than anything else, I'm grateful for their work to end #domesticviolence and #sexualassault. Proud to partner together to create a safe, equal and just world for everyone.","date":"Tue Jun 29 13:37:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"To #GavinGrimm and all Americans fighting for the right to be their true selves: this win is yours. Never stop being you. Never stop working toward #equality. Your fight is all of ours. #TransRightsAreHumanRights https://t.co/5YoJ1qlA4G","date":"Mon Jun 28 22:50:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Me when we talk about investing in #childcare... https://t.co/glWAtW081D","date":"Mon Jun 28 20:25:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"On the anniversary of #Stonewall, let me tell you about one of my #LocalPrideHeroes, Jacob Lemay. \n\nWith bravery &amp; support from his incredible parents, Jacob transitioned at a young age &amp; now is leading the next generation of #trans rights activists. His mission: equality. #pride https://t.co/mp0kXYlA1W","date":"Mon Jun 28 16:19:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Our community has been targeted by hate-fueled violence. We must stand together and reject these abhorrent values. Hate has no place here or anywhere. #Winthrop","date":"Mon Jun 28 15:19:24 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Heartbroken &amp; outraged by the tragedy in #Winthrop. While some details are unknown, we’ve learned that our community has been targeted by anti-Semitism &amp; racism. In this time of mourning, we must stand together &amp; reject these abhorrent values. Statement: \nhttps://t.co/WF9ZVFwniA","date":"Sun Jun 27 23:26:33 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Following the tragedy in #Winthrop and thinking of the whole community. Thank you to first responders who are on the scene.\nhttps://t.co/K43RqRhn4l","date":"Sat Jun 26 22:06:05 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#AmericanRescuePlan fan mail - love this so much, @RepKahele! #ChildTaxCredit","date":"Sat Jun 26 12:08:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Methane is a dangerous greenhouse gas 84x more powerful than carbon dioxide. Today, we ended Trump's deregulation of methane — because tackling #climatechange must be at the top of our agenda. #CutMethane #BuildBackBetter #ClimateAction \nhttps://t.co/jABR82ZkKz","date":"Sat Jun 26 00:05:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It's official: the victims of the #PulseNightclub shooting will be honored with a National Memorial. TY @RepStephMurphy, @RepDarrenSoto and @RepValDemings for making this a reality. \n\nOur fight for a safe, equal &amp; just America continues in their honor. #EndGunViolence #PrideMonth","date":"Fri Jun 25 21:28:13 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@lizhmccarthy @AyannaPressley @Ilhan @CityofWaltham Yes, Liz. Such an important topic for our community -- and #somegoodnews: the #EvictionMoratorium was extended yesterday. More here: https://t.co/kdyTVpxUFc","date":"Fri Jun 25 18:26:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@ErikaAbrahamss2 Done — #MA5 follows are my fav!","date":"Fri Jun 25 18:19:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"8 yrs ago, the Shelby County v Holder #SCOTUS decision gutted the #VotingRightsAct and we're living with its disastrous effects on our democracy. \n\nAmericans fought too hard for the vote for us to stop fighting now. \n\nWe must #RestoreTheVote &amp; pass the #JohnLewisVotingRightsAct.","date":"Fri Jun 25 17:51:47 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is just… 🤩😍👑. Love every accessory and word of inspiration, @SecDebHaaland!","date":"Fri Jun 25 15:51:42 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Let's be clear about 3 things: \n\n1) Birth control is not abortion. \n\n2) Plan B is not abortion. \n\n3) Women in the military deserve access to comprehensive reproductive health care.","date":"Thu Jun 24 23:52:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Another proud moment during #PrideMonth!","date":"Thu Jun 24 21:32:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":".@StaceyAbrams just spoke with House staff and I was so moved by this: “Voting isn’t magic. It’s medicine. It treats the symptoms and heals the disease. If we keep taking our medicine, we will get better.” \n \nThe cure starts with us.✨\n\nTy, Stacey.","date":"Thu Jun 24 19:02:20 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"49 years ago, #TitleIX brought our nation one step closer to the principle of true equality, securing the right for women and girls to participate and succeed in the classroom and on the playing field. \n\nNext up: trans women and girls. #letgirlsplay","date":"Thu Jun 24 16:38:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Everyone deserves control over their own body. Period. #FreeBritney","date":"Thu Jun 24 02:01:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today, @HouseDemocrats passed the Protecting Older Workers Against Discrimination Act to secure #JusticeForWorkers.\n\n1. It helps prevent age discrimination. \n\n2. Dems are passing bills every day — even if it's not on the front page.\n\n3. #AbolishTheFilibuster","date":"Wed Jun 23 22:07:29 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Bill passed! Now, let's get the #NewbornScreening Act through the Senate and sent to President Biden's desk so we can continue to advance health care equity in America and ensure every child has a pathway to a happy, healthy life!","date":"Wed Jun 23 21:21:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"It’s not about IF we can afford to invest in child care while growing our economy. \n\nInvesting in child care IS how we grow our economy and recover from the pandemic. #ChildCareNow #UniversalChildCare #ChildCareisInfrastructure","date":"Wed Jun 23 18:06:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"When Republicans in Congress say they’re ‘pro life’, remember that they voted against cutting child poverty in half. #ChildTaxCredit #AmericanRescuePlan","date":"Wed Jun 23 16:01:25 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"TLDR, this isn't complicated: If you want working parents to return to work, find new employment &amp; participate in the economy, they need to have a quality, affordable #childcare provider — Because child care is infrastructure.\n\nAnd we're calling on Congress to make it happen. 3/3","date":"Wed Jun 23 14:01:12 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Care workers are the backbone of our economy, but they’ve long been underpaid &amp; undervalued. We learned that lesson the hard way during this pandemic. Now is the time we rebuild by investing in the #CareEconomy. 2/3","date":"Wed Jun 23 14:01:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Congress can provide #childcare to every family, create &amp; support over 2 million jobs for women, &amp; invest in the next generation — But we have to be bold. That's why @senwarren &amp; I are calling for $700 billion over 10 years to build a stronger child care system for everyone. 1/3 https://t.co/3DimM2daCo","date":"Wed Jun 23 14:01:11 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you were doing good for your voters, you wouldn't be trying to make it harder to get them to the ballot box. \n\nIt's just that simple.","date":"Wed Jun 23 00:39:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"If you’re wondering what just happened in the Senate: Republicans didn't block #S1 — they blocked DEBATE. They've fallen so far from our democracy that they won't even engage in a conversation about protecting voting rights. #ForThePeople #HR1","date":"Tue Jun 22 22:25:19 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"This is not what democracy looks like 📢","date":"Tue Jun 22 19:21:16 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"As a mom and daughter, I lived this struggle. Too many families face the challenge of balancing care for kids and older family members while struggling to get to work and get by. But we can build a #careeconomy that works for working families. #AmericanFamiliesPlan","date":"Tue Jun 22 18:13:59 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Today would be a great day to protect #votingrights.","date":"Tue Jun 22 15:39:41 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Big Lie. The insurrection. Voter suppression — Republicans would rather cheat than compete.  #VotingRights #HR1 #S1 #ForthePeopleAct @allinwithchris @MSNBC @chrislhayes https://t.co/2wWsceh1TS","date":"Tue Jun 22 14:04:27 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@DeniseG53 TY 👩🏻‍🦳 ✨","date":"Tue Jun 22 02:01:10 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"We're not in a fight for the midterms or the majority, we're in a fight for the soul of our democracy. That's what's at stake with #HR1 #S1. #votingrights #ForThePeople https://t.co/ntO1zTEXxO","date":"Tue Jun 22 01:30:56 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans would rather cheat than compete. Joining @chrislhayes tonight to talk #votingrights and our fight to protect democracy.","date":"Mon Jun 21 23:59:49 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The #AmericanRescuePlan expanded the child tax credit.\n \nThe #AmericanFamiliesPlan will make the expansion permanent.\n \nLet's. Get. It. Done. #ChildTaxCreditAwarenessDay","date":"Mon Jun 21 17:56:44 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In #MA5 alone, 94,300 children total will receive the expanded #ChildTaxCredit.\n\nThe average benefit for 33,800 households is $2,300 and 5,400 children will be lifted out of poverty!!\n\nHelp is here! #ChildTaxCreditAwarenessDay 2/2","date":"Mon Jun 21 16:53:03 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"IMPORTANT: Low-income families with children are eligible for the #ChildTaxCredit - including those who don't make enough $ to file taxes. But to receive your payment, you must notify the IRS. \n\nUse this simple tool to sign up today⬇️1/2  \nhttps://t.co/LkBV7YoXXd","date":"Mon Jun 21 16:53:02 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Wishing all the dads out there a happy #FathersDay! https://t.co/8GjkvEJ96f","date":"Sun Jun 20 17:52:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#Juneteenth is finally a national holiday. \n\nNext up: Election Day.","date":"Fri Jun 18 15:07:08 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"In observance of #Juneteenth, my office will be closed today, Friday, June 18, 2021. https://t.co/cbWmCT4kEI","date":"Fri Jun 18 13:07:55 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Celebrating the first #Juneteenth federal holiday with the first Black @VP — progress is our promise! https://t.co/P3NFjsY6AD","date":"Thu Jun 17 21:55:48 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Pride and progress — at the White House for the #Juneteenth bill signing! https://t.co/9egCITpje5","date":"Thu Jun 17 20:19:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Republicans did everything they could to take away your #healthcare. \n\nToday, they lost their heartless battle against the #ACA. \n\nWhen will they learn that working against American families is always a losing fight?","date":"Thu Jun 17 17:56:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"19 years ago, Congress passed the 2002 #AUMF based on lies about Saddam Hussein’s Weapons of Mass Destruction. Today, millions of young people, including my 3 kids, have never known an America that wasn’t at war. That’s why I voted 'yes' to repeal the AUMF and #StopEndlessWars. https://t.co/caQi69f1Xu","date":"Thu Jun 17 15:33:31 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#ACA IS HERE TO STAY! Now, let’s go bigger and bolder.","date":"Thu Jun 17 14:11:09 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"NEWS 🚨 The House just passed a bill to finally make #Juneteenth a national holiday. We can’t stop there. Our work is not complete until every person is honored with respect, dignity, and justice — voting rights, #justiceinpolicing, and economic justice.","date":"Wed Jun 16 23:36:35 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@gawd2u You've got my vote. It's long past time we repeal the 2002 #AUMF and say 'no' to endless wars.","date":"Wed Jun 16 20:25:22 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"A vast majority of Americans support our infrastructure investments in working families:\n\n68% support the #AmericanJobsPlan\n\n61% support the #AmericanFamiliesPlan\n\nSo, if I’m doing my math correctly, 100% of Republicans will no vote...?","date":"Wed Jun 16 19:46:23 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"My newest sister in service! Welcome to The People’s House, @Rep_Stansbury! #electwomen #futureisfemale https://t.co/9FCe2wV8Pw","date":"Wed Jun 16 19:18:15 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@NAACP_MVAB Thanks for a great convo on our fight for racial justice and equity, @NAACP_MVAB! \n\nIf you didn't get a chance to tune in, check it out here➡️ https://t.co/p1N8yRnm1M","date":"Wed Jun 16 17:09:00 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"#TransRightsAreHumanRights - and the classroom is no exception. #Pride2021","date":"Wed Jun 16 16:52:53 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@RepMarieNewman @TeenVogue Love this, @RepMarieNewman! Such a beautiful piece celebrating a beautiful family!! ❤️🌈❤️","date":"Wed Jun 16 15:19:07 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"@MelanieforNM Welcome, Congresswoman @MelanieforNM! 🎉🥳","date":"Wed Jun 16 13:57:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"The Capitol &amp; DC Police protected our laws &amp; our democracy on January 6th. Here are the 21 Republicans who voted against honoring them⬇️","date":"Tue Jun 15 21:49:21 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"What are Republicans committed to... other than obstruction? https://t.co/nH5T7D60Tc","date":"Tue Jun 15 21:12:37 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Happy birthday, #DACA! There's no better gift than enacting the #DreamandPromiseAct and providing full citizenship to our #Dreamers and TPS recipients. #Homeishere","date":"Tue Jun 15 16:11:43 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Child care, elder care, paid leave - the #AmericanFamiliesPlan is bipartisan everywhere but the beltway. We're not backing down from our commitment to working families to #BuildBackBetter. #CareEconomy @Morning_Joe @MSNBC https://t.co/esMFCaS9zs","date":"Tue Jun 15 14:52:14 +0000 2021","user_id":"2293131060"},{"handle":"RepKClark","text":"Coming up on @Morning_Joe- in studio! Tune in #AmericanFamiliesPlan #AmericanJobsPlan https://t.co/UPelzpy6QR","date":"Tue Jun 15 11:44:09 +0000 2021","user_id":"2293131060"}]