[{"handle":"RepLisaMcClain","text":"JUST IN: My bill to rename the St. Clair Post Office after Marine Corporal Jeffrey Robert Standfest was signed into law. I am proud that this great American hero will be forever honored in our community. 🇺🇸","date":"Thu Jun 16 23:35:56 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I guess Nancy Pelosi is okay with violent attacks as long they promote her radical agenda.","date":"Thu Jun 16 20:20:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Nearly 240,000 illegal encounters at the border in May, that's the most for a single month in 22 years.\n\nWe must secure the border NOW!","date":"Thu Jun 16 18:53:39 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Border Security= National Security","date":"Thu Jun 16 16:19:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Blatant and motivated attacks on Pro-Life groups must be investigated as domestic terrorism. There is no other option, the DOJ needs to act on this now before the violence gets worse. https://t.co/kmf322FFiB","date":"Thu Jun 16 15:47:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Fed would not have to be raising rates if @POTUS had not spent trillions of tax dollars for no reason!!","date":"Wed Jun 15 21:49:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Calling all #MI10 High school students: The Congressional App Challenge is now open. Click below for more information on the competition rules and submission guidelines.https://t.co/AmMOla1iC7","date":"Wed Jun 15 17:51:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans are ready to get back to work. Businesses are ready to get employees back to work. It's time for the Biden Administration to step aside and let our workforce get back to work. https://t.co/IwqQbgB7aB","date":"Wed Jun 15 00:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"News flash: This economy isn't working for anyone.","date":"Tue Jun 14 22:13:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"27 Democrats just voted NO on the SCOTUS security bill - yet they all support an illegitimate committee focused on \"protecting democracy\". \n\nThe hypocrisy is deafening.","date":"Tue Jun 14 21:06:20 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today we celebrate Flag Day, the American flag represents more than a country, it represents hope. I will always be proud of our beautiful red, white and blue. https://t.co/4xbJH2SNzY","date":"Tue Jun 14 20:35:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Birthday to the @USARMY! \n\nFor 247 years the men and women of the U.S. Army have dedicated their lives to serving our country.\n\nThank you for your service. https://t.co/6uKZEXHY9P","date":"Tue Jun 14 17:17:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden claims to be the 'pro-woman' president. But women continue to suffer because of his economic failures.\n\n➡️First, the baby formula shortage\n➡️Now, a tampon shortage\n\nBiden needs to get the supply chain crisis under control.","date":"Tue Jun 14 16:10:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Taxpayer dollars should not be shipped to animal testing labs in Russia. We must put an end to the NIH funding for Kremlin-backed institutions. I'm proud to work with @WhiteCoatWaste to stop this waste and abuse.\nhttps://t.co/QRpDBxo5Sg","date":"Mon Jun 13 18:26:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Protecting Supreme Court Justices is not political.","date":"Mon Jun 13 17:07:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Communists in Beijing are upset that the U.S. is supporting a democracy on the path to independence. Make no mistake about it, we will always stand with the people of Taiwan.\nhttps://t.co/JpuAjfeOc0","date":"Mon Jun 13 16:28:55 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tight Lines! Be sure to take advantage of the free fishing this weekend in our beautiful Great Lakes and around #MI10. https://t.co/9QGS0y0736","date":"Fri Jun 10 19:52:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Gas has gotten so expensive that Michigan police departments can’t respond to 911 calls.\n\nhttps://t.co/NU5RLtamLy","date":"Fri Jun 10 18:36:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Make Gas Affordable Again!","date":"Fri Jun 10 17:11:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I wanted to grab some popcorn to watch this hoax hearing tonight but grocery prices are at an all time high.","date":"Fri Jun 10 00:19:57 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people are more concerned about\n\n➡️ Inflation\n➡️Gas Prices\n➡️Feeding their Babies \n\nthan they are about a partisan, sham hearing.","date":"Thu Jun 09 23:42:16 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Last night, House Democrats blocked my attempt to bring forth a bill that would protect our Supreme Court Justices. \n\nDespite a recent plot to kill Justice Kavanaugh.\n\nWhat a disgrace. https://t.co/NB9ES0GBhp","date":"Thu Jun 09 20:49:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I am sick of the hypocrisy. Democrats want to raise the age to purchase a gun to 21. Yet, they want to allow children to change their sex?!  Find a standard and stick to it. https://t.co/bsPeuqsYAg","date":"Thu Jun 09 15:59:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I met with one of the great Michigan companies today, Better Made Snack Foods, to talk about the rising costs associated with their business. They provided great insights into the challenges the food industry will face in the weeks ahead. https://t.co/QZG60P7eJi","date":"Thu Jun 09 14:26:39 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tonight I voted NO on Democrat bills that would strip you of your constitutional rights. Republicans proposed a bill with real solutions to keep your children safe, the Democrats voted it down. They don’t want solutions. They want to push their anti-gun agenda. https://t.co/jnNzpO4Fq7","date":"Thu Jun 09 00:43:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Where is the prime time show on the border?","date":"Wed Jun 08 19:49:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Republicans have put forward legislation to address mass shootings, and of course, Democrats won't let it see the light of day.\n\nThey don't want solutions; they want to push their anti-gun agenda.","date":"Wed Jun 08 18:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was a pleasure to meet and speak with former NBA player @EnesFreedom. We need to stop applauding the athletes that kneel for our National Anthem and start applauding those who act, speak up, and fight for our freedoms. https://t.co/NXhGRMrBTK","date":"Wed Jun 08 17:53:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Where is the prime time show on gas prices?","date":"Wed Jun 08 16:50:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Where is the prime time show on inflation?","date":"Wed Jun 08 15:15:48 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This Jan 6th hearing is not about our republic; it's about politics. \n\nThe Democrats know they have a long list of failures, so they're creating a media stunt to try and make the American people forget.","date":"Wed Jun 08 14:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"In President Biden's economy we've seen:\n-Skyrocketing Inflation🚀\n-Record Breaking Gas Prices 📈\n-Disastrous Supply Chain Issues 🚨\n...and no end in sight","date":"Tue Jun 07 20:02:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden has put a welcome mat at our southern border. \n\nNearly 10,000 migrants are headed there right now and they're asking President Biden to 'keep his promise' and let them in to our country.","date":"Mon Jun 06 17:30:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today on #DDay, we honor the thousands of American heroes who stormed the beaches of Normandy to fight for our freedoms. They ran into danger, not away. Let us never forget their sacrifice, bravery, and courage. https://t.co/ZnlDsphg3n","date":"Mon Jun 06 14:03:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to all my constituents who participated in the tele-town hall last night. \n\nWe discussed a wide range of issues including the second amendment, inflation, the southern border, the WHO and student loan forgiveness. I enjoyed hearing your stories and your questions.","date":"Fri Jun 03 16:27:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Just another Biden Administration failure.\n\nhttps://t.co/pURlrcaJ9b","date":"Thu Jun 02 19:11:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Hey #MI10, we've got a tele-town hall coming your way tonight! \n\nBe listening for the phone call and jump on the line to ask YOUR question.","date":"Thu Jun 02 15:41:22 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tomorrow evening I will be hosting a tele-town hall. #MI10 I would love to hear from you and answer your questions! You can dial 833-380-0655 to listen in and ask your questions. https://t.co/SU9NuAVWbF","date":"Thu Jun 02 00:39:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Secure our southern border immediately.","date":"Thu Jun 02 00:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Say you drive diesel, like many of the farmers in my district do. \n\nToday it's $5.54 for a gallon of diesel. That's over $100 to fill up your pickup.\n\nYou're paying the price for Biden's war on American energy.","date":"Wed Jun 01 17:16:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Birds of a feather flock together.","date":"Wed Jun 01 14:44:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Economists all over the country anticipated 'the path that inflation would take.' Why didn't @SecYellen?","date":"Wed Jun 01 13:52:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Iran has enough uranium to produce a nuclear weapon and won't tell us why. \n\nThere should be absolutely no new deal until we have answers.","date":"Tue May 31 23:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This weekend in honor of Memorial Day, I attended the St. Clair American Legion Memorial Day Parade and Ceremony. I am grateful to have been invited to this event that commemorated our fallen soldiers. Our heroes paid the ultimate sacrifice for our freedoms. https://t.co/OhvponPytE","date":"Tue May 31 19:25:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people aren't stupid. They know that the economic crisis is no one's fault but Biden's.","date":"Tue May 31 18:04:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We are truly the land of the free because of the brave.\n\nThis #MemorialDay there is no better way to pay tribute to our fallen heroes than by living out the freedoms they fought to protect. I hope you all enjoy this day with your family and friends. \n\nHappy Memorial Day! https://t.co/M8Z6nX1GQK","date":"Mon May 30 13:17:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I stand with Israel.\n\nToday on the 55th anniversary of #YomYerushalayim, Jerusalem Day, we as a country must reaffirm our strong support that Jerusalem is the undeniable capital of Israel. https://t.co/1KnebGIrlu","date":"Sun May 29 00:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m thrilled the Senate voted to pass my bill which would rename the Saint Clair Post Office in honor of local war hero, Marine Cpl. Jeffrey Standfest. \n\nThere is no better time to honor Cpl. Standfest and his bravery than during Memorial Day weekend.","date":"Thu May 26 23:14:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My heart breaks for the parents of Uvalde who lost their children way too soon. I will never understand the type of evil and sickness it takes for an individual to do something like this. \n\nPlease join me as I pray for the families affected by this tragedy.","date":"Wed May 25 20:43:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Russia and China are flying bombers on Japan's doorstep during Biden's visit.\n\nThey aren't doing this because they think Biden is a strong leader.","date":"Tue May 24 16:03:03 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The CCP-run World Health Organization doesn't deserve your tax dollars.","date":"Mon May 23 23:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you all for coming to my town halls this weekend.\n\nI look forward to hosting more town halls in the future, but in the meantime, don't hesitate to reach out to my office to let me know what issues concern you. https://t.co/lEoFNqUHu9","date":"Mon May 23 19:42:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My town halls are today! Hope to see you there.","date":"Sat May 21 14:53:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today on National Armed Forces Day we remember that freedom is not free. Thank you to all the men and women of the armed forces for their courage and their bravery in their defense of our country. https://t.co/xa1les5caV","date":"Sat May 21 14:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Abortion is NOT the only option. \n\nThis morning at Spero Pregnancy Center in Port Huron, I learned about all the resources they offer to a woman and her child during pregnancy. I will always stand for women and for life. https://t.co/7bdqQbSA6Q","date":"Sat May 21 13:49:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My thoughts and prayers go out to all those affected by the tornado in Gaylord.","date":"Sat May 21 02:57:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"A federal judge just stopped the Biden Administration from repealing Title 42. \n\nThis is a major win for our border security and the safety of our communities!","date":"Fri May 20 22:03:16 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Unleash American Energy!","date":"Thu May 19 23:55:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Women's sports leagues were created so women could compete on a field without men.\n\nDemocrats are willing to throw Title IX out the window to advance their far-left agenda at the expense of women.","date":"Thu May 19 19:01:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I was very excited to receive this treat to mark my third bill passed as a freshman member of Congress! Thanks @SteveScalise. https://t.co/dKPJSkIgyo","date":"Thu May 19 17:55:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This weekend, I'm holding town hall meetings in Dryden and New Baltimore. I'd love to hear from you and answer your questions. Hope to see you there! https://t.co/mQiNVJqs42","date":"Mon May 16 18:33:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrat logic: you can be 18 to die for our country, but have to be 21 to obtain a fire arm.\n\nhttps://t.co/zAkP15HKCC","date":"Thu May 19 15:30:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This morning, at the 24th Annual Women in Military Service Wreath Laying Ceremony, I had the honor of meeting and introducing Space Force Honoree Technical Sergeant Terielle Wilhite. It was wonderful to honor her and all the women, past and present, who serve in our military. https://t.co/ElnYS2t8VE","date":"Wed May 18 17:51:48 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The DHS Disinformation Governance Board should have never been created in the first place. Not only does DHS need to pause the creation of this board, we need to make sure nothing like it is ever created again.","date":"Wed May 18 15:51:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The nationwide formula shortage is incredibly dangerous, especially for babies with health problems. \n\nWe need real solutions to get babies the formula they need right now.","date":"Wed May 18 13:45:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My bipartisan bill, the Patient Advocate Tracker Act, just passed the House! \n\nOur veterans deserve the best care possible, and when they receive subpar care, they need to be able to track the status of their complaint. \n\nThis bill does just that.","date":"Wed May 18 00:08:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Girls sports are under attack like never before. \n\nI signed a discharge petition to bring the Protection of Girls in Sports Act of 2021 bill to the floor immediately.","date":"Tue May 17 21:21:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm proud to cosponsor the Public Safety Enhancement Act to provide our police with the resources they need to keep our communities safe.","date":"Tue May 17 20:29:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I planned on having a telephone town hall tonight, but just learned my bill to assist our nation’s veterans will be voted on this evening. To usher it to passage, I’m postponing the call. \n\nI invite you to attend one of my in-person events this Saturday instead!","date":"Tue May 17 20:12:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis is completely out of control. \n\nNot only is there a record number of border crossings, but DHS is releasing tens of thousands of illegal aliens into the interior of our country daily. \n\nThis is unacceptable. https://t.co/elXEcqQq2e","date":"Tue May 17 13:08:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Speaker Pelosi is incredibly out of touch with the American people.\n\nInstead of getting inflation under control by cutting government spending, the House will spend $100,000 a month on Peloton memberships. \n\nPutting the political elite over the American people once again.","date":"Mon May 16 19:15:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The World Health Organization doesn't deserve a penny of your tax dollars. \n\nThat's why I cosponsored @RepChipRoy's bill to prevent your hard-earned money from going to this corrupt organization.","date":"Mon May 16 19:10:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This weekend, I'm holding town hall meetings in Dryden and New Baltimore. I'd love to hear from you and answer your questions. Hope to see you there! https://t.co/mQiNVJqs42","date":"Mon May 16 18:33:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Abortion activists are continuing to put pressure on the Supreme Court by holding rallies all over the country today. I pray the court swiftly releases its opinion to overturn Roe v. Wade, so this constant harassment by the left will end.","date":"Sat May 14 14:28:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you need baby formula, Abbott is providing baby formulas that were previously on hold.\n\nThe formula is free with a doctor's recommendation, call Abbott directly at 1-800-881-0876","date":"Fri May 13 21:28:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #CCP has arrested a cardinal under their sham \"national security law.” They are openly stifling the basic rights and freedoms of their citizens. Enough is enough.\n\nhttps://t.co/fXKCry5Q50","date":"Fri May 13 14:25:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was great meeting with the Police Officers Association of Michigan today. I am a strong supporter of our men and women in blue and how fitting to meet with them during #NationalPoliceWeek! https://t.co/XhCZVc7NXP","date":"Fri May 13 01:24:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden and the Democrats have been pushing their far-left Green New Deal energy policies for years. Now that they are in-control, it's costing you at the pump.","date":"Thu May 12 23:52:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It is called the Strategic Petroleum Reserve for a reason. It is supposed to be used STRATEGICALLY. It is not supposed to be used to bail out a failing President.","date":"Thu May 12 20:19:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is restricting access to oil and gas at a time when Americans are paying more at the pump then they have in years.","date":"Thu May 12 18:35:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Babies in America are starving, and instead of prioritizing the health and safety of American citizens, the Biden Administration is putting illegal aliens first. \n\nThis is shameful. https://t.co/i60d1wvNTL","date":"Thu May 12 12:55:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If the Biden Administration was serious about lowering gas prices, they would drill for American oil.","date":"Wed May 11 23:50:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I am thankful that the Senate voted to protect the sanctity of life.","date":"Wed May 11 20:48:56 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans have a right to privacy. I am proud to join my colleagues in sending this letter to the CDC demanding answers as to why this right was violated, and why they tracked Americans.","date":"Wed May 11 19:28:35 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is encouraging people to break federal law to advance their far left political stance.","date":"Wed May 11 14:20:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden will send the DOJ after parents for speaking up at school board meetings, but won't break up protests aimed at influencing Supreme Court Justices.","date":"Wed May 11 13:08:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Let’s be clear. The Democrats abortion bill does not just codify Roe v. Wade. Their radical pro-abortion bill allows your taxpayer dollars to fund abortions up until birth.","date":"Tue May 10 21:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Yesterday, Michigan gas prices hit a record high. \n\nThese high prices are a reminder of the Biden administration's anti-American energy policies and the effects they are having on the pocketbooks of all Americans. https://t.co/XFUAnRPq7E","date":"Tue May 10 20:02:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration's open border policies are fueling the fentanyl crisis. Last year, fentanyl overdoses were the #1 cause of death for Americans ages 18-45. \n\nThey shut down the country to stop COVID, why won't they shut down the border to stop the fentanyl crisis?","date":"Tue May 10 19:02:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My Republican colleagues and I are committed to cutting spending to stop #Bidenflation. That’s a lot more of a plan than the Democrats have.","date":"Tue May 10 15:21:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Being a new mother is scary enough without having to worry about a supply chain crisis.\n\nBiden and his \"Supply Chain Taskforce\" need to find a solution for the baby formula shortage to help mothers across the country.","date":"Tue May 10 00:04:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We don't need a poll to know that Americans don't want far left social spending.","date":"Mon May 09 19:59:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What was your favorite excuse the Biden Administration has made for #Bidenflation ?","date":"Mon May 09 18:22:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepRalphNorman \n@RepScottPerry \n@RepPfluger \n@RepGregSteube \n@CongressmanGT \n@RepTimmons \n@RepTiffany \n@RepTedBudd \n@USRepLong \n@RepRickCrawford \n@RepArrington \n@RepMaryMiller \n@Rep_Clyde \n@RepBuddyCarter \n@RepBobGood \n@RepMcKinley \n@RepBoebert \n@RepJackBergman \n@RepRosendale","date":"Mon May 09 15:43:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepAlexMooney \n@RepFischbach \n@RepBarryMoore \n@RepRussFulcher \n@DrNealDunnFL2 \n@RepFredKeller \n@RepBrianBabin","date":"Mon May 09 15:43:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepStefanik \n@RepAndyBiggsAZ \n@RepGusBilirakis \n@RepDanBishop \n@RepCloudTX \n@RepJeffDuncan \n@replouiegohmert \n@replouiegohmert \n@RepAndyHarrisMD \n@RepHartzler \n@CongressmanHice \n@RepDustyJohnson \n@RepDLamborn \n@RepMcClintock \n@RepMoolenaar \n@RepGregMurphy","date":"Mon May 09 15:43:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our Right to Bear Arms continues to be under attack by the left. Biden has no right to restrict the 2nd amendment.\n\nI recently introduced a Congressional Review Act Joint Resolution of Disapproval which would prohibit the DOJ from implementing Biden's new 'ghost gun' rule. https://t.co/Ko8vwKcHAt","date":"Mon May 09 15:43:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Mother’s Day! A mother’s unconditional love for her child is one of the greatest blessings. As a mother of four wonderful children, I am beyond grateful to spend this day with my family. To all of the women celebrating, I hope your Mother’s Day is filled joy and love. https://t.co/Ec2emoqPdn","date":"Sun May 08 13:43:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, we celebrate National Tourism and Travel Week. Join me in recognizing the important role travel and tourism play in our community. In my district, people come from all over to visit beautiful Lake Huron. https://t.co/W9zlkoLN83","date":"Sat May 07 14:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"DHS Secretary Mayorkas has pushed the United States into a national security crisis. He has refused to protect and secure our southern border. His actions show a Constitutional failure to fulfill the oath of office, which is why my colleagues and I are demanding his resignation.","date":"Fri May 06 22:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This #MilitarySpouseAppreciationDay, let's give a big thank you to all of the incredible military spouses out there. Their dedication to this country does not happen without sacrifice, and we can never thank them enough for their support of our military members. https://t.co/rMgEEUvz4n","date":"Fri May 06 20:16:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"DHS should focus on securing our border, rather than policing Americans for misinformation.","date":"Wed May 04 23:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I recently cosponsored the Protecting Free Speech Act which would terminate the DHS Disinformation Governance Board and prohibit federal funds from being used to establish anything similar in the future. https://t.co/uTsgbVNUVn","date":"Wed May 04 19:43:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Department of Homeland Security's disinformation board is a threat to American ideals. America was founded on an individual's rights, including the right to free speech.\n\nThe government has no business regulating what you say.","date":"Wed May 04 19:43:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today on #InternationalFirefightersDay we praise all the brave men and women who fearlessly face danger in order to protect our communities. https://t.co/4qjoxbkpaH","date":"Wed May 04 19:37:55 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy #SmallBusinessWeek! Small businesses are the backbone of our local economy, and crucial to our communities. Let's celebrate this week by shopping local. https://t.co/QGWH9lhUWo","date":"Wed May 04 16:02:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This Saturday I will be hosting the 2022 Congressional Art Competition Gallery and Awards Ceremony. Please stop by to enjoy the work of our community's student artists. More details below https://t.co/MzkC7Tapox","date":"Tue May 03 20:42:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I will always fight for the unborn.","date":"Tue May 03 16:44:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, Democrats will claim they are protecting women, when for the past month they haven't been able to give us a definition of what a woman is.","date":"Tue May 03 15:42:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"While I support overturning Roe v. Wade, I'm gravely concerned about the leaking of SCOTUS' deliberations and the clear intimidation tactics of the Left. This leak is unprecedented, and the court needs to be able to go through its normal process before opinions are publicized.","date":"Tue May 03 13:05:22 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Overturning Roe v. Wade would save millions of innocent, unborn babies. I pray the Supreme Court makes it official and formally overturns this attack on the unborn.","date":"Tue May 03 01:26:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepSlotkin \n@RepBarryMoore \n@RodneyDavis \n@RepPatFallon \n@MoBrooks \n@LloydDoggettTX \n@RepSpartz \n@RepTerriSewell \n@RepBrianFitz \n@congbillposey \n@RepMariaSalazar \n@TXRandy14 \n@RepJeffDuncan \n@RepBrianMast \n@RepMalliotakis \n@RepDonaldsPress","date":"Mon May 02 19:46:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBuddyCarter \n@RepTedBudd \n@RepTimmons \n@RepYoungKim \n@RepJimBaird \n@RepMcKinley \n@RepCawthorn \n@RepFredUpton \n@RepNancyMace \n@RepHarshbarger \n@RepRickCrawford \n@RepGregSteube","date":"Mon May 02 19:46:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"https://t.co/socLfuzLOw","date":"Mon May 02 19:46:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Taxpayer dollars should not be going to animal research in Russia.\n\nI recently led an effort to urge the Appropriations Committee to adopt a provision that will prohibit the National Institute of Health from funding inhumane Russian animal research.","date":"Mon May 02 19:46:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Recently, I submitted an amendment to the DHS Appropriations bill that would prevent taxpayer dollars from enforcing this vaccine mandate on cross-border commerce. https://t.co/wspXGkg9fq","date":"Mon May 02 19:24:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We are in the midst of a supply chain crisis. President Biden should be working to solve this crisis. \n\nInstead DHS is using taxpayer dollars to enforce a vaccine mandate on truck drivers from Canada and Mexico.","date":"Mon May 02 19:24:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people struggling to pay rent and buy food  aren't a joke.\n\nThe only joke here is President Biden's leadership.","date":"Mon May 02 18:10:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"May is Military Appreciation Month. This month, we honor all the members of our military who sacrifice so much every single day to protect our freedoms. \n\nThank you for your service! https://t.co/MCYpp5DadL","date":"Mon May 02 14:17:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy #ArborDay! Today marks 150 years of Americans celebrating Arbor Day by planting a tree. https://t.co/6zplR8pa15","date":"Fri Apr 29 17:05:39 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Enjoyed meeting with @UMichFootball @CoachJim4UM today! \n\nGo Blue! https://t.co/iA1cWWhwjA","date":"Thu Apr 28 20:10:59 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America's GDP dropped 1.4% last quarter.\n\nWhen will Democrats take responsibility for their failed policies?","date":"Thu Apr 28 20:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Federal student loans were established by Democrats. \n\nNow their policy fails and they want the American people to foot the bill.","date":"Thu Apr 28 19:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Stop targeting parents who want to be involved in their child’s education.","date":"Thu Apr 28 18:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. economy is struggling due to the Democrats' outrageous spending and unnecessary mandates.","date":"Thu Apr 28 17:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#ThanksPresidentBiden","date":"Thu Apr 28 14:22:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"You stand behind a free marketplace? Since when? Oh, wait...@HuaweiUSA would be allowed to do business in the U.S. if they weren't under complete control of the #CCP.","date":"Thu Apr 28 00:10:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today at sundown #YomHaShoah, Holocaust Remembrance Day, begins. This is a time to remember the millions of lives lost, and to stand together to say never again. https://t.co/PhnCYCjDjN","date":"Wed Apr 27 23:02:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"DHS Secretary Mayorkas needs a real plan, that includes securing our border, to stop the massive influx of illegal aliens flooding our border.","date":"Wed Apr 27 21:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Complete Democrat control in a nutshell:\n\n- High Prices\n- High Crime\n- High Taxes","date":"Wed Apr 27 20:28:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Teaching fiscal responsibility &gt; cancelling student loan debt","date":"Wed Apr 27 19:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Most Americans have known this for months. Now it's time for all of the \"pandemic\" restrictions to end","date":"Wed Apr 27 18:40:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration's reckless policies have allowed people on the terrorist watchlist to cross our southern border. This is a threat to national security!","date":"Wed Apr 27 17:57:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Secretary Mayorkas is either completely incompetent or lying to Congress. \n\nThe #BidenBorderCrisis continues to worsen and is nowhere close to \"effectively managed.\"","date":"Wed Apr 27 17:14:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This a major win for the safety and security of America.","date":"Tue Apr 26 21:54:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"April is the month of the military child. This month, we recognize the sacrifice and resilience of children in military families. https://t.co/GiAyQcnTIe","date":"Tue Apr 26 14:37:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If President Biden cared about border security, he would keep Title 42 in place.","date":"Tue Apr 26 00:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This court ruling is a win for the safety and security of our country. Ending Title 42 would be detrimental to the U.S.","date":"Mon Apr 25 22:02:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation has increased every month since Joe Biden took office.","date":"Mon Apr 25 20:14:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Elon Musk's purchase of Twitter is a major win for free speech. \n\nDo you agree with me that he should reinstate President Trump's Twitter account?","date":"Mon Apr 25 19:02:35 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"73 TRILLION DOLLARS in spending over the next ten years.\n\nPresident Biden's \"plan\" to fix record inflation is to spend a record amount of money. https://t.co/IEDmxdjOGZ","date":"Mon Apr 25 17:37:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I was proud to join my colleagues in sending this letter to Secretary Mayorkas. The Biden Administration needs to make fixing the border crisis a priority.","date":"Mon Apr 25 16:57:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My colleagues and I sent a letter to @twitter calling out the Russian propaganda they are letting spread on their platform.\n\nToday they responded saying they believe in a \"free and open internet.\"\n\nSINCE WHEN?","date":"Fri Apr 22 21:18:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There is an INVASION at our southern border.\n\nWe need stronger border policies not weaker ones.","date":"Fri Apr 22 19:59:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined Kevin Dietz and Tom Jordan on @wjrradio this morning to talk about the #BidenBorderCrisis. Listen below⬇️ https://t.co/bBeMEBUO6c","date":"Thu Apr 21 20:13:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joe Biden has put a welcome mat at our southern border.","date":"Thu Apr 21 18:47:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I had the honor of speaking at the Selfridge Community Council Lunch this week. \n\nI am excited about the possibility of new missions for Selfridge Air National Guard base in the future. https://t.co/ndMqdhC7z4","date":"Thu Apr 21 14:26:57 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Every state in America is a border state in Joe Biden's America.","date":"Wed Apr 20 20:56:48 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Here's your daily reminder that Biden hasn't been to the southern border.","date":"Wed Apr 20 18:20:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"April is National Child Abuse Prevention Month, a time to raise awareness to help prevent child abuse and neglect.\n\nYesterday, I toured St. Clair County Child Abuse/Neglect Council Child Advocacy Center to learn about the work they are doing to protect children in our community. https://t.co/jmkXX7pdaM","date":"Wed Apr 20 17:55:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Men are men. Women are women. Since when is that a radical idea?","date":"Wed Apr 20 16:18:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I recently led a letter calling out Secretary Blinken and his misguided policies https://t.co/yP4j9xNs0U","date":"Wed Apr 20 15:54:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@SecBlinken announced the State Department will now allow U.S. citizens to select \"X\" as their gender on passports. Since when is the State Department in charge of gender identity?\n\nThe Biden Administration needs to get their priorities straight.","date":"Wed Apr 20 15:54:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"You're wrong, @POTUS. \n\nYou're the reason prices are high right now.","date":"Wed Apr 20 13:10:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis is completely out of control. It's clear the Democrats' open border policies don't work.","date":"Tue Apr 19 18:36:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"He is Risen! \n\nHappy Easter, I hope your day is filled with lots of blessings. https://t.co/vc1mFxS09N","date":"Sun Apr 17 13:19:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As the sun sets and night begins, I wish a happy Passover to all who are celebrating this week. https://t.co/aYzmiNM8BR","date":"Fri Apr 15 23:18:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Next week, my staff will be attending veterans outreach events at both the Romeo and Richmond VFW. \n\nAny veteran who need assistance with VA benefits are encouraged to attend. https://t.co/uFYOPHTYe3","date":"Fri Apr 15 18:59:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"\"For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.\" - John 3:16 https://t.co/TjfA3sbYys","date":"Fri Apr 15 12:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This morning, I joined Kevin Dietz and Tom Jordan on @wjrradio to talk about the border crisis and the buses of illegal aliens coming to DC. \n\nCheck it out⬇️ https://t.co/q8JDd9RdN3","date":"Thu Apr 14 21:07:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I was personally sanctioned by the Russian government? I'll wear that badge with pride.","date":"Thu Apr 14 18:54:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I visited with members of my Ag Advisory Council to discuss dairy pricing, wheat regulations and their priorities for the upcoming farm bill. https://t.co/yKSke8FCu9","date":"Thu Apr 14 16:24:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy 74th Birthday to the @USAFReserve! I'm eternally grateful for those who are ready to serve our nation https://t.co/pDBBI9yeAB","date":"Thu Apr 14 15:42:20 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I recently visited the ICE Detroit field office to discuss how the #BidenBorderCrisis is impacting Michigan. \n\nRight now, ICE is dealing with drug trafficking at both the southern and northern border. We need to build the wall and secure our border to protect our communities. https://t.co/QueGBStHy0","date":"Wed Apr 13 23:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I was proud to join my House colleagues in calling out Biden's omission of the Hyde amendment in the FY 2023 budget. https://t.co/UcHbbOvNSa","date":"Wed Apr 13 20:08:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tax dollars should not be funding abortions. Period.","date":"Wed Apr 13 20:08:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was great to attend the Friends of the NRA Dinner in Shelby Township.\n\nOur Second Amendment is under attack like never before, and it's important now, more than ever, that we stand up and protect our constitutional right to bear arms. https://t.co/yIOdwRzxIW","date":"Wed Apr 13 19:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The CDC extends the mask mandate for planes but drops the COVID emergency at the southern border. \n\nCan they even pretend to be following science these days?","date":"Wed Apr 13 16:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The last time the CDC said two weeks, it was two years.","date":"Wed Apr 13 15:08:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Democrats can try to blame everyone else for inflation, but the only ones to blame are themselves and their outrageous spending.","date":"Wed Apr 13 14:29:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Financial literacy is an important part of education.I enjoyed talking with Mr. Brown's class at Lapeer Community High School.The students are participating in the SIFMA Stock Market challenge, a challenge that teaches students how to make important decisions with their money. https://t.co/FGh6jND5Kt","date":"Tue Apr 12 19:22:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#Bidenflation is forcing all Americans to pay significantly more at the grocery store https://t.co/dSzsjvbbfs","date":"Tue Apr 12 17:53:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepDLamborn \n@RepDonaldsPress \n@RepCawthorn \n@RepMikeCarey \n@RepBuddyCarter \n@RepBobGibbs","date":"Tue Apr 12 15:09:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If only @Twitter cared about shutting down Russian propaganda as much as they cared about censoring Republicans","date":"Tue Apr 12 15:09:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm proud to be leading a letter calling out the hypocrisy and lack of action by Twitter https://t.co/GDenUgnVoG","date":"Tue Apr 12 15:09:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joe Biden's out of control spending is causing inflation to skyrocket to 8.5%. The highest it's been since 1981.","date":"Tue Apr 12 13:36:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joe Biden and the Democrats have failed at passing BBB, securing our border, stopping inflation and imposing vaccine mandates on the American people, so now they're trying to take away our guns.","date":"Mon Apr 11 18:59:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Universal background checks will do nothing to lower crime rates. Criminals aren't buying guns from stores, they're buying them on the black market.","date":"Mon Apr 11 18:56:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"POTUS's nomination for ATF director is dangerous for our Second Amendment. Steve Dettelbach wants to take away your right to bear arms by banning \"assault weapons\" and requiring universal background checks.","date":"Mon Apr 11 18:53:11 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is attempting to blame rising crime on the 2nd amendment, rather than the Democrats' anti-police policies.","date":"Mon Apr 11 18:52:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration wants to decommission the USS Detroit after just six years at sea. Listen to my discussion about this wasteful spending with @newsguy760 ⬇️ https://t.co/EvmfS8jOoK","date":"Mon Apr 11 15:44:55 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’ll be joining Fox Report at 6:00 p.m. to discuss Russia’s invasion of Ukraine and the impacts it’s having on the world.","date":"Sun Apr 10 21:56:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Eliminating Title 42 deportations will cause a massive crisis at our southwest border. I joined @RepMMM and 61 of my colleagues in demanding answers on how DHS plans to secure the border if Title 42 is lifted. https://t.co/y78DIrshkO","date":"Sun Apr 10 15:29:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"“Blessed is the King who comes in the name of the Lord! Peace in heaven and glory in the highest!\" -Luke 19:38 \n\nWishing all who celebrate a blessed #PalmSunday https://t.co/WNKQgjgl5V","date":"Sun Apr 10 14:04:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration plans to decommission the USS Detroit and several other ships after just a few years at sea. I'm joining @newsGuy760 on @WJRRadio at 4:18 p.m. to discuss this wasteful spending. https://t.co/iXDq1trOW6","date":"Fri Apr 08 20:17:39 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"How is Judge Jackson supposed to decide Title IX cases if she can’t even define what a woman is?","date":"Fri Apr 08 18:39:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Extending the pause on student loan payments does nothing to move our country forward and out of the pandemic. \n\nAmericans are back to work.\nEnough of the government handouts.","date":"Thu Apr 07 14:49:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was great meeting with She Leads America this morning.\n\nThese women truly know how to empower women through Christ. I am proud of what they are doing for this country. https://t.co/eG3lkgPESm","date":"Wed Apr 06 20:27:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's time to give the power back to the parents. https://t.co/b9VAC8d6D5","date":"Wed Apr 06 18:17:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined my colleagues in sending a letter to the House demanding it terminates its contract with Citi. \n\nCongress should not be sending taxpayer dollars to a company that pays for its employees' abortions.","date":"Wed Apr 06 16:44:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"General Milley said that the war with China will be predominantly fought by our air and maritime forces.\n\nWhy then does the Biden Defense budget fail to provide the Air Force with the aircraft they need?\n\nVIDEO FROM HEARING https://t.co/C9NA4EcgMT","date":"Tue Apr 05 21:58:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Does the Biden Administration believe the pandemic is over or not? They're ending Title 42, but extending the pause on student loans.\n\nFollow the science, not the political science!","date":"Tue Apr 05 20:03:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, on Gold Star Spouses Day, we honor the loved ones of military servicemembers who made the ultimate sacrifice. Thank you to the spouses and family members who also sacrificed so much for our country. https://t.co/Chymkb0pzL","date":"Tue Apr 05 15:30:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Secretary Mayorkas is FINALLY meeting with myself and other members of the House. \n\nI'm going to ask him why this Administration is ending Title 42, and if they'll be dropping all other COVID restrictions.","date":"Tue Apr 05 14:00:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The 2022 Congressional Art Competition is officially underway. All high school students in #MI10 are encouraged to participate. The deadline to submit artwork is April 29th. Visit my website to learn more: https://t.co/288vtFkLmW https://t.co/95iYOKp4gS","date":"Mon Apr 04 22:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Ending Title 42 is going to cause a massive rush of illegal aliens and drugs at the border like we've never seen. \n\nThe Biden Administration is putting American lives at risk with this disastrous decision.","date":"Mon Apr 04 18:49:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We went from an administration that put America first to one that puts America last.","date":"Mon Apr 04 17:09:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our country is in a constant state of crisis under this President, and the Democrats decided now is the time to try to legalize marijuana. Where are their priorities?","date":"Fri Apr 01 12:35:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s great to have more constituents visiting Washington now that the Capitol is open for tours! Thanks to Dennis and Carol from Chesterfield for coming in for a tour. Hope you enjoyed your birthday in DC, Dennis! https://t.co/6KzLmgVjOP","date":"Thu Mar 31 20:55:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Instead of taking the necessary steps to make America energy independent, President Biden is tapping into oil reserves to try to artificially bring down prices. \n\nThis is a temporary solution to a catastrophic problem.","date":"Thu Mar 31 16:29:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Ending Title 42 would be disastrous for not only our border states, but the entire country. We're already seeing record border crossings, even with this policy in place. \n\nWithout it, our country is in real trouble.","date":"Wed Mar 30 19:21:47 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, with my support, the House passed the Don Young Coast Guard Authorization Act of 2022, which authorizes new ice cutters for the Great Lakes region. \n\nThis bill will help alleviate flooding on the St. Clair River.","date":"Wed Mar 30 17:42:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Second this week? This month? This year? I can't even keep track of how many vaccines they're trying to force on the American people","date":"Wed Mar 30 16:48:22 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy #NationalDoctorsDay! Today we recognize all of the hardworking physicians for their dedication, service and care. https://t.co/3OgEh3e9gz","date":"Wed Mar 30 15:49:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I am saddened that 5 civilians were killed in terrorist attacks in Israel today. The increased violence against Israelis during the past two weeks is alarming. These attacks must be stopped.","date":"Wed Mar 30 00:21:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's National Mom &amp; Pop Business Owners Day! Let's celebrate today by supporting the local businesses that make our communities unique. https://t.co/HvVemMKXn5","date":"Tue Mar 29 22:30:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"More shutdowns are the last thing our country needs right now. Americans are sick and tired of the political science Fauci is following.","date":"Tue Mar 29 20:46:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, on #NationalVietnamWarVeteransDay we honor the millions of Americans who served in Vietnam, and we thank them for their service and sacrifice. https://t.co/U5qMG5wdSW","date":"Tue Mar 29 18:00:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joining @wjrradio at 10:05 a.m. to discuss the #BidenBorderCrisis and the horrific impacts ending Title 42 would have on our country. https://t.co/iXDq1trOW6","date":"Tue Mar 29 13:59:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Last Friday, my staff attended the Macomb Chamber Economic Forecast luncheon. \n\nAs #Bidenflation continues to take hold of our economy, the local business community must come together and find innovative ways to move forward in 2022. https://t.co/2Ogb1UkqL2","date":"Mon Mar 28 19:44:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Summary of the #BidenBudget: Spend more.","date":"Mon Mar 28 18:53:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined several community and business leaders Friday for the 14th annual State of St. Clair County. I enjoyed giving an update on the work I’m doing in Washington to better the lives of those in this wonderful community. https://t.co/kKj4QSpraw","date":"Sun Mar 27 19:09:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was great to tour Barron Industries recently to see the important supplies it manufactures for the aerospace, defense, energy and manufacturing industries. \n\nDuring my tour, I had a chance to give a DC update to their workforce and answer questions their employees had. https://t.co/HmZPYhgwxC","date":"Sat Mar 26 16:17:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I had the honor of joining some of our local farmers for Dinner on the Farm!\n\nI enjoyed hearing directly from farmers on the issues impacting them, and what we can do in Washington to ensure farmers have the resources they need to continue putting food on our tables. https://t.co/Vt9s8bPBhq","date":"Fri Mar 25 17:03:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis is out of control.\n\nWe need to build the wall to secure the border and stop this surge of illegal aliens from flooding over the southern border.","date":"Fri Mar 25 15:06:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today we honor and pay tribute to all of the brave men and women who served our country with valor and were awarded the prestigious Medal of Honor. \n\nThank you for your service and sacrifice. https://t.co/4oGGD5pfgu","date":"Fri Mar 25 13:51:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m proud to receive the Waste Warrior award from @WhiteCoatWaste for my work to fight cruel, dangerous and unnecessary taxpayer-funded animal experiments in the U.S. and abroad, especially in adversarial countries like Russia and China. https://t.co/y38wh4BoVY","date":"Thu Mar 24 22:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I enjoyed joining the Council for Economic Growth this week to discuss the business outlook for 2022. Inflation and supply chain issues continue to plague our economy, but I'm encouraged by local businesses that are bouncing back after a tough few years. https://t.co/WBd3i6dZFY","date":"Thu Mar 24 20:53:49 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Weakness breeds aggression. \n\nKim Jong Un sees how weak President Biden is and took advantage of this weakness by testing a suspected ICBM.\n\nAmerica needs a strong leader now, more than ever.","date":"Thu Mar 24 15:13:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our tax dollars should never fund inhumane animal research in countries that threaten our national security.\n\nThis is commonsense. https://t.co/kXAamKkG2Z","date":"Wed Mar 23 20:13:48 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Under no circumstance should #Iran's IRGC be removed from the foreign terror list. They are a threat to the security of the US and our allies.","date":"Tue Mar 22 19:45:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy National Ag Day! Michigan is home to more than 51,000 farms that produce more than 300 different commodities. I’m thankful to each and every farmer in #MI10 that puts food on our tables. https://t.co/aZkCOKjcmD","date":"Tue Mar 22 15:49:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I voted to suspend normal trade relations with Russia. Listen to my interview on @WJRRadio ⬇️ https://t.co/gfohiYtd1s","date":"Sun Mar 20 17:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy first day of spring! I hope we get warmer weather in #MI10 with the new season. https://t.co/PRYAJYF4Vd","date":"Sun Mar 20 13:57:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, my office held a tax seminar to help answer your questions as you finalize your tax returns! Thanks to everyone who attended! https://t.co/po9BOerrhN","date":"Sat Mar 19 22:00:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined @CapitolReport to discuss #China's increased aggression and the inflation crisis here at home. https://t.co/5prQalNCPd","date":"Sat Mar 19 16:27:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congressman Don Young was a legend in Congress and his passing is a major loss for Washington. I enjoyed meeting Don and getting to know him in recent months. Alaska was lucky to have him as their representative for nearly 50 years. He will be dearly missed.","date":"Sat Mar 19 02:21:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Iran has shown us time and time again that they are no friend of the U.S. \n\nThank you, @RepJimBanks for introducing this resolution to shed light on @POTUS' failure.","date":"Fri Mar 18 18:02:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tax season is upon us! I'll be hosting a tax seminar alongside Assistant Professor of Accounting Jenn Forsyth. \n\nCome join us as we go over some of the biggest questions surrounding filing your taxes and answer any questions you may have.\n\nhttps://t.co/SJjuG69Ewh https://t.co/YVSPfIDWaN","date":"Thu Mar 17 19:10:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy St. Patrick's Day! I hope everyone has a safe and fun day full of luck. Sláinte! ☘ https://t.co/Mer8yoFiKn","date":"Thu Mar 17 15:28:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I testified in front of the House Veterans Affairs Committee Subcommittee on Health on my bill, H.R. 5754, the Patient Advocate Tracker Act. This bill would create an online portal where veterans can track the status of formal complaints they file through the VA. Watch below ⬇ https://t.co/xBuBlkECOP","date":"Thu Mar 17 12:57:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. should not be funding Russian labs that experiment on innocent cats. \n\nMy commonsense AFAR Act would prevent our tax dollars from going to animal research being done by our adversaries.","date":"Wed Mar 16 19:40:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Enjoyed meeting with this Shelby Township business today! \n\nMichigan's defense corridor is key to producing military equipment that is key to our national defense, like the F-35.","date":"Wed Mar 16 18:39:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"For the peace and prosperity of the Ukrainian people, we must continue to hit Russia with swift and severe sanctions. https://t.co/7keqFWyKPI","date":"Wed Mar 16 14:17:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What a moving speech from President Zelensky. \n\nI agree with him that we need to continue sanctioning Russia and all of its leaders to try to stop this horrific war.","date":"Wed Mar 16 13:42:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m at President Zelensky’s virtual joint address to Congress and will keep you updated on what he asks for from the U.S. https://t.co/mOtSFReSP3","date":"Wed Mar 16 13:04:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is using TikTok dancers to try and spout propaganda that POTUS is not to blame for inflation and skyrocketing gas prices. \n\nThey're losing more and more credibility and respect by the minute.","date":"Tue Mar 15 19:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The numbers of illegal aliens flooding through our southern border is continuing to skyrocket due to President Biden's failure as a leader. \n\nIn February, CBP apprehended 164,973 people at our southern border. What is it going to take for Biden to get this crisis under control?","date":"Tue Mar 15 17:15:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The numbers don't lie. \n\nInflation was happening thanks to the Biden Administration long before Russia invaded Ukraine.","date":"Tue Mar 15 15:54:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepNancyMace @RepBrianMast @RepHarshbarger @RepCarlos @RodneyDavis","date":"Mon Mar 14 21:06:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm demanding @POTUS stop sending U.S. taxpayer dollars to Russian labs to fund gruesome and cruel experiments on animals. Read more below ⬇\n\nhttps://t.co/cvAztwAO9s","date":"Mon Mar 14 21:06:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Recently, I joined members of the Blue Water Chamber of Commerce and Mayor of Port Huron Pauline Repp in celebrating the grand opening of McCormick Conner Street Pub in Port Huron. It’s great to see new small businesses opening across the region! https://t.co/uTvqn4GqcD","date":"Mon Mar 14 20:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Russia is attacking our allies in Ukraine, China is prepping to attack our ally Taiwan, and Iran is attacking Americans in Iraq. \n\nIs this what a Biden foreign policy looks like? Is this what VP Harris said the American people voted for?","date":"Mon Mar 14 19:46:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I call on President Biden to immediately halt negotiations with #Iran","date":"Sun Mar 13 19:52:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The IRGC is claiming responsibility for the attack targeting the US consulate in Erbil. \n\nIt's clear #Iran is no friend to the United States, and Biden should not be negotiating with terrorists.","date":"Sun Mar 13 13:53:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Heads up #MI10, it's time to spring forward again. Don't forget to set your clocks forward an hour tonight. https://t.co/pOw8oqKNVk","date":"Sun Mar 13 01:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Seeing reports of Iran-backed attacks on the US consulate in Iraq. This aggression shows we should absolutely end all Iran Nuclear Deal negotiations now. We must also never buy Iranian oil.","date":"Sun Mar 13 00:01:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"One of President Biden’s first actions in office was to shut down the Keystone XL pipeline. \n\nAs much as gas prices right now are a result of Putin’s war, they’re also a direct result of Biden’s poor policies.","date":"Fri Mar 11 17:02:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"They should have never gotten rid of them in the first place. \n\nhttps://t.co/KpdBoUUOpS","date":"Thu Mar 10 22:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrat logic: COVID can reach you on planes, trains and automobiles, but no longer in restaurants, stores and venues.","date":"Thu Mar 10 21:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration must believe that COVID runs on their timeline. \n\nWhere's the science, reasoning and CONSISTENCY behind extending the transportation mask mandate another 30 days?","date":"Thu Mar 10 19:59:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans can't afford to live in Joe Biden's America. \n\nInflation is now at 7.9%, the highest since 1982. \n\nWe need to get our spending under control now.","date":"Thu Mar 10 14:16:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"When @VP gets back from Poland, she should head straight for the southern border.","date":"Wed Mar 09 23:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I introduced the PAGE Act to prohibit the creation of and destroy any existing databases that track the vaccination status of federal employees. \n\nThis type of gross government overreach is unacceptable and I will always fight for your freedoms.\n\nhttps://t.co/nGudqkkTaL","date":"Wed Mar 09 22:44:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepScottPerry @RepHuizenga @RepRutherfordFL @replouiegohmert @RodneyDavis","date":"Wed Mar 09 22:44:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our veterans deserve the absolute best, and @AmericasVetDogs is providing just that. \n\nIt's always a great day when they stop by with their service dogs in-training! https://t.co/8ESzxrQs1V","date":"Wed Mar 09 20:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm relieved the Lapeer County Sheriff's Deputy who was shot this morning is now in stable condition. \n\n#MI10's law enforcement put their lives on the line every day to protect us, and I'm very grateful for their sacrifice.\n\nhttps://t.co/shvH7CpCo5","date":"Wed Mar 09 19:28:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Watch below for a look at the 2700 page bill Democrats expect me to read and vote on in less than 12 hours! This is ridiculous. https://t.co/Bc1oNWCsrL","date":"Wed Mar 09 16:18:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Everything President Biden is saying that he's accomplished with Russia is all well and great, but it's a day late and a dollar short.","date":"Tue Mar 08 17:38:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m thrilled President Biden is FINALLY banning Russian oil, but he needs to make America energy independent NOW. https://t.co/bfnyuNjAfa","date":"Tue Mar 08 15:25:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans shouldn't be relying on any other country's oil besides America's.","date":"Mon Mar 07 22:59:47 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS, when are you going to stop letting Putin walk all over you and start standing up for American energy independence?","date":"Mon Mar 07 22:15:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Gas prices are surging all over #MI10. \n\nI've heard your concerns and rest assured, I'm doing everything within my power to call on Biden to make America energy independent again!","date":"Mon Mar 07 21:28:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's time to stop funding Russia's attack on Ukraine and start tapping into America's extensive oil resources.\n\nhttps://t.co/3E2JhumBha","date":"Mon Mar 07 19:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm so glad the science has finally caught up to the politics and mask mandates are being dropped all across the country.","date":"Mon Mar 07 18:02:47 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to Richmond Mayor Tim Rix and City Manager Jon Moore for taking the time to sit down with me last week to discuss exciting new plans for the city, including the Richmond Auditorium. https://t.co/nuy3qQBgEV","date":"Mon Mar 07 16:47:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's always great to meet with members of the Michigan Association of Broadcasters! \n\nLocal radio is essential to providing our communities with access to what's happening in their neighborhoods. https://t.co/v3s0P0rQmW","date":"Sat Mar 05 20:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@VP thinks banning abortion at 15 weeks is extreme. \n\nShe's wrong.\n\nKilling an innocent life through abortion is extreme and despicable.","date":"Sat Mar 05 17:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m disgusted our tax dollars are funding inhumane research on cats in Russian state-run labs. Congress must pass my AFAR Act to stop funding animal research in foreign countries that are our adversaries.  https://t.co/yNPiCUTHsR","date":"Sat Mar 05 16:17:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thanks to Mike, Principal for St. Clair Middle School, and Steven, Principal for Sandusky High School, for visiting my office to discuss the needs of Michigan's teachers, students and families. https://t.co/nVBTN8dIvv","date":"Fri Mar 04 22:00:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I introduced the AFAR Act to stop your taxpayer dollars from funding animal testing in countries like Russia and China. \n\nIt's critical, now more than ever, that we stop funding these inhumane practices. https://t.co/PqUvt7PR3B","date":"Fri Mar 04 19:56:16 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is the first time I agree with @SpeakerPelosi, the U.S. MUST stop importing oil from Russia immediately.","date":"Fri Mar 04 19:05:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy 107th Birthday to the U.S. @navy_reserve! Thank you for your service to our country and keeping our Navy prepared for any obstacles. https://t.co/JolclX7xwH","date":"Thu Mar 03 19:59:55 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#China is complicit in Putin’s war in Ukraine. \n\nThe U.S. and rest of the world needs to stand up against the inhumanity and continued violations of international law. \n\nhttps://t.co/w8mlVxois3","date":"Thu Mar 03 16:03:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden's State of the Union was a crisis in and of itself. \n\nWhen is our country going to actually get back on the right track? https://t.co/qJMYqQkbuI","date":"Thu Mar 03 14:34:11 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Great Lakes Day! \n\nMichigan is lucky to be surrounded by four of the Great Lakes and #MI10 is home to some of the most beautiful stretches of Lake Huron. https://t.co/Cm0IEnc966","date":"Wed Mar 02 22:45:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Wishing everyone who observes a very blessed Ash Wednesday. \n\n\"For dust you are and to dust you shall return.\" Genesis 3:19 https://t.co/FoCQD7HHbf","date":"Wed Mar 02 15:49:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"91 pauses for applause and I couldn't find a single reason to cheer for our failure of a President. #SOTUinCrisis","date":"Wed Mar 02 03:20:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The State of the Union is weak because of your leadership, President Biden. #SOTUinCrisis","date":"Wed Mar 02 03:13:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@SpeakerPelosi must be excited that POTUS is actually listening to the talking points she likely sent along. #SOTUinCrisis","date":"Wed Mar 02 03:08:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The best way to stop the flow of illegal drugs is to #BuildTheWall","date":"Wed Mar 02 03:02:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The same man who let two million illegal aliens cross our border is now talking about border security? Actions speak louder than words. #SOTUinCrisis","date":"Wed Mar 02 03:00:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"BUILD THE WALL #SOTUinCrisis","date":"Wed Mar 02 02:59:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden wants to secure our border? This is a first. #SOTUinCrisis","date":"Wed Mar 02 02:59:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden wants to keep guns out of the hands of people on the terror watch list, but he has no problem with DHS releasing those same terrorists into your communities. #SOTUinCrisis","date":"Wed Mar 02 02:57:38 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden may want to send a memo to his party. They want to defund the police. #SOTUinCrisis","date":"Wed Mar 02 02:56:39 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Why should anyone on the terror watch list get released into our communities by the Biden Administration? #SOTUinCrisis","date":"Wed Mar 02 02:56:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrat run cities have been overrun by crime thanks to failed leadership by those trying to defund the police. #SOTUinCrisis","date":"Wed Mar 02 02:54:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden and his party want to defund the police. #SOTUinCrisis","date":"Wed Mar 02 02:54:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The last thing our country needs right now is another COVID bill filled with wasteful spending. #SOTUinCrisis","date":"Wed Mar 02 02:52:16 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America doesn't need tests or masks. America needs to get back to normal. #SOTUinCrisis","date":"Wed Mar 02 02:51:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden finally admits we can end unnecessary shutdowns. I've been saying this for more than a year! #SOTUinCrisis","date":"Wed Mar 02 02:51:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"POTUS hasn't been ready to respond to any of the crises we've faced in the past year. Who is he kidding? #SOTUinCrisis","date":"Wed Mar 02 02:50:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is taking credit for COVID vaccines that were developed by President Trump under #OperationWarpSpeed","date":"Wed Mar 02 02:47:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We do not need to build a better America, we need to make the America we live in great again. #SOTUinCrisis","date":"Wed Mar 02 02:46:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden claims he’s a capitalist, but acts like a socialist. #SOTUinCrisis","date":"Wed Mar 02 02:44:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"In 2021, inflation cost the average worker nearly two paychecks and $5,000 per year for the average family. #SOTUinCrisis","date":"Wed Mar 02 02:42:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It sounds a lot like President Biden is trying to get his failed #BuildBackBroke plan passed yet again.","date":"Wed Mar 02 02:41:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Energy costs will be cut when America becomes energy independent.  \n\nNot through wasteful climate legislation. #SOTUinCrisis","date":"Wed Mar 02 02:39:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"U.S. production. \n\nU.S. oil. \n\nU.S. strength. \n\nNone of this will happen under Biden. #SOTUinCrisis","date":"Wed Mar 02 02:35:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden claims he wants to make products in America, but all we've seen this year is him putting America last. #SOTUinCrisis","date":"Wed Mar 02 02:35:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"POTUS claims his top priority is getting prices under control. \n\nAn easy way to do that is to stop all the unnecessary mandates he's put in place. #SOTUinCrisis","date":"Wed Mar 02 02:33:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thanks to the failed policies of President Biden, inflation is the highest it’s been in 40 years. #SOTU","date":"Wed Mar 02 02:31:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is talking about transforming America, but what we need now more than ever is to fix the country he's destroyed during his year in office. #SOTUinCrisis","date":"Wed Mar 02 02:30:48 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"$6 billion a year to keep America safe and secure and POTUS has undone that safety in a year. #SOTUinCrisis","date":"Wed Mar 02 02:30:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"All President Biden is doing is Building Back Broke #SOTUinCrisis","date":"Wed Mar 02 02:27:55 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Even the Democrats in the room know that President Biden has been a FAILURE as President. \n\nSomeone must be holding a clap sign in the back. #SOTUinCrisis","date":"Wed Mar 02 02:23:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Families are living paycheck to paycheck because of the outrageous inflation caused by Biden's policies! #SOTUinCrisis","date":"Wed Mar 02 02:22:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Instead of releasing oil from our reserves, we need to continue building the Keystone XL Pipeline and make America energy independent! #SOTUinCrisis","date":"Wed Mar 02 02:21:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Ukraine deserves better than President Biden's empty words and promises. #SOTUinCrisis","date":"Wed Mar 02 02:19:59 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. is now closing American airspace to Russian flights several days after the invasion. \n\nPresident Biden, always a day late and a dollar short. #SOTUinCrisis","date":"Wed Mar 02 02:17:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden says he spent months working to confront Putin, but waited until he invaded Ukraine to take any action? #WeakLeadership","date":"Wed Mar 02 02:15:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Ukrainian people would have an easier time facing the Kremlin if POTUS had acted earlier and stronger than he did. #SOTUinCrisis","date":"Wed Mar 02 02:14:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"COVID's finally over now that it's convenient for Democrats. #SOTUinCrisis","date":"Wed Mar 02 02:13:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm not sure what's more of an embarrassment, the amount of crises POTUS will have to defend tonight or the nearly empty House floor there to witness it. #SOTUinCrisis","date":"Wed Mar 02 02:06:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#SOTUinCrisis","date":"Wed Mar 02 02:04:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"No better way to improve your failing ratings than to finally tell everyone they can take their masks off on national television.","date":"Wed Mar 02 02:00:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to @IlirDugolli, Ambassador of Kosovo, for meeting with me today. \n\nWe had a productive conversation about the turmoil in Europe and Kosovo's stance to #StandwithUkraine. https://t.co/ckkyGPKl2O","date":"Wed Mar 02 00:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined several media outlets this morning to discuss @POTUS' #SOTU this evening. \n\nThe only way this will be a successful address is if he doesn't sugar coat his crises and presents America with an actual plan for stopping all the crises our country is facing. https://t.co/iCJ4zCwklD","date":"Tue Mar 01 22:47:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans deserve to be energy independent. \n\nAlong with all of his failures over the past year, I hope @POTUS includes a plan for energy independence in his #SOTU. \n\nThank you @RepRickAllen for leading this letter.","date":"Tue Mar 01 21:28:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I stand with my colleague @RepSpartz and I stand with the people of Ukraine. https://t.co/IKcZkvL8N2","date":"Tue Mar 01 20:57:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@Twitter still allows @KremlinRussia_E to be on its platform, when he's literally breaking international law invading other countries. \n\nMeanwhile, President Trump and other conservative voices have been censored and kicked off the platform. \n\nThis makes no sense.","date":"Tue Mar 01 17:55:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Belarus is joining Russia in invading Ukraine. \n\nWe must immediately put strong, crippling sanctions on Putin's puppet and stop this war now.","date":"Tue Mar 01 16:45:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The State of the Union under President Biden has been disastrous. It will be interesting to see how he tries to spin it for the American people tonight.","date":"Tue Mar 01 15:43:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats' timing is impeccable. \n\nSuddenly, the day before the State of the Union, masks are no longer required on the House floor.","date":"Mon Feb 28 19:53:57 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As harsh as these sanctions are, it's time for America to take a stand and hit Russia where it hurts: oil.","date":"Mon Feb 28 16:00:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Nuclear warfare is a threat to the safety of the entire world. \n\nI’m concerned by Putin’s continued aggression despite tough sanctions being placed on him from the US and other world leaders.","date":"Sun Feb 27 15:07:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m glad to see these additional sanctions, but fear it’s too late for them to have a real impact. \n\nUkrainians are already suffering.","date":"Sun Feb 27 01:08:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There's a war breaking out in Ukraine thanks to Putin, and not surprisingly President Biden is headed to Delaware for the weekend. \n\nAmerica needs real leadership right now, not a president who is always on vacation.","date":"Fri Feb 25 22:39:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm glad the U.S. is finally sanctioning Vladimir Putin. This should have happened weeks ago.","date":"Fri Feb 25 21:59:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm proud to #StandWithUkraine https://t.co/1GgweF9VcR","date":"Fri Feb 25 19:24:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's long past the time for diplomatic talks with Russia. \n\nPutin should have began these talks before invading Ukraine.","date":"Fri Feb 25 19:01:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation has skyrocketed under President Biden, and it will continue until @POTUS gets this crisis under control.","date":"Fri Feb 25 18:16:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden set the precedent for his weak presence on the world stage with Afghanistan. He's solidifying it with Ukraine and Russia. Will Taiwan be next?","date":"Fri Feb 25 17:32:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden admitted his sanctions wouldn't do anything to stop Putin from invading Ukraine, why is he now saying they'll prevent Russia from invading other countries?","date":"Thu Feb 24 19:07:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. needs to sanction Vladimir Putin IMMEDIATELY.","date":"Thu Feb 24 19:04:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If President Biden was doing everything within his power to prevent high prices at the pumps for Americans, then he wouldn’t have shut down the Keystone Pipeline.","date":"Thu Feb 24 18:59:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As the world’s greatest defender of democracy, the delay in response to Russia’s declaration of war is absolutely embarrassing.","date":"Thu Feb 24 18:52:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This Administration waited until Russia attacked Ukraine to impose sanctions that would actually cripple the country. They’re doing this completely out of order.","date":"Thu Feb 24 18:50:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden says he knew for MONTHS that Russia was planning to attack Ukraine and still made no strong move to prevent them from doing so.","date":"Thu Feb 24 18:50:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Great move by the UK. The U.S., NATO, and every country around the world should follow suit.","date":"Thu Feb 24 18:34:28 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America must impose sanctions that completely cripple Russia. \n\nThat includes targeting Russian energy. \n\nhttps://t.co/3E0J2pYqYg","date":"Thu Feb 24 18:31:03 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is an incredibly dire situation unfolding in Ukraine.\n\nhttps://t.co/j55bcqZdHx","date":"Thu Feb 24 18:20:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Read my statement on the situation in Ukraine ⬇ https://t.co/bHsV8XX2oF","date":"Thu Feb 24 17:48:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Vladimir Putin is a delusional dictator with a dangerous fear of democracy.","date":"Thu Feb 24 16:36:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans should be angry. \n\nThe entire world should be angry right now.","date":"Thu Feb 24 15:59:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you or someone you know is stranded in Ukraine, my office stands ready to help. \n\nPlease reach out to our caseworkers at 586-697-9300.","date":"Thu Feb 24 15:24:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Weak leadership.\n\nWeak sanctions. \n\nNo surprise.","date":"Thu Feb 24 14:52:38 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The EU and NATO must act swiftly and decisively. \n\nImmediately freeze the assets and ban entry for all Kremlin oligarchs and family members now.","date":"Thu Feb 24 04:10:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Putin is a ruthless dictator, yearning for the recreation of the Soviet Union. \n\nAmerica stands with the millions of Ukrainians against this blatant Russian aggression and violations of international law. #StandwithUkraine","date":"Thu Feb 24 03:48:03 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"POTUS and his administration keep claiming they are defenders of democracy, and yet, they just allowed a tyrant to steamroll over a democracy in Europe.","date":"Thu Feb 24 03:42:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Putin’s actions are not only a threat to millions of innocent civilians in Ukraine, but a direct threat to NATO and America’s own national security and assets in Europe.","date":"Thu Feb 24 03:38:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s clear the weak sanctions President Biden put on Russia didn’t deter Vladimir Putin from invading Ukraine. \n\nWe need to impose crippling sanctions on the Russian government, including Putin immediately.","date":"Thu Feb 24 03:38:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There are absolutely no winners in war. \n\nVladimir Putin’s decision to begin this will not soon be forgotten by innocent Ukrainians nor the rest of the world.","date":"Thu Feb 24 03:30:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Vladimir Putin saw how weak President Biden has been as a world leader and took complete advantage of it. \n\nThis will be yet another crisis to add to his failing resume.","date":"Thu Feb 24 03:28:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@KenCalvert @RepAndyBiggsAZ @replouiegohmert @RepHuizenga @RepMcClintock @RepMaryMiller @RepTenney @RepDanBishop @RepNancyMace @congbillposey @RepTroyNehls @RepMullin @RepCloudTX @RepFranklin @RepCawthorn @RepLaMalfa @RepBoebert","date":"Wed Feb 23 19:23:59 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I sent a letter alongside 17 of my colleagues to @SpeakerPelosi demanding she stop barring our constituents from accessing the halls of Congress because of her own lack of trust in the American people. Read below ⬇ https://t.co/b2ROCKfirS","date":"Wed Feb 23 19:23:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats hate walls at the southern border, but love walls around the U.S. Capitol.","date":"Wed Feb 23 18:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Increased gas prices, inflation and supply chain issues were around long before the crisis in Ukraine. \n\nThey're a direct result of President Biden's failed policies over the past year.","date":"Wed Feb 23 17:04:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to St. Clair Community College for giving me a tour of their facilities! \n\nIt was great to learn more about their robust nursing program and meet with the women’s basketball team. https://t.co/87lrCl2OSe","date":"Tue Feb 22 22:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America needs to be energy independent. \n\nWe wouldn't have to worry about instability abroad if President Biden allowed for American energy independence!","date":"Tue Feb 22 21:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden taking credit for halting Nord Stream 2 is a joke since he's the one who let it go ahead with no sanctions.","date":"Tue Feb 22 20:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Vladimir Putin is taking complete advantage of President Biden's weakness on the world stage. \n\nAmerica has turned into an absolute laughing stock under his \"leadership.\" \n\nhttps://t.co/9ohnDt1Y7W","date":"Tue Feb 22 20:10:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Instead of owning up to the fact that they've stunted the growth of our children over the past two years, the CDC is just lowering their standards for early childhood milestones.","date":"Tue Feb 22 17:47:43 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm glad to see Germany is halting the permits for the Nord Stream 2 pipeline with Russia. \n\nThis pipeline shouldn't have been started in the first place.","date":"Tue Feb 22 15:27:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Presidents’ Day! 🇺🇸\n\n“Freedom is never more than one generation away from extinction. We didn't pass it to our children in the bloodstream. It must be fought for, protected, and handed on for them to do the same.” - Ronald Reagan https://t.co/A7r3xadmcu","date":"Mon Feb 21 15:53:35 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@VP has failed to secure our southern border. \n\nWhat makes her qualified to help secure Ukraine’s borders?\n\nhttps://t.co/4Oeh9hTR7D","date":"Fri Feb 18 21:31:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm excited that President Biden responded to our letter from January and has approved the sale of tanks to Poland. This is a great move to help reinforce NATO during this tumultuous time.","date":"Fri Feb 18 17:56:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Jim Hagedorn served the people of Minnesota's first district well and I am incredibly saddened to learn of his passing. \n\nI am praying for his family, friends and loved ones during this difficult time.","date":"Fri Feb 18 15:12:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Listen to my interview on @wjrradio below to hear about how President Biden's DHS is trying to label freedom-loving Americans as terrorists and have their neighbors turn them in for it ⬇ https://t.co/PeliPfRCrg","date":"Thu Feb 17 21:58:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrat logic: Everyone who disagrees with them is a domestic terrorist","date":"Thu Feb 17 20:24:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The state of Michigan is finally listening to the people and lifting its unnecessary mask mandate. \n\nIt's time for the rest of America to follow suit and stop playing political games with our freedom.","date":"Wed Feb 16 23:41:49 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to @RepFredUpton, @RepHuizenga, @RepJackBergman, @RepMeijer, @RepMoolenaar and @RepWalberg for joining me in getting answers for the people of Michigan.","date":"Wed Feb 16 22:21:56 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm demanding answers from Homeland Security Secretary Alejandro Mayorkas on the criminal aliens and drugs coming over the southern border and ending up in Michigan. Read Below ⬇️ https://t.co/KnP6zTut3r","date":"Wed Feb 16 22:21:56 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is proving again and again that he is incapable of handling America's foreign affairs and national security.","date":"Wed Feb 16 20:29:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's mid-February and ICE STILL hasn't released their annual report for FY21. \n\nWhat are they hiding from the American people?","date":"Wed Feb 16 17:58:36 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's time for ICE &amp; CBP to present Congress with a little truth, transparency and consistency. \n\nI'd personally love to hear from them on what they're doing to prevent the #BidenBorderCrisis from worsening.","date":"Tue Feb 15 22:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"No American should ever face restrictions when fleeing from a potential war zone. \n\nPresident Biden is proving again and again that he doesn't care about Americans' well-being.","date":"Tue Feb 15 22:15:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is massively overstepping by requiring Americans in Ukraine to be vaccinated prior to evacuating to Poland. \n\nNot even Poland is requiring vaccinations for Americans! \n\nIt's almost like Biden WANTS to repeat his disastrous performance in Afghanistan.","date":"Tue Feb 15 21:36:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’ll be joining @seanspicer &amp; @LyndsayMKeith at 6:30 p.m. on #spicerandco to discuss my first year in office and what I plan to accomplish in 2022. \n\nTune in to @newsmax!\n\nhttps://t.co/8C7RuLfK2U","date":"Mon Feb 14 22:57:34 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"When you dig into that box of chocolates with your sweetheart today, remember the sugar in your candy was likely grown in Michigan! https://t.co/uK6x70Rk8P","date":"Mon Feb 14 20:37:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Valentine's Day! Love is in the air and so is rising inflation ♥💸\n\nhttps://t.co/48gH9Fz5AL","date":"Mon Feb 14 16:31:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s past time for us to sanction leaders of the #CCP. China’s aggression toward #Taiwan, treatment of the #Uyghurs and human rights abuses in #HongKong should never be tolerated. \n\nListen to my interview with @BreitbartNews ⬇️ https://t.co/j3LeFvOlSe","date":"Sun Feb 13 19:33:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is a weak leader who time and time again abandons Americans who are in danger.","date":"Fri Feb 11 20:16:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I have no faith in Secretary Mayorkas' leadership. DHS needs a new secretary that will strengthen our border and protect our national security.","date":"Fri Feb 11 16:16:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Vaccine mandates are going to cripple our supply chain.\n\nThe Democrats can blame freedom loving truck drivers, but the real blame is on the vaccine requirements at the border.","date":"Fri Feb 11 14:16:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Americans are fed up with government mandates and it’s time for the Biden Administration to listen to the people.","date":"Fri Feb 11 14:12:11 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s past time we end proxy voting and reopen the People’s House to the public.","date":"Fri Feb 11 00:43:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s no surprise inflation surged to a 40 year high. The outrageous spending in Washington needs to stop now. https://t.co/P55nMkIePs","date":"Thu Feb 10 23:20:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I enjoyed visiting with Secretary Betsy DeVos and discussing the issues our education system is facing. I am working hard on the @EdLaborGOP Committee to ensure that students have the tools they need to succeed. https://t.co/TKGTHNi7gJ","date":"Thu Feb 10 22:25:08 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Last night, my staff attended the Italian American Chamber monthly meeting. I wish I could have joined you all, but unfortunately I am in DC fighting the Biden Administration’s horrific government overreach. https://t.co/tg8as6psRF","date":"Thu Feb 10 20:44:05 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is sending a message loud and clear to the world. America’s borders are open and he will do NOTHING to stop you from illegally crossing our border. We need to build the wall and bring back law and order in our country. https://t.co/qTTTSXQAVA","date":"Thu Feb 10 16:27:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#China is one of the biggest threats to the safety and security of the world. Sanctioning leaders of the #CCP is a commonsense way to show we are sick and tired of their aggressive, bully-like tactics. Read more about my Stop CCP Act ⬇️\nhttps://t.co/9qRxXFuugK","date":"Wed Feb 09 22:50:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our country is facing a drug pandemic like never before.\n\nIn FY21, @CBP seized enough fentanyl to kill EVERY American nearly 7 times. https://t.co/EkZ3UAaIwz","date":"Wed Feb 09 14:30:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Dr. Fauci's funding of research using aborted fetal tissue is disgusting and indefensible! https://t.co/sotYtP2ReD","date":"Tue Feb 08 22:29:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Is this really the solution to end our country's drug pandemic? \n\nWhere's the logic behind the Biden Administration's decisions these days? https://t.co/zrDTxEYRB6","date":"Tue Feb 08 18:12:28 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden's own son is profiting from his close ties to China and the #CCP. \n\nIt's no wonder he is so weak on #China, one of the biggest threats to America and the world.  https://t.co/vxLbYe9b8A","date":"Tue Feb 08 17:15:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Prices at the pump continue to rise.\n\nMichiganders can't afford for gas to keep going up. \n\nIt's time President Biden does something to fix this problem. https://t.co/vsy4Cvr1XV","date":"Tue Feb 08 16:25:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm greatly concerned with everything we discussed at the Border Security Caucus meeting this morning. We must build the wall to keep fentanyl and criminal aliens out of our country.","date":"Tue Feb 08 15:31:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My team is hard at work getting as much money as possible returned to the constituents of #MI10. \n\nThey've already gotten $393,800 returned to the district in only 35 days! https://t.co/vxJqDZ5fs9","date":"Fri Feb 04 21:30:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On #WorldCancerDay, we remember those that we have lost and we show support for those who are currently battling this horrible disease. \n\nI believe that one day we will find a cure to eradicate cancer. https://t.co/M2TB7l1cUt","date":"Fri Feb 04 20:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"House Democrats are committed to putting China first and America last.","date":"Fri Feb 04 18:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I introduced the PIPES Act alongside @RepLowenthal to require the EPA to establish standards for the flushability of disposable wipes. \n\nYou can read more on the bill below ⬇\n\nhttps://t.co/p82Bu2QJKj","date":"Fri Feb 04 17:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The America Concedes Act does nothing to counter the #CCP. \n\nIt's nothing more than a Green New Deal wishlist to counter climate change instead of the Chinese Communist Party.","date":"Fri Feb 04 16:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Speaker Pelosi wants American athletes to turn a blind eye to the human rights atrocities in #China. \n\nWho does she work for, the #CCP or the American people?\n\nhttps://t.co/Sv4OlHqmNG","date":"Fri Feb 04 15:47:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Taking down the leader of ISIS is a win for America! \n\nNow it's time for President Biden to show that same strength to the rest of our adversaries.","date":"Thu Feb 03 16:14:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"School districts and teachers should be more concerned with teaching our children and catching them up from the past two years. \n\nInstead they continue to push masks and distancing practices that are stunting their growth and social skills.","date":"Wed Feb 02 18:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"With snow blanketing #MI10 and 6 more weeks of winter predicted by Punxsutawney Phil, I want to remind everyone to stay safe and warm this winter season!","date":"Wed Feb 02 17:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The military's A-10 fleet is crucial when supporting ground troops and I'm proud to stand alongside @RepKirkpatrick in calling on the Appropriations Committee to continue maintaining and upgrading the current fleet.","date":"Wed Feb 02 16:29:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Freedom Convoy in Canada should be an inspiration to all not to bend against tyrannical governing. \n\nI'm glad truckers in Canada are standing up against the unnecessary mandates that prevent them from doing their jobs!","date":"Wed Feb 02 14:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today on National Freedom Day, we remember the first step by President Lincoln and Congress in signing a resolution that would later become the 13th Amendment. \n\nFreedom is for all in America thanks to the efforts made on this day in 1865. https://t.co/McrQFvE0OQ","date":"Wed Feb 02 01:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our national debt surpassed 30 trillion dollars today. \n\nOur government spending is absolutely out of control. Stop the insanity!","date":"Wed Feb 02 00:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, the House passed my bill to rename the St. Clair Post Office after hero and Marine Corporal Jeffrey Robert Standfest. \n\nI'm so proud to be able to honor Cpl. Standfest's memory with this bill.\n\nhttps://t.co/0TdQh3NBGT","date":"Tue Feb 01 23:29:07 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@AmnestyUK is blatantly Anti-Semitic in their supposed \"finding\" of Israel as an \"apartheid\" state. \n\nThis dangerous rhetoric will do nothing but fuel hate. \n\nI'm proud to stand with Israel against this hateful discrimination.","date":"Tue Feb 01 22:18:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Squad logic: Eat the rich and defund the police while spending $325,000 on private security. \n\nhttps://t.co/4MupGUJji5","date":"Tue Feb 01 20:03:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"During #BlackHistoryMonth, we celebrate and remember the many contributions of African Americans that have led to the greatness of this country. https://t.co/wc8tLYJQNN","date":"Tue Feb 01 18:52:38 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Macomb County will thrive with the new Skilled Trades and Technology Center at Macomb Community College. \n\nThis is a priceless investment in our young minds, community and economy.\n\nhttps://t.co/AjJ0dLpmwF","date":"Tue Feb 01 18:22:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@PressSec must not get out often if she thinks the American people don't care about increasing crime and Democrats' dangerous soft-on-crime policies.","date":"Tue Feb 01 15:21:24 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's official! I'm now on @GETTRofficial because Big Tech should NEVER be censoring Americans!\n\nhttps://t.co/jaiI1AVhdu","date":"Mon Jan 31 21:15:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"178,840 illegal immigrants were apprehended at the border in the month of December alone. \n\n@POTUS , you've got well over 178,840 problems that need to be handled.","date":"Mon Jan 31 20:21:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis impacts every single state in America. \n\nHis policies aren’t working and CBP knows it. \n\nWatch below where I discussed this with @JonScottFNC on Fox News last night. https://t.co/aEEi3Tn3BZ","date":"Mon Jan 31 15:47:09 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Have you seen the viral video of Border Patrol agents having a heated exchange with DHS Secretary Mayorkas? \n\nI’m joining @JonScottFNC on Fox News at 6:30 to share my thoughts","date":"Sun Jan 30 22:12:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our hospitals are struggling to stay staffed, but are letting perfectly able health professionals walk out their doors over unnecessary mandates.","date":"Sun Jan 30 16:34:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The amount of leniency being shown to illegal aliens at our southern border, who often times turn out to be criminals, is ridiculous. \n\nWhen has any American been allowed to use an arrest warrant as a form of ID?","date":"Sun Jan 30 14:51:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I met with my agriculture advisory council to discuss their priorities and to hear about what our ag community needs most. \n\nHearing from #MI10's farmers is crucial to ensuring I serve our district to the best of my ability in Congress. https://t.co/CJMcTSDVQZ","date":"Fri Jan 28 19:28:14 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you need assistance with a government entity like Louis did, my caseworkers are always here to help. \n\nGive us a call to start the process today! https://t.co/zWhaRVhnDH","date":"Fri Jan 28 16:37:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s sickening that someone on the terror watchlist is free to roam our streets due to President Biden’s catastrophic failures at the border. #BidenBorderCrisis https://t.co/cLsdb4Drpt","date":"Fri Jan 28 01:52:15 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to Andy at H &amp; H Tools in Lapeer for giving me a tour of their facility that specializes in manufacturing aluminum tools. \n\nH &amp; H has been recently impacted by labor shortages &amp; vaccine mandates. It's encouraging to see businesses in #MI10 working through these hurdles. https://t.co/55sXM1aDlS","date":"Thu Jan 27 22:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden and VP Harris pretend to care about human trafficking. \n\nMeanwhile, they're enabling one of the biggest human trafficking crises in our country's history.","date":"Thu Jan 27 20:59:35 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The left is happy to defend criminals across America\n\n➡Illegal immigrants at our southern border\n\n➡Thieves and murderers in Democrat-run cities\n\nIt's time to take a law and order approach when protecting Americans. #BackTheBlue","date":"Thu Jan 27 17:33:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we remember those who were victims of the Holocaust. \n\nWe remember their lives and the light they brought to this world. \n\nWe honor their memory to ensure history will never repeat itself. https://t.co/d3oYgtYgry","date":"Thu Jan 27 16:31:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm thrilled GM is investing $7 billion in Michigan! \n\nThese new facilities will create thousands of jobs in the region and help boost our local economy. https://t.co/rrrQD8nTvP","date":"Wed Jan 26 21:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week is National School Choice Week, the perfect week to take the initiative to be involved in your child's education. \n\nIf you're looking into school options in #MI10 take a look at the helpful guide below ⬇\n\nhttps://t.co/qPgSxe5CVa","date":"Wed Jan 26 19:50:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy 185th birthday to the great state of Michigan! \n\nAs Michiganders, we’re incredibly lucky to call the Great Lakes State home. 185 has never looked better! https://t.co/iaQjvjB1v2","date":"Wed Jan 26 16:33:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"More reason to boycott the Olympics being held in communist countries like China.\n\nhttps://t.co/pEmsCkwtgc","date":"Wed Jan 26 14:35:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is FINALLY withdrawing his unconstitutional vaccine mandate for private businesses! This is a major win for freedom.","date":"Tue Jan 25 23:53:38 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If President Biden is afraid to sanction Russia, he should just own up to it. \n\nWouldn’t be the first time he’s shown weakness in the face of our adversaries.","date":"Tue Jan 25 16:24:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s imperative the United States, at the very least, help defend our allies from oppressive regimes such as the Kremlin. \n\nThis escalating crisis could be easily avoided if America showed even a fraction of its strength.","date":"Mon Jan 24 22:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our freedoms are in jeopardy due to the Democrats trying to track who gets a vaccine and who doesn't. \n\nI'm proud to protect our Constitutional rights alongside @RepAndyBiggsAZ!","date":"Mon Jan 24 21:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Why is President Biden intent on applying rules to Canadians trying to enter the U.S., but couldn't care less about enforcing the same rules on illegal aliens?","date":"Mon Jan 24 20:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is now requiring Canadian citizens to be vaccinated to legally enter at a port of entry. \n\nWhy isn't this same standard being applied to the illegal aliens streaming through our southern border?","date":"Mon Jan 24 19:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Crime continues to rise in Democrat run cities. \n\nHow is \"Defund the Police\" working for them?","date":"Mon Jan 24 18:42:24 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is enabling Russia to invade Ukraine by being all talk and no action. \n\nIt's time to stop making America look weak and start showing leadership.","date":"Mon Jan 24 16:00:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"American citizens should never be abandoned overseas when they’re in danger.","date":"Mon Jan 24 12:14:51 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to Sanilac and St. Clair Counties Right to Life for visiting with me before they joined the March for Life.\n\nTheir passion continues to drive me and I am never going to stop fighting to protect the unborn in Washington. https://t.co/FRN2oaYmht","date":"Sun Jan 23 14:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On this anniversary of Roe v. Wade, we remember the lives taken far too soon to abortion. \n\nI spoke on the House floor this past week in remembrance of the more than 62 million helpless babies who have been aborted since the Supreme Court’s decision in 1973. \n\nWatch below ⬇ https://t.co/Jev13ECnB4","date":"Sat Jan 22 14:17:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Russian aggression toward Ukraine continues to worsen, and now, Germany is siding with Putin instead of freedom. \n\nI wonder if Germany is cozying up to Russia for #NordStream2?\n\nhttps://t.co/KAFzXl0JpZ","date":"Fri Jan 21 21:02:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our courts agree with what I've been saying all along, President Biden's vaccine mandates are unconstitutional!\n\nhttps://t.co/CaEtHFloPq","date":"Fri Jan 21 20:06:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Immoral leftists can continue protesting life in grotesque ways like swallowing abortion-on-demand pills in public, but that won’t silence the millions who stand in solidarity for the unborn. I’m proud to be a voice in Congress for those who have none.","date":"Fri Jan 21 18:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Remembering the unborn who were lost to the horrible act of abortion and standing up for those who have no voice is of the utmost importance to me. \n\nI’m proud to stand with @RepTedBudd and @RepRalphNorman in recognizing National Sanctity of Human Life Day.","date":"Fri Jan 21 16:57:10 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'd wish President Biden a happy first anniversary in office, but it wasn't a happy year at all. https://t.co/4H36so4IoC","date":"Thu Jan 20 23:00:03 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Terrorism and antisemitism have no place in America. \n\nI'm proud to stand alongside @RepBethVanDuyne in condemning the acts in Colleyville, TX and honoring the brave acts of the local law enforcement and the hostages.","date":"Thu Jan 20 21:54:25 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Leave it to @SpeakerPelosi to support the #CCP's economy over America's while simultaneously mandating KN95 masks be worn in the halls of Congress. \n\nSpeaker, why aren't you, at the very least, purchasing these masks from American manufacturers?","date":"Thu Jan 20 20:51:44 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's been 12 months since the Democrats acquired complete control in Washington. \n\nHere are 12 ways they've ruined America in that timeframe... https://t.co/FALTh7WlUw","date":"Thu Jan 20 19:59:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is the President of Crises.","date":"Thu Jan 20 16:18:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden claims he's not pulling our country too far to the left. \n\nWhat alternate universe is he living in?","date":"Wed Jan 19 22:21:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is weak on Russia. \n\nAn attack on Ukraine is absolutely unacceptable and America needs to send that message strong and clear to Putin.","date":"Wed Jan 19 22:19:23 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The only thing President Biden underestimated was Republicans hitting back when he called us racist for wanting safe and secure elections.","date":"Wed Jan 19 22:12:52 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"\"I did put her in charge. I think she's doing a good job,\" @POTUS says about @VP. \n\nIn what world is Kamala Harris doing a good job? Our border is in shambles.","date":"Wed Jan 19 22:11:03 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Isn't it ironic that President Biden finally took questions from reporters...at the same time Senator Manchin is killing his dreams to nuke the filibuster on the Senate floor?","date":"Wed Jan 19 21:40:17 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What you can't see is teachers' unions twisting President Biden's arm behind the podium.","date":"Wed Jan 19 21:39:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden couldn't care less about the school children who still aren't back in person.","date":"Wed Jan 19 21:31:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden ran on unity, but just admitted that he speaks to virtually no Republicans when it comes to passing his legislation.","date":"Wed Jan 19 21:29:42 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"He has a 33% approval rating, but President Biden is under the illusion that the American people \"overwhelmingly\" agree with him on his liberal policies.","date":"Wed Jan 19 21:23:45 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The \"foundation\" President Biden is building is setting up future generations for failure and nothing else.","date":"Wed Jan 19 21:19:04 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is flat out lying about #BuildBackBetter. \n\nThis outrageous spending will worsen inflation, not lower prices!","date":"Wed Jan 19 21:16:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's clear President Biden hasn't stepped foot in a grocery store in DC. \n\nShelves are empty. \n\nYou can't blame this supply chain crisis on a winter storm.","date":"Wed Jan 19 21:14:37 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is using COVID as an excuse to ignore the dozens of other crises going on in America right now.","date":"Wed Jan 19 21:13:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thanks to #Bidenflation, the American people can barely afford groceries, but hey, if you want free at home COVID tests, they're all yours according to President Biden.","date":"Wed Jan 19 21:11:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The only \"accomplishments\" President Biden can tout is piling more debt on the backs of our children and grandchildren, a disastrous pullout of Afghanistan, crippling inflation, and rising crime rates.","date":"Wed Jan 19 21:10:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If schools are getting so much funding to be able to handle COVID, then why are some still shut down? \n\nGet our kids back in school!","date":"Wed Jan 19 21:09:31 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is the first time in a year that President Biden has been close to on time when addressing the American people.","date":"Wed Jan 19 21:05:27 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Honored to receive an A+ score from @SBAList for fighting to protect life during my first year in Congress. \n\nBeing a voice for the unborn is one of my top priorities. https://t.co/ztz89Xzriu","date":"Wed Jan 19 17:31:57 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is supposed to have a press conference today. I only have two questions:\n\n1. How long will he continue to gaslight the American people?\n\n2. Will he actually take questions for once?","date":"Wed Jan 19 13:12:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in to @CBSEveningNews at 6:30! \n\nI'll be discussing the Democrats' disastrous push to federalize our elections and how Michiganders are working to secure our elections.","date":"Tue Jan 18 23:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Amidst a supply chain crisis, we do not need more disruptions and delays with deliveries near the border.\n https://t.co/NkE6eS9moy","date":"Tue Jan 18 19:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy National Michigan Day! \n\nI'm blessed to have been born and raised in the greatest state in America. https://t.co/0kUv8KezVv","date":"Tue Jan 18 17:49:21 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we honor and remember the leaps and bounds that Dr. Martin Luther King Jr. made with his commitment to civil rights. \n\nAmerica would not be the country it is today without his activism. https://t.co/6XVIXlf4BG","date":"Mon Jan 17 14:06:46 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"One of the best parts of living in America is having the freedom to worship and believe how you wish without the fear of persecution.\n\nOur religious freedom makes this country the greatest on earth. https://t.co/HdJT1dh9dN","date":"Sun Jan 16 16:17:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepMalliotakis @RepRonnyJackson @RepRosendale @RepMaryMiller @KenCalvert @RepJasonSmith @RepBoebert @WarrenDavidson @congbillposey @RepGusBilirakis @RepBurgessOwens @RepDLamborn @RepStefanik @Lancegooden @RepScottPerry @RepGregSteube @RepBuddyCarter @RepBobGood @RepGregMurphy","date":"Fri Jan 14 16:10:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBrianBabin @RepMMM @RepJackBergman @RepRickCrawford @RepHartzler @RepJoeWilson @RepJimBanks @RepBrianMast @DesJarlaisTN04 @RepCarlos @RepKatCammack @CongressmanHice @RepFranklin @RepPfluger @RepMcKinley @RepHarshbarger @RepMikeCarey","date":"Fri Jan 14 16:10:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepJeffDuncan @RepCawthorn @replouiegohmert @VernBuchanan @RepTiffany @RepRalphNorman @RepBobGibbs @RepLaMalfa @RepTedBudd @RepAndyBiggsAZ @RepGrothman @RepTenney @RepChipRoy @RepBenCline @RepDonaldsPress @RepMikeGarcia @RodneyDavis @TXRandy14 @RepMattGaetz @RepDLesko","date":"Fri Jan 14 16:10:50 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I sent a letter alongside 56 colleagues to President Biden demanding he fire Education Secretary Miguel Cardona for his involvement in a letter that slandered concerned parents as domestic terrorists. Read below ⬇ https://t.co/bI764ovjYM","date":"Fri Jan 14 16:10:49 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune In: I'm joining @kevincdietz on @wjrradio at 11:05 to talk about the more than 47,000 illegal immigrants that failed to report to ICE #bidenbordercrisis","date":"Fri Jan 14 15:54:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Vaccine mandates are UNCONSTITUTIONAL! \n\nThank you @RepAndyBiggsAZ for introducing the No Mandates Act. \n\nI'm a proud cosponsor and will continue to fight against this gross government overreach.","date":"Thu Jan 13 23:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Parents have every right to be involved in their children's education and they shouldn't be classified as domestic terrorists for doing so. @POTUS should fire Education Secretary Miguel Cardona immediately. \n\nhttps://t.co/cIiw53xUQb","date":"Thu Jan 13 21:43:41 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#SCOTUS officially blocks President Biden’s unconstitutional vaccine mandate for large employers. This is a win for freedom!","date":"Thu Jan 13 19:48:32 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS is on his way to Congress to change the rules of the game. \n\nWhen you can't win, you cheat. https://t.co/RA7mEhoMX5","date":"Thu Jan 13 16:14:47 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Gas prices in Michigan continue to rise. \n\nDrivers are now paying, on average, 91 cents more per gallon than they were a year ago. \n\nIt continues to get more and more expensive to live in Joe Biden's America.","date":"Wed Jan 12 21:40:47 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"BLAST TO THE PAST: The Biden Administration has thrown the U.S. economy back four decades with skyrocketing inflation.","date":"Wed Jan 12 15:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"More than 104,000 ILLEGAL aliens were allowed into the interior of our country with a Notice to Report and were blindly trusted to report to ICE. \n\nAnd guess what? More than 47,000 didn't do it! Is anyone even surprised?","date":"Wed Jan 12 14:02:58 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Parents know what's best for their children, not teachers' unions. \n\nIt's time to stop letting them run the show and start getting our children back into school. https://t.co/4Fss25hGwf","date":"Tue Jan 11 23:00:01 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy National Milk Day! \n\nMichigan is home to 1200 dairy farms that keep milk on our dinner tables and in our schools. \n\nThank you to our dairy farmers and their amazing cows who provide for us. https://t.co/fQkWWgcpWm","date":"Tue Jan 11 21:50:12 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"No matter how they spin it, this Administration knows it messed up when it comes to the pandemic.","date":"Tue Jan 11 20:48:54 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I just voted in support of bringing legislation to the floor that would begin re-opening America's schools. Democrats voted against it. \n\nDemocrats don't care about your children's education or mental health.","date":"Tue Jan 11 19:18:30 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Gavin Newsom has devised a plan to worsen our border crisis by giving illegal aliens free health coverage. \n\nThere's no logic behind the Democrats' policies.","date":"Tue Jan 11 18:54:11 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. is falling drastically behind our adversaries like China and Russia. Read my op-ed in @townhallcom below.\n\nhttps://t.co/o4hyOj5xxj","date":"Mon Jan 10 19:00:18 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On #LawEnforcementAppreciationDay, and every day, I'm eternally grateful to the men and women in uniform who keep us safe. Your sacrifice does not go unnoticed. https://t.co/uwjS0Mm9qA","date":"Sun Jan 09 16:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to the men and women of the Bruce Township Firehall for their bravery when protecting the people of #MI10! https://t.co/HkcYywnEdS","date":"Sun Jan 09 14:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to the Richmond Police Department for your sacrifice and service every single day! https://t.co/3KoRYoqqRH","date":"Sat Jan 08 19:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#MI10's first responders are some of the bravest men and women and our communities are lucky to have them. \n\nI was glad to be able to show a bit of appreciation to some of our local departments this past week. \n\nThank you to the Port Huron Police Department for all you do! https://t.co/iqOm9R7Zwu","date":"Sat Jan 08 17:11:26 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#SCOTUS is hearing arguments on President Biden's unconstitutional vaccine mandates. I'm hopeful the justices will rule on the side of freedom and end this gross government overreach. I'm proud to have signed onto an amicus brief supporting the lawsuit challenging these mandates.","date":"Fri Jan 07 19:00:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden ran under the guise of unity and recovery. \n\nWhen is he going to start living up to those promises?","date":"Fri Jan 07 18:15:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's time for America to get back to work, back to school and back to normal.","date":"Fri Jan 07 16:45:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another month, another dismal jobs report. \n\nIt'll be interesting to see how the White House spins this.","date":"Fri Jan 07 15:36:33 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"TUNE IN: I’ll be on @wjrradio at 9:35 to talk about the #BidenBorderCrisis","date":"Fri Jan 07 13:52:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden’s open border policies are leading to dangerous gang members illegally crossing our border and putting American citizens at risk. \n\nWe need to build the wall NOW and end the #BidenBorderCrisis.","date":"Wed Jan 05 19:54:40 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Big Tech continues its rampage of censoring everything you see. \n\n@Twitter permanently suspended a sitting President and a sitting Member of Congress, but allows the #Taliban on their platform. \n\nWhy is Twitter ok with terrorists using their site, but not Republicans?","date":"Tue Jan 04 19:10:53 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Republicans are united in fighting back against the Democrats' terrible policies. https://t.co/5jKccPLXlo","date":"Tue Jan 04 18:51:13 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is a major win for our freedoms. \n\nPresident Biden's vaccine mandates are unconstitutional and no servicemember should be punished for seeking a religious exemption.","date":"Tue Jan 04 14:46:29 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in to @newsmax tonight at 6:30! \n\nI’ll be joining @seanspicer to discuss the divide amongst Democrats and how they’ve accomplished nothing good for the American people.","date":"Mon Jan 03 23:26:22 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today is National Write to Congress Day.\n\nDon't forget that no matter the day or time, you can contact my office by sending a letter, email or calling.\n\nI'm here to serve you!","date":"Mon Jan 03 16:30:00 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Serving the people of #MI10 over the past year has been the honor of a lifetime. \n\nSee everything we've accomplished for the 10th district since January 2021 below ⬇ https://t.co/6y9o0owXwA","date":"Mon Jan 03 15:00:19 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Wishing you a very happy New Year!\n\n2021 was an incredible year, and I'm looking forward to another great year representing you in Washington. https://t.co/94LoZGVnRZ","date":"Sat Jan 01 16:07:06 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #CCP’s fear mongering won’t stop the United States from standing with our friend and ally, #Taiwan","date":"Sat Jan 01 00:00:02 +0000 2022","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Best of luck to the University of Michigan today as they take on the Georgia Bulldogs in the Orange Bowl! #GoBlue","date":"Fri Dec 31 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined my colleagues in fighting back against President Biden’s unconstitutional vaccine mandates by signing on to an amicus brief to the Supreme Court.\n\nI will never stop defending your freedoms. https://t.co/qG4dxf55TD","date":"Fri Dec 31 20:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m proud to stand with my @HouseGOP colleagues in fighting against the Democrats’ radical agenda.","date":"Fri Dec 31 18:09:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I hope you all have a safe and happy New Years Eve! \n\nToday, I’m reflecting on 2021 and looking forward to all of the great things that are in store for 2022.","date":"Fri Dec 31 15:59:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Good luck to the Michigan State Spartans tonight in the Peach Bowl! \n\nGo out there and make Michigan proud. #GoGreen","date":"Thu Dec 30 16:29:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There are few things more patriotic than the Stars and Stripes and the pledge we make to them. \n\nToday, on #PledgeOfAllegianceDay, we recognize the commitment we make to freedom and American values. https://t.co/9Q7mE3h2Z0","date":"Tue Dec 28 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Christmas may be over, but the supply chain crisis and inflation are still impacting Americans across the country.","date":"Tue Dec 28 18:11:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There’s nothing more anti-American than choosing government control over personal freedoms.","date":"Mon Dec 27 23:05:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm thrilled @POTUS signed the #NDAA into law today. \n\nThe #NDAA is key to protecting our freedoms and providing our military with the necessary resources to keep Americans safe.","date":"Mon Dec 27 20:56:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It provides a much needed raise for our troops, prevents the Department of Defense from dishonorably discharging servicemembers who refuse to get the COVID vaccine and contains my amendment that prevents the DOD from providing financial support to the #Taliban.","date":"Mon Dec 27 20:56:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is absurd. The last thing our country needs right now is a vaccine mandate for flights. This isn’t about public health anymore, it’s about government control.  https://t.co/50kVUffVvI","date":"Mon Dec 27 19:20:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"“And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people.” Luke 2:10. \n\nOn behalf of Mike, myself, Ryan, Riley, Barak, Mitchell and Peanut, we wish you a safe, blessed and joyous Christmas. https://t.co/vdSWpIpbzc","date":"Sat Dec 25 14:07:43 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation doesn’t care that it’s Christmas time and President Biden doesn’t seem to either.","date":"Wed Dec 22 21:16:37 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's ridiculous President Biden is again extending the moratorium on student loan payments. \n\nAmericans are back to work. \n\nEnough of the government handouts.","date":"Wed Dec 22 19:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations to our allies, Israel &amp; Morocco. One year ago, President Trump negotiated a significant step toward peace in the Middle East via the historic normalization agreement. It’s been a great year of peaceful cooperation between our allies, but the work is far from done.","date":"Wed Dec 22 18:13:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@virginiafoxx @RepBurgessOwens @RepRickAllen @RepMMM @RepCawthorn @RepHarshbarger @RepSteel @RepJoeWilson @RepFitzgerald","date":"Tue Dec 21 17:34:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Masking is detrimental to early child development. \n\nKids in Head Start programs shouldn't be put at a disadvantage due to this unnecessary rule. \n\nToday, I led a letter urging Head Start to rescind their masking mandate for toddlers and young kids. https://t.co/vzL8yeL93N","date":"Tue Dec 21 17:34:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations Don Bissett on retiring after 35 years as the Goodland Township Fire Chief! \n\nMy team presented him with a Congressional Special Recognition Award this weekend. Enjoy retirement! https://t.co/sapZr2wlxx","date":"Tue Dec 21 16:19:04 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It ain’t no lie, Bye Bye Bye #BBB https://t.co/wxQUe2Wg0K","date":"Mon Dec 20 23:55:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Left will use any tragedy as an attempt to take away your Constitutional privileges.\n\nI will never back down on protecting your freedoms, which includes your Second Amendment rights. https://t.co/Ppp3fdIeSz","date":"Mon Dec 20 22:32:38 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden has laid out the welcome mat for dangerous terrorists to enter our country.\n\nThe #BidenBorderCrisis is a national security disaster.","date":"Mon Dec 20 18:08:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy 2nd birthday @SpaceForceDoD! \n\nThank you for all the hard work you're doing to protect the United States and our allies in space. https://t.co/c7htHzmxHU","date":"Mon Dec 20 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Build Back Better is an irresponsible Socialist spending spree that would bankrupt our country. I’m glad to see Senator Manchin will not vote for this horrific legislation.","date":"Sun Dec 19 15:11:26 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, my team also joined #WreathsAcrossAmerica and laid wreaths at Lakeside Veterans Memorial Cemetery in Port Huron, Resurrection Cemetery in Clinton Township and Indianfields Township Cemetery in Caro. https://t.co/XQ9wKgGvKx","date":"Sat Dec 18 23:09:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This morning, my DC staff volunteered at @ArlingtonNatl to lay wreaths on the graves of our fallen servicemembers. \n\nWe will never forget their sacrifice. #WreathsAcrossAmerica https://t.co/yjoxVbl0RH","date":"Sat Dec 18 17:24:28 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBalderson @congbillposey @TXRandy14 @RepGuthrie @RepFranklin","date":"Fri Dec 17 20:25:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepStefanik @RepDLamborn @RepMcKinley @RepBillJohnson @RepFredUpton @RepBobGibbs @RepRutherfordFL @RepHerrell @RepJackBergman @RepHuizenga @RepMeijer @RepWalberg @RepJohnKatko @RepGregSteube @RepTenney @RepGregMurphy","date":"Fri Dec 17 20:25:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people deserve to know the real cost of Build Back Broke. \n\nToday, I sent a letter to @POTUS, @SecYellen, @WHCOS, @BrianDeeseNEC and Acting OMB Director Shalanda Young to demand answers on the hidden costs of this disastrous bill. https://t.co/iVNrIUZAIK","date":"Fri Dec 17 20:25:41 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I joined @SenJohnThune in introducing the Preventing Mandates on Toddlers Act to ensure toddlers in Head Start programs aren't forced to wear masks. The science shows masking is detrimental to early child development. It's time to follow the science.","date":"Fri Dec 17 16:02:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Faith-based adoption and foster care agencies are the best chance these children have to find loving and caring homes. I'm proud to join @RepRalphNorman in fighting for the best care for these children.","date":"Fri Dec 17 14:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joining @seanspicer and @LyndsayMKeith at 6:00 p.m. to talk Build Back Broke, inflation and more. Tune in!","date":"Thu Dec 16 22:30:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Abortion is murder.  Plain and simple. \n\nIt's disgusting the FDA thinks it's okay to mail these life ending pills.","date":"Thu Dec 16 22:01:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today's a great day! \n\n@POTUS just signed my Congressional Gold Medal bill into law to posthumously honor the 13 fallen servicemembers who died in #Afghanistan in August. \n\nI'm glad to see these brave men and women honored and remembered in a bipartisan fashion.","date":"Thu Dec 16 15:49:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Speaker Pelosi is blocking real legislation to help the American people and kill the Biden OSHA vaccine mandate. \n\n@SpeakerPelosi, it's time to bring S. J. Res. 29 to the House Floor!","date":"Wed Dec 15 18:35:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Each day that I spend in Congress is a day spent fighting for the individual liberties of the constituents of #MI10. \n\nToday, on #BillofRights Day, we celebrate the 10 freedoms that started it all for America and the Land of the Free. https://t.co/Znw2pBBjIt","date":"Wed Dec 15 15:53:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"After years of anti-police rhetoric, empowering our law enforcement to do their jobs in a safe and effective manner should be a top priority. \n\nThank you @RepTroyNehls for leading this important effort.","date":"Wed Dec 15 14:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Raising the debt ceiling is one of the most irresponsible things that we as a Congress can do for the American people. \n\nWe need to stop wasteful spending!","date":"Tue Dec 14 23:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I always pay up on a bet! \n\n@RepMeijer hope your office enjoys the Coney Dogs! \n\nWe'll see who faces off in the Division 5 Michigan State Football Championship game next year! #GoMariners https://t.co/SNMc6UdytJ","date":"Tue Dec 14 22:12:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Confirmed what we already know. @Huawei is a spy agency for the #CCP.","date":"Tue Dec 14 21:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm unsure whether I'm in Washington or a cheap knock-off of Hollywood right now. \n\nThe acting and faux-rage by House Dems today is outrageous.","date":"Tue Dec 14 20:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The focus of Dems in Congress is on everything BUT what the American people want and need.","date":"Tue Dec 14 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to the thousands who joined me for my telephone townhall last night! \n\nWe had a great conversation and I appreciate those who asked questions about everything from CRT to vaccine mandates. \n\nYou can listen to the entire townhall below. \n\nhttps://t.co/GKCt8fz3iT","date":"Tue Dec 14 18:51:47 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Has the Biden White House completely forgotten that the U.S. and Taiwan are allies? \n\nCensoring a Taiwanese minister to appease the #CCP is a dangerous step to take.","date":"Mon Dec 13 17:27:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Birthday to the @USNationalGuard! \n\nI've had the pleasure to meet many members of the Michigan National Guard during my time in Congress, and I am always in awe of their readiness and commitment to America. https://t.co/aYyB72Ssu9","date":"Mon Dec 13 16:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Join me TONIGHT at 6:30 for a telephone townhall. \n\nI'll be discussing vaccine mandates, inflation and supply chain issues. \n\nI’ll also answer some of your questions. https://t.co/vrfgOpg0Ho","date":"Mon Dec 13 15:25:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Remember Build Back Better that Dems said wouldn't cost the American people a cent? \n\nWell turns out they were wrong and they are trying to add $3 trillion to the debt.","date":"Fri Dec 10 21:47:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I didn't realize Build Back Better meant the highest rate of inflation in 39 years, but if that's the alternate world you want to live in...","date":"Fri Dec 10 20:05:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joe Biden's America is EXPENSIVE.","date":"Fri Dec 10 18:05:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation reached a THIRTY NINE year high. \n\nThis is directly caused by President Biden's outrageous spending and disastrous policies.","date":"Fri Dec 10 17:35:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation is up 6.8% in one year and it's absolutely crushing middle and working class families. \n\nIt's time for President Biden to get our country's spending under control and start working for the American people.","date":"Fri Dec 10 17:08:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s incredibly troubling that Nicaragua severed diplomatic relations with #Taiwan. Now, more than ever, the United States must stand firm in our commitment to support our friend and ally, Taiwan.","date":"Fri Dec 10 00:50:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The same party that has claimed over and over that there was no fraud in the 2020 election just voted against removing foreign nationals, who can't vote in the U.S. by the way, from voter rolls.","date":"Thu Dec 09 21:00:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"American energy independence shouldn't be held hostage just because the Biden Administration wants to appease the radical squad. \n\nThank you, @RepWalberg for introducing this bill to protect American pipelines. I'm proud to join you in this effort.","date":"Thu Dec 09 18:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm glad to vote in support of the Ocean Shipping Reform Act! \n\nIn the midst of the supply chain crisis, we need to reform our shipping industry now, more than ever before.","date":"Thu Dec 09 17:34:45 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I've been calling on @POTUS and @VP to do something about the ever worsening crisis at the southern border for almost a year now. \n\nHarris went once and didn't even see the crisis firsthand! \n\nBiden probably doesn't even know it's still happening!","date":"Wed Dec 08 20:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Omarova was the wrong person for the job. \n\nShe knew it and President Biden knew it. \n\nShe would have stamped out an already struggling US economy.","date":"Wed Dec 08 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Russia and China are taking full advantage of the weak leadership in the U.S. \n\nIt's time to stop being soft on our adversaries and start showing real, American strength.","date":"Wed Dec 08 18:21:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m proud to support our troops through this bill that provides our military the support it needs to defend our country, protect our freedoms and remain tough on China. Dangerous red flag language was removed from this bill, so I am eager for it to become law.","date":"Wed Dec 08 02:53:58 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I just voted in support of the National Defense Authorization Act for FY22!","date":"Wed Dec 08 02:53:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It also includes my amendment that prevents the Department of Defense from providing financial support to the Taliban.","date":"Wed Dec 08 02:53:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This bill provides our servicemembers with a 2.7% raise, prohibits the Department of Defense from dishonorably discharging servicemembers who refuse to get the COVID vaccine and prevents Biden’s woke policies from harming our military.","date":"Wed Dec 08 02:53:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another win against Biden's unconstitutional mandates!","date":"Tue Dec 07 21:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Everyone in Michigan, Republican and Democrat, knows that mandates are not the way to go.","date":"Tue Dec 07 20:18:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Imagine forcing people to choose between their livelihoods or a vaccine right before Christmas.","date":"Tue Dec 07 16:00:20 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On this Pearl Harbor Remembrance Day, we honor and remember the ultimate sacrifice made 80 years ago by servicemembers of the Greatest Generation. https://t.co/FChtOZtDn8","date":"Tue Dec 07 14:25:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Now it's time to completely pull American athletes from the competition. \n\nNo freedom loving American should support a country that has detention camps and forced sterilization.\n\nhttps://t.co/VGanVlREKi","date":"Mon Dec 06 20:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you @RepDanCrenshaw for setting the record straight on H.R. 550. \n\nEvery Republican who voted for this legislation voted to protect your personal medical information. \n\nThere is no government tracking of your vaccine records in H.R. 550. Period.","date":"Mon Dec 06 19:28:29 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Mayor de Blasio is placing vaccine mandates on the NYC private sector. \n\nMaybe he doesn't understand what the word private means.","date":"Mon Dec 06 17:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America's health care workers were heralded as heroes during the pandemic, but now the government is turning its back on them by enforcing mandates &amp; threatening their livelihoods. \n\nProud to join @VernBuchanan in fighting back against these unconstitutional mandates.","date":"Mon Dec 06 16:11:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Senator Bob Dole was a true patriot and dedicated his entire life to public service. Praying for the entire Dole family during this difficult time.","date":"Sun Dec 05 17:06:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America didn't even hit the halfway mark on its expected jobs report for November. What's the grand recovery plan this time, @POTUS?","date":"Fri Dec 03 22:19:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tonight, I joined my colleagues in a moment of silence to honor the lives taken far too soon at Oxford High School. Sending love and prayers to all impacted by this horrific tragedy.","date":"Fri Dec 03 01:36:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What America needs is more compassion for all life, no matter how small.","date":"Fri Dec 03 00:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My statement on my vote for H.R. 550 ⬇ https://t.co/5eX0iMTx9s","date":"Thu Dec 02 22:45:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's a shame that House Democrats continue kicking the can down the road on government funding. \n\nInstead of a continuing resolution, we should be voting on appropriations bills by October 1st.","date":"Thu Dec 02 22:17:25 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was an honor to visit with Mississippi Attorney General Lynn Fitch, who is in DC for the historic Supreme Court hearings. \n\nFitch is fighting to protect innocent, unborn babies and I enjoyed talking about how we can work together to end abortions. https://t.co/AVbJfjw8cL","date":"Wed Dec 01 23:46:29 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm heartbroken to learn another young life has been lost to this senseless act of violence at Oxford High School. \n\nPraying for all the families and loved ones experiencing such tragic losses.","date":"Wed Dec 01 19:33:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm proud to serve on the @USCGAcademy Board of Visitors. \n\nThis week, I had the honor of visiting the campus and learning about the history and technology they use to teach the future generations of our Coast Guard. #GoCoastGuard https://t.co/H4FUpJtHMD","date":"Wed Dec 01 17:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats claim to follow the science on everything except for abortion. \n\nLife is life and abortion is murder.","date":"Wed Dec 01 15:34:59 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is an incredibly sad day for Oxford and our entire state. \n\nThree students are now dead and I can’t imagine the pain their families are going through.\n\nI want to thank our first responders for their bravery during this tragedy and ask you all to keep Oxford in your prayers.","date":"Tue Nov 30 20:59:07 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My heart breaks for Oxford High School. I am praying for the safety and swift recovery for all the students involved in the heartbreaking events today.","date":"Tue Nov 30 19:27:43 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The media is right - for once - there is no middle ground when it comes to choosing life or death and the Supreme Court has that decision laid before them this week. \n\nHopefully they choose correctly and they choose life.","date":"Tue Nov 30 17:36:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Here goes the \"eat the rich\" party recommending top 1% solutions to the middle and working class. \n\nAnd what about those electricity prices even if you can afford an electric vehicle?","date":"Mon Nov 29 21:19:44 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Dr. Fauci's fear mongering tactics are being based purely on his own assumptions at this point. \n\nIt's time to get an expert who has the American people's best intentions in mind and not just their next big media hit.","date":"Mon Nov 29 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is the president of rules for thee but not for me.","date":"Mon Nov 29 18:29:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America cannot and should not bend to a one-sided deal with Iran. \n\n@POTUS, this is a country that not only can't be trusted, but can't be reasoned or negotiated with. \n\nhttps://t.co/jl6a1ljpzX","date":"Mon Nov 29 15:12:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Wishing a very happy start of Hanukkah to those who celebrate.\n\nI hope you all have a blessed and peaceful holiday. https://t.co/bPrvQNUs8J","date":"Sun Nov 28 18:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Albanian Independence Day! \n\nI enjoyed celebrating this special day at Our Lady of Albanians Catholic Church last night. \n\nIt’s an honor to represent the large Albanian American population of Michigan’s 10th district in Congress. https://t.co/M3Bgmm6Jfz","date":"Sun Nov 28 16:30:46 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Good luck to the Marine City Mariners as they take on Grand Rapids Catholic Central in the state championship football game today! https://t.co/Np1kEFSe1U","date":"Sat Nov 27 19:21:41 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Hey @RepMeijer, there’s a big game today. How about we make a bet. \n\nIf Marine City wins, you owe my office coney dogs! Go Mariners!","date":"Sat Nov 27 16:19:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"In the hustle and bustle of Black Friday and retail deals, don't forget to support small businesses on this #SmallBusinessSaturday. https://t.co/RHs7TfVs86","date":"Sat Nov 27 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"From my family to yours, happy Thanksgiving! \n\nI hope that it's a warm and restful holiday with family and friends. https://t.co/BGOdhSUrEQ","date":"Thu Nov 25 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"In the midst of a supply chain crisis, this move will only make essential goods impossible to find on store shelves. \n\nhttps://t.co/nNOHNMCVLl","date":"Tue Nov 23 21:11:04 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America has the ability to be energy independent if the Biden Administration would let it. \n\nInstead, they're tapping into crucial oil reserves just in time for the holidays. https://t.co/W75DWCLJ84","date":"Tue Nov 23 19:50:29 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you look at Joe Biden's presidency so far, it's a tragic, expensive and embarrassing presidency.","date":"Tue Nov 23 14:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Imagine having a Secretary of State more concerned with the number of Twitter followers they have than the number of American citizens still stranded in Afghanistan. \n\nOh, wait. . .","date":"Mon Nov 22 23:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What's more expensive than a Thanksgiving turkey right now? \n\nHonestly, not much. #ThanksgivingTax","date":"Mon Nov 22 21:57:45 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My thoughts and prayers are with all of those who died or were injured in the awful tragedy in Waukesha, Wisconsin last night.","date":"Mon Nov 22 16:29:56 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The United States needs to be tough on #China. How is that possible when the president’s son is helping our enemies? https://t.co/CnU7RqMI65","date":"Sat Nov 20 22:48:45 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats are cheering because they've officially bankrupted your children and grandchildren. Way to go.","date":"Fri Nov 19 15:19:19 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m heading to the House floor to vote NO on the largest tax and spending bill in recent history. https://t.co/lYbxbg8S6r","date":"Fri Nov 19 14:23:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"House Democrats tried to pass the largest tax and spend bill in history in the middle of the night. \n\nThanks @gopleader for forcing them to delay the vote until this morning.","date":"Fri Nov 19 12:34:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Build Back Better? More like Build Back Broke. This bill adds $367 billion to our deficit. Not quite the zero dollars the White House promised it would cost.","date":"Fri Nov 19 00:24:28 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you @SteveDaines for your leadership in getting the Congressional Gold Medal bill for the 13 fallen servicemembers passed in the Senate, and a very special thank you to our staff who put in countless hours to make this possible. These heroes will never be forgotten. https://t.co/bbrbP1UZe7","date":"Thu Nov 18 23:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My heart aches for those affected by this horrible illness. Thank you @RepAndreCarson for taking the lead on this legislation to designate November as Pancreatic Cancer Awareness Month.","date":"Thu Nov 18 21:49:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#China’s human rights record is abysmal. \n\nThe United States must boycott the #BeijingOlympics and send a clear message to the world.","date":"Thu Nov 18 19:13:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to American hero Antonio \"Tony\" D'Agostini and his wife Jennie for stopping by my DC office during their visit to Arlington National Cemetery for Veterans Day. \n\nA veteran of the Vietnam War, Tony has led a selfless life even after his military service. https://t.co/sngW1x8yG4","date":"Thu Nov 18 18:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My district staff is hosting mobile office hours on Friday in Burtchville and St. Clair. If you need assistance with a government entity, please come see our caseworkers. \n\nAs always, you can call or drop into our Washington Township office any time during normal business hours. https://t.co/y5A1gJZwBj","date":"Thu Nov 18 17:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"ICYMI: The Senate passed my bill to award the Congressional Gold Medal to our 13 servicemembers who died in Afghanistan in August. \n\nhttps://t.co/Lfbw53loLn","date":"Thu Nov 18 16:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Why is @SpeakerPelosi trying to push through the Build Back Better Act without even knowing how much it will actually cost?","date":"Thu Nov 18 15:15:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m thrilled my bill to award the Congressional Gold Medal to the 13 heroes killed in Afghanistan is on its way to the president’s desk after passing the Senate tonight. Thank you to Senators @SteveDaines and @SenWarren for leading this effort in the Senate.","date":"Thu Nov 18 03:01:36 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I introduced the Iran Verification Act, which would prevent the Biden Administration from rejoining the failed JCPOA until #Iran is in full compliance with the letter and spirit of the deal.","date":"Wed Nov 17 21:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. cannot allow #Iran to resume building nuclear weapons.","date":"Wed Nov 17 21:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"How's that Iran deal going, President Biden?","date":"Wed Nov 17 20:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joe Biden is weak on:\n\nImmigration\nThe economy\n#China\nThe #Taliban\n\nPresident Biden’s weak leadership is creating crises at home and abroad.","date":"Wed Nov 17 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Illegal immigrants are fully aware of President Biden's open border policies. \n\nWe must secure our border and stop the #BidenBorderCrisis.\n\nhttps://t.co/uSFLu2ivmq","date":"Wed Nov 17 18:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Glad to see more Michiganders standing up against overreaching mandates.","date":"Wed Nov 17 17:30:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The United States has ALWAYS stood for freedom and independence. \n\nTo say or encourage otherwise is absurd.","date":"Wed Nov 17 16:30:44 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"China is playing a dangerous game with the United States. \n\nThe #CCP continues to be the biggest threat to the free world.","date":"Wed Nov 17 01:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Chairman Xi's threats against U.S. support of #Taiwan's independence are absolutely unacceptable. \n\nThe U.S. must always stand with our ally, Taiwan.","date":"Wed Nov 17 00:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Continuing the tradition of apprenticeships, especially in skilled trades jobs, is crucial to keeping the American dream alive and ensuring a strong American workforce for generations to come. #NAW2021 https://t.co/q5BAAQHaSC","date":"Tue Nov 16 21:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Dems named it \"Build Back Better\" because \"Build Back and Indebt the American People for Generations to Come\" didn't roll off the tongue as easily.","date":"Tue Nov 16 20:28:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Taiwan is a trusted ally, partner and friend and should never be bullied by Chairman #Xi and the #CCP.","date":"Tue Nov 16 18:40:43 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"A weak White House means a weak America. \n\n@POTUS and @VP need to get it together and begin doing real work for the American people. https://t.co/YthKzs6rOA","date":"Tue Nov 16 16:13:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We don’t have the money to pay for #BuildBackBetter. \n\nYour hard earned dollars are what’s going to pay for this.","date":"Mon Nov 15 20:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"An estimated $4 trillion dollars.\n2,000 unavailable pages.\nNo full CBO score.\n\nAnd Democrats want to vote on Biden’s #BuildBackBetter on Wednesday.\n\nThis is not going to end well for America.","date":"Mon Nov 15 19:05:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thrilled to see Michigander Danny Fenster finally released from jail in Myanmar. The entire Michigan delegation worked to get him released, and I’m glad to see he will be home with his family soon.","date":"Mon Nov 15 13:02:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joining @JonScottFNC at 6:00 p.m. on @FoxNews to discuss President Biden’s declining approval numbers and why education is so important to our nation’s parents.","date":"Sun Nov 14 22:07:26 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden’s vaccine mandate is unconstitutional, and again, the courts are rightfully halting it from being implemented. \n\nThis is a huge win for freedom.","date":"Sat Nov 13 01:24:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is an Administration that doesn't have a plan for the immense inflation, or anything else for that matter, that's impacting the American people right now.","date":"Fri Nov 12 22:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"No veteran should ever lose their VA benefits for not getting the COVID vaccine. \n\nI joined @RepBrianBabin in introducing the Our Veterans Earned It Act to ensure our veterans' benefits are protected from President Biden's gross government overreach.\n\nhttps://t.co/cbv6I9MeLW","date":"Fri Nov 12 21:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Michigan native Danny Fenster was sentenced today to 11 years in prison in Myanmar. \n\nI’m disappointed the Biden Administration did not help rescue him from overseas. \n\nThe freedom of the press is incredibly important and no journalist should ever be jailed for doing their job.","date":"Fri Nov 12 20:17:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Shutting down #Line5 would not only be disastrous to our economy, it would cause propane shortages in the middle of winter, putting Michiganders’ lives at risk. \n\nI joined @RepWalberg and @boblatta this morning to discuss the serious harm this would do to the Midwest. https://t.co/kWToTlYxkl","date":"Fri Nov 12 16:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Don't Forget! \n\nI'll be hosting an in-person town hall TODAY, November 12, at 2:30 P.M. at the Armada Village Council Chamber. \n\nCome out for a legislative update and an opportunity to ask any questions you may have. https://t.co/xmex2zI5DZ","date":"Fri Nov 12 15:52:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in: I’m joining @foxandfriends at 7:30 to talk about #Line5 and the disastrous impact shutting it down would have on not only our state, but the entire country.","date":"Fri Nov 12 12:14:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was great visiting with veterans at the Utica American Legion tonight! I appreciated hearing more about the issues impacting our veterans and will always be an advocate for our nation’s heroes in Congress. https://t.co/isLYKrK7CA","date":"Fri Nov 12 01:49:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I want to meet and hear from you! \n\nI'll be hosting an in-person town hall tomorrow, November 12, at 2:30 P.M. at the Armada Village Council Chamber. \n\nCome out for a legislative update and an opportunity to ask any questions you may have. https://t.co/CPSWtr8mgX","date":"Thu Nov 11 18:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I joined @RepStefanik in standing up for America's energy independence and for the economies of our northern border in #MI10. \n\nThe U.S. has a commitment to Canada to uphold Line 5 and I hope to see this commitment continue. https://t.co/bpDWmMWqtS","date":"Thu Nov 11 16:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we recognize America's veterans for their service. \n\nTo those who are still with us, I am eternally grateful, and to those who paid the ultimate sacrifice, we remember you not just today, but every day. https://t.co/iQ37ATMPLp","date":"Thu Nov 11 14:00:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people aren’t dumb and are smart enough to understand the supply chain crisis. https://t.co/uF0l76YMjP","date":"Thu Nov 11 01:05:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This administration is more concerned with oceans rising than they are with the price of survival rising. #BidenInflationCrisis","date":"Wed Nov 10 23:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation is not a partisan issue. \n\nThis sharp increase in prices for basic goods is impacting ALL Americans.","date":"Wed Nov 10 22:00:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Birthday to the @USMC. \n\nThank you all for your tremendous sacrifice to America and for serving and protecting your neighbors with great bravery. #SemperFi https://t.co/x5asa75lwe","date":"Wed Nov 10 16:10:51 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Just a few things the Dems insist\n\nI think we’ve got some Marxists in our midst https://t.co/OnGCbSR6wo","date":"Wed Nov 10 14:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Line 5 will guarantee that Michiganders will be able to heat their homes for less during a time that gas prices are skyrocketing.","date":"Tue Nov 09 23:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Ensuring the success of Line 5 means ensuring success for #MI10.","date":"Tue Nov 09 22:01:24 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Things that are going to be difficult to do this holiday season with gas prices up 6.7%\n\n🏠 heating your homes\n\n⛽️ visiting loved ones\n\n❄️ clearing snow","date":"Tue Nov 09 20:00:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"You're going to be stuffing a lot more money into your Thanksgiving turkey this year thanks to the #BidenInflationCrisis. #ThanksgivingTax https://t.co/e45XiSXsRo","date":"Tue Nov 09 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Welfare benefits should, at the very least, include assistance programs to help place Americans in jobs. \n\nWe should encourage people to reach the American dream, not depend on the government.","date":"Mon Nov 08 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Just your friendly reminder that inflation is, in fact, taxation.","date":"Mon Nov 08 21:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Most Americans will tell you that the IRS already brandishes enough power, but the Democrats want to hand them $80 billion dollars to expand and snoop on your bank accounts.","date":"Mon Nov 08 20:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If President Biden and the Democrats care more about illegal border crossers who outright broke our laws than the veterans who put their lives on the line for their country, then they should just come out and say it.","date":"Mon Nov 08 19:09:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is the beginning of recovery for many small businesses in #MI10 border communities.","date":"Mon Nov 08 18:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The burden that this border closure has had on families and small businesses in #MI10 is finally lifted.","date":"Mon Nov 08 18:00:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today our northern border finally opens back up and the economic recovery of our #MI10 border communities finally begins.","date":"Mon Nov 08 17:27:46 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in: I'm joining @wjrradio at 9:35 to discuss why I voted no on the \"infrastructure\" bill\n\nhttps://t.co/iXDq1trOW6","date":"Mon Nov 08 14:28:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tomorrow our northern border finally opens for cross border travel with Canada! \n\nIt’s too bad the Biden Administration is putting such strict testing requirements on Canadians when they’re not enforcing any rules on those illegally crossing the southern border.","date":"Mon Nov 08 02:25:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thrilled to see the Fifth Circuit Court of Appeals halting @POTUS’ unconstitutional vaccine mandate on large employers. I’ve been fighting against this mandate since it was announced and will continue to work to ensure you can choose whether or not you get the COVID vaccine.","date":"Sat Nov 06 19:33:35 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Not one tax dollar should go to illegal aliens who broke our nation’s laws.","date":"Sat Nov 06 18:48:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"While you were sleeping, the Democrats passed their “infrastructure” bill. I voted no because it is filled with pork &amp; only 10% is actual infrastructure. Michigan’s roads and bridges need repairs, but the wasteful spending in this bill will harm America for generations to come.","date":"Sat Nov 06 13:42:59 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"3 hours into another vote. @speakerpelosi is completely incapable of governing. #whatajoke #demsindissaray","date":"Fri Nov 05 22:50:21 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another vote, another push by the Democrats to do anything but govern. What an embarrassment.","date":"Fri Nov 05 21:00:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Over six hours..currently the longest vote held open in the history of Congress. \n\nAlso the biggest failure to govern in the history of Congress.","date":"Fri Nov 05 18:56:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The \"Build Back Better\" agenda is so unpopular that Speaker Pelosi has to leave a vote open for FIVE hours to try to whip up support for this socialist nightmare.","date":"Fri Nov 05 17:13:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"FOUR HOURS. \n\nWe are witnessing history. \n\nThe vote on the Motion to Adjourn is STILL open and is believed to be a new record for the longest vote ever held open in the House of Representatives in modern history.  #FailureToGovern #NoScoreNoVote","date":"Fri Nov 05 16:13:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The American people deserve to know just how much the Democrats' tax and spending spree will ACTUALLY cost. #NoScoreNoVote","date":"Fri Nov 05 15:47:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We just entered our third hour of what’s supposed to be a 15 minute vote.  \n\n@SpeakerPelosi's own conference knows she is incapable of governing and that this vote would be catastrophic for our future generations.","date":"Fri Nov 05 15:14:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Joining my colleagues in opposition of President Biden’s unconstitutional vaccine mandates this morning. I will continue fighting against this gross government overreach. https://t.co/MjMb8MhPoQ","date":"Fri Nov 05 14:42:44 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats are breaking House rules to push through this 2,000 page socialist wishlist. How can we be expected to vote on a bill when we haven’t had time to read the text?","date":"Fri Nov 05 12:46:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to the thousands of constituents who joined my telephone townhall tonight! \n\nIt was incredibly productive &amp; I hope we can do it again soon. \n\nYou can listen to the entire townhall below &amp; be on the lookout for in-person townhalls in #MI10 soon.\n\nhttps://t.co/KZbvOYaBUZ","date":"Thu Nov 04 23:47:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Join me TONIGHT at 6:30 for a telephone townhall. \n\nI'll be discussing the border crisis, inflation and the Democrats' out of control spending. https://t.co/DNtd6Df6UO","date":"Thu Nov 04 21:39:38 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Watch live! I'm joining @GOPLeader @RepSmucker @RepBryanSteil and @RepDonaldsPress for a roundtable discussion about the \"Made in America Tax\" at 4 p.m. \n\nhttps://t.co/NwxiMnmzIH","date":"Thu Nov 04 19:30:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Small government &gt; big government","date":"Thu Nov 04 19:11:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What an inspiration to meet @CondoleezzaRice! \n\nThank you for taking the time to come and share your insight on foreign policy with us. https://t.co/pEKGrj9JA5","date":"Thu Nov 04 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden's going to be remembered as the President of Mandates.","date":"Thu Nov 04 12:57:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Honored to have Lance Corporal Chesty XV and his fellow Marines from the @USMC come by. \n\nStop by for treats any time you're around, Chesty! https://t.co/ckaTdb3YEE","date":"Wed Nov 03 21:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our neighbors should be empowered to become self-sufficient instead of relying on taxpayer funded government programs that they'll never come out of. \n\nI'm glad to have had the chance to talk about the Community Services Block Grant in the @EdLaborGOP hearing today. https://t.co/Z9wiUR3VrC","date":"Wed Nov 03 20:14:58 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Join me for a telephone townhall this Thursday at 6:30 p.m. where I'll be discussing the border crisis, inflation and the Democrats' out of control spending. https://t.co/vY9zofwA1o","date":"Wed Nov 03 18:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you @MatureAmericans for the Patriot Award. \n\nI'm committed to fighting for the rights of those in #MI10 during my service in Congress and it was truly an honor to receive this award. https://t.co/pMd62CMTqR","date":"Wed Nov 03 17:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to Michiganders John, Andreas and Paul of the National Association of Theater Owners for stopping by my office and discussing antitrust issues impacting the theater industry in Michigan. https://t.co/jd7iCc5CTA","date":"Wed Nov 03 16:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The \"woke\" left need to wake up and realize that the endless spending and government welfare programs are going to do nothing more than harm America in the long run.","date":"Wed Nov 03 14:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There's no higher priority for parents than being involved in their child's education.","date":"Wed Nov 03 13:21:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Had a great meeting with members of the K-12 Alliance of Michigan this week where we addressed learning gaps experienced by young Michiganders due to COVID, as well as how education funding can best be used to keep schools open. https://t.co/fCZTw8lDne","date":"Tue Nov 02 23:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is so out of touch with the American people. \n\n@POTUS won't even answer questions about their TOP issues.","date":"Tue Nov 02 21:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Hey @Twitter, stop censoring @RepJimBanks.","date":"Tue Nov 02 21:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We need to build the wall at the southern border, not just to keep immigrants from crossing illegally, but to prevent dangerous drugs like fentanyl from getting in and causing countless American deaths.","date":"Tue Nov 02 20:29:51 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"To the families who raise, support, love and stand by those who protect our great country, thank you. \n\nI am incredibly grateful for your sacrifice. \n\n#NationalMilitaryFamilyMonth https://t.co/oNtrveOWOu","date":"Tue Nov 02 17:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The fact of the matter is that House Democrats don't have the votes from their own caucus to pass their outrageous spending bill. \n\nIf that's not a sign, then I don't know what is.","date":"Tue Nov 02 16:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I don't remember President Biden promising outrageous gas and grocery prices in his inaugural speech, but here we are.","date":"Tue Nov 02 15:10:36 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The silence from the Biden Administration on cash handouts for illegal aliens is deafening. \n\nI discussed this on @wjrradio this morning. \n\nListen below ⬇ https://t.co/qXvQ9LQtP7","date":"Mon Nov 01 20:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America needs to take care of Americans before even considering dishing out taxpayer-funded handouts to illegal aliens who break our laws. \n\nThank you @RepFredUpton for leading this letter.","date":"Mon Nov 01 19:06:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in: I'm joining @wjrradio at 9:05 a.m. to talk about the #BidenBorderCrisis https://t.co/KnS7jWbtAQ","date":"Mon Nov 01 13:03:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As we wrap up October, I'm proud to stand alongside all of my colleagues in honor of those who have fought and are fighting the horrible disease of breast cancer. #breastcancerawarenessmonth https://t.co/Oul4VP85eb","date":"Sat Oct 30 14:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My office is divided! \n\nWho will YOU be rooting for this weekend? https://t.co/CKSDn1uH7j","date":"Fri Oct 29 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our trust should be in the American people, not the government. \n\nThank you to @MatureAmericans for having me on their podcast this week. You can watch below ⬇\n\nhttps://t.co/Re59KxocOR","date":"Fri Oct 29 20:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Future generations of Americans will be haunted by this for years to come. https://t.co/tYw1XsOAo3","date":"Fri Oct 29 19:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Where's the logic in paying illegal aliens hundreds of thousands of dollars for breaking our laws?","date":"Fri Oct 29 18:14:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I had a fruitful meeting with Shalva Natelashvili, Chairman of the Georgian Labour Party. \n\nWe discussed Russia's growing influence on the Georgian government and I enjoyed learning more about the beauty of Georgia. https://t.co/5PAwdiPEUu","date":"Fri Oct 29 14:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The IRS is no longer solely concerned with just the rich. \n\nThey WILL be coming after the middle and working class if Biden has his way.","date":"Fri Oct 29 13:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to America's first responders. \n\nYour bravery and willingness to serve your communities is admirable. \n\nYou are our every day heroes. https://t.co/tvCGHbM7DK","date":"Thu Oct 28 23:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another week, another canceled infrastructure vote over Democrat disarray. \n\nSpeaker Pelosi can't get her own conference to support Biden's insane spending spree.","date":"Thu Oct 28 23:18:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This week, I introduced the bipartisan Patient Advocate Tracker Act which is a commonsense piece of legislation that will create an online portal where veterans can track the status of formal complaints made through the VA. \n\nYou can read more below ⬇\n\nhttps://t.co/TesqoKDMB6","date":"Thu Oct 28 21:33:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was an honor to meet with @michiganstateu President Samuel Stanley Jr. this week. \n\nIt's amazing to hear about the progress of the new DOE-MSU Facility for Rare Isotope Beam's and their agricultural research initiatives that are directly effecting #MI10. https://t.co/cbcQU314y5","date":"Thu Oct 28 17:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to Meighan Sharp, President-Elect of the American Society for Clinical Laboratory Science, for stopping by my DC office to discuss workforce shortages in laboratories and how medicare reimbursement is effecting the industry. https://t.co/6a2Q5o6tEB","date":"Thu Oct 28 16:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations to the Anchor Bay Chamber of Commerce for being recognized with the 2021 Award of Distinction by the Michigan Association of Chamber Professionals! \n\nIt's great to see chambers in #MI10 making such a big impact on their communities.","date":"Thu Oct 28 14:59:24 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"A great night playing softball for an even greater cause! #breastcancerawareness #congressionalwomenssoftballgame https://t.co/yqyBJXbzYd","date":"Thu Oct 28 02:03:20 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Had a wonderful meeting today with President Surangel Whipps Jr. of Pulau, a long standing ally of the United States. \n\nWe discussed negotiations of a new compact between Palau and the U.S. and how to enhance our already strong relationship. https://t.co/A4JpxWhS7h","date":"Wed Oct 27 18:23:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our border patrol agents are facing enough problems as it is. \n\nI trust the American people and their healthcare providers to make the right decision for themselves, NOT the government.","date":"Wed Oct 27 16:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@SenThomTillis, Dale and Teddy from my office are ready for the biPAWtisan costume party this afternoon!","date":"Wed Oct 27 16:10:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Wishing a very happy #NavyDay to all who have or are currently serving in our United States Navy. \n\nThank you for your service and dedication to our country. https://t.co/e7fuaYejxG","date":"Wed Oct 27 15:53:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Despite natural immunity being a part of the science, OSHA isn't considering it when imposing vaccine mandates. \n\nThe government is choosing to ignore the science. https://t.co/RNEnWmwdHi","date":"Tue Oct 26 20:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We don't have a strategy to end the border crisis, the supply chain crisis, stop inflation or combat our enemies, but the Biden White House is giving us a National Gender Strategy. \n\nTone deaf or just completely ignorant of what's going on in America?","date":"Tue Oct 26 19:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My office is looking for outstanding intern candidates for my Washington, D.C. and district office. \n\nIf you're interested, go to https://t.co/KV6GrBc9BT to apply before the November 10 deadline. https://t.co/EkDNMY9pUn","date":"Tue Oct 26 18:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #donothingdemocrats have been kicking the build back better can down the road for months and sidelining any real and helpful legislation put forth by either party.","date":"Tue Oct 26 17:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On National Day of the Deployed, I want to thank all servicemembers who are currently deployed to defend our freedoms and their families for their immense support of their loved ones during their service overseas. https://t.co/IriybAQtAp","date":"Tue Oct 26 16:10:47 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m proud the House passed my bill that would award the Congressional Gold Medal to the 13 brave men and women who were taken far too soon. \n\nTheir sacrifice for our country and its allies will never be forgotten. https://t.co/fWaB5rJoic","date":"Mon Oct 25 22:49:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Heading to the House floor to speak about my bill that would award the Congressional Gold Medal to the 13 fallen servicemembers who died in Afghanistan on Aug. 26th https://t.co/CKBi9Na8r4","date":"Mon Oct 25 21:08:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you, @RepMcKinley for being an original cosponsor of this important piece of legislation.","date":"Mon Oct 25 19:46:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our southern border is not secure to prevent this caravan from making its way into the interior of our country. \n\nThe Biden Administration needs to start enforcing our nation’s immigration laws.","date":"Mon Oct 25 16:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in: I’m joining @wjrradio at 11:05 to discuss my Congressional Gold Medal bill that’s on the floor today.\n\nhttps://t.co/iXDq1tadxw","date":"Mon Oct 25 14:55:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"60 days ago, 13 American servicemembers were killed in Afghanistan. \n\nToday, my bill to posthumously honor them with the Congressional Gold Medal goes to the House Floor for a vote.","date":"Mon Oct 25 14:27:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Michigan’s roads and bridges are in dire need of repair. \n\nMichigan does not need Speaker Pelosi’s San Francisco style social welfare programs that will bankrupt our future generations. https://t.co/3FRbmM16tA","date":"Sat Oct 23 23:07:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's unacceptable that Americans are still stranded in #Afghanistan","date":"Fri Oct 22 21:17:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thrilled the House is voting on my bill to honor the memories of the 13 fallen servicemembers who died in Afghanistan on Aug. 26th next week.","date":"Fri Oct 22 20:24:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Meghan Markle is incredibly out of touch with the American people and should stick to acting instead of trying to play politics. https://t.co/mz9n7ZGYtx","date":"Fri Oct 22 20:11:38 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Reminiscing on the big #congressionalbaseball win with @SteveScalise! https://t.co/lESxTSefVL","date":"Fri Oct 22 19:25:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm proud to join my colleagues in demanding answers from Dr. Fauci about abusive testing on beagle puppies, like Buddy and Bowser, that he funded with taxpayer dollars. https://t.co/Tpx5x4c3DH","date":"Fri Oct 22 15:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS has found time to go to Delaware 23 times since taking office, but claims he hasn't had time to go to the border.\n\nThis is what failed leadership looks like.  #BidenBorderCrisis","date":"Fri Oct 22 14:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you Second Nature Brands for visiting my DC office. \n\nWe had a great conversation about how they're working to make their brands, Kars &amp; Sanders, national and the challenges they're facing in the process. \n\nThey even mentioned new snacks they're bringing to customers soon! https://t.co/1xv317Gp75","date":"Fri Oct 22 14:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The numbers don't lie.\n\nWe have a crisis at the border and it's all due to President Biden's disastrous open border policies. https://t.co/l3aM95JuVG","date":"Thu Oct 21 23:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"How disappointed would they be if they saw how weak America has become? https://t.co/qJP0MCriqe","date":"Thu Oct 21 22:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nLet the Democrats get away with their insane socialist agenda.","date":"Thu Oct 21 21:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nSell your goods at a farmer’s market.","date":"Thu Oct 21 21:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nBuy a new home.","date":"Thu Oct 21 20:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nWork a blue-collar job","date":"Thu Oct 21 20:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nInvest in your small business.","date":"Thu Oct 21 20:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nLoan money to a loved one.","date":"Thu Oct 21 20:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nFinancially support your elderly parents.","date":"Thu Oct 21 19:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nBecome an ride share driver.","date":"Thu Oct 21 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nSave up for a new car.","date":"Thu Oct 21 19:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Want to get targeted by the IRS? \n\nSend your kid to college.","date":"Thu Oct 21 19:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration cannot continue ignoring the supply chain crisis.","date":"Thu Oct 21 17:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Government surveillance of Americans' bank accounts is absolutely unacceptable. \n\nI'm proud to stand alongside my colleagues in this fight against government overreach.","date":"Thu Oct 21 16:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our president is weak and the #CCP knows it.\n\nhttps://t.co/K6EAMhbWHm","date":"Thu Oct 21 15:41:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you, or anyone you know, is interested in applying for a U.S. Military Academy nomination, the deadline to apply is TOMORROW, Friday, October 22. \n\nIf you need further assistance with an application, please call my Washington Township office at 586-697-9300. https://t.co/D0Rgq7CB82","date":"Thu Oct 21 14:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This Saturday, the DEA is hosting its 21st National Prescription Drug Take Back Day. \n\nVisit https://t.co/FpBpNrY4Ap to find a location near you to dispose of any medication that is old, unwanted or no longer needed. https://t.co/gKUBz9zoxh","date":"Thu Oct 21 13:30:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to the @USNavy for surprising us with these cupcakes in honor of their birthday! https://t.co/fkoQlWcdH8","date":"Wed Oct 20 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's past time Congress votes on legislation that will actually fix the multitude of crises our country is facing, not waste trillions of your hard-earned tax dollars","date":"Wed Oct 20 20:42:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Have you seen empty shelves and inflated prices for common goods in your local stores?","date":"Wed Oct 20 19:31:04 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"At this rate, there are more illegal aliens coming in through our southern border than goods coming in through our struggling ports.","date":"Wed Oct 20 18:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another day, another baseless lie by the President. \n\nNo large company pays less than $3 in taxes a year.","date":"Wed Oct 20 16:57:45 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#Taliban terrorists are awarding the families of suicide bombers and there's nothing but crickets from the Biden Administration.","date":"Tue Oct 19 23:00:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden thinks being the President is just child's play. https://t.co/rEvpjTRsu9","date":"Tue Oct 19 21:47:25 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The average American's paycheck is over $600. \n\nThe average American's bank account is going to be snooped on by the IRS at least once a month if the Dem's budget bill passes.","date":"Tue Oct 19 15:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"TUNE IN: I'm joining @kevincdietz on @wjrradio at 11:05 to talk about the #BidenBorderCrisis \n\nhttps://t.co/iXDq1trOW6","date":"Tue Oct 19 14:48:28 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration has ignored \n\n-the #BidenBorderCrisis\n\n-the #AfghanistanCrisis\n\n-the #InflationCrisis\n\nThey can’t ignore the growing crisis in the Indo-Pacific","date":"Tue Oct 19 14:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If there's not a problem at the border, then why hide when you're transporting unaccompanied alien children from the border to the interior?\n\nhttps://t.co/GXtZjY8XHy","date":"Tue Oct 19 13:40:26 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America stands by our friend and ally #Taiwan in the face of bullying and harassment by the #CCP. \n\nChina's menacing behavior does nothing to advance peace and stability in the region and the world. \n\nhttps://t.co/aLk7KNyYV6","date":"Tue Oct 19 00:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Yet another example of why these mandates are about nothing but control. \n\nhttps://t.co/48lSNctPoh","date":"Mon Oct 18 22:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It may not be so hard if the far-left weren't constantly trying to defund them or supporting anti-police movements. \n\nhttps://t.co/qQ8kAtBuRI","date":"Mon Oct 18 21:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If Pete Buttigieg is going to continue to be on paternity leave, in the midst of a massive supply chain crisis, an acting Secretary of Transportation MUST be instated.","date":"Mon Oct 18 20:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is the United States of America. \n\nOur intelligence community should not be surprised by anything our foreign adversaries do. \n\nWhat other intelligence gaps are we missing?","date":"Mon Oct 18 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If you, or anyone you know, is interested in applying for a U.S. Military Academy nomination, the deadline to apply is Friday, October 22. \n\nIf you need further assistance with an application, please call my Washington Township office at 586-697-9300. https://t.co/ruHPRfsBA2","date":"Mon Oct 18 18:28:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"By reinstating the Remain in Mexico Policy, the Biden Admin is finally starting to move in the right direction to end the #BidenBorderCrisis. https://t.co/r6zkKmRp87","date":"Mon Oct 18 15:48:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Colin Powell's service and commitment to his country is something to be remembered and honored. He was a true American hero. My prayers are with his family and loved ones today.","date":"Mon Oct 18 14:11:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As if his first 15 minutes of fame weren’t enough, Dr. #Fauci wants to tell Americans how they can spend their holidays for a 2nd year in a row.","date":"Sun Oct 17 19:02:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I will always #backtheblue. \n\nOn this #nationalpoliceweekend, we honor the brave men and women in uniform who keep our communities safe.","date":"Sun Oct 17 18:04:04 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"While #China continues to threaten the safety and security of the world by launching missiles from space, @POTUS wants to cut our defense spending. \n\nhttps://t.co/UGIPb35qUD","date":"Sun Oct 17 16:52:54 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Saddened to hear of Dr. Dan Benishek’s passing. He served Michigan’s 1st Congressional District honorably. Sending prayers to his family and loved ones.","date":"Sat Oct 16 21:13:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Big tech is bowing to #CCP pressure. \n\nWhose side are they on?\n\nhttps://t.co/iU3sVnNL1N","date":"Fri Oct 15 22:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Day 268 of waiting on a little bit of truth, transparency and consistency from the Biden Administration and Congressional Democrats.","date":"Fri Oct 15 20:39:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Last night, I joined more than 200 pro-life friends in St. Clair County to thank them for their tireless work and advocacy to protect the unborn.\n\nIn Congress, I will always fight to protect life. https://t.co/vIOxpBwfg5","date":"Fri Oct 15 19:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#China's continued harassment of #Taiwan is unacceptable. \n\nDemocracy should be protected, plain and simple. \n\nhttps://t.co/4Hg0bByZrH","date":"Fri Oct 15 18:03:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Some people are taking \"land of the free\" a bit too literally. \n\nNothing is free, especially not a $3.5 trillion socialist agenda.","date":"Fri Oct 15 17:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Socialism ≠ Infrastructure. Plain and simple. \n\nWatch below ⬇ https://t.co/KGAJBfNUfm","date":"Fri Oct 15 16:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Remain in Mexico policy works. \n\nThe #BidenBorderCrisis could have been avoided if @POTUS kept this policy in place since January. \n\nhttps://t.co/SlXHQJv8yV","date":"Fri Oct 15 15:33:15 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats feed their \"eat the rich\" rhetoric to America, meanwhile they want to give huge tax breaks to the 1% with their $3.5 trillion socialist agenda.","date":"Thu Oct 14 23:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want your hard-earned taxpayer dollars to go towards abortions? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 22:57:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want early childcare to become even more difficult to find? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 22:39:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want America’s border crisis to get even worse? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 22:22:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want illegal immigrants to have better opportunities and benefits than American citizens? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 22:04:37 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want America to rely more on Russia and China for our energy needs? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 21:47:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want your taxes to skyrocket? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 21:31:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Do you want the government having access to your bank account? \n\nThat's what is in the Democrats' budget bill.","date":"Thu Oct 14 21:16:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This White House couldn't be any more out of touch with the American people. \n\nHow many more crises are they going to ignore?\n\nhttps://t.co/PqlJkh8MEJ","date":"Thu Oct 14 19:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"You can't have liberty and freedom without life, but the pro-choice far left are trying to make you think you can.","date":"Thu Oct 14 18:21:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations to Bethany for receiving Trooper of the Year in Caro. \n\nHer dedication and hard work have kept some of the most vulnerable in our #MI10 communities safe. \n\nhttps://t.co/LqfMtGcIJa","date":"Thu Oct 14 15:39:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"October is a month to remember those we have lost and to remind those who are battling that they are strong and never alone in their fight. #BreastCancerAwarenessMonth https://t.co/UVovmCPaMH","date":"Wed Oct 13 21:31:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Dale Kildee was a leader in Michigan who served the Flint area well for three decades. \n\nPraying for his family and friends during this difficult time.\n\nhttps://t.co/7tpO48d8AZ","date":"Wed Oct 13 19:03:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"America’s strategic relationships with Panama and Colombia are key to ensuring our safety and security. \n\nI enjoyed getting a firsthand look at these partnerships at work with @SenJoniErnst and @RepFeenstra. \n\nhttps://t.co/1L0H0P6P78","date":"Wed Oct 13 18:25:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy birthday to the @USNavy! \n\nWe thank you for your honor, courage and commitment to the United States over the past 246 years. #ResilientandReady https://t.co/oNFofSGx6z","date":"Wed Oct 13 16:31:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It’s about time. Our border communities are suffering from the economic pandemic caused by the Biden Administration’s unnecessary extended border closure. https://t.co/XQPuEv5byd","date":"Wed Oct 13 03:36:04 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I voted against raising the debt ceiling. \n\nThe Democrats are bankrupting our country and saddling our future generations with an incredible amount of debt. \n\nhttps://t.co/8mU2EFtkMW","date":"Wed Oct 13 00:41:21 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Farmers keep food on our tables, clothes on our backs and jobs in our economy. \n\nThank you to all farmers for the hard work you do everyday from sun up to sundown. #ThankAFarmer #NationalFarmersDay https://t.co/0ZbXtUoxiQ","date":"Tue Oct 12 23:00:26 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Labor shortages.\nSupply chain issues.\nIncreased inflation. \n\nBut sure, President Biden is building back better.","date":"Tue Oct 12 12:00:38 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we celebrate Christopher Columbus landing in America in 1492 and honor the many achievements of Italian-Americans.","date":"Mon Oct 11 18:28:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Walls work. \n\nIt doesn’t make any sense that DHS would cancel border wall contracts in the midst of the #BidenBorderCrisis.\n\n#BuildBackNothing \n\nhttps://t.co/xkmO65DeqX","date":"Sun Oct 10 22:37:21 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On #WorldMentalHealthDay, remember that if you are struggling or have struggled in the past, you are not alone. \n\nTaking care of your mental health is not something to be ashamed of. https://t.co/dZLL1jimDy","date":"Sun Oct 10 14:03:47 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"People choose to take out student loans. It’s their responsibility to pay them back, not the government’s. https://t.co/culBWpqAl6","date":"Sat Oct 09 23:35:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you to all postal workers who work to keep the world connected. \n\nHappy #WorldPostDay. https://t.co/tdO4uNTKWd","date":"Sat Oct 09 14:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's heartwarming to see our Sterling Heights Police officers going above and beyond the call of duty to help local residents.  \n\nGreat work, Officer Coates! https://t.co/mBTRyg1mof","date":"Fri Oct 08 21:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another month, another disappointing jobs report.  https://t.co/TxTBNHEffv","date":"Fri Oct 08 18:45:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy #National4HWeek! \n\nThis week, we celebrate @4H and the ways they empower children to participate and contribute to their local communities. https://t.co/NTlblEuT1D","date":"Fri Oct 08 13:22:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"During #NationalHispanicHeritageMonth, we celebrate the contributions and accomplishments of our Hispanic American neighbors. https://t.co/BuRyhRrIDD","date":"Thu Oct 07 21:28:41 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepMoBrooks @RepKatCammack @RepBradWenstrup @RepDLamborn @RepAndyBiggsAZ @RepMalliotakis @RepJackBergman @DesJarlaisTN04 @RepRWilliams @RepMMM @RepHuizenga @RepBenCline @WarrenDavidson @RepMaryMiller @RepChrisStewart @TXRandy14 @CongressmanGT @RepWaltzPress @RepDonaldsPress","date":"Thu Oct 07 18:30:55 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepPatFallon @RepCarlos @RepMikeGarcia","date":"Thu Oct 07 18:30:55 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBarryMoore @RepBost @RepRussFulcher @RepBuddyCarter @RepSteel @RepDavidValadao @RepDLesko @RepCawthorn @RepTedBudd @RepBurgessOwens @RepStefanik @congbillposey @RepEllzey @RepVanTaylor @RepMann @RepHartzler @RepBalderson @GReschenthaler @RepHagedorn @RepRalphNorman","date":"Thu Oct 07 18:30:55 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I sent a letter to @TheJusticeDept to demand answers on why the DOJ is targeting parents who are opposing CRT and COVID mandates in our schools. \n\nThis politicization of our justice department is unheard of and unacceptable. Read below ⬇ https://t.co/5jgz85GseS","date":"Thu Oct 07 18:30:54 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepRosendale @RepMcKinley @RodneyDavis @RepWebster @VernBuchanan @KenCalvert @RepFredKeller @RepGregSteube @RepAnnWagner @RepDavidRouzer @RepJeffDuncan @RepTomEmmer @RepBobGibbs @RepTenney @RepBrianMast @RepGrothman @RepJimBanks @PeteSessions @RepBethVanDuyne @RepGarbarino","date":"Thu Oct 07 18:30:54 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thank you @MacombSheriff Wickersham for taking the time to talk with me about issues facing Macomb County and how they effect our law enforcement. \n\nI also enjoyed a ride-along where I got to see the work our sheriff's department does firsthand. https://t.co/TZm7bOGaCQ","date":"Wed Oct 06 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden's botched withdrawal from #Afghanistan caused dangerous prisoners to be released from Bagram Air Base. \n\nHis failures cost 13 Americans their lives.\n\nhttps://t.co/fNTdo3RGe7","date":"Wed Oct 06 20:35:36 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Democrats are serving up $3.5 trillion in pork that Americans don't want or need. https://t.co/P3eAzauC6B","date":"Wed Oct 06 19:01:50 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy German-American Day. \n\nToday, we celebrate the many contributions of Americans of German heritage to the United States and #MI10. https://t.co/RZbhzB6XGq","date":"Wed Oct 06 17:38:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"If Democrats want to pass an actual infrastructure bill, then let's pass one. \n\nBut stop disguising excess spending as infrastructure. \n\nJust be honest with the American people. https://t.co/RTGfBo1UB5","date":"Wed Oct 06 15:49:19 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It was an honor to present 10 extraordinary female leaders with the She Leads America \"Christian Women of Distinction\" awards this weekend. \n\nThese women are trailblazers who have shattered glass ceilings and touched the lives of countless people around the world. https://t.co/2YE68Y3AW8","date":"Wed Oct 06 13:55:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tune in: I’m joining @seanspicer on @newsmax at 6:00 p.m. to discuss the Democrats’ out of control spending.","date":"Tue Oct 05 21:55:38 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is nothing more than a scare tactic to silence parents who are pushing back against unnecessary mandates and an agenda they disagree with being forced down their children's throats. https://t.co/OrZMv4icTA","date":"Tue Oct 05 19:06:47 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we celebrate those who teach our next generation and inspire them to become better versions of themselves every day. Happy #WorldTeachersDay https://t.co/lz9YRdsrkP","date":"Tue Oct 05 18:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Democrats are trying to give the IRS complete access to your bank accounts. \n\nThis overreach is an unprecedented invasion of your privacy and I'm fighting hard to ensure this doesn't become law.   https://t.co/ADwZE2IK0J","date":"Tue Oct 05 17:07:58 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I toured Close Quarters Tactical in Shelby Township this morning to see the work they’re doing to not only make firearms, but to equip our military, law enforcement and civilians with the knowledge and training they need to express their full 2nd Amendment rights. https://t.co/fgstQ5wnYc","date":"Tue Oct 05 00:44:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Since when did trillions of dollars actually equate to zero dollars? \n\nSomeone get the White House a calculator.","date":"Mon Oct 04 21:43:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation is taxation. \n\nInflation is taxation. \n\nInflation is taxation.","date":"Mon Oct 04 20:26:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Get out of the way? \n\nHow about we stop putting America further and further into debt. \n\nThere is absolutely no logic behind this.\n\nhttps://t.co/QIhCaA1aqc","date":"Mon Oct 04 19:02:26 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"When do we get to the better part of Biden’s build back better plan?","date":"Mon Oct 04 18:25:55 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The right to vote is key to establishing and strengthening a Democracy. I’m encouraged to see so many Qataris exercising this right in their first legislative elections. https://t.co/zzxWH8qIKk","date":"Mon Oct 04 14:23:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"\"We have borders. The idea that we can just have open borders is something that ... as a practical matter, is unsustainable.\" Agreed, President Obama, agreed. Now, can you please help @POTUS understand that we have a crisis? https://t.co/1Uck6U05cr","date":"Sun Oct 03 23:33:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#China continues its reckless and destabilizing behavior in the Taiwan Strait.  America stands by our true friend and ally, #Taiwan, against the bullying and aggression of the #CCP. https://t.co/CFQlgDsGeO","date":"Sun Oct 03 22:02:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I had the extreme honor to meet the parents of Sgt. Nicole Gee who was tragically killed in the Aug. 26th bombing in Kabul. \n\nI'm working to pass a bill to posthumously award Nicole and the 12 others who died that day the Congressional Gold Medal to keep their memory alive. https://t.co/O43EPsvqMQ","date":"Sat Oct 02 00:49:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Democrats are trying to bankrupt America. \n\nThis isn’t about infrastructure, it’s about the government having complete control of your life.\n\nhttps://t.co/KI2nj92eAg","date":"Fri Oct 01 22:35:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Democrats either have the votes, or they don't. We need to stop wasting time and pretending today is still Thursday and vote on this \"infrastructure\" bill. #failuretogovern","date":"Fri Oct 01 19:55:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"As the home of the American automobile, Michigan is one of the diamonds of American manufacturing. \n\nThank you to all manufacturers who have helped contribute to the innovation and prosperity of our great country. https://t.co/IfsfvPy0En","date":"Fri Oct 01 15:49:43 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Helping those struggling with addiction has been something near and dear to my heart for decades. \n\nOn this International Day of Recovery, we wear purple in honor of those recovering or suffering from substance abuse addiction. https://t.co/9LMBIE9SnU","date":"Thu Sep 30 22:16:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #NDAA is not the place for Democrats to include \"red flag\" provisions that would violate our servicemembers #2A rights. \n\nI'm proud to sign onto this letter with @RepBice and @RepRichHudson to urge House leadership to strip this dangerous provision from the bill.","date":"Thu Sep 30 20:48:49 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats want to spend TRILLIONS on \"human infrastructure\" and don't care who they bankrupt along the way. \n\nI joined @kevincdietz on @wjrradio yesterday to discuss this $3.5T bill. https://t.co/8J2tPTbM6h","date":"Thu Sep 30 20:05:19 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis is a national security and public health nightmare. \n\nWe need to secure the border and stop this flood of illegal immigration at our southern border.\n\n https://t.co/bQl1yQJjy2","date":"Thu Sep 30 15:48:36 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There are too many unanswered questions following today's @HASCRepublicans hearing. \n\nI sent a letter to Secretary Austin and Gen. Mark Milley to demand a classified briefing on the Afghanistan withdrawal. https://t.co/pTSQTxroqq","date":"Wed Sep 29 21:03:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congress hasn’t conducted any real business in a long time. \n\nIt’s time to stop messing around and time to start passing legislation that will help the American people.","date":"Wed Sep 29 18:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"What’s one thing I have in common with some NBA players? \n\nWe think it’s a person’s right to choose whether they take the vaccine, and it should never be mandated.","date":"Wed Sep 29 17:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I had a productive meeting with Assistant Foreign Minister Lolwah Al-Khater. \n\nQatar has been a vital partner in the US’ efforts to rescue Americans and our Afghan allies after the failed withdrawal from Afghanistan. https://t.co/KhVy8WWYhf","date":"Wed Sep 29 16:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden is outright lying about what his military generals told him. \n\nOr he’s forgotten it all in the span of a month. \n\nWhich is it? \n\nThe American people deserve to know the truth.","date":"Wed Sep 29 16:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we remember and honor the sacrifice of U.S. military veterans who bravely fought for freedom in foreign wars. \n\nWe salute you and will never forget your commitment to our country. https://t.co/pzBZFWpRnW","date":"Wed Sep 29 15:35:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I wonder who @SpeakerPelosi will blame now?","date":"Tue Sep 28 15:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The more the White House continues to ignore the crisis at the southern border, the more Americans will suffer from it.\n\nhttps://t.co/S5CJYFtFYh","date":"Tue Sep 28 14:34:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Democrats are reaching into an empty wallet to fund their $4.7 trillion socialist spending spree. \n\nAmerica can't spend what it doesn't have!","date":"Mon Sep 27 19:33:54 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation due to the Biden Administration’s policies continues to hurt Michiganders.\n\nhttps://t.co/Kfnjq1khe4","date":"Mon Sep 27 17:59:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I will always protect the Second Amendment. \n\nRead my full statement on the NDAA red flag language ⬇️ https://t.co/gVu6UK4eb4","date":"Sun Sep 26 23:57:44 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"To our #GoldStarMothers and #GoldStarFamilies, we thank you for your sacrifice. \n\nToday we honor you and are forever grateful for the selflessness of your loved ones. \n\nWe will never forget. https://t.co/nL4CXgkkhZ","date":"Sun Sep 26 18:37:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Hunting and fishing are not only key to keeping our ecosystems balanced, but are great activities to partake in with your loved ones. \n\n#MI10 is home to many different kinds of wild game and fish. \n\nTo learn more about opening dates for this season, visit https://t.co/wtJycwOHzG https://t.co/lNz1n1vr7w","date":"Sat Sep 25 14:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This bill isn't the Women's Health Protection Act, it's #AbortionOnDemand and that's why I voted NO. https://t.co/mnXDTBzsus","date":"Fri Sep 24 15:47:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Michigan Indian Day! https://t.co/DDqBC0MlIs","date":"Fri Sep 24 13:25:56 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Great to have Anna and Daniel from Macomb County stop by my Washington, DC office today! \n\nIf you're a constituent and you're ever in Washington, I'd love for you to stop by and say hello! https://t.co/U1ajf8PJKV","date":"Thu Sep 23 20:44:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Looks like Biden's stance on Haiti hasn't changed much since 1994","date":"Thu Sep 23 19:15:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden had no problem closing small businesses during the pandemic, but refuses to close the southern border. \n\nWho does he really care about?","date":"Thu Sep 23 18:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My office is continuing to receive messages from our Afghan allies who are still desperately trying to leave Kabul. \n\nThe work has not stopped just because @POTUS pulled the military out and gave up.","date":"Thu Sep 23 17:48:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Thanks to @MI_Corn Growers for stopping by my DC office today! \n\nI always enjoy meeting with #MI10 farmers to discuss important legislation impacting our agriculture community. https://t.co/sFRYRjkikA","date":"Wed Sep 22 23:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations Senator @RoyBlunt on receiving the Friends of Australia Caucus Award. \n\nI enjoyed meeting with Prime Minister Scott Morrison. \n\nIt was an honor to be a part of the event, and I look forward to continuing to work to strengthen the US-Australia relationship. https://t.co/fdJz5jv2Mh","date":"Wed Sep 22 22:13:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our CBP and ICE agents risk their lives to ensure our nation's safety and security. \n\nWe need to secure our southern border immediately to get this crisis under control. \n\nhttps://t.co/VV5eJLVLLt","date":"Wed Sep 22 19:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@Robert_Aderholt","date":"Wed Sep 22 18:16:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepJeffDuncan @RepCloudTX @RepFeenstra @RepRalphNorman @RepBrianBabin @RepMullin @RepJacobs @CongressmanGT @RepTimmons @RepAnnWagner @RepWalberg @RepGosar @rep_stevewomack @RepRosendale @RepBenCline @RepRWilliams @RepDLesko @CongressmanHice @RepFranklin @RepLaMalfa","date":"Wed Sep 22 18:16:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBradWenstrup @RepMcKinley @RepBobGood @Rep_Clyde @RepBoebert @RepTiffany @RepWebster @RepRonnyJackson @GReschenthaler @replouiegohmert @RepDavidKustoff @RepAndyHarrisMD @RepJohnRose @RepHuizenga @RepBost @RepFischbach @michaelcburgess @CongPalazzo @RepMikeJohnson","date":"Wed Sep 22 18:16:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I sent a letter to @TheJusticeDept, @HHSGov and @NIH to demand @PittTweet be investigated over their use of born-alive aborted babies to aid in research projects. \n\nYou can read the letter below. https://t.co/pux27qrJR9","date":"Wed Sep 22 18:16:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@SenTedCruz @JohnBoozman @SenBillCassidy @SenJohnThune @SenatorRisch @JerryMoran @SenTomCotton @SenRubioPress @SenatorWicker @SenatorBraun @SenatorRounds @SenHydeSmith @SenRickScott @MarshaBlackburn @RandPaul @JimInhofe @Jim_Jordan @RepJimBanks @RodneyDavis @JakeLaTurner","date":"Wed Sep 22 18:16:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I enjoyed speaking with @BayanRahman  today about the important relationship between the U.S. and Kurdistan.","date":"Tue Sep 21 21:44:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, on World #Alzheimers Day, we raise awareness for those in our lives who suffer from this horrible disease. https://t.co/4cHtu1f9OS","date":"Tue Sep 21 16:03:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration's lack of consistency is directly harming small businesses and families in #MI10.\n\nNo more extensions. \n\nOur northern border needs to be fully opened. \n\nhttps://t.co/uiCfgNf6co","date":"Tue Sep 21 13:46:45 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"There's no logic behind the Biden Administration's decisions. \n\nWhy does our northern border remain closed when travelers can now fly into the U.S. from anywhere in the world? \n\nhttps://t.co/trQdqHkPeo","date":"Mon Sep 20 15:35:20 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"TUNE IN: I'm joining @kevincdietz on @wjrradio at 10:05 to talk about the border crisis and what we need to do to secure our border.\n\nhttps://t.co/iXDq1trOW6","date":"Mon Sep 20 14:04:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis is getting absolutely out of control. We must secure our southern border and start enforcing our immigration laws. Our nation’s safety and security depends on it.","date":"Sun Sep 19 15:08:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy 74th Birthday to the @usairforce and the @AirNatlGuard. \n\nIn Congress, I'm proud to represent Selfridge Air National Guard Base, which is vital to our nation's defense! https://t.co/2vi2EPszen","date":"Sat Sep 18 22:49:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Innocent civilians lost their lives due to the Biden Administration’s intelligence failure. The American people deserve truth and transparency from our government. Enough of the lies. https://t.co/XZA0uFsFZf","date":"Fri Sep 17 20:35:06 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepTedLieu @RepPaulTonko @jahimes @RepBrownley @RepCicilline @RepBrianHiggins @RepAndyLevin @RepDelBene @BettyMcCollum04 @RepGraceMeng @RepJoshG @SanfordBishop @RepDeborahRoss @RepBeatty @RepAdams @RepRonKind","date":"Fri Sep 17 17:41:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"With 293 bipartisan cosponsors in the House and a growing number of cosponsors for the companion bill in the Senate, it's important that we move quickly to pass my legislation to honor the 13 fallen servicemembers with the Congressional Gold Medal. \n\nhttps://t.co/voOU2yZuko","date":"Fri Sep 17 17:41:51 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is actively trying to hide the #bordercrisis from the American people.\n\nIt's time for some truth and transparency from our government.","date":"Fri Sep 17 16:25:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, we honor and remember POW/MIA servicemembers who have not returned home to their loved ones. \n\nWe will never forget the sacrifices you made for our country. https://t.co/HPBFoJlawh","date":"Fri Sep 17 15:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"On September 17, 1787, our Founding Fathers signed the United States Constitution. \n\n234 years later, I'm proud to serve under an oath that requires me to uphold this great document. https://t.co/ZG7ueOXaSD","date":"Fri Sep 17 14:50:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Ending Title 42 would be detrimental to our crumbling immigration system. \n\nThis court ruling will only exacerbate the #BidenBorderCrisis \n\nhttps://t.co/wiuW5bg9xG","date":"Thu Sep 16 20:34:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepBarragan @RepJoeNeguse @RepOHalleran @NydiaVelazquez @RepKahele @RepMarkTakano @RepCartwright @RepSpeier @RepMeuser @RepPeterDeFazio @RepSeanMaloney @RepKClark @RepDonBeyer @PeterWelch @RepStricklandWA @CongressmanRaja @GerryConnolly","date":"Thu Sep 16 20:12:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepKayGranger @congbillposey @RepKenBuck @RepColinAllred @RepTomSuozzi @RepBourdeaux @RepAndyBarr @RepMrvan @repkevinhern @RepJahanaHayes @RepCheri @Call_Me_Dutch @RepMikeQuigley @RepCarbajal @repdelgado @chelliepingree @RepKimSchrier @RepRitchie @RepCharlieCrist","date":"Thu Sep 16 20:12:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I’m happy to announce @SteveDaines, @SenWarren alongside 31 bipartisan Senators introduced the Senate companion to my bill to award the Congressional Gold Medal to the 13 U.S. military servicemembers killed in Afghanistan on August 26, 2021.","date":"Thu Sep 16 20:12:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My House bill to award these heroes with the Congressional Gold Medal now has 277 bipartisan cosponsors.","date":"Thu Sep 16 20:12:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The White House wants to distract us from the crisis their policies have caused, but the #BidenBorderCrisis continues to worsen each month. https://t.co/P6YoEpyVxY","date":"Thu Sep 16 19:00:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS claims the middle and working class won't pay more in taxes due to his outrageous spending. \n\nThis is a lie!","date":"Thu Sep 16 18:29:19 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Businesses, regardless of size, will suffer from vaccine mandates.\n \nIt’s a personal choice between you and your doctor, not President Biden. https://t.co/GV4HWZgC6d","date":"Thu Sep 16 16:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Things America can’t afford right now:\n\n➡$3.5 trillion for social welfare programs\n\n➡raising the debt ceiling https://t.co/a77a58UaEg","date":"Thu Sep 16 15:46:55 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Wishing all in #MI10 who celebrate a very meaningful and easy fast this Yom Kippur. https://t.co/2lRMOTLOM5","date":"Wed Sep 15 21:06:39 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #BidenBorderCrisis continues to worsen due to @POTUS' immigration policies.","date":"Wed Sep 15 19:51:44 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I gave a legislative update on the important work I'm doing to advocate for Selfridge Air National Guard Base at the Michigan Air Force Association \"Business Over Breakfast.\" \n\nI will continue working to support Michigan's defense assets as a member of @HASCRepublicans https://t.co/ywixUwdjmz","date":"Wed Sep 15 16:05:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Small businesses are the backbone of our country. \n\nI am fighting for policies that support #MI10 small businesses. \n\n#NationalSmallBusinessWeek https://t.co/T0c5Mvme4Y","date":"Wed Sep 15 15:15:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm joining @kevincdietz on @wjrradio at 10:35 a.m. to discuss the horrific tax hikes the Democrats are proposing to pay for Bernie Sanders' job killing, anti-American socialist wish list. https://t.co/KnS7jWbtAQ","date":"Wed Sep 15 14:29:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another example of Biden's failed foreign policy of leading from behind and cowering to our #CCP adversaries.","date":"Tue Sep 14 22:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I enjoyed providing a legislative update to the Gratiot Avenue Chamber of Commerce today. \n\nOur #MI10 businesses are eager for the government to get out of the way so they can fully recover from the unnecessary shutdowns and mandates. https://t.co/Z0TkB9GpfB","date":"Tue Sep 14 20:59:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our top military brass should never make promises to our adversaries. \n\nGeneral Mark Milley is unfit to serve.","date":"Tue Sep 14 20:35:15 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"\"General Li, I want to assure you that the American government is stable and everything is going to be OK. We are not going to attack or conduct any kinetic operations against you.\" - Gen. Mark Milley","date":"Tue Sep 14 20:35:15 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Gen. Mark Milley made secret calls to our adversary and chose to put #China over his own country.","date":"Tue Sep 14 20:35:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"\"Gen. Li, you and I have known each other for now five years. If we're going to attack, I'm going to call you ahead of time. It's not going to be a surprise.\" - Gen. Mark Milley","date":"Tue Sep 14 20:35:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our top General has shown to have more allegiance to the #CCP than the USA. \n\n@POTUS should remove him now! \n\nhttps://t.co/inYzBbm3CY","date":"Tue Sep 14 20:16:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Freedom is one of the greatest things about being an American. \n\nTake that away, and you take away everything that our forefathers fought for. \n\nhttps://t.co/FgYkqP9xnW","date":"Tue Sep 14 20:10:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Inflation is a tax on every American. \n\nDo you know who's to blame for your everyday costs rising? https://t.co/3PQAesEOQM","date":"Tue Sep 14 18:57:29 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS is acting like a dictator, making moves HE KNOWS he can't make. \n\nCongress can't let these unconstitutional mandates and executive orders continue at the expense of American's livelihoods. https://t.co/SMtUXuno4e","date":"Tue Sep 14 13:26:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's horrifying to see how the #Taliban is treating women in #Afghanistan. \n\nShould we be surprised? \n\nThe Taliban has acted in this barbaric way for decades.","date":"Mon Sep 13 20:07:31 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@POTUS is acting like a dictator, making moves HE KNOWS he can't make.\n\nCongress can't let these unconstitutional mandates and executive orders continue at the expense of American's livelihoods. https://t.co/F7500OeSlT","date":"Mon Sep 13 17:30:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #CCP shows they have no interest in working with the US or being a peaceful player in global affairs.\n\nBullying doesn't work @AmbQinGang, especially against the United States. \n\nhttps://t.co/AKT1nelm6o","date":"Mon Sep 13 16:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is welcome news for #MI10. \n\nPresident Biden's horrible plan to remove the step-up in basis would destroy the family farm, and I'm proud to have fought alongside our #MI10 family farmers to protect them against this devastating tax. \n\nhttps://t.co/OgdnuUczzx","date":"Mon Sep 13 15:38:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tracking private citizens' bank account transactions is unprecedented and entirely unnecessary. \n\nThis proposal will do nothing but burden our banks and continue to diminish the American people's trust in our government.","date":"Mon Sep 13 14:33:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Enjoyed throwing the first pitch at the Utica Unicorns game today! It’s a great day for baseball at beautiful Jimmy John’s Field. https://t.co/WIzNIu9MJd","date":"Sun Sep 12 18:18:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"It's been 20 years since the world stood still as the unimaginable happened to our great nation. \n\nWe look to the future knowing we can #neverforget the past. https://t.co/F1VXaLKpLb","date":"Sat Sep 11 15:17:27 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, on World Suicide Prevention Day, my heart is with anyone who has ever struggled with depression. \n\nIf you or someone you know needs help, please call the National Suicide Prevention Hotline at 800-273-8255.","date":"Fri Sep 10 23:30:56 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm joining @LizMacDonaldFOX on the @EveningEdit at 6:00 p.m. to talk about President Biden's unconstitutional vaccine mandates.\n\nTune in to @FoxBusiness 📺","date":"Fri Sep 10 21:22:21 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Who knew \"building back better\" would include massive inflation increases? \n\nBiden's America just keeps getting more and more expensive. \n\nhttps://t.co/8hN0xbko7m","date":"Fri Sep 10 15:00:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS went into his presidency promising a \"summer of freedom.\" \n\nLast I checked, freedom doesn't mean mandates and threats against the American people. \n\nKeep America the Land of the Free!","date":"Fri Sep 10 13:55:46 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #Taliban is a terrorist organization and women are in grave danger under their control in #Afghanistan.\n\nA leopard cannot change its spots and the Taliban is more barbaric than ever. https://t.co/AJ9KOBcfG9","date":"Thu Sep 09 16:26:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The @ATFHQ should never be led by a gun control advocate.\n\nI urge President Biden to nominate someone who is truly tough on actual crimes to lead the ATF. https://t.co/gKyII4FoHV","date":"Thu Sep 09 14:45:02 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I sent a letter to @ATFHQ Acting Director Regina Lombardo urging her to reject a proposed rule that will violate Americans' 2nd Amendment rights by adding more government control to pistol stabilizers. #2A  \n\nRead the full letter:  https://t.co/MjIi7JVLck https://t.co/s2bvsZs1vk","date":"Wed Sep 08 22:02:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Romeo Peach Festival is a fantastic annual tradition in #MI10 dating back to 1931. \n\nI enjoyed visiting with neighbors at the festival this weekend and attending the Romeo Lion's Club breakfast! https://t.co/bb9eUhKdNp","date":"Wed Sep 08 19:24:59 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@SteveScalise @RepDebDingell @RepEllzey @repdavidscott @RepLaHood @EleanorNorton @RepNikema @RepAnnieKuster @RepBrianBabin @RepDwightEvans","date":"Wed Sep 08 18:25:28 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, 10 additional Members of Congress cosponsored my bipartisan bill to award the Congressional Gold Medal to the 13 servicemembers killed in #Afghanistan. \n\nhttps://t.co/IRcx48evnl","date":"Wed Sep 08 18:25:28 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'd like to wish #Macedonia and my Macedonian-American friends in #M10 a very happy independence day! #Macedonia30","date":"Wed Sep 08 14:16:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Our country is suffering from an economic pandemic and labor shortages.\n\nI’m hopeful the American people will now return to work so our economy can finally recover. https://t.co/Gevri5xFs1","date":"Tue Sep 07 19:00:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Happy Rosh Hashanah to all who celebrate! https://t.co/cCmEy68FrC","date":"Tue Sep 07 18:02:29 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #Taliban's newly appointed interior minister is an actual terrorist on the FBI's most wanted list.  \n\nAmerica should never negotiate or legitimize terrorists. \n\n@POTUS has paved the way for them to take control of #Afghanistan.","date":"Tue Sep 07 16:14:52 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"TUNE IN: I’m joining @kevincdietz on @wjrradio at 11:45 to talk about what I’m working on in Congress.https://t.co/KnS7jWbtAQ","date":"Tue Sep 07 15:38:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today we celebrate the hardworking men and women who have helped make America the greatest country on earth. \n\nThank you for all you do.  \n\nHappy Labor Day! 🇺🇸 https://t.co/URNn3sv1IA","date":"Mon Sep 06 15:21:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Taliban is a terrorist group.\n\nAnd @POTUS wants to negotiate with them.\n\nWe already gave them billions in our military equipment.\n\nWhat else does he want to give them? https://t.co/kxBIXVUADC","date":"Fri Sep 03 23:17:01 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepFrenchHill @repdinatitus @RepSwalwell @RepFletcher @RepTiffany @RepSpanberger @RepRichardNeal @RepPeteStauber @michaelcburgess @RepAlGreen @RepHankJohnson @Kilili_Sablan @RepFrankLucas @RepStephenLynch @RepMaloney @RepJamesComer @RepBera @RepMikeJohnson","date":"Fri Sep 03 20:30:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepCloudTX @RepMullin @RepDWStweets @RepCuellar @PeteSessions @RepTimRyan @RepDanKildee @RepClayHiggins @RepDerekKilmer","date":"Fri Sep 03 20:30:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepLoriTrahan @RepJoeCourtney @RepFischbach @RepAmata @RepJohnKatko @RepFredKeller @RepWebster @RepDannyDavis @RepJuanVargas @RepKManning @RepGosar @RepHalRogers @RepLoisFrankel @RepEspaillat @RepDeanPhillips @RepLouCorrea @RepJohnJoyce @RepDavidTrone @RepRonEstes @RepHagedorn","date":"Fri Sep 03 20:30:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@GOPLeader @USRepLong @RepCindyAxne @AustinScottGA08 @RepSusanWild @RepJeffDuncan @replouiegohmert @RepScottPerry @JudgeCarter @RepSteel @michaelgwaltz @RepArmstrongND @DrNealDunnFL2 @RepMGS @RepRutherfordFL @RepTimmons @RepKevinBrady @RepRosendale @RepArrington @VernBuchanan","date":"Fri Sep 03 20:30:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Since Tuesday, 73 more Members of Congress, including @GOPLeader, have joined my bill to award the Congressional Gold Medal to the 13 servicemembers killed in #Afghanistan last week. Read more below ⬇\n\nhttps://t.co/WJ707MKGjg","date":"Fri Sep 03 20:30:15 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"TUNE IN: I'm joining @Varneyco at 9:15 a.m. to discuss my bill to award the Congressional Gold Medal to the 13 servicemembers who were killed in #Afghanistan last week.","date":"Fri Sep 03 13:04:25 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden said he was going to Build Back Better. \n\nDoes “better” mean lie and cover up? https://t.co/WeibPBPbn3","date":"Thu Sep 02 21:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We are elected to serve the American people, not lie to them. \n\nWhy can’t #POTUS, who has been in government for almost 50 years, understand that? https://t.co/KeXW3gBmX6","date":"Thu Sep 02 20:49:42 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Watch the latest on my #Iran amendments to the #NDAA that passed during the markup ⬇️ https://t.co/dlx0EQ7V4s","date":"Thu Sep 02 01:40:20 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The U.S. should not be working with terrorist organizations. \n\nPeriod. \n\nhttps://t.co/Rr5jajhKQp","date":"Wed Sep 01 21:11:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Watch below for an update on the wins I’ve secured in the #NDAA for #MI10 https://t.co/JO97QpYkoN","date":"Wed Sep 01 20:30:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The second requires the Secretary of Defense to issue a report regarding #Iran's support of militant groups that commit human rights violations.","date":"Wed Sep 01 19:11:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The first amendment requires the Secretary of Defense to issue a report regarding #Iran's support for the #Taliban and what, if any role, it played in the loss of American lives in #Afghanistan.","date":"Wed Sep 01 19:11:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The third requires the DoD to issue a report regarding #Iran's support of the oppressive Assad Regime in Syria.","date":"Wed Sep 01 19:11:17 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#Iran is clearly a threat to not only the Middle East, but the entire world. \n\nThat's why I introduced the following 3 amendments and I am thankful they just passed during the #NDAA markup.","date":"Wed Sep 01 19:11:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My bipartisan amendment with @RepRubenGallego just passed during the @HASCRepublicans #NDAA markup.\n\nThis amendment will support the A-10 Wing Replacement Program to modernize our fleet at Selfridge and keep the A-10 in the @usairforce arsenal for years to come.","date":"Wed Sep 01 19:05:33 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We must provide our military with the necessary funding to keep it the strongest in the world and to protect our nation. \n\nThat's why I'm proud to support @repmikerogersAL amendment to ensure our servicemembers have the resources they need to protect our nation #NDAA","date":"Wed Sep 01 18:37:57 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Great news for #MI10!\n\nMy amendment to the #NDAA that would pave the way for an additional ice cutter on the St. Clair River just passed in the @HASCRepublicans markup.","date":"Wed Sep 01 17:40:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My bipartisan amendment, cosponsored by @RepStefanik and @RepVeasey, that will standardize energy project policies across all services just passed during the #NDAA markup.\n\nThis will provide consistency and increase energy security at our military installations.","date":"Wed Sep 01 15:26:23 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"#NDAA update: My amendment that bans 3rd party genetic testing kits from being sold at U.S. military installations just passed.\n\nThis will ensure our genetic data doesn't end up in the hands of the #CCP","date":"Wed Sep 01 15:03:59 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"While I was able to secure additional funding for cyber security research in the base bill, my amendment will bring Selfridge, the Army and stakeholders together on developing the program.","date":"Wed Sep 01 14:47:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My work on bringing a Vehicle Cyber Security Research Center to Selfridge Air National Guard Base took a major step forward today through the passage of my amendment to the #NDAA.","date":"Wed Sep 01 14:47:09 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Heading to the @HASCRepublicans NDAA markup. This annual legislation sets the budget and expenditures for the Department of Defense and I will work to ensure the military has the resources it needs. Stay tuned throughout the day for updates on this important legislation. https://t.co/gQ7z4GsclE","date":"Wed Sep 01 14:11:40 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"No questions. \n\nNot surprised.","date":"Tue Aug 31 19:56:05 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This war is far from over. \n\nThe #Taliban and #ISIS now have free reign and an open border into America to continue their terror.","date":"Tue Aug 31 19:55:49 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Biden doesn't want to burden future generations with spending to keep our country safe, but has no problem spending trillions of dollars on a socialist wish list.","date":"Tue Aug 31 19:53:30 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden acts like his hands were tied in this entire situation. NEWSFLASH: you're the President of the United States. Act like it.","date":"Tue Aug 31 19:46:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"This is a self-congratulatory speech of an insincere, defensive President who has failed the American people and our allies time and time again.","date":"Tue Aug 31 19:40:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"90% who wanted to leave were evacuated. \n\nWhat about the other 10%? \n\nWhy didn't we work harder to rescue them?","date":"Tue Aug 31 19:37:16 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The situation in #Afghanistan is incredibly dangerous for Americans left behind. \n\nWe don't need to hear excuses from @POTUS about why they were not evacuated. \n\nAbsolutely unacceptable!","date":"Tue Aug 31 19:35:03 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepGallagher @RepTrey @RepRubenGallego @RepJasonSmith @RepRalphNorman @CongressmanGT @RepGonzalez @RepBuddyCarter @RodneyDavis @RepMikeLevin @RepTomEmmer @RepLaTurner @RepGarretGraves @RepPatFallon @RepPeteAguilar @RepDLesko @RepBalderson @RepJenniffer @RepSlotkin @RepVanTaylor","date":"Tue Aug 31 16:38:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepHorsford @RepGregPence @RepBarryMoore @RepSherrill @RepFredUpton @RepTedBudd @RepDonaldsPress @JayObernolte @RepLoudermilk @cathymcmorris @RepBost @RepJimCosta @RepMariaSalazar @RepLucyMcBath @RepGrothman @repjulialetlow @RepGolden @RepJoeMorelle @CongMikeSimpson @jdanbishop","date":"Tue Aug 31 16:38:14 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepKinzinger @RepDavidKustoff @RepLaMalfa @RepDLamborn @boblatta @RepAlLawsonJr @RepBlaine @RepElaineLuria @RepMalliotakis @RepMann @RepBrianMast @RepMcCaul @RepMcClintock @RepMcKinley @RepMeijer @RepCarolMiller @RepMMM @RepMoolenaar @RepAlexMooney @RepBlakeMoore @sethmoulton","date":"Tue Aug 31 16:38:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@BennieGThompson @RepMikeTurner @RepDavidValadao @RepBethVanDuyne @RepFilemonVela @RepAnnWagner @RepWalberg @RepWalorski @TXRandy14 @RepWesterman @RepRWilliams @RepJoeWilson @RobWittman @repdonyoung @RepAndyHarrisMD @RepLizCheney @RepTimBurchett @RepFitzgerald @RepLeeZeldin","date":"Tue Aug 31 16:38:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepGregMurphy @RepStephMurphy @RepNewhouse @RepBurgessOwens @CongPalazzo @USRepGaryPalmer @RepChrisPappas @RepPfluger @GReschenthaler @RepDavidRouzer @RepDavid @RepAdrianSmith @RepSmucker @RepDarrenSoto @RepSpartz @RepStefanik @RepBryanSteil @RepGregSteube @RepTenney","date":"Tue Aug 31 16:38:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepJohnCurtis @WarrenDavidson @DesJarlaisTN04 @RepFeenstra @RepDrewFerguson @RepBrianFitz @RepChuck @JeffFortenberry @RepFranklin @RepRussFulcher @RepMattGaetz @RepGarbarino @RepMikeGarcia @RepBobGibbs @RepCarlos @RepAGonzalez @RepBobGood @Lancegooden @RepMTG @RepMGriffith","date":"Tue Aug 31 16:38:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepMichaelGuest @brettguthrie @RepHarshbarger @RepHartzler @RepHerrell @CongressmanHice @RepAshleyHinson @RepRichHudson @RepHuizenga @RepJacobs @RepSaraJacobs @RepDustyJohnson @Jim_Jordan @RepDaveJoyce @USRepKeating @MikeKellyPA @RepTrentKelly @RepYoungKim","date":"Tue Aug 31 16:38:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"@RepRickAllen @MarkAmodeiNV2 @RepDonBacon @RepJimBanks @HerreraBeutler @RepBice @RepAndyBiggsAZ @RepGusBilirakis @RepMoBrooks @RepLarryBucshon @KenCalvert @RepKatCammack @RepJerryCarl @RepAndreCarson @RepCawthorn @RepSteveChabot @RepBenCline @TomColeOK04 @RepRickCrawford","date":"Tue Aug 31 16:38:12 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I introduced bipartisan legislation, alongside 158 cosponsors, to award the Congressional Gold Medal to the 13 servicemembers killed in #Afghanistan last week. These valiant men and women will never be forgotten. \n\nhttps://t.co/voOU2yZuko","date":"Tue Aug 31 16:38:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Pentagon claims all troops departed #Afghanistan, but dozens of highly trained military K-9s are still at the airport.\n\nWhat happened to leave no soldier behind? https://t.co/i1jqFxgbRP","date":"Tue Aug 31 14:36:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Tomorrow, I will be introducing a bill to honor our fallen servicemembers. We must do everything we can to show our appreciation for these young men and women who are gone far too soon. https://t.co/a7SfwfM25T","date":"Mon Aug 30 23:16:08 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden failed the American people and our allies who were left behind in #Afghanistan.\n\nI’m praying for their safety and will continue to do all I can to get them out. https://t.co/cXiTsS3jsk","date":"Mon Aug 30 20:54:25 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS didn't have a plan for withdrawing from Afghanistan, and now the #Taliban has billions of dollars of our military equipment. \n\nThis is disgraceful.","date":"Mon Aug 30 19:18:34 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden's leadership caused more than a dozen deaths of our military servicemembers. \n\nHe has to be held accountable. \n\nhttps://t.co/PuQDz1JIHG","date":"Mon Aug 30 17:45:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Congratulations, @RepStefanik! Wishing you, Sam and Matt all the happiness during this joyful time!","date":"Mon Aug 30 17:13:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Staff Sgt. Hoover\nSgt. Rosariopichardo\nSgt. Gee\nCpl. Lopez\nCpl. Page\nCpl. Sanchez\nCpl. Espinoza\nLance Cpl. Schmitz\nLance Cpl. McCollum\nLance Cpl. Merola\nLance Cpl. Nikoui\nHospitalman Soviak\nStaff Sgt. Knauss\n\nWe will never forget your sacrifice &amp; will forever remember your names.","date":"Sat Aug 28 21:41:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS, if you know an attack is imminent, protect our people now! https://t.co/s7OhQHphuw","date":"Sat Aug 28 20:25:32 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Shame on @POTUS for signing a death warrant for Afghans who helped the United States. President Biden, do you still trust the #Taliban to help Americans? https://t.co/pu7apmV6ub","date":"Fri Aug 27 22:29:10 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today, I joined Rep. Van Drew in introducing a resolution to censure President Biden for his catastrophic failures in Afghanistan. \n\nRead the full resolution ⬇\n\nhttps://t.co/x7FmBCQobX","date":"Fri Aug 27 19:26:35 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"I'm glad to see the Supreme Court end President Biden's unconstitutional eviction moratorium.\n\nIt's past time we end all these pandemic related government handouts and get people back to work.   https://t.co/nY9L1DqT7e","date":"Fri Aug 27 16:01:19 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The #Taliban is beating women outside of Kabul Airport. @POTUS, why are you trusting them to maintain a secure perimeter around the airport? Taliban terrorists are not your friends. https://t.co/PLursbKCnX","date":"Fri Aug 27 15:17:07 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Agreed. This is what the world saw. https://t.co/ILQNHFZt9c","date":"Thu Aug 26 23:34:21 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"President Biden isn't coming across as a confident and competent world leader while hugging his notebook and telling reporters that he has another meeting while addressing the country about Afghanistan. https://t.co/znCNaNy6OC","date":"Thu Aug 26 21:57:18 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The Biden Administration is helping the #Taliban in hunting down our allies and American citizens. \n\nThis is disgusting. https://t.co/bKlj1Biy51","date":"Thu Aug 26 19:58:56 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Today's the deadliest day for American troops in #Afghanistan in 10 years. \n\nPresident Biden, your silence is deafening.","date":"Thu Aug 26 19:16:41 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"A dozen U.S. military families are facing their worst fears right now. Our Commander in Chief's total absence today is absolutely unacceptable.","date":"Thu Aug 26 18:37:48 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"We cannot allow terrorist attacks on our own people to continue. \n\nThese are acts of war. \n\nAmerica must respond swiftly and decisively. \n\nPresident Biden has American blood on his hands.","date":"Thu Aug 26 18:24:22 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"The number of U.S. servicemembers killed in the suicide bombings in Kabul has now risen to 10. \n\nHow many more troops are we going to lose before Biden acts and addresses the American people?","date":"Thu Aug 26 18:18:11 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Another imminent attack at Kabul Airport. \n\nPresident Biden, how will you evacuate Americans safely if they can't even get to the airport?","date":"Thu Aug 26 17:49:13 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"Heartbroken to hear 4 Marines were killed in #Afghanistan today. \n\nSending prayers to their families and loved ones.","date":"Thu Aug 26 17:28:00 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":"My office stands ready to assist every American citizen and ally stranded in Afghanistan. \n\nTo ensure everyone gets the help they need, our phone lines will be open around the clock. \n\nGive us a call if you need help (202) 225-2106 or (586) 697-9300","date":"Thu Aug 26 15:35:53 +0000 2021","user_id":"1344032292432437248"},{"handle":"RepLisaMcClain","text":".@POTUS, you assured Americans the Taliban could be trusted to secure the evacuation of our citizens and allies. There is now blood on your hands.","date":"Thu Aug 26 14:53:16 +0000 2021","user_id":"1344032292432437248"}]