[{"handle":"RepLouieGohmert","text":"The #DOJ has got to admit they're out of control, and they've got to get back to following the #Constitution.","date":"Thu Jun 16 21:15:57 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's a sad time for America.\n \nOne thing is very clear. Pretrial confinement is never EVER to be used for punishment and that is exactly what has happened.\n\nIt’s been used for intimation, punishment &amp; vengefulness from a DC jail that has enjoyed screwing over the #J6 defendants. https://t.co/D1uXVrqjdF","date":"Thu Jun 16 19:42:35 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Is it possible that the proposed #COVID vaccines in young children could create increased risk from future novel #COVID variants? \nhttps://t.co/2p5fkgnykU","date":"Wed Jun 15 21:30:02 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What studies, IF ANY, has the FDA relied on regarding potential ADE from COVID vaccines in children five and under, or in ANY age group? Can the FDA affirm that there’s NO risk of ADE for children receiving the vaccine?\nhttps://t.co/2p5fkg5WWk","date":"Wed Jun 15 21:15:01 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What is the cardiac risk factor in administering these #COVID vaccines to children? \nhttps://t.co/2p5fkgo6as","date":"Wed Jun 15 21:00:04 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Why has the FDA refused to release the hundreds of thousands of pages of data from pre-approval manufacturer studies, post-approval adverse events data, and other post-approval manufacturer data?\n\nhttps://t.co/2p5fkgnykU","date":"Wed Jun 15 20:29:00 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Nothing like a tourist crashing a Capitol Hill press conference and shaming the mainstream media over their despicable coverage, or lack thereof, of #J6 political prisoners. Thank you, sir! https://t.co/4h2TecvXzf","date":"Wed Jun 15 18:26:44 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I’m deeply concerned that the push to authorize the #COVID vaccine for children is nothing more than a dystopian experiment with unknown consequences. These questions MUST be answered. https://t.co/S900KrbZzC","date":"Wed Jun 15 18:25:18 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I will be speaking at the FDA's VRBPAC meeting momentarily to raise important questions that need to be answered about the #COVID vaccine for babies and toddlers. Watch #LIVE: https://t.co/VP1zcqGMwT","date":"Wed Jun 15 17:31:50 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Before prayers were eliminated in schools, we didn’t have these kinds of mass shootings. #GohmertHour\n\nhttps://t.co/xJXVPDR59I","date":"Thu Jun 09 20:55:12 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Armed California Man Seeking to Kill Justice Kavanaugh Arrested Near Justice's Home #GohmertHour\n\nhttps://t.co/aNVN0IxkD4","date":"Thu Jun 09 16:39:28 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats' Focus On 'Gun Control' Won't Solve Any of Our Problems #GohmertHour\n\nhttps://t.co/9wum2AoPCo","date":"Thu Jun 09 16:26:38 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"'It's just crazy': 12 major cities hit all-time homicide records #GohmertHour\n\nhttps://t.co/HUY2wwaHDu","date":"Thu Jun 09 16:10:34 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #J6 Committee “hearing” is nothing more than a Soviet-style production with a predetermined outcome. @OANN @DanNewsManBall \n\nhttps://t.co/VmUac45jwq","date":"Wed Jun 08 23:06:28 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If you look at the plans being proposed in the Democrats’ gun bills, you can find these very policies already enacted in cities controlled by Democrats, where gun crimes and homicides are skyrocketing. #2A #GunGrab https://t.co/heoMe9ZivC","date":"Wed Jun 08 21:30:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/SaxqocewI5\n\n@RepThomasMassie @RepJeffDuncan @RepHarshbarger @RepRosendale @RepHartzler @RepBobGood","date":"Wed Jun 08 20:24:12 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There are many questions I’d like to see answered before any final decision is made on administering #COVID vaccines to young children. @congbillposey @SenTedCruz @SenRonJohnson @RepRalphNorman @RepMaryMiller @RepAndyBiggsAZ @RepChipRoy @RepDanBishop @RepBoebert @Rep_Clyde https://t.co/PHhkloBcvh","date":"Wed Jun 08 20:24:12 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The CDC and FDA work for the American people, not #BigPharma, and it’s time they are reminded of that. There are many questions I’d like to see answered before any final decision is made on administering this shot to young children.\nhttps://t.co/SaxqocewI5","date":"Wed Jun 08 19:27:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats believe it’s ok to rip off a baby’s arms and legs and crush their skulls during an abortion. Yet they now want to tell us how to keep kids safe? \n\n#GunGrab #2A @newsmax @JohnFBachman  @BiancaDLGarza \n\nhttps://t.co/qC7RIC8m7A","date":"Fri Jun 03 19:41:44 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats' ideas and policies get people killed. I am sick of their arrogance. \n#HouseJudiciaryCommittee #GunGrab #2A https://t.co/120du4yxBy","date":"Thu Jun 02 18:38:56 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Exposed the Democrats' failed policies during the House Judiciary Committee markup on their latest gun-grabbing bill: https://t.co/oXIUydmnbf","date":"Thu Jun 02 16:42:30 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"LIVE: House Judiciary Committee markup on the Democrat's gun grabbing bill: https://t.co/W9DXJHnrEY","date":"Thu Jun 02 15:18:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"May each and every American understand the magnitude of this day, thank the families of those who gave all, and thank God for all those who protected our freedom and way of life. https://t.co/smS8MTiRF0","date":"Mon May 30 13:00:30 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There is evil in this world, and it was in Uvalde yesterday. We grieve for the families of those precious children and teachers. \n\nThere are some basic solutions that we must get back to, but now is no time for politics. It is a time for grieving. https://t.co/OLDNF40zZz","date":"Wed May 25 17:35:03 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Americans wait at airports for shipments of food so their babies can eat.\n\nMeanwhile, Biden sends pallets of baby formula to illegal aliens at the border.\n\nIt didn't even take two years for Biden to put the U.S. on track to be a third world country.\n\n#BidenBabyFormulaCrisis","date":"Tue May 24 00:38:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Any bill that is serious about combating #China cannot cede U.S. sovereignty to the UN. Despite being the largest donor country to the UN, we've received very little to show for our heavy investment.\n\n@RepLaMalfa @RepDLamborn @RepGregSteube \n\nhttps://t.co/smGYYu4nV4","date":"Mon May 23 21:52:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Punishment during pretrial confinement has repeatedly been held unconstitutional. But the Constituiton appears to be no bar to the Biden DOJ’s antagonism. #J6 \n@julie_kelly2 @DineshDSouza @McBrideLawNYC","date":"Mon May 23 19:10:10 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Clinton campaign knew it wasn’t true. #RussiaHoax @newsmax @BobSellersTV @KatrinaSzish \n\nhttps://t.co/N0PqqwuqV8","date":"Fri May 20 23:09:46 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Can’t fill up your gas tank? Who caused that?\n\nThe Biden Administration.\n\nWho caused the shortage of baby formula?\n\nThe Biden Administration. #GohmertHour\n\nhttps://t.co/nVLuGXEq2T","date":"Thu May 19 21:56:47 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"6/6 My full statement on my vote against giving the FDA $28 million in light of the #BidenBabyFormulaCrisis \nhttps://t.co/YwAHBvuiDZ","date":"Thu May 19 19:22:46 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"5/6 The #FDA got us into this mess and they cannot get us out of it. Enabling Abbott to reopen its facility swiftly and removing burdensome government restrictions and regulations from safe baby formula from overseas would be a more efficient solution.” #BidenBabyFormulaCrisis","date":"Thu May 19 19:22:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"4/6 Creating a bigger deficit and increasing #Bidenflation, while using even more money to create bigger, more dysfunctional government is not a solution, no matter how attractive that may sound to some in the media. #BidenBabyFormulaCrisis","date":"Thu May 19 19:22:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"3/6 POTUS &amp; his bureaucrats have done NOTHING for months to alleviate or mitigate the problem, but now want to throw more money at their bureaucratic friends out of a desire to, as Democrats have said before, avoid letting 'a good crisis go to waste.’ #BidenBabyFormulaCrisis","date":"Thu May 19 19:22:44 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/6 There was no easing of restrictions by the #FDA, no reopening plan from the FDA and not even an apparent awareness of the consequences of their actions until there was a critical shortage &amp; American mothers were unable to feed their babies. #BidenBabyFormulaCrisis","date":"Thu May 19 19:22:44 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/6 Giving #FDA millions won't produce one ounce of #babyformula. Getting the FDA out of the way would accomplish that new production. The shutdown and subsequent investigation of the  Abbott facility by the Biden FDA found no deadly bacteria in products. #BidenBabyFormulaCrisis","date":"Thu May 19 19:22:43 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What an honor it was to meet WWII Marine Veteran and constituent, Mr. James Lindsey, today at the Congressional Gold Medal Ceremony. \n\nThank you for your service! https://t.co/gyd5vEVWWe","date":"Wed May 18 19:08:26 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This morning, @RepMTG and I delivered a letter to Mayor Bowser about the horrible treatment of #J6 detainees in the DC Jail. https://t.co/Sa8C8yvVrQ","date":"Wed May 18 16:18:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"With @RepDLamborn and colleagues LIVE at the press conference on the Taylor Force Martyr Payment Prevention Act https://t.co/ioqZFH39XI","date":"Wed May 18 15:49:01 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We know the #BigGuy President Biden is a good negotiator for his family but he’s a rotten negotiator for our country. #PutAmericaFirst #TenPercentForTheBigGuy @OANN @STEPHMHAMILL \n\nhttps://t.co/JkRaHdo0UI","date":"Fri May 13 17:32:55 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Unfortunately, liberal Democrats seem to be more concerned with aborting babies than feeding them.\nhttps://t.co/TOwpRdYBE1","date":"Thu May 12 20:55:04 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/2 We urge @US_FDA @CDCgov to set extremely high standards for the #COVID vaccine for young kids. Cosigners cont'd: @RepHartzler @RepRalphNorman @michaelgwaltz  @RepMcKinley @RepGregSteube @RepMaryMiller @RepBobGood @RepHarshbarger https://t.co/MPqmUH9C25","date":"Thu May 05 20:43:42 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/2 The #COVID vax long-term risk to children could be catastrophic. The risk-to-reward does not justify vaxxing kids. We urge @US_FDA @CDCgov to set extremely high standards for vax for kids. @SenTedCruz @congbillposey @RepJeffDuncan @RepThomasMassie @RepAndyBiggsAZ @RepBoebert https://t.co/qimhMuQv2V","date":"Thu May 05 20:43:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Enjoyed seeing great friends last night at the Mar-a-Lago premiere of #2000Mules. Great work by some serious investigators on #ElectionIntegrity @news_ntd https://t.co/6Cghbs6jm5","date":"Thu May 05 16:38:10 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's clear the #SCOTUSLeak was intended to get left-wing agitators into the streets and intimidate constitutional justices the way Roberts was intimidated w/ the Obamacare vote. The leak was designed to solicit threats &amp; protests against the justices voting to do the right thing.","date":"Tue May 03 20:29:41 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed the Biden Administration’s Orwellian Disinformation board, the Texas border crisis and the recent Judiciary hearing with Secretary Mayorkas on @newsmax with @BiancaDLGarza today.\n\nhttps://t.co/ZizrFryLb8","date":"Mon May 02 22:16:21 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Another fire at a U.S. food processing plant. How many does this make now? I've lost count. https://t.co/7ObrlmB3aB","date":"Mon May 02 22:01:33 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"3/3 Had Ms. Boyland been a violent criminal, #BLM or #Antifa, the Left would be apoplectic over her devastating death and the civil rights abuses that occurred on and about #J6. \nhttps://t.co/UluoXMIKVU","date":"Fri Apr 29 20:48:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/3 This @EpochTimes report is DEEPLY disturbing: DC officer \"used a large wooden stick to strike the body and head of protester #RosanneBoyland three times\" as she lay unconscious on the ground on #j6 according to police bodycam footage.\nhttps://t.co/UluoXMIKVU","date":"Fri Apr 29 20:48:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/3 If the sham #J6 cmte had an ounce of decency and impartiality, this tragedy would be investigated. Unfortunately, in the eyes of the cmte, Ms. Boyland supported the wrong candidate for President. \nhttps://t.co/UluoXMIKVU","date":"Fri Apr 29 20:48:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"4/4 If you've never seen this historic response by Justice Thomas at his confirmation hearing in 1991: \nhttps://t.co/CMopXcmWeM","date":"Thu Apr 28 16:27:38 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"3/4 @Sifill_LDF's words prove Justice Clarence Thomas' point,\"... it is a message that unless you kowtow to an older, this is what will happen to you. You will be lynched, destroyed, caricatured...","date":"Thu Apr 28 16:27:38 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/4 ... to have different ideas, and it is a message that unless you kowtow to an old order, this is what will happen to you. You will be lynched, destroyed, caricatured by a committee of the U.S.-- U.S. Senate, rather than hung from a tree.\"","date":"Thu Apr 28 16:27:37 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/4 THREAD: FORMER @NAACP head @Sifill_LDF says Justice Thomas' words are racist: \"And from my standpoint as a black American, as far as I'm concerned, it is a high-tech lynching for uppity blacks who in any way deign to think for themselves, to do for themselves...","date":"Thu Apr 28 16:27:37 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Join me at a press conference live with @JasonFyk as we call out Big Tech and announce action to strike Section 230. RT if you are tired of your First Amendment rights being trampled on! #FreeSpeech https://t.co/8WPtepmIzo","date":"Wed Apr 27 22:05:47 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Justice Clarence Thomas said this in his hearing.\n\nNo one is treated more brutally in this country than a conservative black person. \n\nJustice Thomas was the victim of a high tech lynching and anyone who continues that abuse is further contributing to the same high tech lynching. https://t.co/xqTlsKmm23","date":"Wed Apr 27 19:47:34 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today I will be joined by @Congressman_JVD and @JasonFyk for a press conference to announce steps to strike Section 230 and hold Big Tech responsible for their censorship. \n\nWe can't allow Big Tech to get away with violating the First Amendment any longer. #FreeSpeech","date":"Wed Apr 27 18:31:23 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The FBI director who has often been dishonest has been hesitant to call this organization what it is.\n\nIt is a two-tiered Justice system. It is a very dangerous time in this in this country right now. @EpochTimes \n\nFull interview here: https://t.co/mehr9zog8X https://t.co/pHU63DXlVT","date":"Wed Apr 27 14:06:07 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today marks 100 years of the United States and #Egypt working together as diplomatic and trading partners. \n\nThere is more work to do to deal with various challenges, especially since all the snubs by the Obama administration. We can accomplish so much through mutual cooperation.","date":"Tue Apr 26 16:48:49 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congratulations to @elonmusk. Hopefully the days of Orwellian-style censorship of our founding principles &amp; Judeo-Christian ideals are in Twitter's past. This is a major victory for #freespeech!","date":"Mon Apr 25 21:05:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The clip proves my words were deliberately taken out of context, but I'm glad that thousands on Twitter are seeing the truth! \n\nThis exposes the DOJ's double standard that favors Democrats and ignores the Constitution. \n\nPlease watch the full interview: https://t.co/2jDOVtpDDU","date":"Thu Apr 21 21:44:41 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #DOJ failed when it did not investigate Democrats who blatantly broke the law in 2016.\n\nNow the power has gone to their heads.\n\nDemocrats think they can cheat and violate the law and do whatever they want as long as it benefits them.\n\nhttps://t.co/2jDOVtpDDU","date":"Wed Apr 20 20:19:23 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"7/7 Violent #J6 offenders have been/will be punished, especially if they support Trump. Had they been leftists, the #J6 narrative would read more like a Seattle fairytale “Summer of Love” than the “American Horror Story” the Left has chillingly perpetuated.@julie_kelly2","date":"Mon Apr 18 18:35:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"6/7 The glaring “threat to democracy” that our country faces is the politically motivated prosecutions of nonviolent offenders with no criminal histories who merely entered the U.S. Capitol through already-open doors on #J6 @theamgreatness \nhttps://t.co/Duv6L0EzrO","date":"Mon Apr 18 18:35:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"4/7 Of course, NOTHING will come of Democrats' then-unprecedented obstruction of Congress because they are not conservatives, Republicans, and certainly not Trump supporters. @theamgreatness  https://t.co/Duv6L0E1Cg","date":"Mon Apr 18 18:35:39 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"3/7 One Democrat admitted “we fully appreciate that we are in full violation of the rules.” https://t.co/Duv6L0E1Cg","date":"Mon Apr 18 18:35:39 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"5/7 The Left has labeled #J6 as a “threat to democracy” and has demanded that every flag-waving granny who walked peacefully through the already open U.S. Capitol doors should be prosecuted to the fullest extent of the obstruction of Congress charge, a felony.","date":"Mon Apr 18 18:35:39 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/7 Why didn’t #DOJ hold the 2016 Democratic congressional obstructionists to the same standard as those now being charged with obstructing an official proceeding on #J6? @theamgreatness @julie_kelly2 https://t.co/Duv6L0EzrO","date":"Mon Apr 18 18:35:38 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/7 In June of 2016, #obstructionist Democrats staged a raucous “sit-in” where they blocked official business from occurring for roughly 26 hours. There were reports of House furniture being damaged and staffers being mistreated. https://t.co/Duv6L0E1Cg","date":"Mon Apr 18 18:35:38 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The glaring “threat to democracy” that our country faces is the mean-spirited, weaponized, and politically motivated #J6 prosecutions, NOT the nonviolent offenders with NO criminal histories who merely entered the Capitol through already-open doors on #J6. https://t.co/Duv6L0E1Cg","date":"Fri Apr 15 16:24:00 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The military took so much from Derrick and instead of having a chip on his shoulder about this, he is back serving his country again—this time, from Capitol Hill—and fighting to ensure what happened to him won’t happen to another service member. \nhttps://t.co/GLf0g72tDZ","date":"Thu Apr 14 19:02:31 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"You lose a country when you have millions of people coming over in one year.\n\nPresident Biden must secure the border. #title42 @newsmax https://t.co/Z0vBhJRmeg","date":"Wed Apr 06 21:53:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The U.S. Forest Service has become unpalatable in the East Texas area.\n\nThese public servants need to turn things around quickly and help rather than hurt the local community.\n\nhttps://t.co/iAeAag7fjM","date":"Wed Apr 06 17:31:16 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There should be an investigation into the events of January 6, 2021.\n\nHowever, Speaker Pelosi made it clear when she would only allow Republicans who hate Trump on the committee, that this was not actually going to be a bipartisan, fair commission. \n\nhttps://t.co/OwVia6q9TR","date":"Tue Apr 05 22:25:43 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Drug cartels use tribal lands in border states to smuggle drugs and people into our country.\n\nBiden must apply immigration policy and stop allowing individuals to enter the country illegally without consequence. #Title42\n\nhttps://t.co/cjQb7d67Qp https://t.co/YB44kbCpTZ","date":"Tue Apr 05 19:06:14 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you to the cosigners: @RepMTG @RepGregSteube @RepBrianBabin @RepRalphNorman @RepLaMalfa @RepGosar @congbillposey @RepJeffDuncan @TXRandy14 @RepAndyHarrisMD","date":"Mon Apr 04 19:23:53 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Attorney General Merrick Garland doesn't reevaluate the course of these unjust double standards, his DOJ will be one of the most significantly hypocritical and politically abusive departments in U.S. history, driving the destruction and deaths of despair of Democrat opponents.","date":"Mon Apr 04 18:30:07 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Were Democrats punished in 2016 for obstructing Congress for 26 hours or so while illegally recording with phones on the House floor? NO.\n\nYet, nonviolent rioters like Matt Perna are being threatened with 72 months in jail for walking in the Capitol and leaving 20 minutes later. https://t.co/2U9ptof6Bj","date":"Mon Apr 04 18:25:02 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Left is persecuting Clarence Thomas and his wife, Ginni, for daring to think for themselves.\n\nThomas is brilliant, and likely the most intelligent Justice on the Supreme Court bench.\n\nWatch the rest here: https://t.co/i7RAb5e7t9 https://t.co/JSagL7rLcC","date":"Fri Apr 01 21:25:58 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepCawthorn @RepBarryMoore @RepBenCline @RepKenBuck @RepAndyBiggsAZ","date":"Thu Mar 31 20:19:01 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you to the cosigners: @RepRalphNorman @RepMTG @TXRandy14 @RepJeffDuncan @RepGosar @RepDLesko @RepBobGood @RepMoBrooks @WarrenDavidson @RepAndyHarrisMD @RepRonnyJackson @RepBrianBabin @RodneyDavis @Rep_Clyde @RepHartzler @RepMullin @RepGregSteube @RepWebster @CongressmanHice","date":"Thu Mar 31 20:19:01 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Female athletes have worked their entire lives to play at the highest levels of sports.\n\n@RepMaryMiller and I sent a letter to the NCAA demanding they #ProtectWomensSports and stop allowing biological male athletes compete against women.\n\nhttps://t.co/xXF4dx8czZ","date":"Thu Mar 31 20:19:00 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to meet with former Israel Prime Minister Benjamin Netanyahu to discuss the danger of the Biden Administration's Iran Deal and about strengthening the strategic ties between the U.S. &amp; Israel. @netanyahu @israelganz @AStrongIsrael #BinyaminRegionalCouncil https://t.co/QFvH7sbjoi","date":"Thu Mar 31 14:13:41 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The FBI Director needs to submit to a comprehensive review of domestic operations. \n\nHow many cases in the Cyber Division have involved warrants for surveillance of any American citizen from the FISA Court? \nProbably a lot.\n\nhttps://t.co/eWrmHUsLCm https://t.co/N3PlUCIIld","date":"Tue Mar 29 20:10:08 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Matt Perna didn’t harm anyone, yet Biden's vengeful DOJ sought to throw the book at him. This led to the end of his life, a life he used to serve others. \n\nWill the Biden/Garland DOJ hold itself accountable? @RepAndyBiggsAZ  @RepMTG #j6 \n\nhttps://t.co/bKt8PJMOr5","date":"Mon Mar 21 21:57:41 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepAndyBiggsAZ @RepMTG Matt Perna's family stood by him in the face of persecution from the DOJ. This is an issue of humanity.\n\nWatch Geri Perna deliver her remarks: https://t.co/qXxNepwIsk","date":"Fri Mar 18 20:57:53 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The weather was not cooperative for our press conference yesterday, but we @RepAndyBiggsAZ @RepMTG stood with Matt Perna's family.\nPlease share this video so we can bring attention to this injustice. @julie_kelly2 #JusticeforMattPerna #J6 \n\nhttps://t.co/Rkl5LNQJso","date":"Fri Mar 18 19:20:04 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Geri Perna's prepared remarks from the press conference today honoring the life of Matthew Perna\n\nWe will stand against the continued unjust treatment of nonviolent Jan. 6 defendants @RepAndyBiggsAZ @RepMTG #J6 \n\nhttps://t.co/qLIjJavCsd","date":"Thu Mar 17 22:49:37 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Louie Gohmert, Repo. Marjorie Taylor Greene and Rep. Andy Biggs Hold a Press Conference Demanding Justice for Matt Perna from Biden’s DOJ #J6 https://t.co/iSJP7fNJcV","date":"Thu Mar 17 18:15:01 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Join me today for a live press conference with @RepAndyBiggsAZ @RepMTG at 2: 10 pm ET to Demand Justice from Biden's DOJ and Remember the Life of Matt Perna. #J6","date":"Thu Mar 17 13:57:55 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We’re going in the wrong direction. \n\nWe should be coming together, not advocating for a Orwellian Ministry of Love, where if you disagree with someone you are arrested like the DOJ has been doing since January 6th.\n\nhttps://t.co/mgLdzSu3WR https://t.co/SOH4fN8DgA","date":"Wed Mar 16 21:24:14 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"5/5 @bpolitics March 10, 2022 - \"The U.S. is willing to relax economic pressure on Venezuela depending on the outcome of upcoming talks between President Nicolas Maduro and the opposition, according to a senior Biden administration official.\" https://t.co/KM2ovpDRdC","date":"Fri Mar 11 23:24:49 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"4/5 @WSJ March 6, 2022 - \"The Biden administration is seeking to ease oil sanctions on Venezuela as part of a broader U.S. strategy to temper oil prices that have skyrocketed because of Russia's war in Ukraine, according to people familiar with the matter.\" https://t.co/90CVFu2DWA","date":"Fri Mar 11 23:24:48 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"3/5 @WSJ March 10, 2022 - \"The rush to fill gaps from Russia's rapidly shrinking contribution to the global energy markets has led the White House to oil-rich nations in the Middle East, countries under U.S. sanctions and private-sector oil giants meeting this week in Houston.\" https://t.co/dMvAvhKCBi","date":"Fri Mar 11 23:24:47 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"2/5 @CNN March 8, 2022 -\"For Biden, the effort to identify oil supplies -- even in autocratic regimes -- demonstrates the lengths he is willing to go to inflict serious pain on Moscow.\" https://t.co/oMMxoUIggg","date":"Fri Mar 11 23:24:46 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"1/5 The @dallasnews didn't do their homework in their haste to say something derogatory about me and @RepChipRoy \n\nI thought I would help out by providing some sources they can consult for future stories on this bill.","date":"Fri Mar 11 23:24:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It’s time to make America energy independent again and stop the war on American seniors, Americans on fixed incomes, and those that have to keep maxing out their credit cards to buy gas just to get to work. \n#StopBidensGreenNewNightmare https://t.co/VhejmW2Bhd","date":"Thu Mar 10 15:55:16 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Louie Gohmert Asks Democrats to Put Americans First, Not Joe Biden's other Tyrant Cronies \n\nThere is no way I could vote to exchange getting oil from Putin for getting oil from some other tyrant or country that wants to destroy America. https://t.co/x2KRPfBpT8","date":"Thu Mar 10 04:19:24 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Why didn't we have this supply chain problem under President Trump?\n\nBecause we were manufacturing what we needed in America.  \n\n#BidenBulldozingBlessings #SOTU https://t.co/PYYCQmKseH","date":"Wed Mar 02 02:15:00 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If we don't get back \n\nTo making sure children in America \n\nKnow how to sustain a republic \n\nWe are going to lose it. \n\n#SOTU https://t.co/haVM2ZDglQ","date":"Tue Mar 01 22:15:14 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Texas doctor, Eric Hensen, is currently facing what the Texas Medical Board calls a ‘non-disciplinary remedial plan’ as a result of his utilizing sound medical judgment. \n\nI condemn this action, which is clearly a form of unjust punishment. \n\nFull Article:\nhttps://t.co/L2rcobV54F","date":"Mon Feb 28 20:22:34 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"4 million illegals crossed the border within this last year.\n\nIt doesn’t take long to completely eliminate the freest country in the world.\n\n#securetheborder @FoxBusiness @JackieDeAngelis \n\nhttps://t.co/lpokO2q4PX https://t.co/CbUu7LISqQ","date":"Sat Feb 26 01:03:12 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Instead of demonizing unvaccinated Americans, the president can bring the country together and promote all options for fighting this terrible virus, including inexpensive therapeutics... Better late than never for the American people. @WashTimes \n\nhttps://t.co/vqyf5ryr4W","date":"Tue Feb 15 15:59:49 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thanks co-signers: @RepGregSteube @RepBrianBabin @RepAndyBiggsAZ @RepMcClintock @RodneyDavis @RepMaryMiller @RepBoebert @RepLaMalfa @congbillposey @RepGosar @RepCawthorn @RepCloudTX @TXRandy14","date":"Mon Feb 14 22:00:42 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Our country is on fire. \n\nWe are $30 trillion in debt, the southern border is unsecured and homeless veterans are sleeping on the street. \n\nYet, after a botched withdrawal, President Biden continues to send money we do NOT have to fund and prop up the Taliban ($308 million). https://t.co/j067ODb2Aw","date":"Mon Feb 14 22:00:27 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congress and the executive branch have different ZIP Codes and their mail should not be mixed, much less opened. @WestJournalism \n\nhttps://t.co/oVJMKpftjL","date":"Thu Feb 10 20:03:40 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The DOJ’s actions may be “felonious” and perhaps part of a pattern of targeting Republican lawmakers.\n\nIt’s time for the DOJ to provide some answers! #felony \n\nhttps://t.co/jOTjaR9QLq https://t.co/U4V4s06gFt","date":"Thu Feb 10 14:17:00 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My statement on the great news we received today about Chief Petty Officer Eric Gilmet: https://t.co/uawyxc6hgN","date":"Thu Feb 10 01:27:11 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"The lawlessness continues. The Biden Department of Justice was recently caught opening Rep. Louie Gohmert’s House mail before it reached his office. One letter was from a Christian missionary. One letter was from a constituent in Texas.\" @gatewaypundit \n\nhttps://t.co/g7gLdUePYw","date":"Wed Feb 09 20:15:05 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@TuckerCarlson covers the DOJ intercepting my official mail. I want answers, not excuses. #felony https://t.co/yshvJiZR5A","date":"Wed Feb 09 14:53:35 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My statement on the apparent unconstitutional tampering of my private constituent mail: https://t.co/YnIkkLQ0xJ","date":"Tue Feb 08 18:11:56 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"🚨BREAKING🚨\n\nMy staff received a letter addressed to my official office which was already opened and stamped “DOJ MAILROOM” with a date and “X-RAYED” on the stamp\n\n#felony\n\nhttps://t.co/LFMBcR2FP2","date":"Tue Feb 08 17:50:35 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thanks co-signers: @RepMTG @RepBoebert @RepMaryMiller @congbillposey @RepTiffany @repdlesko @TXRandy14 @CongressmanHice @RepBobGood @RepAndyBiggsAZ @Lancegooden @jdanbishop @RepGregSteube @RepRonnyJackson @RepCloudTX @CongressmanGT @RodneyDavis @RepClayHiggins @RepBrianBabin","date":"Wed Jan 26 21:33:56 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Secretary Mayorkas was serious about preventing family separation at the border, he would be as serious about securing our southern border.\n\nThe claim to care about families while intentionally and willfully failing to secure the border is shameless posturing.#securetheborder https://t.co/xn1WptybQv","date":"Wed Jan 26 21:31:51 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joined @FoxBusiness @LizMacDonaldFOX to discuss NPR’s #fakenews story about Supreme Court Justice Neil Gorsuch\n\nhttps://t.co/S9qJODTZMK","date":"Fri Jan 21 01:12:45 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TUNE IN: @FoxBusiness @LizMacDonaldFOX at 6:35pm ET/ 5:35pm CT #NPR #GORSUCH https://t.co/UXTrfl6834","date":"Thu Jan 20 23:00:05 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@UNRWA Thanks to the following cosigners: @RepMattGaetz @RepGregSteube @RepBrianBabin @RepCawthorn @RepChipRoy @RepJeffDuncan @RepBillJohnson @TXRandy14 @RepGrothman @RepDLamborn @RepMaryMiller @Lancegooden @congbillposey @RepTedBudd @RepBobGood @RepBenCline","date":"Thu Jan 20 18:21:31 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Administration is funneling an additional $99 million to @UNRWA. President Trump prudently stopped funding this agency due to their egregious use of taxpayer dollars to celebrate Palestinian terrorists and demonize Israel.\nWe demand accountability of U.S. tax dollars. https://t.co/9yiyXNmgSv","date":"Thu Jan 20 18:20:35 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Americans have to understand the importance of our right to vote. \n\nWe must protect the integrity of our elections. @TPUSA @RepAndyBiggsAZ @RepGosar #ElectionIntegrity #AmericaFest2021 \n\nhttps://t.co/YTarjlmOGx https://t.co/hfYEJnIBy7","date":"Wed Jan 19 18:53:14 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This is good news for all of those that do not have to abide by a mandate that should not have been made. \n\nThank God that at least 6 of the Justices did not think that that was appropriate. #SCOTUS #COVID19 \n@HeatherChilders @BobSellersTV @newsmax \n\nhttps://t.co/CKxGW4ibwj","date":"Thu Jan 13 21:32:54 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you @RobertKennedyJr for writing and sharing your support for H.R. 5816, the NICE ACT. Please know how truly touched I am to have your support and the support of the Children’s Health Defense on this crucial issue. #TheDefender @CFroh  \n\nhttps://t.co/5SuiaH0gPc https://t.co/Cfyw4DHOh8","date":"Wed Jan 12 17:04:18 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"People need to be punished for breaking the law on January 6, but we need to get to the bottom of the whole thing. Why didn’t Speaker Pelosi want the National Guard there? @newsmax #J6 \n\nhttps://t.co/dEUxzIoAVU","date":"Thu Jan 06 17:46:08 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is consistent with President Joe Biden to be willing to harm America in order to try to make himself look more benevolent.\n\nThe U.S. government, under commander-in-chief Biden, is bringing people with terrorist ties into the country.  \n\nhttps://t.co/miibQgEj4o","date":"Tue Jan 04 23:38:47 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Big Tech and social media have become the Ministry of Truth that Orwell predicted. @Newsmax @EmmaRechenberg @ShaunKraisman \n\nhttps://t.co/umxpD4TASf","date":"Mon Jan 03 16:33:04 +0000 2022","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I recently had the honor of guest hosting the @seanhannity radio show. Guests included @RWMaloneMD, Tom Homan, @julie_kelly2 , @yesnicksearcy and @RobertKennedyJr \n\nListen to the full show here:\nhttps://t.co/7B14F564yX","date":"Tue Dec 21 21:03:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I'm speaking at the @TPUSA #AmericaFest  with my friend @RepAndyBiggsAZ at 3:10 pm ET/2:10 pm CT/1:10 pm MT on #ElectionIntegrity \n\nTune in to watch here: https://t.co/ZqrYhvZOjn","date":"Mon Dec 20 19:12:49 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joined @GriffJenkins on @FoxNews today to discuss the outrageous vaccine mandates and the building of the new Texas border wall. #BidenBorderCrisis \n\nhttps://t.co/rMfEQYkoQ9","date":"Sat Dec 18 18:42:25 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in as I guest host the @seanhannity radio show from 3-6pm ET today!\n\nhttps://t.co/nMuU9pKJlr \nhttps://t.co/4pwnDzC8oo","date":"Fri Dec 17 19:00:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This is the shortcoming of the Biden Administration. China isn’t afraid of him. Nobody thinks he’s going to do anything to stop them. @EpochTimes @news_ntd \n\nhttps://t.co/DA0mRestYJ","date":"Mon Dec 13 18:52:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Jan. 6 commission has become an out-of-control political tool for Democrat vigilantes to target their opponents. We’re going to need a select committee to investigate the civil rights abuses of this commission. #J6\n\nhttps://t.co/6rO13whZFK https://t.co/0rYih9WEUP","date":"Thu Dec 09 22:51:30 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #J6 inmates are being mistreated and as someone that has been a prosecutor, a felony judge and a member of the crime subcommittee, it is just hard for me to believe that federal judges are allowing this.\n\nhttps://t.co/ir4XRZGpXr","date":"Wed Dec 08 00:41:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today, along with @RepMTG, we released a report on the #J6 political prisoners and the conditions of the DC jail.\n\nLink to the full report: https://t.co/lQEQEYqTZ6","date":"Tue Dec 07 23:40:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was an honor to host the Congressional Art Contest at the Cole Art Center this weekend in Nacogdoches, TX. \nCongratulations Kiymiya Lamea, from Tyler Legacy High School, for winning the annual art contest. https://t.co/G6hXx4gXv3","date":"Mon Dec 06 20:34:19 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Once again, Democrats are abusing the legislative process to push an agenda that puts the most vulnerable in our society last. \n\nMy statement on today's CR vote. https://t.co/NdSaxDCSwR","date":"Thu Dec 02 22:42:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is extremely important to our Heavenly Father that we protect the lives that are most vulnerable and most innocent. \n\nhttps://t.co/kqJMjAVJoN","date":"Thu Dec 02 20:59:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Bible has to be the basis of morality in our country. Otherwise, we lose the rights that are afforded us in our Constitution.\n\nhttps://t.co/5woVo3V5xC","date":"Wed Dec 01 23:15:04 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Welcome to DC: A world where anime videos are condemned but saying you’d beat the h*** out of the President is acceptable. #Biden","date":"Mon Nov 22 21:15:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Welcome to DC: A world where anime videos are condemned but encouraging protesters to get into the faces of cabinet secretaries is acceptable. #MaxineWaters","date":"Mon Nov 22 20:00:19 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Welcome to DC: A world where anime videos are condemned but calling for unrest in the streets is acceptable. #Pelosi","date":"Mon Nov 22 17:50:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Welcome to DC: A world where anime videos are condemned but torturing puppies in the name of science is acceptable #Fauci","date":"Mon Nov 22 17:45:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Welcome to DC: A world where anime videos are condemned but having an affair with a Chinese spy is acceptable. @RepGosar @RepBoebert","date":"Mon Nov 22 17:40:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The President and Vice President are lucky that as government officials, they can’t be sued over their disastrous border policies. They have wreaked havoc on our country. #BidenBorderCrisis #BetterBeforeBiden\n\nhttps://t.co/QukJz5K7Ua","date":"Sun Nov 21 17:43:45 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This is the most expensive bill in American history. \n\nThe economy, the military, the U.S. Border, all are in shambles only 10 months into Biden’s presidency. America was #BetterBeforeBiden https://t.co/jchsF9684c","date":"Fri Nov 19 22:35:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I’ve never heard those on the Left condemn any of the numerous attempts of violence against Republicans, but Democrats didn’t hesitate to censure my friend and colleague @RepGosar over an\nanime video. #hypocrites https://t.co/9mPtLHaccj","date":"Thu Nov 18 16:59:47 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed the Biden Administration’s dangerous vaccine mandates and the Democrats’ infrastructure bill on OAN.\n\nThanks @DanNewsManBall for having me.\n\nhttps://t.co/PYKGXb2Kob","date":"Wed Nov 10 18:21:07 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If we as a country continue to allow this abuse of power to unfold and turn this nation into a banana republic, there is nowhere left in the world to take refuge for lovers of liberty and freedom. #J6\n\n@RepBobGood @RepMattGaetz @RepGosar @RepMTG \n\nhttps://t.co/Kq1hUJX0zb","date":"Mon Nov 08 20:26:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I discussed the un-American and illegal treatment of the January 6 prisoners on Newsmax last night. Thank you @gregkellyusa for reporting on this important civil rights issue. \n\nhttps://t.co/LoBrLTsway","date":"Fri Nov 05 22:48:59 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"They have to pass HR 5376 so you can find out what’s in it!\n#dejavu #BidenBulldozingBlessings https://t.co/o0uOLdosZN","date":"Thu Nov 04 23:15:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Those on the Left have made one thing perfectly clear: if you are a Trump supporter you are guilty until proven innocent.  \n\n@RepBobGood @RepMattGaetz @RepGosar @RepMTG \n\nhttps://t.co/8siLmZ5VyC","date":"Thu Nov 04 22:23:10 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The US Marshal inspected the DC jail unannounced because the federal government has oversight of any jail in the US that holds federal inmates. The US Marshal found that the conditions of prisoners did not meet their standards.  We have a duty to hold the DC jail accountable. #J6","date":"Thu Nov 04 13:03:14 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We need to be standing up for our service members and thanking them for refusing these unprecedented orders to inject themselves with an experimental shot. \n\nMy full floor speech on the military vaccine mandates:\n\nhttps://t.co/XkFqRZdUgR","date":"Wed Nov 03 22:02:06 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Biden is creating a two-tiered society that punishes the poor and vulnerable most of all. Americans fear losing their jobs, their homes, and their ability to send their children to public schools due to the tyranny of this administration's vaccine policies. https://t.co/8GgEubrDk0","date":"Wed Nov 03 20:22:56 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@mtgreenee and I are bringing attention to the multiple allegations of civil rights abuses in the D.C. jail. #J6 https://t.co/XO6XHLMuik","date":"Wed Nov 03 19:39:18 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Every congressional leader that says they care about civil rights should come here and tour the jail. \n\nWhen it comes to civil rights it shouldn't matter what political party. Civil rights abuses shouldn't be occurring. @OANN @VOANews #J6","date":"Wed Nov 03 15:29:00 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calls Out Democratic Infrastructure Bill\n\nThey’re coming after those on fixed income, they’re coming after those who are the lower working class that are just trying to get by.\n\nThey are going to squeeze every penny out of you. Just get ready. \n \nhttps://t.co/dKEcoQo9In","date":"Mon Nov 01 13:48:19 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Defending Gun Rights at Raucous Red Flag Rumble with Gun Grabbing Democrats\n\nEverybody had the right to own a gun. Most people don’t realize that one of the foundational principles of the NRA was to defend the right of African Americans to own a gun. #2A\n\nhttps://t.co/BM0IrUsETn","date":"Thu Oct 28 20:24:33 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"You can’t have an insurrection unless at least one person involved was charged with insurrection. Virtually every Democrat at one time or another has called the events of January 6 an insurrection. #J6\n\nhttps://t.co/5QFYEqo5hm","date":"Thu Oct 28 15:41:26 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There is wisdom in not mocking those who believe in prayer. \n\nLet’s get wisdom before we start striking down our rights. \n\nhttps://t.co/Lraiq8gnbg","date":"Wed Oct 27 18:09:13 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"A reporter who takes journalistic ethics seriously wouldn’t libel someone and research how false the statements were later, if ever. That’s not a reporter; that’s a gossip-monger who deserves no serious answer from those the gossip harms.","date":"Wed Oct 27 16:08:30 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This week Hunter Walker “a reporter” emailed my office but misgendered me, triggering hurt feelings &amp; my search for a safe space far away from bigoted false pronouns. Will Twitter treat @RollingStone @hunterw the same as @mtgreenee and @Jim_Banks? https://t.co/Q9VhTHgYzV","date":"Wed Oct 27 14:23:41 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For the purpose of a potential defamation lawsuit against those making baseless accusations of a crime, I need to know who these persons are who are alleging that I helped. #J6 https://t.co/FngvSUrD7a","date":"Mon Oct 25 21:58:00 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Pretrial confinement is not to be used as punishment. Sometimes you do need to hold people that are considered a threat to themselves or others, but not to punish or \"send a message to Trump supporters.\"\n\nhttps://t.co/6AAsDSrOZX","date":"Thu Oct 21 19:57:11 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"AG Garland Debunks Democrat 'Insurrection' Claims About January 6th #J6\n\nhttps://t.co/ryrkG6WGJq","date":"Thu Oct 21 17:53:47 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank YOU, Julie, for all you have been doing.","date":"Thu Oct 21 15:26:50 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thanks to the Biden Administration’s reckless border policies, Uncle Sam is now aiding and abetting the drug and sex trafficking crimes of the cartels. This is outrageous! #BidenBorderCrisis\n\nThanks for having me,  @larry_kudlow\n\nhttps://t.co/22QUZctGIe","date":"Wed Oct 20 23:06:52 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congressman Gohmert is live with House Freedom Caucus Chair @RepAndyBiggsAZ @SenMikeLee @RepBoebert and @RepAlexMooney to discuss the failures of the Biden Administration on Spending and COVID-19. \n\nhttps://t.co/Fvgaqi0AOo","date":"Wed Oct 20 15:15:20 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“The Biden Administration is illegally bringing in 2 million people in this year alone. It is incredible that he is getting away with this. He, or whomever is calling the shots, should be removed immediately.”\n\nhttps://t.co/LRV5NSaf3I","date":"Mon Oct 18 23:20:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Landowners have been carrying pistols and rifles because they fear for their lives. There are serious drugs coming across the border. \"\n#Texasborder\n\nhttps://t.co/LRV5NSaf3I","date":"Mon Oct 18 22:12:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"This is not the America I know.  This is not the America that I have fought so hard to defend the last 17 years. \"\n\n- Lt. Col. Stuart Scheller\n\nhttps://t.co/UKkVdZTCVT","date":"Fri Oct 15 19:22:13 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"He has submitted his resignation and the Secretary of Navy will decide what the appropriate characterization of service whether it’s an honorable or a general under honorable circumstances.”\n\nTim Parlatore, Lt. Col. Stuart Scheller's attorney\n\nhttps://t.co/hPN5ALiBoS","date":"Fri Oct 15 16:05:31 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"They won all the battles yet Biden and his generals lost the war.\n\nThank you @seanhannity it was a pleasure to join the show!\n\nhttps://t.co/EvwCVg1Fpr","date":"Fri Oct 15 14:54:27 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The evil, deadly, coordinated globalist attacks we are currently witnessing on Ivermectin will go down in history as a vicious crime against humanity; a grievous public health policy error that can only be explained by following the money. #Ivermectin\n\nhttps://t.co/zDSNShOK9A","date":"Thu Oct 14 20:04:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"To date, there are at least 63 trials and 31 randomized controlled trials showing benefits to the use of Ivermectin to fight COVID-19 prophylactically as well as for early and late-stage treatment. #Ivermectin #COVID19\n\nhttps://t.co/zDSNShOK9A","date":"Thu Oct 14 19:55:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Did you know that Ivermectin has been used by brave doctors around the world to treat COVID-19 for over a year now, and it only recently became the target of a multi-pronged attack, thanks to Big Pharma, the media and the US government? #Ivermectin\n\nhttps://t.co/zDSNShOK9A","date":"Thu Oct 14 19:54:37 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My constituents have been asking how they can help Lt. Col. #StuartScheller. You can write a letter of support. Find out how right here: https://t.co/bV8bpLn42R","date":"Tue Oct 12 02:36:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"13 U.S. service members killed in Afghanistan during Biden's surrender\n\n10 innocent civilians—including 7 children—killed by a U.S. drone strike\n\nAnd yet, Lt. Col. #StuartScheller is the one facing a court martial because he dared to demand accountability from military leaders?","date":"Wed Oct 06 19:01:59 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My colleagues and I have asked that Lt. Col. #StuartScheller's request to resign be approved &amp; that he be honorably discharged. https://t.co/rxwtaUPDov","date":"Wed Oct 06 01:40:43 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@FoxandFriends @replouiegohmert: You don't want to be meaner to LTC Sheller than you are to the enemy.\n\nWatch the interview with Pete Hegseth this morning to get the latest on the case #foxandfriends #StuScheller\n\nhttps://t.co/YGnidZ4ie0","date":"Sun Oct 03 17:37:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TUNE IN for the latest on LTC #StuScheller and his pretrial detention hearing slated for Tuesday. I will be on @foxandfriends talking with Pete Hegseth about it this morning at 8:20 am EDT/7:20 am CDT.","date":"Sun Oct 03 12:08:52 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I'll be joining @seanhannity on his radio show at 3 p.m. CT/4 p.m. ET to discuss my meeting with Lt. Col. Stuart Scheller, who is in confinement at the brig at Camp Lejeune. \n\nListen live here: https://t.co/4pwnDzC8oo","date":"Fri Oct 01 18:38:57 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When I visited LTC Stuart Scheller in Camp Lejeune Brig, he looked good, he sounded good and we had a wonderful conversation. Like @seanhannity said, “Every American needs to contact their congressman or senator and put an end to this.”\n\nhttps://t.co/oyfm5nPTYd","date":"Fri Oct 01 18:26:35 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Issues Statement as to Why He Doesn't Support the Government Funding Bill https://t.co/kgRaDzFzkH","date":"Thu Sep 30 20:41:24 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Make no mistake, the evil, deadly, coordinated globalist attacks we are currently witnessing on ivermectin will go down in history as a vicious crime against humanity. \nMy op-ed on Ivermectin on American Greatness: https://t.co/XiJryHa8NM","date":"Thu Sep 30 18:52:34 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepAndyHarrisMD @RepRosendale @RepLaMalfa @RepJamesComer @RepLoudermilk @WarrenDavidson @USRepLong @RepPfluger @JudgeCarter","date":"Thu Sep 30 02:52:33 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepBarryMoore @RepDavidRouzer @RepMTG @jdanbishop @RepWebster @RepMaryMiller @RepGrothman @Rep_Clyde @RepDLesko @TXRandy14 @RepRalphNorman @RepMattGaetz","date":"Thu Sep 30 02:52:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepAndyBiggsAZ @RepCawthorn @RepBobGood @RepBoebert @RepHarshbarger @RepJeffDuncan @RepGosar @RepBuddyCarter @RepThomasMassie @RepBenCline @congbillposey","date":"Thu Sep 30 02:51:54 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In a letter to the U.S. Marine Corps Commandant, my colleagues and I have asked that LTC Stuart Scheller be released from pretrial confinement: https://t.co/vTSBXTvKvh","date":"Thu Sep 30 02:41:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Issues Statement on the Treatment of LTC Stuart Scheller https://t.co/hkotQ4m46S","date":"Wed Sep 29 22:26:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We need to get back to giving people their freedom in America.\n\nWatch last week's #gohmerthour here: https://t.co/2KmgbW8PXQ","date":"Sun Sep 26 12:00:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"With everything going on in America, I’m grateful that we worship a God that believes in second chances, and there’s nothing we can do to separate us from that love. \n\nWatch today’s #gohmerthour here: https://t.co/2KmgbVRezg","date":"Fri Sep 24 22:23:58 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@freedomcaucus @RepAndyBiggsAZ @RepCloudTX @RepBoebert","date":"Fri Sep 24 14:22:26 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch Live: Conversation with House Freedom Caucus on How to Stop Biden's Border Crisis, featuring Rep. Louie Gohmert, Rep. Andy Biggs, Rep. Michael Cloud, and Rep. Lauren Boebert. https://t.co/a0sPbOQraS","date":"Fri Sep 24 14:20:52 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Administration is turning this country into a cesspool.\n\nJoined @JennPellegrino and @CortesSteve on @newsmax to discuss this and more.\n\nhttps://t.co/x4meLzmiAW","date":"Thu Sep 23 18:43:29 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Members of the Armed Forces who have served our country honorably for years should not face the potential of a dishonorable discharge over a personal medical decision.\n\nhttps://t.co/GJWHLlowg1","date":"Tue Sep 21 17:58:59 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Service members are routinely denied access to the supreme court if the court of appeals for the armed forces declines to grant review. This is a travesty; service members should have the same access to SCOTUS as the terrorists detained in Guantanamo Bay.\n\nhttps://t.co/GJWHLlowg1","date":"Tue Sep 21 17:57:55 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On the 20th anniversary of 9/11, neither the tragedy nor the terrorism are over. https://t.co/qUgLjCsMZr","date":"Sat Sep 11 16:40:30 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Sadly, we not only bear the grief for all the lives lost to radical Islam, but now we also endure the grief and humiliation of the loss of a war in which we won the battles. https://t.co/qUgLjCsMZr","date":"Sat Sep 11 16:39:51 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Administration unfortunately provided the greatest amount of aid and comfort ever in history given to a villainous enemy in the form of tens of billions of dollars of weapons and equipment. https://t.co/qUgLjCsMZr","date":"Sat Sep 11 16:39:21 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"As we remember those who lost their lives 20 years ago, we also mourn the 2,448 American service members who gave their lives in AFG and those additional 12 Marines and one Navy Corpsman a few weeks ago, murdered at the Kabul airport by suicide bombers.  https://t.co/qUgLjCsMZr","date":"Sat Sep 11 16:38:28 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We solemnly remember those 2,977 innocent Americans who lost their lives simply because they went to work or boarded a plane. https://t.co/qUgLjCsMZr","date":"Fri Sep 10 22:24:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We have seared into our memories the images of countless other people who lived through a war zone in the streets of New York City, at the Pentagon and in a field in Shanksville, Pennsylvania. https://t.co/qUgLjCsMZr","date":"Fri Sep 10 22:23:42 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On September 11th each year we remember and grieve those lives lost two decades ago, along with those lost since then while fighting for our freedom from terrorists worldwide. https://t.co/qUgLjCsMZr","date":"Fri Sep 10 22:23:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I call on Speaker Pelosi and all Democrats to end this highly partisan, ideological and divisive assault on the life-preserving and conscience-protecting Hyde Amendment. #HydeSavesLives","date":"Wed Sep 08 19:13:08 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The People of the great state of Texas have just spoken definitively on the sanctity of life.  The Hyde Amendment is a long-standing and modest proposal to ensure that taxpayers are not forced to fund abortions. #HydeSavesLives https://t.co/Csl0YEtR7s","date":"Wed Sep 08 19:12:34 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The people that fought with us and for us are going to be killed unless this administration stops being an accessory to the most bloodthirsty organization in the world.\n\nhttps://t.co/8kS0G8liOE","date":"Tue Aug 31 22:49:28 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"And what does this President do? He leaves over 80 billion dollars of military equipment… and this is going to cost a lot of American lives.\n\nhttps://t.co/8kS0G8liOE","date":"Tue Aug 31 22:49:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Our allies are not all flocking to America, they’ve been telling me for over a decade to leave the weapons so that they can fight the Taliban and defeat them again as they did in 2001/2002. \n\nhttps://t.co/8kS0G8liOE","date":"Tue Aug 31 22:47:48 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@POTUS Give our allies those weapons that you can so they can defeat the Taliban again. Then do the right thing and resign for getting us in such a disastrously untenable position in the first place.  https://t.co/U1yiLlwFPG","date":"Tue Aug 31 01:31:57 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For the Biden administration to leave our blood-thirsty, murderous, enemies, the Taliban, billions of dollars in weapons and abandon our allies sends a chilling message to every nation in the world that considers being our ally.\n\nhttps://t.co/U1yiLlwFPG","date":"Tue Aug 31 01:22:58 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is critical that Biden and his administration use every means necessary to evacuate every single American, regardless of the phony August 31 deadline set by President Biden or whoever is making the important decisions for him in Afghanistan.\n\nhttps://t.co/U1yiLlwFPG","date":"Tue Aug 31 01:21:08 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"To accomplish this, Biden must forget his phony deadline and get all American citizens out of Afghanistan, airlift our remaining weaponry to our allies in the north, and blow up any U.S. weapons the Taliban has. https://t.co/fwMpQyt9qh","date":"Sat Aug 28 14:17:55 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Biden must forget his phony deadline and get all American citizens out of Afghanistan.","date":"Fri Aug 27 21:09:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Some say there are only two choices: unconditionally surrender by withdrawing, or send vast numbers of American troops back to Afghanistan. There is a third option: Exit Afghanistan but leave US weapons with the militia in the north that defeated the Taliban in 2001/2002.","date":"Fri Aug 27 21:09:18 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Now that we know President Biden puts precious American lives in the hands of our sworn enemies… it’s time for him to resign. https://t.co/kY1tOtaLre","date":"Fri Aug 27 19:08:45 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We need a Commander-in-Chief who will take “swift and forceful action”! https://t.co/kY1tOtaLre","date":"Fri Aug 27 19:08:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We are experiencing a crisis of leadership and American soldiers, citizens, and the people of Afghanistan are suffering for it.","date":"Fri Aug 27 17:31:06 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"After a year of no American deaths in Afghanistan, it’s time to hold those responsible for their actions accountable. This is heartbreaking and UNACCEPTABLE. https://t.co/FdSHJDhQHc","date":"Fri Aug 27 17:29:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Calls for President Biden to Resign Following the Deaths of U.S. Service Members in Afghanistan #BidenMustResign \n\nhttps://t.co/h32caZf4uL https://t.co/STJyZv9G4I","date":"Thu Aug 26 22:30:09 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Offers Real Solution to Botched U.S. Afghanistan Withdrawal https://t.co/vGUfcp1cew","date":"Thu Aug 26 16:33:08 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Former VP and current Caretaker President of Afghanistan, Amrullah Saleh, sent me the following message to the American people: https://t.co/kmW2Ah8AcO","date":"Wed Aug 25 20:59:23 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Along with my colleagues and founding Commander of the Delta Force LTG @GenBoykin, we held a press conference on the international emergency in Afghanistan. Thank you @RepBobGood @Rep_Clyde @mtgreenee @TXRandy14 for joining me! https://t.co/JKWHY4ybIT https://t.co/lVcVJ1R1Ii","date":"Wed Aug 25 20:54:14 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Texas GOP voting bill doesn't affect legal voting rights at all. It is making sure that legal voters' votes are not disenfranchised.\n\nJoined @JohnFBachman today on @newsmax to discuss this and more.\n\nhttps://t.co/2DQP5HQkF9","date":"Fri Aug 13 17:04:56 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's an honor to be named a 'life member' by the @texasforestry here in East Texas! https://t.co/wUU380feJd","date":"Wed Aug 11 17:42:33 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/VtzvW8wK3r","date":"Fri Jul 30 22:42:29 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Despite the best efforts of Marxists trying to shut down our right to free speech, my colleagues and I held a lively press conference today outside of the DOJ defending the rule of law and demanding answers about the January 6 prisoners.\n\nhttps://t.co/h7hg3HTBBy","date":"Tue Jul 27 19:40:58 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@RepLizCheney thinks it's \"a disgrace\" that my colleagues and I stand up for the rule of law. Coming from a shill for Nancy Pelosi, that's a compliment.\n\nCc: @RepGosar @RepMattGaetz @RepMTG @RepAndyBiggsAZ @RepBobGood","date":"Tue Jul 27 19:36:43 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I joined my colleagues @RepMattGaetz, @RepGosar, and @RepMTG in sending a letter to AG Merrick Garland requesting a meeting to discuss the treatment of those being prosecuted for the events that unfolded on Jan 6. https://t.co/ixi5RhCkRy","date":"Mon Jul 26 21:48:26 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Sadly, two systems of justice exist in America today: one for former President Trump along with those who support or don't hate him, and the other for everyone else.\n\nSee my statement and details regarding tomorrow's press conference outside of the DOJ below: https://t.co/VXo2dmEoZK","date":"Mon Jul 26 21:46:00 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The FBI has been committing crimes and spying on the American people without authority.\n\nDiscussed this and more during today's #GohmertHour.\n\nhttps://t.co/BHnR49Ga3w","date":"Thu Jul 22 20:55:41 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you to my colleagues for joining us on this letter: @RepAndyBiggsAZ @RepBoebert @RepMTG @RepMattGaetz @RepJeffDuncan @RepChipRoy @RepAndyHarrisMD @RepGregSteube @RepMcClintock @TXRandy14 @RepHarshbarger @RepMoBrooks @RepBobGood @RepMaryMiller @CongressmanHice","date":"Tue Jul 13 23:24:02 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Reports of the NSA spying on @TuckerCarlson are reminiscent of something one would expect to see in a tyrannical dictatorship, not the United States.\n\n@congbillposey and I along with our colleagues have sent a letter to the NSA Director demanding answers.\n\nhttps://t.co/YkQtl6VcZZ","date":"Tue Jul 13 23:23:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Independence Day! https://t.co/0cgJLdErk1","date":"Sun Jul 04 17:17:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Locals near the border are the one's getting hurt when the law is not being enforced and officers are prevented from enforcing the law.\n\nJoined @newsmax's @CortesSteve and @JennPellegrino to discuss the ongoing #BidenBorderCrisis\n\nhttps://t.co/QVMmwTtrft","date":"Fri Jul 02 16:22:29 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@Rep_Clyde and I knew we had to challenge Speaker Pelosi's unconstitutional use of magnetometers. This is a Speaker of the House becoming a dictator. If we let this go unchallenged it will get worse.\n\nWell guess what? It's already gotten worse...\n\nhttps://t.co/jTa6rIaZ94","date":"Wed Jun 30 15:50:46 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Money promised made available through the CARES Act... and now under this Administration, it really will not go to the people and small businesses that need it most.\n\nThanks @BobSellersTV &amp; @HeatherChilders for having me on the show!\n\nhttps://t.co/jorjgyXkyb","date":"Fri Jun 25 15:06:49 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It all sounds good... but is it going to follow the pattern of what I've been witnessing for years?\n\nhttps://t.co/LLOA9KU0ud","date":"Thu Jun 24 22:23:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Speaker Pelosi had known the level of violence that was being talked about, planned and monitored, surely she would not have turned down National Guard support on Jan 6...\n\nhttps://t.co/SgSANCruwy","date":"Thu Jun 17 19:30:09 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We don't know if it'll be Fauci or President Biden, but someone owes a big apology to the American people for the COVID coverup.\n\nhttps://t.co/UQdJxdSYzy","date":"Thu Jun 17 17:17:35 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you @RepAndyHarrisMD and @RepBoebert for signing on to this bill!","date":"Wed Jun 16 14:09:57 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you to my colleagues for joining me on this bill: @RepCloudTX @RepMTG @RepBobGood @CongressmanHice @Rep_Clyde @RepBrianBabin @RepRalphNorman @RepMattGaetz @RepScottPerry @Lancegooden","date":"Wed Jun 16 02:58:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Speaker Pelosi’s bill, HR 3325, doesn't honor the USCP but drives a narrative not substantiated by facts. Our brave Capitol Police deserve the upmost respect, which is why I have introduced a bill that serves as a tribute to our officers rather than using them as political pawns. https://t.co/S48ANqufyB","date":"Wed Jun 16 02:54:20 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We (@Rep_Clyde) have filed suit along with counsel @KenCuccinelli in the United States District Court for the District of Columbia for the unjust and unconstitutional imposition of magnetometers and fines by Speaker Pelosi.\n\nSee lawsuit text here: https://t.co/WikWiO9Rp1 https://t.co/2fdFqlozdb","date":"Mon Jun 14 17:36:20 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What was conveniently left out under the ellipses: https://t.co/akXQKUJg8c","date":"Wed Jun 09 17:11:13 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Exceedingly devious how you hid the context with an ellipses in your tweet. The hearing was about the BUREAU OF LAND MANAGEMENT &amp; climate change.\n\nBLM stands for the BUREAU OF LAND MANAGEMENT. #FakeNews","date":"Wed Jun 09 16:08:11 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert issued the following statement honoring America's fallen soldiers on Memorial Day https://t.co/TWh3dJ6jqV","date":"Mon May 31 16:55:43 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Perhaps one day even progressives will judge our military members by their heroism and not by the color of their political party.","date":"Wed May 26 16:00:50 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We would welcome a truly bipartisan commission for January 6, but we have seen too many lies and false assertions from the leaders of the Democratic party to know that will not be the case. \n\nJoined Newsmax's @HeatherChilders to discuss this and more:\n\nhttps://t.co/z2NcuStyJt","date":"Wed May 26 00:00:20 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There are people in the U.S. that say, \"There's no such thing as an innocent Israeli.\" The same things were being said in Europe in the 1930's. #GohmertHour #StandWithIsrael \n\nWatch live here: https://t.co/9Zz3X7wPCk","date":"Thu May 20 18:06:56 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When Democrats pick all of the staff for the January 6 commission, you know it's not going to be fair. #GohmertHour\n\nWatch live here: https://t.co/9Zz3X7wPCk","date":"Thu May 20 17:58:14 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The only thing Orwell got wrong in his book was the year. It's not 1984, it's now. #GohmertHour\n\nWatch live here: https://t.co/9Zz3X7wPCk","date":"Thu May 20 17:32:55 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We've been told to follow the science, but Speaker Pelosi is far more concerned with politics and control.\n\nListen as I discuss this and more with @LizMacDonaldFOX on Fox Business News:\n\nhttps://t.co/w3VXHg9Clt","date":"Thu May 20 12:17:53 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Speaker Pelosi is not letting out hours of video tape that would give us the whole picture of what occurred on January 6.\n\nJoined Newsmax's @HeatherChilders and @BobSellersTV to discuss this and more:\n\nhttps://t.co/5qt9gwzXSc","date":"Thu May 20 03:10:40 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Israel can not lay down its arms when they are being attacked. #StandWithIsrael","date":"Wed May 19 17:32:54 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When Israel is threatened, we can know the United States will be next. https://t.co/ThIdtcf8pL","date":"Wed May 19 17:26:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert issues statement demanding fair and equal treatment under the law for those arrested for January 6 events.\nhttps://t.co/2izFxSNEyE https://t.co/YTp5QYllFQ","date":"Sat May 15 04:21:44 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gohmert on Liz Cheney: Let's talk about the two U.S. pipelines that are being held hostage instead. Full statement below. https://t.co/Isb9WyUmHi","date":"Wed May 12 21:49:28 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Administration has perpetuated and multiplied the problem at our border. #BidenBorderCrisis  https://t.co/F8YJ7DyjRp","date":"Tue May 11 21:43:48 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The U.S. Postal Service apparently has deeper, darker secrets than the NSA. We don’t need any more government spying on our citizens. https://t.co/8qkxgoKSPo","date":"Fri May 07 23:03:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's crucial we use taxpayer dollars wisely. Honored to receive a perfect score from Citizens Against Government Waste.","date":"Fri May 07 17:14:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrats’ definition of compassion, which allows people to cross our borders and be forced into drug and sex trafficking is NOT my definition of compassion. \n\nDiscussed the #BidenBorderCrisis &amp; the non-Joint Session of Congress address on @newsmax: https://t.co/My1IjqHWVi","date":"Fri Apr 30 21:19:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My statement on President Biden's invitation-only Joint Session of Congress Address: https://t.co/el8sPgK6Z9","date":"Wed Apr 28 22:27:34 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joined my friend @seanhannity yesterday to discuss #DCStatehood \n\nListen here:\nhttps://t.co/muxrGMqK5k","date":"Tue Apr 27 20:37:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrats who do not support my bill to eliminate the income tax in the District of Columbia are the ones in favor of taxation without representation. #DCStatehood is not what the Founders intended. For Democrats, this is about politics, not principle.\nhttps://t.co/4jBne2yFyG","date":"Sat Apr 24 14:30:34 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Democrats were actually concerned about “taxation without representation” there would have been a slew of them cosponsoring the bill I’ve been filing for many terms to eliminate the income tax for the District of Columbia. #DCStatehood is about politics, not principle. https://t.co/tLXYmnjKFt","date":"Thu Apr 22 17:40:31 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Democrats supporting this proposed commission have no intention of having their party and its members pay reparations for what their party once so vociferously supported.\n\nCynicism and hypocrisy, anyone?\" @realJeffreyLord \nhttps://t.co/dFMTwqZtt4","date":"Tue Apr 20 17:01:17 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Issues Statement on his Reparations Bill Amendment Which Would Seek to Determine if the Democratic Party Should Pay Funds:\n\nVIDEO: https://t.co/LFouHtEbr9 https://t.co/wbrA3nlj54","date":"Thu Apr 15 20:06:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner I signed this petition #EndInfanticide","date":"Thu Apr 15 19:51:48 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Administration’s open borders policy is pouring billions into the drug cartels.  If we had any compassion, we would shut down the billions going from America to the cartels and then we’d see Mexico become one of the top economies in the world. #BidenBorderCrisis https://t.co/S0KoWg0vhv","date":"Wed Apr 14 20:03:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In an area where LEGAL American citizens aren’t even authorized to be, it’s nice to know we are rolling out the red carpet for future Democrat voters. #BidenBorderCrisis","date":"Wed Apr 14 16:44:56 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Judiciary Cmte scheduled a reparations bill vote this week. \n\nIf Dems are serious about reparations, those payments should come from the political party that so egregiously destroyed black communities by their actions and prejudice.\n\n#CancelDemocrats\n\nhttps://t.co/isLPcHRo8i","date":"Mon Apr 12 13:04:26 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Who is putting up the signs pointing to asylum at the U.S. border in Texas and why are they in Homeland Security bags? #BidenBorderCrisis https://t.co/Eo0VgyZqNU","date":"Fri Apr 09 22:59:06 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #BorderCrisis is a human tragedy that the Biden Administration has invited into our country. \n\nhttps://t.co/UAnMGYStzC","date":"Tue Apr 06 19:59:30 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The MLB is the latest professional sport to destroy its own fan base over \"woke\" culture. #GoWokeGoBroke \n \nJoined Newsmax's @JohnFBachman to discuss this and more:\n\n https://t.co/m5Kc433PF1","date":"Tue Apr 06 17:40:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Of the jobs President Biden says he is going to pay for, are they as \"shovel ready\" as they were when he was Vice President?\n\nhttps://t.co/LRE0kHlm4B","date":"Fri Apr 02 02:45:41 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Vice President Kamala Harris would come to the border and see what is going on firsthand, she would never be able to laugh as she did before about this crisis.\n\nJoined @newsmax's @SchmittNYC and fmr CBP commissioner Mark Morgan to discuss this &amp; more:\nhttps://t.co/V4XD0YUTOp","date":"Thu Apr 01 03:28:53 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Responds After Ethics Committee Denies Appeal to Metal Detector Fine https://t.co/0EtFnexIe3","date":"Tue Mar 30 23:23:43 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We're live now at the border with the House Texas Delegation to address the #BidenBorderCrisis.  https://t.co/F6RCKFXA9i","date":"Tue Mar 30 16:17:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"House #TexasDelegation report from the border:\n\n-Donna facility supposed to hold 250, currently has 5700  in custody\n\n-3,700 UACs\n\n-1600 family units\n\n-365 adults\n\n-None are tested for COVID here unless showing symptoms\n\n#BidenBorderCrisis https://t.co/qpgtn4t03d","date":"Mon Mar 29 22:07:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Mourns the Loss of His Father, Louis B. Gohmert:\nhttps://t.co/I62Ok4VRK4","date":"Thu Mar 25 17:06:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We need to give John Kerry the benefit of the doubt when it comes to the airline/mask fiasco. Being full of #hotair can make it really problematic. https://t.co/yyEKTY1C52","date":"Fri Mar 19 22:15:06 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Memo to woke Democrats: Be careful what you wish for.\"","date":"Fri Mar 19 21:01:40 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed the latest on COVID treatments, government's infringement on our liberties in response to the virus, Dr. Fauci's flip-flopping on masks and the harmful effects the lockdowns have had on our children with my friend @RepGosar and Dr. Scott Barbour. https://t.co/Jr4IxbroMo","date":"Fri Mar 19 19:50:31 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"While Americans are in lockdown, isolated from loved ones and wearing multiple masks,Biden welcomes illegal immigrants pouring through our borders with zero concern for the very virus the government uses as an excuse to strip us of our rights and freedoms. https://t.co/p02JJILG7b","date":"Thu Mar 18 16:25:58 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We absolutely want to show our gratitude and respect for the @CapitolPolice. The bill we offered removes the Speaker’s false and politicized narrative in order to truly honor those who protect us.","date":"Thu Mar 18 00:41:32 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thanks @RepMattGaetz. Just when you think this city can’t make you any more cynical, Democrats politicize a bill honoring the @CapitolPolice.","date":"Thu Mar 18 00:39:58 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The most compassionate thing we can do for those illegally trying to enter the U.S. is to defund the drug cartels by securing our borders. End the #BidenBorderCrisis   https://t.co/nmK5BPuI8v","date":"Wed Mar 17 22:35:01 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"While the drug cartels are working overtime invading our borders, it’s apparently siesta time for President Biden. #BidenBorderCrisis https://t.co/oZqqxnQFV6","date":"Wed Mar 17 21:19:55 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Speaking soon at the @freedomcaucus  #BidenBorderCrisis Press Conference. Tune in below!\n\nhttps://t.co/9Jg8WB0O6M","date":"Wed Mar 17 15:20:42 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When will Fauci be investigated for sending millions to the Wuhan lab? It’s possible he helped pay for this COVID disaster. We need answers.\n\nhttps://t.co/b8skGnWl2J","date":"Tue Mar 16 16:29:12 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Biden did say something I agree with during his speech when he said everybody has lost something during the pandemic.\n\nIn his case, it could be that he lost his mind allowing illegal migrants to be lured to the U.S. &amp; rolling out the welcome mat for cartels. #BidenBorderCrisis https://t.co/XqnGpJdjfE","date":"Fri Mar 12 19:56:10 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"President Biden, or whoever is pulling his strings, is complicit in helping fund drug cartels and human traffickers. \n\nIt’s time to end the #BidenBorderCrisis. Secure the border.\n\nhttps://t.co/gLdYtHcJNy","date":"Thu Mar 11 19:41:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Quit penalizing law-abiding Americans\n#HR8 \n#2A https://t.co/8LIzkAoAZe","date":"Thu Mar 11 00:38:48 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"See you soon #BidenBorderCrisis","date":"Wed Mar 10 19:03:45 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Venezuelans are fleeing their failed socialist state to come to America. \n\nWhere can Americans go once Biden and the Democrats turn the United States into Venezuela?\n\nhttps://t.co/FjNPciyyoy","date":"Tue Mar 09 22:54:12 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Biden Admin &amp; Speaker Pelosi apparently believe that illegally crossing the Rio Grande River cures COVID. \n\nThey have a lot to answer for.","date":"Tue Mar 09 21:26:13 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This isn't just a #BorderCrisis, it is a national crisis.\nhttps://t.co/W3PHufCY5G","date":"Sat Mar 06 02:07:33 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Speaker Pelosi and Majority Leader Hoyer cancelled Congress yesterday due to a conspiracy theory about President Trump’s inauguration.\n\nIt turns out, the only ones in Washington who follow and believe what QAnon has to say are Pelosi and Hoyer.","date":"Fri Mar 05 13:43:13 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Do we need to negotiate a status of forces agreement with Speaker Pelosi?\n\nI am fed up with how the #NationalGuard is being treated in Washington, D.C. \n\nhttps://t.co/wr66ZrHeIn","date":"Wed Mar 03 21:12:05 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here's a quick hit list of the WORST of the Democrats’ election power grab from states. #HR1 would legalize and mandate just about everything that went wrong in the 2020 election.\n\n https://t.co/O15FWGANEq","date":"Tue Mar 02 18:10:18 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrat’s #EqualityAct is all about power. It represents fascism at its worst and it’s coming—not to a home near you—but to your home. We’ve got to stand against it. https://t.co/NtMsN0VpQh","date":"Thu Feb 25 22:13:19 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When you seal up a pressure cooker and continue to taunt it, it’s not going to work out well. I deplore and condemn all violence but let’s work together towards a peaceful resolution instead of only seeing problems with one side. (2/2)","date":"Thu Feb 25 03:48:38 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats never seem to understand that one of the more inciteful things that they do is to, not only misrepresent things like the Russia Hoax, but then turn around and try to silence Republicans or opposing views. (1/2)\n\nhttps://t.co/i9Q3dzwAg1","date":"Thu Feb 25 03:48:37 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It has been over a month since Officer Brian Sicknick's tragic death. \n\nHis family still doesn’t have answers. This alone warrants a hearing.\n\nSadly, those in charge here at the Capitol have gotten really good at covering things up. https://t.co/1E7a6drbIr","date":"Wed Feb 24 19:39:12 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Dems want cable companies to cancel @OANN @newsmax @FoxNews \n\nAs with Big Tech’s effort to destroy Parler, the Left is on a totalitarian, fascist mission to destroy free speech &amp; diversity of thought in America\n \nA Cancel Culture of opposing views has no place in a free society","date":"Tue Feb 23 18:25:52 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrats’ Equality Act is about anything but equality. \n\nIt would set back women’s sports and scholarship opportunities by decades. \n\nhttps://t.co/DpOXhsAsZI","date":"Mon Feb 22 20:17:39 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert: Biden's 'America First' plan doesn't mean the US comes first\n\nhttps://t.co/J81wPScSpo","date":"Sat Feb 20 00:46:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Over a decade ago, we had a federal report that said we needed to winterize our plants.\n\nWell, instead of focusing money on winterizing plants and preparing for this time, they spent that money developing new solar and wind energy.\n\nhttps://t.co/xXZ0oqsH4p","date":"Fri Feb 19 20:23:29 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Fed pressure to get TX to move toward green energy has cost us the ability to provide our citizens with the energy we need. \n\nWe have the means to keep our state running, but if Dems get in our way, TX will become like CA with unreliable energy sources https://t.co/yZL7ukvd4t","date":"Thu Feb 18 20:31:19 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rest In Peace, my dear friend, Rush Limbaugh. https://t.co/JCVbZiR9tb","date":"Wed Feb 17 19:48:36 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For East Texas residents, below is a link of emergency resources and warming centers in the area. Please stay safe! https://t.co/7vRoaEYPLB","date":"Tue Feb 16 22:55:27 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Statement on the tragic passing of Rep. Ron Wright: https://t.co/tvXjKCELba","date":"Thu Feb 11 02:03:25 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Unlike in The Godfather, there are no toilets with tanks where one could hide a gun in the restroom in the Speaker's Lobby off the floor. Re-entry onto the floor, where there is no magnetometer, should have been a non-issue. It has always been until Thurs. https://t.co/TNWr9VUl62","date":"Sat Feb 06 02:17:29 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Why isn't the Speaker of the House being fined for skirting the metal detector?","date":"Sat Feb 06 01:26:32 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If President Biden takes away Americans freedoms through his Executive Order mandates, he should abide by his own dictatorial commandments. https://t.co/YioOYiklDG","date":"Fri Feb 05 19:57:00 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I will never bow to the anti-truth mob. https://t.co/1fP8SC0gnp","date":"Fri Feb 05 17:50:52 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Never in history has a majority party taken such fanatical action to remove somebody from the other party from committees. We had a Sen. named Biden who viewed a KKK recruiter as a mentor and friend and you punished him by inaugurating him as President.https://t.co/5mDYyQvwdu","date":"Thu Feb 04 22:47:23 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Whether it's the #ShamImpeachment or attempts to censure Republicans using false claims of \"inciting violence,\" Democrats take reckless actions, setting dangerous precedent. Discussed this and more on @OANN with @DanNewsManBall https://t.co/8u0OeuAqad","date":"Wed Jan 27 20:40:50 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At least the Biden administration's agenda is consistent: Help for China, hurt for America. https://t.co/DX0JEmzLwj","date":"Tue Jan 26 01:11:21 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Dear April, when someone says \"your libelous allegation is totally false,\" that means, \"no.\" I did not give a tour. Your malice is showing. #FakeNews","date":"Fri Jan 15 15:59:03 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/FchqlVfUeg","date":"Thu Jan 14 02:39:24 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Half of all impeachments ever conducted occurred under Speaker Nancy Pelosi\n\nMy speech today on the House floor: https://t.co/CfePB7Luod","date":"Thu Jan 14 01:37:55 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Interesting to note that the alt-left media believe Speaker Pelosi’s comments could have incited violence...\n\nMedia Are Accusing A Republican Lawmaker Of Insurrection For Quoting Nancy Pelosi:\n\n https://t.co/HPLTwMcqaN","date":"Wed Jan 13 21:05:32 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Typical for CNN to accuse me of a crime without any basis in fact. Your libelous allegation—even in the form of a question—is totally false &amp; malicious. #FakeNews","date":"Wed Jan 13 20:10:16 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@RepSwalwell is flat out lying to the American people. I had no involvement in inciting violence. Perhaps he is trying to detract from his relationship with a Chinese spy. By the way, why is he allowed to serve on the intel committee? https://t.co/nAKVO9xqVR","date":"Fri Jan 08 03:13:15 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Please people; no violence. That only hurts our cause. Those leading the charge like the guy in yellow with the communist hammer &amp; sickle tattoo: stopping the violence applies to you too. https://t.co/XLKU9Y2y4x","date":"Wed Jan 06 21:38:34 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Can anyone explain this?? Data experts say over 432k votes removed from @realDonaldTrump  in Pennsylvania. Yet Democrats &amp; media continue to tell us there is nothing to see here. #StopTheSteal #SaveTheRepublic  https://t.co/4inPpLy1ir","date":"Mon Jan 04 15:32:22 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert Responds to False Claims that he is Advocating for Violence:","date":"Sun Jan 03 01:00:26 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/qEtyD7nmCX","date":"Sat Jan 02 18:37:17 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Judge rules “no standing” in my lawsuit to toss fraudulent Biden electors. If I don’t have standing, no one does. When no one ever has standing, what good is a court system? My response on @Newsmax below #SaveTheRepublic #StopTheSteal  https://t.co/HLQCM6S5CE","date":"Sat Jan 02 04:29:27 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining @EmeraldRobinson on @Newsmax tonight at 9:05 p.m. CT/ 10:05 p.m. ET with an important update on the Pence lawsuit. We must fight to #SaveTheRepublic #StopTheSteal","date":"Sat Jan 02 02:11:20 +0000 2021","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We have a chance for right to prevail and wrong to fail and we need to pursue that. The country is a stake. Once an election is established by fraud, there’s no coming back from that. #SavetheRepublic #StoptheSteal\nhttps://t.co/G8PlGOI0mJ","date":"Thu Dec 31 15:39:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We continue to hold out hope that there is a federal judge who understands that the fraud that stole this election will mean the end of our republic. This lawsuit would ensure that the VP can only accept electors legitimately and legally elected. https://t.co/1wenhJrRFY","date":"Tue Dec 29 01:18:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Honored to host the @seanhannity radio show today from 2-5 p.m. CT. We will have wall to wall coverage on the rampant fraud that took place in the 2020 presidential election. #StopTheSteal #SaveTheRepublic https://t.co/5f3PdxpwlK","date":"Tue Dec 22 20:01:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Has anyone seen AG Bill Barr? Where is @TheJusticeDept?? #StopTheSteal #SaveTheRepublic","date":"Fri Dec 11 14:41:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congratulations to the winners of the 2021 Congressional Art Competition for Texas’ First District! We had so many wonderful entries. Thank you to the students who submitted their work and to the teachers for the extraordinary jobs they do! https://t.co/UkUQY6uzA2","date":"Thu Dec 10 18:01:00 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My statement on the Texas lawsuit to protect election integrity #GodBlessTexas #StopTheSteal https://t.co/oR4NOw7i0T","date":"Wed Dec 09 00:31:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Reporters are already more interested in covering the fact that my temporary crown came loose during today’s press conference than they ever were in reporting on Hunter Biden’s laptop or the rampant election fraud in the 2020 race. Excellent priorities, as always. #Crowngate","date":"Tue Dec 08 23:32:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Justice delayed is justice denied, and in this case, it's a free and fair election that has been denied. @realDonaldTrump  cc: @TheJusticeDept  \nhttps://t.co/VXYJvRudAK","date":"Mon Dec 07 14:57:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Kudos to Sen. @MarshaBlackburn for not bowing to Chinese Communist Party nasty attacks. In Beijing yrs ago, she &amp; I tried to get China's leaders to stop stealing American copyrights &amp; patents. No wonder they desperately want Biden &amp; Dems in power. God bless Blackburn &amp; Trump!","date":"Sat Dec 05 21:39:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/iDgTJEPDKf","date":"Fri Dec 04 20:06:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There’s widespread evidence of fraud because people haven’t done their jobs. Durham and Barr will deserve a big notation in history when it’s written about the rise and fall of the U.S. if they don’t clean up this mess. Clean up the fraud. DO YOUR JOBS &amp; save this country. https://t.co/RSRctcfQX2","date":"Thu Dec 03 21:27:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"There is not just smoke here, there is fire. There are incredible amounts of fraud that did affect the national election. Where is @TheJusticeDept ?? \n\n#StopTheSteal\n\ncc: @realDonaldTrump \n\n https://t.co/sQZgFMfeSf","date":"Thu Dec 03 20:02:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#HappyThanksgiving! \n\nEnter his gates with thanksgiving and his courts with praise; give thanks to him and praise his name. – Psalm 100:4 https://t.co/fB9r568hF5","date":"Thu Nov 26 14:05:41 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If we don’t stop the fraud and fix the system, 2022, 2024 and beyond won’t be free and fair elections. We must preserve the integrity of our elections. #StopTheSteal \ncc: @TheJusticeDept \nhttps://t.co/IlUxdY2ALv","date":"Sun Nov 22 20:16:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This should clarify the misinformation circulating social media regarding my comments on #Scytl and election fraud #StopTheSteal cc: @TheJusticeDept https://t.co/tiTOS3ekOa","date":"Fri Nov 20 22:40:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Where is @TheJusticeDept?? https://t.co/FGmSQSwkeH","date":"Fri Nov 20 21:14:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Appearing on @newsmax TV's \"National Report\" this morning at 9AM CT. We'll discuss issues in #Congress, #lockdowns, #COVID and more. Tune in: https://t.co/iEhefTLkJI","date":"Thu Nov 19 14:42:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will appear @newsmax TV around 6:20AM CT and discuss the #BigTechHearing yesterday. Tune in!","date":"Wed Nov 18 12:14:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to Joe Pags re: #voterfraud, makeup of the House &amp; Senate going into next year &amp; more. Listen in to @JoeTalkShow TONIGHT at 6:30PM CENTRAL, here: https://t.co/D8h76k4nsw","date":"Tue Nov 17 23:11:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed Scytl, servers and illegal votes with @CharlieKirk11 \n\nCc: @TheJusticeDept  \n\nhttps://t.co/dQfRORLEcQ","date":"Tue Nov 17 16:30:48 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @WilkowMajority on @SiriusXMPatriot today at 1:20pm CT. We’ll discuss #VoterFraud #BigTechCensorship &amp; more.","date":"Mon Nov 16 18:37:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to  @newsmax TV around 4:20PM CT today! Will talk to Chris Salcedo about the ongoing #voterfraud news around the country. #CountEveryLegalVote","date":"Thu Nov 12 21:45:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Appeared on @FoxFriendsFirst this morning -- weighed in on #voterfraud &amp; listed proven instances of the corruption. #CountEveryLegalVote\n\nWatch the interview, here: https://t.co/rqWAvVc4Mt","date":"Thu Nov 12 13:49:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to @FoxFriendsFirst TOMORROW morning at 5:55AM ET regarding #BigTech, #VoterFraud &amp;  more!","date":"Thu Nov 12 01:30:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"May God continue to bless our veterans &amp; their families. May their lives, memories &amp; acts of valor live on in our hearts &amp; truly drive our passion forward to preserve these United States. 🇺🇸\n\n#GodBlessOurVeterans #VeteransDay #ThankAVeteran https://t.co/2A3rv2voUS","date":"Wed Nov 11 14:29:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"cc: @TheJusticeDept","date":"Tue Nov 10 19:04:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I was honored to participate in a ceremony last night celebrating servant leadership at Tyler Metro Church. #TX01 (John 13:12-17) https://t.co/EHuEHh3VUX","date":"Tue Nov 10 17:47:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Birthday to our United States #Marines! https://t.co/r4YIzvl5As","date":"Tue Nov 10 14:50:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to #WashingtonWatch today at 4:05PM CT. Taking to @tperkins about my trip to Philadelphia and widespread reports of #voterfraud. \n\nListen in to @FRCdc radio today! #CountEveryLegalVote","date":"Mon Nov 09 21:48:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My UPDATE from Philadelphia on the Democrat's efforts to delegitimize our election process.\n\n…The only thing George Orwell got wrong was the year. It wasn't 1984, its right now in 2020.\n\nhttps://t.co/Ca3Jo95tVX","date":"Sun Nov 08 00:27:56 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"After enduring months of riots, censorship and disinformation, the chaos and confusion that the radical Left has promised us would occur during the presidential election has finally come to fruition. cc:@TheJusticeDept #CountEveryLegalVote","date":"Fri Nov 06 22:02:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to Chris Salcedo on  @newsmax TV around 4:20pm CT! \n\n#CountEveryLegalVote","date":"Fri Nov 06 21:47:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I'm in Philly where voter fraud is rampant. Where's @TheJusticeDept??? #CountEveryLegalVote https://t.co/LskjwnJhL2","date":"Fri Nov 06 18:40:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to the @toddstarnes show at 12pm CT. #CountEveryLegalVote LISTEN LIVE, here: https://t.co/ZfjE8Ti9GT","date":"Fri Nov 06 17:54:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#CountEveryLegalVote\n\ncc: @TheJusticeDept","date":"Thu Nov 05 22:01:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#CountEveryLegalVote \n\ncc: @TheJusticeDept","date":"Thu Nov 05 19:33:19 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"cc: @TheJusticeDept","date":"Thu Nov 05 15:59:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"https://t.co/PeH7JwII28","date":"Thu Nov 05 15:38:39 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Good question. cc: @TheJusticeDept????","date":"Thu Nov 05 15:20:47 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"cc: @TheJusticeDept????","date":"Thu Nov 05 13:28:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today and always – may God continue to bless the United States of America and shine His favor down on us.","date":"Tue Nov 03 16:30:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#PromisesKept","date":"Fri Oct 30 14:09:48 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was an honor to present #WWII combat veteran Charles Clayton a flag flown over the U.S. Capitol at his 100th birthday party this week! #TX01 #GodBlessOurVeterans https://t.co/SrVuQLMTlT","date":"Thu Oct 29 17:45:41 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @toddstarnes today on his radio show re: #socialmediacensorship, #bigtech and more. Listen in to the program at 1pm CT, here: https://t.co/Zra8IfpNNk","date":"Thu Oct 29 16:40:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"U.S. GDP booms at 33.1% rate in Q3, better than expected \n\n#GreatAmericanComeback \n\nhttps://t.co/HvINycBc0q","date":"Thu Oct 29 13:39:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @AM1070TheAnswer this morning at 8AM CENTRAL. Talking to Sam Malone re: news in #Congress and more.","date":"Wed Oct 28 12:24:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @LarsLarsonShow's radio show this afternoon at 3:30PM CENTRAL. We'll discuss the #HunterBidenLaptop &amp; Coronavirus stimulus talks. Tune in!","date":"Tue Oct 27 18:35:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#AmyConeyBarrett has shown herself to be an intellectually stellar, exceedingly fair-minded, and impressively equitable judge. Her sterling and unblemished character will serve as an invaluable asset on the U.S. Supreme Court: https://t.co/CPjSiZAY6y","date":"Tue Oct 27 17:04:25 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to the @davidwebbshow this morning at 9AM CENTRAL! We will talk about the #SCOTUS vote, Hunter Biden e-mails and other breaking news topics this week. Listen in to @SiriusXMPatriot!","date":"Tue Oct 27 13:01:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congratulations Amy Coney Barrett! You got this. \n\nThank you to @realDonaldTrump for the brilliant nomination and @senatemajldr for all the hard work. \n\nAlso, Happy Birthday to Hillary Clinton! We couldn’t have done this without you. #3TrumpJustices\n\nNot tired of #WINNING.","date":"Tue Oct 27 00:07:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: @RepAndyBiggsAZ and @RepGosar and I called for a special counsel investigation into Vice President Joe Biden. Listen to our segment with @seanhannity https://t.co/98PWFiHZZW","date":"Mon Oct 26 20:46:56 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Small &amp; independent business owners are truly the backbone of our economy. They are vital to ensure free market success ... #smallbizguardian @NFIB \n\nhttps://t.co/aoZk015pWQ","date":"Mon Oct 26 18:40:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Last week, I joined several of my colleagues in urging AG Barr to appoint a Special Counsel to investigate the #BidenCrimeFamily. Will be joining @seanhannity today at 3:30 pm CDT to discuss!","date":"Fri Oct 23 19:46:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Appearing on “Victory Update” today at 4PM CENTRAL on  @GoVictoryTV. \n\nYou can watch the livestream, here: https://t.co/9AJwevzexR","date":"Wed Oct 21 21:05:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"This is potential corruption on an unbelievable level and it's got to be investigated or it's just going to get worse and worse.\" https://t.co/olVVwo4axf\n\n#HunterBiden #FBI #DOJ  #SpecialCounsel","date":"Wed Oct 21 14:01:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxFriendsFirst TOMORROW morning at 5:55AM ET! Will discuss a letter I sent (along w/ 11 of my colleagues) to AG Barr urging him to appoint a special counsel to investigate alleged revelations from Hunter Biden's laptop. https://t.co/RxOY8EhDFF","date":"Tue Oct 20 22:10:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Appeared on @ffweekend yesterday and weighed in on Rep. Adam Schiff 's claim that Hunter Biden's laptop is part of a 'Russian intelligence operation.' \n\nWatch the full interview, here: https://t.co/kHFhJvHGLG","date":"Mon Oct 19 16:37:56 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @CarlHigbie on @newsmax TV  this weekend re: #bigtech censorship and more. Here's the link to the full interview: https://t.co/E2G0GSbAMW","date":"Mon Oct 19 15:35:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @ffweekend at 5:35AM CT this morning! Discussing Adam Schiff claiming Hunter Biden email stories come 'from the Kremlin', #COVIDRelief and more. \n\nhttps://t.co/fVfBFHi2pA","date":"Sun Oct 18 10:23:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @NEWSMAX TV today at 10AM CT! Talking about the Hunter Biden bombshell story and social media censorship.","date":"Sat Oct 17 13:04:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Dr. Scott Barbour joined me and Rep. @michaelcburgess to lay out the facts about COVID-19 treatments and his concerns over the virus testing, case numbers and death rates. Watch the series on https://t.co/YfuiULYkTa https://t.co/Ta570FuxWu","date":"Fri Oct 16 20:24:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"NEW Bombshell report: Biden \"donors, lobbyists and allies\" helped his son Hunter get almost every single job he has ever had.\n\nLikely reactions:\n\nMedia: Crickets\n\n#BigTech: Censor this! \n\nhttps://t.co/FFYlacT3Bc","date":"Fri Oct 16 16:47:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"House Republicans ask FBI if it had Hunter Biden's alleged laptop during Trump's impeachment https://t.co/xsivIK7VGy","date":"Fri Oct 16 14:58:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump was the clear winner in last night’s debate against @JoeBiden’s Press Secretary @SavannahGuthrie #MAGA","date":"Fri Oct 16 12:38:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's time to remove the protections #BigTech receives under #Section230. They do not care about free speech, but suppressing information that dares to challenge their radical leftist ideologies. Read the censored NYPost story on my website: https://t.co/pKfq1SQa8T","date":"Thu Oct 15 17:50:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In case you missed it on https://t.co/YfuiULYkTa, @RepGosar and I discussed COVID, masks, lockdowns and HCQ with @drsimonegold  \nhttps://t.co/lix13Yttmz","date":"Fri Oct 09 20:33:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @WBAP247NEWS this morning at 8:15AM CT. Will weigh in on all the breaking news this week and talk about @realDonaldTrump's announcement to declassify Russia collusion, Clinton documents. Tune in soon!","date":"Thu Oct 08 13:13:44 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to “The Sam Malone Show” this morning to discuss the breaking news this week. Listen in to @AM1070TheAnswer around 7:15AM CENTRAL!","date":"Thu Oct 08 11:42:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is my hope the media will act humanely and not politicize this any further. May God comfort the Farmer family during this time.  5/5","date":"Tue Oct 06 20:59:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Sadly, some in the liberal media were quick to politicize this, and I'd like to clear some things up: I tested positive for COVID-19 on July 29. On August 19, after I was cleared from having the virus, I donated my plasma. 3/5 https://t.co/95qGudZL0N","date":"Tue Oct 06 20:59:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Reagan Day event took place after I recovered and tested positive for antibodies. 4/5","date":"Tue Oct 06 20:59:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I want to extend my sincerest condolences to the Farmer family and the Craighead County GOP for their tragic loss. Steve Farmer was clearly a beloved husband, father and an American patriot. 1/5 https://t.co/2JOWtGH3rI","date":"Tue Oct 06 20:59:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I was honored to be invited to Arkansas to attend the Craighead County Reagan Day Event on Sept. 12. Although Mr. Farmer was not in attendance, his organization put on a wonderful event. 2/5","date":"Tue Oct 06 20:59:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to \"The Wilkow Majority\" on @SiriusXMPatriot today at 1:40PM CT! We'll discuss COVID, mail in ballots and more. Tune in!","date":"Mon Oct 05 18:21:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"About to join @newsmax TV to discuss my #COVID recovery and talk about the news of President Trump’s diagnosis. Tune in!","date":"Sat Oct 03 16:56:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will join @ffweekend this morning at 8:30AM CT to discuss the news of President Trump’s COVID diagnosis. Will additionally talk about my #COVID recovery process. Tune in to @FoxNews to watch the segment!","date":"Sat Oct 03 12:21:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"To @realDonaldTrump &amp; @FLOTUS: I’m so sorry that you have the Chinese Virus. May God bless you through this time. Your WH doctor's advice to me on an HCQ regimen helped immensely. I felt better after the virus than before I had it &amp; pray the same for you!","date":"Fri Oct 02 14:40:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Another Democrat Senator who voted against the Civil Rights Act was ex-KKK member, Robert Byrd, whom VP Joe Biden eulogized at his funeral in 2013 https://t.co/twFMl7VItp 7/8","date":"Thu Oct 01 22:27:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Ultimately, 21 Democrat Senators voted against the Civil Rights Act of 1964, including Al Gore Sr. and only one of them switched to the Republican party afterwards. On average those 20 seats didn’t flip to Republican for over 20 years after the vote took place. 6/8","date":"Thu Oct 01 22:27:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Republicans didn’t hold a majority of Southern congressional seats until 1994, 30 years after the Civil Rights Act of 1964. 8/8","date":"Thu Oct 01 22:27:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The overwhelmingly Democratic manifesto accused SCOTUS of a “clear abuse of judicial power” for its decision on Brown v. Board of Education and vowed to use “all lawful means” to reverse the decision. 4/8","date":"Thu Oct 01 22:27:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"As far as the myth of the great Democratic “switch,” of the over 200 Dixiecrat governors, senators, congressmen, etc. all but two stayed in the Democratic Party 2/8","date":"Thu Oct 01 22:27:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats led a 75-calendar-day filibuster against the 1964 Civil Rights Act. 5/8","date":"Thu Oct 01 22:27:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In 1956, 99 Democrats and only two Republicans signed on to the Southern Manifesto which opposed desegregation of public spaces.3/8","date":"Thu Oct 01 22:27:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"You acknowledge the evil past of the Democratic Party as it relates to slavery and Jim Crow. Are those facts alone not enough to compel a vote to rid the House of any mention of the party which overwhelmingly and enthusiastically supported those wicked practices? 1/8","date":"Thu Oct 01 22:27:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Committee Legislative Hearing - Environmental Justice for All Act. \n\nWATCH LIVE: https://t.co/R9ad5tV2gh","date":"Thu Oct 01 16:26:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @WBAP247NEWS this morning at 8:15AM CT regarding my vote on H.Res.1155 (Peaceful Transition of Power Resolution). Listen in here LIVE: https://t.co/5eHapEoWii","date":"Thu Oct 01 12:43:23 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At 11AM CT - House Judiciary will hold a Full Committee Hearing: Copyright and the Internet in 2020. Watch it LIVE, here: https://t.co/nKpZRpdZCe","date":"Wed Sep 30 15:40:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I voted “no” on the House Democrats’ resolution because it singles out @realDonaldTrump demanding “no disruptions” &amp; irresponsibly fails to mention the need for the Democrat candidate to also accept the results of a fair election as well.\n\nVIDEO: https://t.co/SYV2SJN0al","date":"Wed Sep 30 14:40:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my full statement  regarding  my vote on the \"Peaceful Transition of Power Resolution\" yesterday: https://t.co/bFWR4dtss4","date":"Wed Sep 30 14:23:47 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @OANN \"In Focus\" with @STEPHMHAMILL tonight! Will discuss important issues of the day such as the Dem Coronavirus Stimulus Bill, #SCOTUS &amp; more.  \n\nBe sure to watch at 5pm CT!","date":"Tue Sep 29 21:10:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to Newsmax TV at 4:10PM CENTRAL today re: @realDonaldTrump’s Supreme Court nominee #AmyConeyBarrett. \n\nTune in to “The Chris Salcedo Show!”","date":"Mon Sep 28 21:06:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What a powerful event today in Washington, DC! Great visiting with @Jonathan_Cahn, Pastor Kevin Jessip &amp; @AGLotz. @2020_return https://t.co/WS15jgKO6H","date":"Sat Sep 26 17:21:47 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Respected doctors with vital COVID-19 research and clinical experience are being vilified by the Trump-hating media and silenced through censorship by social media monopolies. Listen to our discussion on #MedicalFreedom with @seanhannity https://t.co/Q6R0Ukfhij","date":"Fri Sep 25 19:48:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#CancelDemocrats https://t.co/gB7CHlfVpI","date":"Thu Sep 24 23:21:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is time for Dems to account for and rid our Capitol of the sins of their party’s past. Let's vote to ensure that the U.S. Capitol building is a “safe space” for all Americans under the new principles Dems unveiled. #CancelDemocrats @realDonaldTrump https://t.co/q1WvPPWZPf","date":"Thu Sep 24 23:00:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Though I personally believe we need to learn from history including the good, the bad and the ugly, the Democratic Party has initiated this purging but needs assistance to avoid unparalleled hypocrisy. #CancelDemocrats https://t.co/isLPcHRo8i","date":"Thu Sep 24 22:55:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Whether it be slavery or segregation and Jim Crow laws, one thing is certain: this disgraceful and inhumane stain on American history is covered in the fingerprints of the Democratic Party. #CancelDemocrats @realDonaldTrump https://t.co/isLPcHRo8i","date":"Thu Sep 24 22:45:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Dem policies have caused a great deal of destruction to the nuclear family, significantly impacting minorities. Studies show that a child has a much better chance for success both physically and fiscally when the nuclear family is intact. #CancelDemocrats \nhttps://t.co/q50JtPBzik","date":"Thu Sep 24 22:40:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"While Democrats continue to denounce our country ad nauseam over “systemic racism,” they somehow fail to take responsibility for their own party’s abhorrent historical views and policies which promulgated racism in our nation for decades. #CancelDemocrats\nhttps://t.co/q50JtPBzik","date":"Thu Sep 24 22:35:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today, I reintroduced my Privileged Resolution urging my Dem colleagues to rid the House wing of the U.S. Capitol of any item that names, symbolizes or mentions their own political party because of its past support for slavery. #CancelDemocrats https://t.co/q50JtPBzik","date":"Thu Sep 24 22:25:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"COVID has exposed the medical industrial complex’s grip on society and reiterated the importance of #medicalfreedom in our country. Will be speaking with @randpaul on @seanhannity’s radio show at 4p.m. CT/5p.m. ET about our medical freedom doctor panel. https://t.co/kRTmLAJXPP","date":"Thu Sep 24 20:11:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My web series, Covid-19 and Medical Freedom: A Congressional Inquiry launched tonight on @seanhannity's website. @RandPaul joins me in speaking w/ Yale epidemiologist Harvey Risch, family physician Dr. George Fareed &amp; infectious disease Dr. Stephen Smith. https://t.co/38ncxj1FDu","date":"Thu Sep 24 00:44:36 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Wil appear on @newsmax TV today at 11AM CT. Will weigh in on the  upcoming decision of the #SCOTUS  nominee  and more. Watch live, here: https://t.co/iEhefTLkJI","date":"Wed Sep 23 14:30:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats are saying that a Supreme Court justice should not be replaced until a new president takes office; but that would be 4 1/2 years from now — and that's WAY too long. @realDonaldTrump","date":"Mon Sep 21 13:42:40 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today we honor the patriots who placed their lives on the line to protect this country and ensure security for our future. They paid a dramatic, staggering price for defending our livelihood and are among the most heroic of Americans. #POWMIARecognitionDay https://t.co/gouu9KvIol","date":"Fri Sep 18 14:26:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Spoke on the House Floor yesterday afternoon regarding the ongoing violence and violations of federal and most state laws by angry rioters around the country. \n\nWatch the full speech, here: https://t.co/ge7GlFHCNO","date":"Fri Sep 18 13:36:32 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The U.S. Capitol Rotunda has an incredible history. I hope you enjoy this video. https://t.co/PWKxr85sNv","date":"Thu Sep 17 19:45:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Subcommittee on Oversight &amp; Investigations Hearing https://t.co/SlDhkGXZDC","date":"Thu Sep 17 18:48:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @OANN last night re: Abraham Accords Peace Agreement. \n\n\"This is a new day in the Middle East, and this is a huge deal.\" FULL VIDEO: https://t.co/0YUxp8Gywl","date":"Thu Sep 17 16:05:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On September 17, 1787, the Founding Fathers signed the most influential document in American history, the U.S. Constitution. #ConstitutionDay https://t.co/dWSEzIypE3","date":"Thu Sep 17 14:20:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @OANN tonight at 7PM CT! Talking to @STEPHMHAMILL on her new show, \"In Focus.\" \n\nWe'll discuss @realDonaldTrump's Middle East peace agreements &amp; the possibility of a coronavirus stimulus deal in the House.","date":"Wed Sep 16 23:00:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Trevor Reed is a former US Marine &amp; Texas native who was wrongfully detained in Russia and sentenced to 9 years in prison – all on baseless accusations &amp; trumped up charges. The Putin regime must immediately #FreeTrevorReed. Learn more: https://t.co/DnsL21Zv3C","date":"Wed Sep 16 19:39:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to \"The @toddstarnes Show\" around 12:30PM CENTRAL TODAY! We'll discuss the possibility of a deal being reached between House Democrats and Republicans on COVID relief and more.  Listen in online, here: https://t.co/8m7KO6tCsc","date":"Wed Sep 16 16:55:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Always honored to participate in the \"Bible Reading Marathon\" at the U.S. Capitol. https://t.co/BLVP9MNr8V","date":"Wed Sep 16 00:20:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Judiciary Committee Markup. \n\nWatch LIVE: https://t.co/diYBW1cVxu","date":"Tue Sep 15 14:21:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Be sure to listen in to #AmericaFirst with @SebGorka today! Will be on the program in the 2pm CENTRAL hour. \n\nWatch it LIVE here: https://t.co/WBrDJPkvcX","date":"Mon Sep 14 18:40:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This change is one of the largest administrative adjustments made in recent history, and will do even more to protect us all!","date":"Mon Sep 14 17:33:19 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Proud to participate in this #AmericaStrong #911 tribute. #NeverForget  #Remembrance @usa_challenge \n\nhttps://t.co/oQAmE11fBn","date":"Fri Sep 11 20:37:28 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today we remember thousands of our countrymen and women who perished in the horrific terrorist attack on our country 19 years ago. #NeverForget \n\nFULL STATEMENT: https://t.co/vTavnPUf12 https://t.co/Df2CAnFDOa","date":"Fri Sep 11 17:23:19 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If Woodward did a book on FDR &amp; he were Republican, he'd say that when FDR proclaimed, “the only thing we have to fear is fear itself” he was lying &amp; playing down the dangers of the Depression &amp; Hitler’s growing power in Germany, &amp; Biden would read it from the teleprompter.","date":"Thu Sep 10 14:34:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @MarkDavis this morning at 8:05AM CENTRAL on @660KSKY! Will discuss many important issues affecting this country such as #COVID, continued rioting, etc. https://t.co/9OZlaj5voh","date":"Thu Sep 10 12:30:23 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to #AmericaFirst with @SebGorka TODAY at 2PM CENTRAL. We'll discuss the rioting across America, #COVID relief bill and much more! \n\nListen in here: https://t.co/4q7n5qmHnC","date":"Wed Sep 09 18:15:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“I sure would hope that we could have a legislative hearing instead of just ramming this through – thinking that we know all, see all, and can do what is best from Mt. Olympus in the District of Columbia.” #HouseJudiciary #Markup https://t.co/NgKJIacxoX","date":"Wed Sep 09 17:35:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 11AM CENTRAL ==&gt; House Judiciary is holding a committee markup. \n\nWatch the live-stream, here: https://t.co/WyzfwEAdBI","date":"Wed Sep 09 15:25:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today we celebrate the social &amp; economic achievements of American workers. Thank you to the men &amp; women who work hard for this country &amp; their families. #LaborDay #CelebrateAmericans #GodBlessAmerica https://t.co/ewRxOktFNG","date":"Mon Sep 07 12:30:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"As a veteran, I’ve had long, private conversations w/ @realdonaldtrump. He’s expressed nothing but love &amp; care for our military. In fact, he used the word “incredible” a lot when talking about our troops. I’ve heard his heart, &amp; he has nothing but respect for America’s military.","date":"Sat Sep 05 16:35:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tomorrow at 8AM CENTRAL will talk to @CarlHigbie on @newsmax TV's \"Saturday Report.\" We'll discuss looting &amp; rioting in #Kenosha, Trump's call to withhold federal funding from #NYC &amp; much more. Watch LIVE here: https://t.co/iEhefTLkJI","date":"Fri Sep 04 23:30:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Great question, @realJeffreyLord #CancelDemocrats https://t.co/vDTyDFLqjy","date":"Fri Sep 04 17:56:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"US employers hire 1.4M in August as unemployment rate falls sharply https://t.co/OAB2KWwiXQ","date":"Fri Sep 04 13:41:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was an absolute honor to present Mr. Alvin Newton (WWII hero &amp; recipient of the French Legion of Honor medal) with a flag flown over the United States Capitol. \n\nThank you for your service and devotion to this country! #TX01 #GodBlessOurVeterans https://t.co/VDuS8hEXUb","date":"Wed Sep 02 19:10:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to the \"Mike Gallagher Show\" this morning at 9:30AM CENTRAL and discussing news of the day with @SamMaloneShow! \n\nBe sure to listen in: https://t.co/6Jp1WLCKN8","date":"Wed Sep 02 13:22:38 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Keep it up @TheJusticeDept. We've got a long way to go with these so-called \"peaceful protesters\"","date":"Sun Aug 30 16:41:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @SamMaloneShow today at 8:45AM CT to discuss President Trump's policies and many other breaking news topics. Listen in to @AM1070TheAnswer!  #GodBlessAmerica","date":"Fri Aug 28 13:17:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview today with @DLoesch re: my #Coronavirus recovery and experience donating plasma https://t.co/jrm7WEmwlP","date":"Thu Aug 27 19:51:00 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @DLoesch today at 12:30PM CENTRAL. We'll discuss many issues affecting the country. #COVID #Riots #Congress #Hurricane\n\nWatch \"The Dana Show\" LIVE, here: https://t.co/38ZPU1aTiD","date":"Thu Aug 27 16:10:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"AUDIO: ‘Rep. Louie Gohmert can't believe that Amazon continues to plead ignorant about the disgraced SPLC’  https://t.co/YchqHldd9S","date":"Thu Aug 27 15:44:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"10 U.S. Code § 253 (in part) The President by using the armed forces shall take such measures as he considers necessary to suppress any insurrection or domestic violence ... (2/3)","date":"Wed Aug 26 22:43:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Maybe it is time to take our country back from the Marxist revolutionaries who are leading the violence? (1/3)\nhttps://t.co/F3jBOc0m37","date":"Wed Aug 26 22:43:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"... if it so hinders the execution of the laws of that State &amp; the United States that any part of its people is deprived of a right named in the Constitution, &amp; the authorities of that State fail or refuse to protect that right. (3/3)","date":"Wed Aug 26 22:43:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @tperkins about a letter House GOP lawmakers on the Judiciary Committee sent to Jeff Bezos concerning the Southern Poverty Law Center’s relationship with Amazon. \n\nListen in to #WashingtonWatch today at 4:30PM CENTRAL, here: https://t.co/zRscLTkMei","date":"Wed Aug 26 19:10:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"‘Louie Gohmert - The Dems are blaming Republicans and Trump for things the Obama administration did’ \n\nAUDIO:  https://t.co/bFtPlbYZhA @LarsLarsonShow","date":"Wed Aug 26 18:44:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gulf War Veteran Shares Harrowing Story to Shed Light on God’s Redemption https://t.co/SUlVVcRAyj","date":"Tue Aug 25 23:19:55 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to The @LarsLarsonShow TODAY at 4:30PM CENTRAL. We'll discuss #USPS, #COVID and more. \n\nListen LIVE: https://t.co/IDawc1x1HP","date":"Tue Aug 25 20:35:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Hurricane Laura forms as Category 1 storm — What this means for East Texas https://t.co/mEizZZNp0O","date":"Tue Aug 25 18:45:48 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @toddstarnes Show today at 1:30PM CENTRAL. We'll discuss my #COVID recovery, #USPS and more. Listen in to the program here: https://t.co/ZfjE8Ti9GT","date":"Mon Aug 24 16:55:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Mail-in ballots are more susceptible to being stolen or forged and are also more likely to be rejected than in-person votes. In fact, Fox News reported that during the 2008 election of Barack Obama, about one-fourth of military mail-in ballots were lost. 7/9","date":"Fri Aug 21 21:36:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats are using the coronavirus crisis as a means to demand universal mail-in ballots—which are different than absentee ballots—and would be disastrous for the integrity of the 2020 election 8/9","date":"Fri Aug 21 21:36:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Unfortunately, no matter how well the USPS performs, when liberal voting states or counties send out thousands of ballots to addresses that are no longer valid or send them to dead people and those who are ineligible to vote, the prospects of voter fraud looms large 6/9","date":"Fri Aug 21 21:36:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It certainly appears that the USPS, under new Postmaster General DeJoy’s leadership, is doing everything it can to work with states to ensure vote-by-mail will be successful. 5/9","date":"Fri Aug 21 21:36:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Those claiming USPS can't handle the volume of election mail do not realize that, on average, it handled 471 million pieces of mail every day last year and the 2020 election mail would represent a minor increase in volume which they are fully capable of managing. 4/9","date":"Fri Aug 21 21:36:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Since the Russia-collusion hoax failed spectacularly, Democrats have unleashed their latest conspiracy about @realDonaldTrump and the U.S. Postal Service in a brazen attempt to spread chaos and fear across the country ahead of November 3rd 1/9","date":"Fri Aug 21 21:36:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It is important to note that over 12,000 USPS mailboxes ‘disappeared’ during the Obama Admin without any faux outrage emanating from Democrats. The Obama Administration’s USPS actually did that in part because of the steep decline in mail thanks to the rise of the internet 2/9","date":"Fri Aug 21 21:36:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On June 16 of THIS year, Postmaster General Louis DeJoy took over for the Postmaster General who was appointed during the Obama Administration. 3/9","date":"Fri Aug 21 21:36:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @newsmax TV at 4:30PM CENTRAL today. Will talk to Chris Salcedo regarding my resolution to rename the Democratic Party. Will also weigh in on other pressing issues affecting the nation. Watch the show online, here: https://t.co/iEhefTLkJI","date":"Wed Aug 12 19:48:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In part 3 of the \"U.S. Capitol Tour with Louie,\" I show you around the famous Statuary Hall and explain how John Quincy Adams took Abraham Lincoln under his wing and influenced the future president’s views on slavery. https://t.co/kQEUJCD8J0","date":"Wed Aug 12 18:00:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @OANN tonight at 7PM CENTRAL! Will discuss many topics such as #COVID19 and more!","date":"Mon Aug 10 20:48:21 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"LIVE: Rep. Louie Gohmert talks about his experience with COVID-19 https://t.co/dX6n5TD5XM","date":"Fri Aug 07 01:02:19 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Spoke with @seanhannity and discussed my China Virus diagnosis and my #hydroxychloroquine + azithromycin + zinc treatment.  https://t.co/Szlf8LbQPe","date":"Wed Aug 05 22:50:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @seanhannity on his radio show today at 4:30PM CST! Be sure to listen in here: https://t.co/PBXGHZiB08","date":"Wed Aug 05 19:53:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I am taking #Hydroxychloroquine to treat my coronavirus diagnosis. It is what was decided as the best course of action between my doctor and me--not by government bureaucrats. How long until the tech tyrants censor this tweet?","date":"Fri Jul 31 20:36:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Why did it take so long to get Reagan's statue to Capitol Hill?  Enjoy part two of the \"United States Capitol Tour with Louie.\" https://t.co/wfyfBBi9BF","date":"Fri Jul 31 20:05:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews tonight at 8:40PM CST! Will appear on “Hannity” and talk about the developments of the day! #COVID","date":"Thu Jul 30 00:59:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I had my mask on when I was not questioning people (I was told they work). Notice I was socially distant as well. https://t.co/gzyHuUBA19","date":"Thu Jul 30 00:24:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @seanhannity today on his radio program re: my diagnosis. Listen in to the show at 3:30PM CST \nhttps://t.co/PBXGHZiB08","date":"Wed Jul 29 19:41:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Lots of #FakeNews going around about this https://t.co/OQhHYZJZvh","date":"Wed Jul 29 19:17:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My statement about today's diagnosis: https://t.co/qvf7zIcgdN","date":"Wed Jul 29 17:11:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The reports of my visiting the member gym are more #fakenews. I have not been to the member gym in weeks.","date":"Wed Jul 29 16:51:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH NOW: My interview with KETK: https://t.co/hVeLH39Zfq","date":"Wed Jul 29 16:50:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned Attorney General Barr today in a House Judiciary Oversight Hearing. \n\nVIDEO: https://t.co/HXPQayvSmg","date":"Tue Jul 28 17:38:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Attorney General Barr testifies at House Judiciary Committee hearing: live updates https://t.co/EqGvp9F1Rf","date":"Tue Jul 28 14:43:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @ffweekend TOMORROW morning at 8:30AM CST. Will talk about my privileged resolution -  calling upon Congress to ban any political organization or party that has ever held a public position supportive of slavery or the Confederate States of America.","date":"Sun Jul 26 01:39:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to Andrew Wilkow on @WilkowMajority today at 12:20pm CENTRAL. We'll discuss my resolution yesterday and more. Listen in on @SiriusXMPatriot. #CancelDemocrats","date":"Fri Jul 24 15:55:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#CancelDemocrats","date":"Fri Jul 24 14:04:42 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @newsmax TV this morning at 9:05AM CENTRAL. Will appear on \"National Report\" and discuss the budget fight on Capitol Hill and my resolution yesterday to #CancelDemocrats. https://t.co/3k4royb2lx","date":"Fri Jul 24 13:18:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"From @realJeffreyLord: Texas Republican Rep. Louie Gohmert has taken Pelosi and her fellow Democrats at their word — and taken direct aim at the biggest Confederate relic of all: the Democratic Party #CancelDemocrats \n\nhttps://t.co/rn1sd88hhm","date":"Fri Jul 24 12:42:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to “Mornings on the Mall” at 6:35AM CENTRAL. I’ll discuss my resolution that would ban the Democratic Party due to their history of having supported slavery. @wmalnews","date":"Fri Jul 24 11:21:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The time has come for Democrats to acknowledge their party’s loathsome and bigoted past, and consider changing their party name to something that isn’t so blatantly and offensively tied to slavery, Jim Crow, discrimination, and the KKK. #CancelDemocrats","date":"Thu Jul 23 21:50:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On June 18, Speaker Pelosi ordered the removal of portraits of four previous Democrat Speakers of the House who served in the Confederacy because they “set back our nation’s work to confront and combat bigotry.” #CancelDemocrats","date":"Thu Jul 23 21:45:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrats enacted and enforced Jim Crow laws and civil codes that forced segregation and restricted the freedoms of black Americans #CancelDemocrats https://t.co/HucUErZAxt","date":"Thu Jul 23 21:40:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In Democrat Sen. Robert Byrd’s shameful 14-hour filibuster against the Civil Rights Act, he said “Men are not created equal today...men and races of men differ in appearance, ways, physical power, mental capacity, creativity and vision.” #CancelDemocrats","date":"Thu Jul 23 21:35:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrat Sen. Robert Byrd led Senate Democrats in their opposition to the 1964 #CivilRightsAct. He was a known recruiter for the KKK. #CancelDemocrats","date":"Thu Jul 23 21:30:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In 1964 The Democrats led a 75-calendar-day filibuster against the #CivilRightsAct #CancelDemocrats","date":"Thu Jul 23 21:25:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The 1924 #DemConvention is commonly known as the “Klan-Bake” due to the overwhelming influence of the KKK in the party. #CancelDemocrats \nhttps://t.co/bvCghfihLE","date":"Thu Jul 23 21:20:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Democrat President Woodrow Wilson’s administration in 1912 began a racial segregation policy for govt employees. By 1914, the Wilson Administration required a photo be submitted with each employment application #CancelDemocrats https://t.co/fhKF18ary6","date":"Thu Jul 23 21:15:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Carter Glass, who was a Democrat Rep., Senator and then Treasury Secretary under Dem President WoodrowWilson, proclaimed the goal of Virginia’s 1902 Constitutional convention was to eliminate “every n**** voter who can be gotten rid of legally.” #CancelDemocrats","date":"Thu Jul 23 21:10:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #14thAmendment which gave full citizenship to freed slaves passed in 1868 with 94% Republican support and 0% support from Democrats. #CancelDemocrats https://t.co/knI01cB1gv","date":"Thu Jul 23 21:05:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrat Party platform of 1860 sought to uphold the Fugitive Slave Law and stated that efforts to defeat the law were “hostile in character” &amp; “subversive of the Constitution.” #CancelDemocrats","date":"Thu Jul 23 21:00:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrat Party platform of 1856 recognizes “the right of the people of all the Territories...to form a Constitution, with or without domestic slavery.” #CancelDemocrats https://t.co/knI01cB1gv","date":"Thu Jul 23 20:55:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Dem Party platform of 1856 also declared that “new states” to the Union should be admitted “with or without domestic slavery, as [the state] may elect.” #CancelDemocrats https://t.co/fhKF18ary6","date":"Thu Jul 23 20:50:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Democrat Party platform of 1840,1844,1848,1852 &amp; 1856 states that efforts of #abolitionists to “interfere” with slavery would “diminish the happiness of the people and endanger the stability and permanency of the Union…” #CancelDemocrats\nhttps://t.co/fhKF18ary6","date":"Thu Jul 23 20:45:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Due to the racist past of the Dems, I suggested they change their name. They demand name changes nationwide. It’s their standard. If they don’t want to own the racist history of the Dem Party why don’t they change their name? #CancelDemocrats https://t.co/BNG6LoyX7l","date":"Thu Jul 23 20:40:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Whether it be supporting the most vile forms of racism or working against #CivilRights legislation, Democrats in this country perpetuated these abhorrent forms of discrimination and violence practically since their party’s inception. #CancelDemocrats https://t.co/4hND3ArNT2","date":"Thu Jul 23 20:25:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to @WBAP247NEWS today at 3:30PM CENTRAL. We'll discuss my privileged resolution urging the House to ban the Democratic Party for supporting slavery. Tune in: https://t.co/pPrr07OsD1","date":"Thu Jul 23 20:17:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Louie Gohmert Urges House to Ban Democratic Party for Supporting Slavery https://t.co/Pwjw7AaK4Q via @BreitbartNews","date":"Thu Jul 23 16:19:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY ==&gt; House Judiciary holds a full committee markup at 9AM CENTRAL re:  H.R. 2678 and H.R. 7694. Watch LIVE online, here: https://t.co/Eu67iepRoR","date":"Thu Jul 23 12:45:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's truly a blessing &amp; an honor to serve this nation as a Representative in the U.S. Congress. I wanted to find a way to share with y'all the rich history of our U.S. Capitol building. \n\nI hope you enjoy Part 1 of the \"U.S. Capitol Tour w/ Louie.\" \n\nhttps://t.co/Rcyv1ggQnS","date":"Wed Jul 22 23:25:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @DLoesch today on her show at 1:30PM CENTRAL. We’ll discuss the #2A and the #StLouis incident. Tune in, here: https://t.co/60UpjWMrSJ","date":"Tue Jul 21 18:06:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH ==&gt; House Natural Resources Subcommittee on National Parks, Forests, and Public Lands hearing beginning at 9AM CENTRAL: https://t.co/F1Hb17oi2G","date":"Tue Jul 21 14:05:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @SebGorka's radio program this afternoon at 4pm CENTRAL. We will discuss what is on the docket in #Congress next week, #Antifa and our #SecondAmendment rights. #AmericaFirst\n\nTune in: https://t.co/Kf6gyUCWOK","date":"Fri Jul 17 20:30:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @toddstarnes TODAY at 1pm CENTRAL re: my letter sent to AG Barr to investigate McCloskey incident. #SecondAmendment #StLouis\n\nListen in LIVE: https://t.co/ZfjE8Ti9GT","date":"Fri Jul 17 16:20:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The #DemocratParty has abandoned its base and surrendered to the radical #Marxist Left. Welcome to the #TrumpTrain @TheLeoTerrell. @realDonaldTrump fights for the forgotten men and women of America. @seanhannity @larryelder","date":"Fri Jul 17 14:47:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Streamlining and modernizing of #NEPA is a great step for everyone but #leftist lawyers and political organizations and ultimately it will continue to improve our water and air. #AmericanJobs #MakeAmericaEvenGreater 3/3\n\nhttps://t.co/GfmRMNL2Li","date":"Thu Jul 16 16:14:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For too long, #NEPA has been a bureaucratic nightmare that prevented proper management of our natural and renewable resources. It delayed, prevented and ran up costs of desperately needed infrastructure projects. 2/3\n\nhttps://t.co/GfmRMNL2Li","date":"Thu Jul 16 16:14:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@Potus’s decision to modernize #NEPA is an important step to reduce govt overreach and prioritize American jobs, reduce the cost of living for our poor and middle class and make America even greater! 1/3 https://t.co/GfmRMNL2Li","date":"Thu Jul 16 16:14:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Signers con’t: @RepAndyHarrisMD @RepTedBudd @SteveKingIA @Rep_Watkins @CongressmanHice @RepScottPerry 5/5","date":"Tue Jul 14 22:40:55 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Read the full letter to @TheJusticeDept signed by me and my colleagues, asking for an investigation to protect #2A rights for all Americans in light of St. Louis homeowner’s case @RepMoBrooks @RepGregSteube @RepBrianBabin @RepGosar @RepAlexMooney 4/5 https://t.co/QztGifPXgh","date":"Tue Jul 14 22:40:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At this crucial time in history, we need @TheJusticeDept to exert strong leadership to ensure our constitutional protections are not eroded by mob rule. #2A 3/5","date":"Tue Jul 14 22:40:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Eleven of my colleagues joined me in sending a letter to @TheJusticeDept asking AG Barr to investigate to protect #2A in St. Louis homeowner’s case. What part of “shall not be infringed” does the circuit attorney not understand? 1/5\nhttps://t.co/MVm2vOqKWA","date":"Tue Jul 14 22:40:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We ask that @TheJusticeDept initiate proceedings to ensure that #2A, which enshrines the fundamental right of citizens to protect themselves from violence and tyranny, is zealously defended during this time of unrest…2/5","date":"Tue Jul 14 22:40:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We owe it to the American people do everything we can to safely send our kids back to school where they can thrive alongside their friends and receive the benefits of in-person learning ... https://t.co/EKuDcOrqjX","date":"Thu Jul 09 16:32:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"A great question from Rush Limbaugh’s @BoSnerdley ...\n\nWatch the full episode here: https://t.co/ebFKC5VNaU https://t.co/wvlyECPfcJ","date":"Wed Jul 08 20:47:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Hopefully this is a start to undo some of the Obama-Biden assault on religious liberty.","date":"Wed Jul 08 20:20:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @OANN at 7pm CENTRAL! Will talk to @GrahamLedger re: #coronavirus #Texas and the latest on #CapitolHill.","date":"Tue Jul 07 19:29:56 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What taxpayers need to know about the July 15 filing deadline: https://t.co/of72CiJ39v","date":"Tue Jul 07 13:56:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Independence Day! \n#ProudAmerican #July4th https://t.co/uaLGbRX82b","date":"Sat Jul 04 12:10:22 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @newsmax TV tonight at 6PM CT. Will appear on \"Greg Kelly Reports\" and weigh in on this week in #Congress. Watch online, here: https://t.co/iEhefTLkJI","date":"Thu Jul 02 21:05:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This week, I was interviewed for the upcoming film, “America! America! God Shed His Grace on Thee!\" After taping, we stopped and prayed for our nation!  #GodBlessAmerica https://t.co/KTWi5S74ae","date":"Thu Jul 02 19:05:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"As we try and move closer and closer to end any injustice in America ... it is critical to understand the evil that is so close to taking over and embracing this country.\" https://t.co/IZzJNbZzlu","date":"Thu Jul 02 16:18:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Record jobs gain of 4.8 million in June smashes expectations \n\nhttps://t.co/z0Wcepg9ux","date":"Thu Jul 02 13:23:25 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @SamMaloneShow this morning at 7:30AM CT. We’ll discuss #COVID, police, rioting and more. Listen in to @AM1070TheAnswer here: https://t.co/mcwlYoxFSR","date":"Wed Jul 01 11:37:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rush Limbaugh’s @BoSnerdley talks riots, police and the ‘hood on Episode 5 of my podcast: https://t.co/K2JrEBsEkE","date":"Tue Jun 30 19:52:25 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @PointofViewRTS today at 2:15pm CT. Will discuss with Kerby Anderson the many top news stories throughout the nation. Listen in to the show: https://t.co/7cr6OEdGLa","date":"Tue Jun 30 16:50:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned witnesses today in a House Natural Resources Oversight Hearing re: the many ongoing protests throughout the country: https://t.co/bGpk4I4naG","date":"Mon Jun 29 18:07:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 11AM CENTRAL: The Committee on Natural Resources will hold an oversight hearing. \n\nWatch LIVE, here: https://t.co/cSNCDKXLhk","date":"Mon Jun 29 15:30:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my interview on @newsmax TV over the weekend re: #COVID, #immigration and more: https://t.co/gLrH3Iq2YQ","date":"Mon Jun 29 14:38:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @newsmax TV this morning at 9:05AM CT! Joining “Saturday Report” to discuss the news this week! #COVID #monuments #SCOTUS and more! \nhttps://t.co/iEhefTLkJI","date":"Sat Jun 27 13:13:42 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed a solution to fight the Marxist crime wave &amp; restore law &amp; order to the country in episode 4 of “Special Order with Louie Gohmert.” \n\nWatch Ep. 4 (We Must Fight the Marxist Crime Wave) of my podcast, here: https://t.co/ywPEAuNw4n","date":"Fri Jun 26 20:45:39 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Pointed out the dangers in #DCStatehood on the House Floor. \n\nWatch the video, here: https://t.co/W3BINoxkIe","date":"Fri Jun 26 14:55:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"H.R. 7120 is not going to do anything. This immunity removal is going to help law enforcement unions ... it’s going to keep law officers tied up in civil courts &amp; criminal courts &amp; it's going to keep criminals on the street. \n\nWatch my floor speech here: https://t.co/fL2LhGQpIX","date":"Thu Jun 25 20:38:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @OANN TODAY at 2pm CT. Will discuss the House Judiciary Hearing yesterday, police reform &amp; implementing RICO to fight the leftist crime wave.","date":"Thu Jun 25 18:40:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joined with the @freedomcaucus \ntoday — calling on Attorney General Barr to take full &amp; immediate advantage of all actions avail to him—including investigations, arrests, &amp; prosecution—to thwart those vandalizing &amp; defacing churches, national monuments, public property, etc. https://t.co/VdfZTeMdce","date":"Thu Jun 25 18:03:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The time has come for the DOJ to prosecute the leaders of this national crime wave under the Racketeer Influenced &amp; Corrupt Organizations (RICO) Act for their coordinated efforts to cause destruction &amp; chaos through all violent means at their disposal ... https://t.co/gseMoofVcR","date":"Thu Jun 25 16:37:44 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Check out my oped in @BreitbartNews today ==&gt; Rep. Louie Gohmert: RICO Should Be Used to Fight Leftist Crime Wave https://t.co/iyI2fGQ8UN","date":"Thu Jun 25 15:37:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @wmalnews “Mornings on the Mall” at 7:35AM CENTRAL! We’ll discuss the House Judiciary hearing yesterday!","date":"Thu Jun 25 11:34:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"It’s a shame we don’t have a serious hearing. It’s just a sideshow and it ought to be called for what it is; and, if we’re concerned about justice, we need to get after the people that created the injustice through the last administration.\" \n\nVIDEO: https://t.co/B8j9oRHsd3","date":"Wed Jun 24 19:06:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to the @toddstarnes show at 1:30PM CENTRAL. We will discuss many serious issues affecting this country. Find a station in your area, here: https://t.co/j1W66Ylz2v","date":"Wed Jun 24 18:21:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Appeals Court Orders Judge to Dismiss Charges Against Michael Flynn! https://t.co/gvBENvRW8z","date":"Wed Jun 24 14:37:36 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At 11AM CT ==&gt; The House Judiciary Committee will hold a hearing re: \"Oversight of the Department of Justice.\" You can live-stream the hearing, here: https://t.co/rwMHVPWeOL","date":"Wed Jun 24 14:25:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\".@realDonaldTrump does really want to see America strong and stronger because he knows we can’t help other countries unless we’re strong.” - @replouiegohmert on @FoxBusiness @LouDobbs https://t.co/A0cfiZrgxd","date":"Wed Jun 24 13:05:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my interview last night with @LouDobbs on @FoxBusiness re: @realDonaldTrump's executive order which will ensure American workers take first priority as the U.S. recovers from the economic effects of the #coronavirus. \n\nWATCH: https://t.co/VzzJ3kOWbX","date":"Wed Jun 24 12:21:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#TX01 #Jobs","date":"Wed Jun 24 11:08:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxBusiness this afternoon at 4:40PM CT. Will talk to @LouDobbs re: many important issues in the news this week! #COVID #Economy #Riots #BorderWall","date":"Tue Jun 23 20:25:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you @realdonaldtrump for putting American workers first as we restore our economy to greatness!  https://t.co/zD8OaFARVl","date":"Tue Jun 23 13:42:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#HappyFathersDay!  \n\n\"A good father is one of the most unsung, unpraised, unnoticed, and yet one of the most valuable assets in our society.\" - Billy Graham","date":"Sun Jun 21 12:22:21 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Episode 3 of \"Special Order w/ Louie Gohmert\" discusses my amendment to the Democrats police bill in House Judiciary. It would have made lynching punishable up to life in prison; however, the Dems refused to pass it.\n\nWatch episode 3 of my podcast, here: https://t.co/0ISFWt5JrQ","date":"Thu Jun 18 19:51:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my comments in the House Judiciary Markup of H.R. 7120, the \"Justice in Policing Act of 2020\" https://t.co/gizKqW51nl","date":"Wed Jun 17 16:54:19 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY ==&gt; House Judiciary holds a markup of H.R. 7120, the \"Justice in Policing Act of 2020.\" You can watch the live-stream online, here starting at 9AM CENTRAL: https://t.co/gwuP6YVt1A","date":"Wed Jun 17 13:14:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump has presented historic, meaningful solutions which will restore the public’s trust in our police departments, provide the proper training necessary &amp; ensure that those who need to be held accountable are brought to justice: https://t.co/P9MTfRV101","date":"Tue Jun 16 17:47:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch live: Trump signs police reform executive order https://t.co/5mFLhEKb1B","date":"Tue Jun 16 16:27:47 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"U.S. Retail Sales Rose Record 18% in May https://t.co/pxn0mKr2JJ","date":"Tue Jun 16 14:19:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The First Lady is asking students across the USA for submissions depicting individuals, objects &amp; events representing the women’s suffrage movement. More details, here: https://t.co/JlMa9rpp4c","date":"Mon Jun 15 21:05:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Louie Gohmert: The Men Behind The Boston Tea Party Would Never Put Up With The Garbage From Andrew Cuomo Locking Down New York: https://t.co/MDDdplcg1h","date":"Mon Jun 15 16:38:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's the audio from my @foxnewsradio interview with @kilmeade this morning: https://t.co/GlwVwGhOZj","date":"Mon Jun 15 15:01:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tyler VFW post hosts flag retirement ceremony in honor of Flag Day https://t.co/UKvf4nIaLE","date":"Mon Jun 15 13:49:39 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in this morning to @foxnewsradio at 8:34AM CENTRAL. Talking to @kilmeade re: #PoliceBill, #Congress, #Flynn and more. Listen in: https://t.co/by3a1ab0fS","date":"Mon Jun 15 13:20:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Birthday @realDonaldTrump! 🇺🇸🇺🇸🇺🇸","date":"Sun Jun 14 13:04:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today is #FlagDay —  commemorating the adoption of the Stars and Stripes as the official flag of the United States. 🇺🇸 https://t.co/y7SPR0WH2D","date":"Sun Jun 14 12:57:23 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Episode 2 of \"Special Order w/ Louie Gohmert\" breaks down details of the Democrat’s police bill &amp; how they're using this latest crisis as a way to funnel money to outside liberal groups.\n\nWatch my podcast \"Special Order w/ Louie Gohmert\" - Ep. 2, here: \n\nhttps://t.co/kb3hwRIX1Q","date":"Fri Jun 12 19:00:22 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to attend @realDonaldTrump’s Roundtable on “Transition to Greatness: Restoring, Rebuilding &amp; Renewing” yesterday in Dallas, Texas. The comments from all the speakers contained a vast amount of wisdom! https://t.co/wEAcAh4mcT","date":"Fri Jun 12 13:23:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my full remarks today in the House Judiciary Committee \"Oversight Hearing on Policing Practices and Law Enforcement Accountability\" https://t.co/MTntsQK71X","date":"Wed Jun 10 18:21:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY in the House Judiciary Committee ==&gt; Oversight Hearing on Policing Practices and Law Enforcement Accountability. You can watch the hearing LIVE at 9AM CENTRAL, here: https://t.co/c0Ilcjilvm","date":"Wed Jun 10 12:54:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @radiotalkermike’s radio show at 8:30AM CENTRAL this morning! Talking to @SamMaloneShow re: reopening the country, the defund the police movement, rioting and more.","date":"Tue Jun 09 12:35:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @jeff_poor on his radio show this afternoon at 2:30PM CENTRAL. We will discuss various topics in the news and more!  #COVID19 #SocialMedia #JobsReport Listen in LIVE online: https://t.co/OsCrIr3mOJ","date":"Fri Jun 05 18:35:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @newsmax TV today at 1pm CENTRAL. Will discuss the breaking news this week re: #protesting, #COVID19, #JobsReport, upcoming Congressional hearings and more!","date":"Fri Jun 05 16:30:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Encouraging news today ==&gt; The U.S. economy added 2.5 million jobs in May &amp; the unemployment rate fell from 14.7 percent to 13.3 percent. @realDonaldTrump has done an amazing job against all odds!! #JobsReport #TheGreatAmericanComeback","date":"Fri Jun 05 14:55:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned @TomFitton - President of @JudicialWatch re: voting security today in a House Judiciary Subcommittee on the Constitution, Civil Rights &amp; Civil Liberties hearing. Watch the whole exchange, here:  https://t.co/V672fUEujJ","date":"Wed Jun 03 16:56:01 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Launched a new podcast! \n\nIt's necessary to continue to deliver info on important issues that matter to everyday hardworking Americans—many of whom—unlike Congress—are continuing to do their jobs effectively despite the pandemic. \n\n1st Episode: https://t.co/dsQJBIHO9b","date":"Wed Jun 03 13:31:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today I'm launching a new podcast series, \"Special Order w/ Louie Gohmert.” Since members are unable to speak from the House floor this month, this podcast will keep Americans up-to-date w/ important issues: https://t.co/5IgWtBPqle\n\nEpisode 1: https://t.co/JKIHBaKqZW","date":"Wed Jun 03 00:43:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The criminal case against @GenFlynn should immediately be dismissed. It is outrageous that federal Judge Emmet Sullivan is working against the Justice Department’s request to drop its case against General Michael Flynn: https://t.co/3yikfmYHd3","date":"Tue Jun 02 18:21:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @KETK last night re: the many protests taking place around the nation. Watch the interview, here: https://t.co/tl2Kv7GUgu","date":"Tue Jun 02 16:28:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @newsmax TV this morning at 9AM CENTRAL. Will appear on \"Saturday Report\" and weigh in on all the breaking news this week re: #FISA, #COVID19, #socialmedia and more!  https://t.co/b4rpXTE17d","date":"Sat May 30 12:15:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tonight will talk to @KETK about many breaking news stories this week. Be sure to watch the newscast tonight at 6PM CENTRAL.","date":"Fri May 29 22:30:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"If these companies would like to be protected under Section 230 of the Communications Decency Act, they must hold freedom of expression above their own political agendas: https://t.co/4LR8oSvjRF","date":"Fri May 29 18:29:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congressman Sam Johnson embodied courage, humility, patriotism and forthrightness, as well as absolute devotion to God, family and his beloved country: https://t.co/BQ8CWChHdb","date":"Fri May 29 00:59:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to #WashingtonWatch today at 4:05PM CENTRAL. Will talk to Tony Perkins re: social media censorship and more. Listen in here: https://t.co/zRscLTkMei","date":"Thu May 28 18:45:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Go re-read the Fourth Amendment. We're not supposed to authorize searches &amp; seizures against Americans without the proper due process, without probable cause, without particularly describing the places to be searched &amp; what to be seized &amp; the #FISA court has violated that. https://t.co/bh6pYqnkdg","date":"Thu May 28 18:05:25 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I’ve got a new account on @parler_app ➡️ @replouiegohmert! Sign up today! https://t.co/EbaWYs2pLX","date":"Thu May 28 15:17:23 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my comments in the House Rules Committee today re: the re-authorization of the Foreign Intelligence Surveillance Act (FISA). https://t.co/inWN3ioadD","date":"Wed May 27 18:30:01 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"We were called back into session and we're gonna supposedly reauthorize the #FISA court. I think it’s unconstitutional without massive reform; but, what a gift to @realDonaldTrump because he can then investigate ... \" https://t.co/PhCg2qj2A3","date":"Wed May 27 14:18:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @jillianmele &amp; @SchmittNYC on @FoxFriendsFirst this morning. Watch the full interview, here: https://t.co/v6T0Alwdhz","date":"Wed May 27 11:36:41 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxFriendsFirst tomorrow morning at 5:15AM ET! Will discuss breaking news events around the country.","date":"Wed May 27 00:20:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"To all who have lost loved ones in defense of freedom, you have our heartfelt gratitude &amp; sympathy. To all who are currently serving in our defense - thank you! May God direct, guide &amp; bless you, as an effective method of blessing America. #MemorialDay https://t.co/3QOIfhWtMK","date":"Mon May 25 12:23:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Fortunately we elected a President who knows that when it comes to religion, the government is not to “prohibit the free exercise thereof.” Dem Governors need better educations. @realDonaldTrump","date":"Fri May 22 20:18:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @newsmax TV today at 2pm CST. Talking to Bob Sellers on his show \"American Agenda.\" Watch, here: https://t.co/O3STTCrnFY","date":"Thu May 21 17:22:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This morning at 8:30AM CST will call in to The @MarkDavis Show. We'll discuss the breaking news this week re: #COVID19, #Congress and more. Listen in: https://t.co/9OZlaj5voh","date":"Wed May 20 12:52:39 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here’s the FULL VIDEO of my interview with @ffweekend re: the #BidenFour &amp; the unconstitutionality of the recent Democrat relief bill passed in the House &amp; its liberal agenda: https://t.co/XE6hRPGIsC","date":"Mon May 18 17:08:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“We’ve got to preserve the Constitution; not abuse it with a House Rule.” https://t.co/sb6Cp8Nb8n","date":"Fri May 15 18:03:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“With the wish list that Pelosi, and especially the far-left, that they have, the things they want to get passed, the price, it sounds like, is just gonna be too high. That we will hurt the country more than we could possibly help ...\" https://t.co/bv5zqCfl3h","date":"Thu May 14 15:28:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“They [Democrats] know there is a Republican majority in the Senate; and they know there is a Republican president. Just to ignore them and have all this massive wish list is just, it's very disappointing.” https://t.co/V1O9OYUn7V","date":"Thu May 14 15:22:28 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“If any justice remains in the federal system, Comey and Clapper will be the beginning of many indictments to come, and not just for perjury,” said Rep. Louie Gohmert (TX-01).\n...\nRepublicans plan to grill Comey, Clapper on possible perjury in Flynn case https://t.co/8HRVrjmgYo?","date":"Wed May 13 19:46:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"List of officials who sought to 'unmask' Flynn released: Biden, Comey, Obama chief of staff among them https://t.co/toDdts0mA3","date":"Wed May 13 19:43:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep Gohmert Asks Trump to Pardon the 'Biden Four,' Imprisoned for Baghdad Shoot Out https://t.co/1dO7tgTkzC","date":"Wed May 13 13:05:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump on Monday celebrated at the White House press conference that America was leading the world on #coronavirus testing: https://t.co/SCkTa7okg9","date":"Tue May 12 13:43:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @DLoesch on her radio program today regarding the Department of Justice dropping the criminal case against Gen. Michael Flynn. Watch the full interview, here: https://t.co/N7p32KRzXN","date":"Mon May 11 19:24:24 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @DLoesch today at 1:30PM CENTRAL re: #COVID19, Congress and more. You can watch the broadcast online, here: https://t.co/2oWZvp7vDu","date":"Mon May 11 16:56:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#HappyMothersDay! \n\nI remember my mother's prayers and they have always followed me. They have clung to me all my life. – Abraham Lincoln https://t.co/Q5q0E1MFec","date":"Sun May 10 12:43:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my comments at the @WhiteHouse meeting today with @realDonaldTrump and other GOP lawmakers: https://t.co/g6wvuNbr6B","date":"Fri May 08 18:31:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today is #MilitarySpouseAppreciationDay. Thank you to the men and women who support those who risk their lives to fight for us. Your fortitude is greatly appreciated. #GodBessAmerica https://t.co/qFybF4Ts4i","date":"Fri May 08 15:46:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Hundreds of millions of PPE items have been sent to #Texas to bolster their frontline #Coronavirus response! \n\nThank you @realDonaldTrump! https://t.co/JdmZdBzw01","date":"Fri May 08 11:14:55 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"A better name for this committee would be 'Committee of Oligarchs to Unelect the President’ or ‘COUP’ for short,” said Rep. Louie Gohmert, a Texas Republican. @realDonaldTrump","date":"Thu May 07 14:15:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.” - Phil 4:6-7 #NationalDayOfPrayer https://t.co/ppI91k6OpH","date":"Thu May 07 11:57:55 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For all who sense that there is a God, may we set aside time, not just today, but routinely, to prayerfully beseech our Heavenly Father for His blessing, His protection, and His direction. #NationalDayOfPrayer https://t.co/7ph50bRhPF","date":"Thu May 07 11:42:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @SamMaloneShow this morning at 8AM CENTRAL re: #Congress, #COVID19 and more breaking news. Listen in to @AM1070TheAnswer!","date":"Thu May 07 10:48:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @tperkins on Washington Watch radio now re: Dallas, #Texas salon owner sentenced to seven days in jail. #coronavirus @FRCdc","date":"Wed May 06 21:08:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“It has always been my promise to the First District of #Texas to fight for our founding Constitutional principles, &amp; it is quite gratifying that the @ACUConservative &amp; I are in basic agreement on those principles ... \" https://t.co/DTHmSRWFg7","date":"Wed May 06 17:55:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“Nobody has come close to us on testing, be proud of it!” – @realDonaldTrump  #COVID19 https://t.co/tBLiCnBx8g","date":"Wed May 06 15:42:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"'Our Nation Needs Prayer Now': Join the Virtual National Day of Prayer on Thursday https://t.co/IhdXwp88TX via @CBNNews","date":"Wed May 06 15:33:48 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The U.S. Navy Blue Angels will take to the #Texas skies on Wednesday to salute those workers on the front line battling the #coronavirus. https://t.co/B78itnRJmP","date":"Wed May 06 12:46:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"John Ratcliffe will be an intelligent, diligent, trustworthy, and just Director of National Intelligence. A great step! @realDonaldTrump @RepRatcliffe","date":"Tue May 05 21:21:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to @LarryOConnor today at 4pm CENTRAL! We’ll discuss #Congress getting back to work. Listen in to @wmalnews!","date":"Tue May 05 20:39:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert: Let’s get America going again before it’s too late https://t.co/txgiUgGGYW via @OANN","date":"Tue May 05 18:37:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gov. Abbott provides update on COVID-19 in #Texas at 2:30 p.m. CDT https://t.co/PTBs3fNHSS","date":"Tue May 05 17:34:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today is #NationalTeacherDay. Tag a teacher in your life and let them know how much you appreciate them. #ThankATeacher! https://t.co/PykcWBesEA","date":"Tue May 05 14:07:02 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to the @LarsLarsonShow show today at 4:30pm CENTRAL! We’ll discuss states reopening and more! #Congress #CoronaVirus #TXWorks #TexasBizStrong","date":"Mon May 04 19:27:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Natural disasters – including such pandemics as the #coronavirus outbreak – can be overwhelming &amp; also can seriously affect emotional health. @realDonaldTrump’s #WhiteHouse has set up a Disaster Distress Helpline: https://t.co/n66eehtQ7n #TexasBizStrong #TXWorks #OpenUpAmerica","date":"Fri May 01 22:25:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Find out how you can protect yourself &amp; get helpful resources on @TheJusticeDept #Coronavirus Fraud Prevention website: https://t.co/Mp2QVEdbQe #TexasBizStrong #TXWorks #OpenUpAmerica","date":"Fri May 01 22:15:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rumors can easily circulate within communities during a crisis. @fema setup a website to help the public distinguish between rumors &amp; facts regarding the response to the #coronavirus pandemic: https://t.co/2bis9o0jBS #TexasBizStrong #TXWorks #OpenUpAmerica","date":"Fri May 01 22:00:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#COVID19 response &amp; recovery efforts are locally executed, state managed &amp; federally supported. It’s important requests for assistance get routed through proper channels ASAP! @realDonaldTrump’s White House has detailed information re: this process, here: https://t.co/qgG86QRxrZ","date":"Fri May 01 21:45:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump has stressed the importance of protecting the vulnerable. The most up-to-date, verified information &amp; guidance can be found via @CDCgov re: #Coronavirus Disease 2019 website: https://t.co/TQlxIxR48Q  #TexasBizStrong #TXWorks #OpenUpAmerica","date":"Fri May 01 21:35:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump unveiled guidelines for #OpeningUpAmericaAgain. These steps will help state &amp; local officials when reopening their economies, getting people back to work &amp; continuing to protect American lives. https://t.co/VaPX1Yt3Gr  #TexasBizStrong #TXWorks #OpenUpAmerica","date":"Fri May 01 21:13:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert: New Steele Revelations ‘Serious Stuff’ https://t.co/6kBct2ErHl @OANN","date":"Fri May 01 18:45:57 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#NationalMilitaryAppreciationMonth is celebrated every May and is a declaration that encourages U.S. citizens to observe the month in a symbol of unity. #GodBlessOurMilitary https://t.co/dRXxFk8RKy","date":"Fri May 01 15:21:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here’s what is reopening in #Texas as Phase 1 begins Friday: https://t.co/kIYjxd9Khr","date":"Fri May 01 13:51:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @OANN yesterday re: the new Steele dossier revelations. Watch the full interview, here: https://t.co/y0EdjGSum3","date":"Thu Apr 30 17:36:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Great to see University of Texas Health Science Center at Tyler (#TX01) featured ==&gt; Observing Asthma Awareness Month, EPA Honors Leading Community Asthma Care Programs in Colorado and Texas  https://t.co/r6iut1TIXd via @EPA","date":"Thu Apr 30 17:28:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to the @SamMaloneShow at 8:30AM CENTRAL. Will discuss #Texas reopening this week. @AM1070TheAnswer","date":"Thu Apr 30 12:11:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling into The @toddstarnes Show at 12PM CENTRAL today! We will discuss reopening the country and #Texas. Listen in online, here: https://t.co/kDGffOlAz0 #COVID19","date":"Wed Apr 29 16:28:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#Texas Gov. Abbott to let stay-at-home order expire Thursday night, businesses begin re-opening Friday https://t.co/K9Ac5q3exO","date":"Tue Apr 28 19:13:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @GovMikeHuckabee last Friday night on Fox News re: the Democrats politicization of #COVID19. Watch the interview here: https://t.co/7tsL320jlY","date":"Mon Apr 27 14:32:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gov. Abbott to announce new details to reopen Texas businesses at 2:30PM CENTRAL https://t.co/0JM3cj4dZL","date":"Mon Apr 27 13:47:24 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @FoxNews tonight at 8PM CENTRAL! I’ll talk to @GovMikeHuckabee (in for @seanhannity) re: Democrats politicization of #COVID19 &amp; more!","date":"Fri Apr 24 22:30:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Joined KETK News last night to discuss the $500 billion coronavirus aid package #Congress passed to support local businesses and hospitals during the COVID-19 pandemic https://t.co/A8r1VOQqzN #COVID19 @KETK","date":"Fri Apr 24 13:35:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to @KETK TONIGHT at 6PM CENTRAL re: Paycheck Protection Program and Health Care Enhancement Act. Tune in! #COVID19","date":"Thu Apr 23 21:12:14 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Apparently the answer the Democrats have is – if you got eight committees that aren't doing their job, we have the answer— another committee! #Coronavirus #COVID19 https://t.co/qhD3ftW3TF","date":"Thu Apr 23 16:16:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to the @SamMaloneShow this morning at 7:15AM CENTRAL. We’ll discuss the vote in Congress today. Listen in!","date":"Thu Apr 23 11:56:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @SiriusXMPatriot today at 10:05AM CENTRAL. Will talk to @davidwebbshow re: the #COVID-19 relief package and more. Tune in this morning!","date":"Wed Apr 22 14:34:49 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE: #Texas Gov. Abbott holds a press conference to provide an update on the state's continued response to COVID-19 https://t.co/yWPqB4rRUB","date":"Tue Apr 21 19:09:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On this day in history (184 years ago) #Texas won its independence at the Battle of San Jacinto. \n\n#RemembertheAlamo #GodBlessTexas","date":"Tue Apr 21 14:52:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to the @LarsLarsonShow today at 4:30PM CENTRAL. We will talk about President Trump's decision to halt WHO funding and also discuss the Paycheck Protection Program. Tune in here: https://t.co/nZnPihzOBI","date":"Fri Apr 17 20:05:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @GrahamLedger about how the Democrats are politicizing the COVID-19 pandemic \nhttps://t.co/i2wrMEmp92","date":"Fri Apr 17 17:17:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to The @MarkDavis Show this morning at 8:35AM CENTRAL. We'll discuss #WHOFunding and President Trump's guidelines for Opening Up America Again. Listen in: https://t.co/T3LrtgVvOd","date":"Fri Apr 17 12:55:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to “Mornings on the Mall” on @wmalnews at 7:05AM CT! We’ll discuss #WHOfunding, Congress &amp; #CoronaVirusUpdate. Listen in!","date":"Fri Apr 17 11:55:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to #WashingtonWatch in a few minutes to discuss many pressing issues in the country. #coronavirus #whofunding Listen in: https://t.co/zRscLTkMei","date":"Thu Apr 16 21:31:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump did the right thing in withholding funding from the World Health Organization (WHO) and he should be thanked by every American ... https://t.co/zGFEoJwJ5U","date":"Wed Apr 15 19:53:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"REMINDER: #TaxDay is now extended to July 15!","date":"Wed Apr 15 17:58:32 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here is a list of updated #COVID19 emergency food distribution resources for #TX01 residents: https://t.co/G05p7sxrIK","date":"Wed Apr 15 15:46:37 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Check on the status of your Economic Impact Payment via the #IRS portal: https://t.co/e41H65PBJ3","date":"Wed Apr 15 13:44:04 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here is what you need to know about your Economic Impact Payment. For most taxpayers, payments are automatic, and no further action is needed. This includes taxpayers who filed tax returns in 2018 and 2019 and most seniors and retirees: https://t.co/sAHKqzEGoW","date":"Tue Apr 14 14:22:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"You can also keep up with @CDCgov updates on #Coronavirus Disease 2019 via this link: https://t.co/3bDxDadJ3g","date":"Tue Apr 14 12:58:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"HE IS RISEN! \n\n#ResurrectionSunday #HappyEaster https://t.co/3gxmQzDClk","date":"Sun Apr 12 11:28:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life. - John 3:16 #GoodFriday","date":"Fri Apr 10 12:44:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @SamMaloneShow this morning at 9AM CENTRAL. Listen in to @AM1070TheAnswer. https://t.co/iZuS1njEUF #COVID19","date":"Thu Apr 09 13:44:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"IRS speeds up coronavirus check printing, delivery ahead of schedule https://t.co/p32rcSQfyS","date":"Wed Apr 08 19:40:16 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#Coronavirus stimulus checks are on their way: Here's how it works https://t.co/bwZONGcFD6","date":"Wed Apr 08 17:22:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch East Texas Live Now! Currently discussing #COVID19. Watch here: https://t.co/7qO9KjHCau  @KLTV7","date":"Tue Apr 07 17:10:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Coronavirus (#COVID19): Small Business Guidance &amp; Loan Resources https://t.co/S3kXWiwHI7","date":"Tue Apr 07 16:40:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Helpful links for #TX01\n\nFood distribution resources: https://t.co/Fjg8PqZpmW\n\nSmall business assistance: https://t.co/PGH4YVMap0\n\nEconomic impact payment information: https://t.co/iT56TEXS3Y","date":"Mon Apr 06 15:47:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Surgeon General  Dr. Jerome Adams demonstrates how to create your own face mask: https://t.co/Zs8aPh3Mgr #COVID19","date":"Mon Apr 06 15:07:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"They took palm branches and went out to meet him, shouting, \"Hosanna!\" \"Blessed is he who comes in the name of the Lord!\" \"Blessed is the king of Israel!\" — John 12:13 #PalmSunday","date":"Sun Apr 05 13:56:32 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here are some helpful links for #TX01 small business assistance during this difficult time: https://t.co/vD1AhimOK8 #COVID19","date":"Wed Apr 01 17:00:28 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @toddstarnes' radio show this afternoon at 1:30PM CENTRAL. Listen online here: https://t.co/FpqVP93gpP","date":"Wed Apr 01 16:45:08 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The Treasury Department &amp; Internal Revenue Service announced that distribution of economic impact payments will begin in the next three weeks &amp; will be distributed automatically, with no action required for most people. More info: https://t.co/hC2DrC46Gp","date":"Tue Mar 31 19:45:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today at 2pm CT ==&gt; Texas Gov. Greg Abbott is answering questions and providing an update on the efforts #Texas officials have made in response to COVID-19: https://t.co/gFOexxeP2F","date":"Tue Mar 31 18:15:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"For #COVID19 food assistance in #TX01 please check out this list of helpful organizations providing aid during this difficult time: https://t.co/0c43deWM8S","date":"Tue Mar 31 17:00:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#TX01 Brookshire Grocery Company staying open Easter to serve community https://t.co/gBOBQl0gT7","date":"Tue Mar 31 14:50:22 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @PointofViewRTS today at 2:15PM CENTRAL. Will talk to @KerbyAnderson re: current events around the country and more. Listen to the show here: https://t.co/p6y2frBzjz","date":"Mon Mar 30 17:30:24 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today is #NationalDoctorsDay! Thank you to the medical professionals who work tirelessly to save lives every single day and keep Americans healthy.  \n\n#ThankADoctor today!","date":"Mon Mar 30 16:32:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“I spent much of the night reviewing all the sunsets in the bill. I’m satisfied that most of them will prevent most of the waste...\" #coronavirus #COVID19 https://t.co/yognwlutI2","date":"Fri Mar 27 16:33:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"In this time of great challenges as we steer our way through the difficult issues the #Coronavirus has caused, please be concerned, but also understand that fear itself creates more problems ...\"  VIDEO ADDRESS: https://t.co/1qBHgGyLTK","date":"Wed Mar 25 15:01:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In response to #COVID19, many taxpayers can delay tax payments to the #IRS until 7/15/2020 without penalties or interest. File a return or request a filing extension by April 15. No additional filing is necessary for the payment extension: https://t.co/0mMrhE7cbc","date":"Thu Mar 19 14:34:48 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @KETK last night on their #CoronaVirus special coverage newscast. You can watch the full show via the link below. https://t.co/BuFoJ17Lil","date":"Wed Mar 18 17:17:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling into The @WilkowMajority TODAY at 12:40PM CENTRAL. We'll discuss the Coronavirus bill and more. Listen in to @SiriusXMPatriot this afternoon!","date":"Tue Mar 17 15:31:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Spoke on the House Floor re: technical changes made to H.R. 6201, the \"Families First Coronavirus Response Act.\" https://t.co/2u9ktkUvbf","date":"Tue Mar 17 01:20:30 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining @LouDobbs tonight on @FoxBusiness! Tune in at 6pm CENTRAL. #Coronavirus","date":"Mon Mar 16 22:07:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I cannot read the changes to a bill that haven’t been written yet.","date":"Mon Mar 16 20:25:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My constituents did not elect the California delegation to represent them, they elected me—and that’s what I am trying to do. I will not give my consent without first reading these very serious changes ... https://t.co/phTTZlg6mN","date":"Mon Mar 16 18:51:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I'd like to know how I'm holding up a bill from going to the Senate that hasn't been written yet? Most Senators are not even back in DC yet. #FakeNews","date":"Mon Mar 16 18:21:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We still do not have a final draft of the negotiated changes being called ’technical corrections’ and some of us believe that the newly worded laws should be finished before we pass them. #CoronaVirus","date":"Mon Mar 16 17:36:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The @DeptVetAffairs has created a new website specifically designed to answer #veterans questions re: #coronavirus. Visit the website, here: https://t.co/KQCV1kNwh7","date":"Mon Mar 16 14:41:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here's my full statement on H.R. 6201, \"Families First #Coronavirus Response Act\": https://t.co/dQSEhbe3ky","date":"Sat Mar 14 20:30:24 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump The Real Reason Why 40 Republicans Voted Against the Second #Coronavirus Bill https://t.co/iY1pRNK8ok via @pjmedia_com","date":"Sat Mar 14 16:56:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“This is no way to handle billions and billions of dollars when we are trying to help people; and, we don’t even know whether we will help them or hurt them.” #CoronaVirusResponseAct\nhttps://t.co/jHFMA2qw6M","date":"Sat Mar 14 14:04:18 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here’s my full statement re: #Covid_19: https://t.co/6hIvIl7vkX\n\n#CoronaVirusUpdate","date":"Thu Mar 12 22:19:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT ==&gt; Will co-host along with @RAMansour \"Breitbart News Tonight\" from 8-11PM CENTRAL. We'll discuss #FISA re-authorization, China, #COVID19 &amp; react to @realDonaldTrump's speech from the Oval Office. Listen in to @SiriusXMPatriot!","date":"Thu Mar 12 00:10:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Any law based on a lie has a good chance of being a problem ... we need to fix the #FISA court and this doesn't do it.\" #FISAReforms https://t.co/ZT9U1HDPH3","date":"Wed Mar 11 20:35:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Judiciary Full Committee Markup on the Domestic Terrorism Prevention Act and the Not Invisible Act. Watch, here: https://t.co/UXu5NBMFJB","date":"Wed Mar 11 15:11:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"On the phone right now with the @toddstarnes show! We are discussing the #coronavirus and more. Listen to the interview, here: https://t.co/QZvPNcYXSn","date":"Tue Mar 10 17:36:41 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources hearing re: \"Examining the Spending Priorities and Missions of the U.S. Forest Service and the Bureau of Land Management.\" Watch, here: https://t.co/YNCxQpH1vD","date":"Tue Mar 10 14:28:43 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congressman Gohmert's full statement on #COVID19: https://t.co/jv9XcNfwbv","date":"Mon Mar 09 22:19:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"He said he would return if he were me and advised that my staff and I should just be careful to observe proper hygiene protocols. I took the advice of the expert and returned to work. No one is panicking and we are observing the recommended precautions.\" (3/3)","date":"Mon Mar 09 21:51:51 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"After CDC physician called me Sunday evening, and we discussed all the specific circumstances of which he was aware along with my circumstances, including that I was and am asymptomatic, he said that all things considered, I was cleared to return to Washington. (2/3)","date":"Mon Mar 09 21:51:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Saturday night, I got a call from the House physician advising that I had possibly been exposed to the COVID-19 virus at CPAC on February 27th, and that a top CDC physician in Atlanta would call me to discuss what should be done going forward. (1/3)","date":"Mon Mar 09 21:51:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to #WashingtonWatch today at 4pm CENTRAL. Talking to Tony Perkins about Senate Minority Leader Chuck Schumer's #SCOTUS comments. Listen: https://t.co/zRscLTkMei","date":"Fri Mar 06 20:40:06 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in TODAY at 3pm CENTRAL to \"America First\" with @SebGorka. We will discuss this week on #CapitolHill.  #coronavirus #Schumer #SCOTUS","date":"Fri Mar 06 20:05:13 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT ==&gt; Tune in to @FoxBusiness at 7PM CENTRAL. Will talk to @trish_regan re: Schumer's recent remarks on certain #SCOTUS Justices.","date":"Thu Mar 05 21:05:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: The House Judiciary Subcommittee on the Constitution, Civil Rights, and Civil Liberties is holding a hearing. Watch LIVE, here: https://t.co/WYLaQkxDJ0","date":"Thu Mar 05 15:19:25 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @SamMaloneShow this morning at 8:30AM CENTRAL. We’ll discuss the #Coronvirus and news on Capitol Hill. Listen in!","date":"Thu Mar 05 14:04:55 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to discuss the future of science and technology in Kazakhstan with Vladimir Petrovic, the former Ambassador from Serbia to the US! https://t.co/cidz8ciwlg","date":"Wed Mar 04 18:29:07 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#Coronavirus funding should be a CLEAN bill. No FISA reauthorization, no price fixing on drugs. Democrats should stop playing politics with the health of the American people.","date":"Wed Mar 04 17:22:27 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Committee Hearing, \"Examining the Department of the Interior’s Spending Priorities and the President’s Fiscal Year 2021 Budget Proposal.\" Watch it LIVE, here: https://t.co/lmaiIGtx4y","date":"Wed Mar 04 15:14:03 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews tonight at 8PM CENTRAL! Talking to @seanhannity regarding many important issues facing the country.","date":"Tue Mar 03 00:03:15 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy #TexasIndependenceDay! This day commemorates the adoption of the Texas Declaration of Independence on March 2, 1836. #GodBlessTexas https://t.co/3t6H3s3u0w","date":"Mon Mar 02 13:14:33 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Next stop at #CPAC2020: Radio Row! Great to talk with @wmalnews https://t.co/wIHo8Zt8uI","date":"Thu Feb 27 20:14:39 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was an honor and privilege to speak at #CPAC2020! Great to see so many patriots out here today! https://t.co/ABUbMEcV3T","date":"Thu Feb 27 19:14:56 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Speaking next at #CPAC2020 ! Tune in here: https://t.co/H9uDTU6ioS","date":"Thu Feb 27 18:45:44 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"In the green room at #CPAC2020 waiting to go on stage and watching my friend @VP https://t.co/VXcE9PM3ta","date":"Thu Feb 27 17:47:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Lynching is one of the most heinous forms of murder and absolutely deserves to be treated as a capital crime. Today's vote contained diluted language that does not provide a proper avenue for punishment. Read my full statement on my H.R. 35 vote here: https://t.co/9ejzajzUAc https://t.co/gDnt98VJPP","date":"Thu Feb 27 00:45:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Committee Legislative Hearing\nhttps://t.co/5BuFaSQAjX","date":"Wed Feb 26 15:57:59 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Such an honor to take a group from the National Association of Health Underwriters Tyler/East Texas delegation on a tour of our United States Capitol last night! #TX01 https://t.co/PvKSFexz0A","date":"Wed Feb 26 15:21:54 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews at 8:20pm CENTRAL. Talking to @seanhannity about the Democratic candidates in the 2020 Presidential election!","date":"Thu Feb 20 00:25:52 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"February 16th marked a bittersweet day as Kari's Law was finally implemented. While we cannot turn back time to save Kari’s life, this law helps to ensure other families will not have to endure such a horrendous tragedy. #KarisLaw @kytxcbs19 @jen_moynihan https://t.co/U5PvrDWiew","date":"Tue Feb 18 18:48:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews at 8:25 pm CT tonight! Talking to @seanhannity about the outlook for the 2020 Presidential election.","date":"Thu Feb 13 01:57:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Had a great meeting with Bob Samford, Director of Economic Development for the City of Lufkin! This plaque commemorates Lufkin’s designation as Foreign Trade Zone #297, which will open up this great city to the global market and create new business and job opportunities! #TX01 https://t.co/gber0w0If6","date":"Wed Feb 12 22:28:24 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"So great to meet with @TAMU President Michael K. Young! #GigEm #Aggies #TAMU https://t.co/yWVyX0UDBb","date":"Wed Feb 12 20:57:21 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":". @FRCdc &amp; @FRCAction have been steadfast in their mission to advocate on behalf of policies which embrace freedom, promote family values and uphold the sanctity of life and I am proud to be the recipient of the #TrueBlueAward and all that it represents! https://t.co/lk6m9pMw0d https://t.co/dbQuX2aFXz","date":"Tue Feb 11 22:31:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Honored to receive the Defender of Liberty Award. Thank you @LimitGovt!","date":"Tue Feb 11 16:41:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Thank you @realDonaldTrump for the shoutout! #acquittedforever https://t.co/EIffKcjYnN","date":"Thu Feb 06 18:40:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked with @seanhannity about the outlook for Democrats in the 2020 Election. Watch the full interview here: https://t.co/CH2jq9SIuD https://t.co/ecelvgVvcL","date":"Thu Feb 06 17:22:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned FBI Director Christopher Wray in a House Judiciary Committee Hearing on \"Oversight of the FBI.\" Watch the full questioning here: https://t.co/S94y7gZ15i","date":"Wed Feb 05 23:14:58 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Rep. Gohmert and @Nigel_Farage join @trish_regan to react to the #SOTU...\"One great speech about America's greatness!\" Watch the full interview here: https://t.co/4radDTMGiF","date":"Wed Feb 05 19:12:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"@realDonaldTrump gave a terrific #SOTU address tonight! As my guest @Nigel_Farage said, “It’s a united party behind him!” https://t.co/5oPbJcHr7I","date":"Wed Feb 05 05:18:35 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Great to meet with Helen Warwick, Marshall ISD Trustee, to discuss K-12 education today! #TX01 https://t.co/MoFijwCHfY","date":"Tue Feb 04 19:47:09 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"I want a new AUMF, but this is a political stunt that puts Americans at risk through Democrats irrational efforts to hurt President Trump.” Read my full statement on my vote against repealing the AUMF here: https://t.co/gurNpkjSJU","date":"Fri Jan 31 18:24:05 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Louie Gohmert's House Floor speech last night about the \"left-wing activist trying to take out President Trump\" aka the whistle blower. https://t.co/FahQzkIz5t","date":"Thu Jan 30 19:48:50 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today I joined my colleagues on the House Floor to speak in opposition to repeal the Authorization for Use of Military Force Against Iraq Resolution of 2002! https://t.co/o7jbSi5nl6","date":"Thu Jan 30 18:26:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Discussed the sham impeachment trial on @seanhannity with @RepMarkMeadows and @Jim_Jordan ! Watch the full interview here:\nhttps://t.co/VvYdHPWS9w","date":"Wed Jan 29 17:01:10 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews at 8:20pm CENTRAL! Talking to @seanhannity about the impeachment trial in the Senate.","date":"Tue Jan 28 23:39:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Discussed the impeachment trial in the Senate with @trish_regan. Watch the full interview here: https://t.co/TAn45W9ccv","date":"Fri Jan 24 21:01:20 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Great to have #TX01 students showing their #prolife support in the Washington @March_for_Life! \nhttps://t.co/Pha47YyBxY","date":"Thu Jan 23 21:54:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxBusiness tonight at 7:30 pm CT. I’ll be talking to @trish_regan about #impeachment","date":"Wed Jan 22 22:16:53 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to The @LarsLarsonShow soon! Will discuss Speaker Pelosi sending impeachment articles to Senate and the upcoming trial. Listen in!","date":"Wed Jan 15 23:04:44 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxBusiness tonight at 7:15PM CENTRAL! Talking to @trish_regan re: the Senate &amp; the impeachment insanity.","date":"Tue Jan 14 23:44:11 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Look at the charges -- abuse of power, obstruction of Congress. Those are the two charges that those pushing impeachment are guilty of -- not this President.\" https://t.co/MX65QQRrZL","date":"Tue Jan 14 20:42:31 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in tonight to @FoxNews at 8PM CENTRAL! Will talk to @seanhannity re: Speaker Pelosi moving forward to transmit impeachment articles next week.","date":"Fri Jan 10 23:19:41 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This resolution presented on the House Floor today, H. Con. Res. 83, is designed to weaken our President @realDonaldTrump at the very moment this nation should be standing in solidarity with him &amp; against the terrorist aggression he is trying to stop. https://t.co/xiFTJw04EB","date":"Thu Jan 09 23:12:46 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today is #LawEnforcementAppreciationDay. We truly thank our brave law enforcement officers and first responders for the daily sacrifices they make for their communities. https://t.co/p0pGNRyarc","date":"Thu Jan 09 14:38:34 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @JoeTalkShow tonight at 6:30PM CENTRAL! We’ll discuss President Trump’s address today and more!","date":"Wed Jan 08 22:52:12 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"President Trump is expected to make a statement Wednesday morning about the Iranian missile strikes that were aimed overnight at U.S. military bases in Iraq. https://t.co/J3zS1KmECy","date":"Wed Jan 08 13:22:17 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This morning I’ll talk to @SamMaloneShow re: #Congress, impeachment latest, Iran, foreign policy and more. Listen in on @AM1070TheAnswer at 8AM CT!","date":"Tue Jan 07 12:23:26 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @WilkowMajority today at 12:40PM CENTRAL! We’ll discuss the impeachment delay &amp; the death of Gen. Soleimani. Listen in to @SiriusXMPatriot!","date":"Mon Jan 06 17:51:45 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy #NewYear! #2020","date":"Wed Jan 01 17:59:29 +0000 2020","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will be guest hosting for the great @seanhannity today on his nationally syndicated radio show! We have a great lineup of guests this afternoon. Be sure to tune in from 2-5PM CENTRAL/3-6PM EASTERN!","date":"Fri Dec 27 15:41:10 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews tonight at 8PM CENTRAL. I’ll talk to @HeyTammyBruce in for @seanhannity about the #ImpeachmentSham.","date":"Thu Dec 26 22:55:53 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Merry Christmas! \n\n“For to us a child is born, to us a son is given; and the government shall be upon his shoulder, and his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.” – Isaiah 9:6","date":"Wed Dec 25 18:56:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will join @KETK_NealBarton TONIGHT at 6PM CENTRAL on KETK News. Will give an update on all the events that unfolded in Washington, D.C. last week and weigh in on what is in store for the #NewYear!","date":"Mon Dec 23 23:30:15 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 2:35PM CENTRAL will talk to guest host @JordanSekulow on The @seanhannity Show! Listen in -- we'll discuss the #impeachmentsham https://t.co/hW9oiMgB6z","date":"Mon Dec 23 19:00:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congratulations! #TX01 \n\nhttps://t.co/caKc4TLy8w","date":"Fri Dec 20 21:21:45 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT -- I am co-hosting \"Breitbart News Tonight\" with @RAMansour from 8PM -- 11PM CENTRAL. We'll discuss this eventful week in #Congress. Don't miss the show tonight on @SiriusXMPatriot! #ImpeachmentSham","date":"Thu Dec 19 23:00:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @LarsLarsonShow TODAY at 4:30PM CENTRAL. Will talk about the eventful week in #Congress and the #ImpeachmentSham vote. Listen in: https://t.co/WzHG6tWIWp","date":"Thu Dec 19 22:00:14 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Rep. Gohmert responds to accusation he was a tool of Russia https://t.co/cdOJg2jkK1","date":"Thu Dec 19 21:30:02 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @DLoesch's radio show at 2:30PM CENTRAL today. We'll discuss the #ImpeachmentVote in the House and more. Listen in here: https://t.co/XKjRvovUpr","date":"Thu Dec 19 20:17:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Mark Meadows has been a champion in the House, and we will miss him dearly. Godspeed to Mark in his future endeavors. I am proud to call him my friend.","date":"Thu Dec 19 17:50:32 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Pelosi Muzzles Republicans Who Want to Speak Out Against Impeachment by Canceling Special Order Speeches  https://t.co/dWmIKzdXpn","date":"Thu Dec 19 17:45:19 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to @TuckerCarlson after the #ImpeachmentVote tonight on the House Floor. Tune in to @FoxNews around 7PM CENTRAL. #ImpeachmentSham","date":"Thu Dec 19 00:24:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"It's lowered even farther -- the bar. It will be used for political battles and this country's end is now in sight, and I hope I don't live to see it. This is an outrage.\" #ImpeachmentDebate https://t.co/qUfMQGT7QA","date":"Wed Dec 18 21:15:56 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"After months of a partisan and unfair process ... https://t.co/inEtE1mSsV","date":"Wed Dec 18 15:21:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Discussed the #ArticlesOfImpeachment with @trish_regan tonight on @FoxBusiness on the eve of the House vote. VIDEO: https://t.co/fj5oq0Ro4q","date":"Wed Dec 18 02:42:46 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @FoxBusiness TONIGHT at 7PM CENTRAL. Will discuss the upcoming #impeahmentvote in the House with @trish_regan on the show this evening!","date":"Tue Dec 17 23:30:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to #WashingtonWatch TODAY at 4:05PM CENTRAL. Talking to guest host Sarah Perry on @FRCdc radio re: impeachment news in Congress. Listen in: https://t.co/zRscLTkMei","date":"Tue Dec 17 21:30:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @HowieCarrShow TODAY at 3:30PM CENTRAL. We will discuss the latest with the #impeachmentvote in the House. Listen in here: https://t.co/juPbRjJrcM","date":"Tue Dec 17 20:30:21 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"GOHMERT on HANNITY: ‘When it Came Down to Articles of Impeachment, There Was No Crime’\nhttps://t.co/dWWVuxN2nI","date":"Tue Dec 17 17:29:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Discussed the Democrat mass #impeachment delusion last night with @seanhannity. Here's the full interview: https://t.co/MF3uBdMFFB","date":"Tue Dec 17 15:35:41 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tonight at 8PM CENTRAL be sure to watch @FoxNews! Will talk to @seanhannity re: this upcoming week in #Congress. #ImpeachingHearings #ImpeachmentVote #ImpeachmentSham","date":"Mon Dec 16 23:27:21 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"I voted \"NO\" \n\n#ArticlesOfImpeachment https://t.co/406kTRTsID","date":"Fri Dec 13 16:24:11 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“They [Democrats] don’t have the right to abuse the process; and, this was a total abuse of process. It was a witch hunt – that’s why they could not settle on a charge until they had exhausted that there was no evidence of a crime …” https://t.co/bJYnv0oMqj","date":"Fri Dec 13 16:12:19 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“This is really a sad day -- a big show … America needs to hear from the witnesses; and, we didn't get to hear from them here. This was a kangaroo court -- outrageous to put the country through this!” https://t.co/IhIZqkZ4Rk","date":"Fri Dec 13 15:31:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The House Judiciary Committee debate on \"Articles of Impeachment\" will resume at 9AM CENTRAL. Watch, LIVE: https://t.co/MSj4qweRiF","date":"Fri Dec 13 14:51:54 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“I’ve never seen something like this – using the Congressional system to try to destroy people that have committed no crimes whatsoever ... it’s just almost unbearable.”  #ImpeachmentHearings https://t.co/H5yIFeaXdn","date":"Fri Dec 13 13:07:53 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"Never in history has a president been accused of crimes with the target constantly changing.\" #ImpeachmentHearings https://t.co/gk1f8evFkv","date":"Thu Dec 12 20:59:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump wants to get to the bottom of 2016 foreign interference and what do they [Democrats] accuse him of -- of getting foreign interference. No -- you can't root out foreign interference until you know what it was. You can't have it both ways. https://t.co/EVHHLhGXZk","date":"Thu Dec 12 18:32:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“We're here because of fraud, not by the president but from within the Department of Justice ...\" #ImpeachmentHearings https://t.co/O5Z8BAtBt6","date":"Thu Dec 12 15:51:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“This is a day that will live in infamy for the Judiciary Committee … this became a tool of the majority to use taxpayer funds to defeat a president …”   #ImpeachmentHearings https://t.co/82Ilgcy061","date":"Thu Dec 12 15:47:53 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW ==&gt; Day 2 House Judiciary Debates Articles of Impeachment in the House Judiciary Committee. Watch LIVE here: https://t.co/dxgDybaDJI","date":"Thu Dec 12 14:22:29 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“They [Democrats] talk about “abuse of power” but they were willing to obscure evidence in a basement hearing over and over. They are willing to block witnesses from coming in here and testifying before Congress ...\" https://t.co/Hu9TfsBWnP","date":"Thu Dec 12 02:03:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT -- the House Judiciary Committee will hold a markup &amp; debate two articles of impeachment. You can watch LIVE at 6PM CENTRAL: https://t.co/kHPzKnAkvp","date":"Wed Dec 11 22:34:04 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":".@realDonaldTrump is a true leader &amp; protector of our people &amp;, in this instance, a guardian of America’s future in freedom for all of her citizens. By his actions (to combat anti-Semitism) he again proves by his example he is the leader of the free world \nhttps://t.co/HHYLH10FTL","date":"Wed Dec 11 22:28:41 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gohmert: A King Is Someone Who Makes New Law with a Pen and a Phone https://t.co/cMBV0845Fw via @cnsnews","date":"Wed Dec 11 15:25:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview with @seanhannity last night on @FoxNews! VIDEO: https://t.co/DSPYydVEH4","date":"Wed Dec 11 15:23:24 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining @seanhannity on @FoxNews TONIGHT at 8:30PM CENTRAL! We’ll discuss the Democrats sham impeachment push. Be sure to tune in to the show starting at 8pm CENTRAL. #ImpeachmentHearings","date":"Tue Dec 10 22:46:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It seems that every year we have even more students with incredible talent and creativity that makes me shake my head in awe! Here are the photos from the #TX01 2019 Congressional Art Competition:  https://t.co/qCc7V3USEc","date":"Tue Dec 10 21:45:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here’s the audio of my interview on @wmalnews this morning! \n\nhttps://t.co/lUDxVAThAh","date":"Tue Dec 10 18:41:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Louie Gohmert: IG Michael Horowitz ‘Is a Cover-up Artist’ https://t.co/e7WeXtCde1 via @BreitbartNews","date":"Tue Dec 10 18:38:16 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to “Mornings on the Mall” at 6:35AM CENTRAL. We’ll discuss the House Judiciary #ImpeachingHearing yesterday &amp; the #IGReport. Listen in to @wmalnews!","date":"Tue Dec 10 12:09:21 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @BreitbartXM tonight on @SiriusXMPatriot! Calling in to the show at 10:05PM CENTRAL. We'll discuss the House Judiciary Hearing today on Capitol Hill. #ImpeachmentHearings","date":"Tue Dec 10 00:00:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"This is not about being fair. It's not about due process. It is about a kangaroo system; and let me tell you -- those who think they have done something special here -- you have set the bar so low, I'm afraid it's irreparable ...\" #ImpeachmentHearings https://t.co/8EByVRV3CL","date":"Mon Dec 09 21:28:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my comments today in the House Judiciary Hearing: https://t.co/ukX9bIP1N6 #ImpeachmentHearings","date":"Mon Dec 09 21:09:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @FoxNews tonight at 8PM CENTRAL! Talking to @JudgeJeanine about the House Judiciary Hearings next week. #ImpeachingHearing","date":"Sun Dec 08 01:38:26 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Be sure to watch @FoxBusiness tonight at 7PM CENTRAL. I’ll talk to @trish_regan about the many events unfolding this week on Capitol Hill! #ImpeachmentHearing #Pelosi","date":"Thu Dec 05 22:01:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to The @seanhannity Show this afternoon at 2:35PM CENTRAL. Talking to Sean about Speaker Pelosi proceeding with articles of impeachment. Tune in: https://t.co/PBXGHZiB08","date":"Thu Dec 05 19:35:03 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Standing with my #Texas colleagues outside the U.S. Capitol this afternoon! We’re discussing the importance of #USMCA. https://t.co/8NFSmZubQk","date":"Thu Dec 05 18:34:29 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Full Committee Markup https://t.co/xqtXopv9db","date":"Thu Dec 05 15:42:04 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview on @seanhannity's @FoxNews show last night. We discussed the #ImpeachmentHearing yesterday in the House Judiciary Committee: https://t.co/FPZ7x2jwF6","date":"Thu Dec 05 15:29:36 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @seanhannity TONIGHT on @FoxNews re: the House Judiciary Committee #ImpeachmentHearing today on Capitol Hill. Tune in to the show at 8PM CENTRAL!","date":"Wed Dec 04 23:48:26 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gohmert Rips Nadler's Claim of 'Undisputed' Facts; Wants More Witnesses | Breitbart https://t.co/bxzxYUsDEb via @BreitbartNews","date":"Wed Dec 04 23:07:52 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“We need some factual witnesses. We do not need to receive a report that we don't have a chance to read before this hearing. We need a chance to bring in actual fact witnesses.” #ImpeachmentHearing https://t.co/hqNQ4pXOMB","date":"Wed Dec 04 21:14:21 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my full comments in the House Judiciary #ImpeachmentHearing today on Capitol Hill. VIDEO:  https://t.co/CMddyuWLxG","date":"Wed Dec 04 20:46:03 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 9AM CENTRAL ==&gt; WATCH the House Judiciary Hearing LIVE, here: https://t.co/5LWOJak0wJ\n#ImpeachmentHearing","date":"Wed Dec 04 14:11:51 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to #WashingtonWatch TODAY at 4PM CENTRAL. Will talk to @tperkins re: the GOP impeachment report and the hearing tomorrow. Listen in: https://t.co/zRscLTkMei","date":"Tue Dec 03 21:00:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Republicans to Nadler: Americans deserve better than Democrats’ impeachment obsession via @JudiciaryGOP https://t.co/RnzF5F4wsX","date":"Tue Dec 03 15:43:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxNews tonight at 6:45PM CENTRAL. Talking to @edhenry about the ongoing impeachment charade &amp; the House Judiciary scheduled impeachment hearing next week.","date":"Fri Nov 29 22:34:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Thanksgiving! \n\n\"Give thanks to the Lord, for he is good; his love endures forever.\" - Psalm 136:1 https://t.co/XN6m4Uwmlj","date":"Thu Nov 28 12:42:24 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @toddstarnes today on his radio program. Listen in to the show at 11:30AM CENTRAL. We will discuss the impeachment hearing set in House Judiciary next week and more! https://t.co/DMQOjDD6mZ","date":"Wed Nov 27 15:30:45 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview with @trish_regan last night on @FoxBusiness re: the media's treatment of #herodog Conan, the ongoing impeachment charade &amp; upcoming House Judiciary hearing: https://t.co/Z9c5kZVPE5","date":"Wed Nov 27 13:09:55 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT at 7:20PM CENTRAL will talk to @trish_regan on @FoxBusiness re: the hero dog who helped bring down Baghdadi &amp; will comment on the breaking news that the House Judiciary will hold an impeachment hearing next week. Tune in tonight!","date":"Tue Nov 26 22:02:36 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Spoke on the House Floor last night re: the ongoing impeachment hearings in the House &amp; commented on the case of General Michael Flynn. VIDEO: https://t.co/Fe8D1JiLoI","date":"Thu Nov 21 16:04:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Great to congratulate the Stephen F. Austin State University Ladyjacks this morning in my Washington, D.C. office on their 2019 NCAA Women's Bowling championship title! #TX01 https://t.co/X1RauQ7AFT","date":"Thu Nov 21 15:46:15 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At 9AM CENTRAL the House Natural Resources Committee will hold a Full Committee Markup. Read more about it here and watch LIVE: https://t.co/3MQqbsoY3g","date":"Wed Nov 20 14:42:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 9AM CENTRAL ==&gt; House Judiciary is holding a Full Committee Markup. Watch it LIVE, here: https://t.co/UczB9vy6x1","date":"Wed Nov 20 14:20:34 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @SamMaloneShow this morning at 8AM CENTRAL. Listen in LIVE, here: https://t.co/mcwlYoxFSR","date":"Wed Nov 20 13:46:32 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Be sure to tune in to @FoxNews at 7PM CT tonight!","date":"Sat Nov 16 00:25:43 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Don't miss @TuckerCarlson's @FoxNews show tonight at 7PM CENTRAL. Will weigh in on this week's first round of open impeachment hearings on Capitol Hill and more! \n\nTune in tonight!","date":"Fri Nov 15 22:08:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Trump grants clemency to 2 Army officers accused of war crimes, restores rank to Navy SEAL Eddie Gallagher\n\nhttps://t.co/s03stXCxwB","date":"Sat Nov 16 00:07:43 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Don't miss @TuckerCarlson's @FoxNews show tonight at 7PM CENTRAL. Will weigh in on this week's first round of open impeachment hearings on Capitol Hill and more! \n\nTune in tonight!","date":"Fri Nov 15 22:08:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Spoke on the House Floor yesterday afternoon about the ongoing impeachment hearings in the House &amp; the corruption in our military justice system. \n\nVIDEO: https://t.co/KDODRCQ4Iq \n\n@JFWCaucus","date":"Fri Nov 15 16:12:00 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my comments this morning in the House Judiciary Subcommittee on Crime, Terrorism &amp; Homeland Security Hearing on \"The Administration of Bail by State &amp; Federal Courts:  A Call for Reform.\"\n\nhttps://t.co/0YSYIV4HpF","date":"Thu Nov 14 16:45:28 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my full interview with Lou Dobbs last night on FOX BUSINESS re: the first publicly held impeachment hearing in the House: \n\nhttps://t.co/QZekmcqxsl","date":"Thu Nov 14 14:45:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT at 6PM CENTRAL will talk to @LouDobbs on @FoxBusiness re: the first day of the LIVE impeachment hearings. #SchiffMediaCircus Tune in tonight!","date":"Wed Nov 13 22:25:04 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Here's all the media Schiff put between voting members and the back of witnesses heads. #SchiffMediaCircus https://t.co/buq359H9VC","date":"Wed Nov 13 15:38:40 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"8 tables of media in between witnesses and the House Judiciary Committee Members of jurisdiction who vote on articles of impeachment. #SchiffMediaCircus https://t.co/faPZWXAivq","date":"Wed Nov 13 15:30:37 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 9AM CENTRAL: House Judiciary holds a markup on H. J. Res. 79, Removing the deadline for the ratification of the equal rights amendment. WATCH, here: https://t.co/H2FWgH8pFh","date":"Wed Nov 13 14:37:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"We truly cannot thank our veterans and their families enough. May God continue to bless the United States of America and shine His favor down on the patriots who have risked life and limb for liberty.” FULL #VeteransDay Statement: https://t.co/CmJun2dw9d","date":"Mon Nov 11 14:04:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"OPED ==&gt; Reps. Hunter and Gohmert: War crimes charges against 3 military combat veterans should be thrown out by Trump https://t.co/iYCejJgsSd via @FoxNews","date":"Fri Nov 08 19:50:29 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview on The Jeff Poor Show yesterday: https://t.co/2Be9EOPZup","date":"Fri Nov 08 15:48:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Gohmert says ‘we should be at war’ with Mexican drug cartels https://t.co/gQigzeB4SV","date":"Fri Nov 08 13:48:02 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @WVNN today at 3PM CENTRAL. Will talk to @jeff_poor re: #Schiff, impeachment news, upcoming open hearings and more. Listen in here: https://t.co/1HIdz3NTY6","date":"Thu Nov 07 20:00:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will talk to @KETK_NealBarton and @KETK_Kaci LIVE TONIGHT at 6PM CENTRAL on @KETK! Tune in to the newscast tonight. There is a lot to discuss. #WashingtonUpdate","date":"Wed Nov 06 23:10:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Get updates on issues important to Texans sent directly to your email inbox! Sign up for my e-newsletter, here: https://t.co/rPwnmYyaqK","date":"Wed Nov 06 17:12:52 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @SebGorka's radio show #AmericaFirst today at 2:20PM CENTRAL. We will discuss the latest impeachment news coming from Capitol Hill. https://t.co/WKIAAO1135","date":"Tue Nov 05 18:45:11 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @toddstarnes' new radio show today at 1:30PM CENTRAL. Will weigh in on the latest breaking news in Washington, D.C. https://t.co/8OeXANsWSj","date":"Tue Nov 05 17:01:10 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"White House declares all of November as Veterans and Military Families month https://t.co/sLEizM3PXu","date":"Mon Nov 04 12:44:28 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"October job creation comes in at 128,000, easily topping estimates https://t.co/CT6VapHV0N","date":"Fri Nov 01 20:00:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to \"The Ed Martin Movement\" today on @AM560TheAnswer to talk about the #impeachment inquiry vote in the House yesterday. Listen in LIVE at 2:40PM CENTRAL: https://t.co/3g9kEyZdn6","date":"Fri Nov 01 19:00:17 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my speech on the House Floor yesterday after the vote re: the Dems impeachment inquiry: https://t.co/kKRigcq4j9","date":"Fri Nov 01 18:14:40 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @SiriusXMPatriot now! Co-hosting with @RAMansour from 8–11pm CENTRAL! https://t.co/h7ufyHLOKG","date":"Fri Nov 01 01:08:45 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will co-host the Sirius XM Patriot radio show, “Breitbart News Tonight” with Rebecca Mansour (Breitbart Senior Editor-at-Large). The show airs from 8PM – 11PM CENTRAL. Tune in to @SiriusXMPatriot!","date":"Thu Oct 31 21:46:39 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will speak on the House Floor soon regarding the vote in the U.S. House today re: the Democrat impeachment inquiry. Watch @cspan LIVE. #ImpeachmentVote","date":"Thu Oct 31 16:47:00 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @WBAP247NEWS this morning at 8:15AM CENTRAL. Talking to Chris Salcedo about the vote today on the House Floor. #ImpeachmentInquiry","date":"Thu Oct 31 13:08:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Economy Reaches Longest Expansion in U.S. History in Third Quarter of 2019, Beats Market Expectations https://t.co/rRz6Z7qACP via @WhiteHouse","date":"Wed Oct 30 19:00:38 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: The House Natural Resources Subcommittee on Oversight and Investigations is holding a hearing. Watch the live-stream, here: \n\nhttps://t.co/pFiZLdUJzM","date":"Wed Oct 30 14:23:02 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“It is very clear -- three years ago they [Democrats] identified a person they wanted to brand a criminal and for three years they have been looking for some crime that they could wrap around his neck ...\" VIDEO: https://t.co/raZSKY9PKC","date":"Wed Oct 30 14:10:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Heres my interview with @trish_regan tonight on @FoxBusiness: \n\nAre Democrats trying to distract the public from @realDonaldTrump’s \nBaghdadi victory? https://t.co/iAglL78rgW","date":"Tue Oct 29 01:54:23 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to @FoxBusiness tonight at 7:30PM CENTRAL. Will join @trish_regan &amp; comment on the latest developments with the secret impeachment hearings. We’ll also discuss the death of ISIS Leader Abu Bakr al-Baghdadi.","date":"Mon Oct 28 20:26:01 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"S&amp;P 500 opens at record high https://t.co/CBltgN0Ey2 #FoxBusiness","date":"Mon Oct 28 15:12:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Yesterday was a great day for Americans who love justice. Under the leadership of @realDonaldTrump, one of the world’s most ruthless, evil, terrorist leaders, Abu Bakr al-Baghdadi along w/ his reign of terror was brought to an abrupt but appropriate end https://t.co/9gJPl7OBCv","date":"Mon Oct 28 14:29:59 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Exclusive – Louie Gohmert: ‘Shocked’ to Discover Witnesses in Schiff’s ‘Super-Secret SCIF’ Are Told Their Testimony Is Unclassified https://t.co/jIzz0KPat8 via @BreitbartNews","date":"Fri Oct 25 14:09:34 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my interview w/ @trish_regan last night on @FoxBusiness ==&gt; https://t.co/TYp0LzEC7w","date":"Thu Oct 24 14:15:55 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @MarkDavis this morning at 8:05AM CENTRAL. Listen in to his radio show on @660KSKY! #StormTheSCIF","date":"Thu Oct 24 11:39:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to @SiriusXMPatriot @BreitbartXM tonight at 8:20pm CENTRAL. Will discuss the events of today in Congress. #StormTheSCIF","date":"Thu Oct 24 00:53:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TONIGHT on @FoxBusiness at 7PM CENTRAL will talk to @trish_regan about GOP lawmakers demanding answers and transparency today during Rep. Schiff’s closed-door impeachment session. Tune in! #StormTheSCIF","date":"Wed Oct 23 21:54:46 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"American taxpayers should not be forced to pay for experiments where organs from aborted babies are implanted into lab animals. Thanks to @SecAzar for his work to end this abuse. We need more transparency about this unnecessary &amp; inhumane practice: https://t.co/rXgHnt5Yvd","date":"Wed Oct 23 19:19:32 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Schiff and the witness are still sequestered away/not in the SCIF, so it is sort of a standoff right now.” (3/3)","date":"Wed Oct 23 17:57:39 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Earlier upon our arrival, Schiff grabbed the witness, Laura Cooper, and left. Cooper is a Pentagon official and is subject to oversight by Armed Services Committee. Yet, Schiff is not allowing Armed Services Committee Members to question her! (2/3)","date":"Wed Oct 23 17:57:16 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Earlier upon our arrival, Schiff grabbed the witness, Laura Cooper, and left. Cooper is a Pentagon official and is subject to oversight by Armed Services Committee. Yet, Schiff is not allowing Armed Services Committee Members to question her! (2/3)","date":"Wed Oct 23 17:57:16 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congressman Gohmert is still in the SCIF; the following is a message he relayed to staff via secure line: \"I am currently in the SCIF with my colleagues, w/out our phones. We plan on staying here until we negotiate a resolution. (1/3)","date":"Wed Oct 23 17:56:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE: House Judiciary Full Committee Markup | H.R. 4, the “Voting Rights Advancement Act of 2019”; and H.R. 565, the “Advancing Mutual Interests and Growing Our Success Act” or the “AMIGOS Act” https://t.co/35yReaTfYS","date":"Wed Oct 23 14:18:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining my colleagues this morning to demand transparency. #StopTheSchiffShow","date":"Wed Oct 23 13:22:52 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“This is an unbelievable time in our history. There is nothing more important than elective office. It’s something that was discussed in the Declaration of Independence, and yet we have an attempted coup taking place ...\" https://t.co/f3EsYYdpbQ #StopTheSchiffShow","date":"Wed Oct 23 13:12:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here are my comments today in the House Judiciary Committee hearing re: securing America's 2020 election. VIDEO: https://t.co/c5dlOhVz0o","date":"Tue Oct 22 17:45:50 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned Ms. Natalie Jaresko, Executive Director of the Financial Oversight &amp; Management Board for Puerto Rico, today in a House Natural Resources hearing. VIDEO: https://t.co/0jAywNxqVb","date":"Tue Oct 22 17:43:26 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @SiriusXMPatriot TODAY at 12PM CENTRAL. Talking to @WilkowMajority re: impeachment inquires, Rep. Adam Schiff and more! Listen in this afternoon.","date":"Tue Oct 22 16:00:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE: House Judiciary Full Committee Hearing: Securing America’s Elections Part II: Oversight of Government Agencies\nhttps://t.co/1y75uEaoh6","date":"Tue Oct 22 14:28:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Natural Resources Full Committee Legislative Hearing – PROMESA: Discussion Draft (Day One) https://t.co/rwdslR2Zs6","date":"Tue Oct 22 14:14:59 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Check out my oped in the @DailyCaller today ==&gt; The Media Turns Fake Whistleblowers Into Heroes, While Real Ones Get Punished And Ignored https://t.co/mFTNa9jSqy","date":"Mon Oct 21 16:20:41 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What a privilege it was to take these #HonorFlight veterans on a tour of our United States Capitol this afternoon! 🇺🇸 #TX01 https://t.co/dDC2SMd3ic","date":"Sat Oct 19 00:21:03 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Local veterans depart to Washington, D.C., for Brookshire’s and Super 1 Foods Heroes Flight https://t.co/Q1pTqKoK7b","date":"Fri Oct 18 14:24:51 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This morning, I joined several of my colleagues — testifying before the Army Review Board to ask for the release of 1st Sgt. John Hatley. @JFWCaucus https://t.co/UdNjqMXzyM","date":"Thu Oct 17 17:32:53 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My heartfelt prayers go out to Congressman Elijah Cummings’ family and loved ones during this difficult time of deep loss. Not only was Elijah a passionate and vocal advocate of civil rights, he was a devoted public servant. https://t.co/KscCpgTbqr","date":"Thu Oct 17 15:31:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"What is going on with regard to the attempted coup of a United States President is really outrageous. @realDonaldTrump \n \nhttps://t.co/0ylE9HkXmD","date":"Wed Oct 16 17:01:55 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Last night on @OANN, I discussed the lack of transparency in the 'impeachment inquiry' hearings called by the House Democrats &amp; the decision to keep the secret hearings out of the House Judiciary Committee. WATCH: https://t.co/iZeyaWzXPm","date":"Wed Oct 16 13:14:30 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining @GrahamLedger TONIGHT on @OANN. Tune in to his show, \"The Daily Ledger\" at 7PM CENTRAL. https://t.co/BsI4mTuhDQ #whistleblower #impeachment #Congress","date":"Tue Oct 15 22:00:26 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @OANN tonight. Weighing in on the Democrat non-transparent\nimpeachment inquiry. Tune in at 7pm CT!","date":"Tue Oct 15 20:50:56 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling into The @LarryOConnor Show this afternoon at 3PM CENTRAL. We'll talk about the ongoing impeachment inquiry hearings and the lack of transparency. Listen in LIVE, here: https://t.co/xgDuhrbTkJ","date":"Tue Oct 15 18:54:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This is supposed to be public. It tells you that this is indeed a coup and a star chambered effort to try to take out a sitting president. They [Democrats] have underestimated @realDonaldTrump at every turn … they don’t know him very well. https://t.co/9F4TRLYIRQ","date":"Tue Oct 15 15:26:28 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Reacted last night to Rep. Adam Schiff’s comments that the whistleblower may not need to testify. https://t.co/u40FO39F4d @FoxBusiness","date":"Tue Oct 15 10:47:47 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @DavidAsmanfox TONIGHT on @FoxBusiness at 7PM CENTRAL. We will discuss the ongoing whistleblower and impeachment news. Tune in tonight! https://t.co/LCLeHBqv7C","date":"Mon Oct 14 21:19:00 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Looking forward to calling into the show today at 2:40PM CENTRAL! @SebGorka","date":"Mon Oct 14 18:12:02 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Truly enjoyed participating in Mobberly Baptist’s Leadership Class podcast last night! We discussed confronting fear, faith and clear communication in their “Leaders Take a Stand” series. #TX01 https://t.co/xhP50uLBo1","date":"Thu Oct 10 15:52:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was an honor to be able to address those at the Oilfield Christian Fellowship monthly lunch meeting today in #TX01. What a great group of dedicated servant leaders! https://t.co/g918efGKO8","date":"Wed Oct 09 19:55:33 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to The @HowieCarrShow TODAY at 4:30PM CENTRAL. We will discuss the latest findings re: #Mueller: https://t.co/4VgnUS6YjL","date":"Wed Oct 09 19:15:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Congratulations to former Attorney General Edwin Meese! (He served under President Reagan from 1985 to 1988). \n #PresidentialMedalofFreedom\nhttps://t.co/QzyjtwLXeW","date":"Wed Oct 09 14:17:45 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"When House Dems schedule an open hearing in the Judiciary Committee, then the Executive Branch should consider cooperating, but it shouldn't cave to the secret biased Intelligence Star Chamber with its 1-sided projecting on POTUS for what Obama admin did. https://t.co/I5HCf40PrW","date":"Tue Oct 08 16:32:38 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It looks like the Intel Community Inspector General needs an Inspector General to stop it's cheating. https://t.co/oVVDfOaQln","date":"Mon Oct 07 18:51:48 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Dropped in on The Texas Federation of Republican Women’s 32nd Biennial Convention this weekend. Thank you, ladies, for the outstanding work you do! #Texas #TX01 https://t.co/5T6oeqVqTh","date":"Mon Oct 07 13:13:03 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Participated this weekend in the “Walk to End Alzheimer’s” in Lufkin, Texas! #TX01 #ENDALZ #Walk2EndAlz https://t.co/DypfoWpsJB","date":"Mon Oct 07 13:05:23 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Joining @LouDobbs TONIGHT at 6:20PM CENTRAL. We’ll discuss the latest breaking news on Capitol Hill re: #impeachment, Ukraine, etc. Tune in to @FoxBusiness!","date":"Fri Oct 04 21:34:08 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"We stand on the precipice of the greatest self-governing country in history being destroyed by political manipulators who would rather end freedom for the world than lose political control as a result of losing a lawful election.  https://t.co/PUC7TEgZNo","date":"Thu Oct 03 18:02:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Exclusive — Gohmert on Impeachment: A ‘Lawless Coup Attempt Against a Duly Elected President’ @realDonaldTrump https://t.co/ya7kpgyddH","date":"Thu Oct 03 14:51:32 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Honored heroic wounded warriors today at an event hosted by All Saints Episcopal School in #TX01. God bless our troops!  https://t.co/ukVKCs2YtH","date":"Mon Sep 30 18:56:17 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Enjoyed attending the #Texas Veterans Classic Car and Military Show this weekend in Bullard, Texas. #TX01 https://t.co/n7u6LZKeYI","date":"Mon Sep 30 13:35:22 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Participated in the Longview, #Texas “Walk to End Alzheimer’s” this weekend. It was great to see so many people come out to support finding a cure for this horrible disease. #TX01 #Walk2EndAlz https://t.co/uq0TOvhVPA","date":"Mon Sep 30 13:14:29 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Questioned witnesses today in a House Judiciary hearing re: the importance of safeguarding America's elections: https://t.co/OHQfqnzgRH","date":"Fri Sep 27 16:00:37 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Judiciary hearing on \"Securing America’s Elections.\" WATCH LIVE: https://t.co/iq8i0BHsJH","date":"Fri Sep 27 13:08:06 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"‘Louie Gohmert - The intelligence community is corrupt and will do what it takes to keep it that way.’ https://t.co/BdRmUNCidx via @LarsLarsonShow","date":"Fri Sep 27 12:46:33 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview yesterday w/ The Tara Show https://t.co/q6PD0bmy9K via @1063WORD","date":"Fri Sep 27 12:43:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Tune in to \"Tipping Point\" tonight at 8PM CENTRAL on @OANN. Will talk to @Liz_Wheeler about the breaking news this week re: impeachment, White House transcript and whistle-blower.","date":"Fri Sep 27 00:05:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed the breaking news events of the week with Terry Maxwell this afternoon on @KNZRAMFM! @FAIRImmigration https://t.co/pK5HO8OpfM","date":"Thu Sep 26 23:02:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to speak with @LarsLarsonShow in person today LIVE from the @FAIRImmigration #radiorow event in Washington, #DC! https://t.co/J7PMAuykBo","date":"Thu Sep 26 22:58:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to \"The Joyce Kaufman Show\" at 9AM CENTRAL! We will discuss all the breaking news this week in #Congress and more! @joyceonair @850WFTL @FAIRImmigration","date":"Thu Sep 26 13:22:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Will call in to @TaraServatius’ radio show this morning re: breaking news this week and #BorderSecurity. Listen in at 8:05AM CENTRAL. @FAIRImmigration","date":"Thu Sep 26 12:09:23 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was a pleasure to meet with #TX01 Phil Burks (CEO of Phirst Technologies, LLC) &amp; members of the Association for Unmanned Vehicle Systems International today in my Washington, DC office! https://t.co/OR6wrRy4KN","date":"Wed Sep 25 20:52:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"At 9AM CENTRAL: The House Judiciary Committee is holding a hearing on assault weapons. WATCH LIVE, HERE: https://t.co/LmRotyj9sL","date":"Wed Sep 25 13:55:08 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talked to @KLTV7 last night about the impeachment announcement by Speaker Pelosi yesterday. You can listen to the interview, here: https://t.co/7aH1PuTtuV","date":"Wed Sep 25 13:29:20 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Talked to @LarryOConnor yesterday re: Speaker Pelosi announcing a formal impeachment inquiry of President Donald Trump. LISTEN: https://t.co/cgrftjpqO5","date":"Wed Sep 25 13:10:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert: FBI hasn't cleaned up problems by #Mueller https://t.co/ZsEGRtMW7u via @OANN","date":"Wed Sep 25 13:05:32 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @LarryOConnor at 4:35PM CENTRAL re: #Pelosi’s announcement today. Listen in to @wmalnews for reaction!","date":"Tue Sep 24 21:16:23 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @FRCdc #WashingtonWatch TODAY at 4:22PM CENTRAL. Will weigh in on all the #Climate alarmist news this week and more! Tune in, here: https://t.co/JCIyZ8qhVZ","date":"Tue Sep 24 20:16:41 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 1PM CENTRAL: House Judiciary Subcommittee on the Constitution, Civil Rights and Civil Liberties holds hearing on \"Congressional Authority to Protect Voting Rights After Shelby County v. Holder.\" LINK: https://t.co/KvMf7jqhTn","date":"Tue Sep 24 17:55:08 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: In today's House Judiciary \"Member's Day\" hearing discussed the importance of H.R. 3583, the Federal Prohibition of Female Genital Mutilation Act of 2019. Additionally, discussed taxation without representation in Washington, D.C. https://t.co/ZyKL3bLh3o","date":"Fri Sep 20 19:10:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Rep. Gohmert: IG likely to sweep DOJ, FBI corruption under the rug\nhttps://t.co/I23YVMBRrr via @OANN","date":"Fri Sep 20 18:01:15 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today on #POWMIARecognitionDay – we remember and honor those who suffered in captivity and those brave men and women who never returned home. #YouAreNotForgotten https://t.co/NAxCdjfdXh","date":"Fri Sep 20 14:34:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy to join with @TPPatriots this week outside the U.S. Capitol and stand up for our #secondamendment rights!  https://t.co/LgJIBAYgSe","date":"Fri Sep 20 13:06:33 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Had a great meeting with ABC Auto Parts (#TX01) and members of the Auto Care Association (ACA) @AutoCareOrg in my Washington, #DC office this afternoon! https://t.co/a5HU08vccA","date":"Thu Sep 19 21:08:23 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Spoke out against #socialism today outside the @uscapitol! @TPPatriots https://t.co/3A7xhNXgsA","date":"Thu Sep 19 18:41:08 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here is my interview with @LouDobbs last night on @FoxBusiness ==&gt; IG Michael Horowitz says Dems haven’t asked him to testify on Comey or FISA abuse  https://t.co/mmDaH6JiMG","date":"Thu Sep 19 14:55:51 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"The House Natural Resources Subcommittee on National Parks, Forests, and Public Lands is holding a hearing RIGHT NOW. Read more about it and WATCH LIVE, here: https://t.co/fLetLBjyPO","date":"Thu Sep 19 14:50:37 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: In House Judiciary Committee \"Oversight Hearing on Policing Practices.\" WATCH LIVE: https://t.co/q6UK9OR7xN","date":"Thu Sep 19 14:41:06 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @LouDobbs TONIGHT at 6:20PM CENTRAL. Will discuss #McCabe, #DOJ and the ongoing investigations by the Democrats. Tune in to @FoxBusiness!","date":"Wed Sep 18 21:18:34 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @seanhannity's radio show today at 3:30PM CENTRAL. Will talk about my trip yesterday to Fort Leavenworth with members of the @JFWCaucus. Tune in: https://t.co/W5TWcIhUj5","date":"Wed Sep 18 19:45:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Happy Birthday to the @usairforce! https://t.co/m8dsKmPr8M","date":"Wed Sep 18 15:46:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE: The House Natural Resources Committee is holding a Full Committee Markup https://t.co/jTCjfrRZP3","date":"Wed Sep 18 14:34:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Judiciary Committee hearing on \"Oversight of the Foreign Intelligence Surveillance Act.\" WATCH LIVE: https://t.co/VR8lWiugYf","date":"Wed Sep 18 14:30:14 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Yesterday, some members of the Congressional Justice for Warriors Caucus personally met with American military members who were in prison as sacrificial lambs to the god of political correctness. READ MORE ABOUT OUR TRIP HERE: https://t.co/cl5eMJWJ5G https://t.co/jQ0ShUhoA1","date":"Wed Sep 18 14:01:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today we celebrate the signing of the U.S. Constitution on September 17, 1787! Happy #ConstitutionDay! https://t.co/2gb4Y1qqGl","date":"Tue Sep 17 13:52:36 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to address Bullard Intermediate School this morning! We talked about #ConstitutionWeek and how the government works. #TX01 🇺🇸 https://t.co/XAs9xQtL0C","date":"Mon Sep 16 16:14:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Enjoyed worshipping with the “Church Under a Bridge” on Sunday! #TX01 https://t.co/6PIzCdddsT","date":"Mon Sep 16 13:37:25 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“The EPA made the right call to safeguard the water rights of hard-working Americans by ending the federal power grab the Obama Administration engineered.\"","date":"Thu Sep 12 18:55:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"This week, Dems have championed 3 bills that would permanently ban energy development on much of the federal waters of the U.S. Outer Continental Shelf &amp; also the entirety of the vast untapped oil reserves of the Arctic National Wildlife Refuge. STATEMENT: https://t.co/0uPdGMubzY","date":"Thu Sep 12 17:50:17 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"\"It’s time to put this aside. Let the Democratic candidates for president run on their own, and let's get back to being judicious.”  https://t.co/vcQJyVmr7J","date":"Thu Sep 12 15:32:26 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It's my prayer that we recall &amp; relive each day with the same feeling that all Americans felt the day after 9/11 when we all came together as one nation under God — honoring the memory of those we had lost. May God bless you &amp; America. FULL STATEMENT: https://t.co/ghi5fKBZZe","date":"Wed Sep 11 15:45:16 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to The @MarkDavis Show at 8:35AM CENTRAL this morning! Weighing in on the numerous House Judiciary hearings scheduled &amp; what's in store for #Congress now that we are back in session. https://t.co/6RG498HIAA","date":"Wed Sep 11 13:20:14 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"9/11 Commemoration Ceremony takes place at Ground Zero https://t.co/eXGmfdHCzS","date":"Wed Sep 11 13:07:54 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today we remember the thousands of lives lost in the #September11 terrorist attack - parents, siblings, children, neighbors &amp; friends. We honor the heroism of the first responders who did everything within their power to protect &amp; serve the needs of their fellow men &amp; women. https://t.co/4lzMnYu5YF","date":"Wed Sep 11 12:05:13 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE NOW — House Judiciary Committee Markup on various bills. More information and the livestream here: https://t.co/AHU4b5JsmT","date":"Tue Sep 10 18:20:33 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Commented on the relocation of the Bureau of Land Management Headquarters to Grand Junction, Colorado today in a House Natural Resources hearing: https://t.co/kUrXYPiCPu","date":"Tue Sep 10 17:50:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“Anytime we allow people to vote without showing some evidence that they are allowable to vote it disenfranchises all of the legally voting people.\" #ElectionFraud @JudiciaryGOP VIDEO: https://t.co/mzTxtcXrtv","date":"Tue Sep 10 16:31:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Here's my interview on @WMALDC this morning: https://t.co/jnRyKWzyQJ #Congress #SecondAmendment","date":"Tue Sep 10 15:23:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"WATCH LIVE: House Natural Resources Committee is holding a hearing \"Examining the Proposed Reorganization and Relocation of the Bureau of Land Management Headquarters to Grand Junction, Colorado.\" LINK: https://t.co/mYAXQlxEGc","date":"Tue Sep 10 14:14:01 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"RIGHT NOW: House Judiciary hearing on \"Evidence of Current and Ongoing Voting Discrimination.\" WATCH LIVE: https://t.co/loAbscK1kk","date":"Tue Sep 10 14:07:49 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TOMORROW morning at 6:05AM CENTRAL will join the @WMALDC show \"Mornings on the Mall\" and discuss what is in store for #Congress. Tune in: https://t.co/Y58m4LepOh","date":"Tue Sep 10 00:00:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"#Google faces a new antitrust probe by 50 attorneys general https://t.co/KTn0FyfwZf","date":"Mon Sep 09 23:00:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to catch up with @OANN reporter John Hines this afternoon. We discussed my report on #Mueller and other pressing issues on this first day back in session after the August recess. \n\nWatch for his story on @OANN! https://t.co/Wt31I3Vxez","date":"Mon Sep 09 21:46:21 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Truly enjoyed Tyler Police Department’s kickoff party this weekend for #NationalNightOut! #TX01 https://t.co/zoGFlpHKx9","date":"Mon Sep 09 13:20:01 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Record 157,878,000 Employed in August; Record Low Unemployment Rate https://t.co/4Vhe9mvGGW via @cnsnews","date":"Fri Sep 06 17:40:47 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"GOHMERT: Inspector General Glosses Over Some Ugly Truths About The FBI https://t.co/yEMYAw5ESu via @dailycaller","date":"Fri Aug 30 16:41:18 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Talking to @JGilliam_SEAL on The @WilkowMajority TODAY at 12:04PM CENTRAL. We will discuss the G7 Summit, Comey and more! Listen in to @SiriusXMPatriot!","date":"Fri Aug 30 15:20:09 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"IG Report: 'Comey Violated FBI Policies' https://t.co/oAccV3rlp3","date":"Thu Aug 29 19:06:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Mystery Gmail Account Revives Questions About Clinton Email Probe https://t.co/dk5gHacSQ2 via @epochtimes","date":"Thu Aug 29 15:34:35 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Human trafficking panel: Raising awareness starts ‘in our own communities’ https://t.co/R9vYtdLQjO","date":"Wed Aug 28 13:59:52 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Discussed initiatives to fight sexual exploitation in #ETX today at the Rescue &amp; Restore CITYFEST meeting in #TX01. https://t.co/imMIJNB2fG","date":"Tue Aug 27 20:58:54 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Pleased to meet with Memorial Health CEO &amp; board members of CHI St. Luke’s Health-Memorial in Lufkin, Texas. Thank you for the tour of your facility! #TX01 https://t.co/ZsCQ2SYggy","date":"Mon Aug 26 13:21:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Truly enjoyed celebrating this weekend — the 100th anniversary of the establishment of the Marshall, Texas Rotary Club! #TX01 https://t.co/AI2cdMkwwf","date":"Mon Aug 26 13:13:02 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"ICYMI: Weighed in on U.S. trade tensions with China and Federal Reserve policy this morning on @FoxBusiness. Watch the interview with @MariaBartiromo here: https://t.co/vJmdqeXBQJ","date":"Fri Aug 23 14:07:06 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @FoxBusiness at 7:20AM CENTRAL this morning! Will talk to @MariaBartiromo re: pressing issues such as #immigration, upcoming House Judiciary hearings and more! Tune in to @MorningsMaria!","date":"Fri Aug 23 11:30:22 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Be sure to tune in to @FoxBusiness tomorrow morning at 7:20AM CENTRAL. Talking to @MariaBartiromo about the news this week. We'll discuss #immigration #bordersecurity #economy and more! @MorningsMaria","date":"Fri Aug 23 00:10:08 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Reps. Doug Collins (R-Ga.), Louie Gohmert (R-Texas) &amp; Jim Sensenbrenner (R-Wis.) sent the following letter to Chairman Nadler (D-N.Y.) urging him to schedule a committee markup on H.R. 3583, the Federal Prohibition of Female Genital Mutilation Act of 2019 https://t.co/jgPKJGAnJL","date":"Wed Aug 21 19:19:55 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to the @donkroah show today at 3:30PM CENTRAL. Listen in to @WAVARadio this afternoon: https://t.co/ouQnDa7dpR","date":"Tue Aug 20 19:05:12 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to \"The Mike Gallagher Show\" this morning at 10:15AM CENTRAL. Will talk to @SamMaloneShow re: the news this week! Watch, here: https://t.co/InbVi1ylyi","date":"Tue Aug 20 13:43:28 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Toured the NET Health Center for Healthy Living this morning and had a great discussion with the CEO and various employees regarding #healthcare in #TX01. https://t.co/wO4qyrd1TS","date":"Mon Aug 19 18:22:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"“The trouble is the version of the truth that’s come out now only raises more questions ...\" https://t.co/TkN0j7rJ8B","date":"Fri Aug 16 13:32:42 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Listen in to @SiriusXMPatriot tonight at 9:40PM CENTRAL. Will talk to @joelpollak on \"Breitbart News Tonight\" about many topics in the news. Listen in to @BreitbartXM!","date":"Tue Aug 13 20:05:07 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Attended a #TX01 National Active and Retired Federal Employees Association meeting this morning. I’m always happy to answer questions and talk about important issues! https://t.co/DdClhotnLO","date":"Fri Aug 09 18:36:56 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Had the incredible opportunity to be on set during part of the filming of “The Chosen” this afternoon. https://t.co/4wqVJkRQFd","date":"Thu Aug 08 22:04:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"TODAY at 12:05PM CENTRAL will call in to the @toddstarnes show on @foxnewsradio! We'll discuss the news of the week. Listen in this afternoon, here: https://t.co/aKNdXAP9g7","date":"Thu Aug 08 16:00:29 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Today on #PurpleHeartDay may we remember and honor our brave patriots. #GodBlessOurTroops #GodBlessOurVeterans https://t.co/OCwDjT6qS0","date":"Wed Aug 07 15:17:05 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"My heart truly goes out to the victims and family of those in El Paso, #Texas. Praying for all affected by this horrible tragedy. https://t.co/W9BAuQuzlj","date":"Sat Aug 03 21:01:27 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Watch @NewsmaxTV at 7:30AM CENTRAL today! Will weigh in on immigration, the #MuellerHearings &amp; more!","date":"Fri Aug 02 12:30:04 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"It was great to tour and meet the employees at the Harrison County Power Plant yesterday afternoon! #TX01 https://t.co/lA19NKf8vd","date":"Wed Jul 31 16:26:57 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Enjoyed meeting with SFA Regents to welcome Dr. Scott Gordon as the new president of @SFASU! #TX01 https://t.co/AKfSweSBEC","date":"Wed Jul 31 14:42:46 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Calling in to \"Morning Talk with @MarthaZoller\" at 8:15AM CENTRAL. You can listen in to @access_wdun LIVE here: https://t.co/GDdqH12Mre #MuellerHearings #Congress","date":"Tue Jul 30 12:30:51 +0000 2019","user_id":"22055226"},{"handle":"RepLouieGohmert","text":"Yesterday, I had the opportunity to speak at a press conference just outside the border. Got to see the great accomplishment of @WeBuildtheWall! #SecureTheBorder https://t.co/teH3p0xPrG","date":"Sun Jul 28 12:13:47 +0000 2019","user_id":"22055226"}]