[{"handle":"RepLBR","text":"But DACA isn't nearly enough to help these young people truly live the American Dream.\n\nWe must create a pathway to citizenship for DACA recipients because #HomeisHere. (4/4)","date":"Wed Jun 15 17:30:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I think of these young people, like Alexis and Milka, who shared their stories with me about how DACA changed their lives and afforded them the opportunity to attend @DelStateUniv. (2/4)\n\nhttps://t.co/DhOl1Etxg9","date":"Wed Jun 15 17:30:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Whenever I meet with DREAMers in Delaware or in Washington, D.C., there's a common refrain. \n\n\"We may not have been born in this country, but this is our home, we love this country, and we want to stay.\" (3/4)","date":"Wed Jun 15 17:30:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On the 10th Anniversary of DACA, I am reminded of the hundreds of thousands of DREAMers and their stories, full of grit, determination, and perseverance. 🧵(1/4)","date":"Wed Jun 15 17:30:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨 BREAKING 🚨\n\nThe House just passed the most significant conservation legislation in a generation - the Recovering America's Wildlife Act.\n\nJust before the vote, former DNREC Secretary &amp; current @NWF CEO, Collin O'Mara joined me to explain why this bill is so important to DE. https://t.co/lNZRRZsE7Y","date":"Tue Jun 14 22:23:31 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy 247th birthday @USArmy! 🇺🇸","date":"Tue Jun 14 20:11:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I’m voting yes on the bipartisan Recovering America’s Wildlife Act to bring $11 million to Delaware to protect wildlife and boost the outdoor economy. \n\nI’m proud to support this legislation to #RecoverWildlife for generations of Delawareans to come.","date":"Tue Jun 14 19:30:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our nation’s flag has been flying high since 1777, reminding us of the courageous men and women that have shaped the country we call home. \n\nOn #FlagDay, let us reflect on the core principles it represents: unity, diversity, integrity, and democracy.","date":"Tue Jun 14 16:20:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"By removing barriers in employment, housing, and education, we can give those who have served their time and paid their debt to society a second chance – helping reduce recidivism, improve our workforce, and strengthen our economy.","date":"Tue Jun 14 14:19:31 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thoughtful piece from @RyanCostello about the First Step Act &amp; criminal justice reform. \n\nHe's right – the First Step Act was a major step for Congress. The bipartisan Clean Slate Act, which I introduced with @GReschenthaler, should be next in the process.\nhttps://t.co/qi6KhklDmw","date":"Tue Jun 14 14:19:31 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@RepCasten I’m so so sorry for your loss, Sean. Sending my love and prayers to you and your entire family. ❤️","date":"Tue Jun 14 02:03:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to have voted tonight for the bipartisan Ocean Shipping Reform Act that will lower costs for families and crack down on exorbitant ocean shipping fees impacting the price of goods for small businesses and consumers.","date":"Mon Jun 13 23:09:17 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Roe v. Wade has been law of the land for 50 years. To strip away women's reproductive freedom now would only be an egregious betrayal of women's bodily autonomy.\n\nWe must fight to protect women's reproductive freedom – at all costs.","date":"Mon Jun 13 17:37:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A fundamental misunderstanding of what unions are.\n\nThey're not some mysterious \"third party.\" \n\nUnions ARE the workers - organized to collectively bargain for their rights and to improve working conditions.","date":"Mon Jun 13 14:49:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, we #RememberPulse &amp; the 49 lives stolen through an act of hate-motivated gun violence.\n\nFor 6 years, nothing has changed. Our country is still plagued by this epidemic.\n\nCongress has to act. To do nothing would be an insult to the memory of those killed by gun violence.","date":"Sun Jun 12 15:11:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#OTD the Equal Pay Act was signed into law by President Kennedy. Yet 59 years later, women are still making 83 cents for every dollar made by their male counterparts.\n\nWhile some progress has been made, it's clear there's more to do to truly ensure \"equal pay for equal work.\"","date":"Fri Jun 10 15:22:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Within the last 24 hours, the House passed legislation to:\n\n- raise the age to buy semi-automatic weapons to 21\n\n- outlaw high-capacity magazines\n\n- strength safe gun storage\n\n- allow federal courts to issue extreme risk protection orders\n\n#EndGunViolence","date":"Thu Jun 09 18:14:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m currently on the floor of the House voting to pass the #ProtectingOurKidsAct. Gun violence is an epidemic in our country and we have no time waste.","date":"Wed Jun 08 22:55:45 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was an honor to meet with advocates from @AMarch4OurLives this morning to discuss gun violence prevention legislation in Congress.\n\nTheir mission is more important than ever &amp; I stand ready to do my part to pass common-sense, life-saving laws to #EndGunViolence. https://t.co/Y9aEsXeIHG","date":"Wed Jun 08 16:45:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sobering testimony about the recent Uvalde mass shooting. This cannot go on. \n\nWe must raise the age to buy semi-automatic weapons. \n\nWe must ban high-capacity magazines. \n\nWe must close the ghost gun loophole.\n\nWe must strengthen storage requirements.\n\nWe must #EndGunViolence.","date":"Wed Jun 08 15:26:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you, Alexis and Milka for stopping by my office to discuss how the DACA program has provided you opportunities at @DelStateUniv and a shot at the American Dream. Congress needs to step in and protect these young men and women who are Americans in every way but on paper. https://t.co/QgNjw7ueKx","date":"Wed Jan 10 22:26:07 +0000 2018","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We know that quality of life helps drive economic development in Delaware and across the country. \n\nThrilled to see these investments in the Jack A. Markell trail in New Castle from @US_EDA that will create jobs and improve the local community. \nhttps://t.co/HsWmdkaOX4","date":"Tue Jun 07 20:31:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The gun violence epidemic facing our country right now is as heartbreaking as it is infuriating.\n\nThat's why the House will vote on two life-saving pieces of gun violence prevention legislation – the Protecting Our Children Act &amp; the Federal Extreme Risk Protection Order Act.","date":"Tue Jun 07 19:17:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, on the 78th Anniversary of D-Day, we remember the courageous soldiers who stormed the beaches of Normandy to fight for freedom and for democracy —  no matter the cost. https://t.co/bTffdgyeXp","date":"Mon Jun 06 20:31:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware has the nation’s 5th highest rate of pregnant women with substance use disorder. \n\nThanks to a federal grant, Gaudenzia's in-patient substance use treatment facility — that will open this summer — will help get pregnant women the treatment and care they need.","date":"Mon Jun 06 14:36:16 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's National Gun Violence Awareness Day.\n\nWe can pass common-sense gun legislation. \n\nWe can keep guns out of the hands of people who shouldn't have them. \n\nWe can end gun violence in America. \n\nWe don't have another moment to wait. #EndGunViolence https://t.co/YUn1OUrblG","date":"Fri Jun 03 16:14:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There are solutions to the gun violence epidemic in America - @POTUS laid them out for us tonight. \n\nNo more ifs, ands, or buts. No more inaction. Lives are at stake.\n\nThe Senate needs to act NOW.","date":"Thu Jun 02 23:59:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Constantly inspired by the advocacy, drive, and commitment from our young people to fight for what's right. \n\nI stand with them - students in every school in America deserve to feel safe in their classrooms. #EndGunViolence","date":"Thu Jun 02 19:09:07 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Increasing diversity in clinical trials will help us increase diversity in Alzheimer’s research, treatment, and prevention.\n\nLet's find a cure once and for all – together. (4/4)","date":"Thu Jun 02 16:52:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We know that Alzheimer’s and other dementias disproportionately affect underrepresented populations.\n\nThat's why I introduced the ENACT Act last year that would increase diversity in clinical trial research on Alzheimer’s and dementia. (3/4)\n\nhttps://t.co/RPoHPsPjKk","date":"Thu Jun 02 16:52:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Currently, 11 million Americans provide unpaid care for people with Alzheimer’s or other dementias. \n\nAnd as the number of Americans living with Alzheimer’s continues to rise, the fight to find a cure is paramount. (2/4)","date":"Thu Jun 02 16:52:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Traci's story is one of compassion and care, but it's also a reality that far too many Americans are experiencing right now. 🧵(1/4)\n\nhttps://t.co/VSsIM2V96L","date":"Thu Jun 02 16:52:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I won't rest until we do. And I know that incredible partners around the country like @MomsDemand &amp; @Everytown won't either. \n\nWe do this for love. https://t.co/Nnu2jWNesq","date":"Thu Jun 02 13:45:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"But our work can't stop there. We have to invest in our communities. We have to invest in violence intervention programs. We have to treat gun violence as what it is - a public health emergency.","date":"Thu Jun 02 13:45:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Whether it's banning assault weapons, implementing red flag laws, closing the Charleston loophole, implementing comprehensive background checks, or going after ghost gun manufacturers - we need those solutions and more.","date":"Thu Jun 02 13:45:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The residual trauma for our young people after experiencing gun violence is also immense. That's why we need to invest in mental health services for our young people - especially in the wake of COVID-19. \nhttps://t.co/7yOVzeyi8C","date":"Thu Jun 02 13:45:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The solutions we're talking about at the federal level to #EndGunViolence are incredibly important - critical - to stopping the violence we've seen unfold throughout our country.","date":"Thu Jun 02 13:45:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That's why initiatives like Community Violence Intervention (CVI's) programs are so critically important. It puts trusted partners in the community to help prevent violence before it starts. \n\nTrusted partners like Darryl \"Wolfie\" Chambers.\nhttps://t.co/YKw7sC9TGT","date":"Thu Jun 02 13:45:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's why I was proud to work with him on introducing the Break the Cycle of Violence Act, which invests in CVI's and other important community initiatives.\nhttps://t.co/XwKkbM7C8v","date":"Thu Jun 02 13:45:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What we have is a chronic and untreated public health emergency in our communities. Just look at this from @amnestyusa. https://t.co/VaB56ATR1s","date":"Thu Jun 02 13:45:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There have been 1,257 victims of gun violence in our state since 2017. \n\nEach of those over 1,200 victims has their own story. Their own trauma. Their own challenges. Their own families. And their own lives - often changed forever by the violence they've experienced.","date":"Thu Jun 02 13:45:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Just last year, there were 23 victims of gun violence in our state, including a 15-year-old girl who was left in critical condition. \n\nThese are our children. https://t.co/pyN6WZGglA","date":"Thu Jun 02 13:45:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"For 5 years, the folks at @delawareonline have been tracking gun violence in our state. \n\nReporters like @brittanyhorn have been relentlessly telling these stories.\n\nThe names, numbers, and ages are staggering and should give every Delawarean pause. \nhttps://t.co/xZxCcs3L3A","date":"Thu Jun 02 13:45:18 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Another shooting in Tulsa. \n\nWe cannot wait to act because we have no time to waste. \n\nAnd it's not just mass shootings - communities like Wilmington &amp; Dover are plagued by gun violence every single day. 🧵","date":"Thu Jun 02 13:45:18 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #PrideMonth! I'm proud to be an ally of the LGBTQ+ community today and every day. 🏳️‍🌈\n\nThis month, let's reflect on the progress made towards equality and recommit ourselves to the fight that's still ahead - including passing the Equality Act. https://t.co/bqFGcN53vQ","date":"Wed Jun 01 13:48:03 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Firearms are the leading cause of death for children in the United States. It's an unconscionable reality that demands immediate action.\n\nThat's why I joined 131 of my colleagues in urging House leadership to pass more gun violence prevention legislation.","date":"Tue May 31 20:17:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to give this year's commencement speech at @delawaretech's Terry Campus graduation ceremony last week. To the class of 2022 - remember that we don’t just need hope, we need bright hope.\n\nYou all are our bright and shining hope. Shine on! https://t.co/uMXq6Jgn41","date":"Tue May 31 18:29:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I remain committed in the fight to stop the stigma around mental health care and make sure people in our communities have access to the mental health resources, services &amp; support they need.","date":"Tue May 31 15:59:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we close out #MentalHealthAwarenessMonth, please remember to take time for yourself when you need it. \n\nWith all that's going on, it's never been important to prioritize your mental health. #MentalHealthMatters https://t.co/EtwXxOx6fu","date":"Tue May 31 15:59:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"7 years you've been gone, Beau. \n\nA man of resolve, a giving friend, and a strong fighter for Delaware, we strive to follow your example today and every day.\n\nMay your legacy continue on in all whose lives you touched. https://t.co/4Dlkhjp2Te","date":"Tue May 31 00:43:29 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this Memorial Day, we reflect on the names and stories of those who gave their last full measure of devotion to preserve our freedoms as we recommit ourselves to the ideals they fought to protect. May God hold them close.","date":"Mon May 30 12:14:07 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I recently had the honor of visiting Arlington National Cemetery with a bipartisan group of colleagues. There is truly no more humbling or profound experience than seeing the hundreds of thousands of headstones marking the lives &amp; legacies of those who gave everything in service. https://t.co/WriJrLUUNC","date":"Mon May 30 12:14:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I had to take the train to Washington today for a last-minute meeting. \n\nAnd as I walked out of the Capitol - I saw a group of hundreds of people gathered to send a clear message to the Senate to act NOW to #EndGunViolence.\n\nHere was my message to them. https://t.co/1aJQ6Adsi6","date":"Thu May 26 17:32:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It is our duty as elected officials to keep our communities safe. \n\nI'm calling on the Senate to vote on these bills NOW and show the American people where they stand. Our lives depend on it. #StopGunViolence (3/3)","date":"Wed May 25 20:36:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Here we are again - living in the aftermath of another heinous act of gun violence watching families suffer. \n\nThese deaths could have been prevented. We must end this vicious cycle now. 🧵(1/3)","date":"Wed May 25 20:36:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congress must find a path forward &amp; pass comprehensive, common-sense gun violence prevention legislation. The House has already passed legislation to address gun violence including bills to establish background check requirements and close the Charleston Loophole. (2/3)","date":"Wed May 25 20:36:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As America grieves the mass shooting in Uvalde, Texas, today, we reflect on yet another moment of national mourning, as we mark two years since the murder of George Floyd. \n\n2 years later, we've not done nearly enough. My full statement. https://t.co/Ycj9X12XZQ","date":"Wed May 25 16:21:44 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"What are we doing?\" \n\nA question that every elected official should answer.\n\nThis continues to happen because we allow it to. \nIt will only stop when we finally choose to act.","date":"Tue May 24 22:29:43 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There truly aren’t words. Praying for the victims, their families, and the entire Uvalde community.","date":"Tue May 24 21:43:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware’s farms are integral to our economy and in providing our communities with fresh, local produce.\n\nThank you to Fifer Orchards in Camden-Wyoming for hosting @AgricultureDE’s Secretary Scuse and I for a tour of their produce fields! https://t.co/k3wSBiXCK2","date":"Tue May 24 18:33:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"During Asian American Pacific Islander Heritage Month, join me in celebrating the culture, contributions, and impact of AAPI communities in Delaware and across the country. #AAPIHeritageMonth https://t.co/lsIqws1w2b","date":"Mon May 23 15:35:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Stay safe out there, Delaware!","date":"Sat May 21 18:26:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This Armed Forces Day, we recognize those who serve our country in uniform. \n\nI will always be grateful to our service members and their families – in Delaware and across the country – for the sacrifices they make. https://t.co/SZXEqxghI0","date":"Sat May 21 17:10:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"America's youth are facing a mental health crisis.\n\nThat's why @Nemours' Dr. Kara Odom Walker &amp; I are calling on Congress and the Biden-Harris Administration to prioritize the need to invest in our nation's mental health infrastructure. ⤵️\n\nhttps://t.co/mcCC54jrpb","date":"Thu May 19 22:25:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The baby formula shortage is impacting Delaware families at an alarming rate.\n\nTo fix this shortage and make sure it never happens again, we need an all-hands-on-deck approach. (1/2)","date":"Wed May 18 23:12:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That’s why I’m voting to pass two bills that will get the FDA the resources it needs to address this shortage &amp; allow WIC participants to purchase formula in more stores and online. #FeedOurInfants (2/2)","date":"Wed May 18 23:12:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨Attention Delawareans! You are now able to order 8 more at-home COVID tests free of charge at https://t.co/KfloDaZqku.","date":"Wed May 18 17:24:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I’m voting to pass the Workforce Innovation and Opportunity Act which includes my amendment to establish grants for workforce development programs for young people in communities that are disproportionately affected by gun violence. #InvestingInWorkers https://t.co/YTXUK0xpPE","date":"Tue May 17 22:39:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this day in 1954, the Supreme Court handed down its decision in Brown v. Board of Education declaring racial segregation in public schools unconstitutional.  \n\n📷@delawareonline | May 17, 1954 https://t.co/jKSfBRdUOz","date":"Tue May 17 18:13:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"68 years later, we remember the historic landmark decision – and the significant role Delaware played in it – and reaffirm our commitment to addressing disparities in our education system that continue to impact students across the country.","date":"Tue May 17 18:13:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A lot of important work happening in D.C. today. Just a few of the things that @HouseDemocrats are working on 👇🏽\n\n✅ Domestic Terrorism Prevention Act of 2022\n✅ Workforce Innovation and Opportunity Act of 2022\n✅ Consumer Fuel Price Gouging Prevention Act","date":"Tue May 17 14:10:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We know that there’s an affordable housing crisis impacting hardworking Americans across the country. \n\n@POTUS' Housing Supply Action Plan will create &amp; preserve hundreds of thousands of affordable housing units, making rents more affordable and helping drive down inflation.","date":"Tue May 17 13:20:27 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m proud that @POTUS included the Unlocking Possibilities Program in his plan – a program based on my bipartisan bill the Housing Supply and Affordability Act – to reduce barriers to affordable housing.","date":"Tue May 17 13:20:27 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"People are looking everywhere they can right now for baby formula - including online.\n \nIt makes no sense that WIC benefits can be used in brick &amp; mortar stores but not online. That's why I'm calling on USDA to open up WIC so benefits can be used online immediately. https://t.co/0XTvOuaY3g","date":"Mon May 16 17:00:01 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A disgusting act of hate, inspired by racist ideologies and facilitated by easy &amp; unfettered access to weapons of war. \n\nI pray for the victims &amp; their families - may we never forget their names. \n\nAnd I remain steadfast in my commitment to ending this violence in our country.","date":"Mon May 16 15:38:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"So proud to join @POTUS &amp; so many community leaders to help recognize this critical chapter of American history.","date":"Thu May 12 23:37:43 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our American spirit, history, &amp; heritage is one of being pioneers, entrepreneurs, &amp; innovators. \n\nRight now, we have a chance to write the next chapter of our history by passing a bill to protect our supply chains and enhance our economic competitiveness. \n\nLet's get it done. https://t.co/pgnw0YVFZD","date":"Thu May 12 15:39:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today’s a big day. I just sat down for the first meeting of what’s called a “conference committee” with members of the House &amp; Senate to negotiate a bill to secure our supply chains and increase America’s economic competitiveness. Let’s get to work. https://t.co/d0JQxxeJgj","date":"Thu May 12 14:37:05 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud that my bipartisan Tikes Act, which would increase the use of telehealth for our kids, was adopted as part of HR 7233.","date":"Wed May 11 18:40:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What an exciting day for Delaware - @JohnCarneyDE just signed SB 1 into law to create a statewide paid family &amp; medical leave insurance program so that families don't have to choose between their jobs and their health.","date":"Tue May 10 18:05:10 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Americans need access to affordable and reliable internet to learn, live, and work.\n\nTo see if you’re eligible for the Affordable Connectivity Program, go to https://t.co/D0eZcaiDeP.","date":"Tue May 10 17:20:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As @SecYellen says, access to reproductive healthcare gives women the freedom to plan their lives as they see fit and helps our economy thrive. \n\nWe must protect women's reproductive freedom.","date":"Tue May 10 16:00:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: @HRSAgov announced the launch of its Maternal Mental Health Hotline – a new, confidential, free hotline for moms and new parents seeking mental health resources.\n\nCall or text 1-833-9-HELP4MOMS (1-833-943-5746) for support.","date":"Mon May 09 20:25:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"For more information on how these projects will improve Delaware, click the link below ⬇️\n\nhttps://t.co/ifHpWDem0b","date":"Mon May 09 19:02:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to join @SenatorCarper &amp; @ChrisCoons today to announce over $5 million in federal funding for community projects for the Salvation Army, Jewish Family Services &amp; Westside Family Healthcare! https://t.co/tH8Az0Rj2d","date":"Mon May 09 19:02:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a #HappyMothersDay to my incredible mom, Alice, and to all the amazing moms and mother figures who raise, inspire, and guide us. \n\nHappy Mother’s Day! https://t.co/Kye5INfkbD","date":"Sun May 08 16:08:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I look forward to instituting this initiative across Delaware to increase transparency and accountability and improve our public safety.","date":"Fri May 06 19:05:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, @SenatorCarper, @ChrisCoons, @JohnCarneyDE &amp; I announced $4.2 million in federal funding to expand programs that will improve our community relations with police including equipping all law enforcement in Delaware with body-worn cameras. https://t.co/96cCffbpRd","date":"Fri May 06 19:05:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There is a maternal mortality health crisis in America &amp; it’s impacting Black moms at a higher rate.\n\nThat's why I introduced the #MomsMatterAct that makes real investments in community-based mental and behavioral health programs to help address this public health crisis.","date":"Fri May 06 17:20:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"During #NationalTeacherAppreciationWeek, we celebrate the dedicated educators that uplift the children in our communities.\n\nIt was a pleasure to meet the teachers &amp; staff of Rehoboth Elementary School this afternoon to say thank you for all they do. Hope you liked the donuts! https://t.co/GWDlDcjSKA","date":"Thu May 05 23:23:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations, Karine! 👏🏽","date":"Thu May 05 22:49:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's National #SmallBusinessWeek! Small businesses are the backbone of Delaware's economy, creating jobs and improving our communities.\n\nTo celebrate, I stopped by a few local small businesses in Lewes, DE including Biblion, Vintage Underground, &amp; Nectar Café &amp; Juice Bar! https://t.co/Ep5lPfi0UJ","date":"Wed May 04 21:24:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"These small businesses are women-owned and open today because of federal relief dollars.\n\nDon't forget to show your support for the small businesses in your area this week!","date":"Wed May 04 21:24:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I'm thinking of those 13 men and women, including my friend the late Honorable John Lewis, who took a stand against injustice and came together to fight for a better, fairer future without prejudice. \n\nWe must honor their fight and uplift their legacy.","date":"Wed May 04 20:27:10 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#OTD 61 years ago, 13 courageous young people known as the #FreedomRiders challenged segregation laws in interstate travel.","date":"Wed May 04 20:27:09 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to help lead this effort.","date":"Wed May 04 19:27:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"HORRIFYING! We need to federally codify Roe now. \n\nBut just as important, this is a DRAFT decision: abortion is still legal and it's still a right.","date":"Tue May 03 02:32:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As you can tell from this photo, it was a pleasure to host @EPAMichaelRegan in Delaware today! \n\nThank you, Administrator Regan, for all the work you're doing to protect our air, water, and public health. \n\nYou're welcome back to the First State anytime! https://t.co/9ZPnk4COH5","date":"Mon May 02 21:30:58 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And the third and final stop is the Christina River Force Main pumping station! This wastewater treatment plant run by @NCCDE is currently monitoring wastewater for COVID-19, a major step in helping protect our public health. https://t.co/x6IgMwItcn","date":"Mon May 02 20:26:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our second stop is the City of Wilmington’s Renewable Energy and Biosolids Facility where they’re using innovative technology to convert wastewater into energy! https://t.co/JAZj4Smu2k","date":"Mon May 02 17:02:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our first stop is the @Teenwarehouse1 in Wilmington to see its Vehicle-to-Grid (VTG) electric bus program! \n\nThe VTG teaches teens about electric vehicles like the bus we toured and helps us keep our air clean! https://t.co/n2i9kofzy8","date":"Mon May 02 16:03:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s a beautiful day here in Delaware for a visit from @EPAMichaelRegan!\n\nToday, @SenatorCarper, @ChrisCoons, and I are taking Administrator Regan for a tour of innovative, sustainable projects in the First State.\n\nFollow along to see our stops! https://t.co/TPM1uyXXZM","date":"Mon May 02 15:10:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to kick off this week by visiting Air Liquide with @ChrisCoons to hear about their work using clean energy sources like hydrogen to help us transition into a clean, green future. https://t.co/kwwnb7lbFE","date":"Mon May 02 14:13:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#EidMubarak! As the last day of Ramadan comes to a close, I hope those celebrating in Delaware and beyond have a safe and peaceful #EidAlFitr.","date":"Sun May 01 19:41:14 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS' intentions are clear - America stands with Ukraine and its courageous people. \n\nThat's why yesterday, the House passed the Ukraine Democracy Defense Lend-Lease Act to give President Biden the flexibility to deliver additional support, weapons, and equipment to Ukraine.","date":"Fri Apr 29 13:51:57 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud that my Helping Kids Cope Act and Moms Matter Act have been endorsed by @NewDemCoalition!\n\nBoth of these bills would help provide critical mental health services badly needed in the wake of the pandemic.","date":"Thu Apr 28 14:32:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Last year, Small Business Development Centers across the country helped create 71,399 jobs. That’s a new job every 7 minutes.\n\nYesterday, we passed @RepGolden’s #SBDC Improvement Act to expand the program and provide more support to small businesses in Delaware.","date":"Wed Apr 27 20:28:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #YomHaShoah, Holocaust Remembrance Day, we remember, honor, and mourn the over six million Jewish people and countless others murdered by the Nazi regime in one of the most atrocious acts of genocide ever witnessed by the world.","date":"Wed Apr 27 16:50:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today serves as a reminder for us all that we cannot let up in our fight against anti-Semitism, injustice, and hatred because the cost is unspeakable. #NeverAgain","date":"Wed Apr 27 16:50:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Job creation is key to our pandemic recovery. Since @POTUS took office, Delaware has added 11,500 jobs.\n\nLet's keep it going. #BuildingABetterAmerica https://t.co/KL9H6KHEHT","date":"Tue Apr 26 19:01:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The first but not the last. Congratulations, Jessica!","date":"Tue Apr 26 17:16:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Five years ago today, Delaware State Trooper Cpl. Stephen J. Ballard was killed in the line of duty. \n\nCpl. Ballard was a committed husband, father, and Trooper. I, and our entire state, are forever grateful for his life of service. May we never forget. https://t.co/G5yPfHFINT","date":"Tue Apr 26 15:34:27 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"RT if you agree!🌎#EarthDay https://t.co/0F2DbEteBf","date":"Fri Apr 22 20:30:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to World War II Ghost Army veteran James \"Tom\" Anderson who is the recipient of a Congressional Gold Medal. Delaware and the nation thank him for his remarkable service and sacrifice.","date":"Fri Apr 22 19:54:14 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to have a President that understands that the time to #ActOnClimate is now.","date":"Fri Apr 22 17:44:34 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thanks to everyone who sent in guesses! I hope you enjoyed learning about Delaware's natural beauty.\n\nAs we celebrate #EarthDay, let's remember the importance of working together to keep our communities safe and healthy for future generations.","date":"Fri Apr 22 16:53:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To those who guessed the @destatefair - you're correct! Like so many of you, I look forward to attending the State Fair every year.","date":"Fri Apr 22 16:34:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Finally, this spot in Harrington combines our state’s appreciation for agriculture, farming, and fun! \n\nCan anyone guess where I met this adorable rabbit at? https://t.co/ff2uNa6q9X","date":"Fri Apr 22 16:12:42 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This picture is of the Evolution Trail at @delmnh in Wilmington! \n\nBe sure to mark your calendars - the updated Delaware Museum of Nature &amp; Science will reopen to the public next month!","date":"Fri Apr 22 16:08:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Next up is a trail that opened in Wilmington in 2019. \n\nAt this spot, you can enjoy the sunshine with friends &amp; learn about major milestones in our earth’s history.\n\nCan you name this location? https://t.co/1lwEVj5Wlu","date":"Fri Apr 22 15:47:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Great guesses! This photo was taken at the Delaware Botanic Gardens, the only botanic garden in southern Delaware.","date":"Fri Apr 22 15:43:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@Delmarkva That's exactly right, Mark! This picture was taken at the beautiful Delaware Botanic Gardens in southern Delaware!","date":"Fri Apr 22 15:31:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"First up is an area in Dagsboro, DE that houses scenic gardens. \n\nIt’s a place to walk, bird-watch, and enjoy time outside! \n\nAny guesses as to what this location is? https://t.co/LxI3dhU338","date":"Fri Apr 22 15:20:44 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To celebrate #EarthDay this year, I’m sharing some photos of a few of my favorite places in Delaware that show off the First State’s natural beauty. \n\nFollow along and let me know how you'll be celebrating #EarthDay!","date":"Fri Apr 22 15:15:11 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #EarthDay! \n\nToday, we celebrate the planet we call home and recommit ourselves to protecting her as best we can – by coming together to work towards a clean &amp; green future for all! https://t.co/Odd4f9Px1x","date":"Fri Apr 22 15:15:11 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important update from @DEStateHousing ⬇️","date":"Fri Apr 22 00:03:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our economy added 7.9 million jobs since @POTUS took office – that’s more jobs created on average per month than under any other President in history. \n\nWe are #BuildingABetterAmerica.","date":"Thu Apr 21 17:27:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been 23 years since the Columbine school shooting.\n\nThis past weekend alone, there were 3 mass shootings.\n\nIt's time to #EndGunViolence in America.","date":"Wed Apr 20 18:49:43 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That's why I introduced the Reconnecting Communities Act with @RepDwightEvans last year to address these issues &amp; invest in reconnecting those neighborhoods impacted by interstate construction.","date":"Wed Apr 20 15:49:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My family moved to the City of Wilmington in 1969, just a few years after the completion of I-95. \n\nThe impact of the interstate cutting through the heart of the city was evident back then – and these problems are still present today.\n\nhttps://t.co/nzRiAvsDQX","date":"Wed Apr 20 15:49:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The impact of climate change on our communities cannot be ignored. \n\nBy restoring these key environmental protections, @POTUS is prioritizing the need to maintain an environmental review process for federal projects across the country.","date":"Tue Apr 19 20:29:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#FairHousing means ensuring that everyone, no matter who they are, has access to safe, decent, and affordable housing so that they can thrive. #FairHousingMonth","date":"Tue Apr 19 17:15:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In April 1968, President Johnson signed the #FairHousingAct into law to prohibit housing discrimination. \n\nThis #FairHousingMonth, we remember how far we’ve come and recommit ourselves to the work ahead to ensure housing equality for all. https://t.co/K6vT7R3I5H","date":"Tue Apr 19 16:15:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I join Delaware as we mourn the loss of former Delaware Education Secretary Lillian Lowery. \n\nA woman of passion, persistence, and patience, she never lost sight of what was most important - making sure Delaware's kids got the education they deserved.\n\nhttps://t.co/vpF8CIEFbB","date":"Mon Apr 18 16:05:43 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And just like that - it's #TaxDay!\n\nToday is the filing deadline, but if you need more time to complete your return, that's ok! \n\nFor more information on filing, go to https://t.co/QE2yLx633V.","date":"Mon Apr 18 14:03:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a happy, healthy, and peaceful #Easter to all who are celebrating today! https://t.co/GqEWLfiPeD","date":"Sun Apr 17 13:33:03 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy first day of #NationalParksWeek! Today, all entrance fees at our national parks are waived!\n\nIt’s a great opportunity to get outside &amp; enjoy our country’s diverse parks like Delaware’s sole national park - First State National Historic Park! https://t.co/2Gkk0SIuPS","date":"Sat Apr 16 16:33:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #Passover to all those celebrating in Delaware and beyond! Wishing you a joyful meal with those you love. \n\nChag Sameach! https://t.co/ZiJ96IQPts","date":"Fri Apr 15 22:05:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A reminder that the tax filing deadline is this Monday, April 18! 🗓️\n\nFor more info &amp; resources to assist with filing, go to https://t.co/RlZNT7EJrr.","date":"Fri Apr 15 21:35:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a peaceful and meaningful Good Friday to all those observing in Delaware and across the world. https://t.co/eEkxFNDQCs","date":"Fri Apr 15 17:36:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Access to safe &amp; clean drinking water is foundational to our well-being, environment, and public health.\n\nProud to join @RepRashida and @RepDebDingell as Co-Chairs of the Get the Lead Out Caucus where we'll work to deliver lead service line replacements in our communities.","date":"Tue Apr 12 21:38:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Cape-May Lewes Ferry has played a key part in Delaware's identity &amp; tourism engine for years. \n\nThe $600,000 federal grant from the Bipartisan Infrastructure Law will allow the Delaware River &amp; Bay Authority to take our ferry system to the next level.\n\nhttps://t.co/Pz2kOMd1dr","date":"Tue Apr 12 15:39:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #Momnibus Act includes parts of my bill, the Moms Matter Act, which supports moms with maternal health conditions and substance use orders.\n\nCongress must come together to find solutions to this crisis and protect Black mothers across the country. (3/3)","date":"Mon Apr 11 19:58:29 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As a member of the @BMHCaucus, I'm a proud champion of legislation like the #Momnibus Act that aims to end these health disparities, advance birth equity, and save moms' lives. (2/3)","date":"Mon Apr 11 19:58:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Black women are 3x as likely to die from pregnancy-related complications as white women.\n\nLet that sink in.\n\nThat's why #BlackMaternalHealthWeek is so important - because it brings awareness to &amp; advocacy for the maternal health crisis among Black women in our country. 🧵(1/3)","date":"Mon Apr 11 19:58:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This morning, after a routine test, I tested positive for COVID.\n \nI’m grateful to be vaccinated and boosted and am experiencing very mild symptoms. I will be isolating and following CDC guidance on COVID protocols.\n \nI encourage everyone to get vaccinated if you haven’t already!","date":"Fri Apr 08 15:47:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Justice Jackson &amp; Vice President Harris 👏🏽","date":"Thu Apr 07 21:52:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"How it started vs. How it's going\n\n📸@NewYorker; @POTUS https://t.co/gdtlwtCcUi","date":"Thu Apr 07 19:51:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My dad once wrote me this note - \"You become what you see, unless you see what you want to become.\" \n\nToday - because of Ketanji Brown Jackson - millions of Black girls all across America will look to the highest court in our land and will know what they can become. https://t.co/ZVmF8wU7Xv","date":"Thu Apr 07 18:19:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today's the day. \n\nJudge Ketanji Brown Jackson \n⤵️\nJustice Ketanji Brown Jackson","date":"Thu Apr 07 14:04:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware's restaurants &amp; small businesses keep our local economy going.\n\nI'll be proud to vote today to pass H.R. 3807, Relief for Restaurants &amp; Other Hard Hit Small Businesses Act to replenish the Restaurant Revitalization Fund &amp; create a Hard Hit Industries Award Program.","date":"Thu Apr 07 13:39:05 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Starting tomorrow, April 7, Delaware's local Social Security offices will resume in-person appointments. \n\nYou can make an appointment online here: https://t.co/w7Xqmpkmyz","date":"Wed Apr 06 18:30:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, Delaware says goodbye to a public servant, leader, educator, and real-life superhero - Dr. Terrance Newton.   \n\nHe once said of his students, “when I see them - I see me. So, my goal is to change the world.” \n\nIndeed - Dr. Newton - you did. https://t.co/hjIeRFZiV2","date":"Wed Apr 06 15:54:44 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans are paying more at the pump every day while oil companies rake in record profits. \n\nToday, I'll be joining @RepDianaDeGette for this critically important @EnergyCommerce hearing.","date":"Wed Apr 06 12:49:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I met Kelly in February when @JohnCarneyDE announced $40 million from the #AmericanRescuePlan Act that will be invested in 9 of Delaware's libraries across the state.\n\nThese funds will make our libraries and communities stronger and will inspire a new generation of librarians.","date":"Tue Apr 05 19:31:16 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #NationalLibraryWeek and #LibraryWorkersDay!\n\nHere in Delaware, we're so grateful for all of the library workers who dedicate their time to helping our kids learn &amp; grow, like Selbyville Public Library's Director Kelly Kline, who now runs her childhood library! https://t.co/VJFPPBxKXv","date":"Tue Apr 05 19:31:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You never know which Delawarean you’ll run into at the @WhiteHouse! Proud to join @SenatorCarper - one of the key legislators in getting the #ACA across the finish line - as we celebrate the expansion and strengthening of the law, today. https://t.co/bRfaPvWGLs","date":"Tue Apr 05 18:16:08 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I've had constituents write to my office about the hardships their families are facing because they can't afford coverage because of this unintended consequence. \n\nWell, today, that changes.","date":"Tue Apr 05 17:26:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Now, 200,000 uninsured Americans will have access to coverage and 1 million Americans will be able to buy plans they can afford. \n\n@POTUS is continuing his fight to secure affordable health care for all Americans. I'm proud to join him in that fight.","date":"Tue Apr 05 17:26:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm heading to the @WhiteHouse to join @POTUS, @VP, &amp; @BarackObama to celebrate the impact of the #ACA and expand its benefits by closing what's known as the \"family glitch.\"","date":"Tue Apr 05 17:26:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's clear that Judge Ketanji Brown Jackson is capable, qualified, and ready to sit on the highest court in the land.\n\nLet's make history by turning Judge Brown Jackson into Justice Brown Jackson. https://t.co/DOeAH9Ffth","date":"Mon Apr 04 20:35:02 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"54 years ago today, we lost Dr. Martin Luther King, Jr., one of the staunchest civil rights advocates in history. \n\nToday, we're reminded of the world he hoped and fought for, and recommit ourselves to live by his example to bring forward full equality and justice for all.","date":"Mon Apr 04 19:10:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I joined @Incyte for the official ribbon - cutting for their newest building at their headquarters in Wilmington. \n\nThis building will propel Incyte into a new chapter of research and development of life-saving drugs for cancer and rare diseases. https://t.co/ZVzT0w5O6h","date":"Mon Apr 04 17:50:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To the Muslim community in Delaware and beyond - #RamadanMubarak! I’m wishing you a month of peace and blessings. https://t.co/m2uyr5t9zh","date":"Sat Apr 02 23:48:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was my honor to join @POTUS, @FLOTUS, @SenatorCarper, @ChrisCoons, &amp; @JohnCarneyDE for today’s commemorative commissioning ceremony of the USS Delaware!  \n\nMay the First State’s name bring her officers and crew safety, strength, and skill on all missions ahead of them. https://t.co/JDmVTiHaCr","date":"Sat Apr 02 20:27:31 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today’s #JobsData shows that unemployment dropped to 3.6% — exceeding expectations — and falling to the lowest level since before the pandemic.\n \n@POTUS' plan to build a better America is working.","date":"Fri Apr 01 19:53:16 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AffordableInsulinNow Act caps the cost of insulin at no more than $35/per month ensuring affordable access to this life-saving medication for the over 37 million Americans living with diabetes.\n\nLooking forward to joining my House colleagues to pass this vital bill today.","date":"Thu Mar 31 19:42:57 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, on #TransDayofVisibility, we celebrate the contributions, courage, and resilience of the transgender community.\n\nAs a member of the @LGBTEqCaucus, I remain committed to standing with transgender Americans and will continue to fight against all kinds of discrimination. https://t.co/yM1GlAStsn","date":"Thu Mar 31 14:28:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I'm at the @WhiteHouse for @POTUS'  historic signing of the Emmett Till #AntiLynchingAct. \n\nAfter nearly a century of effort - today, this bill becomes law.\n\nHere's what the bill does - and why it's so important. https://t.co/34SWsLlRIA","date":"Tue Mar 29 20:36:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Investing in mental health care for our children who have dealt with so much in recent years is critically important.\n\nThat’s why I’m proud to introduce the Strengthen Kids’ Mental Health Now Act with @RepAnnaEshoo &amp; @RepBrianFitz so we can give our kids the resources they need.","date":"Tue Mar 29 19:27:14 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Interested in learning how a congressional office works? You're in luck! \n\nI'm now accepting summer internship applications for my Washington, DC office and both of my Delaware offices! \n\nThe application deadline is April 9. For more info, click below ⬇️\nhttps://t.co/6Lli1yEsu1 https://t.co/esD1q3RrIX","date":"Tue Mar 29 15:15:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The members of the @DelawareNG serve, protect, and deliver for us every day. \n\nWell, today, alongside @SenatorCarper &amp; @ChrisCoons, we got to deliver the Guard $17.5 million for a badly-needed fuel cell hangar. https://t.co/do3RYfCCzL","date":"Mon Mar 28 22:34:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🇺🇸 🇺🇦","date":"Sat Mar 26 18:05:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was great to join @SenatorCarper at the Cape May - Lewes Ferry Terminal to celebrate a $600,000 grant for the Delaware River and Bay Authority to support their master plan to modernize the Terminal’s ferries! This is great news for Delaware’s economy, tourism, and well-being. https://t.co/SbIhNBbErD","date":"Fri Mar 25 15:31:55 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"12 years after its passage, this lifesaving and life changing law continues to help tens of thousands of Delawareans signup for affordable healthcare each year. I’m committed as ever to lowering health care costs and expanding access in Delaware and across the country.","date":"Fri Mar 25 01:22:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To celebrate the 12th anniversary of the #AffordableCareAct, I participated in a roundtable today with @westsidehealth, @hhsregion3 Acting Regional Director, Melissa Herd &amp; @HRSAgov Regional Director, Leah Suter. https://t.co/IazZSiZ9UO","date":"Fri Mar 25 01:22:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What a truly profound loss. Secretary Albright was a trailblazer in every sense of the word and her contributions to U.S. foreign policy will continue to make a positive impact on the world for generations to come. https://t.co/mOjOMMLfhi","date":"Wed Mar 23 18:58:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I joined SBA Delaware Director Michelle Harris this morning for a visit to the Juice Joint, a Black woman-owned small business in Wilmington, to celebrate #WomensHistoryMonth!\n\nThey received Restaurant Revitalization Funds which helped them open during the pandemic. https://t.co/yQsJn9dvlS","date":"Wed Mar 23 17:42:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s always important that we support our small business owners, especially our women small business owners and entrepreneurs in the First State!","date":"Wed Mar 23 17:42:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"These waivers provide schools the flexibility they need to ensure that students aren't going to class hungry - but they expire at the end of this school year. \n\nThat's why I've been working in Washington to ensure that we extend them as soon as possible.","date":"Wed Mar 23 15:07:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Joining leaders from @USDA &amp; @ColonialSDstrct this morning to discuss the importance of Congress extending waivers that schools have been using throughout the pandemic to feed our students. https://t.co/Wew3W3UXoi","date":"Wed Mar 23 15:07:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #AgDay, Delaware!\n\nThe importance of Delaware's agriculture community cannot be overstated. Thank you to the farmers, producers, and workers for making our state a healthier place to be! https://t.co/ilIsKLNK80","date":"Tue Mar 22 19:45:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My heart is broken by the passing of Dr. Terrance Newton. You didn't need to look far to see his impact - and acts of grace and kindness like this were so very common - but it's those acts people never saw that made all the difference.","date":"Tue Mar 22 13:31:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to be at today’s historic confirmation hearing. #SheWillRise","date":"Mon Mar 21 19:26:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Capable. Qualified. Ready. https://t.co/PgbBfSIzMY","date":"Mon Mar 21 14:11:55 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Gametime! Let's go Hens!!!\n\n@DelawareMBB @UDelaware #MarchMadness https://t.co/JsY1K5eNTN","date":"Fri Mar 18 18:49:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today's the day! \n\nGo Hens Go! @UDelaware #MarchMadness https://t.co/IsL1MQ4AgA","date":"Fri Mar 18 16:58:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations, Rita, on this exciting nomination from @POTUS! #Delaproud","date":"Fri Mar 18 16:18:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Black women and girls should be allowed to wear their natural hair with pride &amp; without fear of discrimination. It's a shared experience we know all too well.\n\nThat's why I was proud to vote for the #CROWNAct to bring us one step closer to ending race-based hair discrimination. https://t.co/PqelN3Osi6","date":"Fri Mar 18 15:31:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And we're funding a mobile health clinic with $350,000 to address health disparities in Sussex County through TidalHealth Nanticoke. (9/9) https://t.co/9GdfHRC1xN","date":"Thu Mar 17 21:12:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're keeping Delaware healthy investing $275,000 in telehealth access in libraries in rural and underserved communities in Delaware. (8/9) https://t.co/xJl67xxtbN","date":"Thu Mar 17 21:11:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're fostering economic development with $1 million for a new center at @DelStateUniv to promote small businesses incubators in Kent County. (7/9) https://t.co/Cwzugq2UsA","date":"Thu Mar 17 21:11:57 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And we secured $1.6 million to ensure that every law officer in Delaware will have a body-worn camera. (6/9) https://t.co/lqTwnbEflA","date":"Thu Mar 17 21:11:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're working to keep our communities safe with $1.9 million for statewide evidence-based violence intervention programs. (5/9) https://t.co/6ke5dFgcJ8","date":"Thu Mar 17 21:11:55 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're supporting Delaware's agriculture with $937,500 for a new Agricultural Programming building at the Delaware State Fair in Harrington. (4/9) https://t.co/ymbCvLNwBC","date":"Thu Mar 17 21:11:54 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're preserving our shared history with $100,000 for repairs to the historic Richard Allen School in Georgetown. (3/9) https://t.co/KJIh4ByKDm","date":"Thu Mar 17 21:11:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're investing $17.5 million in the @DelawareNG to get a new fuel cell and corrosion hangar in New Castle. (2/9) https://t.co/6Op0ovYMLv","date":"Thu Mar 17 21:11:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The spending bill @POTUS signed into law this week includes nearly $100 million in funding for Delaware projects, including $23,662,500 for Community Project Funding for 2022.\n\nI was proud to secure funding for these 8 specific projects that will improve Delaware. 🧵 (1/9) https://t.co/GFCzK6pR3b","date":"Thu Mar 17 21:11:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy St. Patrick's Day! 🍀 https://t.co/8WsviuXFIB","date":"Thu Mar 17 16:25:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Supply chain disruptions have impacted every corner of our economy. \n\nThat's why I've been working on legislation to strengthen our supply chains while creating good-paying jobs in the process. \n\nIt's simple. If we can make it in America - we should. https://t.co/Q87el0pZB1","date":"Thu Mar 17 14:56:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Such a kind and brilliant man. Sending my thoughts to Justice Holland’s family and friends during this difficult time as I reflect on his remarkable service to our state.","date":"Thu Mar 17 01:08:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"HAPPENING NOW ⬇️⬇️\n\nhttps://t.co/3lADHs5tId","date":"Wed Mar 16 15:06:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Humbling and inspiring to hear from @ZelenskyyUa this morning. He and all of the Ukrainian people are frontline fighters for democracy.\n\nWe stand united with Ukraine and her people 🇺🇦 https://t.co/jF48WwCQgA","date":"Wed Mar 16 14:07:58 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was wonderful to spend time at the @WhiteHouse this evening for a #WomensHistoryMonth event with fellow Delaware trailblazers @KathyJenningsDE &amp; @bethanyhalllong https://t.co/6TQcXuQL4g","date":"Tue Mar 15 23:05:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is late Justice Ruth Bader Ginsburg's birthday.\n\nLet's continue to build on her major contributions to our country - on and off the bench. #WomensHistoryMonth https://t.co/6RqLtClPwj","date":"Tue Mar 15 23:05:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The tax filing deadline is approaching! 🗓️\n\nI'm hosting a tax filing information session with special guests from the IRS and Delaware Taxpayer Advocate tomorrow, March 16th at 11:00 am! They'll provide useful tips for this filing season.\n\nJoin us here➡️ https://t.co/iHKIusu8FR https://t.co/nDVqENw21W","date":"Tue Mar 15 21:28:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"STARTING NOW: Join me and local Delaware stakeholders for a virtual event to discuss the supply chain provisions in the #AmericaCOMPETES Act that I worked to secure.\n\nYou can watch here⬇️\nhttps://t.co/RlOStBKCrZ","date":"Tue Mar 15 17:04:20 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨ICYMI: I'm hosting a virtual conversation TOMORROW, March 15th at 1:00 pm to discuss our supply chain &amp; my bipartisan provision in the #AmericaCOMPETES Act. \n\nI'll be joined by local Delaware endorsers of my provision. I'd love to see you there⬇️\nhttps://t.co/D1g42M8Hzv","date":"Mon Mar 14 21:30:00 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Clean energy = cost savings\n\nAs @POTUS said in #SOTU, families will save $500/year on their energy costs through investments &amp; tax credits passed by the House. \n\nProud to join 89 House Democrats to call on @POTUS to lead a #ClimateRestart to reconciliation negotiations. https://t.co/qWJXlRE48T","date":"Mon Mar 14 18:53:57 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Hey @JohnCarneyDE, @ChrisCoons, @SenatorCarper  - in for a little #MarchMadness bracket challenge? \n\nI've got mine filled out already. #RollHens https://t.co/FK8lFGXvoI","date":"Mon Mar 14 13:47:44 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And @DelawareWBB is on to the big dance!!! #BlueHens #CAAChamps","date":"Sun Mar 13 19:07:30 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Next Tuesday, March 15th at 1:00 pm, I'm hosting a virtual conversation on our supply chain &amp; the #AmericaCOMPETES Act - including my bipartisan provision which will help create American jobs and lower the price of goods! \n\nWatch live next Tuesday at https://t.co/D1g42M8Hzv https://t.co/MOw931SaVD","date":"Fri Mar 11 21:23:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Chief Pridemore's dedication to protecting Delawareans was invaluable to our state. \n\nMay his legacy live on in all those lucky enough to have known him. \n\nhttps://t.co/PGml57dG06","date":"Fri Mar 11 20:59:39 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been one year since Congress sent the #AmericanRescuePlan Act to @POTUS' desk providing pandemic relief to the American people.\n\nEven after a year, the ARP continues to help improve our communities in Delaware and across the country recover, rebuild, and restore. https://t.co/oZvUrHXvXD","date":"Fri Mar 11 17:18:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Last night, I was proud to vote for the passage of the Omnibus Appropriations package that will:\n\n⬇️Lower the cost of living for families\n💼Create good-paying American jobs\n☀️Tackle the climate crisis head-on\n🇺🇦 Send aid to Ukraine\n🏘️Fund community-based projects in Delaware https://t.co/phXzRoCEFL","date":"Thu Mar 10 17:33:53 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Late night on the floor of the House but important work being done. \n\nJust voted to bring nearly $100 million in community projects to Delaware. \n\nAbout to vote to ban Russian oil imports to the U.S.","date":"Thu Mar 10 04:21:58 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We’ll see you in the tournament! #BlueHens","date":"Wed Mar 09 02:14:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"HBCUs, like @DelStateUniv, have always been agents of equity, access, and excellence in education, especially for Black students. \n\nI’m proud to support H. Con. Res. 70, which condemns the despicable, cowardly bomb threats to HBCUs. #HBCUStrong https://t.co/0JgFeIqiV0","date":"Tue Mar 08 18:29:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #InternationalWomensDay, we recognize the incredible women across the globe who work tirelessly to improve our world. Let's celebrate the progress made \n - and stay focused on the work still to be done. https://t.co/68UY6AEb5D","date":"Tue Mar 08 16:37:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Nine years ago today, President Obama signed the last comprehensive reauthorization of the #ViolenceAgainstWomenAct into law. \n\nThe time is now for Congress to reauthorize this life-saving law.","date":"Tue Mar 08 00:01:57 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I still think so often about my friend and hero, Representative John Lewis. \n\nMay his example, and the example of all those who so bravely and boldly marched over that bridge, serve as inspiration and motivation for us all.","date":"Mon Mar 07 23:06:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: Delaware received over $123 million for 15 of its colleges and universities because of the #AmericanRescuePlan! \n\nThese funds are vital to supporting Delaware’s students, colleges and universities recover from the pandemic. \n\nhttps://t.co/hATNtBQliT","date":"Mon Mar 07 21:47:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans can now order a second round of four free at-home COVID tests thanks to @POTUS.\n\nGet yours today!⬇️\n\nhttps://t.co/aZaYZdg38B","date":"Mon Mar 07 21:29:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reauthorizing this program ensures that we can continue to invest in our environment, our health, and our future.","date":"Mon Mar 07 20:27:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is an exciting day - I'm introducing the Delaware River Basin Conservation Act w/ @SenatorCarper and @ChrisCoons to reauthorize the Delaware River Basin Restoration Program! \n\nThis bill will help Delaware conserve our rich natural heritage like Thousand Acre Marsh⬇️ https://t.co/K28ehMXKbS","date":"Mon Mar 07 20:27:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"For those who want to learn more about @POTUS' nominee to the Supreme Court - I hope you'll take a few minutes to learn about Judge Ketanji Brown Jackson 👇🏽","date":"Mon Mar 07 14:50:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this #WorldWildlifeDay, I'm thinking about the incredible horseshoe crab, native to Delaware. They are critical to our ecosystem - but their habitat is being threatened by eroding coastlines. That's why we must do all we can to fight the climate crisis. \n\n 📸 | @DelawareDNREC https://t.co/Oum8ujJzad","date":"Thu Mar 03 20:10:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today's a big day in Congress. \n\nFor decades, a committed group of veterans has been fighting to ensure vets exposed to toxic substances have the resources and health care they need. \n\nToday, we'll pass the Honor our Pact Act to do just that.","date":"Thu Mar 03 14:36:02 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Securing our supply chains is about creating good-paying union jobs, protecting our national security, and ultimately, protecting the pocketbooks of Americans. \n\n#AmericaCOMPETESAct https://t.co/hHIoFOwFKO","date":"Wed Mar 02 22:21:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What can I say - I'm passionate about fighting for cleaner air, lowering energy costs, restoring our beaches, and tackling climate change. \n\nSo proud to have received a 100% score on @LCVoters' 2021 #LCVScorecard. Aiming for a perfect score again in 2022! https://t.co/Z5Cto2i8MN","date":"Wed Mar 02 21:13:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thanks, @ChrisCoons for sharing this picture of us at @POTUS' #SOTU last night. \n\nAs you can tell from the photo, we're both excited and energized to build a better America together. https://t.co/4CjImVQFSd","date":"Wed Mar 02 18:55:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Well, that's it from us here at #TeamLBR! It was a great and powerful #SOTU22 from @POTUS . \n\nWe enjoyed getting the chance to take over the Twitter account for the night - but we'll hand it back to the boss in the morning! \n\n#LBRatSOTU | #SOTU2022 https://t.co/BWlNoImYPJ","date":"Wed Mar 02 03:31:54 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Curing cancer is personal for all of us. With a national vision and unity - we can end cancer as we know it. #CancerMoonshot \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 03:08:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Caring for our veterans is personal for @POTUS. All Delawareans still carry Beau Biden in our hearts. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 03:05:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Worried about the impact that social media has on our children? \n\nLBR has a bill for that! \n\nWorking with @MarkWarner, LBR  has introduced the DETOUR Act to ban deceptive social media practices known as dark patterns. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 03:03:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We hear too much about the things that divide us - there are still many issues that unite us. \n\n#TeamLBR is excited to hear about the Unity Agenda that @POTUS is rolling out tonight - starting with combatting the opioid addiction. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 03:02:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"Tonight. I call on the Senate to: Pass the Freedom to Vote Act. Pass the John Lewis Voting Rights Act.\" \n\nIt's on Congress to protect the fundamental right to vote. Let's get it done. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:57:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Another touching moment at #SOTU2022 as @POTUS pays tribute to retiring Justice Stephen Breyer. \n\n #LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:57:14 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS \"Trusted messengers breaking the cycle of violence and trauma and giving young people hope.\"\n\nLBR has a bill for that too! Working with @RepHorsford we've worked to introduce legislation to break the cycle of violence in our communities. \n\n  #LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:54:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My virtual guest tonight for the #SOTU is Ebon Flagg, a small business owner from Delaware City who I partnered with last year to host a COVID-19 vaccination event because #vaccinessavelives!\n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:51:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The program just announced by @POTUS, to test and treat #COVID is a great new tool in our arsenal to fight this virus. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:48:48 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"Let’s pass the Paycheck Fairness Act and paid leave. Raise the minimum wage to $15 an hour and extend the Child Tax Credit, so no one has to raise a family in poverty.\" \n\nYes, Yes, Yes, and Yes!\n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:46:05 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS knows what he's talking about when it comes to cracking down on fraud and abuse. He did it with the Recovery Act and he'll do it with pandemic relief. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:44:42 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS just talked about the importance of lowering energy costs by weatherizing buildings. \n\nLBR has a bill for that! Working with @SenTinaSmith, we've introduced the Open Back Better Act to incentivize weatherizing public buildings. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:39:07 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Kids like Joshua should never have to wonder if their families can afford life-saving drugs like insulin. We're going to keep fighting for him by working to cap the cost of insulin. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:36:27 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@steelworkers  like JoJo help power our productivity. They're the backbone of our economy and we need them. \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:32:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You know it, @RepTerriSewell 🙌","date":"Wed Mar 02 02:29:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS is now talking about the #AmericaCOMPETESAct - a huge priority for LBR. \n\nWe've been working to make sure that if we can make it in America - we do. It'll help secure our supply chains and lower the price of consumer goods.","date":"Wed Mar 02 02:29:24 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"@VP and I ran for office with a new economic vision for America. \n  \nInvest in America. Educate Americans. Grow the workforce. Build the economy from the bottom up  \nand the middle out, not from the top down.\"\n\n #LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:25:09 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"He will never extinguish their love of freedom. He will never weaken the resolve of the free world.\"\n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:22:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"He thought the West and NATO wouldn’t respond. And he thought he could divide us at home. Putin was wrong. We were ready.\"\n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:15:01 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"An incredibly touching moment at the beginning of #SOTU2022 to let the world know that the U.S. stands with Ukraine 🇺🇦\n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:12:53 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS is here! \n\n#LBRatSOTU | #SOTU2022","date":"Wed Mar 02 02:09:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@FLOTUS knows how to make an entrance! #SOTU2022","date":"Wed Mar 02 02:03:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're also excited that LBR will be part of what's called the \"escort committee\" which means that she'll walk @POTUS into the House chamber as a representative for @HouseDemocrats. \n\nSo keep an eye out for her as @POTUS is shaking hands as he walks in! \n\n#LBRatSOTU","date":"Wed Mar 02 01:53:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Also, in case you're looking out for #LBRatSOTU tonight, she'll be sitting toward the center aisle in the turquoise suit! https://t.co/pHUgwAtp4a","date":"Wed Mar 02 01:51:53 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"LBR has bills and priorities in each of these areas and we're excited to see what @POTUS has to say about those issues and more tonight during the #SOTU2022","date":"Wed Mar 02 01:46:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As I'm sure you can imagine - there's a lot in common between LBR's agenda and @POTUS's agenda - but there are a few things we're on the lookout for tonight:\n\n1. Talking about mental health in the wake of #COVID\n2. The Climate Crisis \n3. Securing American supply chains","date":"Wed Mar 02 01:45:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Hey Delaware 👋\n\n#TeamLBR here. The Congresswoman is heading down to the floor to watch @POTUS's first #SOTU. \n\nWe'll be tweeting live at #LBRatSOTU throughout the night to highlight the work that LBR has done connected to the President's agenda. Follow along!","date":"Wed Mar 02 01:16:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you, Ebon, for your contributions to Delaware's small business community, local economy, and vaccination efforts!","date":"Tue Mar 01 23:40:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Overjoyed to have Delaware #HometownHero Ebon Flagg as my virtual guest for @POTUS' #SOTU tonight. \n\nLast year, I co-hosted a COVID-19 vaccination event at Ebon's salon, Babe Styling Studio in Wilmington, to help members of the Wilmington community access the COVID-19 vaccine. https://t.co/IgS1LWANHf","date":"Tue Mar 01 23:40:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to stand alongside my Democratic &amp; Republican colleagues to say with a unified voice - \n\nWe stand with Ukraine 🇺🇦 https://t.co/leboZ0WAMu","date":"Tue Mar 01 20:55:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Cateo's poise, prose, and positivity were on full display yesterday. I can't wait to see him bring those talents to @DelStateUniv in the fall! \n\n#HornetsRising","date":"Tue Mar 01 17:00:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Fact: when women succeed, America succeeds.\n\nToday marks the start of #WomensHistoryMonth, a moment for us to remember the courageous and capable women across generations who made our nation better. Let's honor their legacies by continuing the fight for gender equality &amp; justice. https://t.co/5DHSZwbKQ9","date":"Tue Mar 01 16:52:58 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As #BlackHistoryMonth comes to a close, we're reminded that Black history is all around us.\n\nIn Delaware, there are ways to reflect on Black history beyond just the month of February - like viewing \"Segregated Sands,\" an online exhibit at the Zwaanendael Museum in Lewes ⬇️ https://t.co/VRQnrbshTB","date":"Tue Mar 01 00:38:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With attempts to undermine the #CleanAirAct through lawsuits, it’s imperative we support the EPA's ability to cut pollution and protect Americans from greenhouse gasses.\n\nProud to join 190+ Congressional Democrats to support clean air for all Americans.\nhttps://t.co/g8LzpNaGmz","date":"Mon Feb 28 16:43:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Grateful to be with @DelStateUniv this morning to celebrate their return to Wilmington with a new building on the Riverfront. What a proud moment for Delaware's HBCU! \n\nThis expansion will leave a lasting footprint on generations of Delawareans. #HornetsRising https://t.co/u3LgBGym5S","date":"Fri Feb 25 18:26:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"2 years ago, to the day, I sat in the audience and felt an enormous sense of pride when then-candidate Biden announced he would nominate a Black Woman to the Supreme Court. \n\nToday, that feeling is only amplified. I am very much looking forward to JUSTICE Ketanji Brown Jackson.","date":"Fri Feb 25 15:28:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Judge Jackson is a brilliant jurist and as well-qualified as any potential nominee. She has the kind of knowledge and lived experience that will serve all of us so well on the land's highest court.","date":"Fri Feb 25 15:28:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Truly remarkable and inspiring bravery.","date":"Thu Feb 24 20:33:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I stand firmly with the people of Ukraine. \n\nThrough the tools we have at our disposal as the U.S. government, and with our NATO allies, we must send a clear signal to Putin that these flagrant acts of war will not be tolerated. https://t.co/W8rmVVFI3V","date":"Thu Feb 24 15:13:42 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My prayers, and I know the prayers of so many across America, are with the Ukrainian people.","date":"Thu Feb 24 03:48:11 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to join @SenatorCarper in Bethany Beach today for his @EPWCmte Field Hearing on protecting our coastlines. Click here to watch live ➡️ https://t.co/hA1FyfbBCL https://t.co/qEpk1CWPyv","date":"Wed Feb 23 15:12:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Paul's story is just like the story of so many other Americans. I hope you'll take some time to hear from him directly about why the #CleanSlateAct is so important.","date":"Tue Feb 15 18:24:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To you, from me - #HappyValentinesDay!💘💘\n\n#PassBuildBackBetter https://t.co/6TMMH8eMQa","date":"Mon Feb 14 19:07:11 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm joining @ITI_TechTweets this afternoon for a conversation on the Future of Work and strengthening &amp; diversifying our workforce. Tune in! \nhttps://t.co/LdvztdmAXa","date":"Mon Feb 14 18:01:18 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I join the Parkland community in remembering the 17 lives lost four years ago at Marjory Stoneman Douglas High School. \n\nMay their memory never be forgotten as we continue fighting to keep our communities safe from gun violence. #MSDStrong https://t.co/31XvBmxxp9","date":"Mon Feb 14 17:19:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A stop in Ellendale means a stop at the Southern Grille!\n\nClean water tour ✅\nBeautiful weather ✅\nDelicious lunch ✅ https://t.co/XpBMtzxSyA","date":"Fri Feb 11 18:48:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Joining the Southeast Rural Community Assistance Project this morning for an update on water quality in Ellendale. Communities across Delaware are benefiting from the investments made in the #BipartisanInfrastructureLaw https://t.co/FhEOXGjIMS","date":"Fri Feb 11 17:40:34 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to join @SenatorCarper in intro’ing this critically important bipartisan bill!","date":"Fri Feb 11 16:25:18 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is a great day! @USDOTFHWA announced that Delaware is receiving $2 million in 2022 from the Bipartisan Infrastructure Law to build EV charging infrastructure and create good-paying, union jobs!🚗⚡️#ElectrifyingAmerica https://t.co/StZxhSX6hO","date":"Thu Feb 10 20:43:35 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I can’t thank you all enough for the birthday wishes. I’ve been remarkably blessed in my 60 years on this earth and remain blessed to represent Delaware in Congress. And as I celebrate today, I know that the best days lie ahead. ❤️ https://t.co/DaHzjLWrrg","date":"Thu Feb 10 19:11:19 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to vote for @davidcicilline's #GlobalRespectAct today. Passing this bill sends a clear message to the LGBTQI+ community at home &amp; abroad: atrocious acts of violence against you will not be tolerated – we stand with you. https://t.co/LwkCRzXwqn","date":"Wed Feb 09 18:14:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The @USPS delivers life-saving medications, urgent packages, and much more to Delawareans and Americans across the country. \n\nTonight, I'll vote YES on the #PostalServiceReformAct to ensure the Postal Service can continue operating for years to come.","date":"Tue Feb 08 21:54:24 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #SaferInternetDay, I join @RepSusanWild in calling for safer internet content &amp; practices. Large tech &amp; social media companies have a responsibility to protect children and unsuspecting Americans from harmful content &amp; practices. That's why Congress should pass my DETOUR Act⤵️ https://t.co/gKue4PbdGq","date":"Tue Feb 08 19:18:29 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending my prayers to the entire Little Creek community. \n\nDelaware truly is a state of neighbors - and all of us are with you during this incredibly difficult and trying time. ❤️ https://t.co/zJFApiAvZL","date":"Tue Feb 08 15:22:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericanRescuePlan continues to help Delaware's communities recover, rebuild, and restore from this pandemic. These federal grant dollars will be instrumental in helping arts organizations open their doors once again to entertain &amp; inspire audiences.\n\nhttps://t.co/l93VzPhbII","date":"Tue Feb 08 13:53:03 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Protecting access to Clean Water ensures:\n \n👨‍👩‍👦 The health of our communities\n💪 Businesses can stay competitive\n🏞️ Our natural resources are preserved\n \nProud to join 120 of my @HouseDemocrats colleagues today calling for the repeal and replacement of the #DirtyWaterRule.","date":"Mon Feb 07 22:18:56 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's imperative that we stay vigilant in the fight to end the stigma surrounding HIV/AIDS and invest in HIV prevention and retention in care. It's a matter of health equity. #NBHAAD","date":"Mon Feb 07 21:02:42 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is National Black HIV/AIDS Awareness Day – a day that recognizes how HIV/AIDS disproportionately impacts Black communities across the country. https://t.co/7nuKBrLdFU","date":"Mon Feb 07 21:02:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My #MondayMotivation is helping to maintain the #BidenBoom that has seen the most jobs created this year than at any time in our history. https://t.co/ltUQrq0Cio","date":"Mon Feb 07 15:36:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#ICYMI, free N95 masks are arriving at Delaware pharmacies! \n\n@delawareonline | #COVID19 https://t.co/o0o52OObLd","date":"Mon Feb 07 14:59:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Black history is all around us here in Delaware. I was excited to join @delartmuseum &amp; @NCCDE for the #BlackHistoryMonth Kick-Off Art event at the Walnut Street Y today. This is just one of the exciting events happening this month. I can’t wait to show you some more! Watch below: https://t.co/YEobBkqHaa","date":"Sat Feb 05 21:41:34 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's fitting that Rosa Parks shares her birthday with #TransitEquityDay. \n\nToday, we celebrate her courage and conviction to stand up against injustice in 1955 to make public transit a civil right. #BHM https://t.co/67gGyWsj6P","date":"Fri Feb 04 19:43:40 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to vote for the #AmericaCOMPETES Act 🇺🇸\n\nIt makes historic investments in domestic manufacturing, research, &amp; innovation. \n\nAlso proud that my bipartisan provision on supply chains was included in the bill, which will help create American jobs and lower the price of goods. https://t.co/5LNZCXsXMy","date":"Fri Feb 04 16:33:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"👏🏽👏🏽👏🏽 #BidenBoom","date":"Fri Feb 04 15:39:43 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is great news! #Medicare will now cover over-the-counter COVID-19 tests. \n\nI was honored to work alongside my House colleagues to help make this happen for Medicare beneficiaries in Delaware and across the country.","date":"Thu Feb 03 19:10:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One of the reasons I'm most excited about the #AmericaCOMPETES Act is because it helps secure and protect American #SupplyChains. \n\nBut you may be wondering, what are supply chains and how do they impact my life? https://t.co/ruj7BMvEz9","date":"Thu Feb 03 17:56:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericaCOMPETES Act is all about bolstering our workforce, lowering the price of consumer goods, &amp; increasing our national security. \n\nI'm proud that my bipartisan provisions to secure American supply chains - supported by labor and industry - have made it into the package. https://t.co/g6yoq53vQw","date":"Wed Feb 02 19:34:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to stand alongside my colleagues on the first day of #BlackHistoryMonth to celebrate the new Maya Angelou Quarter - the first Black woman on U.S. currency! A historic moment for a historic poet, advocate, and American icon. https://t.co/1hQuZc9qKY","date":"Wed Feb 02 18:54:17 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As the lowest-lying state in the nation, Delaware's beaches are highly vulnerable to sea-level rise and erosion, especially at Bowers Beach. \n\nIt's imperative we do all we can to maintain our beaches so they can continue to support our coastal communities.\nhttps://t.co/oNlMwHqr9h","date":"Wed Feb 02 15:59:39 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@SenatorLujan Wishing you a speedy recovery, my friend ❤️","date":"Tue Feb 01 21:52:46 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to have the support of the Biden-Harris Administration in our effort to lower consumer prices, create good-paying jobs, and secure our supply chain. https://t.co/H9pmhwTSps","date":"Tue Feb 01 21:51:33 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To my friends in the First State and around the country - Happy Lunar New Year! \n\n新年快乐 https://t.co/b9Mhu5c4JF","date":"Tue Feb 01 20:58:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let this week push us to recommit to our work to end gun violence by passing common-sense gun violence prevention legislation. #GVSurvivorsWeek","date":"Tue Feb 01 20:34:15 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This week is National Gun Violence Survivors Week - a chance for us to hear the life-changing stories of survivors and support them through their physical and emotional trauma.","date":"Tue Feb 01 20:34:14 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #LunarNewYear to everyone celebrating in Delaware and across the world! I wish everyone nothing but great prosperity, joy, and good fortune in the #YearOfTheTiger! https://t.co/lNYLYT8qlN","date":"Tue Feb 01 18:29:09 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I've always held close to my heart the stories of my ancestors. I am where I am today because of them. Our great country is full of those stories. Stories of struggle, of striving, and of success. Those stories are #BlackHistory - and we are better for them. #BlackHistoryMonth https://t.co/E42WPq1XW0","date":"Tue Feb 01 15:38:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to have the support of @steelworkers for my bipartisan provision of the #AmericaCOMPETES Act with @RepMalinowski &amp; @RepKinzinger. \n\nOur provision will help create more resilient supply chains, lower the price of consumer goods, &amp; help create good-paying union jobs 💪🏽 https://t.co/XfdLSLAeTy","date":"Mon Jan 31 19:50:25 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS's Supreme Court nominee isn't just about representation - as @ava says, it's about normalization. \n\n@CNNSotu | #SCOTUS https://t.co/YuNuHWDhb7","date":"Sun Jan 30 16:32:32 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Looking forward to joining the panel this morning on @CNNSotu! https://t.co/OYlEk9yx92","date":"Sun Jan 30 13:43:45 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Women are still facing wage discrimination across the country. It’s time for Congress to pass the Paycheck Fairness Act and ensure equal pay for equal work. #EqualPay","date":"Sat Jan 29 17:20:39 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"13 years ago today President Obama signed the Lilly Ledbetter Fair Pay Act into law to prevent wage discrimination in the workplace. But our work isn’t done.","date":"Sat Jan 29 17:20:38 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was great to join Woodlawn Trustees today for the Phase IV Groundbreaking in Wilmington! This phase will bring 52 new affordable housing units to the area. \n\nI'm excited to see this project continue to help bring safe, stable, and reliable housing to families in our state. https://t.co/Xa0dBQd56D","date":"Fri Jan 28 22:12:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Stay safe this weekend, Delaware!","date":"Fri Jan 28 14:21:31 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #HolocaustRemembranceDay, we remember the victims and survivors of the Holocaust.\n\nLet today be a reminder for us to recommit ourselves to stand up against violence, hatred, and anti-Semitism. #NeverForget","date":"Thu Jan 27 19:35:08 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was great to meet with several representatives from Delaware Labor Unions this morning to update them on how Congress is supporting union workers through the Bipartisan Infrastructure Law and hear their concerns for what the future holds for union workers. https://t.co/XryqqQukmY","date":"Thu Jan 27 18:20:04 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: Thanks to the Bipartisan Infrastructure Law, discounts on monthly internet bills for American families from the Emergency Broadband Benefit will continue with the new Affordable Connectivity Program.\n \nDelawareans can see if they're eligible here⬇️ https://t.co/cgEog4LKVc https://t.co/miCknKavMy","date":"Thu Jan 27 17:11:24 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Americans across the country are starting to receive their four at-home rapid COVID tests thanks to @POTUS. \n\nRemember that each household is eligible to order these tests at https://t.co/9ZxlEC8vWP. Get yours today, Delaware! https://t.co/2HxSwqcAlJ","date":"Wed Jan 26 14:08:08 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"\"If they don't give you a seat at the table, bring a folding chair.\"\n\nThat's exactly what Shirley Chisholm did #OnThisDay 50 years ago when she became first black woman to run for president. https://t.co/vQ8D5cuWYV","date":"Tue Jan 25 21:49:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And she's right. It's about all of us working together to have seats at the table so that our voices are heard.\n\nThat's how we become forces for change just like Shirley. #ChisholmTrail","date":"Tue Jan 25 21:49:13 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Anyone who knows me knows that I care deeply about jobs.\n\nThat's one of the many reasons I'm so excited about the Bipartisan Infrastructure Bill. Our final stop today was in Wilmington to talk about all the jobs that are coming to repair the Walnut Street Bridge. https://t.co/0VcHhEOAGj","date":"Tue Jan 25 18:15:50 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The most important part of any great tour? Stopping to fuel up with a cup of coffee ☕️! \n\nIt was great to spend some time at @houseofcoffi to support an incredible local small business in Dover. #ShopSmall https://t.co/SZMIywzhhS","date":"Tue Jan 25 17:23:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Bipartisan Infrastructure Law isn't just about making things easier for vehicles 🚗 ⤵️\n\nI'm in Dover to talk about how widening the bridge over the St. Jones River makes things better and safer for bikers and pedestrians - improving our quality of life! https://t.co/zEp61orW7U","date":"Tue Jan 25 16:35:10 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Bipartisan Infrastructure Law isn't just about repairing old bridges - it's about creating opportunities to innovate - to build those bridges back better. \n\nThat's exactly what's happening here at the Cedar Creek Bridge 🌉. https://t.co/j9faXf67VT","date":"Tue Jan 25 15:40:54 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Interested in how the Bipartisan Infrastructure Law is going to impact your community? \n\nToday, I'm with @DelawareDOT to tour bridges throughout our state that will be repaired or replaced with $ secured through BIF. \n\nThis morning, we're starting in Milford ⤵️ https://t.co/jOFCPL1PIk","date":"Tue Jan 25 15:24:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"📆MARK YOUR CALENDAR📆\n\nThe 2022 tax filing season starts today and goes until April 18! To speed up the process, remember to file online as early as possible &amp; opt for direct deposit.\n\nFor more information, click below:\n\nhttps://t.co/nOp4Lz7p9e","date":"Mon Jan 24 20:49:55 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let's go, Senators! \n\nIt was great to join @CSDSenators for their first Legislative Breakfast this morning to hear directly from students, educators, and district staff about how we can better support them during these unprecedented times. https://t.co/D6C9EbYZlV","date":"Mon Jan 24 14:59:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing the happiest of birthdays to Delaware's senior senator, and my good friend and mentor, @SenatorCarper!\n\nDelaware is so lucky to have your leadership and example. Happy Birthday, TC! 🎉 https://t.co/JmXtrjWLud","date":"Sun Jan 23 15:30:08 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today marks the 49th anniversary of Roe v. Wade’s landmark decision protecting a woman’s legal right to abortion, yet women’s reproductive rights are still under attack.\n\nWe need to codify Roe v. Wade nationally. The Senate needs to pass the Women's Health Protection Act. #Roe49","date":"Sat Jan 22 16:14:36 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One of the most important weapons in our arsenal to fight climate change is climate adaption and resiliency.\n\nProud to cosponsor bipartisan climate resilience legislation that would create a national adaptation and resilience strategy to protect coastal &amp; low-lying communities.","date":"Thu Jan 20 20:29:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"DELAWARE! At 2:15 PM E.T. today, @JohnCarneyDE will give his annual State of the State Address.\n\nTune in to learn more about the Governor’s priorities for Delaware in 2022. ⬇️","date":"Thu Jan 20 19:06:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There's still more work to do but I'm confident that with President Biden and Vice President Harris at the helm, we'll continue to move America forward each and every day.","date":"Thu Jan 20 15:02:52 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been 1 year since @POTUS &amp; @VP took office. In that year, we've made historic progress. From vaccinating over 70% of adults, to creating over 6 million new jobs, to passing a bipartisan law to rebuild our nation's crumbling infrastructure - America is on the move again. https://t.co/3gjQScnsPu","date":"Thu Jan 20 15:02:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Exciting News: @JohnCarneyDE is allocating $107 million from the #AmericanRescuePlan Act to invest in pandemic-related projects at Delaware's colleges and universities! \n\nThis funding will go a long way in helping our state continue to recover and rebuild from this pandemic.","date":"Wed Jan 19 21:09:02 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thanks to @POTUS, Delawareans can now order four at-home rapid COVID tests at no cost!\n\nFor more information on these tests and how to order them, click the link below ⬇️⬇️\n\n https://t.co/9ZxlEC8vWP","date":"Wed Jan 19 14:09:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My middle name is Blunt.\n\nAnd to be blunt, the American people don't care about process. They care about progress. \n\nWe have a unique opportunity to secure voting rights. Let's get it done. https://t.co/zworWy1Tvi","date":"Wed Jan 19 00:08:24 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There’s too much at stake to let this moment pass us by. Getting ready to join @wolfblitzer on @CNNSitRoom to discuss the fierce urgency of NOW when it comes to voting rights. https://t.co/A3F72yTRli","date":"Tue Jan 18 23:11:54 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we approached #MLKDay this year, I found myself searching through not only short quotes but listening through full speeches. One of those speeches is from 1957 called, “Give Us the Ballot.” Its title and contents couldn’t be any more relevant today. https://t.co/yG4Uj1VV2V","date":"Mon Jan 17 13:59:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I hope you’ll take some time today to listen fully to Dr. King’s words. \n\n“In this juncture of our nation’s history, there is an urgent need for dedicated and courageous leadership.” #GiveUsTheBallot","date":"Mon Jan 17 13:59:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨Open Enrollment ends TOMORROW, January 15th!\n\nIt's never been more important to have an affordable and reliable healthcare plan. Sign up today to #GetCovered at https://t.co/arYTIuMxPv before tomorrow's deadline! https://t.co/XIlOHj6Eh0","date":"Fri Jan 14 19:37:16 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Passing the #BuildBackBetter Act = Expanded #ChildTaxCredit\n\nOver 107,000 households in Delaware received their final disbursement of the CTC in December of 2021. We cannot let the #AmericanRescuePlan's progress end here. \n\nIt's time to pass the #BuildBackBetter Act.","date":"Fri Jan 14 18:24:48 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, @USDOT announced that Delaware will receive $225 million over the next five years to:\n\n☑️Repair Delaware's bridges\n☑️Create good-paying jobs\n☑️Keep Delawareans connected\n\nThis is the #BipartisanInfrastructureLaw at work delivering for the people of Delaware. https://t.co/P7hkOCufge","date":"Fri Jan 14 16:36:59 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"An important step needed to expand COVID-19 testing for Delawareans. \n\nI commend @DelawareEMA for working alongside @FEMA to help our state fight this surge.","date":"Thu Jan 13 22:34:41 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to vote for the passage of the Freedom to Vote: John R. Lewis Act to protect the most basic and fundamental right of every American citizen - the right to vote. \n\nIt's time for the Senate to answer the call of the American people and join the #FightForVotingRights. https://t.co/r5w0sRPqFH","date":"Thu Jan 13 16:42:44 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@TheBlackCaucus is the conscience of the Congress. And today, we came together to use Our Power &amp; Our Message to say to the Senate - the time to pass the John R. Lewis Voting Rights Advancement Act is now. https://t.co/1zo5GwQQFp","date":"Wed Jan 12 21:08:23 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Getting ready to tune into @Jim_Gardner’s final @6abc 11 p.m. newscast. It was Jim’s voice I grew up with telling us about what was happening in our community. The entire Delaware Valley is better for your work, Jim. Congrats on a well-earned retirement!","date":"Wed Jan 12 03:27:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS's message today was abundantly clear - it is time to choose.\nIt's time to answer the question, how important is democracy to you? The time is now to secure our voting rights. So let's vote. https://t.co/bkf2ekWyjz","date":"Tue Jan 11 23:45:26 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Why is it that people want to subvert or suppress your vote? It is because it is THAT important. That's why we must protect voting rights for all Americans. The time to pass the John Lewis Voting Rights Advancement Act and the Freedom to Vote Act is now. https://t.co/cdR3HDMakz","date":"Tue Jan 11 23:17:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericanRescuePlan is at work helping Delawareans address home energy costs and stay warm this winter.\n\nFor more information on this program, you can click here ⬇️\n\nhttps://t.co/4XgazTIKDO","date":"Tue Jan 11 18:16:22 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The @WhiteHouse announced that Delaware has received over $25 million for the Low-Income Home Energy Assistance Program (LIHEAP), more than double Delaware's typical annual funding!","date":"Tue Jan 11 18:16:21 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"History made! Today, Maya Angelou becomes the first Black woman to appear on a US quarter! Proud to have supported @RepBarbaraLee's bill to enshrine Maya Angelou's legacy &amp; the legacies of other impactful American women on US quarters through the American Women Quarters Program.","date":"Mon Jan 10 18:35:47 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And while there's a lot that needs to get done this year, I remain hopeful that if we work together, we can make it happen. \n\nLet's do this. 👊","date":"Mon Jan 10 17:35:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We focused on helping American families and businesses recover from this pandemic with the American Rescue Plan. We focused on rebuilding our nation's infrastructure with the Bipartisan Infrastructure Law. We focused on restoring voting rights with the For the People Act.","date":"Mon Jan 10 17:35:49 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As the House prepares to meet today for its first day in session of 2022, I'm reminded of what we were able to accomplish in 2021. 🧵","date":"Mon Jan 10 17:35:48 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What a wonderful picture of @thegrandwilm! Thanks for sharing @BrianDiSab. A perfect example of why #SaveOurStages was such an important initiative throughout the pandemic.","date":"Sun Jan 09 14:14:28 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thankful for the Delaware National Guard for answering the call to help Delaware during this surge in COVID cases and hospitalizations. We are so appreciative!\nhttps://t.co/NzcYdD7h77","date":"Fri Jan 07 21:33:05 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"An absolute giant of screen and society. What a burden he bore. And how gracefully he carried it. Rest in Peace, Sir Sidney Poitier.","date":"Fri Jan 07 18:04:53 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been a long &amp; difficult day of reflection. But as I said earlier - throughout the entire year, I've continued to have hope even when I feel hopeless because my ancestors would have it no other way. \n\nLet's keep fighting for each other. \nLet's keep fighting for our democracy. https://t.co/JkDcyqBrl7","date":"Fri Jan 07 02:50:12 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Remember, reflect, recommit. \n\nToday I joined my colleagues to bear witness and put in appropriate historical context the events of January 6th. This is my testimonial and reflection on that day - one year later. https://t.co/Gl6UoC1pDU","date":"Thu Jan 06 21:17:27 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I sat down with my colleagues who were in the House gallery on January 6th to reflect on what it was like to experience that day and the bond we formed after. But today is also about recommitting ourselves to our democracy and to each other. https://t.co/wFpdXA0sbv","date":"Thu Jan 06 18:19:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today’s a hard day for the entire Capitol community. I can’t tell you what a joy it was to help serve lunch to the @CapitolPolice and the support staff who helped keep us safe a year ago and continue to keep us safer every day. We can’t thank you enough ❤️ https://t.co/pkmBOusQN0","date":"Thu Jan 06 16:49:06 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The extended open enrollment period ends in🔟days!\n\nWith the rise in COVID cases and hospitalizations in Delaware and across the country, it has never been more important to have affordable health insurance.\n\nClick below to #GetCovered today⬇️ \n\nhttps://t.co/Mm9ThF2GsZ","date":"Wed Jan 05 17:04:39 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important update from Gov. Carney. Everyone stay safe and warm out there.","date":"Mon Jan 03 13:33:37 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we wake up to a new year with new opportunities, let us never forget all the great things we can accomplish when we act with love for each other. Here’s to a better and brighter 2022.","date":"Sat Jan 01 13:30:51 +0000 2022","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing everyone a blessed beginning to #Kwanzaa! https://t.co/t433sxDXcs","date":"Mon Dec 27 03:54:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In this season of reflection and renewal, I’m wishing you and your family a happy, healthy, and merry Christmas! 🎄 https://t.co/Dr0C3ci6QK","date":"Sat Dec 25 13:21:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@ChrisCoons Sending well wishes for a speedy recovery, @ChrisCoons!","date":"Thu Dec 23 16:20:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The best way we can protect one another this holiday season is to get vaccinated, boosted, and tested. \n\nLet’s do our part, Delaware. https://t.co/rx6lYMtNZS","date":"Wed Dec 22 14:12:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This pandemic is not over. @POTUS’ plan to combat COVID-19 and the omicron variant in the upcoming winter months is exactly what we need:\n\n🏥More support for hospitals\n\n🧪More free testing\n\n💉More shots in arms","date":"Tue Dec 21 20:04:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to my friend, and now Ambassador, @GovernorMarkell! Delaware is proud to call you one of our own.","date":"Sat Dec 18 14:20:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm excited to be with @AARPDE this evening for a Telephone Town Hall to talk about the Build Back Better Act and problems facing Delawareans. \n\nYou can listen to the conversation here ⬇️\nAARP Teletown Hall https://t.co/YA2Y2I5T11","date":"Fri Dec 17 00:16:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@EPA announced today that Delaware is set to receive over $63 million to strengthen drinking and wastewater systems including replacing lead service lines and pipes.\n\nThis means expanded access to clean drinking in Delaware.\n\nThis is the #BipartisanInfrastructureLaw at work.","date":"Thu Dec 16 21:29:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: @Delaware_DHSS announced a Homebound Vaccination Program for eligible seniors and people with disabilities to request a homebound COVID-19 vaccination and/or booster shot. \n\nRequests will be filtered through a toll-free number (1-888-491-4988). #GetVaccinated","date":"Thu Dec 16 20:00:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Addressing our supply chain challenges is one of our top priorities at the @NewDemCoalition. \n\nI was proud to join my colleagues to talk about my Building Resilient Supply Chains Act. To the extent we can, if we rely on it in America, we should make it in America. https://t.co/1ActGzinAR","date":"Wed Dec 15 23:18:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is the final payment of the #ChildTaxCredit for the year. The CTC has already helped thousands of families and reduced childhood poverty in Delaware and across the country. \n\nIt's time for the Senate to pass the #BuildBackBetter Act and make the CTC permanent. https://t.co/cKZsd9imSl","date":"Wed Dec 15 18:58:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Bittersweet indeed. Sad to see the sign come down, pleased to know that it will be preserved for historical purposes, and excited to see what lies ahead for our beautiful Rehoboth boardwalk 💪🏽","date":"Wed Dec 15 17:34:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"9 years ago today we witnessed a massacre at Sandy Hook Elementary that took the lives of 20 children and 6 teachers in the matter of minutes. \n\nOur prayers and thoughts are simply not enough. Congress must act to protect all Americans, especially our kids, from gun violence.","date":"Wed Dec 15 01:34:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"May we never forget those we’ve lost. 800,000 of our fellow Americans have now perished from #COVID. Tonight, I joined @SenatorCarper, @ChrisCoons, and colleagues from across the aisle to hold those we’ve lost in our hearts. https://t.co/zvPJ2fzIub","date":"Tue Dec 14 22:25:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If you miss this deadline, don't sweat! Thanks to @POTUS, you will still have until January 15, 2022, to enroll for coverage starting around February 1, 2022. #GetCovered","date":"Mon Dec 13 22:09:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨REMINDER: Open enrollment's first deadline is upon us! Make sure to enroll at https://t.co/uoF5zg2bDd by December 15 for health care coverage starting on January 1, 2022. https://t.co/pmARVRQZz2","date":"Mon Dec 13 22:09:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Grateful today and every day for the servicemembers of the @DelawareNG for all that they contribute to our state and nation. Happy Birthday @USNationalGuard!","date":"Mon Dec 13 20:11:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Tech companies too often prey on unsuspecting Americans, capturing their personal data with something known as \"dark patterns.\"\n\nToday, in @EnergyCommerce, I discussed my bill, the DETOUR Act, aimed at ending those harmful practices and holding tech companies accountable. https://t.co/ZY8VaTsI3F","date":"Thu Dec 09 23:34:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's what we call the Biden Boom.","date":"Thu Dec 09 17:33:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A truly beautiful and moving ceremony for an American patriot and hero.","date":"Thu Dec 09 15:51:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With the increase of COVID cases in Delaware and across the country, it's more important than ever to get vaccinated and get your booster shot. \n\nClick the link below to find a vaccine location close to you: https://t.co/Qb90fyiZng","date":"Thu Dec 09 15:41:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We've got more work to do - and while I was certainly a little tired walking off the House floor after 10:30 last night, I was proud to be able to cast so many votes to help improve the lives of Americans. (end.)","date":"Thu Dec 09 14:41:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And I've been proud to be a part of a @HouseDemocrats caucus that has worked tirelessly to do just that through the passage of a historic infrastructure bill and the #BuildBackBetter Act. 7/","date":"Thu Dec 09 14:41:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"These bills may not grab all the headlines but they are really, really important. I didn't come to Congress to score political points or rack up cable news hits - I came to help make people's lives better. 6/","date":"Thu Dec 09 14:41:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Now here's what you might not read in the news - all of these bills were supported on an overwhelmingly bipartisan basis! (As was my bill)  5/","date":"Thu Dec 09 14:41:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One of my bills, the CARING for Social Determinants Act was included in that list. My bill would help keep Americans healthier by addressing some of the conditions that impact health, i.e. housing, transportation, education, and so much more. 4/","date":"Thu Dec 09 14:41:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We were voting on what are called \"suspension bills\". Bills that aren't particularly controversial but are incredibly important. Last night we voted on 30 of them! (That's a huge number for any vote series.) 2/","date":"Thu Dec 09 14:41:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I know if you watch too much cable news, it can seem like all that gets done in Washington is partisan fighting and not much else - but I want to tell you a quick story about why my colleagues and I were on the House floor until about 10:30 last night. 1/","date":"Thu Dec 09 14:41:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The bills ranged from helping combat the opioid epidemic through stronger patient protections, helping accelerate access to therapies for ALS, and condemning the ongoing genocide of Uyghurs in China. 3/","date":"Thu Dec 09 14:41:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Home of tax-free shopping 🤷🏽‍♀️","date":"Wed Dec 08 16:50:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"They call us \"first\" for a reason! \n\nHappy Delaware Day to the first and best state in the Union. https://t.co/nu02NQ66A0","date":"Tue Dec 07 15:41:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"80 years ago, America was forever changed when 2,300 servicemembers lost their lives at Pearl Harbor.\n\nWe continue to honor the lives lost that day and commemorate the bravery and sacrifice of those who would go on to fight to defend our freedoms. https://t.co/h6PevrgYx2","date":"Tue Dec 07 14:36:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is a real headline in the year 2021. \n\nThe House has already acted to codify Roe. We need the Senate to do the same.","date":"Fri Dec 03 16:15:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@POTUS' new plan to help our nation fight COVID-19 and the Omicron variant this winter is a critically important step in helping keep Americans safe from the virus. But it's also on us to do the right thing. Get vaccinated and get boosted!","date":"Thu Dec 02 22:14:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Another government shutdown is not an option. It’s time for Congress to deliver #ForThePeople and fund the government so that those elected to serve the American people can continue to do so.","date":"Thu Dec 02 20:09:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is great news from @DelStateUniv! Support for our HBCUs is a top priority of mine. That's why I was proud to vote to pass the #BuildBackBetter Act in the House that will increase funding for HBCUs across the country and continue to drive enrollment!\n\nhttps://t.co/WSFkjyV1BS","date":"Thu Dec 02 18:53:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Bipartisan Infrastructure Law isn't just about concrete and cables. \n\nIt's about the faces and places that will change for the better. https://t.co/rZkEw1twU1","date":"Thu Dec 02 15:58:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #WorldAidsDay, we honor those currently living with HIV/AIDS and those who lost their lives to the virus. For 40 years our nation has battled this epidemic. It's up to all of us to continue the critical work to end the stigma and discrimination around HIV/AIDS. https://t.co/Q7CZaXNUse","date":"Wed Dec 01 20:39:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #BuildBackBetter Act will give us the tools we need to fight the existential threat of climate change while creating good-paying jobs. The Civilian Climate Corps, championed by @ChrisCoons is one of the best examples.","date":"Wed Dec 01 14:11:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨 DELAWARE: Reminder to register for the Virtual Grants Seminar on Monday, December 6 at 10 AM!\n\nDon't miss out on the opportunity to learn about federal grant opportunities and the resources available to Delawareans. Click the link below to register:\n\nhttps://t.co/ChOlY13zoV","date":"Tue Nov 30 19:40:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Investing in Infrastructure🤝Building Back Better https://t.co/qu0DPyZkuw","date":"Mon Nov 29 21:59:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a #HappyHanukkah to all those celebrating tonight in Delaware and around the world! \n\nMay the lights of the menorah fill your home with brightness, and your hearts with hope and happiness as you celebrate with those you love. https://t.co/mktgmTxMOX","date":"Sun Nov 28 20:15:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Every day is a great day to #shopsmall in Delaware, but I hope you’ll take some time on this #SmallBizSat to support the small business owners and entrepreneurs that power our economy. https://t.co/VEvLI1rBeZ","date":"Sat Nov 27 17:13:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m praying that you have a blessed, restful, and reflective day with those you love. In another year filled with challenges, there is still so much for which to be thankful. From my family to yours, Happy Thanksgiving!","date":"Thu Nov 25 14:04:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you interested in securing federal grant opportunities and resources for your organization in Delaware?\n\nJoin @SenatorCarper, @ChrisCoons, and me for a Virtual Grants Seminar on Monday, December 6 at 10 am! Click the link below to register⬇️ \n\nhttps://t.co/ChOlY13zoV https://t.co/qkdEdnK9Zz","date":"Tue Nov 23 22:04:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This historic bill will help Delaware make repairs and updates to its countless roads, 19 bridges, and over 250 miles of highway as well as investments in our internet access, drinking water, and more. We're starting to #buildbackbetter, one road, bridge, and highway at a time. https://t.co/anZfCDYxU9","date":"Tue Nov 23 19:14:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to be with  @SenatorCarper, @ChrisCoons, @JohnCarneyDE and others this morning to welcome Deputy Secretary of Transportation @Pollytrott to celebrate the new Bipartisan Infrastructure Bill that President Biden signed into law last week.","date":"Tue Nov 23 19:14:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy birthday ⁦@POTUS⁩! It’s an honor to stand alongside you as we fight for a better and brighter future for the American people. https://t.co/nB07Y9RUlA","date":"Sat Nov 20 15:28:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You heard the man. Let's get it done in the Senate!","date":"Fri Nov 19 16:02:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We did it, Delaware.\n\nFrom creating millions of good-paying jobs, to investing in our families and future, to combatting the climate crisis. We have passed the truly transformational #BuildBackBetter Act.\n\n Now it's time for the Senate to act and send this bill to @POTUS's desk. https://t.co/SZy85u8Frb","date":"Fri Nov 19 15:53:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's that #BuildBackBetter feeling! https://t.co/t044GsNCXY","date":"Fri Nov 19 15:01:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Recover ---&gt; American Rescue Plan ✅\n \nRebuild ---&gt; Bipartisan Infrastructure ✅\n \nRestore ---&gt; Build Back Better ✅ https://t.co/GUDK23uzOl","date":"Fri Nov 19 14:44:17 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's time. Let's vote to #BuildBackBetter","date":"Fri Nov 19 14:13:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Joy cometh in the morning. And it's the morning. \n\n#BuildBackBetter","date":"Fri Nov 19 13:27:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Expanding telehealth services reliably to rural communities is one of my top priorities. Proud to lead a bipartisan effort in @EnergyCommerce with @GKButterfield &amp; @RepGusBilirakis to appropriately map data, improve health outcomes, and help battle the maternal mortality crisis. https://t.co/UYX956ztfU","date":"Thu Nov 18 18:02:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We have a once-in-a-generation opportunity to reconnect Wilmington with a capping project over I-95. \n\nI spoke with @tfurlong about the grant $'s I was able to secure in the #BipartisanInfrastructureBill and the prospects for the project getting done 👇🏽 https://t.co/q1sRB508SE","date":"Thu Nov 18 15:42:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #BuildBackBetter Act will make child care, home care, education, health care, and housing more affordable all while creating good-paying jobs and combatting the climate crisis. \n\n🔁RT if you think the House should pass the #BuildBackBetter Act!","date":"Thu Nov 18 14:58:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As the Chairman of the @EPWCmte, Senator Carper was largely responsible for many of the provisions in this bill that will help us fight the climate crisis and build a more robust and sustainable economy. \n\nThank you, TC.","date":"Tue Nov 16 20:44:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If I could - as we say in Congress - take a moment of personal privilege. \n\nI want to recognize the incredible work of @SenatorCarper in getting this truly transformative piece of legislation passed.","date":"Tue Nov 16 20:44:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our transition to clean energy isn't just a necessary step in our battle against the #ClimateCrisis. \n\nAs I said in today's @EnergyCommerce hearing, it's also an opportunity to make our #supplychain more resilient, sustainable, and equitable for all Americans. https://t.co/mSwdFtajPL","date":"Tue Nov 16 20:03:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Politicians have been promising to deliver on #infrastructure for decades. \n\nThe message from @POTUS - we hear you. We see you. We delivered. \n#BipartisanInfrastructureLaw https://t.co/bZ9aKE8k3d","date":"Tue Nov 16 16:57:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Very important hearing this morning on how we can develop domestic clean energy supply chains. I'll be highlighting two of my recent bipartisan bills focusing on strengthening our supply chains. You can watch the hearing here ⬇️","date":"Tue Nov 16 15:42:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@POTUS just signed the historic $1.2 Trillion Infrastructure Investment and Jobs Act into law. \n\nHere's how it will help Delaware build back better ⬇️⬇️ #InfrastructureWeek https://t.co/8NNmTGQEZc","date":"Mon Nov 15 22:06:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's a big day! @POTUS is getting ready to sign the Bipartisan Infrastructure Deal and I'm heading to the @WhiteHouse with colleagues from both sides of the aisle to see this historic piece of legislation become law.\n#InfrastructureWeek https://t.co/bXdrnMZ2Gi","date":"Mon Nov 15 19:38:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wondering what the Bipartisan Infrastructure Deal means for Delaware? 👇🏽\nhttps://t.co/mbx6SyJmKb","date":"Mon Nov 15 14:13:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans, the last day to enroll in the expanded #ChildTaxCredit is this Monday, November 15! \n\nDon't miss out on this benefit that has helped countless Delaware families already. Non-filers can enroll here⤵️\nhttps://t.co/8147EgpiFU","date":"Fri Nov 12 19:39:13 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to join the Delaware Commission of Veterans Affairs for their Veterans Day service at the War Memorial Plaza in New Castle this morning. \n\nLet today be about honoring veterans from our past, present, and future and thanking them for their service to our country. https://t.co/sFYwpAETzU","date":"Thu Nov 11 18:25:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To all veterans past and present, a grateful nation salutes you for the service and sacrifice you’ve given to protect and preserve our freedoms. Thank you. #VeteransDay","date":"Thu Nov 11 14:47:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was a pleasure to join @SecGranholm &amp; @SenatorCarper to highlight the value of @POTUS’s bipartisan infrastructure deal!","date":"Wed Nov 10 19:42:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to vote for the bipartisan infrastructure bill on Friday that will deliver $1.2 trillion in funding for America's surface transportation infrastructure. But our work isn't done. \n\nWe must pass the #BuildBackBetter Act to help working families.","date":"Mon Nov 08 15:01:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Joey, who is only 6 years old and the son of a member of my staff, couldn’t wait to get his COVID-19 vaccine this morning. Kids aged 5-11 are now eligible to receive Pfizer’s COVID-19 vaccine. Be like Joey. Get #vaccinated! https://t.co/eNQVuDWB02","date":"Sat Nov 06 17:16:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Think it's gonna be a pretty good end to #InfrastructureWeek. \n\nNext stop ➡️ @POTUS https://t.co/uO9JWm6BJm","date":"Sat Nov 06 03:29:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"✅ https://t.co/nsWJlK96vu","date":"Sat Nov 06 03:24:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In.","date":"Fri Nov 05 15:36:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Biden-Harris Administration has helped build an incredibly strong foundation for our economy. \n\nLet's keep building.","date":"Fri Nov 05 15:34:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today's the day. We've got a unique opportunity to pass a comprehensive Democratic agenda that creates real and lasting change. \n\nLet's do it.","date":"Fri Nov 05 13:15:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Ruth Ann Minner worked hard, did the right things, and left things better than she found them. I, and our entire state, are grateful for her life of service.","date":"Thu Nov 04 20:19:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My heart is heavy learning of the loss of my mentor and role model Governor Ruth Ann Minner. Governor Minner lived by a simple code that she so often articulated, \"Work hard. Do the right thing. And leave things better than you found them.’ https://t.co/pZLH5h3Jtf","date":"Thu Nov 04 20:19:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #Diwali to those celebrating in Delaware and across the country. May the Festival of Lights be a festive celebration of joy and togetherness. https://t.co/4xwIYOzras","date":"Thu Nov 04 18:50:13 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to take part in this morning's @EnergyCommerce's Health Subcommittee Markup on several bills related to investments in public health, health care workforce, and medical research.","date":"Thu Nov 04 14:30:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And thankfully paid parental leave is here to Stay Stay Stay. #BuildBackBetter","date":"Thu Nov 04 00:59:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am proud to introduce the #EMPOWERAct with @RepLoisFrankel, @RepJohnKatko, @RepUnderwood, @RepBrianFitz, @RepJerryNadler, a comprehensive, bipartisan bill that addresses workplace harassment by strengthening employee protections and increasing transparency in the workplace. https://t.co/Z0cMpirtfT","date":"Wed Nov 03 19:57:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Lowering prescription drug costs is too important to be on the chopping block.\n\nI applaud my colleagues on this deal, which will allow Medicare to negotiate drug costs, add a out-of-pocket cap to Part D, and help prevent costs from rising faster than inflation. #BuildBackBetter","date":"Wed Nov 03 13:44:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It has never been more important to have affordable health insurance. \n\nOpen enrollment for health care coverage in 2022 begins TODAY and ends January 15. Don’t miss your chance to #GetCovered! https://t.co/szRk5UyCgk https://t.co/3jpZOxoDwA","date":"Mon Nov 01 22:13:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Theres' been a lot of focus on process lately. But #BuildBackBetter is about people. \n\nIt's about our children. It's about our future. It's about uplifting all of us. \n\nLet's #BuildBackBetter for our children. https://t.co/lxpy4U2WiB","date":"Mon Nov 01 16:54:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Support for early ed and childcare is critically important for kids and their families. Proud to be @DelStateUniv to announce $120 million from the #AmericanRescuePlan to keep childcare centers open and operating in Delaware and establish a new Early Childhood Center at DSU. https://t.co/ftSAhNgeg7","date":"Mon Nov 01 15:15:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"REMINDER: Applications for the #CongressionalAppChallenge are due on Monday, November 1! Middle school and high school students are encouraged to apply. You can register here: https://t.co/NaukKUJUND #Congress4CS https://t.co/1lUWGyCwHB","date":"Fri Oct 29 15:05:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On the 3rd anniversary of the deadliest antisemitic massacre in American history, we remember the 11 lives lost at the #TreeofLife Synagogue. May their memory be a blessing. We must work together towards a future where everyone can live and pray without judgment or fear.","date":"Wed Oct 27 21:48:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to the First State Webfooters, a walking group where Delawareans can come together to enjoy noncompetitive walking outdoors, on their 40th Anniversary!\nhttps://t.co/yn9DFMaGyz","date":"Wed Oct 27 14:37:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@RepCartwright’s Public Service Freedom to Negotiate Act protects the rights of public servants who selflessly support our communities but struggle just to pay bills and support their families. I’m proud to be an original co-sponsor of the bill. #StandWithPublicWorkers https://t.co/jjqxtYcVPF","date":"Tue Oct 26 20:28:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to be working with @ChrisCoons to ensure that investing in #HBCU’s like @DelStateUniv is a key part our strategy to #BuildBackBetter","date":"Tue Oct 26 17:57:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Ensuring our vets have access to quality health care and mental health services is a critical part of our work in Washington. And thank you to @SecVetAffairs for coming to Delaware to join in on the conversation. We must continue to support our veterans however we can.","date":"Tue Oct 26 15:02:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm always honored to join @SenatorCarper's Veterans' Summit each year to hear directly from Delaware's veterans about how we can better serve them at home in Delaware and across the country.\nhttps://t.co/zC1dOfhSCj","date":"Tue Oct 26 15:02:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important information below for those wondering about the eligibility requirements for a Covid vaccine booster shot ⬇️","date":"Mon Oct 25 16:42:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to spend time with @SenatorCarper, @SecVetAffairs, and @WilmingtonVAMC this morning to discuss ways that we can better serve those who have served us.","date":"Mon Oct 25 15:56:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Standing alongside my sisters of the @TheBlackCaucus  for #CBCPinkFriday to recognize #BreastCancerAwarenessMonth https://t.co/bL92EEcz8I","date":"Fri Oct 22 15:55:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"No individual will stand in our way of finding out the truth about January 6th.","date":"Thu Oct 21 20:17:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Senate Republicans continue to stand in the way of legislation that guarantees the fundamental right of EVERY American to vote. \n\nWe won't give up until we pass the Freedom to Vote Act.","date":"Wed Oct 20 19:56:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm proud to support the efforts of the Biden-Harris Administration to improve mental health and substance use services. It's why I've introduced a number of bills to help provide support for our young people, this Congress.","date":"Tue Oct 19 15:19:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"📞 Call\n📧 Email \n✍️ Write In! \n\nThere's no shortage of ways to get in touch with your Member of Congress. Remember, we're here to serve YOU. So if #CleanWater is a priority for you - make sure you let Congress know.","date":"Mon Oct 18 18:50:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With 2 in 10 Delawareans relying on wells, access to #CleanWater is crucial - but we can't stop there. \n\n#CleanWater must also be affordable. That's why I introduced #HR3293, to help low-income homes pay their drinking water &amp; wastewater bills.","date":"Mon Oct 18 18:39:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That every Delawarean &amp; American regardless of ⤵️\n\n👤 Race \n💰 Income\n📍 Zip Code\n\nhas access to safe, reliable, affordable, and #CleanWater.","date":"Mon Oct 18 18:25:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There's nothing quite like taking a walk down the Brandywine Creek near my home in Wilmington. \n\nDelaware has done a lot to clean up this tributary after years of pollution. It's proof of what we can do when we fight for #CleanWater and a reminder of the work that remains. https://t.co/PfQiKxj5Mf","date":"Mon Oct 18 18:17:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In Delaware, we all live in coastal counties. From the Delaware River to the Rehoboth Bay, Delawareans depend on clean water for  ⤵️\n\n🏥 Our health \n🏖 Our recreation \n💵 Our economy\n\nIn short, clean water impacts every part of our state.","date":"Mon Oct 18 18:05:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to join @LCVoters for today's @Twitter Q&amp;A!","date":"Mon Oct 18 18:01:59 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Very excited to be moderating a session @DelStateUniv this morning with our distinguished guests from @EUintheUS","date":"Mon Oct 18 14:52:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The United States of America will forever owe a debt of gratitude to Colin Powell. I’m praying for his family, friends, and colleagues whose moving tributes are a testament to the character and conviction of the man. My full statement below. https://t.co/8bcIoiyf3R","date":"Mon Oct 18 13:44:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #NationalMammographyDay and October is #BreastCancerAwarenessMonth. Remember to get checked and show your support for those impacted by Breast Cancer. Together, we will find a cure. https://t.co/oBgWuGWfZw","date":"Fri Oct 15 20:05:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to join @SenatorCarper for a @EPWCmte field hearing in Dover, DE this morning. Tune in to hear us discuss why access to clean, safe, reliable, and affordable drinking water is essential for Delawareans:  https://t.co/bEFBLSgvKG","date":"Fri Oct 15 14:50:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You can watch the hearing here: https://t.co/dzkeHSq45L","date":"Thu Oct 14 16:32:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"HAPPENING NOW: The @EnergyCommerce Consumer Protection and Commerce Subcommittee is holding a hearing on \"Investing in American Jobs: Legislation to Strengthen Manufacturing and Competitiveness\". Two of my bills focused on supply chain issues are included.","date":"Thu Oct 14 16:32:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨Attention Delaware students🚨\nThe deadline for the Congressional App Challenge is November 1. Don't miss out on the chance to be creative and learn new skills! And, the winner's app will be digitally displayed in the US Capitol. You can learn more here: https://t.co/NaukKUsjp3 https://t.co/a1tZbuRzQN","date":"Thu Oct 14 13:48:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Nearly one in three Americans experienced a weather disaster this summer. We need #ClimateActionNow — which is why I'm fighting to invest in clean energy, American innovation, and resilient communities in Delaware and nationwide.","date":"Wed Oct 13 18:51:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"2021 brought:\n🌡 The hottest summer on record\n🔥 Monster wildfires and brutal heat waves\n🌨 Over $100 billion in damage from extreme weather events\n\nThe devastating impacts of climate change are evident. We need #ClimateActionNow!","date":"Wed Oct 13 17:42:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to be at Dover High School on Monday night for the announcement of Delaware's 2022 Teacher of the Year. Congratulations to @BSDk12 special education teacher Jahsha Tabron on her win! https://t.co/zn0VkEn71D","date":"Wed Oct 13 15:01:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is the first federally recognized #IndigenousPeoplesDay. I hope you'll take some time to read about the significance of this day as we celebrate the history, cultures, and contributions of Native peoples across the country. https://t.co/0pgYH0qIXQ","date":"Mon Oct 11 14:14:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I stopped by the @CHEERDELAWARE Center in Georgetown this afternoon to see their new and improved kitchen, a $1.9 million investment for the Center. \n\nThe updated kitchen will help CHEER continue to support Sussex County's seniors. Thank you to CEO Ken Bock for showing me around! https://t.co/feRXsj8C5Q","date":"Fri Oct 08 19:17:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Supporting the critical work health care centers provide to the people of Delaware is a top priority of mine. \n\nI'm grateful to have spent time in Georgetown this morning with La Red Health Center CEO, Brian Olson, to discuss issues impacting La Red's daily operations. https://t.co/AZMRHr9nWr","date":"Fri Oct 08 16:37:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Investing in our communities is vital to helping us #BuildBackBetter. With $100 million from the #AmericanRescuePlan, Delaware will be able to support nonprofits and community centers' capital projects to help communities hit hardest by the COVID-19 pandemic","date":"Fri Oct 08 15:21:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Losing a parent leads to an increased risk of mental health problems. That's why I'm fighting for kids to get the help they need.","date":"Fri Oct 08 13:43:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Laps on the famed \"Monster Mile\" and protection from COVID-19? Sounds like a win-win to me.   \nhttps://t.co/uC0n7CCHuK","date":"Wed Oct 06 20:50:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One of the key lessons of the #COVID19 pandemic has been the need to create more resilient and reliable #SupplyChains. Proud to join @RepMalinowski &amp; @RepKinzinger in this important and bipartisan effort.","date":"Wed Oct 06 17:02:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This isn't some Washington insider political maneuver. Here's what default might mean 👇🏽\n\n· Social security checks stop \n· Troops don't get paid \n· 401(k)'s take a big hit\n\nThis isn't a game. Senate Republicans need to stop treating it like one.","date":"Wed Oct 06 13:42:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's about building back better with equity. \n\nI joined @NCCDE yesterday for the announcement of $30 million from the #CARESAct and #AmericanRescuePlan for affordable housing investments in New Castle County. Housing is infrastructure and we must prioritize access to it. https://t.co/JwPLjnSwsF","date":"Tue Oct 05 20:58:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder that applications for Service Academy Nominations are open on my website until Friday, October 15th. Don't miss out on the chance to attend one of our nation's prestigious Service Academies. https://t.co/3t2GXlmRBm","date":"Tue Oct 05 16:06:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to be at @delawaretech this morning with @JohnCarneyDE to announce up to $50 million in funding from the #AmericanRescuePlan for workforce development initiatives in Delaware, including $15.8 million to Delaware Pathways Program and Forward Delaware. https://t.co/e1HqdxQF8V","date":"Tue Oct 05 14:03:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was an honor to hear from @POTUS in our caucus meeting today. We’re committed to sending both the #InfrastructureBill and the #BuildBackBetter Act to his desk. 💪🏽","date":"Fri Oct 01 22:17:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to Millsboro's Toni Short on receiving a national Jefferson award for her service work to help  Delawareans who are experiencing homelessness. Thank you, Toni, for your commitment to helping Delawareans get back on their feet.\n\nhttps://t.co/dqXyAzkW5u","date":"Fri Oct 01 17:15:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is the last day of #ChildhoodCancerAwarenessMonth. Although September is ending, I remain committed to supporting kids and their families who are impacted by childhood cancer. We must continue to work to find a cure. https://t.co/Dwp8N832EZ","date":"Thu Sep 30 19:00:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm proud that 4 of my pieces of legislation made it into this critical package, and look forward to working with my colleagues to continue battling the opioid and mental health crisis in our country that has been made worse by the #COVID19 pandemic.","date":"Wed Sep 29 16:15:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There's a lot going on in Congress today, but in my opinion, one of the most important might not make the headlines. \n\nToday, the @bamhtf unveiled our legislative agenda to battle opioid addiction and mental health challenges. It's about help &amp; hope. https://t.co/jb2BYwprud","date":"Wed Sep 29 16:15:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Glad to see that several historical locations throughout Delaware have been added to the National Votes for Women Trail for our role in helping women fight for the right to vote. Looks like it's time for a road trip to visit these areas!\n\nhttps://t.co/RUk0vSg0xz","date":"Wed Sep 29 14:31:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans like Sean Saxton are doing extraordinary things every day. I'm inspired by his commitment to provide more support to Delawareans fighting cancer and aim to break a world record at the same time. Good luck, Sean! https://t.co/gp0XrCG1j7","date":"Tue Sep 28 19:28:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Across the country, states are enacting restrictive voter laws that make it harder to register to vote. On this #NationalVoterRegistrationDay, make sure your voice is heard in upcoming elections by checking your voter registration information here ⬇️https://t.co/aw1fiqGUfx.","date":"Tue Sep 28 16:12:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to Middletown’s Joseph Hill, a Purple Heart recipient who will be honored in New York this week for his service and sacrifice during his time with the Marines. \n\nhttps://t.co/9DpG8Xep11","date":"Tue Sep 28 13:25:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Last year, over 93,000 Americans, including 447 Delawareans, lost their lives to drug overdoses. This #RecoveryMonth, I’m committed to spreading awareness and supporting those in recovery. You can find resources here: https://t.co/sapt9dbMg8","date":"Mon Sep 27 20:16:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations to Delaware’s General Vavala on this well-deserved appointment to the board of governors of United Service Organizations (USO) Inc.! https://t.co/h5pgJNbQJw","date":"Mon Sep 27 18:48:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Leading by example 💪","date":"Mon Sep 27 17:35:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#BuildBackBetter For Women. https://t.co/3yTZsEdulB","date":"Fri Sep 24 18:43:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I was proud to vote alongside House Democrats to pass the Women's Health Protection Act. Equal access to abortion care—everywhere—is essential to social and economic participation, reproductive autonomy and the right for women to determine their own lives. #WHPA https://t.co/7esZXZ39L2","date":"Fri Sep 24 17:47:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Fact: when women succeed, America succeeds. I was honored to stand alongside my colleagues and advocates this morning to highlight how the #BuildBackBetter Agenda invests in the women of our nation. https://t.co/lDC20QBVL2","date":"Fri Sep 24 17:02:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The House needs to pass the #WomensHealthProtectionAct because abortion is health care. Women have the constitutional right to reproductive health care and the #WHPA will codify the right to safe and legal abortions for women in every state in the nation. https://t.co/Z4Wq02eXTd","date":"Fri Sep 24 15:11:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thinking of and praying for the friends, families, &amp; colleagues of Senior Firefighter Jerry Fickes, Lieutenant Christopher Leach, &amp; Senior Firefighter Ardythe Hope on this solemn day - 5 years after their last alarm. https://t.co/hKHjbB7e0Y","date":"Fri Sep 24 14:17:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A government shutdown in the midst of a pandemic would be nothing short of catastrophic. \n\n@HouseDemocrats have already voted to responsibly fund the government and lift the debt ceiling. It's time for Senate Republicans to do the same. \nhttps://t.co/NCLuKSIhtd","date":"Fri Sep 24 13:05:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to have voted tonight to pass the National Defense Authorization Act for FY 2022. This bipartisan funding bill invests in our service members, strengthens our national security, and advances our leadership in the world. It also includes $18 million in funding for Delaware!","date":"Fri Sep 24 01:33:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let's keep this up, Delaware! Take a moment today to call a friend, family member or neighbor to remind them to #GetVaccinated so we can protect our communities and move toward a healthier future.","date":"Thu Sep 23 17:05:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Everyone please be careful out there! (And thanks to @tfurlong &amp; all the reporters braving the elements to keep us informed)","date":"Thu Sep 23 16:22:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important information below for those attending #FireflyFestival in Dover this weekend ⬇️","date":"Thu Sep 23 15:49:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What's true in D.C. is true in Delaware and all across the country. Gun violence trauma spans generations. That's why we must start addressing gun violence for what it is - a public health crisis.\nhttps://t.co/04xEFp5BUx","date":"Thu Sep 23 13:32:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In order to recover from this pandemic and #BuildBackBetter, we need to invest in the middle class. @POTUS' plan will help us do just that.","date":"Wed Sep 22 17:12:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Tonight, I voted to keep the government of the United States open and operating to ensure that we can provide vital services including disaster relief and the resettlement of Afghan evacuees fleeing danger. I’m hopeful the Senate will follow suit and pass this measure. https://t.co/h84RPURUy6","date":"Wed Sep 22 01:24:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #WorldAlzheimersDay, a day dedicated to raising awareness of Alzheimer's disease and how we can improve the research, treatment, and prevention of it. Proud to be the lead sponsor of the #ENACTAct, which would diversify clinical research trials for Alzheimer's disease. https://t.co/1v4uSf7gYA","date":"Tue Sep 21 21:51:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility for the tax cut:\n \nhttps://t.co/AScPdpI8R9","date":"Tue Sep 21 18:45:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, the House will pass a Continuing Resolution to fund the government through December and avoid a government shutdown, which would be catastrophic for families and the economy as we recover from the COVID-19 pandemic. #BuildBackBetter","date":"Tue Sep 21 18:32:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With @HouseDemocrats’ funding bill, we are extending critical education, health, housing and public safety programs. That’s why I am proud to vote for Funding #ForThePeople. https://t.co/ylrOKKP5Gx","date":"Tue Sep 21 18:15:13 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"President Biden is right - climate action is needed now. Let's pass the #BuildBackBetter Act to make historic investments in combating #ClimateChange and expanding our pandemic preparedness.","date":"Tue Sep 21 15:10:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Suspending the debt ceiling isn't a matter of political differences - it's about responsible governance. \n\nThe United States must honor its obligations and ensure full faith and credit. This is a bipartisan obligation.","date":"Mon Sep 20 20:57:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Last week, I joined @JohnCarneyDE, @SenatorCarper, @DE_DTI and others to announce $110 million for Delaware from the #AmericanRescuePlan. This money will make equitable investments in our state's broadband infrastructure to keep Delaware families and businesses connected.","date":"Mon Sep 20 20:20:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this day, 10 years ago, we finally did away with a policy that prevented our #LGBTQ+ servicemembers from living their truth. \n\nA more inclusive military is a more able and capable military. https://t.co/cK5doBwA9U","date":"Mon Sep 20 15:20:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #CitizenshipDay, we celebrate those who made the choice to call America home. Immigrants make our country stronger. That's why we must continue to fight for a pathway to citizenship for Dreamers, TPS holders, farmworkers, and other immigrants in Delaware and across the nation.","date":"Fri Sep 17 23:43:16 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As a member of the #CongressionalFireServicesCaucus, I was honored to join the Delaware Volunteer Firefighter Association's 100th Anniversary Luncheon this afternoon to thank Delaware's volunteer firefighters. Our state is grateful for your selfless work today and every day. https://t.co/zoftCfw1aw","date":"Fri Sep 17 20:30:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Childcare is a key part of helping our economy #BuildBackBetter from the COVID-19 pandemic. We must continue to invest in the future of our children. Thank you to the Delaware Association for the Education of Young Children for hosting me today!","date":"Fri Sep 17 19:13:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing you and your family a meaningful Yom Kippur. https://t.co/tkuFOg9e0d","date":"Wed Sep 15 22:38:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #BuildBackBetter Act Markup  just ended with a vote to move it out of committee. Proud to vote in favor of this historic Act that will:\n✅ Combat #ClimateChange\n✅ #LowerDrugCosts\n✅ #ExpandMedicaid\n✅ Deploy #CleanEnergy\n✅ Protect consumers\n✅ Extend broadband access","date":"Wed Sep 15 20:41:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We’re on day 3 of the @EnergyCommerce #BuildBackBetter Act Markup.  Starting by discussing #PublicHealth, this Act will make long needed investments in our public health infrastructure and pandemic preparedness.","date":"Wed Sep 15 14:21:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder that tomorrow, September 15th, over 38,000 eligible families in Delaware will receive another round of the monthly Child Tax Credit. \n\nDirect relief is possible with the right leadership in place. Thank you, @POTUS!\n\nhttps://t.co/F35EhTBU7t","date":"Tue Sep 14 21:47:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Markup is underway of the historic ##BuildBackBetter Act - a critical first step towards ending our nation’s maternal health crisis. My bill to establish maternal mental health equity grants with a focus on diversifying the maternal mental health/SUD workforce is included.","date":"Tue Sep 14 18:58:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Great explainer from @PressSec about what we're debating in Congress right now.\n\nLet's fight the climate crisis, provide an historic tax cut for middle-class families, and create millions of good-paying union jobs in the process. \n\nLet's pass the #BuildBackBetterAct","date":"Tue Sep 14 18:18:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Day 2 of the @EnergyCommerce markup of the #BuildBackBetterAct. \n\nFrom improving health care to securing our supply chain - lots of important business to take care of. Tune in 👇🏽\nhttps://t.co/3GPdRIrbBe","date":"Tue Sep 14 14:03:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We can revitalize our economy, lower prescription drug costs, create millions of new jobs and combat #ClimateChange. We cannot wait any longer to act. https://t.co/xl02i8PfgZ","date":"Mon Sep 13 16:30:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today’s @EnergyCommerce markup is making one thing clear. In order to actually #BuildBackBetter, we need to invest the people who make this country work — American families, workers and the middle class. The #BuildBackBetter Act is critical to helping us achieve that goal.","date":"Mon Sep 13 16:30:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Getting ready to kick off consideration of the #BuildBackBetter Act in the @EnergyCommerce Committee. \n\nFrom fighting the climate crisis, to improving public health, to helping secure our supply chain - this is a truly transformative piece of legislation. Let's get to work.","date":"Mon Sep 13 14:52:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"History is happening here in Delaware. I was honored to take part in Colonel Cynthia Thornton-Landis’ Promotion Ceremony this afternoon where she became the first black woman Colonel in the history of the @DelawareNG. Congrats Col. Thornton-Landis on this well-deserved promotion! https://t.co/nvSdFUbYdb","date":"Sat Sep 11 22:47:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Few days are seared into the American psyche with more pain or solemnity than September 11, 2001. \n\nAs we mark 20 years since that awful day - let us recommit ourselves to the sacred obligation we made 2 decades ago — never forget. My statement below.\nhttps://t.co/nEOUjPpdSI","date":"Sat Sep 11 12:42:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thanks to funds allotted through the American Rescue Plan, Delaware is hard at work helping children up and down the state get their education back on track because investing in the future of our children has never been more important.","date":"Fri Sep 10 23:14:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This unconstitutional abortion law will impact countless Texas women. Glad to hear that the Justice Department will intervene to protect the right for women to make their own healthcare decisions.","date":"Thu Sep 09 20:08:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To a wonderful champion for Delaware and even better friend - Happy Birthday, @ChrisCoons 🎉 https://t.co/8YPuV14IjM","date":"Thu Sep 09 17:24:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Can’t think of a better choice! Congratulations, Mr. President #HornetsRising","date":"Wed Sep 08 16:36:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A bold and ambitious proposal that meets the scope of our challenge.","date":"Wed Sep 08 14:38:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #LaborDay, we are reminded that American workers are the backbone of our country. \n \nLet us recommit ourselves to ensuring EVERY American has access to good-paying jobs that provide a better life for themselves and their families. https://t.co/lHVaOFribA","date":"Mon Sep 06 13:16:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Bringing care directly to communities helps improve health outcomes. That’s why I’m fighting in Congress to secure federal funds for efforts like @ChooseNanticoke’s mobile health van in Sussex County. https://t.co/djMN6lGtt3","date":"Fri Sep 03 16:55:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Critical info for Wilmington residents today 👇🏽","date":"Thu Sep 02 17:12:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Here’s what’s happening near my home in Wilmington. #ClimateCrisis https://t.co/658L4wmmBB","date":"Thu Sep 02 15:32:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today’s flooding in Delaware is just the latest example of the consequences of the #ClimateCrisis. Neighborhoods like Southbridge are under water every time it rains. We can’t wait any longer for #ClimateAction https://t.co/m8ht1fg8Rr","date":"Thu Sep 02 14:37:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is wrong. Plain and simple. \n\n#SB8, the Texas law, is in direct conflict of SCOTUS precedent and the Constitution. The Supreme Court must act now. \n#BansOffOurBodies","date":"Wed Sep 01 13:24:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Now every time a Delawarean walks into the Post Office in Wilmington, they'll be reminded of the legacy she left. A legacy that inspires us now - and will continue to inspire for generations to come. https://t.co/dVGF5kYVdY","date":"Mon Aug 30 17:53:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to join with @SenatorCarper, @ChrisCoons, family members and descendants of Mary Ann Shadd Cary, and representatives from the @USPS to commemorate this special day. https://t.co/jlJRyHQW8N","date":"Mon Aug 30 17:53:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I was honored to unveil the designation of the Wilmington Post Office as the Mary Ann Shadd Cary Post Office.\n \nMary Ann Shadd Cary was a trailblazer who channeled her gifts to whatever purpose they were most needed in the name of freedom and the purpose of equality. https://t.co/fquJvXlNni","date":"Mon Aug 30 17:53:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Praying for everyone in Louisiana as #idahurricane approaches.","date":"Sun Aug 29 13:33:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am heartbroken for the American service members and innocent civilians that lost their lives in the terrorist attack outside Hamid Karzai International Airport this morning. I condemn these attacks in the strongest possible terms. My full statement below. https://t.co/zsFjOy91LJ","date":"Thu Aug 26 19:45:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Awful and tragic news. Sending my prayers to the colleagues and families of our fallen heroes.","date":"Thu Aug 26 17:21:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m closely monitoring the situation on the ground in Afghanistan and praying for all the victims of the attack. I continue to be in awe of the bravery and commitment of our service men and women on the ground and will continue to pray for their safety.","date":"Thu Aug 26 16:41:13 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Good morning! ⬇️\n\nThe John Lewis Voting Rights Act has PASSED the House! \n#ForThePeople https://t.co/5OWf2v4sm9","date":"Wed Aug 25 13:45:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A truly humbling honor to preside over the passage of #HR4, the John R. Lewis Voting Rights Advancement Act. \n\nWe will continue to fight for the voting rights of ALL Americans #ForThePeople https://t.co/lS0BbQ09bp","date":"Tue Aug 24 23:20:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Still more work to do, but this is a critical step in sending both the Bipartisan Infrastructure Deal AND the budget resolution to @POTUS's desk - as he's said he wants from the outset.","date":"Tue Aug 24 20:24:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let's get this passed today. We don't have a moment to waste.","date":"Tue Aug 24 19:04:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was people like John Lewis who fought, bled, and nearly died for the right of all Americans to vote. \n\nI'm proud to support #HR4, the John R. Lewis Voting Rights Advancement Act, to honor their legacy and keep the promise of our democracy alive for us all. #RestoreTheVote https://t.co/daj64egVo8","date":"Tue Aug 17 17:28:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Heading back to Washington this morning. From infrastructure to voting rights - there are no shortage of issues to tackle. Let’s get to work. #ForThePeople","date":"Mon Aug 23 12:59:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The @DelawareNG serves and protects us each and every day. These citizen soldiers deserve facilities that allow them to achieve their mission. That’s why, right now in Congress, I’m fighting to secure a much-needed upgrade for the @DelawareNG hangar facility in New Castle. https://t.co/YvVGUMG4Wc","date":"Fri Aug 20 17:05:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A special thank you to @CapitolPolice who so ably and professionally dealt with this situation today.","date":"Thu Aug 19 20:08:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Due to the ongoing security situation near the Capitol, my Washington Office will be closed for the remainder of the day. Delawareans in need of assistance can call the Wilmington office at (302) 830-2330","date":"Thu Aug 19 16:01:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A powerful and informative message from @ChrisCoons. \n\nAs always, the entire Delaware delegation - @SenatorCarper, @ChrisCoons, and I - stand ready to assist any Delawareans in need of support.","date":"Thu Aug 19 15:34:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"So great to spend time in Milford with Mayor Campbell and his economic development team to talk about ways to keep Delaware moving forward! https://t.co/YF1ziATjWc","date":"Wed Aug 18 19:59:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s unacceptable that Americans pay 2, 3, and sometimes 10 times more for critical health care than those in other countries. That’s why I joined with @ProtectOurCare and officials from Delaware to say - the time to act is now.  https://t.co/tRcyHjPnps","date":"Wed Aug 18 13:23:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was people like John Lewis who fought, bled, and nearly died for the right of all Americans to vote. \n\nI'm proud to support #HR4, the John R. Lewis Voting Rights Advancement Act, to honor their legacy and keep the promise of our democracy alive for us all. #RestoreTheVote https://t.co/daj64egVo8","date":"Tue Aug 17 17:28:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was my pleasure!","date":"Tue Aug 17 17:10:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Caring for those who fought for our freedoms is a fundamental and sacred obligation. I was honored to spend time this morning in Milford at the Delaware Veterans home to see first hand the incredible work they’re doing to care for our vets. https://t.co/C9zbh4qSSp","date":"Tue Aug 17 15:11:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a happy 75th Independence Day to #India!","date":"Mon Aug 16 19:25:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Spending this morning touring the Hope Center and hosting a roundtable with @NCCDE &amp; @Delaware_DHSS officials to discuss federal legislation I’ve been working on to combat the opioid epidemic along with the wrap-around services the Hope Center provides. https://t.co/fsOtNOEuqA","date":"Mon Aug 16 14:54:59 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Creating good-paying manufacturing jobs is central to a strong economy. Great to spend time with the folks from Shore Industries this afternoon! https://t.co/mZbJK3k1IF","date":"Fri Aug 13 19:44:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One of the primary concerns I’ve heard from small businesses up and down our state is about supply chain stability. It was great to visit with USA Fulfillment in Dover to talk supply chain, and the investments we can and must make at the federal level. https://t.co/7yiwlw3x2R","date":"Fri Aug 13 16:22:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #ChildTaxCredit represents a huge and transformative tax cut for middle-class families. And the second round of payments is hitting bank accounts across the country TODAY. https://t.co/gTAl0CPWFt","date":"Fri Aug 13 15:19:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Kent County is at the heart of what makes Delaware so unique and special. That’s why I’m excited to be spending my day with the Kent County Economic Partnership and business leaders throughout the county to talk about how we can keep Delaware moving forward.","date":"Fri Aug 13 13:03:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Great to spend time at @westsidehealth to see the incredible work they’re doing to help increase Delaware’s vaccination rate. #NationalHealthCenterWeek https://t.co/NT2aPhh9T7","date":"Wed Aug 11 18:45:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s hard to beat the original location, but you can visit Casapulla’s locations throughout the state! https://t.co/AKfes1byvi","date":"Wed Aug 11 15:40:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You can’t visit Elsmere without going to Casapulla’s! It was so great to spend time with Mayor Eric Thompson to talk about how we can support small business in Elsmere and throughout the state. https://t.co/gXRbKqkHPT","date":"Wed Aug 11 15:35:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@karenrogers6abc Of course! My Roxy has her sunglasses ready for all the sun ☀️ https://t.co/3O48eKZMQP","date":"Wed Aug 11 14:10:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With this week's heatwave on the way, a good reminder from @karenrogers6abc about keeping our furry friends comfortable and safe!","date":"Wed Aug 11 13:48:16 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Looking forward to joining my good friend and colleague, @RepRobinKelly for this important conversation. Tune in!","date":"Mon Aug 09 21:00:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m so proud of all the work that community health centers across the state do in Delaware.","date":"Mon Aug 09 15:15:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Henrietta Johnson does so much important work, from helping crush the virus with #covid19 vaccines, to helping Delawareans fill prescriptions, to helping deal with food insecurity with their new community fridge.","date":"Mon Aug 09 15:15:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to visit Henrietta Johnson Medical Center in Wilmington this morning to kick off #NationalHealthCenterWeek! https://t.co/EpmPgFMAuo","date":"Mon Aug 09 15:15:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was so great to spend time at the Arden Concert Gild. Small venues like Arden have been hit hard by the #COVID19 pandemic. That’s why I was so proud to vote the #AmericanRescuePlan to help #SaveOurStages https://t.co/e0Sawjspdj","date":"Fri Aug 06 19:59:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There's no time to waste. Environmental Justice communities MUST be at the center of our work when it comes to climate.","date":"Fri Aug 06 19:30:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Some important news from today’s very encouraging #JobsReport. Let’s keep moving in the right direction, pass historic #infrastructure investment, and continue to #BuildBackBetter","date":"Fri Aug 06 13:40:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Richard Trumka was a true champion of working Americans. I’ll miss his remarkable insight and fierce determination to help lift up others through economic opportunity.","date":"Thu Aug 05 16:51:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud that my #CleanSlateAct is one of the steps listed in this guest essay to ensure that justice-involved individuals have a fair shot at economic opportunity.","date":"Wed Aug 04 14:05:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If we really want to #BuildBackBetter, we need to ensure that families have the resources &amp; support they need to go back to work. We'll create millions of good-paying jobs in the process.\n\nLet's pass the #AmericanFamiliesPlan to ensure we have #PaidLeaveForAll","date":"Wed Aug 04 13:50:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"An incredibly informative and important thread from @TizzyLockmanDE. \n\nSome critical research from @UDelaware about why the pay gap persists and why nationally, Black women earn 63 cents for every dollar a white man makes. \n\nRead more below 👇🏽","date":"Tue Aug 03 21:36:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was such a pleasure to join @SBAIsabel &amp; @ChrisCoons yesterday to hear directly from Delaware small businesses about what we can do to continue to #BuildBackBetter https://t.co/1uziI88328","date":"Tue Aug 03 17:38:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Did you know that last year, Congress created a new program called the Emergency Broadband Benefit to help Americans gain access to affordable internet service? Tonight at 7, I'll be hosting a virtual town hall to answer your questions! \nRegister below⤵️\nhttps://t.co/c1FJuJt6yT https://t.co/L1wSwa2qi2","date":"Mon Aug 02 22:19:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to hear directly from Delaware small businesses about how we can continue to #BuildBackBetter","date":"Mon Aug 02 15:54:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Great to spend some time in Stitch House Brewery in Wilmington with @ChrisCoons &amp; @SBAIsabel to discuss the impact of #PPP &amp; Restaurant Revitalization dollars. https://t.co/5kqebdTuei","date":"Mon Aug 02 15:07:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited for today’s walking tour of Delaware small businesses!","date":"Mon Aug 02 14:29:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#Medicare &amp; #Medicaid are two of the most truly transformative programs ever instituted. It's our responsibility to not only safeguard but strengthen them so that generations to come can reap their benefits.","date":"Fri Jul 30 17:58:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Never in doubt 😅\n\nOn to the next round for #TeamUSA !!!","date":"Fri Jul 30 13:58:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@RepKClark @RepAngieCraig @summitbeer @RepValDemings @BettyMcCollum04 @RepLawrence @JacksAbby @AngieCraigMN .@JoeBiden isn't the only Delawarean who can enjoy a little ice cream! 🍦","date":"Fri Jul 30 13:53:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A beautiful story of hard work and perseverance. Congratulations, Nah'Shon. You've made your family, your city, and your state proud.  \nhttps://t.co/QwDBiVVxnR","date":"Fri Jul 30 13:52:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let's keep going! Vaccines are quick, easy, and effective. Visit https://t.co/h9ihfahl5k to find where to get yours today!","date":"Thu Jul 29 21:25:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Some kind of crisis! #BuildBackBetter https://t.co/MDJjy9oQ5Q","date":"Thu Jul 29 15:10:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That's why I was proud to join @SpeakerPelosi, @SenSchumer, and @LCVoters to highlight the importance of ensuring there is a transformational investment for our climate in any #infrastructure deal.","date":"Wed Jul 28 16:01:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In Delaware, the #ClimateCrisis isn't hypothetical. \n\nWe live it every single day. \nThat's why we need #ClimateActionNow https://t.co/Zo9ne8oHIB","date":"Wed Jul 28 15:59:16 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Equity &amp; #EnvironmentalJustice must be at the center of our infrastructure conversations.","date":"Tue Jul 27 21:26:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What @Simone_Biles did today is a true exhibition of strength. As I always say - there should be no shame in anyone’s game when it comes to mental health. We’re all with you, Simone. ❤️","date":"Tue Jul 27 17:22:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Truly powerful words from Officer Fanone. \n\nThis isn't about politics. It's about truth.","date":"Tue Jul 27 14:34:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"31 years ago we worked together to pass the landmark ADA. \n\nIt continues to serve as a testament to the power of policies of inclusion.","date":"Mon Jul 26 20:42:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's all happening at the @DelStateFair! Come down and check it out. https://t.co/81pFPm8kf0","date":"Mon Jul 26 17:02:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Veterans who have bravely served us deserve mental health care that appropriately accounts for that service. That's why I was proud to introduce the Veterans' Culturally Competent Care Act which I authored with direct feedback from Delaware veterans. https://t.co/P2cernSwGW","date":"Mon Jul 26 15:12:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Baby bunnies, giant produce, and deep fried bacon. It’s officially #StateFairWeek @DelStateFair https://t.co/t3irYZUhq3","date":"Fri Jul 23 19:21:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/AdGudFoOIM https://t.co/aIbOpi33mS","date":"Fri Jul 23 14:25:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/AdGudFoOIM https://t.co/BlbU9C0Kba","date":"Thu Jul 22 21:00:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"So proud to partner with @RepHorsford on this critical bill to help #BreakTheCycle of violence in communities.","date":"Thu Jul 22 17:21:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"✋🏽 Vaccinated.","date":"Thu Jul 22 13:57:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/AdGudFoOIM https://t.co/vJHulb8kTH","date":"Thu Jul 22 00:09:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our voting rights are under attack. \nWe've been here before - but we're not going back. \n\nThe race isn't given to the swift, nor to the strong, but to the one that endures. @TheBlackCaucus https://t.co/7w8YGGKxFk","date":"Wed Jul 21 19:45:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Interim Guidance for the #Justice40 Initiative is an important step toward advancing equity and fighting environmental injustice. I commend @POTUS for issuing this historic guidance.","date":"Wed Jul 21 18:29:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My friend @RepDebDingell is exactly right. We don’t need to accept the false promise that it’s the environment or jobs. It not only can be - it MUST be both.","date":"Wed Jul 21 11:23:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/AdGudFoOIM https://t.co/qdtaDv6bZZ","date":"Tue Jul 20 18:32:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If we want to be different we’ve got to do different. It’s time to #BreakTheCycle https://t.co/3omnK4V9v8","date":"Tue Jul 20 18:07:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing all those who celebrate a peaceful and reflective Eid al-Adha!","date":"Tue Jul 20 14:57:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The @NewDemCoalition understands - it's time to reconnect our communities.","date":"Tue Jul 20 14:26:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We are just 𝟐 days away from the @DelStateFair!\n\nWho are you looking forward to seeing this year in Harrington? ⤵️ https://t.co/ABwD25jJCk","date":"Tue Jul 20 13:56:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/AdGudFoOIM https://t.co/nCOKVUHlXF","date":"Tue Jul 20 01:53:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's actually the first and most fundamental responsibility of government. \n\nVisit https://t.co/zwd1kwSJuk to find out where you can get vaccinated, today.","date":"Mon Jul 19 19:27:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#COVID cases across the country are on the rise for one simple reason - folks still aren't getting vaccinated. Vaccines are safe, effective, and easier than ever to get! #GetVaccinated","date":"Mon Jul 19 16:28:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It should tell us that the Biden #ChildTaxCredit is making a real difference in people's lives. \n\nLet's make it permanent.","date":"Mon Jul 19 16:07:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congrats, Sophie!!! \n\nThere are still so many great #DEwins prizes and opportunities for Delawareans who are still looking to get vaccinated. \n\nVisit https://t.co/grvHdzqgfz now!","date":"Mon Jul 19 15:55:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#RaiseTheWage","date":"Mon Jul 19 15:13:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud that @JohnCarneyDE is signing SB 15 to #RaiseTheWage in Delaware to $15 an hour. It’s long past time to do the same at the federal level.","date":"Mon Jul 19 14:26:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#GoodTrouble https://t.co/BGNaOmpQ2Q","date":"Sat Jul 17 23:36:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s been another exciting and productive week in Delaware! From the Child Tax Credit, to reconnecting Wilmington, to hearing from President Biden - read about what I've been up to in my Weekly Wrap-up! 👇🏽\nhttps://t.co/YyjQUiLqfQ","date":"Fri Jul 16 18:59:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"DID YOU KNOW: the Biden #ChildTaxCredit has expanded to $3,000 per child ages 6-17 and $3,600 per child under the age of 6? Learn more at https://t.co/PLflGBh4mi. 🔁 Retweet to help spread the word!","date":"Fri Jul 16 18:00:17 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Delta variant is real and it’s dangerous. Help protect yourself and your community! #GetVaccinated","date":"Fri Jul 16 16:35:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We know this past year was difficult, and help is here!\n\nThe #ChildTaxCredit will provide MILLIONS of American families with financial support they NEED. Find out more at https://t.co/PLflGBh4mi.","date":"Thu Jul 15 18:21:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is a big, big deal. Of all the things we were able to accomplish in the American Rescue Plan, this might just be the most consequential.\n\nThe Child Tax Credit could cut child poverty in this country in half. Help is here.","date":"Thu Jul 15 16:24:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🗣️ Parents, help is here!\n\nThanks to the #AmericanRescuePlan, many families will be receiving the expanded #ChildTaxCredit.\n\nGo to https://t.co/PLflGBh4mi to find out more.","date":"Wed Jul 14 18:42:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS said it himself: the risk right now isn't going too big — it's going too small.\n \nWe need a big, bold reconciliation plan alongside any bipartisan infrastructure bill that meets the needs of working people.","date":"Tue Jul 13 18:21:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Join me Thursday at 9AM for a webinar with the United Way, Metropolitan Urban League, and First State Community Action Agency to discuss the newly expanded monthly #ChildTaxCredit. Register and submit questions here: https://t.co/Km7FrASCVg.","date":"Tue Jul 13 18:12:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Historic infrastructure legislation is within our reach. \n\nLet's reunify Wilmington. https://t.co/GZkqHQKth2","date":"Tue Jul 13 16:48:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you for joining, Mr. Chairman! Working together, we can pass bold infrastructure that delivers for Delaware.","date":"Mon Jul 12 23:11:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was a great day hosting @RepDwightEvans in Wilmington and traveling with him to Philly to talk about #ReconnectingCommunities!","date":"Mon Jul 12 22:30:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we #BuildBackBetter, one of the things we must do is reconnect neighborhoods cut in half by the interstate highway system. Today, I was proud to join with @RepDwightEvans &amp; community leaders and advocates to talk about my Reconnecting Communities Act. \nhttps://t.co/6oJziCebAu","date":"Mon Jul 12 21:47:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to join @ChrisCoons and the @FoodBankofDE  yesterday at their mobile food pantry. These events have been vital to getting Delawareans through the COVID-19 pandemic. https://t.co/YWmdBztERu","date":"Wed Jul 07 15:57:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@RepEscobar is part of what we now call our \"Gallery Group\" for those of us who were stuck in the balcony on 1/6.\n\nI've leaned on her and so many others over these past 6 months. I always say, when it comes to mental health, there's no shame in my game. \n\nAsk for help.💙","date":"Tue Jul 06 15:55:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's so important to remember that those reporters who brought us real-time information about January 6th were, themselves, victims of that awful day. \n\nI was stuck in the balcony with so many of them that day. We need to hear their stories as well.","date":"Tue Jul 06 15:46:59 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to join so many friends in the community for a COVID-19 vaccination event, this weekend. We've made such incredible progress, having reached 70% of Delawareans vaccinated, but we can and must keep going! @DeTvch https://t.co/lDdybhP402","date":"Tue Jul 06 15:36:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing everyone a happy, healthy, and blessed 4th of July. As we celebrate our independence and hard-won freedoms, let us recommit ourselves the pursuit of those ideals enshrined in our founding documents. Happy Independence Day! https://t.co/7f82278pvz","date":"Sun Jul 04 12:46:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We’ll be at Babe Styling Salon until noon for today’s vaccination event! Walk-ins are welcome, so come join us! https://t.co/Gze8f3t8aj","date":"Sat Jul 03 14:43:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"TOMORROW, join me at Babe Styling Studio in Wilmington from 10am-12pm for a vaccination event. $50 cash cards will be given for the first 50 shots! https://t.co/bEKOEsvuN2","date":"Fri Jul 02 17:39:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#BuildBackBetter","date":"Fri Jul 02 14:53:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm so proud to see so many Delawareans doing their part to hit @POTUS' goal of 70% vaccinated by #July4th. If you haven't gotten vaccinated yet, it's not too late! Join me this Saturday at Babe Styling Studio from 10am-12pm for a vaccination event. https://t.co/DKglg6A343","date":"Thu Jul 01 19:13:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Most families do not need to take any action to begin receiving the Advance #ChildTaxCredit. If you aren't required to file a tax return, however, you can use the IRS Non-Filer sign-up tool to be sure you don’t miss out on up to $3,600 per child per month. https://t.co/1labmvEdUQ","date":"Thu Jul 01 18:42:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #ChildTaxCredit that we passed in the #AmericanRescuePlan will help lift millions of children out of poverty and give families the resources they need as we #BuildBackBetter. \n\nBut our work is not done. We must act to make the #ChildTaxCredit PERMANENT. https://t.co/NPbORxr1sx","date":"Thu Jul 01 16:24:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congress hasn't invested in infrastructure in decades and it shows: roads are crumbling, bridges are failing, and water systems are in jeopardy. \n\nThat changes today as @HouseDemocrats vote on the #INVESTAct to modernize our infrastructure and Build Back Better.","date":"Wed Jun 30 18:35:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware! We are SO close to @POTUS's goal of having 70% of Delawareans with shots in arms by July 4th. \n\nLet's make sure we're celebrating our freedom from this pandemic. Join me on Saturday for a vaccination event!\n\nFind out more below 👇🏽\nhttps://t.co/GHhgDuCbpW https://t.co/HMseQ5essk","date":"Tue Jun 29 23:24:17 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We're so close!!! \n\nIf you haven't been vaccinated yet, I'll be at Babe Styling Studio from 10am-12pm on Saturday for a vaccination event. Please tell your friends and come join us! https://t.co/YTXsGfqf98","date":"Tue Jun 29 18:11:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We can't expect different outcomes by taking the same approach. We need to treat community violence for what it is - a public health epidemic. \n\nThat's why I intro’d legislation that makes historic investments in a public health approach to the issue.\n\nIt's time to #BreakTheCycle https://t.co/vx5SqyLKgt","date":"Tue Jun 29 17:52:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to join @RepBarragan in introducing this important legislation. The way our country addresses maternal health continues to be woefully inadequate. This bill will help create a comprehensive national strategy to address this national crisis.","date":"Tue Jun 29 16:46:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As Fourth of July gets closer, make sure you know which roads will be closed throughout the state this weekend. Have a safe and happy holiday!\nhttps://t.co/B9aHq0YU3w","date":"Tue Jun 29 16:18:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Women’s suffrage and the fight for civil rights for Black Americans are deeply connected. That’s why I was so honored to join both the Positively Dover African American Festival and the unveiling of a historical marker for Delaware suffragist Mabel Lloyd Ridgely this afternoon. https://t.co/uu7UOuQuHn","date":"Sat Jun 26 22:18:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We must #BreakTheCycle of violence in our communities and create opportunity and hope for our young people. \n\nWe can do it together. \nWe WILL do it together. https://t.co/KyuQSMd11E","date":"Thu Jun 24 22:30:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It invests in the kind of wraparound services that can not only help address the symptoms of violence but also address the root causes. This bill will not only help break the cycle of violence — it will help create opportunity for our young people and help our communities thrive.","date":"Thu Jun 24 21:39:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The bill would invest in both community and hospital-based violence intervention strategies, as well as job resources and opportunities for violence-affected youth.","date":"Thu Jun 24 21:39:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That's why, today, along with @RepHorsford  &amp; @SenBooker, I introduced the groundbreaking Break the Cycle of Violence Act. \nhttps://t.co/XwKkbM7C8v","date":"Thu Jun 24 21:39:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The violence we've seen in our communities must be treated as what it is - a public health crisis of epidemic proportion. \nhttps://t.co/l74Sm5Ad3d","date":"Thu Jun 24 21:39:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware students: The 2021 Congressional App Challenge is open for applications. You can learn more by visiting https://t.co/31OjRIjQHw. #Congress4CS","date":"Thu Jun 24 17:53:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"TODAY at 3PM, @SenatorCarper, @ChrisCoons, and I are hosting a job fair at the Christiana Mall. More than 40 employers throughout the mall will be accepting resumes and meeting prospective employees for full-time, part-time, and seasonal positions. https://t.co/fkGiXIlVcR","date":"Thu Jun 24 16:29:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The state of childcare in Delaware, and across the nation, is dire. This month, I had the chance to visit a childcare center in Lewes and hear about this crisis directly from them. To truly rebuild post-COVID, we must pass the #AmericanFamiliesPlan. https://t.co/espsgLjrxw","date":"Thu Jun 24 14:26:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Apprenticeships are an incredible stepping stone to secure, well-paying jobs. Pathways to Apprenticeship isn’t just a program, it’s about their participants’ futures. I was pleased to join them today to learn more about their work. https://t.co/e6yqkYNSA7","date":"Tue Jun 22 20:36:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Attention Delawareans:\n\nOn Thursday, @SenatorCarper, @ChrisCoons, and I are hosting a job fair at the Christiana Mall featuring a number of job opportunities right there at the mall. Join our offices and these employers from 3-6 PM! https://t.co/jDfaNBVZnN","date":"Tue Jun 22 15:31:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #ChildTaxCreditAwarenessDay, and checks will soon be coming to more than 38,000 Delaware households! \n\nFind out more below 👇🏽\nhttps://t.co/lGq4EVlrrC","date":"Mon Jun 21 17:16:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Over 38,000 households in Delaware will be receiving the #ChildTaxCredit. \n\nThis is a big part of the #AmericanRescuePlan that will help hard-working families across the country. \n\nVisit https://t.co/PLflGBh4mi for more information.","date":"Mon Jun 21 13:35:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you Delaware Black Chamber of Commerce for having me to celebrate #Juneteenth with you this afternoon! https://t.co/PYD25AF07J","date":"Sat Jun 19 18:25:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to help kick off the Wilmington Library’s Juneteenth Festival as we celebrate it as a national holiday for the first time. https://t.co/ua2KyKnlu0","date":"Sat Jun 19 16:44:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, as we mark the first national Juneteenth, let us celebrate the progress we’ve made, take stock of the work yet to be done, and refuel our mind, body, and spirit for the journey ahead. Today is a day of jubilee. Happy #Juneteenth!","date":"Sat Jun 19 13:03:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Big and important news. We should be focused on building on the progress we've made through the ACA - not tearing it down.","date":"Thu Jun 17 14:13:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Pleased to see such overwhelming and bipartisan support for making #Juneteenth a national holiday. Now, let’s complete the hard work of securing today’s freedoms.","date":"Wed Jun 16 23:37:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"More and more families struggle to pay utility bills but access to safe, reliable, and affordable drinking water is essential to public health. I introduced the Low-Income Water Customer Assistance Programs Act to help ALL households have access to clean water.","date":"Wed Jun 16 20:38:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm so proud of the work being done at the Teen Warehouse. It is about not just storing potential energy that can make us more energy efficient, save costs, and help the planet, but it is also about the potential of these young people. https://t.co/Z8qg21ExC2","date":"Tue Jun 15 19:52:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The LGBTQ #EssentialDataAct will ensure that states have the resources they need to track and document LGBTQ hate crimes. We need this data to guide funding and resource allocation. This bill could save lives and I am proud to be a cosponsor. https://t.co/4e9rztCVTY","date":"Tue Jun 15 19:00:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is the 9th anniversary of DACA. We cannot give up the work to create a pathway to citizenship for our Dreamers, including those right here in Delaware at @DelStateUniv, because #HomeIsHere.","date":"Tue Jun 15 15:34:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This evening I stood with a bipartisan group of colleagues to remember the 600,000 Americans we’ve lost to #COVID19 https://t.co/LCKYKLCVZj","date":"Tue Jun 15 00:42:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On June 14th, 1777, our nation’s flag was adopted as a symbol of valor, independence, and perseverance. \n \n#FlagDay https://t.co/xOnDbOiszK","date":"Mon Jun 14 22:48:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: Last week, I traveled throughout Delaware to highlight how important paid family leave and child care are to our economy. We MUST provide safe and affordable options to keep families in the workforce.  https://t.co/2m8ThZuin6","date":"Mon Jun 14 20:55:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was so proud to be at the Teen Warehouse today as they unveiled 3 incredible clean energy projects they are working on. The entire community--especially the teens who get to work with them--will benefit from their work! https://t.co/tUg8UL6Bma","date":"Mon Jun 14 19:28:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Remembering all those we lost at Pulse Nightclub five years ago. Honor them with action.","date":"Sat Jun 12 16:37:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As @POTUS attends the G7, these are some extraordinary numbers on the world's view of the United States. \n\nThe Biden Admin is truly #BuildingBackBetter everywhere https://t.co/f5Q4K8iKdN","date":"Fri Jun 11 14:52:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Great news 👏🏽 👏🏽 👏🏽 \n\nIf you haven’t signed up yet, visit https://t.co/Y9H4l8h8mh","date":"Wed Jun 09 20:19:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Parents &amp; caregivers can’t go back to work, grow our economy, &amp; build better lives for their families unless they know their loved ones are safe &amp; cared for. That’s why @POTUS &amp; House Democrats are investing in the #CareEconomy. https://t.co/V0Xxr47rLb","date":"Wed Jun 09 19:06:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I've been spending my day traveling up and down #Delaware to highlight the importance of our #CareEconomy. \n\nInvesting in child and daycare will allow our economy to truly thrive and allow our people to live their purpose. Congress must act now to pass the #AmericanFamiliesPlan https://t.co/evLKP1v9PM","date":"Wed Jun 09 18:44:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Had a great start to my day seeing the incredible work being done at Beach Babies Child Care in Lewes. #TheAmericanFamiliesPlan will help get parents the child care support they need to bolster our economy. https://t.co/1SH28vcWcU","date":"Wed Jun 09 15:01:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Looking forward to visiting with DE care providers and small businesses today to talk about the care economy and the resources we’re working to secure in the American Families Plan.","date":"Wed Jun 09 13:26:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If you are a rising high school senior interested in attending one of our nation's prestigious service academies, my office is now accepting applications for the Class of 2026. Applications close on October 15. You can apply &amp; find further info here: https://t.co/9GJAnUlDy8.","date":"Mon Jun 07 17:41:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A truly remarkable thread on the 77th anniversary of #DDay 👇🏽","date":"Sun Jun 06 15:14:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"During #GunViolenceAwarenessMonth, we must reaffirm our fight for common-sense gun safety legislation and commitment to address the root causes of violence.\n\nThe House has passed #HR8 and #HR1446. It’s time for the Senate to do the same. #EndGunViolence https://t.co/3TLl5ObwZ8","date":"Fri Jun 04 17:25:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"So grateful that the entire country now gets to enjoy the grace, wisdom, and fun-loving personality of Dr. Biden that Delaware has come to know and love for so many years. \n\nHappy Birthday, @FLOTUS!!!\n🥳🎂🎁","date":"Thu Jun 03 17:50:59 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was honored to join @SenatorCarper at the new Community Based Outpatient Clinic in Dover yesterday. This critical facility will help our Veterans get the care they deserve. https://t.co/TVD1uvcLGo","date":"Thu Jun 03 14:58:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Terrible news in Wilmington. I'm praying for a full and speedy recovery for all 3 officers and the victims.","date":"Thu Jun 03 11:58:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Excited to join @SenatorCarper to officially open this critical facility to help get needed care to our veterans.","date":"Wed Jun 02 15:51:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Heartbreaking but necessary to hear a President of the United States speak this truth clearly and plainly. #TulsaMassacre","date":"Tue Jun 01 20:47:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is the first day of #Pride Month and I am reflecting on how far we have come in the battle for equality. The work is not yet finished, however, and I am proud to stand with the LGBTQ+ community as an ally as we keep marching forward. https://t.co/5H0D20fytf","date":"Tue Jun 01 16:16:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A true honor to spend time at the Historic Vernon AME in Tulsa today.","date":"Mon May 31 17:46:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There are no words that can properly quantify the debt that we owe those who made that ultimate sacrifice - nor are there words that can bring a full measure of comfort to their families, who themselves have sacrificed immeasurably.","date":"Mon May 31 12:25:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We come together to remember our history, to say the names of the fallen so that we may never forget the humanity of their sacrifice. And we come together to recommit ourselves to those truly unique values we hold so dear. #MemorialDay","date":"Mon May 31 12:25:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"But on #MemorialDay, we come together to shed our political, geographical, religious, and social differences to acknowledge the magnitude of that sacrifice.","date":"Mon May 31 12:25:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The ideals that founded and have sustained this great nation are truly unique and indelible. What makes them, and us, more unique is that so many willingly fight, sacrifice, and die for those values and ideals.","date":"Mon May 31 12:25:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There is simply no greater or profound sacrifice that one can make than to lay down their life for their country. On Memorial Day, we remember and honor those who, in the words of Lincoln, gave their last full measure of devotion. https://t.co/kfzXgCDd5R","date":"Mon May 31 12:25:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"An excellent story from a few years ago about the incredible work Ken did to preserve and tell the stories of Delaware’s Union soldiers from the Civil War #MemorialDay","date":"Mon May 31 12:10:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The ideals for which so many have fought, sacrificed, and died are indelible. No one will break us apart. We are America. #MemorialDayWeekend \nhttps://t.co/zULRmoBikZ","date":"Sun May 30 16:19:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We miss you, Beau. But we know that you live on in your family and all those whose lives you touched. May we all continue to be inspired by your gentle spirit and selfless service. https://t.co/YJzP9bDe9j","date":"Sun May 30 14:37:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans: We've administered 889,500 #COVID19 vaccines, but there's still a long way to go before everyone is fully vaccinated. Get your vaccine by June 29th to win some great prizes! https://t.co/1YYJwpt9fK","date":"Fri May 28 17:20:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"To ensure all Americans have access to safe and reliable drinking water, we must strengthen our nation’s water infrastructure. \n\nThe #CLEANfuture Act would remove lead service lines so that families can trust that the water coming from their taps is safe.","date":"Tue May 25 17:15:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The rise in antisemitism we've seen recently in our country is abhorrent and unacceptable. I stand with our Jewish friends and neighbors as we speak with a loud and unified voice that hate has no home here.","date":"Tue May 25 16:03:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Let us never forget that George’s life mattered — and that the lives of countless others whose names we know and don’t know matter too. But as we mark 1 year since his passing, we can also recognize the truth in the words of his daughter, Gianna — George Floyd changed the world.","date":"Tue May 25 14:19:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"May we continue to change it for the better in his memory","date":"Tue May 25 14:19:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"1 year ago, today, a family lost a brother, a son, and a father. As the mother of a Black son, listening to George Floyd cry out for his mother will haunt me forever. As we mark one year since his death, let us never forget the humanity for which we fight. https://t.co/IGBHOnS2f2","date":"Tue May 25 14:19:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our work is not done. And while the conviction of George Floyd’s killer provided some measure of relief, we cannot and we must not rest until we channel that pain into purpose and turn protest into policy. We cannot rest until we pass the Justice in Policing Act in his name.","date":"Tue May 25 14:19:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I joined the Delaware Library Association this morning to discuss the great work they're doing and the critical role libraries will have as we recover, rebuild, and restore. https://t.co/YKOdqTrHx9","date":"Mon May 24 15:54:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm proud to join in recognizing #MentalHealthMonth to stop the stigma and am working hard to ensure that mental health resources are available to all members of our community. Everyone deserves access to the support they need. #MentalHealthAction https://t.co/pxLk0kABGc","date":"Thu May 20 20:38:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We can’t have healing without accountability. We can’t have reconciliation without truth. We can’t have any of those things without a commission to examine January 6th.","date":"Wed May 19 22:48:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I joined over 100 of my colleagues in calling for an immediate ceasefire in Israel &amp; Palestine. https://t.co/SP6yGNrbw8","date":"Wed May 19 22:07:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"HBCUs have always been agents of equity, access, and excellence in education, especially for Black students. Now is the time to invest in #HBCUInfrastructure. https://t.co/RyEaGzeBY4","date":"Wed May 19 17:52:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The violence in Israel and Palestine is heartbreaking and its further escalation is incredibly alarming. I’m joining with my Congressional colleagues in calling for an immediate ceasefire so that we can advance on a path to peace.","date":"Wed May 19 17:49:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"We can’t #StopAsianHate if we don’t understand the problem. I’m proud to stand with @RepGraceMeng and my @CAPAC colleagues to pass the COVID-19 Hate Crimes Act to ensure better tracking and reporting of hate crime data. https://t.co/5XgSlQrrRG","date":"Tue May 18 18:06:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And today, as @JohnCarneyDE declared May 17th Brown v. Board of Education Day - we recommitted ourselves to not only reflecting on our past but taking care of our students now and in the future.","date":"Mon May 17 22:32:16 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"About a week ago, my dad gave me my first report card. It's from 1969 - not that long after Brown v. Board. \n\nIt made me reflect that so much that impacts learning takes place outside of the classroom. \n\nHousing. Food security. Clean air &amp; water. https://t.co/ZA4eucOBOy","date":"Mon May 17 22:32:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The first 100 days of the Biden-Harris Administration have been nothing short of transformational. \n\nI'm continuing my work in Congress to make sure together we can do 3 things - \n\nRecover. Rebuild. Restore. https://t.co/Pk0UFaV2cd","date":"Mon May 17 20:07:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On International Day Against Homophobia, Biphobia, and Transphobia, I am proud to stand with our LGBTQ+ community against bigotry. To the community: I see you and I love you. I am committed to fighting for a future free of hate.","date":"Mon May 17 19:49:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was so proud to join so many other officials, community members, and students today as @JohnCarneyDE declared today Brown v. Board of Education Day here in Delaware. https://t.co/c5FvaMAUX9","date":"Mon May 17 18:42:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was a pleasure to start my week joining @delawareonline with my colleagues @SenatorCarper &amp; @ChrisCoons to discuss the transformative first 100 days of the Biden-Harris Administration.","date":"Mon May 17 15:13:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I'm proud to be a cosponsor of the Pregnant Workers Fairness Act and am so pleased it passed in the House. No one should have to choose between a healthy pregnancy and their income. It's critical that we #ProtectPregnantWorkers and this bill brings us one step closer.","date":"Fri May 14 15:45:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Many families could receive up to $300/month, per child as part of the advanced monthly #ChildTaxCredit payments I helped pass in the #AmericanRescuePlan. \n\nFile your taxes before May 17 to make sure your family starts getting your payments ASAP. https://t.co/WZzWV5ROT3 https://t.co/hrPkyZ1RcD","date":"Thu May 13 16:03:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Access to the internet = Access to opportunity.\n \nMore and more families are struggling to afford internet service. If this sounds familiar, check out the new EBB program, designed to subsidize your broadband bill and make internet affordable for everyone: https://t.co/S5UCNYGw9R https://t.co/suX9c2YfHd","date":"Wed May 12 22:03:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#EidMubarak to everyone celebrating. I'm wishing you peace as Ramadan comes to a close.","date":"Wed May 12 21:17:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to work with leaders like @HerreraBeutler to introduce the #ENACTAct. \n\nAlzheimer's research needs to represent our communities so that Alzheimer's treatment can be truly effective for everyone.","date":"Wed May 12 15:11:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"May is #AAPI Heritage Month and I am celebrating the countless contributions from the AAPI community in Delaware and across the nation. We must also take this time to recommit to standing against AAPI hate. Learn more here: https://t.co/oOQ6lJXYJ4.","date":"Tue May 11 18:23:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder: #TaxDay is one week away!","date":"Mon May 10 20:25:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is incredibly important news. Everyone deserves access to health care without discrimination, regardless of their sexuality or gender identity.","date":"Mon May 10 17:31:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m so sorry to hear about the passing of former Gov. Pete du Pont. Pete was so very dedicated to our wonderful state and spent his entire career trying to improve the lives of his fellow Delawareans. I’m praying for his family during this difficult time. https://t.co/6PLqqVzO6c","date":"Sun May 09 11:19:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Do it for your mon! #DontWaitVaccinate @TheBlackCaucus https://t.co/DdjUSkbIaZ","date":"Sun May 09 00:09:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I always love getting to speak to my fellow Blue Hens!","date":"Fri May 07 17:22:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The pandemic has been challenging for all of us. Because May is #MentalHealthMonth, I want to remind you that help is available. Delawareans can visit https://t.co/RvgN2Ik0yW or call 833-9-HOPEDE to find mental health resources.","date":"Fri May 07 16:18:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Nurses have shown us time and again what true dedication, compassion, and hard work really mean. \n\nHappy #NationalNursesDay to the incredible nurses protecting our communities in Delaware and across the nation.\n \nThank you. 🏥 https://t.co/0LZWMguRX5","date":"Thu May 06 14:38:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wonderful to see this support making its way to #India. Sending my prayers to the entire country as they face down this wave of #COVID19","date":"Wed May 05 21:34:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The COVID-19 vaccine is safe and effective. With all Delawareans 16 and older eligible, it's critical that everyone gets their vaccine. You can read about some facts and myths about the vaccine from the CDC here: https://t.co/plxnlkqYzG.","date":"Wed May 05 18:55:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is World Maternal Mental Health Day. Supporting mothers and their mental health is so important. That’s why I am so proud of my bill, the Moms Matter Act, which would provide help for moms with maternal mental health conditions &amp; substance use disorders. #MMHWeek2021","date":"Wed May 05 18:04:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this day 60 years ago, 13 courageous Americans, including my friend the late John Lewis, began their historic journey through the South to challenge segregation. \n\nAs we honor the #FreedomRiders, we must recommit ourselves to the fight for justice and equality for all. https://t.co/RlTsUK89M2","date":"Tue May 04 17:54:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Teachers have faced more challenges than ever during the COVID-19 pandemic. I'm so inspired by their dedication to their students as they go above and beyond to teach our next generation. Happy #TeacherAppreciationDay! https://t.co/3mcjwi4uaH","date":"Tue May 04 14:19:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"TODAY @SBAGov is accepting applications for the #RestaurantRevitalizationFund. Visit https://t.co/tkzg768AIZ to apply.","date":"Mon May 03 18:06:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Getting ready to hear from @POTUS as we celebrate 50 years of @Amtrak! https://t.co/J6fjvoML5S","date":"Fri Apr 30 18:46:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder: @POTUS reopened the Health Insurance Marketplace for a Special Enrollment Period through August 15. Go to https://t.co/KUpytQlOks to #GetCovered.","date":"Fri Apr 30 17:18:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#COVID19 vaccines are available for Delawareans this weekend. Registering is encouraged, but walk-ins/drive-ups will be welcome, too.","date":"Thu Apr 29 20:37:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"100 days of choosing hope over fear, truth over lies, and unity over division.","date":"Thu Apr 29 14:22:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What awful and heartbreaking news. Sending my prayers to the family, friends, and colleagues of Cpl. Heacook. \nhttps://t.co/ILwpsktXoe","date":"Thu Apr 29 03:00:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"America is back on the move. Let’s keep going. Let’s #BuildBackBetter https://t.co/IqD7ICoO5c","date":"Thu Apr 29 02:42:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I look forward to working with my colleagues to pass the American Jobs Act and the American Families Plan and sending both bills to the President’s desk. Tonight, we heard from a President with a clear vision and a bold agenda, ready to lead us to a brighter future. #JointAddress","date":"Thu Apr 29 02:27:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m not only incredibly heartened by all the Biden-Harris Administration has already done in the first 100 days, I’m incredibly optimistic about what’s to come. And while we’ve already accomplished a great deal, we know we have so much more to do. #JointAddress","date":"Thu Apr 29 02:27:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Tonight, @POTUS laid out in clear terms his direction and vision for the United States of America. From recovering from this pandemic, to rebuilding in its wake, and restoring  the soul of our nation #JointAddress","date":"Thu Apr 29 02:27:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Honored to be on the committee escorting Delaware's first @POTUS for his first Joint Congressional Address.","date":"Wed Apr 28 23:08:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware Division of Public Health clinics will now have walk-in hours for all Delawareans to get their #COVID19 vaccine ⬇️","date":"Wed Apr 28 15:29:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS knows first-hand the power and impact of our community colleges - not only through the work of @FLOTUS, but because Delaware was one of the first states to offer free community college through our SEED scholarship @delawaretech","date":"Wed Apr 28 13:35:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud that the #CleanSlateAct is now bipartisan &amp; bicameral! \n\nIt's not only the right thing to do, it's the smart thing to do creating new economic opportunities for millions of Americans. \n\nLooking forward to passing this bill in the House &amp; Senate &amp; sending it to @POTUS's desk","date":"Tue Apr 27 20:11:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Another big step in the #FightFor15! I'm going to keep fighting in Congress to #RaiseTheWage for everyone. https://t.co/qWMpcWpUj7","date":"Tue Apr 27 17:32:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: The Shuttered Venue Operators Grant application portal reopened yesterday. \n\nYou can visit https://t.co/FMM79Trjux for more information.","date":"Tue Apr 27 14:55:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"🚨🚨🚨\n\n @DEHouseDems  have voted to release #SB15 from committee - the bill would create a $15 #MinimumWage. \n\nThis is a huge step in our #FightFor15. \n\nRT if you agree - Delawareans deserve a living wage.","date":"Fri Apr 23 23:15:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to represent the 1st State in voting for the 51st.\n\n#DCStatehood","date":"Thu Apr 22 16:09:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Climate leadership is back in the @WhiteHouse \n\n#EarthDay | @POTUS","date":"Thu Apr 22 14:46:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #EarthDay! Today, we recommit to working together to ensure that environmental justice communities have a seat at the table as we transition to a #CleanFuture and create a healthy planet for ALL! https://t.co/5pilI2fBWN","date":"Thu Apr 22 14:00:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Hugely important and consequential bills ⤵️ 👏🏽","date":"Thu Apr 22 13:14:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to join so many of my colleagues from both sides of the aisle to call on the @SBAGov to fix the Shuttered Venue Operators Grant application portal on their website and help #SaveOurStages. https://t.co/u2i5H77mvZ","date":"Wed Apr 21 20:51:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our work is far from over, but make no mistake - today was a step in our long march toward justice.","date":"Tue Apr 20 22:03:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"And while today’s verdict represents accountability delivered in this case - it is now incumbent upon all of us on the federal level to build a more fair and equitable justice system by passing the George Floyd Justice in Policing Act in his memory.","date":"Tue Apr 20 22:03:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"While no verdict will return George Floyd to his family and loved ones, today we can say, there is accountability. Those shocking and painful images forced us to hold up a mirror to ourselves and to our country. We have and we must be forever changed. https://t.co/nSP60Ycr2w","date":"Tue Apr 20 22:03:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, every American 16 years and older is eligible to receive the #COVID19 vaccine. I urge everyone to get their vaccine as quickly as possible to help protect yourself and your community.","date":"Mon Apr 19 15:10:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Started my Monday with a great meeting with the YMCA of Delaware to discuss ways we can strengthen our community. https://t.co/4Lr4jTkerq","date":"Mon Apr 19 14:21:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today marks 100 days since the Capitol insurrection. Feeling especially grateful to come to work in this cathedral of democracy.","date":"Fri Apr 16 15:54:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder: Community Project Funding applications are due TODAY by 5 PM. Visit my website for the application, a resource guide, and FAQ. https://t.co/ecupQUkHFW","date":"Fri Apr 16 14:55:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware - thank you for all your messages and prayers. \n\nI'm safe &amp; I'm well - clear-eyed about the work ahead of us.\n\nBut for tonight, we have one job. To certify the election of @JoeBiden &amp; @KamalaHarris https://t.co/zx9hvWiP41","date":"Thu Jan 07 01:51:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Very proud that my bill #HR1215 passed the House this evening. \n\nThe Fraud and Scam Reduction Act will help protect seniors from malicious scammers by establishing a new office within the Bureau of Consumer Protection. \n\nThanks for your help and partnership @RepWalberg https://t.co/7l8Tp0pZlx","date":"Thu Apr 15 22:09:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In so many ways, the COVID-19 pandemic is a gendered crisis. Women are disproportionately on the frontlines as essential workers *and* as unpaid caregivers at home. Women’s labor keeps our nation &amp; economy running. We need #EqualPay now. #PayCheckFairnessAct https://t.co/wCX1cSJ9ZX","date":"Thu Apr 15 20:35:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"While the seals that have been seen in Lewes are cute, please be sure to give them space. If you see one, you are encouraged to contact @merr_delaware at 302-228-5029. https://t.co/yoYQSrbz58","date":"Thu Apr 15 18:32:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Reminder: Community Project Funding applications are due tomorrow by 5 PM. Visit my website for the application, a resource guide, and FAQ. https://t.co/ecupQUkHFW","date":"Thu Apr 15 15:22:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Getting ready to speak in support of my bill, H.R. 1215, the Fraud and Scam Reduction Act!","date":"Wed Apr 14 17:28:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Working mothers have suffered during the #COVID19 pandemic. They have faced job and economic losses and have been forced to choose between caring for a family member or keeping their job. The impact will last for years unless Congress takes action. #HFANow #PaidSickDays https://t.co/NAOepfGqUr","date":"Tue Apr 13 17:15:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Together we can advance maternal health solutions in Congress to save lives and end disparities. #BMHW21","date":"Tue Apr 13 16:53:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My bill, the Moms Matter Act, which I introduced with @RepJohnKatko &amp; @SenGillibrand, is included in the #Momnibus. This bill would support moms with maternal mental health conditions and substance use disorders. https://t.co/ryZKHUTlRY","date":"Tue Apr 13 16:53:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Black Maternal Health Week is a week of awareness, advocacy, &amp; action to change the state of #BlackMaternalHealth. As a member of the @BMHCaucus, I'm proud to support the #Momnibus – a first of its kind legislative package to address the drivers of these disparities &amp; #SaveMoms. https://t.co/YFnrAVVlth","date":"Tue Apr 13 16:53:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we enter the month of observance, I wish our Muslim community #RamadanMubarak! I’m wishing you a month of peace and blessings. https://t.co/rr7YWoIO3V","date":"Mon Apr 12 20:56:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@fema is now accepting applications for funeral assistance for loved ones lost to #COVID19.\n\nTo apply, call 844-684-6333 or TTY 800-462-7585, Monday through Friday between 9 AM and 9 PM EDT.\n\nFor more information, you can visit https://t.co/z9lNLYIrZu.","date":"Mon Apr 12 19:55:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Beginning today, you can apply to join the National Health Corps in New Castle County and help get the COVID-19 vaccine to your fellow Delawareans. Applications will be accepted until April 12. Visit https://t.co/titpSFVIVC to apply. https://t.co/CthkNN3kEI","date":"Mon Apr 12 18:06:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This weekend, the Wilmington VA is hosting vaccine events in Dover and Georgetown. It’s open to all Veterans and their spouses/caregivers. Learn more here: https://t.co/eEDwdA4d6v.","date":"Fri Apr 09 19:07:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS is right - gun violence is an epidemic in America. I applaud President Biden for taking action to #EndGunViolence. https://t.co/azSYx5vV1e","date":"Thu Apr 08 18:36:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This #HolocaustRemembranceDay, we remember and honor the millions of innocent lives tragically lost. \n\nToday, we recommit to stand against anti-Semitism and all forms of bigotry. We will never forget and we will fight to create a more inclusive and better world.","date":"Thu Apr 08 15:57:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Live venue operators impacted by the #COVID19 pandemic can apply for a Shuttered Venue Operators Grant from @SBAgov beginning tomorrow, April 8.  \n\nLearn more: https://t.co/1nGFEpBrPa. https://t.co/7KSfPReL9M","date":"Wed Apr 07 18:40:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: @DelawareDNREC launched their new Recyclopedia to help Delawareans determine whether an item is recyclable. \n\nJust visit https://t.co/1ZTxc31NX3, search for your item, and find out if it can be recycled.","date":"Tue Apr 06 16:49:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am heartbroken to hear that my friend, Congressman Alcee Hastings has passed away. He lived a life dedicated to public service and I was honored to work with him in Congress. I'm sending my prayers to his family, friends, and constituents.","date":"Tue Apr 06 14:55:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m proud to join @RepAnnieKuster to introduce the S.T.O.P. Fentanyl Act of 2021 to give communities the necessary tools to address the opioid epidemic through education, prevention, and treatment.","date":"Mon Apr 05 20:13:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to join @SenatorCarper and @ChrisCoons to answer Delawareans’ questions about what's in the #AmericanRescuePlan.","date":"Mon Apr 05 19:07:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@POTUS has declared this week #NationalPublicHealthWeek. \n\nThank you to all of the incredible public health workers who have dedicated themselves to keeping us safe and healthy during the #COVID19 pandemic. #NPHW","date":"Mon Apr 05 17:43:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am wishing a healthy, peaceful, and #HappyEaster to all who are celebrating. https://t.co/bd6jS5PwHn","date":"Sun Apr 04 13:23:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I remain grateful for the courage and commitment of every officer who puts on the uniform to protect those of us with the distinct privilege of working at the Capitol. I will continue to pray for our Capitol Police and for an end to this senseless violence.","date":"Fri Apr 02 19:20:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m also praying for the health and wellbeing of the second officer who was injured. It is difficult to imagine the pain and heartbreak that the entire @CapitolPolice community has experienced over the past year.","date":"Fri Apr 02 19:20:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am deeply saddened by the death of the @CapitolPolice Officer this afternoon and am sending my prayers to their family, friends, and the entire Capitol Police family.","date":"Fri Apr 02 19:20:41 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending my prayers to the @CapitolPolice officers who were injured.","date":"Fri Apr 02 17:45:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Dark patterns lead to alarming outcomes that cause real damage. I’m committed to working in Congress to ban these intentionally manipulative practices designed to extract personal information from users.","date":"Fri Apr 02 17:02:53 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing all who observe a peaceful and meaningful Good Friday. https://t.co/fLVd7yNbJV","date":"Fri Apr 02 16:15:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Wilmington VAMC is hosting a virtual Women’s Health Care Summit next Thursday, April 8, where women Veterans can learn about health care services available to them at the VA. You can visit https://t.co/jhxqhLAaqC for more info and to register.","date":"Thu Apr 01 20:58:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Even as more vaccines are going in arms, it’s still critical that everyone is taking proper precautions to prevent the spread of #COVID19. Keep wearing your mask and social distancing. We can’t let our guard down now. https://t.co/5FQh8cytOJ","date":"Thu Apr 01 19:45:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericanJobsPlan is a bold and transformative proposal from @POTUS that will create good-paying jobs, help combat the existential threat of climate change, and restore America's standing as an infrastructure leader globally.","date":"Wed Mar 31 22:21:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Vaccines for Veterans news:\n\nThe Wilmington VAMC is now offering the #COVID19 vaccine to *all* Veterans, whether or not they are enrolled in VA healthcare, in addition to their spouses and caregivers. \n\nFind more information at https://t.co/eEDwdA4d6v or call 302-633-5200.","date":"Wed Mar 31 19:21:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was my pleasure to join @SecCardona and the folks at Laurel Elementary this afternoon to discuss the implementation of the #AmericanRescuePlan and how we can get our schools safely back open and our kids back in the classroom. \n\n#HelpIsHere https://t.co/8beuuOpFA0","date":"Wed Mar 31 18:13:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #TransDayOfVisibility, a day to celebrate the transgender community.\n\nI am committed to standing beside you against hatred and bigotry. I see you and I love you. https://t.co/a4knT7Im5s","date":"Wed Mar 31 16:45:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you to the doctors tirelessly working on the frontlines of the #COVID19 pandemic to keep us safe and healthy.\n#NationalDoctorsDay https://t.co/Pq9fywFMBI","date":"Tue Mar 30 19:00:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Big #COVID19 vaccination news:\n\nAll Delawareans 16+ will eligible to get their vaccine next week.","date":"Tue Mar 30 15:27:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: @POTUS extended the ACA's special enrollment period by another three months. Go to https://t.co/Y9H4l8h8mh to #GetCovered by August 15th. https://t.co/cfhDr2bZXZ","date":"Mon Mar 29 20:22:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was proud to introduce the #HELPAct last week to help strengthen our #HIV clinician workforce.","date":"Mon Mar 29 19:38:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing all who celebrate a blessed and peaceful Passover. Chag Sameach! #Passover2021","date":"Sat Mar 27 21:33:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Congratulations on 100 years of service @goodwillde!","date":"Fri Mar 26 15:14:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is a National Day of Action and Healing.\n\nThere were 3,800 reported cases of anti-Asian discrimination related to #COVID19 over the past year, 68% of which targeted Asian American women. We must work together to #StopAsianHate.","date":"Fri Mar 26 14:30:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Dark patterns cause real damage and it’s unacceptable that these tech companies won’t make concrete commitments to stopping them. \n\nIf they won’t act, Congress will.","date":"Thu Mar 25 21:16:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m proud to be joining with my colleagues in sending a letter to NCAA President Mark Emmert to get answers on why this happened in the first place.\nhttps://t.co/nSUwMMt9pV","date":"Thu Mar 25 18:43:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The disparities in the treatment of women’s and men's teams in the NCAA's championship tournaments were unacceptable. While I am glad it appears the situation was rectified, I am disappointed it took so many people calling it out to fix it. https://t.co/1YPlTAw84C","date":"Thu Mar 25 18:43:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware Veterans enrolled in VA healthcare:\n\nThe Wilmington VAMC is offering walk-in #COVID19 vaccinations. Go to https://t.co/ADeUShAcWv to learn more.","date":"Thu Mar 25 17:02:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #EqualPayDay, the date women, on average, finally earn what men made overall last year. \n\nWomen’s labor keeps our nation &amp; economy running, especially in a pandemic where women are disproportionately on the frontlines and unpaid caregivers at home. We need #EqualPay now. https://t.co/vHEUzZxxL5","date":"Wed Mar 24 18:54:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I fought to get the #AmericanRescuePlan passed to ensure small towns are not left behind as our nation begins to rebuild. https://t.co/d2f7HtO9Q8","date":"Tue Mar 23 20:38:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It is difficult to continue to find the words to describe the atrocities that only our country endures. Peace in Colorado.","date":"Tue Mar 23 17:20:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On this day eleven years ago, the historic #ACA was signed into law. \n \nBecause of the #ACA, over 133 million Americans, including those with pre-existing conditions, have been able to access quality health care.\n\n@HouseDemocrats and I will continue to #ProtectOurCare. https://t.co/IlgTsIxxHE","date":"Tue Mar 23 14:40:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"If you have experienced financial hardship because of #COVID19, you can apply for emergency rental assistance here: https://t.co/9XAsaIalYx.","date":"Mon Mar 22 22:32:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #WorldWaterDay! I’m a proud cosponsor of the WATER Act – legislation that invests in wastewater infrastructure and helps everyone have access to clean, safe, and affordable drinking water. https://t.co/ow4owO5WMa","date":"Mon Mar 22 21:15:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As I’m wrapping up the week in Washington, I took some time to rewatch my friend &amp; colleague @RepGraceMeng’s testimony. A powerful and poignant reminder of what our Asian American friends and neighbors are enduring right now. #StopAsianHate","date":"Fri Mar 19 22:28:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is why representation matters. Proud to call @SecDebHaaland a friend. https://t.co/zY3LuV1IvR","date":"Fri Mar 19 15:31:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A senior at @DelStateUniv, this remarkable young woman described her history of being brought to the U.S. as her family fled violence, her dreams and aspirations of becoming a physician to serve her community, and the relief she felt DACA was first established.","date":"Thu Mar 18 23:27:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"They deserve a pathway to become full citizens of the only country they’ve ever know, and they deserve to be able to say finally and with confidence, home is here.","date":"Thu Mar 18 23:27:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"But I’ll also never forget as the young woman described the fear and uncertainty she felt in the face of policies trying to claw back the progress we had made. That young woman, and the millions like her throughout the United States, deserve the certainty afforded by this bill.","date":"Thu Mar 18 23:27:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"“I am an American at heart.\" \n\nI’ll never forget those words of a young DREAMer at one of my town halls. \nhttps://t.co/wVBpfpeLIh","date":"Thu Mar 18 23:27:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important tax update:\n\nThe @IRSnews has extended the federal tax filing deadline to May 17, 2021.","date":"Thu Mar 18 18:45:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The Violence Against Women Act is lifesaving legislation that maintains the safety, resources, and protections critical to survivors, especially those in marginalized communities. I’m proud to be a cosponsor of the #VAWA4ALL reauthorization.","date":"Thu Mar 18 16:50:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is what competent and capable leadership looks like.\n\nWe're making great strides in vaccine distribution and the #AmericanRescuePlan will only continue to bolster our efforts.","date":"Thu Mar 18 13:49:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Help is Here. \n\n#AmericanRescuePlan | @POTUS https://t.co/Wrn5KBp4iS","date":"Thu Mar 18 13:14:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been a busy and incredibly productive day in the House. Proud to cast my vote to reauthorize VAWA and send it to the Senate.","date":"Wed Mar 17 22:24:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to stand alongside these remarkable women in our vote for the #ERA. \n\nEquality has no deadline. #ERANow https://t.co/CUl2KEGg2k","date":"Wed Mar 17 20:35:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Happy #StPatricksDay everyone!","date":"Wed Mar 17 16:06:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Last year, I had the privilege of presiding over the House during the passage of the #ERA. \n\nToday, we'll once again come together to affirm that equality of rights under the law shall not be denied. #ERANow https://t.co/JSxkaHwIG5","date":"Wed Mar 17 13:41:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"All veterans in Delaware, regardless of age, who are enrolled in VA health care are now eligible to receive their #COVID19 vaccine. Visit https://t.co/V67ncHhUOG for more information.","date":"Tue Mar 16 20:50:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Now it is official - @DebHaalandNM is the first-ever Native American member of the Cabinet. \n\nKeep marching on &amp; keep making history.","date":"Tue Mar 16 16:42:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important Delaware vaccine update ⬇️","date":"Tue Mar 16 15:42:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You can also visit this Frequently Asked Questions page https://t.co/HgavMCOWHk for answers on eligibility and receiving your payment.","date":"Mon Mar 15 16:34:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Direct payments from the #AmericanRescuePlan began going out over the weekend. @IRSnews has updated their Get My Payment portal and you can check on the status of your payment here: https://t.co/TCM2RCnzKN.","date":"Mon Mar 15 16:34:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"What Rob said ⤵️ 💵","date":"Thu Mar 11 19:32:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Direct payments ➡️ On the way.","date":"Thu Mar 11 19:30:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericanRescuePlan is the law of the land. \n\nHelp is on the way.","date":"Thu Mar 11 19:19:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Good luck Delaware @blue_coats today in the @nbagleague finals! https://t.co/zR7GsQYS9O","date":"Thu Mar 11 18:27:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Always immensely proud to be a colleague of @RepLucyMcBath. \n\nShe's turned her pain into purpose and has dedicated her life to combatting gun violence. Today's vote came in no small part because of her work. \n\nThank YOU, my friend.","date":"Thu Mar 11 17:24:11 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Over 90% of Americans support expanding background checks. Today, I voted to pass #HR8, a bill to do just that. Today, I took action to help #EndGunViolence and keep our communities safe. https://t.co/mF4J3B4mKs","date":"Thu Mar 11 16:38:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"In 2019, almost 3,000 guns were sold to people prohibited by law from owning them after the 3 day waiting period. The #CharlestonLoophole bill would allow the FBI more time to run background checks so we can keep weapons out of the wrong hands.","date":"Thu Mar 11 16:09:48 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today's vote wasn't inevitable.\n\nIt took the work of champions like @RepJayapal \n\nI was proud to work with her to secure direct payments for the American people. We have so much more work to do, but passing legislation like the #AmericanRescuePlan is why we came to Congress. https://t.co/A5EQloTltN","date":"Wed Mar 10 20:52:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #AmericanRescuePlan is on its way to @POTUS's desk. \n\nHelp is on the way.","date":"Wed Mar 10 20:33:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware, I'm headed to the House floor to vote for the #AmericanRescuePlan. \n\nWe need a legislative package that meets this moment. From direct payments, to the Child Care Tax Credit, to vaccine distribution - the #AmericanRescuePlan does that and more. \n\nHelp is on the way. https://t.co/1Qb3WMwooY","date":"Wed Mar 10 19:01:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"March 10 is National Women and Girls HIV/AIDS Awareness Day. We can #StopHIVTogether and reduce the stigma surrounding it. For more information on testing, treatment, and prevention, you can visit https://t.co/OKimUg8ZGH. #NWGHAAD https://t.co/GCCb2ZnpQZ","date":"Wed Mar 10 17:47:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Tomorrow the @TheBlackCaucus is participating in a Town Hall to discuss the impact of #COVID19 on the Black community. They will be answering questions about the disease and the vaccine. You can tune in at 7 p.m. on https://t.co/i89swAI49L or https://t.co/1a6we1lFlr. https://t.co/lOYOylBK3A","date":"Tue Mar 09 17:14:05 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's not a complicated formula - \n\nWorkers do better when unions are strong. \n\nThat's why, today, we're voting to protect the right to organize. #PROAct https://t.co/rSPmNse7wC","date":"Tue Mar 09 15:01:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Yesterday was the 56th anniversary of #BloodySunday. We must honor the legacy of John Lewis, and so many others, by passing the #JohnLewisVotingRightsAct. #RestoreTheVRA https://t.co/BirldzK29j","date":"Mon Mar 08 17:59:35 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you @DelawareNG for helping get vaccines to our seniors!","date":"Mon Mar 08 16:43:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m also thinking of how challenging the last year has been for so many women navigating the Coronavirus pandemic. Let us all take today to recommit to working for all women and getting them the help they need. #IWD2021","date":"Mon Mar 08 13:58:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m grateful to be one of 123 women in the House and am constantly inspired by my incredible colleagues. https://t.co/71Lx36uO0o","date":"Mon Mar 08 13:58:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This #InternationalWomenDay, I’m reflecting on all of the incredible women in my life and those who blazed trails before me. I’m feeling grateful for each of them. https://t.co/oxQ5Pt281a","date":"Mon Mar 08 13:58:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Unfortunately, scammers are preying upon vulnerable individuals during these challenging times. That's why I helped introduce the Fraud and Scam Reduction Act. \n\nRead more about my bill here: https://t.co/wKYsi2p6Od.","date":"Thu Mar 04 18:25:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is #SlamTheScam day. Here are some tips on avoiding Social Security scams. \n\nFor more information or to report Social Security scams, you can visit https://t.co/le3dryimok. https://t.co/mhsakokINY","date":"Thu Mar 04 18:25:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"8 minutes and 46 seconds we will never forget. \n\nTonight, we voted for improved training. \nWe voted for increased transparency. \nWe voted for real accountability. \n\nTonight, we passed the George Floyd Justice In Policing Act.","date":"Thu Mar 04 03:00:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Here's what we're doing with H.R. 1 ⬇️\n\n💵 Fighting big money in politics  \n🗳Expanding voting rights\n🗺Ending extreme partisan gerrymandering \n☑️ Holding elected officials accountable","date":"Wed Mar 03 20:45:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Yesterday, @EnergyCommerce Committee Democrats introduced our clean energy package. I'm proud to have secured some key wins for Delaware. Read more below ⤵️\nhttps://t.co/qkDmD7HPVp","date":"Wed Mar 03 18:03:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Huge and important news. \n\n@POTUS and his entire COVID-19 team have made real advances in our effort to defeat this virus &amp; build back better.","date":"Tue Mar 02 21:39:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we continue to rebuild our economy from this ongoing public health crisis, we must be intentional about how we rebuild. This pandemic has shown the inextricable link between our health, our environment, and our economy.\nhttps://t.co/Bolcd5XK7C","date":"Tue Mar 02 21:30:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"That is why we must build back a stronger, cleaner, healthier, and safer economy. Today, I'm proud to join @SenTinaSmith in introducing the Open Back Better Act of 2021.","date":"Tue Mar 02 21:30:57 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, as we begin #WomensHistoryMonth, I'm thinking of the incredible women in our history that paved the way for so many of us. May we honor their legacies by continuing the fight for equality for women everywhere. https://t.co/ypxx3Y6gr6","date":"Mon Mar 01 22:32:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"ICYMI: The Health Insurance Marketplace has reopened for a Special Enrollment Period. You can go to https://t.co/arYTIuMxPv to #GetCovered until May 15.","date":"Mon Mar 01 18:38:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was a late night in Washington, but I'm extremely proud to have voted to pass @POTUS's American Rescue Plan. \n\nWe need big and bold investment if we're going to crush this virus - we need a package that meets the moment. \n\nThe American Rescue Plan does just that.","date":"Sat Feb 27 13:52:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"There's not a day that goes by that I don't think about John Lewis. \n\nHis spirit and example are a constant source of light and inspiration in everything I do.","date":"Sat Feb 27 02:33:36 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you @CBWGCAUCUS for helping me celebrate the work of Delaware's own Mary Ann Shadd Cary this #BlackHistoryMonth.","date":"Fri Feb 26 18:54:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"While we usually vote using electronic cards, I’ll cast very special votes with a physical card. \n\nToday was one of those days. Incredibly proud to cast my vote for the #EqualityAct https://t.co/SeNeGc21v2","date":"Thu Feb 25 21:35:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, we act for justice. \n\nToday, we act for fairness. \n\nToday, we act for #Equality \n\n#EqualityAct https://t.co/1WmsCzSFKt","date":"Thu Feb 25 16:32:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I want to thank my partners in Washington, @SenatorCarper &amp; @ChrisCoons for their work in making this day possible.","date":"Wed Feb 24 18:01:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we mark the close of Black History Month and prepare to celebrate the remarkable achievements of women throughout March, I can think of no more fitting figure to honor than Mary Ann Shadd Cary.","date":"Wed Feb 24 18:01:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s difficult to put into words the remarkable life and legacy of Mary Ann Shadd Cary. An abolitionist, suffragist, journalist, newspaper editor, and lawyer — she channeled her gifts to whatever purpose they were most needed in the name of freedom. \nhttps://t.co/nCOt6phCaP","date":"Wed Feb 24 18:01:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This evening, we solemnly honored and remembered the 500,000 we have lost to COVID-19. \n\nAs we work to defeat this virus and rebuild together, we will never forget those we lost.","date":"Wed Feb 24 00:19:55 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This month, construction began on a multi-year project to repair the I-95 Corridor in Wilmington. For the latest information, you can visit https://t.co/gRhVuKPAzn.","date":"Tue Feb 23 20:09:17 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"500,000 Americans are grieving the loss of a loved one. They were indeed more than just a number. They were friends, family, and neighbors. My love and prayers are with everyone that has lost someone to COVID-19. https://t.co/sia9l0WHdV","date":"Mon Feb 22 20:29:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Art can be a healing force during times like these. As so many of us are hitting a pandemic wall, please remember to take care of your mental health and do things that bring you joy. Thank you to these healthcare heroes for sharing your gifts with us. https://t.co/iUSNmlqkzK","date":"Mon Feb 22 19:30:18 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Important week in Washington. \n\n@HouseDemocrats are continuing to fight for a bold #COVID relief package that meets this moment while @SenateDems are working to confirm key members of @POTUS’s cabinet. Let’s continue to work #ForThePeople","date":"Mon Feb 22 14:30:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Racial and ethnic minorities are more likely to become infected, be hospitalized, and die from #COVID19, yet are receiving a disproportionately low share of vaccinations.  \n\nJoin @COVIDOversight at 2:30pm ET as we examine steps to ensure #VaccineEquity:  https://t.co/K125XUix87","date":"Fri Feb 19 18:22:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Some big and important news today. America is back at the table.","date":"Fri Feb 19 15:23:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The #USCitizenshipAct provides hardworking people who enrich our communities every day and who have lived here for years--in some cases for decades -- an opportunity to earn citizenship. I’m proud to support this bold reform.","date":"Thu Feb 18 21:32:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"El #USCitizenshipAct ofrece una oportunidad para ofrecerle la ciudadanía a la gente trabajadora, quienes enriquecen nuestras comunidades todos los días y han vivido aquí durante décadas. Estoy orgulloso/a de apoyar esta reforma audaz.","date":"Thu Feb 18 21:32:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I am a proud co-sponsor of the #EqualityAct. It is past time to end discrimination against the LGBTQ community. https://t.co/BthwYsdEe7","date":"Thu Feb 18 18:12:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Don't forget to join me tomorrow at 11 AM for an information session on filing your 2020 taxes. Tune in on Facebook Live or register to join us on Zoom. https://t.co/XcLXd4TynJ https://t.co/KCRxfK3aBG","date":"Wed Feb 17 20:31:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, @FAME_Delaware received a #STEMTalentPipeline grant from @PhRMA in recognition of their FAME. #COVID19 has presented unique challenges for students and this support gives them the tools to succeed. Thank you @WWFH_DE for supporting this outstanding program. https://t.co/yKN4voztRd","date":"Tue Feb 16 19:50:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You can submit your questions in advance here: https://t.co/imCXYCVURd.","date":"Tue Feb 16 16:59:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Join me and the Delaware Taxpayer Advocate on Thursday for a 2020 tax filing information and Q&amp;A session. \n\nYou can join us on https://t.co/iHKIusu8FR or register to join on Zoom here: https://t.co/XcLXd4TynJ. https://t.co/RW4drjRuIh","date":"Tue Feb 16 16:59:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today is all about love. Take the time to (virtually) remind someone you love them today. https://t.co/X6U3RsbpBj","date":"Sun Feb 14 14:50:27 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I remain confident that history will judge the former President - and all who continue to enable him - harshly! \n\nIn the words of MLK, “TRUTH crushed to earth will rise again”!","date":"Sat Feb 13 22:02:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The outcome is upsetting, but I am uplifted by two things. \n\n1)This was the largest and most bipartisan vote to convict a US president and \n\n2) the real patriotism and brilliance of my colleagues who prosecuted the case.","date":"Sat Feb 13 22:02:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Our state &amp; local governments need help. \n\nOur small businesses need help. \n\nOur constituents need help now. \n\nLet's deliver that help, which the American people are demanding in an overwhelming and bipartisan manner, by passing the #AmericanRescuePlan https://t.co/72UcrPzQbw","date":"Fri Feb 12 19:52:32 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Wishing a happy and prosperous #LunarNewYear to all who celebrate!\n\nI'm looking forward to the Year of the Ox! https://t.co/H2w95ZLKI3","date":"Fri Feb 12 15:57:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Slight amendment - Dolle’s to replace the Presidential M&amp;M’s. We’re open to negotiation.","date":"Fri Feb 12 13:21:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Welcome to the New *Delaware* Order \n\nCurrently lobbying for Grottos and Dolle’s taffy to be served in the White House Mess.","date":"Fri Feb 12 13:19:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Amazing. Congrats @CGtwelve_ ❤️","date":"Thu Feb 11 18:41:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This Tweet from @RepLBR has been withheld in response to a report from the copyright holder. Learn more.","date":"Thu Feb 11 03:26:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"How it started. https://t.co/D7emcbkB6e","date":"Thu Feb 11 03:26:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you all so much for the birthday wishes. \n\nMy word for 2021 is impact. \n\nI always tell people to remember what they wanted to do when they were a kid. \n\nSo my goal this year is to spread love, spread joy, and keep dancing ❤️ https://t.co/eW944wGzzn","date":"Thu Feb 11 00:34:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delaware only uses 2.8% renewable energy. \n\nWe now have an opportunity to #BuildBackBetter with clean energy to grow that percentage to create good jobs and healthier environments for our communities.","date":"Wed Feb 10 20:13:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"@MadinahForDE Thank you, my friend!","date":"Wed Feb 10 17:36:26 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"#Unity","date":"Wed Feb 10 14:56:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, @RepJayapal &amp; I led over 100 of our colleagues in calling on Congressional leadership NOT to strip #SurvivalChecks from millions of Americans who've used those checks to help them navigate this crisis. \n\nFolks need help. Taking away that help now makes no sense. https://t.co/KVUv8nw2p5","date":"Tue Feb 09 20:49:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@RepRaskin with a truly moving account of all that’s at stake during this impeachment trial. Incredibly proud to call him a friend and colleague.  https://t.co/y5cUs322dR","date":"Tue Feb 09 20:07:15 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"February is #HeartMonth. Heart disease is the leading cause of death in the U.S. and the most common type, Coronary heart disease, affects 53,000 Delawareans. Join me and @TheHeartTruth in raising awareness about what people can do to protect #OurHearts. https://t.co/gkmkeG507Z","date":"Tue Feb 09 18:44:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is big and important. \n\nA recent CBO study estimates if we #RaiseTheWage, we could lift nearly 1 million Americans out of poverty. \n\nProud to be a member of the @USProgressives","date":"Tue Feb 09 14:20:06 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I hope you take the time to learn a bit more about Rebecca Lee Crumpler today on her birthday.  https://t.co/UaVpuAhiLq","date":"Tue Feb 09 00:16:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"She was a true trailblazer. Her book, ‘A Book of Medical Discourses,’ was revolutionary and featured advice for Black mothers and children at a time when most other doctors ignored their needs.","date":"Tue Feb 09 00:16:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Today, I’m celebrating the birthday of Delaware’s own Dr. Rebecca Lee Crumpler. She was the first Black woman physician in the United States and was one of the few doctors of her time dedicated to caring for freed slaves.","date":"Tue Feb 09 00:16:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This week’s testing locations ⬇️","date":"Mon Feb 08 20:02:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"My bill, the Moms Matter Act, that I introduced with @RepJohnKatko &amp; @SenGillibrand would make help provide support for pregnant and postpartum mothers. \n\nWe're facing a maternal mortality crisis in the United States. The #Momnibus helps us address the crisis head-on. https://t.co/EkwRCc1tFF","date":"Mon Feb 08 19:30:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Proud to be joining with @RepUnderwood, @RepAdams, &amp; @SenBooker to introduce the #Momnibus Act to save lives and end health disparities.","date":"Mon Feb 08 19:30:45 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending my love and prayers to Rep. Wright’s staff and family.","date":"Mon Feb 08 18:49:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"👋🏽 Bill, \n\nI’m with you. In fact, it’s why I just introduced a *bipartisan* bill to maintain the existing thresholds. Restricting the checks isn’t the answer. https://t.co/EobgxZn7WP","date":"Sun Feb 07 16:43:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we rebuild our economy post COVID, restricting the checks isn’t the answer. \n\nWe’ve got bipartisan support to get checks to individuals at $75k and $150k for families in need. \n\nLet’s deliver.","date":"Sat Feb 06 22:31:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I was so impressed by this year's applicants to our nation's service academies. I’m honored to nominate these exceptional students and am looking forward to seeing the incredible leaders they will become! https://t.co/UGd8xgDWq8","date":"Sat Feb 06 18:51:43 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s always so exciting to see a Delawarean in the Super Bowl! We are so #DelaProud of Middletown’s own Chris Godwin. Good luck tomorrow, @CGtwelve_! https://t.co/Od8fyQbJKg","date":"Sat Feb 06 15:27:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s a low bar, Jake 🤷🏽‍♀️\n\nBut very nicely done to @RepSaraJacobs!","date":"Sat Feb 06 03:04:03 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Gun Violence Survivors Week is a reminder of the many ways our country needs community healing in order to address trauma. \n\nNow, more than ever, we need comprehensive public health approaches that treat immediate issues &amp; offer preventative solutions to #EndGunViolence.","date":"Fri Feb 05 22:22:20 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Very much looking forward to an @EPWCmte run by @SenatorCarper &amp; an @EPA run by @Michael_S_Regan. \n\nThe era of climate science denial is over.","date":"Fri Feb 05 21:26:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A recent study by @JAMANetworkOpen found that more than 20% of folks who were earning between $50k - $75k &amp; lost their job reported experiencing food insecurity at some point during the pandemic. \n\nThis is no time to take our foot off the gas.","date":"Fri Feb 05 17:15:16 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Importantly, we also maintain eligibility for individuals making $75k and families making $150k. In the midst of a public health &amp; economic crisis, our risk isn't doing too much - it's not doing enough.","date":"Fri Feb 05 16:15:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Direct relief for families in the midst of a pandemic shouldn't be a partisan issue. That's why I'm introducing the Coronavirus Assistance for American Families Act w/ @RepMcKinley to provide $1,400 for individuals and an additional $1,400 for dependents. https://t.co/IjNMsxOCfn","date":"Fri Feb 05 16:15:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"You can tune in to watch my floor speech here ⬇️\nhttps://t.co/RozMesoxrj","date":"Fri Feb 05 15:04:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On the floor, getting ready to speak about my amendment to the National Apprenticeship Act. \n\nIt’s an incredibly important bill led by @BobbyScott &amp; his team to create more apprenticeship opportunities. \n\nMy amend. would open up more opportunities to nontraditional populations. https://t.co/LSu4olphRu","date":"Fri Feb 05 15:00:59 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The member from Georgia doesn't deserve any more attention than she's already received. \n\nShe also doesn't deserve to sit on any committees in Congress.","date":"Thu Feb 04 23:53:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Eugene Petty never let others define who he was &amp; because of that determination, forged a path and example we’d all be wise to follow. .https://t.co/4L7TXmuR7v","date":"Thu Feb 04 15:28:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I’m keeping his family and friends close in my prayers and ask all Delawareans to join me in expressing our gratitude for his remarkable service. Thank you, Chief Petty.","date":"Thu Feb 04 15:28:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"History was made today when Pete Buttigieg was sworn in. I’m ready to get to work and build back better. Congratulations @SecretaryPete!","date":"Wed Feb 03 21:59:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Just one more reason to support the American Rescue Plan\n\nAll Americans deserve a living wage.","date":"Tue Feb 02 20:05:24 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"→ National vaccination program \n\n→ Direct relief for American families \n\n→ Support for communities who are struggling \n\nThe Biden-Harris Admin. has rolled out a bold &amp; comprehensive American Rescue Plan that meets the moment. https://t.co/0nvF5KsVG9","date":"Tue Feb 02 16:26:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This isn't a partisan issue. Our state &amp; local partners need relief and they need it now. \n\nThe risk isn't in doing too much - it's not doing enough.","date":"Mon Feb 01 19:39:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This week’s pop-up test sites ⬇️ \n\nPlease note that all of today’s testing events have been cancelled due to inclement weather.","date":"Mon Feb 01 15:33:54 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This #BlackHistoryMonth, I look forward to raising up the voices and stories of Black Delawareans and Americans who have helped build this nation. \n\nBlack History IS America's History. https://t.co/QPmcitZPZI","date":"Mon Feb 01 15:02:34 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Right now, phases 1A and 1B are eligible for the vaccine. https://t.co/0F81rhVTHT","date":"Sat Jan 30 16:50:40 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I wanted to make sure that Delawareans have the latest vaccine resources. For the most recent information, be sure to visit https://t.co/wZOfE46Jlx. https://t.co/GsqJVcFDXF","date":"Sat Jan 30 16:50:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"12 years ago, President Obama signed the Lilly Ledbetter Fair Pay Act. Unfortunately, we still see a wage gap, especially among women of color. \n\nThe fight for equal pay for equal work is not over. It’s time to close the wage gap and pass the #PaycheckFairnessAct.","date":"Fri Jan 29 20:01:12 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Did you know today is EITC Awareness Day?\n\nI'm joining my friends at Nehemiah Gateway at 1:30 for a discussion on the importance of the Earned Income Tax Credit. If you have any questions want to know if you qualify, you can register at the link below!\nhttps://t.co/bPRd5CwoHH","date":"Fri Jan 29 18:12:49 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Affordable &amp; accessible health care has been one of my top priorities since coming to Congress. \n\nToday, the Biden-Harris Administration took bold steps to strengthen Medicaid &amp; the ACA, protect women's health, and open a special enrollment period for the marketplace. https://t.co/kp5N2bDKMv","date":"Thu Jan 28 20:35:44 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@SenatorCarper has been working steadfastly with @EleanorNorton for years for #DCStatehood. \n\nIt's about fairness. It's about equity. \n\nWe need #DCStatehoodNow https://t.co/agP3CbZzLR","date":"Wed Jan 27 21:08:25 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This International #HolocaustRemembranceDay, we remember and mourn the millions of lives lost in the Holocaust. We must also recommit to standing against anti-Semitism and bigotry in all forms.","date":"Wed Jan 27 14:58:38 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was great to join @matt_odonnell to recap the inauguration and discuss what lies ahead for @POTUS.","date":"Tue Jan 26 20:36:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS and the entire Biden-Harris Admin. are committed to racial equity - not to be relegated to some far-off office or department - but as the lens through which we view all policy we make.","date":"Tue Jan 26 19:21:47 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As @POTUS has long said - this is not only the right thing to do, it's in our national interest. Proud that this admin. is already putting equality at the center of their agenda.","date":"Mon Jan 25 16:54:52 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This is an incredibly exciting program that’s about being bold, having impact, and creating trust.","date":"Mon Jan 25 15:55:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"This week’s pop-up testing sites ⬇️","date":"Mon Jan 25 15:19:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Join us for this incredibly exciting announcement as we continue to put our CARES dollars to work for Delaware.","date":"Mon Jan 25 14:34:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"He’s always been there for me and for our entire state. Wishing you a very happy birthday, Mr. Chairman - @SenatorCarper 🎉 https://t.co/J1cIJIESBp","date":"Sat Jan 23 14:56:21 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"When people can make decisions that are best for their lives, families thrive and we build healthier communities where each of us can participate with dignity. \n\n48 years after #RoevWade, THAT is the future we’re fighting for. #ReimagineRoe","date":"Fri Jan 22 19:12:33 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"While I’m relieved that the situation was resolved, our troops should never have been moved off the Capitol complex. They’ve put their lives on hold to defend us - they deserve to be treated with respect.","date":"Fri Jan 22 13:56:58 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@DelawareNG - you give me faith. You give me hope. \n\nAnd we love you. https://t.co/93XYMPMxD2","date":"Thu Jan 21 22:58:04 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A special note of congratulations to Private Shields, who we had the privilege of watching be promoted to Specialist Shields.","date":"Thu Jan 21 21:41:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The men and women of the @DelawareNG have put their lives on hold to defend our democracy since January 6th. \n\nI couldn't be more grateful - and I was honored to have the chance, with @ChrisCoons &amp; @SenatorCarper, to say thank you. https://t.co/XWii9Exjey","date":"Thu Jan 21 21:39:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As we close out this day of celebration and begin the hard work of healing and building back better, I want to emphasize something - \n\nTonight, the White House is occupied by a man of great character, empathy, &amp; decency. That matters. It matters a great deal. https://t.co/TLA1TrvZ0S","date":"Thu Jan 21 02:27:09 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"A President for all Americans.","date":"Thu Jan 21 00:31:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":".@POTUS made clear in his inaugural speech that the truth would be a priority of this administration. \n\nIt's already so refreshing to see a true professional like @PressSec Jen Psaki working hard to give the American people a clear and full accounting of the Biden Admin's work.","date":"Thu Jan 21 00:14:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":". @POTUS is taking action on Day 1. There’s no time to waste and much work to do.","date":"Wed Jan 20 23:08:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Hey @JohnCarneyDE, what do you think of making January 20th a second #DelawareDay? https://t.co/iHnh3LIazW","date":"Wed Jan 20 19:51:46 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It’s a new day in America. \n\nLet’s get to work.","date":"Wed Jan 20 17:42:23 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"So glad the whole nation was able to bear witness to the profound voice that we in Delaware know - as Rev. Silvester Beaman offered his powerful prayer for our nation.","date":"Wed Jan 20 17:34:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Amanda Gorman. My goodness.","date":"Wed Jan 20 17:26:01 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Mr. President &amp; Madam Vice President https://t.co/CSPTGVa61V","date":"Wed Jan 20 16:49:22 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Soon. \n\n#InaugurationDay https://t.co/HwHBITiqmk","date":"Wed Jan 20 14:59:31 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Delawareans 65 years and older: \n\nYou can sign up to request a #COVID19 vaccination appointment now. https://t.co/orYiNlHNUr","date":"Wed Jan 20 14:35:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It really is a good morning. \n\n#InaugurationDay https://t.co/cWm7pqQvAb","date":"Wed Jan 20 13:00:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"With this evening’s #COVIDMemorial, we honor and remember those we’ve lost. \n\nI hope you’ll join us for this moment of national unity and reflection.","date":"Tue Jan 19 21:59:10 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"48 years ago, we sent him to the Senate. \n\nToday, Delaware officially sends its favorite son to Washington to be sworn in as our next President. \n\nWe simply couldn't be prouder, @JoeBiden","date":"Tue Jan 19 19:06:50 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"One more day. \n\n#WhenHopeAndHistoryRhyme","date":"Tue Jan 19 12:54:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It was my pleasure to join The Dr. Martin Luther King, Jr. Celebration Organization of Sussex County and the Zeta Rho Lambda chapter of Alpha Phi Alpha for worship services this morning to reflect on Dr. King’s legacy and recommit to leading with love. https://t.co/wBexcDIcy8","date":"Mon Jan 18 17:29:51 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"On #MLKDay, we celebrate a man who devoted his life to helping this nation heal while leading in love. \n\nAs we, once again, approach a moment that requires that healing, let us follow his example of service. \n\n#ADayOnNotADayOff https://t.co/llAh9EoqvK","date":"Mon Jan 18 13:08:07 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Thank you so much to @RepPerlmutter  &amp; @ChrisCoons for helping make this happen and welcome to our newest fellow citizen, Spc. Jun Cho!","date":"Sat Jan 16 23:36:00 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"As @JoeBiden says - it’s not political. It’s patriotic. Wear a mask. https://t.co/9ihsoyarnm","date":"Fri Jan 15 22:19:02 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"It's been an incredibly difficult few weeks after an incredibly difficult year. \n\nDon't forget to take time for yourself &amp; time with those you love. Those are the truly important people &amp; times in life.","date":"Fri Jan 15 16:14:42 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Healing &amp; unity begin with truth &amp; accountability - but accountability doesn't end with impeaching Donald Trump. \n\nThat attack didn't come out of nowhere. \n\nAnd accountability isn't just about one man - it's about the ideology that made this possible.","date":"Fri Jan 15 14:09:08 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I want to extend a special note of thanks to @DelawareNG who put their lives on hold for their deployment to defend democracy. We can’t thank you enough for your service.","date":"Thu Jan 14 16:07:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"After having time to reflect on the attack on the Capitol last week, I sat down with @TheAtlantic to talk about what happened and what comes next. https://t.co/s1IQdXDhJe","date":"Wed Jan 13 23:48:19 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Donald Trump is a clear &amp; present danger to the country. \n\nThat's why I voted to impeach him. https://t.co/hSwDV4aS4J","date":"Wed Jan 13 22:17:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"The rioters tried to shake us, but they did not break us, and today, one week after they attacked &amp; in the cathedral of our democracy that they stormed, we voted to hold Donald Trump accountable. \nhttps://t.co/SZsXUwQrFw","date":"Wed Jan 13 21:37:28 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Heading to the floor to exercise the most serious and somber remedy afforded to Congress. \n\nWe are exercising it because the facts are clear - \n\nDonald Trump is a clear &amp; present danger to our country. He must be impeached and removed. https://t.co/oKzHAdykwC","date":"Wed Jan 13 20:09:30 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Truth comes before reconciliation. \n\nAccountability comes before healing. \n\nThe rioters tried to shake us but they did not break us. And today, we vote to hold Donald Trump accountable. https://t.co/blisAv3HeL","date":"Wed Jan 13 15:29:39 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"I've been thinking a lot about the prescient words of my colleague @RepAdamSchiff from nearly a year ago. \n\nWe once again find ourselves at an inflection point of history. \n\nDonald Trump did not change. But today, we once again have the opportunity to stand up and say - enough.","date":"Wed Jan 13 14:37:29 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Since the attack on the Capitol last Wednesday, I've been self-isolating and recently took a COVID test. \n\nI feel very lucky &amp; fortunate that my results came back negative. \n\nThank you to everyone who has reached out with your concerns &amp; prayers. https://t.co/muxV9ipLVr","date":"Tue Jan 12 22:14:14 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending you my love &amp; prayers @RepBonnie ♥️","date":"Tue Jan 12 17:48:37 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending you my love and prayers @RepJayapal ♥️","date":"Tue Jan 12 17:47:56 +0000 2021","user_id":"817050219007328258"},{"handle":"RepLBR","text":"Sending you my love &amp; prayers @RepSchneider ♥️","date":"Tue Jan 12 17:47:19 +0000 2021","user_id":"817050219007328258"}]