[{"handle":"RepLoudermilk","text":"https://t.co/HpFpIdsE1F","date":"Wed Jun 15 21:56:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[5/5] This type of behavior is irresponsible and has real consequences -- including ongoing death threats to myself, my family, and my staff.","date":"Wed Jun 15 16:25:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[4/5] and, to my knowledge, no one in that group was criminally charged in relation to January 6th. Once again, the Committee released this letter to the press, and did not contact me.","date":"Wed Jun 15 16:25:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/5] This false narrative that the Committee and Democrats continue to push, that Republicans, including myself, led reconnaissance tours is verifiably false. No where that I went with the visitors in the House Office Buildings on January 5th were breached on January 6th;","date":"Wed Jun 15 16:25:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/5] As Capitol Police confirmed, nothing about this visit with constituents was suspicious. The pictures show children holding bags from the House gift shop, which was open to visitors, and taking pictures of the Rayburn train.","date":"Wed Jun 15 16:25:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/5] The Capitol Police already put this false accusation to bed, yet the Committee is undermining the Capitol Police and doubling down on their smear campaign, releasing so-called evidence of a tour of the House Office Buildings, which I have already publicly addressed.","date":"Wed Jun 15 16:25:21 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Happy Birthday to our beloved United States Army. Thank you to all who have served with courage and commitment - for freedom. https://t.co/QxbpcgnXGu","date":"Tue Jun 14 21:04:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we celebrate our flag, a symbol of freedom and hope around the world. #FlagDay https://t.co/6ly7KIkEM1","date":"Tue Jun 14 18:07:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"and a small group visiting their congressman is in no way a suspicious activity. Now the Capitol Police have confirmed this fact.","date":"Tue Jun 14 12:02:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"🚨BREAKING🚨: The truth will always prevail. As I’ve said since the Jan. 6 Committee made their baseless accusation about me to the media, I never gave a tour of the Capitol on Jan 5, 2021… https://t.co/qBoLcmxnYQ","date":"Tue Jun 14 12:02:09 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden is planning a trip to Saudi Arabia to beg them to produce more oil, after he campaigned saying he’d punish them for human rights abuses. \n\nThe flip-flop is predictable, but the question is, why go at all when we can produce all the oil we need here in the U.S?","date":"Mon Jun 13 21:30:42 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing a variety important issues on my weekly podcast. \n\n➡️Jan 6 Committee :45\n➡️Gun control bills 3:30\n➡️Inflation 5:38\n➡️Kavanaugh assassination attempt 6:20\n➡️Top issues for Americans 7:18\n\n#OneOnOneWithBarry https://t.co/rsfF9h23TK","date":"Mon Jun 13 14:06:56 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Consumer Price Index (CPI), which is a key indicator of inflation, was 8.6% year-over-year. Experts were predicting 8.3%. \n\nThis means inflation has yet to peak and Americans took a real wage cut of 3.4%. #BidensAmerica","date":"Fri Jun 10 14:34:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] to increase the number of resource officers and mental health counselors in schools, increase funding to harden our schools, and provide active shooter training for officers, teachers, and students. #SecureEverySchoolandProtectOurNationsChildrenAct","date":"Thu Jun 09 16:46:14 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] The problem in America is not too many guns, but too many people with no respect for the rights of others and the law.\n\nHowever, I am in favor of solutions that will work, like working with my colleague Rep. Richard Hudson (R-NC) on a bill to use unspent COVID funds…","date":"Thu Jun 09 16:46:14 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] This week, I stood against more gun control legislation put forth by the Dems in the House. More gun laws  won’t solve the problem -- because guns don’t kill people…people kill people.","date":"Thu Jun 09 16:46:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The House received Senator @JohnCornyn's bill to PROTECT Justices of the Supreme Court 30 days ago, after it passed the Senate UNANIMOUSLY. But listen to the excuse Speaker Pelosi gives as to why the House has yet to vote on it… https://t.co/L9vQFSa9Vu","date":"Thu Jun 09 15:37:14 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This is disturbing, given a man was just arrested outside Justice Kavanaugh’s house this morning for wanting to kill him.\n \nThe Left needs to condemn ALL violence and stop the #DemocratDoubleStandards and hypocrisy. https://t.co/92BEkeReyf","date":"Wed Jun 08 16:49:27 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to the class of 2026 — the nineteen young men and women from Georgia’s 11th Congressional District selected to attend one of our prestigious military academies. \n\nhttps://t.co/HdGzFppKUh","date":"Tue Jun 07 17:24:09 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing rising prices, the economy, and Biden's misguided push for gun control on my weekly podcast.\n\nRising Prices :03\nGeorgia gas prices :53\nEconomy 1:43\nCrime wave 4:41\n\n#OneOnOneWithBarry https://t.co/2YKlh62aBa","date":"Mon Jun 06 18:53:41 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“With Thy blessing, we shall prevail over the unholy forces of our enemy.... And a peace that will let all of men live in freedom, reaping the just rewards of their honest toil.”\n \n– Franklin D. Roosevelt’s D-Day Prayer, June 6, 1944 https://t.co/jObzYftxXK","date":"Mon Jun 06 11:42:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pres Biden says there’s no way to “click a switch” and fix the gas and inflation crises. That’s meant to lead us to believe they’re new issues; but the fact is, fuel prices &amp; inflation have been surging since the day Biden took office and began implementing destructive policies. https://t.co/dITTfzJpFK","date":"Thu Jun 02 18:12:42 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] A special congratulations to the winners from the 11th Congressional district: \n\nDarshan Addepalli \nKatherine Elizabeth Blair Aide \nJames David Foster\nCarter Williams","date":"Thu Jun 02 13:21:35 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Great to participate in @theaward’s virtual Congressional Award Statewide Ceremony, an award that recognizes initiative, service, and achievement in America’s youth. Thank you for your hard work and dedication. https://t.co/Jqor7XL2Qd","date":"Thu Jun 02 13:21:34 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"And President Biden’s only solution is to double down on the disastrous policies that have imposed crippling inflation and record gas prices on hardworking Americans.","date":"Wed Jun 01 17:53:00 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to work with my colleague @MikeKellyPA on legislation to require abortion providers to screen for a fetal heartbeat before performing an abortion. The abortion would be prohibited if a heartbeat was detected. #HeartbeatProtectionAct #HR705 https://t.co/0lagAWwXh7","date":"Wed Jun 01 12:51:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we come together to honor the men and women who paid the ultimate sacrifice in defense of our freedoms. #MemorialDay https://t.co/KL3sz9Tcqo","date":"Mon May 30 11:05:00 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My friend and fellow veteran, Bob Poston, hosted a town hall for local veterans in Cartersville this week. We discussed a range of issues from how we can reform the VA to how we can fix the crises plaguing our nation. Thank you all for your time and your service to our nation. https://t.co/38G2khebIF","date":"Fri May 27 13:57:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Veterans: In recognition of your service to our country, the Georgia Aquarium is giving free admission on Memorial Day, Monday, May 30. Click the link below for more information. \n\nhttps://t.co/0Lf6czLOIp","date":"Fri May 27 12:00:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the border crisis, the war on American oil, leaked documents, and the priorities of Speaker Pelosi in my weekly podcast. \n\nBorder Crisis :04\nFuel crisis: 1:54\nLeaked documents 4:42\nPelosi priorities 6:31\n\n#OneOnOneWithBarry https://t.co/sUtYbApeHI","date":"Mon May 23 13:21:01 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/VfNLoemyvg","date":"Thu May 19 21:20:40 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] if Title 42 ends\n➡️May 23  – The date President Biden said he will allow Title 42 to expire\n \nThe courts must not allow Title 42 to end!","date":"Wed May 18 19:39:47 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Border crisis facts:\n \n➡️750,000 – number of illegal immigrants Biden’s DHS has released into the U.S.\n➡️1.8 million – number of times Title 42 has been used to expel illegal immigrants\n➡️18,000 – number of daily encounters CBP predicts – more than double current average...","date":"Wed May 18 19:39:46 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"To put ONE month of immigrants crossing our border (234,088) in perspective…that's more people illegally coming across our southern border than exists in 99% of the cities or towns in the United States.","date":"Wed May 18 17:58:54 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden's pick to head this board engaged in misinformation herself by supporting the discredited Steele Dossier and saying the Hunter Biden laptop story wasn't true.\n \nLeave it to the mainstream media to characterize facts as \"right-wing attacks.\"","date":"Wed May 18 16:57:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden is doing everything possible to make the crisis at our southern border worse. But the solutions are simple:\n \n➡️Finish the border wall\n➡️Enforce “remain in Mexico” policy\n➡️Reinstate asylum agreements with El Salvador, Guatemala &amp; Honduras\n➡️Continue with Title 42","date":"Wed May 18 16:54:36 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In Feb, Pres. Biden turned to Saudi Arabia to help alleviate the fallout from his admin’s war on American energy.\n \nToday, the Saudi oil giant Aramco is the richest company in the world, recently surpassing Apple.\n \nThis is just another example of Biden’s ‘America Last’ agenda.","date":"Tue May 17 14:43:37 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden's war on American energy production has resulted in the national gas avg hitting another all-time high of $4.52/gal. Unfortunately, Dems in the Hse are helping Biden by blocking a Repub bill that would help fix this crisis, The American Energy Independence from Russia Act. https://t.co/I7zVV7eHjK","date":"Tue May 17 14:33:37 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The American Energy Independence from Russia Act (H.R. 6858) is a commonsense approach to bringing down our historic gas prices. Among many of its provisions, it would immediately approve the Keystone XL pipeline and restart oil and gas leasing on America’s federal lands. ⬇️ https://t.co/4WarFYN8R8","date":"Tue May 17 13:38:52 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the protests at SCOTUS homes, the baby formula shortage and issues in Ukraine on my weekly podcast. \n\nSCOTUS :03\nBaby Formula 3:16\nUkraine 4:43 \n\n#OneOnOneWithBarry https://t.co/r4pMWvNz0A","date":"Mon May 16 14:44:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] if this shortage became an untenable one, which is why my Republican colleagues and I are demanding answers.","date":"Thu May 12 15:42:05 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The FDA shouldn’t have waited until Wednesday to announce steps it’s taking to help mitigate the baby formula shortage, because signs of an increasing shortage were apparent in early 2021. It’s clear there was no “Plan B” from the FDA… https://t.co/lnMTdA9InG","date":"Thu May 12 15:42:05 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Inflation is getting worse and Americans are paying the price - literally. \n\nHere’s the Republican plan to fix it:\n\n✅Unharness American energy production\n✅End Biden’s trade moratorium \n✅Oppose Democrat’s tax and spend plans","date":"Thu May 12 13:07:01 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Republicans want to increase police funding so they can be better trained and equipped. Unfortunately, the Left has spent the past 2 yrs championing Defund the Police, which has resulted in record crime and a record number of police being killed in the line of duty. https://t.co/25rMw1yb4d","date":"Wed May 11 12:46:24 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to our men and women in law enforcement who place their lives on the line every day to protect us and our communities. #NationalLawEnforcementWeek https://t.co/Mf22r1MFD3","date":"Tue May 10 20:44:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my weekly podcast, I discuss Pelosi’s trip to Ukraine, the economy and the leaked SCOTUS opinion. https://t.co/kRh125Dc3l","date":"Mon May 09 13:23:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/Ygis9fITjf","date":"Sun May 08 11:30:04 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In recognition of Small Business Week, I wanted to highlight some legislation the House recently passed to help small businesses grow and be successful. https://t.co/ayvTZtf7rL","date":"Fri May 06 14:30:32 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Without the military spouses, our men and woman in uniform would have a much tougher job defending our freedoms. Thank you for your dedication and support! https://t.co/rczunRnFIm","date":"Fri May 06 11:53:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s Teacher Appreciation Week, and I congratulate GA-11’s very own Michael Kobito, an AP Music Theory teacher at Woodland High School in Bartow County, on winning the 2023 Georgia Teacher of the Year! https://t.co/CG9M73nPiD","date":"Thu May 05 18:41:11 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“I call on you, my God, for you will answer me; turn your ear to me and hear my prayer.” – Psalm 17:6 https://t.co/TTV13PSBtw","date":"Thu May 05 11:51:43 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Instead, thanks to Biden’s spending spree, the deficit only lowered by $350B.\n\nhttps://t.co/PW37zlxG7V","date":"Wed May 04 23:52:55 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Biden has taken credit for reducing the deficit; but, the truth is if he had done nothing, the deficit would have fallen by $1 trillion in FY22 with pandemic relief winding down (estimate by nonpartisan @USCBO Feb. 2021).","date":"Wed May 04 23:52:54 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all our U.S. military members! #MilitaryAppreciationMonth https://t.co/rnGqrErO7q","date":"Wed May 04 13:28:50 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The activist inside the SCOTUS who leaked info on the abortion opinion has betrayed the trust of their position and should face legal consequences, such as being fired, disbarred, and prohibited from working within the federal government.","date":"Tue May 03 20:52:01 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Here is a look at what’s going up vs. down under President Biden’s leadership:\n \n⬆️Gas prices\n⬆️Inflation\n⬆️Border crossings\n⬆️Crime\n \n⬇️GDP\n⬇️Wages (adj. for inflation)\n⬇️401ks\n⬇️Pensions\n⬇️Biden’s approval rating","date":"Mon May 02 19:43:42 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I had a great visit with the hardworking people at the @UPS SMART Hub in Atlanta, GA. Besides having a state-of-the-art logistical operation, their UPS Browns are classic, and I was honored to don the uniform for a ride-along. Thank you for your time and hospitality @UPSPolicy! https://t.co/FOlA5cnubc","date":"Fri Apr 29 13:14:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Rohit Chopra is the head of the Consumer Financial Protection Bureau (CFPB) in Biden’s admin and doesn't even know the basics of our Constitution… \n\n(Part of my questioning in Financial Services Committee 4/27) https://t.co/cLRogMT2wd","date":"Wed Apr 27 20:11:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"2.5 million encounters\n700,000 got-aways\n \n\"This administration has created the most dangerous situation we have ever seen on the border.” – National Border Patrol Council President Brandon Judd","date":"Wed Apr 27 17:39:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Within moments, Pres Biden eviscerated border patrol for “whipping” migrants, which we now know never happened, yet he can’t seem to find the time to honor National Guard SPC Bishop E. Evans days after he drowned trying to save migrants from drowning. \n \nhttps://t.co/aN1h2Q73vi","date":"Wed Apr 27 15:37:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite Pres Biden saying these border patrol agents would face “consequences” and “pay” for whipping migrants, it turns out they never whipped anyone and they were only doing their job. The president owes them an apology.\n \nhttps://t.co/GtkmJXvOf6","date":"Wed Apr 27 13:41:39 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Evidence suggests the Biden admin is a willful participant in one of the largest human smuggling operations in history and is doing everything in its power to make the crisis worse. SCOTUS should rule to keep the “Remain in Mexico” policy in place.\n\nhttps://t.co/GGdniqO8NB","date":"Wed Apr 27 11:38:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] This will only exacerbate the crises our nation is facing, making our country less safe. I have joined my colleague @RepRalphNorman in a letter to Secretary Mayorkas voicing displeasure with the recent changes.","date":"Tue Apr 26 16:38:59 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] At a time of unprecedented illegal immigration, drug smuggling, crime, and cybersecurity threats, the Biden administration is diverting DHS from its core mission of protecting the homeland, by softening security screening measures in the name of equality. https://t.co/5ZdtcVjMsD","date":"Tue Apr 26 16:38:58 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Good to see the courts instruct the CDC to catch up to the science.\n\nhttps://t.co/FcCDl9WmWq","date":"Tue Apr 19 14:46:03 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"After being sanctioned by Russia for supporting Ukraine, I issued this statement. https://t.co/fYgaz7wrH9","date":"Mon Apr 18 15:00:21 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/0STszSmAH7","date":"Sun Apr 17 11:30:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/qyNC5QTyVg","date":"Fri Apr 15 14:01:30 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Have a blessed Good Friday! https://t.co/68AvCkeETL","date":"Fri Apr 15 11:30:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The two graphs below explain why President Biden blaming Putin for inflation and high gas prices is false, and why his approval rating is only 33%. https://t.co/3iV53ut74T","date":"Thu Apr 14 18:29:30 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With skyrocketing crime across this country, I’m pleased to see Governor Kemp sign HB 218, aka the state’s Constitutional Carry Act, into law. \n\nhttps://t.co/eYjGDB9n3s","date":"Wed Apr 13 19:10:09 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The crisis at our southern border is no longer ‘out of sight, out of mind’ for the Biden Administration. Illegals transported to DC…","date":"Wed Apr 13 14:10:53 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Skyrocketing inflation is causing the majority of Americans a lot of pain and heartache. A recent CNBC poll found:\n \n➡️81% believe we will experience a recession this year\n \n➡️88% are under more financial stress than a year ago\n \n➡️89% think about rising prices ‘all the time’","date":"Tue Apr 12 16:15:08 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden first downplayed inflation fears, then he said it was temporary, then he said it was transitory, then he said it was because of the supply chain, and now he’s saying it’s because of Putin. \n\nLet’s remember just how different candidate Biden was from Pres. Biden… https://t.co/ryoFXr7eut","date":"Tue Apr 12 14:46:09 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Inflation is now at a staggering 8.5% - for ONE reason only…President Biden and the Dems’ big-government socialist spending spree. #MajorFail #Bidenflation","date":"Tue Apr 12 13:39:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden said he’s rescinding Title 42 because the pandemic is over, but he’s extending the moratorium on student loan payments because the pandemic isn’t over…which is it??","date":"Thu Apr 07 21:35:20 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Another example of Democrats wasting American taxpayers hard-earned money: Bidenphones for illegals.","date":"Wed Apr 06 21:08:40 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden shuts down KeystoneXL - a Canada to U.S. pipeline - only to later ask Canada for more oil that will have to be delivered by more expensive means (rail) bc their pipelines are near capacity. This is the kind of thinking that’s given us the highest gas prices in our lifetime.","date":"Wed Apr 06 17:39:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] The president must stop playing games with our national security and immediately…\n \nFinish the border wall\nEnforce “remain in Mexico” policy\nReinstate asylum agreements with El Salvador, Guatemala &amp; Honduras\nContinue with Title 42","date":"Wed Apr 06 13:27:48 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] President Biden has created the worst immigration crisis in our history by undoing the policies that resulted in the most secure border we’ve seen in our lifetime.","date":"Wed Apr 06 13:27:47 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Under the former administration, the ‘remain in Mexico’ policy helped secure our border - to historic lows - because the U.S. was sending 300-400 migrants a day back to Mexico.","date":"Tue Apr 05 21:14:59 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Unfortunately, Pres. Biden’s version of the policy is sending an average of just seven migrants a day, which is contributing to the worst border crisis in our nation’s history.","date":"Tue Apr 05 21:14:59 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While we’ve seen proof the Biden admin is secretly shuttling, throughout the country, the million+ migrants who’ve been apprehended, those figs don’t include got-aways. Here are the those numbers: \n \nFY 2021: 400,000 migrants\nFY 2022: More than 300,000 migrants…and counting","date":"Tue Apr 05 19:07:55 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden’s plan to end Title 42 shows his administration is determined to intensify the worst border crisis our nation has seen. By the end of year, DHS estimates they will beat the record 1.7 million migrants in 2021 due to this disastrous decision.","date":"Tue Apr 05 17:12:43 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to our Gold Star spouses. The sacrifices you’ve made for your family and our country will never be forgotten. https://t.co/anuVUG6YHi","date":"Tue Apr 05 16:54:23 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my weekly podcast, I discussed how Congress must stop dividing us and start working for us. https://t.co/Y1idT7usX1","date":"Mon Apr 04 12:38:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The fact that the former Twitter CEO Jack Dorsey privately briefed Dems who sit on the Hse Financial Services Committee, is more confirmation that Dems are cozy with Big Tech. \n\nIt’s no surprise Big Tech is so comfortable censoring Repubs, bc they know Dems have their backs.","date":"Fri Apr 01 13:14:32 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Biden signals third year of offshore oil-leasing delay in gulf” – Bloomberg 3/29/22\n\nHowever, if you ask Jen Psaki, you get a much different response… https://t.co/mb4Q1dDFcO","date":"Thu Mar 31 18:53:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi and Democrats are devoting a substantial part of the legislative week on a bill to decriminalize marijuana, while the majority of Americans are concerned about skyrocketing grocery and fuel prices. #OutofTouch","date":"Thu Mar 31 13:28:57 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Republicans will curb Bidenflation by embracing the free market economy, not big government socialist spending.","date":"Wed Mar 30 20:53:04 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden’s FY 2023 budget does nothing to address the crisis at our southern border. In fact, it will make it worse. It will:\n\n-Cut Homeland Security by $600 million\n-Cut ICE funding by $150 million\n-Continue catch-and-release\n-Fail to enforce “Remain in Mexico” policy","date":"Wed Mar 30 16:24:00 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With every crisis, Pres. Biden’s poll numbers continue to plummet. Unfortunately, all this has led to is Biden doubling-down on his failed policies. https://t.co/z7VCaB62sD","date":"Tue Mar 29 18:35:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"THANK YOU to all of our Vietnam War Veterans! https://t.co/CluJZ0Ihia","date":"Tue Mar 29 11:13:31 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] The solution is simple: Reverse the big-government socialist policies, restore energy independence, and stop wasteful government spending of taxpayer’s hard earned money.","date":"Mon Mar 28 15:54:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] After a disastrous year, and historic low approval ratings, Pres Biden’s FY 2023 budget does nothing more than double down on the disastrous policies that have brought us record inflation and record high food and energy prices.","date":"Mon Mar 28 15:54:27 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Biden, Ukraine, SCOTUS, and Georgia elections on @Newsmax. https://t.co/VzfmCvcShd","date":"Mon Mar 28 14:08:55 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"America is indebted to those who have served and sacrificed so much for our freedoms. Today, and every day, we appreciate and revere our Medal of Honor recipients. #MedalofHonorDay https://t.co/Q9Y4udjP08","date":"Fri Mar 25 11:30:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This slow trickle of sanctions against Russia is why Americans feel Biden is not doing enough to deter Putin. How many more maternity hospitals and civilian shelters does Putin need to bomb before the Administration imposes every economic sanction in the book?","date":"Thu Mar 24 15:34:08 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"During yesterday’s SCOTUS hearing, which lasted more than 13 hours, it took just 17 seconds to realize why the radical left bulldozed every other potential nominee’s chances and supported Judge Jackson’s.","date":"Wed Mar 23 15:46:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The importance of agriculture cannot be understated, because it provides everything from what we eat to what we wear. The biggest way you can thank our local farmers is to buy locally sourced products. #NationalAgricultureDay https://t.co/5gJaL8kKmM","date":"Tue Mar 22 17:23:15 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden says he shut down Nord Stream 2 to punish Putin, so who was he punishing when he shut down America’s Keystone XL pipeline?","date":"Tue Mar 22 13:35:34 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/7y1UrkJJJL","date":"Mon Mar 21 14:31:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Don was tough, bold, and loved his home state of Alaska. He will be greatly missed, but his legacy will live on. Please join me in praying for his family during this time of loss.","date":"Sat Mar 19 12:49:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] I was living and working in Alaska when I was 18 years old and cast my first votes. That was in 1982, and I voted for Congressman Don Young. I never thought that 33 years later, he and I would be colleagues in the U.S. Congress.\n\nhttps://t.co/VJNCwkrkXs","date":"Sat Mar 19 12:49:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Instead of addressing International unrest, rampant crime, the border crisis, record inflation, or record gas prices, Speaker Pelosi thinks a better use of Congress’ time today is to debate and vote on a bill that has to do with a persons hair…","date":"Fri Mar 18 14:41:32 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This pro-Putin sticker was on the bathroom wall in a House office building on Capitol Hill today…so, I made a point to remove it and put it where it belongs. https://t.co/CpT7Q5B9pR","date":"Thu Mar 17 15:22:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] because we believe, any deal that removes sanctions off the number one state sponsor of terrorism in the world will only endanger the safety and security of the United States and our allies.","date":"Thu Mar 17 14:45:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Not only is a new nuclear deal with Iran a bad idea, the Biden administration is making another national security blunder by using Russia as a mediator to broker a new deal. My Republican colleagues and I stand in firm opposition to this deal\n \nhttps://t.co/xKPjFoHjia","date":"Thu Mar 17 14:45:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Iran’s IRGC supports terrorist organizations like Hezbollah, Houthis, Hashd al-Shaabi, and has given safe haven to senior al-Qaeda leaders…yet President Biden is considering removing the IRGC from the terrorist watchlist? \n\nhttps://t.co/gfxEWuy1RP","date":"Thu Mar 17 13:43:20 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"9 of the 10 states with RECORD LOW UNEMPLOYMENT (including Georgia) are Republican-led states. \n\nhttps://t.co/dtXa7c0lmI","date":"Wed Mar 16 15:29:36 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Powerful speech this morning by Ukrainian President Zelenskyy to Congress. \n\nTune in to National Report on @newsmax at 10:40 AM to hear my take on what the Administration should do to help Ukraine in their fight for freedom.","date":"Wed Mar 16 14:30:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden wants to extend the student loan repayment freeze, an emergency relief measure that should have expired long ago. We are moving on from mid-pandemic policies, and there is no reason to force taxpayers to foot the bill for a government-created program to pay student debt.","date":"Mon Mar 14 16:58:34 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my weekly podcast, I discussed the Administration's war on American oil production. https://t.co/Sr0NRHvvY0","date":"Mon Mar 14 14:02:02 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to work with my colleague @RepMcCaul on legislation to impose sanctions on the Russian banking and oil industries, along with many of Putin’s closest oligarchs. The legislation also calls for providing critical supplies and lethal munitions to Ukraine. #HR6742 #NYET https://t.co/oFri8IzDBm","date":"Fri Mar 11 17:22:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Candidate Biden had a much different mindset than President Biden.\n \nBiden has blamed the energy crisis on Russia, crime crisis on covid, immigration crisis on global warming, inflation crisis on supply chain/private businesses, and the botched Afghanistan withdrawal on Trump. https://t.co/Hoc3Douz1O","date":"Fri Mar 11 14:05:02 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My colleagues and I continue to urge Biden to work with our NATO allies on a tenable solution that will provide Ukraine with additional aircraft.\n \nA bill passed the House last night, which will provide $13.6B in military/humanitarian assistance to Ukraine and our Eur allies. https://t.co/WlLnDvmNA6","date":"Thu Mar 10 14:54:12 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Suspending Georgia’s motor fuel tax is a pragmatic response to the unprecedented crisis we are in due to Biden’s war on American energy production. Thank you Governor Kemp for taking steps to lessen the pain Georgian’s are feeling at the pump.","date":"Wed Mar 09 19:52:02 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Defund America’s oil and gas production = record gas prices\n\nDefund our police = record crime\n\nOpen our southern border = record illegal immigration \n\nReckless gov’t spending = record inflation \n\nWelcome to Biden’s America.","date":"Wed Mar 09 14:12:37 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Gas was $2.20 the day Biden was elected. \n\nGas had gone up to $3.40 before Russia invaded Ukraine. \n\nGas has jumped another 45 cents since the invasion.  \n\nHere’s why you are paying more ⬇️ #BidensGasCrisis https://t.co/33UjNH3Fov","date":"Tue Mar 08 16:34:44 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden's refusal to unleash America's energy production is an unnecessary tax on all American's. https://t.co/fd9e8CRjl3","date":"Mon Mar 07 14:10:46 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden said in #SOTU that no one who makes less than $400 thousand will pay more in taxes, but every American IS paying more for everything. \n\nInflation is taxation. \n\nWe must lower taxes, reduce gov. spending, and stop over-regulating small business, to fix the economy.","date":"Fri Mar 04 15:50:56 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"These clips have not aged well for President Biden.\n \nPutin annexed Crimea while he was VP and is now invading Ukraine.\n \nThis is the result of weakness and appeasement. https://t.co/EMQ7uTaHDg","date":"Thu Mar 03 17:14:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Francis Scott Key penned this poem as he witnessed the British attack on Fort McHenry during the War of 1812. On March 3, 1931 President Herbert Hoover signed a law making this poem, The Star Spangled Banner, the National Anthem of the United States of America. #NationalAnthemDay https://t.co/d5TfDIjygZ","date":"Thu Mar 03 14:43:32 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden likes to tout that he has added more jobs under his administration than any other president in history; but he’s conveniently leaving out that we are still down by 3 million jobs compared to pre-pandemic levels and that there are a record 11 million job vacancies. #SOTU https://t.co/xNFjTdwgvI","date":"Wed Mar 02 20:35:00 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Is it a coincidence that the CDC released new guidelines easing masking and social distancing recommendations the day before Biden was to give his first State of the Union address? \n\nIt’s never been about the science; it’s always been about politics. #SOTU https://t.co/llt3afxAGV","date":"Wed Mar 02 17:43:48 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden’s solution to surging fuel prices is to release just 30 million barrels of oil from our reserves...when we consume 20 million barrels per day. \n\nIf allowed to do so, American oil producers can provide all the oil we need - and export to other nations. https://t.co/ZYAKpgwzfJ","date":"Wed Mar 02 15:39:12 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"20 Multiple Rocket Launch Systems\n5 Surface to air missiles\n200 Infantry vehicles\n1,000 Mobility Vehicles\n20 Multi-role fighter aircraft\n40 Ground attack aircraft\n17 Mi-35 helicopters","date":"Wed Mar 02 01:52:56 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Since Putin began building forces along the Ukraine border, the Biden admin. has purchased over $9 Billion in oil from Russia. With that $, Putin could buy all on this list and have money left over. \n \n515 Tanks\n10 Short range ballistic missiles\n30 Ka-52 helicopters\n⬇️","date":"Wed Mar 02 01:52:56 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The problem with Biden sending Ukraine $350 million in military aid is that the U.S. is also funding Putin’s war machine, by purchasing almost $350 million in Russian energy EVERY WEEK.","date":"Tue Mar 01 18:40:30 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This…👇 because in 2021, the United States imported more gasoline from Russia than any other country, due to Biden shutting down American-produced energy. https://t.co/yRCB0HzwT5","date":"Tue Mar 01 13:36:54 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Do you think Biden still believes climate change is the “greatest threat” to U.S. security?","date":"Mon Feb 28 21:10:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My thoughts on Russia's invasion of #Ukraine https://t.co/5FzTwl3DiW","date":"Mon Feb 28 14:59:56 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you @Delta for standing with the people of Ukraine, putting principle above profit.\n\nhttps://t.co/LINPV7E9Bc","date":"Mon Feb 28 02:38:33 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Never forget, Biden TWICE filibustered Janice Rogers Brown, a black woman nominee to the U.S. Court of Appeals - which is often a trajectory for future #SCOTUS justices.\n\nhttps://t.co/Xh4g8xu8cJ","date":"Fri Feb 25 19:48:35 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] by resuming construction of the Keystone XL pipeline and reversing his policies that have restricted our domestic oil production, which ended our energy independence.","date":"Thu Feb 24 19:28:11 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] While Biden’s sanctions are appropriate, he’s only working one side of the equation. He could easily insulate Americans from the significant increase in gas prices that will result from sanctioning Russia","date":"Thu Feb 24 19:28:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our prayers are with the people of #Ukraine as they fight for their freedom.","date":"Thu Feb 24 15:08:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"You have to give it to the Ukrainians, they aren’t just folding under the Russian invasion. They are fighting to take back the airport; and the National University has closed, as students are taking up arms and fighting for their freedom.","date":"Thu Feb 24 14:10:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Moments after declaring war on Ukraine, Vladimir Putin  has ordered Russian forces to move into Ukraine. Russia’s goal is to reestablish the former USSR, and Putin will try to destroy anyone who dares stand in his way. Ukraine is fighting for their freedom tonight.","date":"Thu Feb 24 03:17:03 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Wishing Raymond the best tonight on Jeopardy. You’ve made KSU/Ga-11 proud!\n\nhttps://t.co/EzJtkRmI7a","date":"Tue Feb 22 21:05:12 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Before this tweet, Putin annexed Crimea while Biden was VP. \n\nAfter this tweet, Biden green-lighted Nord Stream 2, Senate Dems blocked Russia sanctions, and now Russia is invading #Ukraine. \n\nYou’re not going “toe-to-toe” with Putin, Mr. President, you’re kowtowing to him.","date":"Tue Feb 22 17:50:38 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In honor of George Washington, the first president of the United States, Happy #PresidentsDay https://t.co/N3dAKlm8Pd","date":"Mon Feb 21 12:30:06 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My family and I were heartbroken to learn of the passing of my friend and colleague from Minnesota, Rep Jim Hagedorn. Jim loved our country and stood for freedom, and he will be missed.  Please join me in praying for his wife Jennifer and his family during this difficult time.","date":"Fri Feb 18 15:17:41 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I will be questioning the Capitol Police Inspector General today about Speaker Pelosi weaponizing the Capitol Police to go after political opponents. \n\nYou can watch the hearing live at 3:00 pm ET ⬇️\n\nhttps://t.co/1IIoyqyben","date":"Thu Feb 17 16:10:04 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I have joined my colleague @RepDLesko on legislation to address the problems we are seeing at our southern border. Among its provisions, it will require DHS to detain an illegal immigrant convicted of an aggravated felony. #BorderCrisisPreventionAct https://t.co/sU2jNhTYbm","date":"Wed Feb 16 12:45:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Americans are fed up with the Dems hypocrisy and double standards. The Speaker must stop the ridiculous, arbitrary rule- making.","date":"Tue Feb 15 12:58:04 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In California, where Speaker Pelosi is from, political and Hollywood elites were allowed to pack suites full of unmasked spectators to watch the Super Bowl. But for the upcoming State of the Union, the Speaker is limiting attendance to 25 members from each party… https://t.co/cKXZEgZX4K","date":"Tue Feb 15 12:58:03 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"2016 - Hillary Clinton campaign spied on Donald Trump \n\n2022 - Speaker Pelosi spied on Republican Rep. Troy Nehls \n\nIf they spied on them, they’ll certainly spy on you. I won’t stop until we get to the bottom of this unlawful behavior.\n\nhttps://t.co/rQ5J7CjFCG","date":"Mon Feb 14 16:41:39 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is a clip from my interview with Grant Stinchfield where we discussed Speaker Pelosi's weaponization of the Capitol Police. \n\nSubscribe to my weekly newsletter to see the entire interview and many others like it. \n\nClick here to subscribe: https://t.co/lWXpsUBAPz https://t.co/entW0WlhdH","date":"Mon Feb 14 15:32:39 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As Russia’s President, Vladimir Putin, is amassing his forces in Europe, please join me in praying for the brave men and women of our U.S. military who are in Europe, and those currently deploying.","date":"Fri Feb 11 21:37:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Obama’s visit to Capitol Hill yesterday is a sure sign Democrats know they have an agenda and messaging problem, and need all the help they can get!","date":"Fri Feb 11 15:04:43 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Democrats have politicized every aspect of the Coronavirus pandemic. Instead of following science, they ignored and often suppressed the truth. Now that their politics are backfiring, and they’re afraid of losing their political power","date":"Thu Feb 10 12:41:16 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] they’re trying to reverse course on mandates, claiming it’s ‘the science.’ Americans are sick and tired of their hypocrisy and double-standards. #Democrathypocrisy","date":"Thu Feb 10 12:41:16 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Join me on Newsmax tonight at 8pm ET, with @stinchfield1776 to discuss Speaker Pelosi’s weaponization of Capitol Police to go after members, staff, and visitors who dare question her dictatorial rule.","date":"Wed Feb 09 21:15:11 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi has turned the people’s House into a dictatorship, and is apparently using her power to try to destroy her political enemies.","date":"Wed Feb 09 20:05:44 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Just like Obama/Biden weaponized the FBI to illegally spy on the Trump campaign, Speaker Pelosi is now weaponizing the Capitol Police to illegally spy on members and staff, and even visitors to Congressional offices.\n \nhttps://t.co/aRoEWHaXgi","date":"Wed Feb 09 17:01:11 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If President Biden was interested in saving Americans from the crushing cost of gas, he would commit to restoring America’s energy independence, restart construction of the Keystone XL pipeline, and increase oil production in the U.S. now.","date":"Tue Feb 08 19:18:09 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What Biden and his supporters don’t understand is that shutting down oil/gas production in the U.S. doesn’t help the environment. It makes the env. worse bc it requires us to import oil from countries like Russia and Saudi Arabia, which only care about profits, not the envr.","date":"Tue Feb 08 18:42:05 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The video below shows what most Americans already know: The Biden administration doesn’t care about skyrocketing gas prices; they would rather laugh at your concerns and blame everyone else. https://t.co/e7qD12IHZS","date":"Tue Feb 08 18:33:16 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Within a matter of days of Biden taking office, gas prices rose 14%. That was not a coincidence. By cancelling the Keystone XL pipeline, Biden made it clear he was going after American energy production.\n\nToday, gas prices are at a 7 year high.","date":"Tue Feb 08 18:09:06 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Democrat’s #CONCEDESact further blocks domestic mining projects, and oil and gas leasing sales, which increases our reliance on foreign countries like China.","date":"Fri Feb 04 20:34:30 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I have consistently fought for America’s energy independence, which was stripped away in the first days of the Biden administration. We have to restore our independence to return American jobs, a strong economy, and a stronger national defense.","date":"Fri Feb 04 20:34:30 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrat’s #CONCEDESact mentions climate change more than twice as often as national security.\n \nRepublicans understand that China is our greatest national security threat, not climate change.","date":"Fri Feb 04 20:20:33 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Democrat’s #CONCEDESact refuses to ban federal funding for colleges that host programs China uses to steal our intellectual property and technologies, such as Confucius Institute.","date":"Fri Feb 04 20:16:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] We should not be enabling espionage and theft of U.S. technology, funding Colleges that allow our adversaries to operate programs known for nefarious activities, threatening to our national security.","date":"Fri Feb 04 20:16:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Democrat’s #CONCEDESact would give $8 billion to the unaccountable “green climate” slush fund at the UN, which has awarded China $100 million.","date":"Fri Feb 04 19:41:47 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Instead of rewarding China’s bad behavior, I’m working to cut funding for costly and ineffective programs, especially when taxpayer dollars are being used to subsidize countries, like China’s, malign activity.","date":"Fri Feb 04 19:41:47 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrat’s #CONCEDESact costs hardworking American taxpayers a whopping  $325 billion.\n \nI’ve been consistently fighting to stop out-of-control deficit spending, which is currently fueling the highest inflation in 40 years.","date":"Fri Feb 04 16:22:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I’m fighting to cut the size and cost of government, especially those taxpayer dollars being used to fund policies that further divide our country.","date":"Fri Feb 04 15:40:50 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] A lot of the Democrat’s #CONCEDESact has nothing to do with China, like the provision that would provide $5 million to create a Chief Diversity Officer at the National Science Foundation.","date":"Fri Feb 04 15:40:49 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] It’s blatantly obvious to me that this provision will only invite further fraud and corruption from China; and, as repeatedly shown, they have zero interest in curbing their own carbon footprint.","date":"Fri Feb 04 15:16:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Democrat’s #CONCEDESact would make China eligible for financial assistance from the World Banks Group and Asian Development Banks, if it will contribute to “fighting climate change.”","date":"Fri Feb 04 15:16:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrat’s #CONCEDESact does nothing to hold China accountable for their role in the pandemic.\n \nInstead of a partisan witch-hunt investigation into events of January 6, Congress should investigate, sanction, and punish China for its cover-up of the origins of COVID-19.","date":"Fri Feb 04 14:41:42 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrat’s #CONCEDESact would force the U.S. Armed Forces to train troops to combat climate change events.\n \nI’m fighting to restore our military’s moral, readiness, and effectiveness, by eliminating the mandatory ‘woke‘ indoctrination, and re-focus on building a strong military.","date":"Fri Feb 04 14:09:10 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Dems #CONCEDESact would cripple our economic output by complying with short-sighted Paris Climate Agreement, while it does nothing to hold China accountable for their pollution.\n\nI believe we should once again withdraw from the agreement because it is costly and ineffective.","date":"Thu Feb 03 22:00:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrat's #CONCEDESact would expand the visa program, inviting Chinese Communist Party to continue its maligned activity in the U.S.           \n \nWe must prohibit any individual associated with the CCP or the Chinese military from infiltrating the U.S. through our visa program.","date":"Thu Feb 03 21:23:37 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Inflation and crime disproportionately affect lower and middle income areas; yet Biden and Democrats continue to embrace policies that make inflation worse and put violent criminals back on the streets.","date":"Thu Feb 03 17:45:44 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Liberal lawmakers and judges’ intolerance of victims and tolerance of criminals is why the murder rate in the U.S. is at a 25 year high. \n\nThe solution is simple: Support and fund the police, enforce current laws, and prosecute criminals to the fullest extent of the law.","date":"Thu Feb 03 16:17:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] China is a significant threat to our economy and national security; but, Speaker Pelosi’s COMPETES Act, which she and Democrats say will hold China accountable, is 2,912 pages (longer than BBB).","date":"Tue Feb 01 16:48:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] It mentions coral reefs more times than it does China and gives billions to foreign countries to combat climate change. \nThis is another attempt to hide the far left agenda, to get it passed through Congress.","date":"Tue Feb 01 16:48:22 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On this day in 1865, President Abraham Lincoln signed a joint House and Senate resolution that would later be ratified as the 13th Amendment to the U.S. Constitution abolishing slavery. Today, it is commonly referred to as, #NationalFreedomDay. https://t.co/OWixkbiIwO","date":"Tue Feb 01 12:26:17 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Those that lamented the prior administration’s handling of the border, remain oddly quiet as the Biden administration continues to help the cartels cash in on the multi-billion industry that is human smuggling.","date":"Mon Jan 31 19:17:59 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my weekly audio address, I discussed how and why Georgia's economy is among the strongest in the nation. https://t.co/XM4mfA1zkF","date":"Mon Jan 31 15:01:15 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In 2018, I visited Auschwitz-Birkenau, where I toured the concentration camp with holocaust survivor Edward Mosberg. All sixteen of his family members were murdered by the Nazis. #NeverForget #HolocaustRemembranceDay https://t.co/tRs9FzAyS2","date":"Thu Jan 27 20:33:01 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With over a year of ignoring the crisis on our southern border, it’s clear the Biden Administration cares more about Ukraine’s borders than our own. #DemHypocrisy","date":"Wed Jan 26 14:55:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Parents deserve a say in what their kids are being taught in school, that’s why #NationalSchoolChoiceWeek is all about highlighting the options parents have when it comes to finding the best educational fit for their kid’s needs. https://t.co/73m3BPNJLl","date":"Wed Jan 26 13:01:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What a novel idea…the U.K. is about to end: \n\n- Mandated face masks\n- Masks in schools\n- Work from home advisories \n- Mandate passports for nightclubs/events\n- Legal requirement to self-isolate \n\nAre you listening @potus?","date":"Mon Jan 24 18:37:13 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"2.4% - That is the average pay cut Americans got last year, due to rampant inflation under Pres. Biden.","date":"Mon Jan 24 17:05:50 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The pro-life movement is notching wins and gaining steam day by day. And we are eagerly awaiting the SCOTUS decision on the Mississippi law, which is a direct challenge to Roe v. Wade. A decision is expected in early summer.\n\nhttps://t.co/GHXEB2vX0C","date":"Fri Jan 21 18:26:40 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite the President having the favor of a biased media, the backing of big Tech, and control of the House and Senate, the American people are clearly seeing that Biden’s policies are FAILING them.","date":"Thu Jan 20 17:11:20 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In DC, Dem Mayor Muriel Bowser mandated that if you’re 18 or older, you need to show a photo ID and proof of vaccination when entering:\n \nRestaurants\nBars\nNightclubs\nBreweries\nEntertainment venues\nExercise facilities\nMeeting facilities\n \nBUT…it’s racist to require an ID to vote.","date":"Thu Jan 20 16:08:58 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today at 3 pm, I will be participating in a roundtable discussion with Republican Whip Steve Scalise and Financial Service Cmte Ranking Member Patrick McHenry  on the state of our economy, its problems and how we can solve them. \n\nWatch live here: https://t.co/RbLbH7Vf6B","date":"Wed Jan 19 18:42:19 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Senator Schumer has spent the better part of two decades defending the Senate filibuster rule – as seen in this video – but since Biden is President, he’s advocating for its removal. #Demhypocrisy https://t.co/rv4OsmmF8N","date":"Wed Jan 19 14:41:28 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s election reforms, signed into law by Governor Kemp, make it easy to vote and hard to cheat. That’s why Georgia is the rated best in the country on @Heritage Foundation’s #ElectionIntegrityScorecard. https://t.co/EY2zhjp2nn","date":"Tue Jan 18 15:31:15 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of challenge and controversy.” \n\n- Dr. Martin Luther King Jr. \n\n#MLKDay","date":"Mon Jan 17 12:30:06 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@SenSchumer should go outside and tell these young people to go home. The forecast in DC tomorrow calls for a high of 21, with a negative windchill. Additionally, a winter storm is forecast for Sunday. This is not worth people getting hurt.\n\nhttps://t.co/JfQnjxT7Rt","date":"Fri Jan 14 21:20:25 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to see the SCOTUS side with individual Freedom and uphold the U.S. Constitution. \n\nPres. Biden’s vaccine mandate for private businesses is unconstitutional and a gross overreach of power.","date":"Thu Jan 13 23:14:38 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"One-size-fits-all [government] is synonymous with dictatorial regimes, socialist societies, and communist countries. Governments that keep control over the people by stripping the authority from the hands of their local officials…this is what this bill does. https://t.co/nCeT5niTOB","date":"Thu Jan 13 16:12:40 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrats are so desperate to pass their unconstitutional federal election takeover that they hid it in a completely unrelated NASA bill this week.","date":"Thu Jan 13 14:28:20 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden’s America: The highest inflation in almost 40 years and empty store shelves. https://t.co/wk2VgFjdZD","date":"Wed Jan 12 14:26:19 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"15th Amendment of the U.S. Constitution:\n\nThe right of CITIZENS of the United States to vote shall not be denied or abridged by the United States or by any state on account of race, color, or previous condition of servitude. \n\nhttps://t.co/pqZDUvihHW","date":"Wed Jan 12 13:53:04 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] But the President is only talking about reforming elections right after Dems won the WH, the Senate, and the House…after a ‘perfect election’ that had ‘no suppression or fraud.’ \n\nI don’t think the American people are buying what he is selling.  \n\n#Democrathypocrisy","date":"Tue Jan 11 22:41:00 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] President Biden’s comments today in Georgia fell flat. People are scrambling for COVID tests, inflation is continuing to rise, gas prices are high, and the jobs report was a disaster…","date":"Tue Jan 11 22:40:59 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Even his own supporters, like Stacey Abrams, are avoiding him because his administration can’t get a single thing accomplished and are underwater in the polls. #LeaveGeorgiaAlone","date":"Tue Jan 11 21:21:46 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] President Biden’s continued attacks on Georgia’s election law is a futile exercise and an attempt to distract the American people away from his failings as President.","date":"Tue Jan 11 21:21:45 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] If you need help, call the National Hotline at 1-888-373-7888, or text HELP to 233733\n\n#NationalHumanTraffickingAwarenessDay","date":"Tue Jan 11 13:56:38 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Human trafficking is one of the fastest growing criminal enterprises in the world and the victims include men, women, and children. \n\nIf you suspect human trafficking, call the tip line at 1-866-347-2423","date":"Tue Jan 11 13:56:38 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to the Georgia Bulldogs on their National Championship victory over Alabama! What an amazing accomplishment and unforgettable season. #GoDawgs","date":"Tue Jan 11 04:58:11 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pulling for our Georgia Bulldogs in tonight’s National Championship game! #HunkerDown #GoDawgs","date":"Mon Jan 10 23:19:29 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite the highest wage growth in decades, INFLATION has outpaced its growth and resulted in Americans spending more and saving less.","date":"Fri Jan 07 18:07:36 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Tomorrow, SCOTUS will hear oral arguments on Biden’s vaccine mandate for private businesses and healthcare workers. \n\nTo listen live, click on the link below tomorrow at 10 am.\n\nhttps://t.co/1zpja4atV6","date":"Thu Jan 06 21:44:48 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Has the left not learned a thing from their calls to ‘defund the police’ - resulting in skyrocketing crime rates and an influx of smash-and-grab robberies? \n\nThis is clearly rejecting the rule of law and the Constitution.","date":"Thu Jan 06 18:46:35 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden’s vaccine mandate for businesses with 100 or more employees is unconstitutional, which is why I have joined 183 of my Republican colleagues on an amicus curiae urging the Supreme Court to block it.\n\nhttps://t.co/18ceqkYAsj https://t.co/7Y90Q2Nkoj","date":"Wed Jan 05 13:57:46 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] If you love freedom, the First Amendment, and want to express yourself without fear of being flagged, censored, or banned…follow me on my #GETTR account ⬇️\n\nhttps://t.co/yFWUGu3vaL","date":"Tue Jan 04 19:15:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] If you’re tired of seeing Twitter target conservative voices on its platform because we dare challenge the status quo and #MSM, join me on #GETTR.","date":"Tue Jan 04 19:15:51 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] If you’re tired of seeing Twitter censor and ban conservative voices on its platform while still allowing the Chinese Communist Party, the Ayatollah, and the Taliban to tweet freely, join me on #GETTR.","date":"Tue Jan 04 19:15:50 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Happy New Year!","date":"Sat Jan 01 05:00:07 +0000 2022","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Merry Christmas!","date":"Sat Dec 25 12:00:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden had no choice but to listen to the American people on his #BuildBackBetter Act. https://t.co/CxUchl7gIm","date":"Mon Dec 20 14:01:52 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Johnny Isakson was not only an icon in Georgia and national politics, he was a true statesman. Johnny was a friend, a colleague, and a mentor, and he will be missed. Our prayers are for the Isakson family at this difficult time. \n\nhttps://t.co/Gkt0lTmuNn https://t.co/KWYPMnkVbr","date":"Sun Dec 19 19:25:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden is now pivoting to the proposed federal takeover of elections, claiming it’s the most important issue of the decade, yet he represented a state (Delaware) for 36 years, which has never even allowed early voting, until the upcoming elections.","date":"Thu Dec 16 16:08:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden appears to be bailing on his signature legislation, #BBB, because Americans are standing strongly against this economy-killing plan.","date":"Thu Dec 16 16:07:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My Republican colleagues and I demand that Speaker Pelosi bring S. J. Res. 29 to the House floor for a vote. This was already passed by the Senate and would nullify President Biden’s vaccine mandate for private businesses. https://t.co/3w3T6PBSms","date":"Wed Dec 15 15:50:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What does Speaker Pelosi think we should do about the highest inflation we’ve seen in 40 years? Hit the gas and pass #BBB…which, if made permanent, will cost $5 trillion and add $3 trillion to the deficit.\n \nhttps://t.co/HZf7s3yEin","date":"Tue Dec 14 14:51:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing some good news in my weekly podcast ⬇️ https://t.co/Tir5XiOpUx","date":"Mon Dec 13 17:46:16 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Myth: The Tax Cuts and Jobs Act, passed by Republicans in 2017, only benefited the rich. \n\nFact: According to IRS data, working and middle-income filers, not the top 1%, were the biggest beneficiaries of the tax cuts. \n\nhttps://t.co/EPORYwzUIy","date":"Thu Dec 09 17:52:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Senate listened to the majority of Americans and voted to repeal the federal vaccine mandate 52-48.  \n\nNow, will House Democrats listen to the American people, or will they tie themselves to a lame duck Speaker and a President who continues to sink in the polls…","date":"Thu Dec 09 16:08:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Courts have now blocked every aspect of President Biden’s vaccine mandate affecting private sector businesses and employees because it’s UNCONSTITUTIONAL. \n\nhttps://t.co/ZROH6sVEX8","date":"Wed Dec 08 16:25:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"\"A date which will live in infamy…\"\n \nOn Pearl Harbor Remembrance Day, we remember and honor the 2,403 Americans who lost their lives during the Japanese attack on Pearl Harbor in Hawaii on December 7, 1941. https://t.co/ybfg27zsP7","date":"Tue Dec 07 12:21:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing government funding, inflation, Georgia's economy, and the governor's race on National Report on @Newsmax. https://t.co/3JOCI4fqRP","date":"Mon Dec 06 14:28:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Former Senator Bob Dole was a lifelong public servant, a veteran (WWII), a member of the U.S. House and U.S. Senate, a presidential nominee, and a family man. My thoughts and prayers are with the Dole family during this time. \n\nhttps://t.co/OoKBz1X3Nu","date":"Sun Dec 05 20:38:18 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Statements like this are why so many do not trust Fauci or this administration.","date":"Fri Dec 03 13:11:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What happened to respecting and following the rule of law, Mr. President?\n\nhttps://t.co/deaHcVkEvu","date":"Thu Dec 02 18:58:20 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Supreme Court will begin hearing the Dobbs v. Jackson case today. This will be a landmark case for the pro-life movement. \n\nOral arguments begin at 10 am ET. To listen live, click the link below. \n\nhttps://t.co/lQMUiCe8fr","date":"Wed Dec 01 14:52:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Tomorrow is a monumental day for the #ProLife movement. If you wish to learn more about the case the Supreme Court is reviewing, read the article below.\n \nhttps://t.co/InjgR3N10u","date":"Tue Nov 30 18:45:16 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden is implementing travel bans for law-abiding citizens, while still allowing hundreds of thousands to stream across our southern border illegally and untested for COVID. #DemocratHypocrisy","date":"Tue Nov 30 15:12:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Hypocrisy - the practice of claiming to have moral standards or beliefs to which one's own behavior does not conform. https://t.co/zYDiPEjNQz","date":"Mon Nov 29 18:20:30 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President John Adams Thanksgiving Proclamation of 1798. https://t.co/mvZBBVfkdb","date":"Thu Nov 25 12:30:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"For weeks, the media has said skyrocketing gas prices are not the President’s fault. Now, CNN is trying to give President Biden credit for supposedly lowering the cost of oil. You can’t have it both ways. \n \nhttps://t.co/Ts60h0D3yl","date":"Wed Nov 24 12:30:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden’s decision to release oil from the Strategic Petroleum Reserve is ironic given his policies have crippled America’s energy independence and sent gas prices skyrocketing.","date":"Tue Nov 23 13:53:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s Department of Labor reports that Georgia has gained back 90% of the jobs lost since the pandemic, and is now at a historic LOW unemployment rate of 3.2%.  \n\nhttps://t.co/PabHGSaZif","date":"Tue Nov 23 12:52:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing President Biden's 'Build Back Broke Act' on @Newsmax with @Stinchfield1776 https://t.co/xHWdZaxkHD","date":"Mon Nov 22 14:48:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you @RepKatCammack","date":"Fri Nov 19 15:19:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The only bipartisan vote was in opposition to President Biden’s Build Back Broke Act.","date":"Fri Nov 19 15:15:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden: Build Back Better will cost $0\n\nCBO: Build Back Better will add $367 billion to deficit over 10 years\n\n@Twitter and @PolitiFact: You’re up…","date":"Fri Nov 19 00:09:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As we’ve been saying, Pres Biden’s vaccine mandate is unconstitutional.\n\nhttps://t.co/xPMqwhXsPX","date":"Wed Nov 17 14:33:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Interesting that the New York Times reports that the Biden Administration is bracing Democrats for a bad CBO estimate regarding the President’s Build Back Better bill. As we said, it’s not paid for. \n\nhttps://t.co/XE3pU118gl https://t.co/2e4PLi7bxd","date":"Tue Nov 16 21:38:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden based his entire presidential campaign on defeating COVID-19, yet shows no interest in understanding it’s origins, or holding those responsible accountable. \n\nhttps://t.co/EUnoLYbx0L","date":"Tue Nov 16 14:35:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As inflation hits a 30-year high, I joined @Stinchfield1776 on @Newsmax to discuss how President Biden's policies are making it worse. https://t.co/8rmesZUqpu","date":"Mon Nov 15 14:21:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“The highest obligation and privilege of citizenship is that of bearing arms for one’s country.” – General George S. Patton https://t.co/BuGSik3v0Q","date":"Thu Nov 11 12:55:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Inflation is taxation.","date":"Wed Nov 10 15:45:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"1,400,000. That is the number of illegal immigrants encountered at our southern border since President Biden took office in January. Unfortunately, President Biden is only making the situation worse by PAYING $450,000 to illegal immigrants who broke the law.","date":"Wed Nov 10 15:23:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all those who have served. The Few. The Proud. The Marines. #USMC https://t.co/LkYHwoeWW8","date":"Wed Nov 10 12:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"At Cobb Chamber’s Marquee Monday, I had the pleasure of presenting President and CEO of Braves Development, Mike Plant, with the remarks I submitted into the Congressional Record congratulating the Atlanta Braves for winning the World Series! https://t.co/H6g8YcRmfK","date":"Tue Nov 09 15:44:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On Friday, I joined @VarneyCo on @FoxBusiness to discuss Pelosi's attempt to pass big government socialist spending packages. https://t.co/mSO8ruWL3a","date":"Mon Nov 08 14:07:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Watching the lame duck Speaker try to whip her outgoing majority, is a perfect example of how NOT to run the U.S. House of Representatives.","date":"Fri Nov 05 19:55:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Want to know about Pelosi’s latest trickification and how the Biden administration is suppressing your First Amendment right? Watch the video ⬇️ https://t.co/BzLFYrRjeD","date":"Fri Nov 05 17:45:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The only thing Biden can take credit for when it comes to today’s job report, is that inflation is outpacing wage growth. \n\nOther than that, Biden’s last two jobs (Aug/Sept) missed expectations by more than 720,000 jobs because he was paying people to stay home.","date":"Fri Nov 05 15:20:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Penn Wharton estimates that Biden/Pelosi’s big gov’t socialist spending plan will cost $3.98 trillion, not $1.75 trillion like they keep telling us. \n\nPenn Wharton’s study takes into account if all of the provisions in the bill were made permanent, which we all know they will be.","date":"Fri Nov 05 13:50:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite voters rejecting his socialist agenda, Biden still believes in it. \n\nDespite 1000’s of Americans quitting jobs bc of vaccine mandates, Biden doesn’t believe his mandate will hurt supply chains.\n\nAnd despite saying his DOJ isn’t paying illegal immigrants, they are.","date":"Thu Nov 04 21:12:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today I joined @JayObernolte and some of my Republican colleagues to discuss Pelosi and Biden’s big government socialist spending plan. Despite their assertions, this bill is not “paid” for. Hardworking Americans will be paying for this socialist spending for decades to come. https://t.co/rEZwZ0nxDG","date":"Thu Nov 04 17:05:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@AustinScottGA08 @Rep_Clyde @RepHankJohnson @RepMTG @repdavidscott @CongressmanHice @RepBuddyCarter @RepNikema @SanfordBishop @RepDrewFerguson @RepRickAllen @RepBourdeaux @ossoff @SenatorWarnock","date":"Wed Nov 03 20:38:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today I introduced a resolution in the House, along with the entire Georgia Congressional delegation, congratulating the Atlanta Braves for winning the 2021 Major League Baseball World Series and honoring the life of Hank Aaron.\n \nhttps://t.co/odFUlPvzFp","date":"Wed Nov 03 20:38:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The results of last night’s elections make it clear…Americans are tired of the big government socialist agenda of:\n\n-Government Mandates\n-Higher cost of living\n-Open borders\n-Defunding the police\n-Teachers unions/school boards marginalizing parents/taxpayers","date":"Wed Nov 03 15:21:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Even though a majority of Americans oppose Pelosi’s unrelenting efforts to strip away our liberties, spy on our bank accounts, and raise our taxes…she just keeps trying to ram this big government spending bill through. \n\nNow we know why⬇️ https://t.co/yHudgklMHP","date":"Tue Nov 02 19:09:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"When parents are involved in kid’s education there is better:\n\n✅Motivation\n✅Academic Performance\n✅Attitude\n✅Behavior \n✅Self-Esteem\n\nhttps://t.co/1eghGih6fk","date":"Tue Nov 02 12:38:30 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This week, in your US House of Representatives…\n\nON the Dems Agenda: Pelosi will attempt, for the 3rd time, to pass her unpopular, big gov’t socialist spending bill\n\nNOT on the Dems agenda: Addressing inflation, shortages of goods, rising gas prices, or the crisis at the border","date":"Mon Nov 01 14:46:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Last Thursday, I appeared on @Newsmax TV to discuss President Biden's incompetent border response and celebrate the Braves being in the World Series. https://t.co/JD1426rU1w","date":"Mon Nov 01 13:35:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s good to see a DC judge put President Biden in his place,  reminding him that he and his administration are not above the Constitution, and religious freedom still matters.","date":"Fri Oct 29 19:48:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In April, @MLB relocated the 2021 All Star Game &amp; MLB Draft due to misinformation on Georgia’s new election law, SB 202.\n\nTonight, MLB will return to Georgia because the Atlanta Braves are in the World Series! \n\nPoetic justice? \n\nGo Braves! #ChopOn","date":"Fri Oct 29 15:19:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While tax and spend Joe Biden wants to take more of your money, look at where he wants to spend it ⬇️\n\n“Government is considering payments of $450,000 per person…for asylum seekers illegally crossing border” - WSJ \n\nhttps://t.co/efTV9zQjTx","date":"Thu Oct 28 20:24:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With just 2% economic growth in the 3rd quarter (worst since world shutdown due to COVID-19) Biden is helping Bernie Sanders’ socialist dreams come true: long lines, inflation, an ever-shrinking work force bc of increased gov’t dependency, and more gov’t control of your life.","date":"Thu Oct 28 15:50:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"How is President Biden combating inflation, supply chain bottlenecks, rising gas prices, and a worsening border crisis?\n\nHe isn’t. Instead, he’s sending 13 senior administration officials to the UN climate summit in Scotland.","date":"Wed Oct 27 13:15:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to have joined with Rep. Chip Roy on a discharge petition - to force Pelosi to bring to the floor a bill I cosponsored, requiring DHS to turn migrants back to Mexico under health laws.","date":"Tue Oct 26 19:58:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi and the other Dems in Congress refuse to address inflation, the supply chain problems, rising gas prices, or the border crisis. They’d rather tell you to just stop complaining.\n\nAll they are concerned with is spending your money.\n\nhttps://t.co/kbw1hvYxWf","date":"Tue Oct 26 13:48:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If you spend even $28 a day, the IRS will spy on your bank account (embedded in Democrats’ socialist spending bill, they want to pass).","date":"Mon Oct 25 15:35:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Georgia's economy, reconciliation, and vaccine mandates in my weekly newsletter. \n\nSubscribe here: https://t.co/lWXpsUBAPz https://t.co/OpoYR470FE","date":"Mon Oct 25 13:52:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If Biden’s socialist spending plan is paid for by taxing the rich, and costs everyone else $0, then why do they want to monitor all American’s bank accounts?","date":"Thu Oct 21 17:36:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"UPS is looking to hire 2,340 people in the Atlanta area for full-time and part-time positions. They need package handlers, drivers, driver helpers and personal vehicle drivers. Scan the QR code below and apply today. https://t.co/GIAJ5s7CNj","date":"Thu Oct 21 13:57:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden is doing a better job secretly transporting thousands of illegal immigrants around the country than he is transporting the goods stuck at our ports and on cargo ships. \n\nhttps://t.co/hxGB5FeC1n","date":"Tue Oct 19 15:28:20 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Among many of Colin Powell’s life achievements, he was a veteran, a four-star general, Chairman of the Joint Chiefs, Sec of State…a true public servant who made an enormous impact on the world. My heartfelt condolences to the Powell family for their loss.","date":"Mon Oct 18 12:59:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the debt ceiling, the SCOTUS &amp; Georgia's economy in my weekly newsletter. \n\nSubscribe for my newsletter here: https://t.co/lWXpsUBAPz https://t.co/JWI3Nv0sxd","date":"Mon Oct 18 11:59:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m joining with my colleague @cathymcmorris to require transparency from insurance companies on drug costs, streamline regulation of over-the-counter products, and cap certain drugs costs for seniors on Medicare Part D. #LowerCostsMoreCuresAct #HR19 https://t.co/RYOSlx7ed3","date":"Thu Oct 14 15:07:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to the men and women who have served, or are serving, in the #USNavy! https://t.co/1j7PrkocVE","date":"Wed Oct 13 15:20:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**INFLATION CRISIS: Hardworking Americans are paying more for everything as Inflation is the highest it’s been in 13 years. Where is Secretary of the Treasury Janet Yellen (@SecYellen)? https://t.co/z7Gmsqxegc","date":"Wed Oct 13 13:36:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"And, #1 -- THE LEADERSHIP CRISIS: Where is the @POTUS on these issues? I would like to ask these questions, but I know what his response would be….. https://t.co/IRilAYIkuw","date":"Wed Oct 13 13:36:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**GAS CRISIS: Gas is the highest it’s been in over SEVEN years. Where is Secretary of Energy Jennifer Granholm (@SecGranholm)? https://t.co/INcxvTiGge","date":"Wed Oct 13 13:36:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**SUPPLY CHAIN CRISIS: Dozens of cargo ships are currently anchored off California's coast because the ships in port can’t be unloaded due to a truck driver shortage. Where is Secretary of Transportation @PeteButtigieg? https://t.co/57MBRuhuf9","date":"Wed Oct 13 13:36:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**CRIME CRISIS: The CDC recently reported the highest jump in homicides in 100 years. Where is Attorney General Merrick Garland? https://t.co/18Lw1VDm3u","date":"Wed Oct 13 13:36:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**BORDER CRISIS: We are on pace to have over TWO million migrants illegally cross our border in a year. Where is @VP Kamala Harris and Secretary of Homeland Security @SecMayorkas? https://t.co/Hn4IW6WTn3","date":"Wed Oct 13 13:36:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"**AFGHANISTAN CRISIS: The American people were promised those responsible for killing 13 American soldiers in Afghanistan would be brought to justice; yet the only thing this Admin has done was kill 10 civilians with a drone. Where is Sec of Defense Lloyd Austin (@SecDef)? https://t.co/J6gKPEDYZW","date":"Wed Oct 13 13:36:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The number of crises in our nation, and the lack of leadership from this administration, is astounding. Here are the TOP crises we are currently facing:","date":"Wed Oct 13 13:36:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] Is the Speaker hiding her colleagues votes due to the civil unrest that’s engulfed the Democratic Party because of their reckless and partisan spending?","date":"Tue Oct 12 20:47:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] Tonight, the Speaker will use a procedural gimmick to allow the debt ceiling to pass under a ‘rule’ - which will prevent a recorded yes or no vote on the bill to raise the debt ceiling - and simply deem it to be passed without a vote.","date":"Tue Oct 12 20:47:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] Speaker Pelosi is at it again with her trickification…. \n\nShe thinks she can keep her Democratic colleagues from having accountability while also raising the debt ceiling.","date":"Tue Oct 12 20:47:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Tax cuts work!!! As Reagan proved...lowering taxes increases tax revenues. \n\nhttps://t.co/Ridiaa1auP","date":"Tue Oct 12 19:39:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the September #jobsreport and parents being investigated as domestic terrorists by the Biden DOJ in my weekly newsletter. \n\nSign-up to receive my weekly newsletter by visiting https://t.co/zeKytaViPD https://t.co/9ahNQqgOBp","date":"Tue Oct 12 14:32:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/GOn8xWoRMe","date":"Mon Oct 11 15:20:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"White House Press Secretary Jen Psaki just said, “The President’s agenda is incredibly popular.” \n\nI’m not sure which constituency she’s referring to, but the majority of Americans disagree. https://t.co/hSlngb1Oix","date":"Fri Oct 08 19:03:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Instead of dealing with the highest increase in homicides in 100 years, Pres. Biden is busy directing his DOJ to go after ‘extremist’ parents at school board meetings.\n\nhttps://t.co/DTovnsVKKq","date":"Fri Oct 08 17:05:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden can fix this economy if he will:\n\n- Stop spending senselessly\n- Start paying off debt\n-Stop putting government obstacles in the way of people\n- Stop incentivizing people to be idle\n- Stop the government intrusion\n- Stop trying to ‘fix’ us - we can fix ourselves","date":"Fri Oct 08 14:20:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I wonder why Twitter hasn’t flagged @POTUS’s tweet, which said his Build Back Better Agenda will add $0 to the national debt, when the nonpartisan @USCBO said it would add about $250 billion? My Republican colleagues and I wrote a letter to Twitter CEO, Jack Dorsey, to find out. https://t.co/6ccGdJNTHG","date":"Thu Oct 07 17:59:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I am working with my colleague @RepCloudTX to ensure our veterans are receiving the quality care they deserve. One of our bill’s provisions will enforce biannual training requirements on credentialing for all hiring officials in VA facilities. #HR217 https://t.co/rWEmCu1vls","date":"Thu Oct 07 15:49:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@sakaiamerica in Adairsville is one of those companies that help keep America the strongest and most competitive economy in the world. I appreciate AEM, and the men and women at Sakai America, for an informative tour of your great facility. https://t.co/bnMSLYKxSx","date":"Wed Oct 06 17:03:12 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to Governor Kemp and the great state of Georgia for making Georgia the top state in which to do business for the 8th straight year! 🏆 🏆🏆🏆🏆🏆🏆🏆\n \nhttps://t.co/UUh6UPyo6m","date":"Tue Oct 05 11:31:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Unnecessary government restrictions, shutdowns, and a nation-wide labor shortage are the reasons there are over 100 cargo ships waiting to be unloaded off California’s coast. This is driving up prices on products and services for every American.\n\nhttps://t.co/PWfXzvPCnq","date":"Mon Oct 04 14:38:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi must have left the Capitol last night in a DeLorean, because she thinks today is still yesterday... https://t.co/rM3KSzRb9Q","date":"Fri Oct 01 17:03:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I and some of my Republican colleagues are pushing the Marine Corps to release LTC #StuartScheller from pre-trial confinement. LTC Scheller is not a flight risk or a threat, which is the criteria for holding someone in pre-trial confinement under the UCMJ. https://t.co/ZJxBDcGmFF","date":"Thu Sep 30 18:55:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I and my colleague @RepAndyBarr are pushing legislation to combat the rise of the Chinese Communist Party (CCP). This bill leverages America’s strengths to limit access to capital for malign Chinese entities. #HR5326 https://t.co/s0ifwqgaAW","date":"Thu Sep 30 15:57:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Inside Biden/Pelosi's reconciliation package is $80 billion to double the number of IRS agents. Find out why ⬇️ https://t.co/tDuF46rMnx","date":"Thu Sep 30 00:47:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Biden/Pelosi reconciliation package is certainly historic. The largest TAX increase in history, the largest SPENDING bill in history, and the largest DEBT increase in history. https://t.co/0JF96CGeGP","date":"Wed Sep 29 13:51:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] and DOUBLE the number of IRS agents, to monitor everyday American’s financial activities. Why do they want to spy on us?","date":"Tue Sep 28 18:57:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] As if Biden’s mandates didn’t strip enough of our liberties, the Pelosi/Biden Infrastructure/Reconciliation package will force all banks to report any transaction over $600 to the IRS…\n\nhttps://t.co/PUqrEMZYwO https://t.co/KjZZGO0ohc","date":"Tue Sep 28 18:57:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"WATCH: President Biden caught lying to the American people about his disastrous and deadly Afghanistan withdrawal. https://t.co/OB6DZs8QyQ","date":"Tue Sep 28 17:33:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"MUST READ⬇️","date":"Mon Sep 27 19:30:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If you are upset about paying more for everyday products and services, you should absolutely be against President Biden’s $3.5 trillion socialist spending spree. It will make things even more expensive for you and your family.","date":"Mon Sep 27 17:49:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Speaker Pelosi blocking efforts by Republicans to investigate Biden, NDAA, and Democrats' #abortionondemand bill. https://t.co/dnqiHl4KUo","date":"Mon Sep 27 14:12:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What is an embarrassment is Psaki, Waters, Biden, and others on the left falling for the media’s false story about “whips” being used against black people (there were no whips), using it as an opportunity to virtue signal and race bait.\n\nhttps://t.co/eT5zeN9tzk","date":"Fri Sep 24 17:00:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"@shauseman https://t.co/ufLHxB4FJM","date":"Fri Sep 24 15:14:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Do you support the Democrats' bill, which would allow abortions at any time during a pregnancy, and for any reason? \n\n#AbortionOnDemandAct #HR3755 #WomensHealthProtectionAct","date":"Fri Sep 24 13:41:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Dems #WomensHealthProtectionAct would allow abortions based on a Downs Syndrome diagnosis or the sex of the baby. This bill isn’t protecting women’s health, this is eugenics. #HR3755","date":"Fri Sep 24 13:21:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This bill claims to be about protecting women, but it doesn’t because it erases the requirement that abortion providers give their patients information about the health risks of having an abortion. This bill is not about protecting women’s health, its medical malpractice. #HR3755","date":"Fri Sep 24 12:45:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi and Democrats’ #AbortionOnDemandAct is one of the most reprehensible pieces of legislation I’ve ever seen. Among its provisions, it allows abortions to be performed for any reason until birth. #HR3755","date":"Fri Sep 24 11:31:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi is helping the President cover his tracks in the disastrous Afghanistan debacle by changing the rules in the House, so Republicans can’t investigate the President’s actions. They are attempting to whitewash history and cover up the truth.\n\nhttps://t.co/zbbSxWIZEZ","date":"Fri Sep 24 01:05:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As bipartisan criticism of Rep. Tlaib’s anti-Semitic comments surface, Speaker Pelosi remains silent on her condemnation. Must watch ⬇️ https://t.co/a6UdYWfGVy","date":"Thu Sep 23 20:45:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Well, @SpeakerPelosi? Will you do the same now, or just make more excuses as you have done for your side in the past?","date":"Thu Sep 23 17:56:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In Jan, Nancy Pelosi supported removing a Republican member of Congress from committees because of controversial statements made before she was in Congress. \n\nToday, a Dem made anti-Semitic remarks on the House floor by referring to Israel as an Apartheid government https://t.co/CdPTOipG0h","date":"Thu Sep 23 17:56:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Fortunately, their continued abuse of power was checked in this instance.","date":"Thu Sep 23 11:43:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] What does giving citizenship to illegal immigrants have to do infrastructure? NOTHING. Democrats are literally trying to sneak anything under the sun into their $3.5 trillion socialist spending spree.\n \nhttps://t.co/2H8lAIYHWd","date":"Thu Sep 23 11:43:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s sad to see Democrats walk away from police reform. Republicans, like Tim Scott, offered common sense reforms that could have made a real difference, but Democrats chose to quit.","date":"Wed Sep 22 20:32:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#ConstitutionWeek https://t.co/HLoWnjyMSm","date":"Wed Sep 22 19:17:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This picture is the definition of a humanitarian crisis. Where is @JoeBiden, @VP, @SpeakerPelosi, @chuckschumer and every other Democrat who complained for four years about President Trump’s border policies?","date":"Wed Sep 22 11:31:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is a portion of the nearly 100-page CR that Speaker Pelosi expects every member to read, review, scrutinize – oh, and vote on – in less than one day because she neglected to do her job. Kind of a reckless way to spend billions of dollars in taxpayer money, don’t you think? https://t.co/nBveS2nIed","date":"Wed Sep 22 00:09:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] To avoid a government shutdown, Speaker Pelosi proposed a continuing resolution (CR) to fund the government. To hide the billions in new spending embedded in the bill, she wrote it in secret…","date":"Tue Sep 21 22:56:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] introduced it late this morning, and rushed it to the floor with little time for members of Congress to analyze and comprehend.","date":"Tue Sep 21 22:56:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With a government shutdown looming, instead of working with members of Congress to fund government services, @SpeakerPelosi released a bill at 9am that would continue the current massive spending, add billions in new spending, and she’s rushing it to the floor for a vote tonight!","date":"Tue Sep 21 22:38:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#ConstitutionWeek https://t.co/42QhEyRtBF","date":"Tue Sep 21 19:53:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I believe the federal grand jury indictment of Michael Sussmann, who worked for a law firm with close ties to the DNC and 2016 Clinton campaign, is just the tip of the iceberg in finding out who’s responsible for the #RussiaCollusionHoax.\n \nhttps://t.co/7okDqvXAqV","date":"Tue Sep 21 11:43:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#ConstitutionWeek https://t.co/gWJ06Sju9t","date":"Mon Sep 20 20:23:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing General Milley, Afghanistan, and Sec. Blinken’s testimony with @toddstarnes https://t.co/d7PUnVnArE","date":"Mon Sep 20 13:32:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to those who have served, and are currently serving, in the U.S. Air Force. https://t.co/SlU3nrhRTV","date":"Sat Sep 18 11:30:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On POW/MIA Recognition Day, we remember those who were prisoners of war, and those who are still missing in action. #YouAreNotForgotten https://t.co/mpdA7uoHgu","date":"Fri Sep 17 11:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"May you be sealed in the Book of Life. #YomKippur https://t.co/t4jzfuvWiT","date":"Wed Sep 15 19:13:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"According to recent jobs report:\n\n4.3% - Average unemployment for states that ENDED federal unemployment subsidy\n\n5.7% - Average unemployment rate for states that KEPT federal unemployment subsidy \n\nThe 10 states with the highest unemployment rate are run by Democrats.","date":"Wed Sep 15 16:45:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] “The biggest problems facing small employers right now is finding enough labor to meet their demand and for many, managing supply chain disruptions.”","date":"Wed Sep 15 11:59:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] “As the economy moves into the fourth quarter, small business owners are losing confidence in the strength of future business conditions,” said NFIB Chief Economist Bill Dunkelberg.\nhttps://t.co/UfobbkUyW5","date":"Wed Sep 15 11:59:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] This isn’t accountability, it’s another example of incompetence by the Biden Administration.","date":"Tue Sep 14 21:01:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Pres Biden said he’d hold those accountable who killed 13 American soldiers in Afghanistan in August. But, Secretary Blinken just admitted he didn’t know if the drone strike took out those responsible or innocent civilians.","date":"Tue Sep 14 21:01:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Republicans would like to strengthen our cybersecurity infrastructure, given the IRS experiences 1.4 million cyberattacks each year. https://t.co/qMm8kcaH6T","date":"Tue Sep 14 12:11:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Unfortunately, House Democrats would rather double the number of IRS agents, so they can collect even more sensitive taxpayer info, and ignore our cybersecurity vulnerabilities.","date":"Tue Sep 14 12:11:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We will never forget those who were lost on September 11, 2001.  \n\nIn the final words of President George W. Bush on that day, “None of us will ever forget this day, yet we go forward to defend freedom and all that is good and just in our world.”  #NeverForget #911 https://t.co/z9WiwP8fQf","date":"Sat Sep 11 11:30:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We need every freedom-loving American, no matter the party, to stand with us in opposition.","date":"Fri Sep 10 12:44:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I strongly oppose the federal government mandating medical treatments of any kind. @potus and his Administration are executing a full-frontal assault on our Constitution and our freedoms.\nhttps://t.co/HowcTcwbZl","date":"Fri Sep 10 12:44:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While the national unemployment rate stands at 5.2%, Georgia’s unemployment rate has continued to drop for 15 consecutive months.\n\nhttps://t.co/efnKTUrhHu","date":"Fri Sep 10 11:30:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The President, who has ushered 1.5 Million illegals from many countries through our southern border, and refused to test them for Covid, now wants to force Americans to be vaccinated or face constant Covid testing. It’s not about safety, folks, it’s about control! #DCHypocrisy","date":"Thu Sep 09 23:58:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The President, who willingly abandoned hundreds of Americans behind enemy lines, now wants to force vaccinations on Americans for their ‘safety.’ It’s not about safety, folks, it’s about control! #DCHypocrisy","date":"Thu Sep 09 22:36:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I and my office were honored to be recognized as a SourceAmerica AbilityOne Congressional Champion. This award recognizes support of opportunities, for economic and personal independence, for those who are blind or have significant disabilities. https://t.co/Qd74iDWdTT","date":"Thu Sep 09 15:01:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I have joined my colleague @RepThomasMassie on legislation prohibiting mandatory covid vaccines for our men and women in uniform. This is a doctor/patient decision, and one that should remain private. #HR3860 https://t.co/AgDWEHhmDi","date":"Thu Sep 09 11:30:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Anheuser-Busch brewery in Cartersville, Georgia has been an integral part of Georgia’s business community since 1993. In addition to employing many hardworking Georgians, they are also the original producer of emergency drinking water for disaster relief. https://t.co/m6H09zKxid","date":"Wed Sep 08 11:30:16 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The men and women who paid the ultimate sacrifice in the recent evacuation effort in Afghanistan should receive the Congressional Gold Medal. I’m proud to be working with my colleague @RepLisaMcClain on this effort. https://t.co/dl0mRZHtIo","date":"Tue Sep 07 11:30:12 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“In a phone call, Biden offered aid if Ghani could publicly project he had a plan to control the spiraling situation in Afghanistan.” – Reuters\n\nhttps://t.co/oci0bPueGk","date":"Mon Sep 06 16:01:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the Biden Administration's botched withdrawal in Afghanistan with @Stinchfield1776 on @Newsmax. https://t.co/7nGDmCU3pp","date":"Mon Sep 06 11:49:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I couldn’t be more proud of our Dobbins Airmen. Thank you for your service and sacrifice to our nation.","date":"Fri Sep 03 15:10:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The men and women serving at Dobbins Air Reserve Base are some of the best in the entire U.S. military. They rose the occasion under very difficult circumstances, and helped save thousands of lives.\n\nhttps://t.co/BCNblnggVH","date":"Fri Sep 03 15:10:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden is trying to cover his tracks by destroying evidence. This is a deliberate attempt to prevent Congress’ ability to provide oversight over the incompetent withdrawal from Afghanistan.","date":"Wed Sep 01 15:11:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In DC with Leader McCarthy and a group of GOP veteran lawmakers to advance legislation that will save American lives in Afghanistan. Unfortunately, Speaker Pelosi blocked that legislation from coming to the floor. https://t.co/j6EViEy8ov","date":"Tue Aug 31 19:00:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi is so desperate to ignore the situation in Afghanistan, she just blocked legislation that would save the lives of the Americans left behind. https://t.co/47jqTDCyI5","date":"Tue Aug 31 16:31:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My veteran Repub colleagues and I are in DC today to demand Pelosi bring @RepGallagher’s bill up for a vote. It will require Pres Biden:\n\n➡️Detail future evac plans \n➡️Provide updates on Americans, military equipment, classified info left behind\n➡️Prohibit funds to the Taliban https://t.co/V9mBcTN4B4","date":"Tue Aug 31 14:34:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] To my fellow veterans, especially those who served in Afghanistan, ‘You did your duty and served with honor. You did what your country asked, and for that I am very proud of you.’","date":"Mon Aug 30 19:08:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Now it’s time to hold those who have failed you accountable, and that duty falls with me and my colleagues. I will do my best to serve you as well in that duty as you have served in yours.","date":"Mon Aug 30 19:08:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"How can our allies trust the United States after how this Administration has abandoned them? It will take time, and new leadership, to regain our influence on the world stage.","date":"Mon Aug 30 16:12:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden and his Administration owns this historic failure; but innocent people are paying the heavy price.","date":"Mon Aug 30 13:41:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the crisis in Afghanistan with @GlennBeck - August 25, 2021 https://t.co/X9hxQJR1Oo","date":"Mon Aug 30 11:49:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] without screening, documentation, or covid testing, and Biden will not stop them. Words cannot describe how disgusting this feels. God help us.","date":"Mon Aug 30 02:01:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] and we are abandoning potentially 30k people in enemy territory. I find it ironic that within two weeks, more than we stranded in Afghanistan will cross our southern border…","date":"Mon Aug 30 02:01:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] President Biden and his Administration own this historic failure; but innocent people are paying the heavy price. The Biden Administration has refused to stay the course to ensure all Americans and our allies are evacuated from Afghanistan…","date":"Mon Aug 30 02:01:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Veterans - know that you are not alone, and that we are thankful for your selfless service and sacrifice for our country. \n\nIf you are struggling, please call the Veteran Crisis Hotline: 800-273-8255 \n\nhttps://t.co/zlXMLnXLvs","date":"Fri Aug 27 20:36:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Reports from Afghanistan: the U.S. State Dept. is asking neighboring countries not to accept refugees escaping Taliban. Many are stranded, and likely will be executed. Time for Sec. Blinken to step down and let someone capable serve as Sec of State.","date":"Thu Aug 26 19:46:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] And, as Nancy Pelosi has proven time and again that she is incapable of conducting honest, non-partisan investigations, she should immediately step down as Speaker.","date":"Thu Aug 26 19:42:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] Once we have fully retreated from Afghanistan, Congress must hold a full investigation into the Biden Administration and its failures in Afghanistan.","date":"Thu Aug 26 19:42:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] Joe Biden has lost the trust of the American people, and shown he’s not fit to serve as President &amp; Commander-in-Chief. For the future of our nation, our freedom, and our future, it is time for him to resign.","date":"Thu Aug 26 19:42:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It was clear from the beginning that with Biden’s strategy of Tuck-Tail-and-Run, Americans would suffer the consequences of his incompetence. The buck that stops with him is now tragically covered in American blood.","date":"Thu Aug 26 19:18:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My team and I are monitoring the situation in Kabul, and still working diligently to get people out. Please pray for our military, American citizens, and all of the innocent lives affected by this senseless attack.","date":"Thu Aug 26 15:13:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"3.) For @StateDept and @DeptofDefense to help NGOs get at-risk women, children, Christians and others past the gate at Kabul airport — this is very urgent","date":"Wed Aug 25 20:43:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"1.) For the USG to declare the Afghan crisis a humanitarian emergency. This will allow non-governmental organizations (NGOs) access to life-saving funds that will safe thousands of lives.","date":"Wed Aug 25 20:43:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"2.) For the @StateDept to use its diplomatic influence and provide NGOs open doors to take refugees to neighboring countries before the Biden 31 Aug deadline.","date":"Wed Aug 25 20:43:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I have been in direct contact with someone who is coordinating the evacuation of thousands of American citizens, Christians, and at-risk Afghans from Afghanistan. This person has many concerns, but 3 important things we are working together on to save lives in Afghanistan are:","date":"Wed Aug 25 20:43:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden ended the ‘Remain in Mexico’ policy purely for political reasons, which resulted in the worst immigration crisis our country has ever seen. \n\nThankfully, the SCOTUS put the administration back in its place by ruling the policy must be reinstated. \n\nhttps://t.co/jXPi0UPrfY","date":"Wed Aug 25 13:03:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pelosi's con game to pass Democrats' $5 trillion budget. https://t.co/WAO1pgbkCs","date":"Tue Aug 24 21:51:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Analysis from the left-leaning Tax Policy Center finds that Pres Biden’s overall tax ‘plan’ will raise taxes on 75 percent of hardworking ‘middle-class’ families next year, rising to 95 percent of middle-class families over the long term. #Trickification #ShameOnBiden","date":"Tue Aug 24 19:47:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrats want to eliminate the small business tax deduction, which 21 million small businesses relied on in 2019 to invest, hire new workers, and increase employee benefits. #Trickification","date":"Tue Aug 24 17:09:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden claimed small businesses would be exempt from his tax hikes. But according to the U.S. Chamber of Commerce, the Biden-Bernie-Pelosi budget would raise taxes 33% for 1.4 million small business owners who employ more than 12.5 million Americans. #Trickification","date":"Tue Aug 24 16:06:18 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This $5 Trillion budget calls for mass government subsidies for paid leave mandates, housing, free college, and federally controlled pre-K. But Americans know nothing is actually free. \n\nFree = tax hardworking taxpayers to oblivion.","date":"Tue Aug 24 15:30:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Americans are already paying MORE for practically EVERYTHING, yet Democrats want to SPEND another $5 Trillion unnecessarily, which will RAISE PRICES further and Increase Your TAXES! #ShameOnPelosi #Trickification","date":"Tue Aug 24 02:38:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The DEBT INCREASE  under this proposed budget plan is greater &gt;&gt; than the GDP of every country on earth, except the U.S. #ShameOnPelosi #Trickification","date":"Tue Aug 24 02:35:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Democrats’ socialist tax and spend spree (Budget) will amount to the HIGHEST spending levels in American history - $4.2 trillion increase! #ShameOnPelosi #Trickification","date":"Tue Aug 24 02:32:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We do not need to pass Pelosi &amp; Bernie’s 5 Trillion budget! Inflation is already on track to be the highest since 1981. #ShameOnPelosi \n\n➡️ Gas is UP by 45.1%\n➡️ Clothing is UP by 4.9%\n➡️ Food is UP by 2.4%","date":"Tue Aug 24 02:27:52 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Many Democrats know that continuing the out of control spending will cause the economy to overheat and cause inflation to skyrocket even further, and at least ten Democrats oppose it.","date":"Tue Aug 24 01:45:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pelosi is attempting a procedural GIMMICK to pass the SHAM budget WITHOUT a VOTE!  Because she doesn’t have enough Democrat support.","date":"Tue Aug 24 00:56:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Trickification = The term Congress is using to explain the way Pelosi is trying to “sneak-through” the mega-trillion $$ budget - without a vote.","date":"Tue Aug 24 00:10:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pelosi is so desperate to pass her mega trillion $$ budget, she is trying all kind of ridiculous tricks. Tonight, she is trying to add into another resolution that the budget is just “deemed” to have passed. #Trickification #ShameOnPelosi https://t.co/CgSJ4kZtqG","date":"Mon Aug 23 23:58:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Instead of calling Congress to DC to address actions to help Americans trapped in Afghanistan, Pelosi is calling us back to vote on a $5 TRILLION socialist wishlist and ANOTHER unconstitutional elections-takeover bill. #OutOfTouch #BringAmericansHome\n\nhttps://t.co/Chf4AzDcMx","date":"Mon Aug 23 13:57:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My message to President Biden: #bringAmericanshome https://t.co/pbgEHEaata","date":"Fri Aug 20 20:04:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The President says we don’t have the capability to go into Kabul to rescue Americans...WRONG! We have the most capable military in the world.","date":"Fri Aug 20 15:33:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] TRUTH - Mr. President, you lack the will to save our people. These people are at risk of being tortured and executed. Stop your political posturing and GET THEM OUT!","date":"Fri Aug 20 15:33:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Since President Biden went AWOL, some of our NATO allies are taking matters into their own hands and going into Kabul to get their citizens. Why aren’t we?\n\nhttps://t.co/Shf490Kwmp","date":"Fri Aug 20 14:04:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Don't worry if you are confused about what's going on in Afghanistan, so is President Biden and his entire administration. \n\nWatch ⬇️ https://t.co/X1WDt3EX4i","date":"Thu Aug 19 22:43:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"From his press appearance yesterday, It’s obvious that President Biden’s focus isn’t getting Americans out of Afghanistan, but forcing children in America to wear masks.","date":"Thu Aug 19 20:17:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"British and French soldiers are reportedly going into Kabul and escorting their citizens to the airport for evacuation. However, American forces are ordered to stay at the airport. Why? Because the Taliban has not given Biden permission to do that. #Inconceivable","date":"Thu Aug 19 17:35:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker, if you and your Democratic colleagues wanted bipartisan support for #HR4, why are you rushing it to the House floor for a vote and skipping the committee process, which would allow members to raise concerns, improve the bill?","date":"Thu Aug 19 16:43:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"WATCH NOW: I joined @AmericaNewsroom this morning to discuss @Twitter allowing Taliban operatives, while censoring conservative accounts. https://t.co/01XdH1aP2b","date":"Wed Aug 18 15:23:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@buckheadbiz’s mission is to promote a positive and informed business environment for its members who actively contribute to the vitality of the greater Buckhead community. It was my pleasure to visit with the fine folks of the BBA at their Monthly Empowerment breakfast. https://t.co/iGs3pjdoeV","date":"Wed Aug 18 14:24:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden hastily leaves to go back to Camp David while Americans remain in significant danger in Kabul? \n\nMr. President, now is not time to run and hide, but admit failure and stay at the helm and try to save the lives of our citizens and allies. https://t.co/FCThhveYvF","date":"Mon Aug 16 20:54:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"🧨🧨 MUST WATCH: The Biden Administration has failed on many fronts in this operation, including denying a Taliban takeover could happen. #Afghanistan https://t.co/b7arpefFRf","date":"Mon Aug 16 15:53:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While members of Congress are being suspended from Twitter for criticizing the President, the Taliban, who are overthrowing a nation and spreading terror, are still allowed an active account. Twitter’s allegiance is perfectly clear.","date":"Mon Aug 16 12:55:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the #economy and #crime on the Todd Starnes Show with guest Host Jeff Stein https://t.co/W4K6tV027A","date":"Mon Aug 16 11:58:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] But Biden and the DoD leadership appear to have failed on many fronts in this operation. The Biden Administration and the DoD must be held accountable for this massive failure of international diplomacy and national security.","date":"Sun Aug 15 18:59:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Many American and Afghani lives are in grave danger today because of the incompetence of the Biden Administration. Securing the safe extraction of Americans, and American assets, should have been planned as part of an organized withdrawal.","date":"Sun Aug 15 18:59:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden isn’t interested in solving the crisis at our southern border - it’s intentional. And it's not about climate change or asylum, it’s about planning to give them the right vote so they can increase their power and control – they admitted it during the presidential campaign. https://t.co/HhA1GgShKd","date":"Fri Aug 13 17:24:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Don’t let the word ‘encounter’ fool you; many of these migrants, including those who have COVID, are being let in to the interior of the U.S. never to be seen again. This brings the encounters for this year to 1.1 MILLION. https://t.co/DG3lpJhRTd","date":"Fri Aug 13 16:13:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] It shows how incompetent the Biden Admin is. They seem to be more interested in scoring political points than thinking about the real-life consequences of their decisions.","date":"Thu Aug 12 19:50:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The Biden Admin just announced they are sending 3,000 American troops BACK to #Afghanistan. Question: Why was our embassy staff not evacuated long ago?","date":"Thu Aug 12 19:50:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] This amount of spending is unnecessary and dangerous, and Republicans and common sense Democrats must stand up in opposition.\n \nhttps://t.co/g636dhqOak","date":"Thu Aug 12 10:53:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The Biden Administration’s reckless spending has caused a labor shortage, which has caused supply chain issues, which has caused the highest inflation rate in 13 years – and now he wants to spend another $3.5 TRILLION.","date":"Thu Aug 12 10:53:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A year ago, Biden and Democrats said the rise in COVID cases was entirely Trump’s fault. But now that Biden is President, the rise in COVID cases is entirely the fault of governors in states like Georgia, Florida, and Texas. #DCDoubleStandard","date":"Wed Aug 11 15:09:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The solution to filling the record 10 Million AVAILABLE JOBS is simple:\n \n➡️Open schools for in-person learning so parents can return to work\n\n➡️Stop gov’t program that’s paying people extra to stay home https://t.co/kP6vzU40th","date":"Tue Aug 10 16:35:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Are we losing our freedoms? https://t.co/HeeXH18RUi","date":"Mon Aug 09 11:06:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On #NationalPurpleHeartDay, we remember and honor those who were wounded on the battlefield, or paid the ultimate sacrifice in defense of our freedoms. To read more about this special day, click the link. \n\nhttps://t.co/HEY5ZlyleI","date":"Sat Aug 07 11:30:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"July #JobsReport better for states that ended FED unemployment insurance subsidy:\n\n4.4% - Avg unemployment rate for states that ENDED fed subsidy\n\n5.8% - Avg unemployment rate for states who CONTINUED fed subsidy","date":"Fri Aug 06 14:18:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If Pres Biden and Democrats in Congress cared about defeating COVID-19, they would be aggressively investigating the origins of the pandemic, and they would not be ignoring the SUPER spreader event going on at our southern border.","date":"Fri Aug 06 11:57:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"There are 9.2 million jobs available. Paying Americans to stay home, on the backs of those who are working, is why we have inflation and stagnation. The government is the problem, not the solution. https://t.co/3TeGtS24Or","date":"Thu Aug 05 15:27:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to the men and women who have served in the United States Coast Guard! #NationalCoastGuardDay https://t.co/xJEUErDX8w","date":"Wed Aug 04 20:51:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Will the White House direct Twitter and Facebook to remove the New York Times and Washington Post due to this misinformation? They are sure quick to censor conservative outlets whenever they post anything they disagree with.\n\nhttps://t.co/uTS6y2o9Oj","date":"Wed Aug 04 12:09:18 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A border wall is paramount in helping stem the flow of illegal immigration into the U.S. That is why I’m working with my colleague @RepBrianBabin to allow border states to access funds to build barriers along our southwestern border. #HR4593 #SecuringOurBorderStatesAct https://t.co/4xg4wyAPKw","date":"Tue Aug 03 13:37:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Illegal Immigration and COVID with @VarneyCo on @FoxBusiness https://t.co/kAXJbEyese","date":"Mon Aug 02 11:40:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Returning from testifying in the Senate - where there isn’t a mask mandate - we had to cross the DMZ (Deplorable Mask Zone) into the Socialist controlled House side, where masks are mandated and police are empowered to arrest anyone exercising personal responsibility. https://t.co/aBatg8oirD","date":"Thu Jul 29 18:15:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Over 1 million migrants have crossed our border illegally this year - where is the #CDCguidance regarding the COVID-19 outbreak there…?\n\nCould it be...this isn’t about following science, it’s about playing politics?","date":"Wed Jul 28 15:25:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to join my colleague @WarrenDavidson on legislation to prohibit the federal government from issuing vaccine passports. #HR4126 #VaccinePassportPreventionAct https://t.co/cODpBVI0Hu","date":"Tue Jul 27 11:33:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The height of hypocrisy: Using your power as an elected official to #defundthepolice while secretly paying $70,000 for your own private security.\n \nhttps://t.co/vZTVb3V0uF","date":"Mon Jul 26 16:18:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing immigration, COVID-19 and Buckhead on the @ToddStarnes Show. https://t.co/GQSuHVHy5b","date":"Mon Jul 26 11:52:12 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"To celebrate his 92nd birthday, Oscar Johnson Jr - a decorated veteran, CIA operative and vice presidential pilot - landed a helicopter in Acworth, GA. \n\nThank you for your dedicated service to our nation, Oscar, and Happy Birthday!” \n\nhttps://t.co/dXFzxu2KQ1","date":"Fri Jul 23 19:14:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] Americans can’t even get the assistance they desperately need.”\n\nhttps://t.co/6CNxbeoRTq","date":"Fri Jul 23 14:38:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] Leave it to the @AJC to omit the second part of my quote, which describes who is to blame for the botched rollout of the #rentalassistance program. Check out the full quote I gave the AJC👇:\n \nReported: “Any undocumented immigrant who receives rental assistance from the…","date":"Fri Jul 23 14:38:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] federal government is reducing the money available for American citizens who need it.”\n \nOmitted: “Unfortunately, because of Democrats’ mismanagement of the program, less than 4% of the funds have been distributed to renters so far, and…","date":"Fri Jul 23 14:38:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Entities that are investigating Jan. 6:  \n \n- Department of Justice\n- U.S. Attorney’s Office\n- FBI\n- Committees in both House and Senate\n \nWhat can Pelosi’s partisan committee tell us that they haven’t? NOTHING.","date":"Wed Jul 21 18:12:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden, Twitter and Facebook want you to believe that “misinformation” about COVID-19 is dangerous and should be censored, but that 1 million migrants (some COVID positive) illegally crossing our southwestern border is okay and should be allowed.","date":"Tue Jul 20 21:40:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"To make matters worse, reports suggest the Biden Administration is using the U.S. military to secretly move the nearly 1 Million illegal immigrants around the country.\n \nhttps://t.co/n0wEOU6bkR","date":"Tue Jul 20 20:10:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The solution to this problem is easy @POTUS:\n \n➡️Finish the border wall\n➡️Reinstate ‘remain in Mexico’ policy\n➡️Reinstate asylum agreements with El Salvador, Guatemala &amp; Honduras\n➡️Stop allowing unaccompanied migrants to remain in U.S.\n\n#DidYouKnow https://t.co/kinT1Rklej","date":"Tue Jul 20 10:51:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On the #ErickEricksonShow with guest host @AlanJSanders. \n\nhttps://t.co/5hGHkLgxIu","date":"Mon Jul 19 12:16:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, for the first time in 40 years Dems on the House approps committee will pass the spending bill for HHS without the life-saving #HydeAmendment. This opens the door for taxpayer money to be used to fund abortions. I will always fight to defend the unborn. #HydeSavesLives https://t.co/Jjo8GP96P7","date":"Thu Jul 15 14:48:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Highest inflation in 13 years. So what’s the Dem’s solution? Borrow another $3.5 TRILLION.\n\nhttps://t.co/kIXHJZGulz","date":"Wed Jul 14 14:30:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Instead of presiding over what should be one of the best economic recoveries in history, @POTUS is presiding over stagnation and #inflation. Even @CNNBusiness isn’t sugarcoating the problems. \n\nhttps://t.co/4ioQED7Sia","date":"Tue Jul 13 14:59:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing on @Newsmax with @stinchfield1776 how Pelosi is waging a political war against Republicans. https://t.co/MQSomQ86dU","date":"Mon Jul 12 12:59:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joining my colleague @RepFredKeller on on leg to get the employees at the National Personnel Records Center back to work so they can help our vets. With only 25% of NPRC staff on site to access records that are only in paper form, many vet's records requests have been delayed. https://t.co/9H7fkRDB8k","date":"Fri Jul 09 14:36:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to promote this legislation with my colleagues @RepBillFoster, @RepJohnKatko, and @JimLangevin, which aims to modernize our digital infrastructure and protect Americans’ personal info.\n \nhttps://t.co/WTpx0cD8gZ","date":"Fri Jul 09 11:25:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Preventing ballot harvesting and requiring voters to submit ballots in their own voting precinct should not be controversial. In this ruling, #SCOTUS upheld the rule of law and  the sanctity of our elections systems. \n \nhttps://t.co/6QnDDFw8zk","date":"Wed Jul 07 11:30:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Amazing what can happen when the government stops paying people not to work. Republican governors ended the subsidy in these states, and I introduced leg in the U.S. House to end the subsidy so we can see results like this nationwide. #ReturnToWorkAct\n\nhttps://t.co/hRjXsUIKtR","date":"Tue Jul 06 18:18:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Have a wonderful Independence Day! https://t.co/DtfxIXuoXo","date":"Sun Jul 04 11:30:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Even though we celebrate #IndependenceDay on July 4th, our independence was actually declared on July 2, 1776. Want to learn more fascinating facts about the Declaration of Independence? Click on the link ⬇️. \n \nhttps://t.co/7Y2YumKWgM","date":"Fri Jul 02 12:07:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What do these 13 cities have in common besides defunding their police by a combined $1.5 BILLION? They are all run by DEMOCRATS. \n\nAustin\nSeattle\nNew York City\nLos Angeles\nSan Francisco\nOakland\nDistrict of Columbia\nBaltimore\nPortland\nPhiladelphia\nHartford\nNorman\nSalt Lake City","date":"Thu Jul 01 15:49:30 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Under Biden’s proposed #AmericanFamiliesPlan and #AmericanJobsPlan, the avg income taxpayer in GA’s 11th district would see a TAX INCREASE of $1,230.10, which breaks his promise of not raising taxes on Americans making less than $400,000/year. Courtesy of @TaxFoundation. https://t.co/kLFovAkBGa","date":"Thu Jul 01 12:15:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I recently toured a hidden gem in Marietta – the Aviation History and Technology Center. The center showcases the history of aviation in the area, and @usairforce and Lockheed Martin’s contribution to the local economy. Thank you for the invite and your hospitality. https://t.co/iQFpdDKsb7","date":"Wed Jun 30 14:14:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Biden’s Senior Advisor Cedric Richmond recently went on national TV and suggested it was Republicans who wanted to defund the police…but in Nov of 2020 he made it very clear it was Democrats who embraced the ‘defund the police’ movement and it cost them in the 2020 elections. https://t.co/N9jpJt4QzO","date":"Tue Jun 29 14:25:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The hypocrisy and #DCDoublestandard is alive and well with @SpeakerPelosi . Below are two statements from the Speaker - one condemns President Trump’s use of military force in 2020 and the other praises President Biden’s use of military force in 2021. The only difference…#TDS https://t.co/z7alF3oTVK","date":"Mon Jun 28 21:11:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Dems failed election takeover, the economy, and the #ReturnToWorkAct on my weekly podcast. https://t.co/lb4jcdrIpU","date":"Mon Jun 28 11:43:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If the Biden Justice Department wants to sue Georgia over their election law, I say, bring it on. Georgia’s election law makes it easy to vote and hard to cheat - and most importantly, follows the rule of law and the U.S. Constitution.","date":"Fri Jun 25 16:07:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite Washington, D.C. lifting all capacity restrictions and the city being 100% open, @SpeakerPelosi continues to keep the House of Representatives closed to the American people. This letter urges Speaker Pelosi to end the political charades and open up the People’s House now. https://t.co/Qvcsdczzlm","date":"Fri Jun 25 12:49:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This looks like a tweet from @TheBabylonBee and not @DHSgov because they cannot be serious when they say our southern border is closed. As of April, over 530,000 immigrants have been encountered at our border - a 20 year high - and many have been released into the U.S. interior.","date":"Thu Jun 24 20:02:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Why has VP Harris not visited the southern border in 93 days? It’s simple...their disastrous policies have made it way too dangerous down there. That’s why Secret Service is taking her to El Paso, instead of where the real problems are.","date":"Thu Jun 24 19:17:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I stand with @GOPLeader in holding China accountable for COVID-19. Declassifying pandemic intelligence, ending gain of function research, prohibiting NIH from funding malevolent governments, and overhauling WHO, is a great start. Click ⬇️ to read about Leader McCarthy’s plan.","date":"Thu Jun 24 11:23:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"1993 Biden understood that guns don’t commit crimes, people commit crimes. Unfortunately, politically correct, 2021 Biden believes that law abiding citizens and the 2nd Amendment are to blame for the surge in crime, not criminals. https://t.co/3AvAuu7M8V","date":"Wed Jun 23 21:16:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden will blame guns for the rise in crime while conveniently ignoring the array of other crimes being committed that aren’t gun related.\n \nHate Crimes in NYC ⬆️ 116.7%\nRapes in Atlanta ⬆️ 97%\nArson in LA ⬆️ 20.65%\nCarjacking’s in Oakland ⬆️ 104%","date":"Wed Jun 23 19:28:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This afternoon, President Biden will make the solution to the crime spike he’s created sound like trigonometry, when in reality it’s basic math: Support the police, arrest the criminals, and enforce the laws that are already on the books.","date":"Wed Jun 23 19:04:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden proposing to remove the #HydeAmendment from the federal budget, which has prevented taxpayer funded abortions for decades, is unconscionable. I will always work to protect the unborn and defend life.\n \nhttps://t.co/37QOgtRc3t","date":"Wed Jun 23 12:12:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"America is in good hands with these young leaders, and I am confident they will represent our state and district well. \n\nhttps://t.co/EQkUFJNt37","date":"Tue Jun 22 13:35:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Good news follows good public policy. \n\nhttps://t.co/xg10Yp59tn","date":"Mon Jun 21 20:33:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing bBig Tech censorship, the #ReturntoWorkAct, and the economy with @OANN. https://t.co/7DsyzxsvR0","date":"Mon Jun 21 14:36:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/a4CUoEpagV","date":"Sun Jun 20 11:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"An update on the tragic death of the Cherokee County officer. Our prayers are with Officer Burson’s family and all those who knew him. \n\nhttps://t.co/oLhrHQFwSg","date":"Fri Jun 18 17:00:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #CongressionalAppChallenge is an excellent way to spark curiosity in computer science and encourage the next generation of computer programmers and coders to advance their education in this important field.\n \nhttps://t.co/dqtezbQHyK","date":"Fri Jun 18 15:00:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Juneteenth commemorates June 19, 1865, when Union Gen. Gordon Granger arrived in Galveston, Tx and brought the news that the Civil War had ended and the enslaved were free. The 13th Amendment was ratified a few months later in Dec 1865 formally abolishing slavery in the U.S. https://t.co/7yZif0cqyy","date":"Fri Jun 18 11:30:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] We are shocked and heartbroken by the death of one our dedicated law enforcement officers in Holly Springs. This is the second shooting of a police officer in our area this week.\n\nhttps://t.co/NSsTbtj1oa","date":"Thu Jun 17 12:35:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] The violence against our peacekeepers is rising, and they need our support. Please join me in praying for this officer’s family, as we mourn the loss of a servant to our community.","date":"Thu Jun 17 12:35:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My conservative principles guide me in every facet of my life. They are not something I only think about when I pull out my voting card; they are a way of life. #ACUF\n\nhttps://t.co/z8rybbC21k","date":"Wed Jun 16 14:15:00 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Denying loans to white farmers, or any farmer based on their skin color is racist and contradicts the Equal Protection Clause of the Constitution and civil rights laws.\n\nhttps://t.co/cvFji1D2nP","date":"Tue Jun 15 18:41:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"@GerryConnolly @ChrisMurphyCT @SenatorLankford","date":"Tue Jun 15 15:29:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The American people have a right to expect a high level of service and professionalism from our federal agencies, given they handle some of the most sensitive aspects of our lives. #TIPSact #HR3609\n\nhttps://t.co/qTCXxeVaAK","date":"Tue Jun 15 15:29:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Happy Birthday to our beloved United States Army. Thank you to all who have served with courage and commitment - for freedom. #ArmyStrong https://t.co/e81aewAmaB","date":"Mon Jun 14 17:38:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we celebrate our flag, a symbol of freedom and hope around the world. #FlagDay https://t.co/wYhSMOQffZ","date":"Mon Jun 14 11:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Criminals stealing nearly $400 billion of the federal unemployment benefits is a matter of national security. Bringing these criminals to justice and retrieving American taxpayer’s money needs to be a priority for President Biden. \n\nhttps://t.co/3VHnl96nY0","date":"Fri Jun 11 11:17:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The migrant surge is worse than it’s been in 20 years. But fixing it is easy @POTUS &amp; @VP: \n\n➡️Finish border wall\n➡️Reinstate Remain in Mexico policy\n➡️Reinstate asylum agreements w/ El Salvador, Guatemala &amp; Honduras \n➡️Stop allowing unaccompanied migrants to remain in U.S.","date":"Thu Jun 10 14:03:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to be named a “Taxpayer Super Hero” by @GovWaste for my votes on issues that eliminate waste, mismanagement, and inefficiency in the federal government, and protecting hardworking taxpayer’s money.\n\nhttps://t.co/9Jqy8VHj6l","date":"Thu Jun 10 11:30:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My bill, the #ReturnToWorkAct would end the federal enhanced unemployment benefits immediately. States are seeing this as the biggest issue hindering their economies; and, this month 25 states are withdrawing from the program in order to help get workers back into the workplace.","date":"Wed Jun 09 16:23:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden should be presiding over one of the biggest economic booms in our history. Unfortunately, he is presiding over stagnation and inflation, and keeping the federal government in the way of America’s small businesses from thriving. https://t.co/FcM9qy6Pga","date":"Wed Jun 09 11:30:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s been 75 DAYS since VP Harris was tasked with handling the border crisis. Seeing and hearing firsthand from our men and women in uniform, who are tirelessly protecting our border, would be worth your time, Madam VP.\n \nhttps://t.co/jBswlymEof","date":"Tue Jun 08 20:49:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While Vice President Harris is busy meeting with Mexico’s President about the #bordercrisis, let’s take note that the Biden Administration created this current crisis. Here are the numbers:\n\nEncounters at southern border (February – April):\n\n2020 – 88,253\n2021 – 453, 090","date":"Tue Jun 08 19:29:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Guatemala’s President knows Biden is to blame for the crisis at our southern border...\n\n\"The message changed too: 'We're going to reunite families, we’re going to reunite children. The very next day, the coyotes were here organizing groups of children to take them to the U.S.”","date":"Mon Jun 07 19:02:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the May jobs Report and getting Americans back to work on my weekly podcast. \n\nSign-up: https://t.co/zeKytaViPD https://t.co/trWcRVWkVa","date":"Mon Jun 07 11:58:18 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we remember D-Day, and those who sacrificed so much in the defense of freedom, as they selflessly stormed the beaches of Normandy seventy-seven years ago. #DDay. https://t.co/eCv6ydHI7g","date":"Sun Jun 06 19:24:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Transformative investments” is a creative way of describing the fact that the $1.8 trillion ‘American Families Plan’ will be financed on the backs of our children and grandchildren.","date":"Fri Jun 04 11:28:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The numbers below show the dramatic increase in the number of illegal immigrants released into the U.S. over the past 3 months through our southern border, though the Biden Administration has said “the border is closed.”\n \nFebruary: 4,782\nMarch: 11,888\nApril: 12,726","date":"Thu Jun 03 11:30:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Conservative leadership and pro-growth, pro-business policies have resulted in Georgia maintaining a AAA bond rating. This means the state has more in the budget to use for programs that benefit everyday Georgians. \n \nhttps://t.co/fSleMiJark","date":"Wed Jun 02 16:53:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing infrastructure, other issues, with John Fredricks on WJFN Radio https://t.co/PkVpznUUY8","date":"Tue Jun 01 11:44:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On Memorial Day, we come together to honor the men and women who gave all for our freedoms. We are eternally grateful. #USA https://t.co/4tU4GzPBjG","date":"Mon May 31 11:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to stand with my colleague @RepBrianMast in support of Israel. This bill will impose sanctions on foreign persons, agencies, and governments that assist Hamas, the Palestinian Islamic Jihad or their affiliates. https://t.co/IcAtGzuFro","date":"Thu May 27 11:24:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden plans to import raw materials from other countries in an effort to expand the EV market, because he doesn’t want to anger Democrats and environmentalists by building mines in the U.S. that would create thousands of American jobs. \n\nhttps://t.co/L0sNjOqE89","date":"Wed May 26 15:51:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As the Colonial Pipeline attack proved, our energy infrastructure is vulnerable. With gas prices up more than 60%, we need to diversify and better secure our energy infrastructure. Pleased to join Rep. Rouzer in highlighting these important concerns in a letter to Pres Biden.","date":"Wed May 26 11:06:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Unlike the national unemployment rate (6.1%), which increased during the month of April, Georgia’s unemployment rate (4.3%) dropped – and has continued to drop for 12 consecutive months. #AprilJobsReport https://t.co/QlRmBGyCUv","date":"Tue May 25 11:24:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing my bill to help restore America’s historic economy on @XTRA1063 with host Mark Zinno. #ReturnToWorkAct https://t.co/jdyY2Il23N","date":"Mon May 24 11:39:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#StandwithIsrael https://t.co/RgL85JUZTa","date":"Fri May 21 14:01:30 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Instead of focusing on real threats, like China, Russia, or Iran, the Pentagon and this Administration seem dedicated to kowtowing to the ‘woke’ mob and cancel culture.","date":"Fri May 21 11:31:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The fact the Pentagon is devoting time, resources, and taxpayer money to monitor our military personnel’s social media pages for conservative political posts, shows how out of touch they are with the problems we currently face.\n \nhttps://t.co/kpa7wxviWB","date":"Fri May 21 11:31:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] My hope now is that the Biden Administration strongly reconsiders its negotiations with Iran, who supplied Hamas with the rockets used during these attacks. They are the leading state sponsor of terrorism in the world, and they cannot be trusted.","date":"Thu May 20 23:26:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] Offering them a seat at the negotiating table undermines our longstanding alliance with Israel.","date":"Thu May 20 23:26:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] It’s good to hear Israel and Hamas have reached a cease-fire. Israel has every right to defend herself from terrorist organizations like Hamas. I’m also pleased to hear Pres Biden commit to replenishing Israel’s Iron Dome defense system.","date":"Thu May 20 23:26:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pres Biden cancels America’s Keystone XL pipeline, but clears the way for RUSSIA’s pipeline. I wonder how the Biden Administration and Dems are going to explain this one? \n\nhttps://t.co/jBNkOain86","date":"Thu May 20 11:38:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Texas, law enforcement said arrests of Border Patrol sex offenders are up a staggering 2500% this year.” – Washington Times\n \nIf this doesn’t get the Biden Administration’s attention, I don’t know that anything will. #SecuretheBorder\n \nhttps://t.co/vpNGrhkogq","date":"Wed May 19 11:30:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great visit with the JROTC cadets at Adairsville High School. Both the male and female Raider teams won National Championships, and we couldn’t be more proud! Congratulations again! #JROTCraiders https://t.co/NaUiHn7zFX","date":"Tue May 18 18:45:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The American people won’t let Biden get away with saying he supports Israel’s right to defend herself while renegotiating JCPOA with Iran - the very country funding Hamas’s rocket attacks. STOP negotiating with the world’s leading state sponsor of terrorism and #STANDwithIsrael.","date":"Tue May 18 14:52:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I am pleased to announce the winners of the 2021 Congressional Art Competition for Georgia’s 11th Congressional District. Watch to the end to see all the amazing artwork submitted this year. https://t.co/68P4vdVy3I","date":"Tue May 18 12:38:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank You to all the men and women who have served and are serving in the Armed Forces. #ArmedForcesDay https://t.co/VKme8W9NNL","date":"Sat May 15 11:30:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m proud to work with my colleague @jdanbishop on a bill to make the former President’s Executive Order banning the use of critical race theory #CRT in federal agency training permanent. https://t.co/zwiL2xcYlo","date":"Fri May 14 14:33:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m proud to be working with my colleague @RepChipRoy on a bill to prohibit federal money from going to any school that promotes race-based theories, like critical race theory #CRT. https://t.co/EilUoZqzS2","date":"Fri May 14 12:49:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With a record 8.1 million jobs available, it’s past time we get America back to work. Thank you @GovKemp for taking the necessary steps to get Georgia’s economy back to the historic levels we saw before the pandemic.\n\nhttps://t.co/aJxiCuf7OD","date":"Thu May 13 16:49:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] Thank you to all the police officers who protect us every day, and to those who have paid the ultimate sacrifice in the line of duty.","date":"Thu May 13 14:22:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] I visited the memorial panel where Smyrna Police Officer Christopher Eric Ewing’s name was inscribed after his death in April 21, 2020. Officer Ewing was killed by an impaired driver when he was attempting to conduct a traffic stop in Smyrna, Georgia.","date":"Thu May 13 14:22:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] In celebration of National Police Week, House Republicans honored law enforcement for their selfless service with a #BacktheBlue bike ride, which was followed by a memorial gathering at the National Law Enforcement Memorial in D.C. to pay tribute to our fallen heroes. https://t.co/bNwYnRwg2p","date":"Thu May 13 14:22:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A Member of Congress accusing another Member of committing a crime – without evidence – is morally reprehensible and a stain on this institution. The Committee on Ethics needs to take quick and decisive action to ensure this never happens again.\n\nhttps://t.co/xygI1wtA6H","date":"Wed May 12 14:31:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m proud to have supported the United States in assisting Israel in bolstering its missile defense programs like Iron Dome in the FY 2022 Defense Appropriations Bill. As you can see in the video, Iron Dome is saving thousands of innocent lives from Hamas’s rockets.","date":"Wed May 12 13:47:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The United States has never wavered in our support of Israel. Israel has every right to defend itself from the rockets Hamas is firing at innocent civilians and schools. 🇺🇸 🇮🇱","date":"Wed May 12 12:33:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On day 1, Biden CANCELLED the #KeystoneXL Pipeline. Now his Admin is stressing the importance of pipelines and their unique capability in transporting fuel to large portions of the US quickly/SAFELY.  I guess only Trump-supported pipelines are bad. #flipflopjoe #ColonialPipeline","date":"Tue May 11 20:22:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing my bill to end the federal unemployment subsidy, which is preventing businesses from filling millions of open jobs and causing prices on good to skyrocket on @TeamCavuto w/ @cvpayne. https://t.co/6g7qNvb49A","date":"Tue May 11 14:56:16 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the growing opposition to woke corporations against voter integrity laws on #WashingtonWatch with @tperkins. https://t.co/qFpUoZysZP","date":"Mon May 10 10:37:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"May each mother have an especially wonderful day. https://t.co/UZg8XXzIdl","date":"Sun May 09 16:52:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all our military spouses!  As a veteran, I know firsthand that your support for our service member’s mission is matchless! #MilitarySpouseAppreciationDay https://t.co/3XFWifx1mX","date":"Fri May 07 12:11:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Prayer is today as powerful a force in our Nation as it has ever been. We as a Nation should never forget this source of strength.” – President Ronald Reagan #NationalDayOfPrayer https://t.co/DnnKVwYE9m","date":"Thu May 06 12:43:18 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The demand for skilled trade labor is skyrocketing, with many offering great pay without requiring a traditional degree. Get started learning a trade today by researching trade schools, apprenticeships, or on-the-job training. #NationalSkilledTradesDay https://t.co/zveNoNREfe","date":"Wed May 05 12:54:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"When I asked the USCP IG who has oversight of the Capitol Police board, his response was, “I do not know that, sir.”\n\nWe need to look into this and figure out how we can make the board more effective and accountable; because without oversight, there’s no accountability.","date":"Tue May 04 11:19:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"ICYMI: Listen to this inspiring speech by @SenatorTimScott","date":"Mon May 03 11:11:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to Georgia 11’s very own, Trevor Lawrence, on being selected #1 overall in the 2021 NFL Draft.\n\nhttps://t.co/DfGiBsquM7","date":"Fri Apr 30 00:28:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"For America to truly recover, Biden should follow the lead  of leaders like Governors Brian Kemp, Kristi Noem, and Ron Desantis - open our nation back up, instead of raising taxes and growing government. \n\nWhat we need is less government control and more personal responsibility.","date":"Thu Apr 29 10:17:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Repubs and Dems have a range of bipartisan issues we could be working on together from infrastructure, economy, police reform to immigration reform, but it takes a willingness to talk with the other side. Repubs are ready to work together, are you @POTUS? #BidensFirst100Days","date":"Thu Apr 29 02:12:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Biden Administration and Dems have willfully sat by while anti-police rhetoric has continued to ratchet up. And the consequences of this type of rhetoric can be seen in cities like NYC, which has seen a 75% increase in retirements among NYPD officers. #BidensFirst100Days","date":"Thu Apr 29 01:57:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If Biden and Dems were serious about police reform, they would stop calling the Senate filibuster rule racist because, after all, they were the ones who used the filibuster last Congress to block Senator Tim Scott’s commonsense, bipartisan, police reform bill from having a vote","date":"Thu Apr 29 01:57:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If the President and Dems were serious about getting things done in a bipartisan manner, they should stop trying to expand their own power by passing unconstitutional measures like H.R. 1, making D.C. and Puerto Rico states, and expanding the Supreme Court. #BidensFirst100Days","date":"Thu Apr 29 01:32:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] And to think, these are just the numbers from a completely overwhelmed border patrol staff who have been overrun for the past 4 months, with no end in sight. #BidensFirst100Days","date":"Thu Apr 29 01:29:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In a little over a month, our southern border saw 684 criminal arrests; and siezed 5,077 lbs of marijuana; 93 lbs of cocaine, 53 firearms, and over $1 million.","date":"Thu Apr 29 01:29:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Now his administration is telling ICE and CBP they can no longer use words like illegal alien, unaccompanied alien children, undocumented alien, and alien, as if this will somehow fix the problem. #BidensFirst100Days","date":"Thu Apr 29 01:27:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In order for there to be a border crisis, Biden had to create one, which is exactly what he did when he reversed policies like the ‘remain in Mexico’ policy.","date":"Thu Apr 29 01:27:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] He is hijacking real concerns Americans have to pass a far-left agenda that hopes to fundamentally change the fabric of this country forever. #BidensFirst100Days","date":"Thu Apr 29 01:21:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Pres. Biden lied to the American people when he said his $1.9 trillion covid relief bill was about covid relief, and he is lying to the American people again about his infrastructure package being about infrastructure.","date":"Thu Apr 29 01:21:16 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joe Biden campaigned saying, “you can’t [legislate] by executive order unless you’re a dictator,” yet in the first two weeks of his administration, President Biden signed more executive orders than President Trump and President Obama combined. #BidensFirst100Days","date":"Thu Apr 29 01:20:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joe Biden promised us he would bring the country together and govern from the middle, but all he’s done is sign executive orders, kowtow to the ‘woke’ mob, signed the largest partisan bill in history, and open our southern border. #BidensFirst100Days","date":"Thu Apr 29 01:18:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] While campaigning from his basement, all we heard Joe Biden say was “follow the science,” which is odd given all he and his administration have done the first four months is ignore the science when it comes to reopening schools.","date":"Thu Apr 29 01:11:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I guess what he meant to say was “I’ll follow the science…unless teachers unions tell me not to.” #BidensFirst100Days","date":"Thu Apr 29 01:11:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] First of all, the record development, production and distribution of the COVID-19 vaccine is due to Operation Warp Speed and the Trump Administration. The only things President Biden and VP Harris should be taking credit for is contributing to vaccine hesitancy","date":"Thu Apr 29 01:10:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] because they undermined the public’s confidence in the vaccine at every turn on the campaign trail, and signing a $1.9 trillion covid ‘relief’ bill that had almost nothing to do with covid. #BidensFirst100Days","date":"Thu Apr 29 01:10:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Enough of the double standards, Speaker Pelosi needs to admit she broke her own the rules and pay the fine.","date":"Tue Apr 27 13:13:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my Weekly Newsletter, I discussed the importance of protecting your digital privacy and my bill H.R. 2039.\n\nSign up for my newsletter by visiting: https://t.co/vOmmHPWXHa https://t.co/3mjp1GbKwS","date":"Mon Apr 26 11:23:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A commonsense, balanced approach to reopening is exactly what Americans want and deserve, and Georgia is one of those states leading the way. #MarchJobsReport https://t.co/3QOQVhoo1D","date":"Fri Apr 23 11:36:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A single-year homicide increase of 25% in the U.S. is exactly what you get when you support defunding the police. Police need bigger budgets, more training, and better pay. Cities like New York removing $1 billion from the police budget will only make things worse. https://t.co/O6MpvHsLS1","date":"Thu Apr 22 11:56:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I hope @TheJusticeDept investigation into the Mpls Police Dept includes reviewing the consequences of removing $8 million from their budget. Elected officials kowtowing to the defund the police mob, like they did in Mpls, will only result in our communities being less safe.","date":"Wed Apr 21 22:54:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While Rep. Waters’ comments may not be criminal, they are inflammatory and should be censured by the Hse. The fact that we don’t see comments or headlines, like ⬇️, shows they don’t mind abandoning their own principles if it means scoring political points. #DCDoubleStandard https://t.co/DYFe7HWCnW","date":"Tue Apr 20 20:48:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #GreenNewDeal, aka the blueprint for President Biden’s “infrastructure” package, will be reintroduced today in the House. Not only does this pseudoscience ‘deal’ eliminate combustible engines in ten years, it will also cost American taxpayers $93 TRILLION.","date":"Tue Apr 20 11:22:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Predictable that @SpeakerPelosi will not condemn the comments made by Rep. Waters. Now, @GOPLeader and Republicans have no choice but to force a vote on the House floor to censure her for her inciting remarks.","date":"Mon Apr 19 21:04:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@RepMaxineWaters, since you are suing former President Trump for inciting violence on Jan. 6, does this mean you are going to sue yourself for inciting violence? https://t.co/cv4jVJ3eje","date":"Mon Apr 19 15:00:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In my Friday Weekly Newsletter, I exposed what Democrats are hiding in their agenda. \n\nSign up for my newsletter by visiting: https://t.co/vOmmHQeyyI https://t.co/hglfavgHMb","date":"Mon Apr 19 11:23:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] even though she’s the proclaimed ‘border czar.’ To Democrats, it seems, the safety and security of Americans is not a priority, but expanding political power in Washington is.","date":"Fri Apr 16 11:26:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] Since the Biden Administration stopped securing our southern border, we have seen an unprecedented surge of illegal immigrants and unaccompanied migrant children... https://t.co/j2QCTDkTQF","date":"Fri Apr 16 11:26:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] The number of children is expected to increase from the estimated 13,000 to over 117,000 by the end of the year. But, according to Biden and Washington Democrats, there is not a crisis at the border, and the Vice President refuses to visit the border...","date":"Fri Apr 16 11:26:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Yet another hoax designed to hurt a sitting U.S. President and influence an election. Time to file this one away with the Russia collusion hoax. \n\nhttps://t.co/qNn9qzUPBP","date":"Thu Apr 15 16:04:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Today, Dems in Congress will shamelessly, again, try dismantle our institutions of government to expand their own political power. Packing the Supreme Court was once a “boneheaded idea,” according to Joe Biden. Justice Ruth Bader Ginsburg said, this is “a bad idea,”","date":"Thu Apr 15 14:39:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] and liberal Jus. Breyer said that structurally altering the court would “further erode” trust in our courts. But to the power hungry leadership of the Hse and Senate, this is more important than securing our borders, getting Americans back to work, and opening our schools.","date":"Thu Apr 15 14:39:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"TAX REMINDER: The deadline to file your FEDERAL and STATE tax returns has been extended to Monday, May 17, 2021. https://t.co/UdrJCae9jQ","date":"Thu Apr 15 11:30:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Protecting the life of a child that survives an abortion should not be up for debate. I’m proud to add my name to this list. #EndInfanticide","date":"Wed Apr 14 21:35:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Educate and inform the whole mass of the people. They are the only sure reliance for the preservation of our liberty.” - Thomas Jefferson https://t.co/QhzNrQIIqf","date":"Tue Apr 13 12:03:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Georgia’s election law on #WashingtonWatch with host @TPerkins https://t.co/0eJkmbIcpF","date":"Mon Apr 12 11:42:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@MLB’s decision to move the #AllStarGame to a state that has more restrictive voting laws than Georgia, shows their decision was not based on facts; it was based on listening to the woke mob, President Biden, and Stacey Abrams. https://t.co/aoxei6pRI8","date":"Fri Apr 09 10:57:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] so that our men and women in law enforcement are better trained and equipped to protect our communities.","date":"Thu Apr 08 16:27:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] President Biden’s EO on guns is, yet again, tone deaf and out of touch with what America needs. If the president and Democrats were serious about fixing gun crime in this country, they would support common sense legislation, like @SenatorTimScott’s #JUSTICEact","date":"Thu Apr 08 16:27:54 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s election law is very similar, and even better, than many of the states Democrats represent. It’s past time we base our criticisms on the facts, not hypocritical political talking points. https://t.co/N7grzuSzNo","date":"Thu Apr 08 16:06:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The surge of illegal immigrants at the southern border is worse than it’s been in over 15 years, and will only continue to worsen because of President Biden and VP Harris’ inaction. #BidensBorderCrisis\n\n“A nation that cannot control its borders is not a nation.” \n\n― Ronald Reagan https://t.co/m4uOiGtPgN","date":"Wed Apr 07 11:30:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My full interview on @Newsmax where I discussed Georgia's election bill, infrastructure, COVID and more. https://t.co/WBx3AVMmNU","date":"Tue Apr 06 10:47:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today we honor the spouses of military members killed in the line of duty. Thank you for your support and sacrifice. #GoldStarSpousesDay #USA https://t.co/8FlhFa4dRy","date":"Mon Apr 05 11:30:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#ResurrectionDay https://t.co/aqlItyVAAS","date":"Sun Apr 04 11:30:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Please join me and my family in praying for his family, and for the healing of the officers injured in yesterday’s attack.","date":"Sat Apr 03 12:01:33 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In spite of the unprecedented threats to our national Capitol, the US Capitol Police remain dedicated and vigilant. Yesterday, we lost another brave officer in the line of duty.","date":"Sat Apr 03 12:01:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Have a blessed Good Friday. https://t.co/1U2kaWDR1l","date":"Fri Apr 02 11:30:10 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"State Rep Todd Jones exposes hypocrisies surrounding Georgia election law. \n\nhttps://t.co/TjpcXTPpG6","date":"Thu Apr 01 18:37:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Apparently, requiring an ID to vote is racist, but requiring an ID for the million other things in life isn’t. https://t.co/oE4bznNAoM","date":"Thu Apr 01 15:53:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"⚠️Warning⚠️ Graphic video: Small children being dropped from the top of a 14 foot fence and abandoned, by smugglers at our southern border. Enough of playing politics @POTUS @VP, fix this border crisis now! #BidensBorderCrisis https://t.co/FMyJAjFPCw","date":"Thu Apr 01 15:27:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It amazes me that @SpeakerPelosi, Dems, and the media can label Repubs as ‘less than American’ bc some objected to the EC certification; then within a matter of months, try to overturn the #IA02 election. Great to see this power grab fail. Welcome, @RepMMM #DCDoubleStandard","date":"Thu Apr 01 13:46:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President Biden spreading falsehoods about Georgia’s election bill is further evidence to suggest this is a partisan smear campaign, not based in fact.\n\nhttps://t.co/ONoMuow488","date":"Wed Mar 31 18:00:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Delta never raised these concerns when the bill was going through the legislature. You have to have an ID to get on a Delta flight. Other (blue) states that Delta operates in already have the same laws.\n\nDelta is bowing to pressure from the woke mob.","date":"Wed Mar 31 17:31:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“This bill makes it easy to vote; hard to cheat.” - Gov. Brian Kemp\n\n@GovKemp dismantles the lies and misconceptions Democrats and the media have spread about Georgia’s election bill. https://t.co/QlDOSXBuin","date":"Wed Mar 31 15:44:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#SmallBusinesses: Congress just extended the popular Paycheck Protection Program #PPP through May 31, to further assist small businesses affected financially by the effects of #COVID. Click on my Business Brief below to find out more.\n\nhttps://t.co/hjmOZq5NuM","date":"Wed Mar 31 11:30:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia's recovering economy and neighbors helping neighbors. https://t.co/nB3fr6YEvM","date":"Tue Mar 30 11:38:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On @newsmax with @JosephPinion &amp; @EmmaRechenberg discussing the misconceptions about GA’s election bill, like the one that says the law prohibits the distribution of water to voters. This is false; the bill allows water to be distributed as long as it comes from poll officials. https://t.co/xPcyTm6iaS","date":"Mon Mar 29 16:33:27 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"THANK YOU, Vietnam War veterans! https://t.co/5Tj2vnPmoH","date":"Mon Mar 29 11:32:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/D53njyNOkN","date":"Sun Mar 28 14:13:32 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"‘Rules for thee, but not for me’ seems to be the Democrats motto in 2021. However, we are not going to just overlook this. To the Dems in the Committee on House Administration, @HouseAdmnGOP aren’t going to sit by while you continue to abuse your power.","date":"Fri Mar 26 14:59:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The CDC has updated their COVID-19 guidelines for K-12 schools. Most notably are the revised distancing guidelines. The CDC is now recommending 3-feet of separation between students, instead of 6-feet. Further changes can be found in the link. \n\nhttps://t.co/3HvSLlFii6","date":"Fri Mar 26 11:30:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #MedalofHonor is the highest award for military valor. Our nation is indebted to those who have served and sacrificed so much for our freedoms. Today, and every day, we appreciate and honor our Medal of Honor recipients. https://t.co/fQOPhV9ef1","date":"Thu Mar 25 12:55:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Take a look inside #BidensBorderCrisis… We can see why he kept the media locked-out from the facilities at our southern border so long...bc it’s the worst it’s been in over a decade. Where are the Dems who decried the border when Trump was president? https://t.co/0856fW5ydn","date":"Tue Mar 23 11:01:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter:\n\nOn the #ErickEricksonShow with @AlanJSanders on @WSBradio \n \nhttps://t.co/6QGC0vkVe2 https://t.co/nfYRIh7ELB","date":"Mon Mar 22 11:22:30 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Combine these numbers with the fact that U.S. border officials predict the number of migrants attempting to cross our southern border could reach 1 MILLION this year. #BidenBorderCrisis https://t.co/ENDLpFjAin","date":"Fri Mar 19 11:30:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The events of the past year have highlighted the importance of having strong internet connections, which is one reason I’m joining forces with my colleague @RepMoolenaar on legislation to help Americans bolster their home internet speed. #BOOSTact https://t.co/sbrVOSfSNu","date":"Thu Mar 18 11:30:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is the press release from the @CherokeeSO regarding the shootings in Cherokee County. https://t.co/nZuyLbU2Db","date":"Wed Mar 17 18:13:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] My staff members and I are horrified by the violent shootings that took place at businesses in Woodstock and Atlanta this afternoon. Our prayers are with the families of the victims this evening, and for healing for those injured.","date":"Wed Mar 17 02:30:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I am so grateful for our law enforcement professionals who identified and apprehended the suspect.","date":"Wed Mar 17 02:30:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#DCDoubleStandard","date":"Wed Mar 17 02:07:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In 2018, when Senate Repubs were in the majority, @SenatorDurbin (D-IL) said ending the filibuster “would be the end of the Senate.” Now that Dems have the majority, Sen Durbin says the filibuster has a “death grip” on governance and is fighting to abolish it. #DCDoubleStandard","date":"Tue Mar 16 17:21:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If you’re willing to look, it’s not hard to figure out how the #BidenBorderCrisis began. https://t.co/L7oQGlDU9L","date":"Mon Mar 15 16:44:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In Pelosi’s fantasy land, the crisis at the border - which is a result of the Biden Administration opening the border and abandoning the Trump Administration’s strong border enforcement - is Trump’s fault. #BidenBorderCrisis \n\nhttps://t.co/ctLri7eV5H","date":"Mon Mar 15 16:41:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Freedom is only One Generation away from Extinction #RonaldReagan https://t.co/a4qVtTBCAQ","date":"Mon Mar 15 11:18:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My colleague @Rep_Clyde and I are joining forces on legislation that will change the three ‘business day’ waiting period on gun purchases to three ‘calendar days.’ Law abiding citizens deserve to exercise their rights without unnecessary delays from the federal government. https://t.co/tUr4DVGocI","date":"Fri Mar 12 17:25:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Governor Kemp has announced that beginning March 15, those in Georgia over 55 years old and older than 16 years old with high-risk medicial conditions, will be eligible to receive the COVID-19 vaccine. Click below for more information.\n\nhttps://t.co/rLJVpUpDVn","date":"Thu Mar 11 12:35:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The only thing bipartisan about the Dems massive $1.9 trillion liberal payout was the bipartisan vote against it.\n\nhttps://t.co/T2qve8LLRY","date":"Wed Mar 10 19:21:47 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“We are not saying, ‘Don’t come.’ We are saying, ‘Don’t come now...’ “\n\n- Biden’s DHS Secretary Alejandro Mayorkas\n\nThis message is deeply flawed and dangerous for our country. #BidensBorderCrisis https://t.co/K9GIARQzgZ","date":"Wed Mar 10 14:14:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As a former small business owner, I know how crucial independent contractors are to our workforce. The #PROAct is another Democrat-led, top-down mandate to prohibit individuals from working as independent contractors, which would be devastating to many small biz’s and cost jobs.","date":"Tue Mar 09 20:24:39 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If Democrats were serious about curbing gun violence in this country, maybe they should not: allow criminals to cross our borders, let them out of prison so easily, and give them stimulus checks. #NotoHR8","date":"Tue Mar 09 15:27:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Criminals do not follow the law...that’s why they’re criminals. Only law-abiding citizens follow the law; thus another gun bill #HR8 will do nothing to curb gun violence in this country.","date":"Tue Mar 09 15:27:57 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joining forces with my colleague @RepJoeWilson on legislation that will bring more transparency to our universities, by requiring foreign organizations to register under #FARA, and the universities to publicly disclose foreign financial contributions above $50 K. https://t.co/KFoZeAnacm","date":"Tue Mar 09 12:39:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While a steel, razor wire-topped fence, patrolled by armed National Guard, exists around the Capitol to keep Americans out, @POTUS has stopped SW border wall construction and turned our dentition centers into welcome centers, where criminals, drugs, and weapons enter our country.","date":"Mon Mar 08 19:35:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Democrats' national election reform bill is dangerous for our country. #HR1 https://t.co/2LVcxy8zsL","date":"Mon Mar 08 11:45:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"More evidence that our economy is ready to boom and we need to fully open up again; and proof that freedom and a free market is a more effect stimulus than big government and $1.9 trillion in liberal spending.\n\nhttps://t.co/5njwbzC3CC","date":"Fri Mar 05 15:32:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Dems passed a bill that would weaken our police and make Americans more vulnerable to crime, while Pelosi was inside the steel barriers with razor wire, surrounded by thousands of law enforcement and soldiers with guns - to protect her and members of Congress. #DCdoublestandard","date":"Thu Mar 04 18:46:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Last night, Dems passed a bill that would weaken our police and make America less safe. I’m proud to join forces with @RepPeteStauber &amp; @SenatorTimScott with leg. to provide our police with the funds and training they need to ensure our cities and communities are protected. https://t.co/5neI4SlK6X","date":"Thu Mar 04 15:07:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Hidden in Pelosi’s $1.9 trillion ‘COVID relief’ bill is $570 million to pay federal employees to stay home if their child is not in school for in-person learning. Not only does this treat federal government employees differently than everyone else...","date":"Wed Mar 03 18:41:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] it’s another #DCDoubleStandard. And, it would further incentivize ongoing school closures, which have been catastrophic for our children. Children are now ten times more likely to die from suicide than from COVID.","date":"Wed Mar 03 18:41:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On this day in 1931, Francis Scott Key’s poem, the “Star Spangled Banner” became our National Anthem. https://t.co/9yyYZeSpIB","date":"Wed Mar 03 16:15:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"When Dems introduced their national election reform bill (#HR1) during the Trump Admin, there were a number of ‘ethics’ provisions included for the president; but, now that Biden is president, those ethics provisions have been quietly removed from the bill. #DCDoubleStandard","date":"Wed Mar 03 14:36:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Celebrating 106 years of service to our great country. Thank You #USNavyReserve! https://t.co/AVaoOOdte5","date":"Wed Mar 03 12:30:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I find it strange that @VP Harris has not publicly spoken out on the sexual harassment claims involving Gov. Cuomo since the first victim came forward almost 3 months ago. #DCDoubleStandard","date":"Tue Mar 02 21:39:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Being the first female VP and an outspoken supporter of victims of sexual harassment in the past – especially when a Republican has been involved...","date":"Tue Mar 02 21:39:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Why does Speaker Pelosi only give an 800 page bill, that was referred to 11 different committees, a 2-hour hearing in the smallest committee in the House of Representatives… Is it so the American people don’t find out what’s in it?? #HR1 https://t.co/p5BC7tvTcZ","date":"Tue Mar 02 15:53:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Dems and media accused President Trump of putting kids in “cages” and running “concentration camps,” while staying silent when Obama/Biden were in office. Now that Biden is president, they suddenly don’t say a word (again). #DCDoubleStandard","date":"Tue Mar 02 12:26:05 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Notice the chain link fencing as Obama/Biden Homeland Security Sec, Jeh Johnson, tours a migrant facility in 2014? This practice began under the Obama administration and continued under Trump.  Difference is... https://t.co/5Is3ZY1gmL","date":"Tue Mar 02 12:26:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Now we know why Biden, Pelosi and Schumer despised Trump’s America 1st policy; because their policies reveal their true agenda...provide the best education opp to those entering our country illegally, while refusing to get American children back in the classroom. Outrageous!","date":"Mon Mar 01 12:25:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This week, I was able to thank the men and women of the @GeorgiaGuard, deployed to our nation’s Capitol, for their dedicated service. I assured them we were working to get them back home to their families as soon as possible. https://t.co/KnbyNcRiu3","date":"Fri Feb 26 14:00:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/CFaGYar0Ja","date":"Fri Feb 26 00:00:08 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/7e6qigT2O6","date":"Thu Feb 25 22:50:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/yJSfRhwLXg","date":"Thu Feb 25 21:46:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/VlyKoqAwYv","date":"Thu Feb 25 20:48:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/1MPn0dmFFU","date":"Thu Feb 25 19:49:45 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/872JsBqPIF","date":"Thu Feb 25 18:45:20 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/B3Fx9BJG2M","date":"Thu Feb 25 17:40:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Check out what Democrats are planning to spend YOUR money on in their $1.9 trillion COVID “relief” bill. #DidYouKnow https://t.co/bDm7Vp3xop","date":"Thu Feb 25 12:30:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#DidYouKnow 91% of the Democrats $1.9 trillion “emergency” COVID relief bill goes towards things like: \n\n➡️Union Pensions\n➡️Blue State Bailouts\n➡️Planned Parenthood\n➡️Nat’l Endowment for the Arts\n➡️Schumer’s Bridge\n➡️Pelosi’s Tunnel","date":"Wed Feb 24 21:53:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#DidYouKnow? In the Democrats $1.9 trillion bill, 95% of new money for schools will not be spent until 2022-2028? The $68 billion in December’s COVID relief bill for schools remains unspent.","date":"Wed Feb 24 19:52:50 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#DidYouKnow? In the Democrats $1.9 trillion “emergency” COVID relief bill, 91% is for non-COVID related spending?","date":"Wed Feb 24 16:45:21 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Not only will #HR1 send taxpayer money to politicians you as Americans may not support; but it will also make “pandemic” election changes permanent. Many of theseelection changes were instituted in states without going through the Constitutional legislative process. https://t.co/WiCN1g1TQs","date":"Wed Feb 24 12:30:12 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Emergency COVID Relief? Pelosi has craftily hidden a $112 MILLION gift to her Silicon Valley friends so they can build an underground railway. How does that help the over 800,000 who just applied for unemployment, or the energy sector jobs that will be lost bc of @POTUS’s EOs? https://t.co/1W7xIBw6NN","date":"Tue Feb 23 19:10:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Georgia continues to see more signs of a V-shaped economic recovery. Our great state is now among the TOP 10 exporting states in the country, for the first time.\n \nhttps://t.co/s47UGbpL3F","date":"Tue Feb 23 12:36:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Excerpt from article: “Approximately 90% of Georgia merchandise exports are manufactured goods, and the state’s manufacturing exports have grown by more than 30% over the last 10 years alone.”","date":"Tue Feb 23 12:36:25 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The reality is, Democrats are fearful of not being able to pass their liberal wishlists down the road; that’s why they are hiding BILLIONS of dollars in non-COVID related spending in the proposed “#AmericanRescuePlan.”","date":"Mon Feb 22 16:31:47 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Individuals, families, and small businesses are still struggling for sure. But, shouldn’t we use the $4 trillion in #COVID relief that Congress already passed before talking about spending another $1.9 trillion?","date":"Mon Feb 22 16:31:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing President Biden's immigration plan on @Newsmax with @stinchfield1776. https://t.co/4Noz7A2r3W","date":"Mon Feb 22 12:32:20 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Question: What does @POTUS do after Iran attacks the U.S. military base in Iraqi Kurdistan…? \n\nAnswer: Capitulate to Iran - the world’s lead state sponsor of terrorism, lift sanctions, and rejoin the #JCPOA, which will help pave the way for Iran to develop a nuclear weapon.","date":"Fri Feb 19 15:11:37 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Speaker Pelosi should pay the $5,000 fine, which she imposed for walking around the magnetometers onto the House floor. She needs to follow the rules she’s imposed on everyone else, and stop the #DCDoubleStandard. \n\nhttps://t.co/F9wKvlz9LZ","date":"Fri Feb 19 13:40:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] The real truth is, the Democrats immediately called for more regulations after the #GameStop incident when, ironically, it was regulation that caused trading to be paused in the first place. Exhibit A... ⬇️\n\nhttps://t.co/PKVqiv6hP9","date":"Thu Feb 18 20:54:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] In today’s @financialcmte hearing, I questioned the Democrat demands for more regulations. @RepMaxineWaters responded and said that no one has called for more regulations and that I should be accurate with my statements.","date":"Thu Feb 18 20:54:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joining forces with my colleague @RepArmstrongND\non legislation to allow the construction of the #KeystoneXL to continue despite @POTUS revoking the presidential permit. America’s continued energy independence and 11,000+ blue collar jobs depend on it. https://t.co/D9RBb5fiTw","date":"Thu Feb 18 15:03:03 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As we settle into the new year and new Congress, it’s helpful to hear from you about what issues Congress needs to address in 2021. Please take a moment and complete this survey – it’s just THREE questions!\n\nhttps://t.co/r5qRifreZD","date":"Thu Feb 18 13:26:44 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to support the Small Business Credit Initiative, which is a program where state governments support lending to small businesses.","date":"Wed Feb 17 21:16:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"\"He is the atoning sacrifice for our sins, and not only for ours but also for the sins of the whole world.\" – John 2:2 #AshWednesday https://t.co/iHTrr34IIf","date":"Wed Feb 17 19:31:59 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The world has lost two influential voices who will be greatly missed! Conservative radio icon, Rush Limbaugh, and Christian music legend, Carman Licciardello, both impacted my life, and millions of others. Prayers for their families, and for all of us as we mourn with them.","date":"Wed Feb 17 18:12:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Almost a month into the Biden Administration, and he has yet to speak with the president of Israel, but he has spoken with the president of China… Where are those who criticized President Trump for cozying up to dictators? #DCDoubleStandard","date":"Tue Feb 16 15:57:49 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In honor of George Washington, the first president of the United States, Happy #PresidentsDay. https://t.co/A1r5UfjkC8","date":"Mon Feb 15 12:27:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we recognize Georgia’s colonial founding, the day Gen. James Oglethorpe and other settlers landed on the shores of what would later become known as Savannah, Georgia.  #HappyGeorgiaDay https://t.co/CfrmZYpUVa","date":"Fri Feb 12 16:32:01 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Remember when Dems criticized Trump for undermining public health officials? They are doing exactly that by opposing reopening schools. This week, I offered an amendment to the Dems’ $1.9T spending proposal to require schools to reopen, but Dems rejected it. #DCDoubleStandard https://t.co/LbWxTuY2xu","date":"Fri Feb 12 15:36:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Always bear in mind that your own resolution to succeed is more important than any one thing.”  ― Abraham Lincoln https://t.co/x93ZEuIl02","date":"Fri Feb 12 12:30:14 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As if cancelling George Washington, Abraham Lincoln, and Thomas Jefferson wasn’t ludicrous, the left is starting to cancel themselves, i.e., Dianne Feinstein. \n \nhttps://t.co/6haniZpJyp","date":"Thu Feb 11 17:27:09 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2]  human rights abuses is an insult to what we as Americans stand for. @POTUS should reconsider rejoining this corrupt organization if he truly cares about holding countries who violate human rights accountable. https://t.co/NTm5q1Wn43","date":"Thu Feb 11 12:26:06 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Don’t be fooled by the name…the #UNHumanRightsCouncil is anything but a council that actually addresses human rights problems in the world. Giving countries like China, Russia, and Cuba a platform to speak about…","date":"Thu Feb 11 12:26:04 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While @POTUS halts border wall construction - designed to keep criminals, weapons, and drugs out of the U.S. - the president, Sen Schumer, Speaker Pelosi and the rest of the Dems have had a WALL built around our nation’s Capitol - to keep American’s out! #DCDoubleStandard https://t.co/rpstre8Lus","date":"Wed Feb 10 12:30:38 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In 2017, Trump requested the resignations of 46 Obama-era DOJ attys and was deemed ‘sudden’ and ‘abrupt’ by Dems/media. 21 days into the Biden Admin, @POTUS is requesting the resig of 56 Trump-era DOJ attys which is being characterized as ‘common’ and ‘routine.’ #DCDoubleStandard","date":"Tue Feb 09 17:25:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"After Democrats criticized Trump for undermining public health officials, the Biden Administration is doing exactly that. They are ignoring the CDC’s recommendation to reopen schools. #DCDoubleStandard\n\nhttps://t.co/plx2rYBwzS","date":"Tue Feb 09 12:30:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Rep. Ron Wright was a kind and compassionate man who proudly represented his Texas constituents.  My prayers are with his wife and family during this difficult time. https://t.co/28AKpoTHYx","date":"Mon Feb 08 17:15:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing Pelosi's handling of COVID relief and Rep. Greene with @RachelRollarTV on @Newsmax. https://t.co/uTAyRoAWOM","date":"Mon Feb 08 11:22:56 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"His words are forever inspiring. Happy Birthday, President Ronald Reagan. https://t.co/xa968RFzw8","date":"Sat Feb 06 12:30:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Myself, @RodenyDavis and @RepBryanSteil  sent the following letter to the SAA asking them to fine @SpeakerPelosi $5,000 for breaking House rules she put into place. Yesterday, members witnessed Speaker Pelosi walking around the metal detectors prior to walking on the House floor. https://t.co/viECe18Qy5","date":"Fri Feb 05 23:00:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@HawleyMO book deal cancelled after voting against certifying electors. #HunterBiden inks book deal despite being under criminal investigation by the @TheJusticeDept and pedaling his father’s influence to get rich off communist China. #DCDoubleStandard","date":"Fri Feb 05 19:05:20 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The pandemic has highlighted the importance of #schoolchoice. Parents should be allowed to decide what best fits their children’s educational needs - not politicians, and not teachers unions.\n \nhttps://t.co/t8sHnukGSW","date":"Fri Feb 05 12:37:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/W81k3wPtQe","date":"Fri Feb 05 01:04:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Rep #IIhanOmar has:\n\n➡️Characterized #september11 as “some people did something\"\n➡️Defended the #MuslimBrotherhood terror organization and coconspirator, #CAIR\n➡️Advocated for dismantling “U.S. economy and political system\"\n➡️Made numerous #antisemitic comments\n\n#DCdoubleStandard","date":"Thu Feb 04 18:17:53 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"For the second straight Congress, I’m joining forces with my colleague @RepAnnWagner to impose criminal penalties for abortion providers who do not provide medical care for children who survive abortion procedures. #BornAliveAct https://t.co/kKfCSDEgj5","date":"Thu Feb 04 12:44:19 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[8/10] ...for this Congress hasn’t even been officially formed yet. \n \nLastly, I remind you what @chuckschumer said about reconciliation in 2017, which was that reconciliation... “is the wrong way to do the business of this country.”","date":"Wed Feb 03 22:25:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[9/10] Republicans in Congress, and the more than 74 million people who voted for #Trump and Republicans, will not stand idly by and watch @SpeakerPelosi, @chuckschumer and @POTUS make a mockery of our institutions.","date":"Wed Feb 03 22:25:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[10/10] My Republican colleagues and I will continue to call out the hypocritical way at which my Democratic colleagues govern and the double standards they want to live by.","date":"Wed Feb 03 22:25:42 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[5/10] ...Democrats' proposed $15 minimum wage) from being in a bill considered under reconciliation. \n \nBut, unlike you and I, Rules don’t matter to the far-left Democrats in Washington, and they have already indicated they will disregard the #ByrdRule...","date":"Wed Feb 03 22:25:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[6/10] ...so they can pass their job-killing, economy-suppressing, wage hike during a pandemic, no less. \n \nToday, @SpeakerPelosi set the stage for the greatest heist of your wallet in history, by bypassing House rules and precedent - rushing a budget bill...","date":"Wed Feb 03 22:25:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[4/10] ...the Senate is poised to ramrod the $2 Trillion package through using Reconciliation. \n \nHowever, there are rules limiting what Democrats can do using reconciliation. The #ByrdRule; established nearly 4 decades ago, prohibits “extraneous” non-budget items (like the...","date":"Wed Feb 03 22:25:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[7/10 ] ...to the floor that sets up the Senate to use Reconciliation for the stimulus package.  The process of the House is for the Budget to be developed by the Budget Committee and passed onto the floor, but the Budget Committee...","date":"Wed Feb 03 22:25:41 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/10] In the next few tweets, I’m going to lay out how Democrats are violating rules, historical precedent and the will of millions of Americans, just so they can pass legislation to fundamentally change how this country operates for decades to come.","date":"Wed Feb 03 22:25:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/10] ‘Reconciliation’ is a procedural process that allows the Senate to bypass the requisite 60 votes normally required to pass legislation. Under #reconciliation, the Senate can pass a fiscal bill, once per budget cycle, with only 51 votes.","date":"Wed Feb 03 22:25:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/10] Although the Senate is split with 50 Republicans and 50 Democrats, the Vice President, Kamala Harris, is the tie breaking vote. Just as the Democrats in the House rushed through their budget without a single hearing or Republican input...","date":"Wed Feb 03 22:25:40 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[4/4] It’s obvious that all the talk of unity was nothing but lip service, since no one but Speaker Pelosi and her lieutenants had any input in this massive spending package.","date":"Wed Feb 03 21:22:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/4] If it’s such an emergency, why hasn’t $1 trillion from Trump’s last five #COVIDrelief packages been spent? The American people aren’t as stupid has you think we are.","date":"Wed Feb 03 21:22:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/4] The House Budget Committee hasn’t even been formed yet, but Speaker Pelosi already has a budget coming to the floor this week.","date":"Wed Feb 03 21:22:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/4] Last year, @SpeakerPelosi purposely stalled the COVID relief package for 6 months to hurt #PresidentTrump politically. But now, suddenly, the Speaker Pelosi and @POTUS say its “urgent” Congress pass their $2 trillion package.","date":"Wed Feb 03 21:22:28 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Just as they helped make hand sanitizer for front line responders during the pandemic, they are helping Georgia and the rest of the country get back on their feet with this $1B investment.","date":"Wed Feb 03 16:54:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] The @AnheuserBusch brewery in Cartersville, Georgia has employed hardworking Georgian’s for almost three decades and has been an integral part of our economy.","date":"Wed Feb 03 16:54:17 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"So far, @JoeBiden has:\n \n➡️Cut thousands of blue-collar jobs\n➡️Weakened our SW border\n➡️Sent taxpayer money overseas to fund abortions\n➡️Put terrorists ahead of most Americans for the vaccine\n➡️Ignored scientific evidence that it’s safe to open schools\n \nAnd it’s only day 14…","date":"Wed Feb 03 14:44:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The state of Georgia is doing a good job handling the distribution of the COVID-19 vaccine. By already distributing over 2/3 of the vaccine doses on hand, we are outpacing the rest of the country by double digits.\n \nhttps://t.co/ClR6VC1YXK","date":"Tue Feb 02 12:18:23 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing #GameStop and the first days of the #BidenAdministration on @Newsmax with @stinchfield1776 https://t.co/DeplIJTuAC","date":"Mon Feb 01 12:35:29 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I am proudly a #ProLife advocate. Protecting the sanctity of human life is something we should all be able to unite around.","date":"Fri Jan 29 16:32:34 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Joined forces with my colleague @RepBlaine to prevent abortion providers from profiting from abortions. https://t.co/HP8j2Mkd0q","date":"Fri Jan 29 12:30:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@CNN has removed coronavirus statistics from its screens, probably because Joe Biden is in the #WhiteHouse. Nice to see they are back to covering ‘breaking news.’ https://t.co/KyJXgRZF19","date":"Thu Jan 28 21:45:51 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] President Biden is setting records and breaking promises: \n\n✅ Biden has signed more executive orders in his first week (22) than any other president in history (on pace to sign more than 4,500 EOs in four years).","date":"Thu Jan 28 15:24:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] ✅ Biden is not working with Congress in a bipartisan way as he claimed. \n\n✅ Biden’s EOs have already killed more than 11,000 jobs.\n\n ✅ Biden is not working to unify the country.","date":"Thu Jan 28 15:24:46 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The men and women at the #GeorgiaNationalGuard dropped everything to help protect our nation’s Capital. On behalf of Ga-11, thank you all for your service to our state and nation. https://t.co/NSsKOlvtJ5","date":"Thu Jan 28 12:58:52 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] ...walking the grounds of Auschwitz-Birkenau Concentration Camp in Poland. \n\nAs Americans, we must rededicate ourselves to the truth that all men are created equal; and, while we may disagree, we should do so with respect and civility.","date":"Wed Jan 27 16:53:48 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] On this International Holocaust Remembrance Day, we remember the over 6 million innocent lives taken by indescribable hatred and prejudice. \n\nIn 2018, I spent a sobering few days with Holocaust survivor, Edward Mosberg, including time... https://t.co/gmIW5f5ebd","date":"Wed Jan 27 16:53:47 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s pro-business, pro-growth policies are a big reason why the aerospace industry is flying-high in Georgia. This industry employs over 100,000 hardworking Georgians, and is the state’s top export.\n \nhttps://t.co/cDXxdqJrMh","date":"Wed Jan 27 12:16:22 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s economy in December:\n \n✅ Unemployment rate: 5.6% (U.S. 6.7%)\n✅Jobs added: 44,700 (U.S. lost 140,000 jobs)\n \nGeorgia’s economy is still progressing. Other states need to trust their citizens - like Georgia does - and reopen, so we can continue to improve our economy.","date":"Tue Jan 26 12:28:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As unionists stormed the Wisconsin State Capitol in 2011, Nancy Pelosi praised their efforts as “an impressive show of democracy in action.” \n\n#DCdoublestandard \n\nhttps://t.co/SDdvGD1rUq","date":"Mon Jan 25 21:39:36 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Our election was hijacked. There is no question. Congress has a duty to #ProtectOurDemocracy &amp; #FollowTheFacts,” per Nancy Pelosi May 2017.","date":"Mon Jan 25 20:44:15 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We are in the middle of a pandemic, and even though Biden promised blue collar workers he wouldn’t kill energy jobs, he’s eliminated 11,000+ jobs and an estimated $3.4 billion in GDP by cancelling the #KeystoneXLP. On top of that, gas is already up 14% since election day.","date":"Fri Jan 22 20:09:13 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I remember watching #HankAaron hit his 714th home run - tying Babe Ruth for the most home runs in MLB history. May this American icon Rest In Peace.\n\nhttps://t.co/pNmzklLAb9","date":"Fri Jan 22 17:26:26 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Riots, violence and destruction of property was wrong in 2020, wrong on Jan. 6, 2021, and is wrong now. Just as I have done before, I condemn these acts of violence and call on the Biden Administration and Leaders in the House and Senate to do the same.\n\nhttps://t.co/Ad7PisMlo0","date":"Thu Jan 21 18:13:24 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[3/3] I congratulate Joe Biden, the 46th President, and encourage him and his Administration to work with me and my colleagues in Congress to ensure the rights of all Americans are equally protected.","date":"Wed Jan 20 18:24:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/3] Now we must continue to build on these accomplishments, with an increased focus on preserving the liberties which God has endowed to us.","date":"Wed Jan 20 18:24:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/3] Thank you, President Trump, for four years of putting America first. We achieved unprecedented economic prosperity, historic advances in foreign relations, and made America strong once again. https://t.co/3Gst2UldgJ","date":"Wed Jan 20 18:24:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"\"Darkness cannot drive out darkness, only light can do that. Hate cannot drive out hate, only love can do that.\" \n\n- Rev. Dr. Martin Luther King Jr. https://t.co/dYMYDinZoM","date":"Mon Jan 18 12:30:07 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #PaycheckProtectionProgram reopened this week. Click on my Business Brief below to find out how and when your company can apply for financial relief.\n\nhttps://t.co/McvHcuL7zO","date":"Fri Jan 15 15:33:55 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/RgSolxwbWw","date":"Wed Jan 13 20:08:02 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] I made sure to thank as many as I could as I made my way through the Capitol complex last night.","date":"Thu Jan 07 21:16:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Even though Saturday is technically #NationalLawEnforcementAppreciationDay, we appreciate our men and women in uniform year-round. These are just a few of the brave officers who worked tirelessly for hours yesterday protecting and defending all of us. https://t.co/ePfAlRp6pU","date":"Thu Jan 07 21:16:43 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Violence against our brave law enforcement is not in line with our values as freedom loving Americans. I strongly support our rights to peacefully protest, but strongly condemn any acts of violence against our brave officers of the Capitol Police or others.","date":"Wed Jan 06 19:20:58 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to my friend and colleague @RepDevinNunes on receiving the Presidential Medal of Freedom. Your steadfast efforts in thwarting the Obama DOJ and FBI from illegally taking down a sitting U.S. President will not be forgotten.","date":"Tue Jan 05 14:27:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This is about the rule of law and fair elections. I do not have full confidence that the Georgia electors truly represent the voters of Georgia. https://t.co/kWNecCWVHb","date":"Tue Jan 05 00:55:47 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Not only is @SpeakerPelosi censoring what can be said in the House, she is striking down the #MotionToRecommit, which gives Republican’s a right to offer amendments and debate them on the House floor.","date":"Mon Jan 04 20:13:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] The House Democrats want to suppress any opinion in opposition to their own extreme ideologies. Where’s your outrage, @ACLU?","date":"Mon Jan 04 20:13:31 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Last Congress, House Democrats attempted to remove ‘so help me God’ when administering oaths. Now they want to remove gender terms, like ‘founding fathers’ or references to ‘mothers’ from the House rules, in the 117th Congress.","date":"Mon Jan 04 19:03:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] Not only have we lost all common sense; but, no nation that has censored its citizens’ freedom of speech has truly remained free.","date":"Mon Jan 04 19:03:11 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Swearing-in ceremony for the 117th Congress. \n\nWearing a special lapel pin in memory of Congressman-elect Luke Letlow of Louisiana who passed away last week before he could be sworn in. https://t.co/OQ08vuP6xK","date":"Mon Jan 04 00:16:35 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/poQsRVwZxe","date":"Fri Jan 01 05:00:47 +0000 2021","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s great to see the #BUILDact on its way to the president’s desk to be signed. \n\nhttps://t.co/xidyG2HdQZ","date":"Thu Dec 31 15:40:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/KPArW1iLBN","date":"Tue Dec 29 00:38:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I included the message below last week in my weekly newsletter. If you'd like to sign up to recieve my newsletter, please visit: https://t.co/zeKytaViPD https://t.co/Zc2VDyH7o8","date":"Mon Dec 28 12:36:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/UBm8BKBUb0","date":"Thu Dec 24 23:38:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If you are a business in need of #PayCheckProtectionProgram funding, click the link below to learn more about the new round of COVID relief for businesses.   \n \nhttps://t.co/sk3GGFf25k","date":"Thu Dec 24 13:18:51 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Georgia Department of Health has put out a detailed plan on the vaccine rollout plan in Georgia. Click the link below for more information. \n \nhttps://t.co/ggnpe516Vv","date":"Wed Dec 23 18:49:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"VETERANS: The U.S. Department of Veteran Affairs has put out details on the rollout of the COVID-19 vaccine. Plans for distribution begin on page 41. Click the link below for more information.\n \nhttps://t.co/pvg7enYnTv","date":"Wed Dec 23 15:00:33 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Americans are more responsible at investing their money than the fed govt is. That’s why 3 years ago I worked hard on passing the historic #TaxCutsandJobsAct. This bill allowed people the ability to invest their money where they needed strengthening our economy like never before. https://t.co/vaWKnnF93d","date":"Mon Dec 21 12:13:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@JoeBiden said he was going to listen to the experts and follow the science??\n\nKeeping schools closed another 100 days isn’t doing either. Science and the health experts agree: schools should be Open. \n\nhttps://t.co/QCeKiDzzm5","date":"Fri Dec 18 11:28:02 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #WrightBrothers first flight serves as an inspiration for what may be achieved when Americans have an unwavering attitude toward success. #WrightBrothersDay https://t.co/3ofNaqbH2z","date":"Thu Dec 17 12:30:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[2/2] which is why @SpeakerPelosi needs to agree to a simple COVID relief deal now. \n \nhttps://t.co/iLNPCVqds7","date":"Wed Dec 16 12:40:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"[1/2] Behind every restaurant is a family desperately trying to make a living in these uncertain times, like everyone else. Unfortunately, some governors are preventing these families from putting food on their tables...","date":"Wed Dec 16 12:40:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Bill of Rights added the protections of our God-given rights to the U.S. Constitution - one of the greatest documents ever written. #BillofRightsDay https://t.co/EJtxua1vaz","date":"Tue Dec 15 15:27:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Now that the U.S. has its first COVID-19 vaccine,  #OperationWarpSpeed shifts to shipment and distribution, which may be one of the largest logistical operations in American history.\n \nhttps://t.co/74VLFP4Axc","date":"Mon Dec 14 12:20:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"While holding full-time civilian jobs, the men and women of the National Guard are ready at a moment’s notice to drop everything and ‘go’ to defend our nation and our freedom. Thank you @USNationalGuard for 384 years of service. #Alwaysready #GaNationalGuard https://t.co/oyOtWiz8cz","date":"Sun Dec 13 12:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Click here to read Texas vs. Pennsylvania amicus brief: https://t.co/1DwavMeJVq https://t.co/leVOTYf2sa","date":"Fri Dec 11 20:32:01 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This is an interesting study out of Brown University on reopening schools and the minimal risk our young children tend to have of contracting COVID.  \n\nhttps://t.co/RRtBAHdK8a","date":"Fri Dec 11 12:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pelosi blocking a comprehensive COVID relief package for purely political reasons has been widely reported. But what has not been are the 40 times Dems have blocked a Repub bill that would unlock  $130B+ in #PPP relief that many small businesses need to stay afloat. #HR8265","date":"Thu Dec 10 12:30:12 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We still have a long way to go, but since the height of the pandemic, our economy has added back 12.3 million jobs and the unemployment rate has dropped by eight percent. #NovemberJobsReport https://t.co/XlPSWUESk3","date":"Wed Dec 09 12:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Preventing illegal or invalid votes in the upcoming Georgia Senate runoff elections, and the numerous allegations of voter fraud, are issues AG Barr and @TheJusticeDept should be investigating. Thank you @RepMoBrooks for leading this timely letter. \n \nhttps://t.co/6EdtB0hwMB","date":"Tue Dec 08 14:49:42 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My interview with @JohnFBachman on @Newsmax. https://t.co/QnboxTUGwb","date":"Mon Dec 07 17:51:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“No matter how long it may take us to overcome this premeditated invasion, the American people in their righteous might will win through to absolute victory.” – Franklin D. Roosevelt Dec. 8, 1941 #PearlHarbor https://t.co/Y1LhvRtq2U","date":"Mon Dec 07 15:01:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s a shame someone would risk the lives and livelihoods of millions for political purposes. Pelosi has admitted to doing just that, as she has admitted to purposefully denying Americans critical COVID relief. And to make matters worse, she said she was proud of her decision.","date":"Fri Dec 04 20:41:02 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“We will not go quietly into the night. We will not vanish without a fight. We’re going to live on. We’re going to survive.” Today, liberal governors are reminded that the United States Constitution is the law of the land and that religious freedom is an inalienable right!","date":"Thu Dec 03 19:21:41 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A #MotiontoRecommit #MTR allows the minority a last chance to stop or amend a bill before its final passage. Dems want to eliminate this longstanding procedure. It’s evident they are afraid of losing control with what will be the thinnest majority since WWII.","date":"Thu Dec 03 17:05:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"💥BREAKING💥The world’s preeminent military superpower just got stronger with the addition of a new squadron of @LockheedMartin’s C-130J Super Hercules aircraft for the @GeorgiaGuard. Every C-130J is manufactured in #GA11, which employs close to 5,000 hardworking Georgians. 🇺🇸","date":"Wed Dec 02 14:52:54 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s not too late to do signature verifications in GA. By matching the name and sig on the envelope to the name and sig on the absentee ballot app and original voter reg, as @DavidShafer described, would prove to be an excellent way to determine the amount of fraudulent ballots.","date":"Tue Dec 01 21:50:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"➡️Thousands of BUSINESSES have  permanently closed\n\n➡️STATES need help with unemployment\n\n➡️The government will shut down Dec 12 without a BUDGET bill\n\nWHAT is Speaker PELOSI’s ANSWER?? \n\n✅Let’s vote on a bill to LEGALIZE POT!","date":"Tue Dec 01 17:25:16 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussed Georgia’s ongoing election litigation, the Senate runoff, and my bill, the #THRIVEact with Chris Salcedo on @Newsmax TV. https://t.co/r7BcILLXpH","date":"Tue Dec 01 17:22:57 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A forensic analysis of the Dominion voting machines needs to be performed. \n\nJudge rules that Cobb, Gwinnett, and Cherokee County election officials are prohibited from erasing or destroying any of these voting machines. \n\nhttps://t.co/FMxkOhBGRR","date":"Mon Nov 30 15:57:28 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Black Friday saw the second largest online spending day in U.S. history! Couple that with Cyber Monday, which economists are predicting to be record breaking, I’d say America is coming back strong.","date":"Mon Nov 30 15:29:47 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Families are essential to the success of our men and women serving in our armed forces. I know I would not have been able serve God and country without my loved ones supporting me at home. Thank you, #MilitaryFamilies, for all you do! https://t.co/s4lrY4Nrm2","date":"Fri Nov 27 14:15:51 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"President George Washington’s Thanksgiving Proclamation of 1789 https://t.co/zAiWHT8dVV","date":"Thu Nov 26 14:13:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I was recently interviewed on @Newsmax by @stinchfield1776 where we discussed the voting irregularities in Georgia and the upcoming Senate runoff. https://t.co/JK0bG01nEl","date":"Wed Nov 25 15:47:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I challenge Nancy Pelosi and my Dem colleagues to work for the American people. They need our help, especially small businesses, who could really use the funds still left in #PPP. It’s time to stop playing politics with the pandemic and come to the negotiating table. #LetsWork","date":"Wed Nov 25 12:18:34 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My bill would help bring the executive branch back toward what our nation’s Founders outlined in the Constitution by expanding the scope of the CRA to include regulatory guidance. Thank you @IWV and @AFPhq for supporting this bill. #THRIVEact\n \nhttps://t.co/lURL5OPsf4","date":"Tue Nov 24 12:34:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"My interview on @TheBlaze with @GlennBeck regarding the Georgia Election. https://t.co/KKNKCFj1PO","date":"Mon Nov 23 13:03:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The pic at the bottom was at a Biden ‘rally’ and the top one was at his ‘victory’ speech. What happened to the pandemic after the election?? Plz keep this, and the news of CA’s gov attending a dinner party, and CA lawmakers flying to Hawaii in mind when you hear of new lockdowns. https://t.co/b794ghz0G8","date":"Fri Nov 20 17:02:54 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to see GA-11 companies like Rubicon Technical Services, LLC, Southern Company and Bradley-Morris Holdings, LLC, who were recently awarded the #HIREVetsMedallion, signifying their commitment to recruiting and employing our nation’s veterans.\n \nhttps://t.co/QXlXSa4GhU","date":"Fri Nov 20 12:36:49 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"America’s national security has always been a top priority for Republicans, which why we have addressed this important issue in the Commitment to American Security Act. Guarding our borders and protecting Americans will always be critical to maintaining the freedoms we cherish. https://t.co/Px9ASMA9ui","date":"Thu Nov 19 12:30:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A bill to fund the government for the coming year and more coronavirus relief are among the many items Congress is negotiating. I can’t speak for my Democrat colleagues, but Republicans are in D.C. and ready to work. #LetsWork https://t.co/N7XL2z05MN","date":"Wed Nov 18 13:38:44 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you!","date":"Wed Nov 18 00:26:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"So, it’s ok to protest, loot, burn and hold ‘victory’ speeches - all of which break gov. mandates, but we can’t honor our fallen heroes at Arlington and the Soldiers’ and Airman’s Home Nat’l cemeteries by laying wreaths at their headstones? Something is wrong with this picture!","date":"Tue Nov 17 16:37:06 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to see a second company announce a possible COVID vaccine under President Trump’s watch. Both companies have worked with the Administration’s #OperationWarpSpeed, with a goal to produce and deliver 300 million doses of safe and effective vaccine by January 2021.","date":"Tue Nov 17 12:30:27 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is part of my interview on @SiriusXMPatriot radio where we discussed voting issues in Georgia. https://t.co/IwnFjiMSQg","date":"Mon Nov 16 12:25:05 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"For the eighth consecutive year, Georgia is ranked #1 in the country for its business climate. Read the article below to see why Georgia is the greatest state to do business. \n\nhttps://t.co/daWoMiTDXL","date":"Thu Nov 12 18:58:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you, veterans, for preserving our freedoms! On this day, and every day, we salute you. #VeteransDay https://t.co/yH1KmIg79K","date":"Wed Nov 11 12:14:24 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I am pleased to see AG Barr announce the @TheJusticeDept is investigating the numerous documented irregularities we’ve heard of since Election Day. Every legal vote should be counted, and fraudulent votes should be discarded.\n\nhttps://t.co/YDEhlbQupw","date":"Tue Nov 10 21:43:15 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all those who have served in the U.S. Marine Corps! Semper Fi. #USMC https://t.co/shBitnwyiw","date":"Tue Nov 10 12:53:20 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Election 2020 Recap https://t.co/tsRoGiX7dy","date":"Mon Nov 09 12:22:57 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@realDonaldTrump and conservative policies are working to help get Americans back on their feet. #OctoberJobsReport\n\nhttps://t.co/h46lGcqNx3","date":"Fri Nov 06 16:06:24 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A great video highlighting Justice Amy Coney Barrett’s swearing-in. Thank you @realDonaldTrump for three outstanding lifelong appointments! \n \nhttps://t.co/zklHxOp3Pu","date":"Fri Nov 06 12:22:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The integrity of every vote in Georgia is a number one priority. I am actively working with state and local officials to ensure every vote is accounted for and counted accurately.","date":"Thu Nov 05 16:55:55 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A $150 million investment in a GA-11 based company cannot be understated. Thank you, @AnheuserBusch!\n \nhttps://t.co/32rHBbSNjA","date":"Thu Nov 05 12:32:37 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you, GA-11, for allowing me the opportunity to represent you in Congress for another two years. It is truly my honor.","date":"Wed Nov 04 04:02:41 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"When it comes to the economy, President Trump and Republicans have:\n \n✅ Created a strong economy\n✅ Achieved record low unemployment\n✅ Passed tax cuts for Americans\n \n…and we are ready to do it AGAIN!","date":"Tue Nov 03 14:59:12 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is a great Myth vs Fact video on #OperationWarpSpeed, which features members of the House of Representatives’ Doctors Caucus. https://t.co/wmmSzH3ZPP","date":"Mon Nov 02 12:23:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"GDP growing by 33.1% in the third quarter (highest ever) shows the American people are working hard to provide for their families, keep their businesses running - and we are rounding the corner. \n\nhttps://t.co/WbKg2IpCH3","date":"Thu Oct 29 14:04:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Some of my colleagues and I are urging Rep. Waters and Rep. Schiff to investigate possible money laundering by the Biden's. After all, they investigated the Trump family's financial dealings under the guise of ‘studying Bank Secrecy Act and anti-money laundering regulations.' https://t.co/mhKKFFQO6b","date":"Thu Oct 29 11:30:12 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Many of our small banks and credit unions are to be thanked for saving thousands of small businesses and millions of jobs, because they processed loans and dispersed funds from the successful #PaycheckProtectionProgram to those hardest hit by COVID-19. [1/2]","date":"Wed Oct 28 16:30:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m working hard to pass my bill to help those that have assisted with this emergency program, so they are protected from additional regulations. [2/2]\n \nhttps://t.co/9ANkW31uIq","date":"Wed Oct 28 16:30:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"October is #DownSyndrome Awareness month, but every day we can celebrate the amazing Abilities of those affected by Down Syndrome. https://t.co/6xV5QdsuI9","date":"Wed Oct 28 11:23:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Religious persecution has been present throughout history, and was one of the prevalent factors that led our founders to declare independence from England. [2/3]","date":"Tue Oct 27 14:56:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we commemorate the 22nd anniversary of the 1998 International Religious Freedom Act (IRF), which made promoting and defending international religious freedom a specific focus of U.S. foreign policy. [1/3]","date":"Tue Oct 27 14:56:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It is naïve to think that it could never reappear in America, which is why it’s imperative that the United States continue to acknowledge the importance of our religious freedom. #InternationalReligiousFreedomDay [3/3]","date":"Tue Oct 27 14:56:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Confirmed. https://t.co/UvQvVSDUOP","date":"Tue Oct 27 00:11:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing coronavirus and stimulus negotiations on Fox Business. https://t.co/IvxPO36cM8","date":"Mon Oct 26 11:30:26 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Overall, sales are higher (up 4.6% since February) than they were before the virus… additional signs of a V-shaped economic recovery in the U.S. https://t.co/KXoZZ9WGM6","date":"Fri Oct 23 11:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Senate Judiciary Committee is scheduled to vote on Judge Amy Coney Barrett’s nomination this afternoon; and a vote in the full Senate is scheduled for October 26. https://t.co/JKhbeXOlmq","date":"Thu Oct 22 11:29:32 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to see AG Barr and the Justice Department address the problem that is #BigTech.","date":"Wed Oct 21 13:29:56 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Hoover Institution compared Republican policies to Dem policies, and the results were striking. By 2030, the policies proposed by Dems would result in 4.9 million fewer jobs, $2.6 trillion less in GDP, and $6,500 less in median household income. \n\nhttps://t.co/TCYb1ZewZC","date":"Wed Oct 21 11:30:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I find it strange that #SpeakerPelosi would use a term like ‘imperative’ to describe the need for a new president, but not use such a term when discussing additional #coronavirus relief for Americans. https://t.co/ZYja9O2aH0","date":"Tue Oct 20 14:34:28 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Medicare recipients: Open enrollment has begun for 2021. Now until December 7, 2020, you can review health and drug plans, and make changes to your healthcare coverage. See press release below for more information. https://t.co/ShVF094G0u","date":"Tue Oct 20 11:30:20 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing the #SCOTUS nominee. https://t.co/QgiLlS7y8j","date":"Mon Oct 19 11:27:12 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"We must all help to raise awareness for the 1 in 8 women in the U.S. diagnosed with #breastcancer. Hoping one day we will beat this deadly disease. https://t.co/5TwBa2FWo5","date":"Fri Oct 16 11:26:57 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Every day that Speaker Pelosi stonewalls good faith negotiations, that’s one more day the $300 billion that’s still left in the CARES package doesn’t make it to Americans in need.","date":"Thu Oct 15 14:58:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Below is a letter I sent to the IRS Commissioner and the Director of the National Personnel Records Center urging them to go back to work helping the millions of Americans and veterans who need help. @RepDrewFerguson @AustinScottGA08 @RepRickAllen https://t.co/qqEkcjj5fK","date":"Thu Oct 15 11:24:41 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Fact: Twitter and FB blocked a #NewYorkPost article about Hunter/Joe Biden’s corrupt dealings with Ukrainian exec\n\nFact: Twitter and FB willfully allowed millions of users to circulate fictional, DNC funded, Steele Dossier\n\nFact: Twitter and FB are meddling in the #2020election","date":"Thu Oct 15 00:17:34 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As we approach the holiday season, the CDC has provided some travel reminders to help keep you and your loved ones safe.\n\nhttps://t.co/UYNc9Lk4Jl","date":"Wed Oct 14 11:28:16 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Judge Amy Coney Barrett is not a political activist, and she is not going to engage in the ‘gotcha’ questions the Democrats are trying to rope her into. Her knowledge of the law is unquestionable, and it’s evident she will serve the American people with honor on the #SCOTUS.","date":"Tue Oct 13 15:06:00 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Happy Birthday #USNavy! Thank You for 245 years of service. https://t.co/Iy9KEMg9sN","date":"Tue Oct 13 11:22:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/mLgKkYtMUh","date":"Mon Oct 12 11:25:17 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"America is all about the freedom to choose what’s best for you and your family. That’s why my colleagues and I are committed to delivering more healthcare choices, and better care at lower costs to the American people. #AmericaFirstHealthCarePlan https://t.co/YQXeIf5V0r","date":"Thu Oct 08 11:24:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“On Made in America Week, we commend the hardworking men and women in American manufacturing, and recommit ourselves to strengthening and rebuilding the greatest economy in our Nation’s history for a second time.” 🇺🇸 \n\nhttps://t.co/ACzykinoOx","date":"Wed Oct 07 16:07:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"In the last five months, 11.4 million jobs have been added to our economy, and unemployment is down to 7.9%. We still have a long way to go, but our nation’s economy is recovering faster than expected! https://t.co/pjdd7P567j","date":"Wed Oct 07 11:30:37 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/96ABaQd9Is","date":"Mon Oct 05 12:22:26 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"By trusting in people taking responsibility for themselves, not in government mandates, Georgia’s economy is going up and COVID-19 cases are going down. Thank you for your leadership, @GovKemp.","date":"Thu Oct 01 11:34:43 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Restoring our deteriorating infrastructure, rebuilding our historic economy, and renewing the vision our Founders had for this great country is our commitment to America. https://t.co/Z0ZEM9dE9x","date":"Wed Sep 30 13:08:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A reminder as to what House Dems’ actual priorities are...in their newest stimulus package, the word ‘jobs’ appears 7 times, and the word ‘cannabis’ appears 68 times.","date":"Tue Sep 29 17:18:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Suicide is a serious problem in the veteran community and so I’m thankful for the men and women at Shepherd’s Men, Shepherd Center of Atlanta, and SHARE Military Initiative for their tremendous work in helping our veterans fight this deadly problem. #SHAREtheburden https://t.co/9rBDEPRfuu","date":"Tue Sep 29 11:27:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Before @realDonaldTrump nominated Judge Amy Coney Barrett to the SCOTUS, I provided some of my thoughts about the vacancy in my Weekly Newsletter that went out on Friday. Click to listen! https://t.co/k7E2hhs44d","date":"Mon Sep 28 11:26:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The amount of Personal Protective Equipment (PPE) was a question in a lot of our minds, but thanks to @GovKemp’s leadership, our state is continuing to lead in safely reopening for business.","date":"Fri Sep 25 11:35:23 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Want to know more about #OperationWarpSpeed? Watch the video below as representatives from the House of Representatives, who are part of the Doctor’s caucus, explain this historic program that aims to protect the American people from COVID-19. https://t.co/erUbUEP8fn","date":"Thu Sep 24 13:19:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s always a pleasure to speak with the folks at the Georgia Chamber. We thank you for your hard work and commitment to our great state!","date":"Wed Sep 23 11:50:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"With 93% of businesses in Georgia being small businesses, it’s easy to see that they are the backbone of the American economy. Thank you for all that you do! #SmallBusinessWeek https://t.co/KvwL3qcVWj","date":"Tue Sep 22 16:20:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Republican's Commitment to America: Restore, Rebuild, and Renew https://t.co/dqy8WCrZQ6","date":"Mon Sep 21 11:43:27 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Ruth Bader Ginsburg’s life of service to her fellow Americans, and her dedication to justice will be remembered. We offer our prayers and condolences to the Ginsburg family.\n\nhttps://t.co/BPEXlzyoxk","date":"Sat Sep 19 00:20:34 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/9KZVd4hu8R","date":"Fri Sep 18 11:30:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today we celebrate one of the most significant documents ever written – the Constitution of the United States. #ConstitutionDay https://t.co/5rf2AlWuZj","date":"Thu Sep 17 11:30:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s interesting the Democrats are taking time this week to pass a resolution condemning their own actions.","date":"Wed Sep 16 18:36:49 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia’s tax revenues continue to increase, even with our current challenges. A 7.7% increase from this time last year shows @GovKemp's free market, pro-business, pro-individual policies are working.\n\nhttps://t.co/ttjdcsBm3F","date":"Wed Sep 16 11:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Israel, United Arab Emirates and Bahrain. @realDonaldTrump’s leadership on the world stage is something every American can be proud of. #AbrahamAccords","date":"Tue Sep 15 16:53:45 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This President has been tough on China, exerted ‘maximum pressure’ on Iran, killed some of the world’s deadliest terrorists, negotiated the historic USMCA, and now presides over one of the most important peace agreements in a generation: the normalization of relations between...","date":"Tue Sep 15 16:53:44 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Veterans: The Atlanta VBA Regional Office will hold a Virtual Townhall meeting tomorrow, Wednesday, September 16. They will share important information and answer questions. Click on the flyer for more. https://t.co/rAKaVeejWi","date":"Tue Sep 15 11:26:35 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/5x3WERyJD2 https://t.co/w9wVmP2hHG","date":"Mon Sep 14 11:22:55 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On the anniversary of 9/11, let us remember the thousands of lives that were lost, and the first responders who run into danger every day to help keep us safe. #91101 #neverforget https://t.co/7cu6hZVqzs","date":"Fri Sep 11 11:38:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to see Georgia charging forward with economic projects that better our communities and provide jobs for hardworking Georgians, and, again being named the top state for business - for the 7th year in a row.","date":"Thu Sep 10 18:55:02 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"National Suicide Prevention Lifeline: 1-800-273-8255. You are not alone. #SuicidePreventionDay https://t.co/cArCoNtvwf","date":"Thu Sep 10 11:21:45 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Veterans: the @DeptVetAffairs recently announced they have launched a new Virtual Assistant (e-VA) to provide answers to your questions, appointment reminders, and much more. Click below for more information.\n \nhttps://t.co/F90erzd8aM","date":"Wed Sep 09 12:59:53 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/uAiVHwwoCC https://t.co/EpCcyPwvlz","date":"Tue Sep 08 11:47:52 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/pX2gLlib3e","date":"Fri Sep 04 13:35:23 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s a good time to get outside and enjoy some of the amazing wildlife around our great state! #NationalWildlifeDay https://t.co/wVaVfrY56X","date":"Fri Sep 04 11:30:31 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thankful to have Attorney General Barr at the helm of law enforcement in this country. While some governors and mayors stand on the sidelines and let lawbreakers run free, this administration is working hard to protect all Americans. #OperationLegend \n\nhttps://t.co/3TOdHisr85","date":"Thu Sep 03 11:30:30 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our military is strong and resilient – the best in the world. I’m proud that Georgia’s 11th Congressional District plays a key role by assembling parts of this amazing military aircraft, the F-35. https://t.co/vMnYtSQcR4","date":"Wed Sep 02 11:30:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Small businesses are the backbone of our economy and Ga-11 is an excellent example. Take a look at this graphic released by the @SBAgov; almost 93% of businesses in Georgia-11 are small businesses, and over 45% of those employed in our District are employed by small businesses. https://t.co/1zzKtywHRO","date":"Tue Sep 01 11:30:27 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/7AWMgZqSo0 https://t.co/cBczKaxygq","date":"Mon Aug 31 11:30:36 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m proud to work with @GOPLeader Kevin McCarthy, my Republican colleagues, and @realDonaldTrump to Renew, Restore, and Rebuild America.","date":"Thu Aug 27 15:10:09 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Please join us in praying for the people of Louisiana and Texas who are in the path of Hurricane Laura.","date":"Wed Aug 26 12:35:31 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The right to vote strikes at the core of what it means to be an American, and we must protect the integrity of our election system. Thank you @RodneyDavis for hosting this important discussion. Click below to watch the entire virtual election roundtable.\n\nhttps://t.co/Pz5OrLCDu2 https://t.co/Q3f2BFGCEz","date":"Wed Aug 26 11:29:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great visiting with the Cobb Municipal Association, which is an association that works hard to help residents in Cobb County build a brighter and better future. Thank you for inviting me! https://t.co/alTTDnprh1","date":"Tue Aug 25 11:16:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/APRxIYk9qI https://t.co/G0xPUCO5fs","date":"Mon Aug 24 11:19:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank You to @AnheuserBusch for donating hand-sanitizer to polling locations across the U.S. https://t.co/JfgpjzbTNg","date":"Fri Aug 21 11:27:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Cobb County residents can now apply for mortgage payment assistance or homeownership counseling. The Cobb Board of Commissioners approved $4.8 million – funds made available in the #CaresAct, to help those adversely affected by COVID-19.\n \nhttps://t.co/sniRVDmN32 https://t.co/FVATCDgLV7","date":"Thu Aug 20 11:22:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This day commemorates the fact that, in 1903, two bicycle mechanics were able to achieve, without government overregulation, mankind’s first flight. Only sixty-six short years later, Americans stepped onto the moon. #NationalAviationDay https://t.co/246aZLzoZc","date":"Wed Aug 19 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"THANK YOU to @SandySprings_PD for taking some time out of your busy day to discuss important issues in Georgia’s 11th Congressional District, and for the ride-along! Your passion and commitment to serving our community is inspiring. You make us proud! https://t.co/PBvA55p5bM","date":"Tue Aug 18 11:21:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/IsJa422rGK https://t.co/IhpIyDQLWi","date":"Mon Aug 17 11:37:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"This $4.1 million CARES grant from the Economic Development Administration will undoubtedly help in our efforts to restore and create more great jobs for hardworking Georgians, and get our economy back on track. \n\nhttps://t.co/vJFYMARynW","date":"Fri Aug 14 12:34:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@realDonaldTrump is to be commended for his leadership in helping broker a historic peace deal between our close ally, Israel, and the United Arab Emirates. This is a vitally important step in bringing peace to the Middle East.","date":"Thu Aug 13 19:53:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#tbt -- About this time last year, members of Congress gathered at the #VietnamMemorialWall in Washington, DC to clean the granite where many American heroes are recognized. I look forward to doing this again soon. https://t.co/IK1raa7vRh","date":"Thu Aug 13 11:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"HHS Secretary Alex Azar’s visit will further U.S. and Taiwan’s relationship, and help us better understand how to battle the deadly COVID-19 virus. \n\nhttps://t.co/7AkrVMWNxF","date":"Wed Aug 12 11:30:35 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Unemployment continues to drop, as Americans get back to work. This steady improvement in our economy shows the strength and resilience of Americans. #JulyJobsReport https://t.co/csFeLvOvi8","date":"Tue Aug 11 12:48:57 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/mjbU2Ws8ZE https://t.co/UL6mr3oDjv","date":"Mon Aug 10 11:26:54 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/5XZLfreGNt","date":"Sun Aug 09 00:37:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"To all Purple Heart recipients throughout our history, we appreciate your service and sacrifice for our freedoms! Thank you. #PurpleHeartDay https://t.co/djbYO08VHr","date":"Fri Aug 07 15:58:52 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Proud to join forces with my colleague, @RepKenBuck, in reaffirming our support for our men and women in blue, who place their lives on the line every day to protect our freedoms. #BacktheBlue https://t.co/JGnth0aO8t","date":"Fri Aug 07 11:19:31 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@WSJ reported that 36 of the 50 largest cities in the United States have seen double-digit increases in homicides. We must better-fund and work with the police if we are going to fix the problems we have in this nation. https://t.co/tnqp3U2xRL","date":"Thu Aug 06 11:25:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@NASA’s successful mission of sending American’s to and from space, once again proves, we have the ambition and ingenuity to overcome any obstacle in our way. #AmericaStrong","date":"Wed Aug 05 11:31:05 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Widespread mail-in ballots will result in #ballotfraud. We must safeguard the integrity of our election system. https://t.co/Dpcm9LAQQt","date":"Tue Aug 04 11:24:24 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/UdfJbucUAO https://t.co/Yr4vM6AbTj","date":"Mon Aug 03 11:22:50 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It’s unfortunate the Pelosi-led Rules Committee blocked a vote on my colleague @RepAnnWagner's amendment, which would have prohibited federal money from being sent to abortion clinics that do not protect a child that survives an abortion. #FY2021LaborHHSappropriations https://t.co/Vbijzccgeu","date":"Fri Jul 31 14:13:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"So there is no evidence of #voterfraud or ballot harvesting?\n\nhttps://t.co/6JGBvbxvpv","date":"Thu Jul 30 22:41:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/EXCYPGFdAB","date":"Thu Jul 30 14:01:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/tdAP3tXFHY","date":"Thu Jul 30 11:05:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank You to our:\n\n• Dr.’s/Nurses\n• 1st Responders\n• National Guard\n• Postal Workers\n• Truck Drivers\n• Grocery Employees\n• And all those working to keep our communities going\n\nWe are praying for you and continue to work to ensure you have all you need to do your jobs.","date":"Wed Jul 29 21:07:06 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I’m optimistic about our future bc we have individuals like AG #Barr serving our country. His calm, collected demeanor during today’s House hearing, serves as a reminder, he loves this country and is committed to enforcing the rule of law evenly and objectively across the board.","date":"Tue Jul 28 21:10:16 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/OM9rf8WhNy https://t.co/jKfQvYWGPJ","date":"Mon Jul 27 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/tozH2bFv6i https://t.co/MuTvEQlsfi","date":"Mon Jul 20 11:30:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Georgia has lost a civil rights icon and a lifelong freedom fighter. Representative #JohnLewis, dedicated his life to public service; and while he will be missed here on earth, his legacy will live on. \n\nhttps://t.co/EAuZ0oikkI","date":"Sat Jul 18 11:46:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our public schools exist to meet the needs of students. Schools should open, and let the parents decide whether it’s best and safest for their children to do in-class, virtual, a hybrid, or choose another route altogether. We have the technology and innovation to make this work. https://t.co/Z6vghGmX1w","date":"Fri Jul 17 11:30:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Demonizing the #police will only result in our communities becoming less safe. It’s time we come together if we are serious about fixing the policing issues we have in this country. #InItTogether \n\nhttps://t.co/eqq24ERuIr","date":"Thu Jul 16 11:26:43 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great to travel with President Trump today as he made an important announcement on our infrastructure at UPS in Atlanta. https://t.co/tvYyi5wluC","date":"Wed Jul 15 20:28:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Great ruling from #SCOTUS for #LittleSistersofthePoor \n\nhttps://t.co/L6BVWIUZKL","date":"Wed Jul 15 11:39:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Reminder: Tomorrow is the deadline to file your 2019 Georgia and federal tax returns.\nhttps://t.co/OXE5FqIMtC","date":"Tue Jul 14 12:08:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/blMqCrKGHk https://t.co/Z588gYkbiw","date":"Mon Jul 13 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What better way to social distance than to go visit one of our national parks. Happy #NationalParksMonth! Make sure to check https://t.co/XcyAIW3fWT for COVID related updates on specific parks. https://t.co/fOQ493Ecfj","date":"Fri Jul 10 11:30:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The #PPP still has funds available to help our small businesses and secure jobs for American workers. The new deadline for small businesses to apply is August 8, 2020. \n\nhttps://t.co/uOzMzveHc0","date":"Thu Jul 09 11:24:55 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Still a lot of work to be done, but the #JuneJobsReport was promising news, as we battle COVID-19. #InItTogether https://t.co/Rm9mXkOKdI","date":"Wed Jul 08 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The historical #USMCA trade deal took effect on July 1. https://t.co/OCSwZVG0Is","date":"Tue Jul 07 11:30:07 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/LPQXL1Pq5G https://t.co/vc5CoI70Ls","date":"Mon Jul 06 11:30:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"I was happy to join my colleague, @repkevinhern, in thanking AG Barr for investigating ANTIFA’s destructive activities in our nation. This terrorist group cannot be allowed to operate freely, and needs to be held accountable for their actions. \n\nhttps://t.co/pfs9Osp3Gt","date":"Fri Jul 03 11:30:45 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“The June total is easily the largest single-month gain in U.S. history.” - CNBC \n\nhttps://t.co/4189yNElhK","date":"Thu Jul 02 13:27:19 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Remembering our history, the good and the bad, is essential to “a more perfect union.” https://t.co/FSSF5hQqsy","date":"Wed Jul 01 15:43:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Amazing that the liberal politicians in Seattle even have a police force to call on to clear #CHOP, after they were demonized and sidelined. Further evidence to suggest that most of our police are selfless individuals who place their lives on the line every day for us.","date":"Wed Jul 01 15:23:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all law enforcement who are protecting our nation’s monuments and memorials. Preserving our national heritage is crucial, not only to celebrate our successes, but to ensure we do not repeat our failures.\n\nhttps://t.co/NWXBUol3lT","date":"Wed Jul 01 13:49:32 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“The surge in retail sales last month recouped 63% of March and April’s decreases.” – Reuters #GetAmericaBackToWork\n\nhttps://t.co/FWRtdrWciD","date":"Wed Jul 01 11:21:57 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"ICYMI: Here is my House floor speech on the current #PoliceReform proposals being debated in Congress. \n\nhttps://t.co/01TrfHLX7s","date":"Tue Jun 30 17:17:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It was great to meet with our local police departments in Georgia’s 11th Congressional District a few days ago. These brave individuals, who put their lives on the line daily for us, are eager to address the issues we have in this country. #InItTogether #BacktheBlue https://t.co/4epjYtkO8X","date":"Tue Jun 30 11:33:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/acEbM0MPAl https://t.co/8zKnlKLkuw","date":"Mon Jun 29 11:21:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"If we expect our nation to unite, we need to work together in Congress. (speaking during debate on police reform) \nhttps://t.co/NFrzqp0LHK","date":"Sat Jun 27 14:53:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A promising jobs report for Georgia as our state continues to lead the nation in opening safely and securely. #GetAmericaBackToWork \n\nhttps://t.co/Dot05y91GR","date":"Fri Jun 26 11:30:58 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@RepKarenBass, I’m happy to go visit this memorial, but in return, I’d like you to go on a ride-along with law enforcement so you can see how our men and women in blue place their lives on the line every single day for us. Deal? https://t.co/DtJ8zN9nPm","date":"Fri Jun 26 00:57:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The statues &amp; monuments of our nation represent the struggles, achievements, victories, &amp; defeats in our ongoing quest for freedom, liberty, &amp; justice for all. The vandals illegally defacing &amp; destroying our monuments are showing their ignorance, intolerance, &amp; hatred of America.","date":"Thu Jun 25 12:35:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The latest numbers from the #PaycheckProtectionProgram. With 2.5 million jobs added to the economy in May, and unemployment dropping, Americans are #GettingBackToWork. https://t.co/BG7pnYmneG","date":"Thu Jun 25 11:30:41 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A hero’s welcome for some of America’s finest. Welcome home Airmen! #DobbinsARB https://t.co/RXQowU9hXY","date":"Wed Jun 24 11:30:43 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you @SenatorTimScott and @RepPeteStauber for leading this important reform. #JusticeAct https://t.co/Ojm9OxthtO","date":"Tue Jun 23 11:30:47 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/Ounsqogrjf https://t.co/B7y5cZNH2n","date":"Mon Jun 22 11:58:01 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/2vsXUhTViU","date":"Sun Jun 21 11:31:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Celebrate Freedom - Juneteenth https://t.co/3vCLzTSV25","date":"Fri Jun 19 13:16:37 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@PBS has put together an excellent summer learning resource for kids, parents, and teachers.\n\nhttps://t.co/vjFqKMWEgA https://t.co/ntGDX2CJAp","date":"Thu Jun 18 11:24:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"PTSD is a mental health disorder that affects many, and can be hard to understand. This is why, especially during this difficult time, I wanted to highlight the VA website to give more insight on PTSD. #PTSDawarenessMonth\n\nhttps://t.co/QCnazrD9nz","date":"Wed Jun 17 11:16:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Desiree and I are absolutely heartbroken to hear of the passing of Carol Barr, wife of @RepAndyBarr. We are holding Andy and family in our thoughts and sincerest prayers this evening.","date":"Wed Jun 17 02:43:31 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our seniors, who are among our most vulnerable, are still in need during this health crisis. Click below for info on how you can help.\n\nhttps://t.co/AbVyYfJqzX https://t.co/ZE0F5LEJWW","date":"Tue Jun 16 11:28:02 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/K6O96TKsBW https://t.co/peAkUuD0sA","date":"Mon Jun 15 11:20:25 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Happy Birthday to our beloved United States #Army. Thank you to all those who have served, both past and present. https://t.co/PMS89ti1im","date":"Sun Jun 14 14:01:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we celebrate our flag, a symbol of freedom and hope around the world. #FlagDay #America https://t.co/HULFRhFfVM","date":"Sun Jun 14 11:30:28 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Ironically, the politicians, media outlets, and actors clamoring to abolish the police will continue to want the police to protect themselves and their property. \n\nInstead of sowing division, we should stand for the rule of law, protect all of our rights, and #BackTheBlue","date":"Fri Jun 12 16:02:46 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"It was great to be a part of welcoming @DobbinsARB Airmen returning home from deployment. Thank you for your service, and welcome back home! #USA https://t.co/utqSwiO9mW","date":"Fri Jun 12 11:26:30 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Despite the challenging times we’re in, and having to celebrate separately, I am very proud of these students. They are the leaders of tomorrow, and I’m confident they will represent our district with the utmost integrity. #MilitaryServiceAcademies \n\nhttps://t.co/N64Kg7h223","date":"Thu Jun 11 11:30:54 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Fill out your Census today…it only takes a couple minutes. Article I, Section 2 of the U.S. Constitution mandates a census every 10 years, for apportionment of our U.S. representatives. Stand up and be counted in the #2020Census. https://t.co/7QnEjp2iMz","date":"Wed Jun 10 11:30:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@CNN Yes. \n\nhttps://t.co/E1IbHhxa6W","date":"Mon Jun 08 15:40:53 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/8ahJnWUiCL https://t.co/FWSu9214VE","date":"Mon Jun 08 11:28:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Today, we remember D-Day, and those who sacrificed so much in the defense of freedom seventy-six years ago.  #DDay. https://t.co/PSRrY69fmE","date":"Sat Jun 06 11:30:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Economists were predicting 8 million jobs would be lost in May and the unemployment rate would surge to 19.5%. \n\nToday, the REAL #JobsReport for May was released and showed the economy ADDED 2.5 million jobs and the unemployment DROPPED to 13.3%.","date":"Fri Jun 05 13:33:27 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Attorney General Barr just confirmed the @TheJusticeDept has evidence showing extremist groups like Antifa are instigating violence and causing destruction at #GeorgeFloyd protests. https://t.co/TpgisjQfra","date":"Thu Jun 04 17:57:33 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The world remembers this tragic time when thousands in China were senselessly persecuted and killed because they advocated for liberty and freedom. #TiananmenSquare https://t.co/EhnzdWKbnl","date":"Thu Jun 04 11:30:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Calvary Children’s Home works tirelessly to ensure children in need have a safe, loving home, and donations of necessary items are always accepted. Click below for information on how to donate and what they need this summer.\nhttps://t.co/aqHFDoqvMM","date":"Wed Jun 03 11:17:52 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Reopening our country and getting Americans back to work will go a long way in restoring unity and prosperity in this country. #GetAmericaBackToWork","date":"Tue Jun 02 16:31:26 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"No country in the history of the world is stronger than the United States of America 🇺🇸 - when we are unified. Relying on vigilante justice, rioting, and looting will only deepen the wounds that separate us...","date":"Tue Jun 02 12:25:05 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"... We must have real change and justice for #GeorgeFloyd, which will only be brought when cooler heads prevail. #USA","date":"Tue Jun 02 12:25:05 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/FSf5Wblh9V https://t.co/M3dXAly968","date":"Mon Jun 01 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/3u3lkJcBF2","date":"Sun May 31 14:11:53 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#GeorgeFloyd deserves justice, but Reverend Dr. Martin Luther King, Jr. knew peaceful protesting was the way to bring about long term change. I was interviewed about the current situation on @foxandfriends this morning.\n\nhttps://t.co/H8B8PEobCr","date":"Sat May 30 17:31:54 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A friendly reminder to make sure you fill out your #2020census. Article I, Section 2 of the U.S. Constitution mandates a census every 10 years. This will determine the amount of political representation each state will have in Congress for the next 10 years. https://t.co/UrsIPyjqmF","date":"Fri May 29 11:30:32 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Hey Twitter, fact-check this…a member of my staff received THREE mail-in ballots, addressed to three different individuals, to the same address! And they say your claims of ballot-fraud are “unsubstantiated” @realDonaldTrump. https://t.co/JmKQ2H0ykk","date":"Thu May 28 19:04:58 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The federal response since the initial PPE shortage has been tremendous, thanks to @realDonaldTrump and his administration. #GetAmericaBackToWork #InItTogether #USA https://t.co/8yKhYNc8mA","date":"Thu May 28 11:30:25 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What did Benjamin Franklin say... \n\n“Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety.”\n \nWhat did Speaker Pelosi just say on the House floor that Benjamin Franklin said? \n\nWatch this video… https://t.co/KzSpLtGxBZ","date":"Wed May 27 20:19:45 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"What do you think about @CDCgov new guidelines to open schools this fall? #InItTogether\n \nhttps://t.co/VdEJRhmiW6","date":"Wed May 27 11:33:34 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/kHAiOwjz28 https://t.co/DUlHy6uACo","date":"Tue May 26 11:26:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"On #MemorialDay, we come together to honor the men and women who gave all for our freedom. We are eternally grateful. #USA https://t.co/yZxXXWAbxT","date":"Mon May 25 11:30:26 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Squeezing in a Zoom call @DobbinsARB as I awaited the arrival of @VP this morning. He visited Georgia to see how our state is leading in successfully re-opening for business. #GetAmericaBackToWork https://t.co/i3UV38yrua","date":"Fri May 22 20:20:41 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Looking for a job? WSB has put together a list of businesses in the area looking to hire help right now. Click below for more information. \n\nhttps://t.co/wuJ0tCplRf","date":"Fri May 22 11:30:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Take a look at how some businesses in Georgia’s 11th Congressional District are letting their customers know they are OPEN for business. #GetAmericaBackToWork #InItTogether https://t.co/A0wpdhWSMl","date":"Thu May 21 11:30:23 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@GovKemp is encouraging all Georgians to get tested for #COVID19. Testing is free, and you can schedule an appointment by calling any Georgia public health department. Click the link below for more information. \n \nhttps://t.co/RStK0nYO59","date":"Wed May 20 11:30:29 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Small business's and restaurant's, get creative with how you let your customers know you’re open for business. Table 20 in Cartersville went on social media to let customers know they are open, and saw a huge jump in their sales. #GetAmericaBackToWork \n\nhttps://t.co/AhnXyvYy8V","date":"Tue May 19 19:20:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Every day, millions of Americans face the reality of living with a mental illness. The month of May is dedicated to removing the stigma surrounding mental illness, and offering support to those who may be suffering. #MentalHealthAwarenessMonth https://t.co/hambGjSCst","date":"Tue May 19 11:30:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Honoring our fallen heroes on #MemorialDay by placing 🇺🇸 flags on their graves is an American tradition and carries extra meaning during these trying times. That is why I called the @DeptVetAffairs and joined some of my colleagues urging the department to reconsider...","date":"Mon May 18 21:34:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"... their ban of public events at national cemeteries on Memorial Day. Wearing PPE and physical distancing would allow family, friends, and others the opportunity to pay their respects to our heroes in a safe manner.","date":"Mon May 18 21:34:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/FP9qispjog https://t.co/PrZx8cIgpp","date":"Mon May 18 11:37:03 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"THANK YOU to all our men and women in uniform, past and present! #AmericaStrong #ArmedForcesDay https://t.co/C61TaoQkV9","date":"Sat May 16 11:30:15 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The House just consolidated all its power into the hands of 22 Democrats by allowing proxy voting - inviting massive corruption. I propose that the Senate not take up any legislation the House passes using proxy votes.","date":"Fri May 15 23:37:55 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congratulations to every graduate in the #Classof2020! These unique circumstances do not change the fact that you have worked hard to achieve your goals, and you should be very proud! #Classof2020 #InItTogether #AmericaStrong https://t.co/iwZ2qgDbBB","date":"Fri May 15 11:30:08 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"... republic is to endure, we must come together as a country and put safeguards in place to ensure this never happens again, and prosecute those individuals who decide to break the law.","date":"Thu May 14 22:30:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"...difference, the individuals in power would only wield them for our good.  Unfortunately, in the past couple days, we’re learning that the highest levels of the Obama administration were unjustifiably using these laws to attack a political rival. If our representative...","date":"Thu May 14 22:30:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Since 9/11, our country has passed laws in the name of “freedom” to “protect” us from something like that ever happening again; but it’s come at a price. These laws were passed with the belief that, no matter the ideological...","date":"Thu May 14 22:30:58 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Instead of voting on a partisan $3 trillion bailout package and upending 200 years of precedent so members can vote from home, Congress should get back to work and pass leg that will help our economy return to greatness, like protections for small biz’s from frivolous lawsuits.","date":"Thu May 14 18:48:04 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"...in the 73rd World Health Assembly and #WHO technical meetings. President @iingwen has demonstrated leadership in helping to protect her people and the world. Taiwan should be heard.","date":"Thu May 14 11:28:28 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Taiwan was the first country to notify the world of human to human transmission of COVID-19, and has had one of the best responses to the virus. That’s why I joined @RepSteveChabot in a letter urging @WHO to include #Taiwan...","date":"Thu May 14 11:28:27 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The impact of the #PaycheckProtectionProgram cannot be understated; as it has helped millions of America’s workers. #GetAmericaBacktoWork https://t.co/wAN81QXbUL","date":"Wed May 13 11:30:24 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"PsychHub’s ‘COVID-19 Mental Health Resource Hub’ is an excellent website, with answers to concerns on mental health issues.    \n\nhttps://t.co/QSG1WoEnNl","date":"Tue May 12 17:01:00 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our law enforcement deserve our respect and appreciation - thank you for putting your lives on the line for us! #NationalPoliceWeek #BacktheBlue https://t.co/5djphxYEzS","date":"Tue May 12 11:30:26 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Looking for something to do outdoors? Today, #CobbCountyParks opened the remainder of their parks, with a few restrictions. Click below for more information.  \n\nhttps://t.co/NTz9CzQw53","date":"Mon May 11 18:28:38 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/HN4fTewDFj https://t.co/a6HeReqzRj","date":"Mon May 11 11:17:01 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"As stated in the poem entitled ‘What Rules the World’ by William Ross Wallace, published in 1865…\n\n“The hand that rocks the cradle is the hand that rules the world.” \n\nLoving and nurturing mothers are truly a gift of God. Happy Mother’s Day! https://t.co/NjU01TMItr","date":"Sun May 10 11:30:20 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you military spouses! Our service member’s mission protecting our nation would be impossible without you. #MilitarySpouseAppreciationDay https://t.co/2lToyTN5qQ","date":"Fri May 08 11:30:23 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Citizens recently lined the streets and came to the Braves stadium to pay their respects for Smyrna Officer Christopher Ewing, who died in April in the line of duty. May we all continue to pray for his family during these difficult times. \n\nhttps://t.co/i6hfKiCajS","date":"Thu May 07 19:50:48 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"“Prayer is today as powerful a force in our Nation as it has ever been. We as a Nation should never forget this source of strength.” – President Ronald Reagan #NationalDayOfPrayer https://t.co/Bo1QZe2fm7","date":"Thu May 07 15:42:56 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"A huge THANK YOU to all of the nurses who are working tirelessly on the frontlines each day! America appreciates you! #NursesAppreciationWeek https://t.co/wjdtSGbGyP","date":"Wed May 06 18:01:18 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you to all our great teachers, including parents who have doubled as teachers during these difficult times, for your role in shaping the minds of our kids - our future. #TeacherAppreciationDay #InItTogether #WeGotThis https://t.co/ItgoIywDrd","date":"Tue May 05 11:30:25 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/7HJBRHc4WM https://t.co/S19Wa53xx0","date":"Mon May 04 11:13:10 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Pleased to see @USTreasury, in response to our request, reach a deal with Visa, MetaBank, and Fiserv to help individuals in un/under banked households receive #EconomicImpactPayments using a prepaid card. \n\nhttps://t.co/wf5xp4vL3p","date":"Fri May 01 14:59:45 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The U.S. Air Force Thunderbirds and the U.S. Navy Blue Angels will do a joint flyover tomorrow over Georgia. The flyover is a salute to frontline COVID-19 workers. #USA #InItTogether https://t.co/i4blMKYgti","date":"Fri May 01 13:31:13 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@US_FDA has put out this info on how we can protect ourselves and others as we start to get out and about more.  #GetAmericaBackToWork https://t.co/Ex9J5AkzDC","date":"Thu Apr 30 11:12:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you, @USTreasury for announcing that prepaid debit cards will be an option for Americans to receive their #EconomicImpactPayments even faster. When I wrote you earlier this month suggesting this, I knew this could help millions of Americans... https://t.co/2wyCv2Xnun","date":"Wed Apr 22 16:49:43 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"...and even called them racist. And, while he was restricting travel, Pelosi had the House vote on a bill to ban flavored tobacco. Republicans aren’t playing politics, we just believe its time to #GetAmericaBackToWork safely and responsibly.","date":"Tue Apr 28 18:37:23 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Regardless of when the medical community deems it okay for people to return to work, Dems will delay so they can say they were the ‘responsible’ party and listened to the medical community; but, in reality they ignored COVID-19, blasted @realDonaldTrump’s initial travel bans...","date":"Tue Apr 28 18:37:22 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Our men and women in uniform routinely go above and beyond the call of duty for our country. Here’s just one example of what the Georgia National Guard has been doing to help out during COVID-19.\n \nhttps://t.co/Zls1wFyVub","date":"Tue Apr 28 11:23:34 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/sJdkQ0vBwH https://t.co/vWty8Eur2X","date":"Mon Apr 27 11:18:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"#GetAmericaBackToWork https://t.co/poBKMM0HVz","date":"Fri Apr 24 18:50:51 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The popular #PayCheckProtectionProgram is one step closer to saving more businesses and jobs. All that remains now is @realDonaldTrump’s signature. #GetAmericaBackToWork https://t.co/pflVAsddQu","date":"Thu Apr 23 22:32:21 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"...especially individuals in unbanked and underbanked households. I will share more information about this when it becomes available from the #IRS.","date":"Wed Apr 22 16:49:44 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you, @USTreasury for announcing that prepaid debit cards will be an option for Americans to receive their #EconomicImpactPayments even faster. When I wrote you earlier this month suggesting this, I knew this could help millions of Americans... https://t.co/2wyCv2Xnun","date":"Wed Apr 22 16:49:43 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Discussing @GovKemp’s decision to reopen Georgia for business on @FoxBusiness. #GetAmericaBackToWork https://t.co/pxQuc3Atc5","date":"Wed Apr 22 15:59:35 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Breaking: “The IRS today issued a special alert...act by this Wednesday, April 22, if they didn't file a tax return in 2018 or 2019, and have dependents...to receive the full amount of their Economic Impact Payment.” Click below for more information. \n\nhttps://t.co/VGWllbfJNR","date":"Tue Apr 21 18:01:55 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"The Atlanta Committee for Progress has partnered with @partnersforhome and @mercyatlanta to help the homeless community - providing housing, meals, and clean clothing. You can help! To donate, please contact Johnathan Adelman at Jonathan@atlprogress.com","date":"Tue Apr 21 11:39:40 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Thank you @GovKemp. It’s time to #GetGeorgiaBackToWork","date":"Mon Apr 20 21:24:22 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Weekly Newsletter: https://t.co/LNVFMN3KAa https://t.co/ePLUY38njb","date":"Mon Apr 20 11:14:59 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Some #GoodNews! Individuals and Businesses across Georgia have come together to fight COVID-19. #InItTogether https://t.co/3nmbdFOwH5","date":"Sat Apr 18 11:30:14 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Congrats to the @AF_Academy Class of 2020! Ga-11 graduates Payton of Cartersville, Nicholas of Woodstock, and Juanita of Marietta received service academy nominations from my office in '16, and I could not be more proud. Click below to watch.\n\nhttps://t.co/g3XUj8aXKu https://t.co/qAc7w8o22s","date":"Fri Apr 17 18:00:31 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":".@WellstarHealth, a not-for-profit health care system in Georgia, is asking for your help during the COVID-19 pandemic. If you have things like PPE, food, or you’d like to make a financial contribution, please click on the link below. #InItTogether\nhttps://t.co/WFHt0gu21a","date":"Fri Apr 17 11:29:05 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Democrats need to stop blocking additional funding for the #PayCheckProtectionProgram. Millions of jobs have been saved due to this program and it’s vital that we allocate more money so we can save more businesses and jobs. #GetAmericaBackToWork","date":"Thu Apr 16 15:41:19 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"https://t.co/sJUQ7vyeKv","date":"Thu Apr 16 11:23:11 +0000 2020","user_id":"2914163523"},{"handle":"RepLoudermilk","text":"Reminder for Georgians: Federal and State tax return filing deadline has been extended to July 15, 2020.\nhttps://t.co/AIX9bpdbfO","date":"Wed Apr 15 11:26:10 +0000 2020","user_id":"2914163523"}]