[{"handle":"RepMarkPocan","text":"In Congress, I’ve fought to reverse the damage Don’t Ask, Don’t Tell inflicted on the LGBTQ community. I've championed the Restore Honor to Service Members Act to set military records straight and reinstate benefits to veterans who served their nation honorably. #CECPrideChats","date":"Thu Jun 16 20:59:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"House Democrats are taking action against corporate greed and rising prices. \n\nWe just passed the Lower Food &amp; Fuel Costs Act, a bill to lower prices for America’s families in the grocery aisle and at the gas pump. \n\nWhat’s the GOP’s plan?","date":"Thu Jun 16 17:47:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’m sure the @January6thCmte would be glad to have you respond to questions under oath. https://t.co/Su8WfEoEM4","date":"Thu Jun 16 17:10:32 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ll always be grateful that we have an ally in the White House. \n\nThank you @POTUS for taking steps to advance equality for the LGBTQ+ community, renounce discrimination, and secure our rights.\n\nhttps://t.co/xWBn8ymKnD","date":"Wed Jun 15 19:14:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/A1S07OcJ7a","date":"Wed Jun 15 17:45:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Photographing tunnels and security checkpoints. Sharpening a flag pole into a weapon. Expressly stating intent to harm elected officials.\n\nHow can so many of my GOP colleagues still claim this was nothing more than a six-hour demonstration?","date":"Wed Jun 15 15:55:17 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Gov. La Follette believed that we must be aggressive for what is right in order to save our government from those who are aggressive for what is wrong. On Fighting Bob La Follette Day, we renew that mission. Let’s keep up the good fight in his memory. https://t.co/sR5aQgoZag","date":"Tue Jun 14 18:53:52 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We could do so much good with just a slice of the Pentagon's budget. \n\nToday, @RepBarbaraLee and I introduced a bill to cut that budget by $100 billion and reinvest the savings in our people. https://t.co/FKciMSBehh","date":"Mon Jun 13 19:46:08 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"👀","date":"Mon Jun 13 17:53:13 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Let’s lead the world in funding peace — not wars — and put #PeopleOverPentagon.","date":"Mon Jun 13 17:38:08 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Crafting legislation shouldn’t be about which party wins and loses — the public should win every time! Enjoy this throwback #MagicMonday. \n\nhttps://t.co/39j55e9zRL","date":"Mon Jun 13 13:28:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Never have I ever:\n❌ asked for a pardon\n❌ planned an insurrection","date":"Fri Jun 10 13:40:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The @January6thCmte confirmed what we already knew: this was not a spontaneous mob attack on the U.S. Capitol – it was an explicit attempt to stage a coup &amp; override a free and fair election. We must ensure the crimes committed can be known &amp; we can ensure it never happens again.","date":"Fri Jun 10 02:11:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The GOP must have realized that taking reproductive healthcare rights away from some wasn’t fair, so now they’re proposing we take away healthcare from, wait for it, the elderly and the poor. \n\nHell of a platform…","date":"Thu Jun 09 21:14:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"During #PrideMonth and beyond, no one should have to hide who they love or pretend to be someone else in order to be treated with fairness, dignity, and equality.","date":"Thu Jun 09 20:46:15 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@RepGaramendi and I wrote @SecDef urging him to investigate defense industry mergers. It’s critical these mergers, like the @northropgrumman - @OrbitalATK merger, are subject to adequate scrutiny to limit defense contractor profiteering and protect supply chains. https://t.co/K03nOdopmu","date":"Thu Jun 09 18:05:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In America, more children die from gun violence than any other cause. Read that again.\n\nWe don’t have to live like this. The House has acted. The Senate must have the strength to do the same.\n\n#EndGunViolence https://t.co/2UFEGSDoJL","date":"Wed Jun 08 23:58:18 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's not the video games. \n\nIt's not the classroom doors. \n\nIt's the guns.","date":"Wed Jun 08 14:46:49 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I am deeply concerned for the safety of journalist Dom Phillips and Indigenous expert Bruno Araújo Pereira, who are both missing in the Brazilian Amazon. Brazilian authorities should intensify the search for them and help bring them home. \nhttps://t.co/RGN9Su09K5","date":"Tue Jun 07 21:57:29 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thanks to @HouseDemocrats, @GovEvers, and @POTUS, overdue investments in our state’s infrastructure are on the horizon.\n\nhttps://t.co/ADjDfe4r3S","date":"Tue Jun 07 19:21:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you have to act in \"complete secrecy\" in order to \"defend democracy,\" you might not actually be the party of law and order.\n\nhttps://t.co/EW1lVtiYZ4","date":"Tue Jun 07 14:55:15 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"June is National Dairy Month and here in America’s Dairyland, we milk it for all it’s worth! I can think of no butter way to celebrate than by supporting our local farmers. \n\nHave a dairy good month, cheese and thank you 🐮🧀","date":"Mon Jun 06 19:29:05 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/o8JfpqBdSm","date":"Mon Jun 06 16:02:37 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I stopped by the Rick Wilcox Theater in the Dells and have a special guest for today's #MagicMonday. Check it out: https://t.co/woBEnFtoCZ","date":"Mon Jun 06 13:30:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #PrideMonth, I’m remembering the impact that Dick Wagner left on our community. It’s thanks to leaders like him that we’ve made such progress in the march toward equality.","date":"Fri Jun 03 18:11:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We take too many moments of silence and not enough moments of action.\n\nI #WearOrange today to honor victims of the gun violence epidemic and acknowledge that thoughts and prayers aren’t enough. Let’s act today to #EndGunViolence. https://t.co/FmE7WERMYj","date":"Fri Jun 03 12:55:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Enough already! Another shooting, this one in my home state. I am committed to acting to prevent these senseless tragedies. The time for thoughts and prayers are over. The time for action is now. \n\nhttps://t.co/0Q5Fmgt7j8","date":"Thu Jun 02 22:07:05 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This year, two students from #WI02 have been recognized by @USEdGov as Presidential Scholars! Please join me in congratulating Daphne Wu and Ananya Krishna on this remarkable achievement. \n\nhttps://t.co/8wAock5Ki4","date":"Thu Jun 02 20:07:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We spend more on defense than the next nine countries combined — yet, we can’t use that money to protect Americans from real national security threats like pandemics and climate change. \n\nJust think of the things we could do with even 1% of the Pentagon's bloated budget. https://t.co/J40RA8n3dh","date":"Thu Jun 02 19:05:08 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Corinthian Colleges ripped off Americans trying to better themselves for years. Thank you @POTUS, @VP, &amp; @SecCardona for forgiving the federal student loans for the more than 3,300 Wisconsinites who were taken advantage of by this defunct institution.\n\nhttps://t.co/LSYyPYxybI","date":"Thu Jun 02 16:26:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s not too late to RSVP for my Virtual Town Hall this evening! See you soon ⏰\n\n🔗 https://t.co/JvknyYWsQm","date":"Wed Jun 01 20:01:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #Pride! \n\nThis month we celebrate the strides we’ve made toward equality, and thank the organizers and activists who have led the way. The LGBTQ+ community deserves to live openly, honestly, and without discrimination. No attempts to silence us will succeed. https://t.co/1PON9TFYHD","date":"Wed Jun 01 13:41:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looking forward to seeing you tomorrow at my virtual town hall. Drop a comment below if there's anything you'd like me to bring up: https://t.co/JvknyYWsQm https://t.co/bBJmEJ7J5h","date":"Tue May 31 21:43:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Reminder: Join me tomorrow for a Virtual Town Hall on Facebook Live to discuss what’s happening in Congress and answer questions about issues that matter most to you.\n\nRSVP ➡️  https://t.co/JvknyZe3HU https://t.co/TwA0Cb2huC","date":"Tue May 31 17:41:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In less than 3 days, Israel is set to evict ~100 Palestinians from their apartment building in East Jerusalem, causing increased instability in the region. \n\nThe Israeli government needs to immediately put a hold on this unnecessary eviction &amp; save the homes of these families.","date":"Mon May 30 22:22:22 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On #MemorialDay, we remember those who served our country and made the ultimate sacrifice. We salute them.\n\nLet us honor our patriots by continuing their fight for liberty and justice for all.","date":"Mon May 30 14:06:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Before you head out to a #MemorialDay parade, check out this new #MagicMonday to learn how to avoid the “I’m like you” trick some politicians use! https://t.co/dLiwZqh85e","date":"Mon May 30 14:02:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"174 years ago, the greatest state joined the nation. Happy Birthday, Wisconsin! #Forward! https://t.co/tm3fIhn1KE","date":"Sun May 29 13:38:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is appalling, even for you @SenRonJohnson. Mass shootings have nothing to do with “liberal indoctrination.” It’s about access to guns. Period.","date":"Fri May 27 19:50:06 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We’re just a few days away from my next virtual town hall. Join me on Facebook Live on June 1st at 6 PM Central. https://t.co/HOq6PEE7OM https://t.co/0cgfskWhpx","date":"Fri May 27 16:44:15 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Dick Wagner was a leader, an activist, and a champion for LGBTQ+ rights. Most importantly, he was a mentor and a friend. \n\nHis legacy will not soon be forgotten. https://t.co/aImuu6jxp6","date":"Tue Dec 14 23:36:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For years, teachers have been disrespected and underpaid. @SecCardona and I agree that one of the best ways to improve teacher morale and retention – pay them more! https://t.co/bBVwtdir0n","date":"Thu May 26 21:13:18 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Kids. These were kids and educators. How many more lives must be lost before the Senate says “no more”?  \n\nAbolish the filibuster and pass sensible gun reform now. #StopGunViolence","date":"Wed May 25 20:07:25 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Six years ago I joined a sit-in on the House floor to urge action on gun violence prevention. \n\nImagine how many lives that might have been saved if the NRA didn’t have such a grip on the GOP. https://t.co/SpVMMiDGHG","date":"Wed May 25 17:18:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We shouldn’t have to be afraid to send our kids to school, go to the grocery store, or just live in peace. \n\nIt's time for the Senate to pass gun violence bills already approved by the House.\n\nWe can’t afford to wait any longer.","date":"Wed May 25 14:27:53 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My heart breaks for the fourteen kids and their teacher who lost their lives to gun violence today. \n\nEnough is enough.\n\nhttps://t.co/CcdAk9STCU","date":"Tue May 24 21:36:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Save the date! 📅 I’ll be holding a Facebook Live Town Hall next Wednesday, June 1 at 6:00 CT as we head into a very busy legislative session. I look forward to answering the questions that matter most to you. \n\nRSVP here! https://t.co/JvknyYWsQm https://t.co/QQH6bHOLiu","date":"Tue May 24 16:55:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Three cheers for the workers at Raven Software on their vote to form the Game Workers Alliance union! This new generation of workers are an inspiration to us all! #1u","date":"Mon May 23 22:17:32 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Friendly reminder: your mental well-being is just as important as your physical health. Everyone deserves access to healthcare, including affordable, quality mental health support. \n\n#MentalHealthAwarenessMonth","date":"Mon May 23 18:53:55 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's important for elected officials to be able to read their constituents. In this throwback #MagicMonday I show how it's done. \nhttps://t.co/YrPJEszFMt","date":"Mon May 23 14:00:01 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tucker Carlson has been spewing racist tropes for years. To believe this, he must be living in some alternate reality. https://t.co/LbSwtclqWK","date":"Fri May 20 19:17:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Big Oil is bringing in record profits while you pay more at the pump. It’s time they stop #RippingOffAmericans. I voted to lower prices by stopping price gouging, penalizing market manipulation, and bringing transparency to this secretive market.  https://t.co/XlRYpALNB3","date":"Thu May 19 17:43:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker should have a say in their workplace. Great to see workers across the country taking action. #1u https://t.co/hIi7H6k5wj","date":"Thu May 19 17:13:50 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From the farm to the grocery shelves, corporate profiteering and out-of-control consolidation has prices climbing.\n\nThe Food and Agribusiness Merger Moratorium and Antitrust Review Act of 2022 will protect our farmers and our families. https://t.co/T9n9xBw1KU","date":"Thu May 19 13:42:18 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From Amazon, to Starbucks, to Raven Software in WI-02, the new wave of organizing we’re seeing these days is exciting.\n\n@SecMartyWalsh agrees: we've got to create pathways to ensure workers get the benefits they deserve. https://t.co/kw03qyniKA","date":"Tue May 17 19:11:17 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On International Day Against Homophobia, Biphobia &amp; Transphobia – and every day – I'm proud to stand up to harassment, discrimination, and violence of any kind, including in the LGBTQI+ community. #IDAHOBIT https://t.co/pF0v3cK2Te","date":"Tue May 17 18:17:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations @JMNookin! As a proud @UWMadison alumnus, I look forward to working with you in your new role as you take the reins at one of the best public universities in the US!","date":"Mon May 16 15:21:53 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There’ll be a new #MagicMonday next week. In the meantime, check out this trick from Eric Chien and you’ll know why I’m in Congress and not doing magic full-time, this guy is SO good. https://t.co/N0P4RpMd19","date":"Mon May 16 13:27:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These horrifying incidents are far too commonplace &amp; have no place in our society. Sadly just hours after Milwaukee, we have yet another reminder of how prevalent gun violence is in our communities. We need to do all we can to prevent these senseless acts. https://t.co/HnvsdGFpxI","date":"Sat May 14 21:20:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thankfully no one was killed. \n\nGun violence is a uniquely American issue. Violence is never the answer and we must work together to ensure tragedies like this are a thing of the past. \n\nhttps://t.co/pofsWg20yZ","date":"Sat May 14 20:37:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations to the 2️⃣ teams from Madison West High School in the 2022 @RocketContest National Finals today — the world’s largest student rocket contest! I hope it’s a BLAST! 🚀\n#RocketContest22","date":"Sat May 14 13:27:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Healthcare decisions shouldn't be impacted by laws that were passed when slavery was legal. Everyone deserves full access to modern healthcare, and that includes abortions. https://t.co/SA8kaUzYVL","date":"Thu May 12 21:58:46 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No one should have to choose between paying the bills and taking care of themselves. \n\nThank you @SenSanders for reintroducing #MedicareForAll and understanding that healthcare is a right, not a privilege.","date":"Thu May 12 17:37:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"They knew what they were doing. These giant corporations only care about the bottom line. \n\nhttps://t.co/7T6FlGYnhI","date":"Thu May 12 17:10:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The US government’s condemnation of the killing of an American journalist is a welcome reaction to an untenable situation in Israel and Palestine. Restrictions on aid may be necessary if human rights and universally acceptable norms can’t be followed. https://t.co/I5yiv1FONk","date":"Thu May 12 00:55:44 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The decision to have an abortion is a personal choice. It's often a private choice, an emotional choice, but it must remain just that — a choice.\n\nWe marched to the Senate calling on them to protect that choice, respect bodily autonomy, and secure reproductive freedom. https://t.co/4tV1cFGi63","date":"Wed May 11 20:24:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Experts like Dr. Fauci agree: pandemics such as COVID-19 pose a threat to our national security. It’s time our definition of defense realizes that too. https://t.co/zxKDKF4f0f","date":"Wed May 11 16:19:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a voice in the workplace — and that includes hardworking Congressional staff who work tirelessly on behalf of our communities. I look forward to supporting @RepAndyLevin’s resolution tonight, Recognizing Congressional Workers’ Right to Organize.","date":"Tue May 10 23:43:47 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"46 colleagues and I called on Red Cross and its workers to negotiate in good faith. They have managed 40% of the blood supply during the pandemic – it's imperative to protect great work by great workers. https://t.co/EpzBEpPbcI","date":"Tue May 10 19:58:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Fixed it for you, @AP. https://t.co/5xGmvEvN1B","date":"Tue May 10 17:56:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Drumroll, please… I’m excited to announce the winners of my office’s annual Congressional Art Competition! \n\nThank you to all the talented young artists who submitted original works, and congratulations to this year’s winners. 🎨 https://t.co/C7ij2jJWbs","date":"Tue May 10 14:06:49 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The pandemic showed us just how essential the internet is — no matter who you are or what you do. \n\n@POTUS is making the Affordable Connectivity Program even better by capping the cost of internet for almost 48 million Americans.\n\nhttps://t.co/KLkfapTWG3","date":"Mon May 09 19:40:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When the pandemic hit, live performances of #MagicMonday turned into a two-year-long disappearing trick. But just like any good magician, I’m back! \n\nCheck out this celebrity-inspired trick I performed live at @GSAFEwi, and keep an eye out for more tricks soon. https://t.co/lEWJRchIRC","date":"Mon May 09 13:24:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today marks my first Mother’s Day without my mom. She was a small business owner with a knack for getting things done, and I wouldn’t be the person I am without her.\n \nTo all the moms out there who selflessly give us their time, energy, and love: thank you, and happy #MothersDay.","date":"Sun May 08 15:00:40 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #NursesWeek I applaud and stand in support of UW Health nurses. \n\nThroughout the pandemic, they've cared for us. Now they deserve our support so they can do the same for themselves and their families.","date":"Fri May 06 20:09:37 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"(Small) business is booming! \n\nWith over 65,000 applications across the state in 2021, Wisconsinites have more opportunities than ever before to support local. I can’t think of any better way to celebrate #SmallBusinessWeek. https://t.co/5Fk3UfmOk9","date":"Fri May 06 18:57:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It appears there’s a competition going on between Republicans to see who can generate the most absurd headline this week.\n\nWhat’s first prize? An invite to the next cocaine orgy party? \n\nhttps://t.co/otvliClnNr","date":"Thu May 05 17:41:30 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ve said it before and I’ll say it again: inflation makes one hell of a scapegoat for corporate greed. \n\nhttps://t.co/Ms8vyQ3Ch9","date":"Thu May 05 15:03:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Indigenous Women are murdered at a rate 10x above the national average. Over 50% experience sexual violence. We can’t turn a blind eye to this epidemic.\n\nToday we mark National Day of Awareness for Murdered and Missing Indigenous Women &amp; Girls. Enough is enough. #RedDressDay","date":"Thu May 05 14:45:25 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I've been a small business owner since I had a full head of hair, so I understand the importance of community support. I joined @SBAgov today to recognize Chef Heide as the 2022 Wisconsin Small Business Person of the Year. Congrats Dave, and thank you for serving our community. https://t.co/npArnmuE9Q","date":"Wed May 04 20:03:49 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Pretty bold to call yourself “pro-life” while opposing the Child Tax Credit, spreading disinformation about lifesaving vaccines, failing to act on gun violence, and taking away reproductive freedoms. https://t.co/vourGYsDCQ","date":"Wed May 04 18:19:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Please, whatever you do, do not take medical advice from @SenRonJohnson. \n\nOr any advice for that matter…\n\nhttps://t.co/nmtDGHbGZV","date":"Wed May 04 02:06:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"To be clear: Abortion is still the law of the land, and will remain available as a healthcare choice until any rulings are officially announced.\n\nThe fight for reproductive rights doesn't end here.\n\nIf you’re in Wisconsin and need care, visit @WMFwisconsin for guidance.","date":"Tue May 03 13:54:19 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's reproductive justice or the filibuster.","date":"Tue May 03 02:04:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Safe abortions will always be accessible to the wealthy. It’s about taking away your right to bodily autonomy.\n\nThere’s no time to waste — the Senate must codify Roe. \n\nhttps://t.co/F4XvOGfSWB","date":"Tue May 03 01:16:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ve always said, the process isn’t as important as the progress. Whether it’s through legislative pathways or executive actions, we’ve got work to do for the American people. \n\nThanks for having me, @KWelkerNBC. https://t.co/ReBLDleXGE","date":"Mon May 02 21:04:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @MeetThePress on MSNBC with @kwelkernbc in just a few minutes to discuss how Congress is helping Ukraine. Tune in now.","date":"Mon May 02 17:06:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I own a small print shop in Wisconsin, so I was among the first people to show interest in 3D printing technology. In fact, it can seem almost... magical ✨\n\nEnjoy today’s throwback #MagicMonday! \n\nhttps://t.co/D4Iohwr9YI","date":"Mon May 02 15:44:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Small businesses are the backbone of our communities, and #WI02 is home to some of the best. From one small business owner to another, happy #SmallBusinessWeek!\n\nI want to know: What’s your favorite place to buy local in Wisconsin? 👇🏼 https://t.co/8JKVeCSX5M","date":"Mon May 02 14:29:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These Starbucks workers are unstoppable. Incredibly proud of the first unionized store in Wisconsin! https://t.co/wY72DIfNn9","date":"Sat Apr 30 21:06:32 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/9cn0d4qWts","date":"Fri Apr 29 15:07:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As a proud graduate of public schools, I know firsthand how much of an impact great teachers have on their students' lives.\n\nCongratulations to #WI02’s very own Mr. Kabby Hong on being recognized as Wisconsin’s representative for the National Teacher of the Year Program. https://t.co/tgNElGHjtq","date":"Thu Apr 28 20:06:13 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Donating blood is one of the most crucial acts of service we can offer one another, but the ban on gay and bi men from donating is discrimination — plain and simple. I hope the US will follow Canada's lead and end this unfair practice.\n\nhttps://t.co/mvjquDhPSL","date":"Thu Apr 28 18:35:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Laws like Florida’s ”Don't Say Gay\" bill have no place in our education system. \n\nI'm glad @SecCardona unequivocally understands that every student should feel safe at school and is taking steps to ensure that promise is kept. https://t.co/AsmboMg7we","date":"Thu Apr 28 17:36:09 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ve been a small business owner since I was 23. I asked @JoshBivens_DC at yesterday's @JECDems hearing if corporate profits and price gouging are having a significant impact on inflation.\n\nThe short answer? Yes. https://t.co/pU7Kbn3KZX","date":"Thu Apr 28 16:14:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker has a right to a safe job. On #WorkersMemorialDay, I’m fighting for stronger safety and health protections for all workers — and we won’t stop until that fundamental right is fulfilled. https://t.co/kxVCcPf7w1","date":"Thu Apr 28 13:12:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"More than 75 years since the Holocaust ended, antisemitism is still an evil that exists around the world.\n\nEli Wiesel taught us that hate is contagious. \n\nOn Holocaust Remembrance Day we must stop the hate, love people for who they are, and say “never forget, never again.”","date":"Thu Apr 28 00:03:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Attention #WI02 high schoolers 🎨 Have you submitted your artwork for the Congressional Art Competition yet? \n\nWe’re accepting submissions for one more week. Click here for more information: \n\nhttps://t.co/hq8W8R9IC4 https://t.co/8y4rNe0WAy","date":"Tue Apr 26 16:03:46 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Starting soon!","date":"Tue Apr 26 13:16:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s hard to wrap your mind around the concept of a billion, but time is a bit easier to understand.\n\n1 million seconds is roughly 11.5 days. 1 billion seconds is about 31.5 years. \n\nElon Musk just bought Twitter for $45 Billion — or in seconds, roughly 1,427 years. \n\n#TaxTheRich","date":"Mon Apr 25 19:39:40 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"About damn time.","date":"Mon Apr 25 17:03:23 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can’t decide what’s more embarrassing... \n\nElon Musk paying $46 billion to silence his Twitter critics under the guise of “protecting free speech,” or conservatives believing that Elon Musk actually cares about free speech.","date":"Mon Apr 25 16:40:39 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Monday mornings always seem to fly by quickly, especially as we prepare for a busy week in Washington. Today’s throwback #MagicMonday is all about organized chaos. Enjoy! \n\nhttps://t.co/ES8k6XYuoI","date":"Mon Apr 25 16:03:18 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Pentagon and US defense contractors are living in the past, throwing money at problems instead of looking for real solutions.\n\nCutting the defense department budget is good, actually.\n\nhttps://t.co/SSlJCSbMgE","date":"Sun Apr 24 23:09:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our defense budget continues to grow; climate change continues to worsen. \n\nYet, we can’t use that defense budget to protect our country from the massive national security threat that is global warming. \n\nThe math isn’t mathing 🤔","date":"Fri Apr 22 19:05:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It doesn’t make sense to celebrate the earth if we don’t vow to fight for it too.\n\nOur future relies on preservation, not profit for a select few. This #EarthDay, let’s listen to science, put people over polluters, and care for the only home we’ve got. https://t.co/e4DiWBf5dt","date":"Fri Apr 22 16:43:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In the face of relentless attempts to silence and alienate LGBTQ+ youth, students and young leaders everywhere are standing strong against hate.\n\nI’m proud to support @GLSEN and those participating in #DayOfSilence because our kids should always feel safe at school.","date":"Fri Apr 22 12:51:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s not just about legalizing marijuana.\n\nIt’s about ensuring racial justice. It’s about ending mass incarceration. It’s about giving thousands a clean slate by expunging records for minor possession.\n\nI can think of about 420 reasons why we should #LegalizeIt.","date":"Wed Apr 20 15:50:31 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Missiles after 2021 Israeli mosque attacks made things worse. Violence begets violence. Israel should take missiles out, NOT disproportionately respond. Palestinians need better humanitarian conditions w/o a few firing missiles. People on both sides stuck. https://t.co/ErV3BNewCr","date":"Tue Apr 19 13:28:02 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"#TaxDay was the perfect opportunity to talk with @CitizenActionWI about the inequities in our tax system. Watch ⬇️ https://t.co/FW1Yq8XcXV","date":"Mon Apr 18 21:23:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I hope you’ll join me in wishing a happy birthday to one of Wisconsin’s finest, @RepGwenMoore! 🎉 It's an honor to call you a colleague and friend. https://t.co/iH400iEpwr","date":"Mon Apr 18 16:33:21 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Under President Trump, the GOP gave tax cuts to the wealthy and empty promises to everyone else. Now, Rick Scott and Republicans are proposing tax increases for the working class. Luckily, @POTUS has other plans. \n\nEnjoy this throwback #MagicMonday!\n\nhttps://t.co/fwVC6R8TFS","date":"Mon Apr 18 14:44:22 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tax Day is a great reminder of our desperate need for a tax system that rewards work – not wealth.\n\nIt's beyond time the wealthiest individuals and corporations paid their fair share, just like the rest of us.\n\n#TaxTheRich","date":"Mon Apr 18 13:29:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It is unconscionable that Israeli police would attack a Palestinian mosque during the holy month of Ramadan, but even worse on the eve of Passover, where Jews leave a seat open for Elijah, a symbol of peace. https://t.co/plDaJOiiqc","date":"Sat Apr 16 01:44:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can't wait to see what the next 50 years ~produce~ 🥕🍅🌽🧅🥬🫑\n\nhttps://t.co/96yep6g7iC","date":"Fri Apr 15 16:39:54 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"UW-Madison is home to some of our nation’s brightest students and the world’s best researchers. \n\nIt was a privilege to work with @SenatorBaldwin to secure over $41 million in federal funding for projects at this trailblazing university. https://t.co/j5EAyFZkHm","date":"Fri Apr 15 15:12:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just had an infuriating call w/ @USAirForce who is completely disregarding community sound concerns of the F-35 coming to WI-02. Never had a federal entity act so insulting. Will have to raise the stakes on the Air Force’s ignorance and lack of understanding. #sad @AppropsDems","date":"Thu Apr 14 20:00:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@RepGwenMoore Rest up and feel better soon!","date":"Thu Apr 14 16:30:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I proudly advocated for the Green County Aging and Disability Resource Center to receive federal funding for their new mobile health outreach unit. The $200,000 we secured for this facility will help expand access to critical care. https://t.co/kOO9bXLSWu","date":"Wed Apr 13 16:34:19 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If union-busting and forcing workers to pee in bottles wasn’t enough, a new report shows that nearly HALF of U.S. warehouse injuries in 2021 occurred at Amazon facilities — 89% of which were serious. \n\nDoes that sound like “Earth’s Safest Place to Work” to you?","date":"Tue Apr 12 15:13:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There are just three weeks left to submit an original piece of artwork for this year’s Congressional Art Competition. Don’t miss out!\n\nhttps://t.co/hq8W8R9IC4 https://t.co/Pq8OvYDGaW","date":"Mon Apr 11 18:28:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From earmarks to budgets, legislating is all about finding the right combination. Enjoy today’s throwback #MagicMonday!\n\nhttps://t.co/27Krw1f7b4","date":"Mon Apr 11 15:55:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Justice Jackson has a nice ring to it. \n\nHistory made.","date":"Thu Apr 07 18:13:29 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Big Oil wants you to believe that they’re helpless in setting prices at the pump, but their profit margins tell another story. \n\nWhen someone shows you who they are, believe them.","date":"Wed Apr 06 18:30:54 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In case you haven't heard, it's #DayOfTheBadger 🦡\n\nToday and every day, I’m proud to be an alumnus of UW-Madison! #OnWisconsin https://t.co/MBvW2b8YWI","date":"Tue Apr 05 17:58:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No one should go bankrupt trying to provide healthcare for their family.\n\nIt's time to address this glitch, lower premiums for families, and open the door to health coverage for thousands more.\n\nhttps://t.co/XmuQLhqPnh","date":"Tue Apr 05 13:58:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This must be that voter fraud we’ve heard so much about… \n\nhttps://t.co/iokZVqxFlf","date":"Tue Apr 05 13:21:16 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Confirm KBJ.","date":"Mon Apr 04 20:46:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This throwback #MagicMonday proves that not everything is as it seems. \n\nhttps://t.co/s2ogSS6nS4","date":"Mon Apr 04 17:14:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Theaters and their workers are central to every community.\n\nI look forward to ensuring Pabst Theater Group’s unionization recognition and bargaining process takes place without any union-busting activities, as is required by federal law.","date":"Mon Apr 04 16:36:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you’re being called an essential worker, you should be treated as one too. \n\nI’m proud to see that the Madison Starbucks workers have taken steps to become the third unionized store in the state. #1u \n\nhttps://t.co/JBV8bJe3A7","date":"Mon Apr 04 14:15:55 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A majority of Americans support legalizing marijuana. I voted in support of the MORE Act because no one should be behind bars for minor possession charges. \n\nIt’s beyond time to decriminalize marijuana.\n\nhttps://t.co/rcd6856ysH","date":"Fri Apr 01 16:47:44 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joe Biden, Jobs Guy.","date":"Fri Apr 01 15:51:16 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We spend too much on defense contractors, and not enough on national defense. \n\nA modern definition of defense would include protections against pandemics, climate change, and cyberattacks. https://t.co/M1vVnrV99s","date":"Fri Apr 01 15:49:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Will be joining @cspanwj with @gretabrawner to take your questions live on the air in just a few minutes. Tune into @cspan now. https://t.co/dbzlolLy0K","date":"Fri Apr 01 12:23:10 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Big Pharma’s greed is the only reason why Americans pay more in insulin than just about anyone else. \n\n@HouseDemocrats just voted to cap the cost of insulin for American families at $35/month, saving families thousands of dollars a year.","date":"Thu Mar 31 22:14:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"You feel pain at the pump, they feel profits. \n\nYou struggle to put food on the table, they reward shareholders with bonuses. \n\nYou scrape by, they rake in more and more. \n\nInflation makes one hell of a scapegoat for corporate greed.\n\nhttps://t.co/tcBEZ2JFMq","date":"Thu Mar 31 21:22:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Equality, justice, and dignity – those are the basic principles #CésarChávez fought for. \n\nHis work paved the way for so many blue-collar workers to access the American dream. Today, we honor his legacy and continue working toward a better future.","date":"Thu Mar 31 17:36:08 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The 2022 Congressional Art Competition has officially begun! \n\nFrom now until May 2, our office will be accepting submissions from young artists in #WI02 for a chance to have your original piece hung in the U.S. Capitol. \n\nVisit https://t.co/hq8W8R9IC4 for more information. https://t.co/yszoropv7w","date":"Thu Mar 31 16:16:18 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today is Transgender Day of Visibility — a day to honor the achievements, contributions, and resilience of our transgender community. \n\nI’m proud to stand with the @LGBTEqCaucus and support the ongoing march toward equality. https://t.co/w6SHP15jYu","date":"Thu Mar 31 13:02:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Missing phone records and flushed documents... all clear signs of innocence.\n\nhttps://t.co/AGr6tYGj0L","date":"Wed Mar 30 18:22:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Give me one good reason why the Pentagon shouldn't have to pass an audit.","date":"Wed Mar 30 16:27:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If I were a spineless, unethical oil corporation raking in record profits at the expense of consumers I probably wouldn’t want to answer questions either.","date":"Tue Mar 29 17:29:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Pandemics, climate change, and cyberattacks are all real, pertinent threats to our national security. \n\nIf we’re going to keep increasing our defense budget, we need to continue expanding our defense definition.","date":"Tue Mar 29 15:25:25 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Trump might have been planning to commit a crime??? https://t.co/jFD1zaf4LW","date":"Mon Mar 28 16:55:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Being observant is an important trait to have in Washington. Do you have a keen enough eye to follow this throwback #MagicMonday? \n\nhttps://t.co/PHEczPkztC","date":"Mon Mar 28 15:38:50 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Not a hairs difference between @RepMTG and @SenRonJohnson on their bigotry, but Johnson is the homophobe in our own backyard with his stupid bathroom comments.\n\nhttps://t.co/TBWfoe7SeC","date":"Mon Mar 28 12:54:47 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We’ve seen it before: the GOP can’t unify their base around good ideas, so they build support for hate. These bills do nothing beyond hurt our young people.\n\nhttps://t.co/kYDndX7Tr8","date":"Fri Mar 25 18:06:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If it’s a day that ends in “y,” you can bet @SenRonJohnson will say something homophobic, racist, sexist, or all of the above. \n\nhttps://t.co/TPGsxcLjs5","date":"Thu Mar 24 20:25:28 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Barnum &amp; Bailey called; they want their performers back. 🤡🤡🤡\n\nhttps://t.co/ONyn2wCzno","date":"Thu Mar 24 18:56:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"COVID has slowed progress in the fight against TB, a preventable and curable disease. We must invest in more equitable care to put an end to the TB epidemic.\n\n#WorldTuberculosisDay","date":"Thu Mar 24 16:31:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looking for a summer internship? Our Madison, WI office is hiring! \n\nClick here to learn more, and be sure to fill out an application before April 15: https://t.co/icXJxJHmSr","date":"Thu Mar 24 15:44:19 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I was proud to work with Dane County on securing $200,000 in federal funding for @MiCentro to expand its facilities and continue providing key services to our Latino communities. \n \nThanks for having me today! https://t.co/vDrKZQyHeK","date":"Wed Mar 23 20:52:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Center for Black Excellence will inspire the next generation of leaders, and foster talent right here in Madison. \n\nI was honored to advocate on behalf of The Center, securing $1,00,000 in federal funding for the project. https://t.co/S7yBMgWqr0","date":"Wed Mar 23 19:01:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In the 12 years since President Obama signed the Affordable Care Act, millions have been covered and lives have been saved. \n\nHealthcare is a right, and we must continue working to see that it’s guaranteed for all. https://t.co/p52QzMb753","date":"Wed Mar 23 14:03:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Men's Homeless Shelter in Madison will offer safety and opportunity to men facing homelessness in our city.\n\nI was proud to advocate for this $2M investment and thank @MayorOfMadison for her support. https://t.co/BBC1ZjUZmF","date":"Tue Mar 22 20:28:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can I get uhhhh separation of church and state?","date":"Tue Mar 22 18:54:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today I joined Reedsburg City Administrator Tim Becker to visit the site of a new community center that recently received $220,000 in federal funding. I was proud to advocate for this investment, and know it will serve the community well.","date":"Tue Mar 22 18:52:23 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@StatelineBGC invests so much in our children; I wanted to invest back in them. \n\nI was proud to secure $500,000 for this vital organization.\n\nThank you for hosting me today, and I look forward to seeing the impact you’ll have on our community. https://t.co/zLnTwMbl1U","date":"Mon Mar 21 23:14:48 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank you @StateRepHong and @RepKristina for inviting me to revisit my roots today and express my support for the reintroduction of the Economic Justice Bill of Rights. \n\nI appreciate your work to advance commonsense priorities shared by Wisconsinites. https://t.co/ns63kD5ide","date":"Mon Mar 21 19:41:48 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The demolition of 38 homes in the Palestinian village of al-Walaja in East Jerusalem must be stopped. \n\nI joined my colleagues in urging @SecBlinken to prevent this displacement, promote peace, and protect Palestinians' rights.","date":"Mon Mar 21 19:27:40 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In this throwback #MagicMonday, I show how important the ace is in poker. \n\nThis week, I'll be touring the district highlighting some of the *aces* we got in the omnibus @POTUS signed last week.\n\nhttps://t.co/B1d0t3iVCi","date":"Mon Mar 21 16:03:09 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Earlier this week, the @LaborCaucus and I met with representatives from @SBWorkersUnited, an inspiring group of young leaders. \n\nI stand in solidarity with you. Keep up the good fight! https://t.co/fg99tIpNBX","date":"Fri Mar 18 20:15:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Fridays are for the (good) boys. https://t.co/YesxOPXPOg","date":"Fri Mar 18 18:44:02 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Shalanda Young is a trailblazer in more ways than one. Congratulations, my friend!","date":"Thu Mar 17 19:35:26 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Upset about the rising cost of gas and corporate price gouging? \n\nJust wait until you hear about what they've done to insulin.","date":"Thu Mar 17 17:38:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/obzHVeMjqJ","date":"Wed Mar 16 21:57:21 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Inappropriate comments from the GOP rarely shock me anymore, but in what universe is it ever okay to question a 14-year-old on the record about their genitalia?","date":"Wed Mar 16 17:59:16 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"President Zelenskyy's call for peace has never been more urgent. War begets war. We must continue pressure on Russia in order to ensure a safe Ukraine.","date":"Wed Mar 16 13:56:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I wonder why @SenRonJohnson voted \"NO\" to confirm this amazingly talented woman and friend as OMB Director? \n\n14 Republicans supported her... but not Johnson.\n\nhttps://t.co/2LbprwfpSV","date":"Tue Mar 15 21:38:28 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Gas companies are raking in giant profits, pointing their fingers in another direction, and forcing you to bear the burden.\n\nThe cost of oil isn’t driving prices up. Corporations are. https://t.co/IAspL5hshb","date":"Tue Mar 15 20:09:10 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If we can't #TaxTheRich on earth, can we at least start charging an atmosphere re-entry fee for joyrides?","date":"Tue Mar 15 19:32:29 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The #WageGap has no basis in work performance. It was born out of systemic discrimination. \n\nIt’s not hard to understand: women should receive equal pay for equal work. \n\n#EqualPayDay","date":"Tue Mar 15 16:06:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"And yet oil moguls are continuing to raise their prices? Burdening consumers who will blame it on the president? \n\nYou're kidding. https://t.co/9SdxJCYmih","date":"Mon Mar 14 17:15:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s that time of year! As many of you put together your March Madness brackets, this throwback #MagicMonday is all about choices and predictions. Good luck, and go badgers! \n\nhttps://t.co/rRheqZapXj","date":"Mon Mar 14 16:57:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s been a year since every Republican voted against jobs, vaccines, economic growth, and recovery. \n\nWhether they like prosperity or not, the #AmericanRescuePlan is working. https://t.co/EFkyw0TjfL","date":"Fri Mar 11 18:52:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"So @SenRonJohnson opposed marriage equality, opposed non discrimination in the workplace for the LGBTQ+ community, and claimed AIDS was “overhyped.” \n\nRon, let’s add a few subjects IF you ever return my call.","date":"Fri Mar 11 16:29:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Don’t forget to set your clocks an hour forward this Sunday!\n\nUnless you’re a member of the GOP, then yours may need to be adjusted forward by about 50-70 years.","date":"Fri Mar 11 15:31:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I just don’t understand why a US Senator wouldn't return a call from a Member of Congress from his own state — unless it’s because of the increasingly homophobic behavior of @SenRonJohnson. It's been a week and the courtesy of a callback has still not happened.","date":"Thu Mar 10 20:32:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last night, the House passed a government funding bill that includes more than $45M to support community projects I advocated for right here in WI-02.\n\nHere's a look at what's headed our way:\n\nMore: https://t.co/I5ySzUN3g2 https://t.co/KQLtUxiSKk","date":"Thu Mar 10 17:55:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I fought to keep the money Wisconsin was committed and promised.\n\nhttps://t.co/gU9xn9jaht","date":"Thu Mar 10 15:32:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hey Ron, still waiting for your call... I promise you can't catch gay over the phone. Senator Baldwin calls back quite quickly. \n\nI look forward to hearing from you. XOXO.\n\n- Your pal, Mark.","date":"Wed Mar 09 20:23:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This historic government funding package is huge for Wisconsin and the US. These investments will lower the cost of living for working families, create jobs, and tackle some of our biggest challenges from expanding access to affordable healthcare and mitigating climate change. https://t.co/vV4ylxYUmY","date":"Thu Mar 10 03:39:10 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Glad we could help protect Wisconsin's $225 million and the work @GovEvers is doing to aid our state's recovery.","date":"Wed Mar 09 21:43:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These images are heartbreaking. Real people with real lives are living under siege because of Putin’s unprovoked war — a war that must come to an end. \n\nIt’s time to provide the Ukrainian people with much-needed humanitarian relief.","date":"Wed Mar 09 21:37:47 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hey Ron, still waiting for your call... I promise you can't catch gay over the phone. Senator Baldwin calls back quite quickly. \n\nI look forward to hearing from you. XOXO.\n\n- Your pal, Mark.","date":"Wed Mar 09 20:23:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's been five days since I first called @SenRonJohnson's office for a call back from my colleague. Three calls later and still no response???","date":"Tue Mar 08 15:06:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last year, Democrats passed the #AmericanRescuePlan which lifted hundreds of thousands of children out of poverty and gave parents an opportunity to return to the workforce. \n\nIt’s not hard to see: making the Child Tax Credit permanent is the right thing to do.","date":"Tue Mar 08 14:51:32 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every day, I’m inspired by the driven women who serve alongside me in Congress, working tirelessly to make our communities better. \n\nThis #InternationalWomensDay, we continue the march toward equality, because women’s rights are human rights. https://t.co/tmZVHHJo7I","date":"Tue Mar 08 14:02:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The kids are alright. \n\n#LetFreeFloridaSayGay 🏳️‍🌈","date":"Mon Mar 07 21:21:16 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Money might not grow on trees, but when you own a small business print shop, you can do some pretty magical things. Enjoy today’s throwback #MagicMonday! \n\nhttps://t.co/UknfkKo5rR","date":"Mon Mar 07 16:57:20 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For anyone not keeping track, that's 7 million since @POTUS was sworn in.","date":"Fri Mar 04 15:03:22 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"At the risk of sounding too cheesy… Con-grate-ulations to the sharp contestants from WI-02 who were recognized in the 2022 World Champion Cheese Contest! 🧀\n\nGouda job – we’re dairy proud of you. \n\nhttps://t.co/aQjm0rSnSr","date":"Thu Mar 03 20:53:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For many workers who sign contracts, forced arbitration clauses are hiding in plain sight, silencing sexual assault survivors.\n \nToday, @POTUS will sign the Ending Forced Arbitration Act, ensuring every survivor can finally pursue justice.","date":"Thu Mar 03 19:46:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From my mother, to teachers, to elected leaders, and friends, I wouldn't be half the man I am if it weren't for the strong women around me. \n\nHappy #WomensHistoryMonth. https://t.co/vIUzDJeG2V","date":"Thu Mar 03 17:08:50 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My Dad was a likable local elected official who wanted to help people &amp; a small biz owner who died too young. My Mom was also a small biz owner w/ a knack for getting things done. Corinne passed away last night at 93 after a brief fight with pneumonia &amp; Covid. I’ll miss you, Mom. https://t.co/CnGUCISbkp","date":"Wed Mar 02 13:49:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We are stronger today than we were a year ago. \n  \nAnd we will be stronger a year from now than we are today. \n\nThe State of the Union is strong — because you, the American people, are strong. #SOTU22 https://t.co/JXNkitMusB","date":"Wed Mar 02 03:15:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Common sense gun safety laws don't infringe on the Second Amendment. They save lives.\n\n#SOTU22","date":"Wed Mar 02 02:56:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A year ago, vaccination rates were low and many school doors were still closed. \n \nThanks to @POTUS, who took a strong but compassionate approach to the pandemic, 99% of schools are open and hundreds of millions of Americans have been vaccinated.\n \n#SOTU22","date":"Wed Mar 02 02:49:37 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"Just last year, 55 Fortune 500 corporations earned $40 billion in profits and paid zero dollars in federal income tax.\" \n\nRead that again. Zero. #SOTU22","date":"Wed Mar 02 02:42:29 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"One thing all Americans agree on is that the tax system ain't fair.\" #SOTU22","date":"Wed Mar 02 02:39:52 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"Lower your costs, not your wages.\" \n\n#SOTU22","date":"Wed Mar 02 02:33:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The President has shown that his economic plans work. \n\nThese next steps will prove it yet again. #MadeInAmerica \n \n#SOTU22","date":"Wed Mar 02 02:33:20 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Betting against America is never a good bet. \n \n#SOTU22","date":"Wed Mar 02 02:25:49 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s been almost a year since we passed the #AmericanRescuePlan — a plan that put money in pockets, shots in arms, and people in jobs, leading to the fastest economic growth in 40 years. \n \n#SOTU22","date":"Wed Mar 02 02:21:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"In the battle between democracy and autocracy, democracies are rising to the moment, and the world is clearly choosing the side of peace and security.\"\n\n#SOTU22","date":"Wed Mar 02 02:21:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Gableman’s incompetent investigation was an amateur clown show from the beginning. This enormous waste of tax dollars was a national embarrassment yielding nothing but attacks on our democracy. It’s time for the GOP to end this charade and start working for the American people.","date":"Tue Mar 01 21:39:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The sky is blue. \n\nThe Earth is round. \n\nAnd #climatechange is happening now. \n\nThere is no debate — we need to act now, too much is at stake. https://t.co/c17ILttayX","date":"Mon Feb 28 21:15:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"History in the making.\n\nJudge Jackson has been a champion for equality throughout her career, and I have the utmost confidence she will continue to protect the rights of all Americans. I urge the Senate to confirm her nomination without delay. https://t.co/heKFD8F6HG","date":"Fri Feb 25 20:53:39 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A year after the House passed the Equality Act, efforts to persecute and ostracize LGBTQ+ individuals across the country are still pervasive. \n\nIt’s time for the Senate to reinforce our shared belief that hate can’t beat love.","date":"Fri Feb 25 14:57:28 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I stand with #Ukraine and its people.\n\nThe US &amp; our allies must continue to pursue peace, hold aggressors accountable &amp; provide humanitarian relief to those impacted by unnecessary violence. The global community must work toward peace &amp; avoid any escalation in military action.","date":"Fri Feb 25 01:35:23 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Gov. Abbott recently signed a CRT bill into law under the notion that parents know what’s best for their kids. I guess that doesn't apply when it comes to gender affirmation procedures. \n\nAttacks on transgender children have no place in this country.\n\nhttps://t.co/L2ojdXvAi8","date":"Wed Feb 23 17:54:05 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When we work together to support public education, opportunity is unlocked and every kid is given a chance to excel. \n\nThis week, my colleagues and I introduced a resolution honoring Public Schools Week 2022. \n\nWhat have public schools done for you? https://t.co/zhqi0fhrej","date":"Tue Feb 22 18:39:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Stay safe today! \n\nhttps://t.co/hPT6BeXeW1","date":"Tue Feb 22 18:22:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Inequity is a policy choice.","date":"Fri Feb 18 18:05:23 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ivermectin hasn't proven to reduce severe COVID cases. \n\nThe good news? Free, accessible vaccines do! If you're still holding out, there's no better time than the present to #GetVaccinated. \n\nhttps://t.co/puCD9Xwhxx","date":"Fri Feb 18 17:51:26 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Republicans are working tirelessly to remove harm from our kids schools, banning books that talk about race and lesson plans that foster inclusivity.\n\nWhat… Did you expect to see real threats like guns on that list?","date":"Fri Feb 18 16:39:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Success!\n\nhttps://t.co/REu9iPUhXF","date":"Wed Feb 16 21:27:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Being anti-inclusivity, acceptance, and diversity is one thing, but pushing your demagoguery on young people is worse.\n\nBans like these do nothing to make our schools safer. Rather, they could lead to harmful feelings of isolation among LGBTQ+ youth.\n\nhttps://t.co/8rnMS9QqwI","date":"Wed Feb 16 19:53:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Republicans love to talk about inflation, but their actions prove it's all just talk.\n\nThey can't be bothered to vote on federal reserve nominees who could help reduce inflation. Or even come to the table on bills to relieve inflationary pressure. They refuse to do their jobs.","date":"Wed Feb 16 17:20:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/pewT0qSZTA","date":"Tue Feb 15 21:45:17 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ope — it's National Wisconsin Day! Will I be celebrating America’s Dairyland with some cheese curds and local brews? You betcha 😉🧀🍻\n\nWhat’s your favorite part about the Badger State? ⬇️ https://t.co/0RZiCLb1WJ","date":"Tue Feb 15 20:26:20 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our nation’s runaway defense spending which lines the pockets of defense contractors must end.\n\nIn August, I sent a letter to the @FTC underlining the dangers of military contractor monopolies, including this mega-merger. I’m glad to see real action is being taken.","date":"Tue Jan 25 17:12:53 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I had a different speech prepared today—about the Equality Act and what it would mean to me &amp; my husband of 16 years, Phil.\n\nBut then the @GOP showed just how willing they are to attack their colleagues, trans kids, &amp; put their prejudice so openly on display.\n\nThey are bigots. https://t.co/ABOQGNfkYM","date":"Thu Feb 25 20:33:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As the US and Canada prepare to face off in the women’s hockey final, we’re all rooting for the Badgers 🦡🏒\n\nNo matter the outcome tonight, five women from @BadgerWHockey will become gold medalists. Proud of you all, and looking forward to a great game!\n\nhttps://t.co/9X0SJ1vy0b","date":"Tue Feb 15 15:33:23 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Still need a last-minute Valentine? \n\nI’ve got you taken care of with a few templates — perfect for that special someone 💕 https://t.co/8Xx5umRjKO","date":"Mon Feb 14 21:00:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"“He loves me, he loves me not” is usually played with flowers, but in this throwback #MagicMonday, let’s try it with cards. Think we’ll end up with any hearts this Valentine’s Day? ♥️🃏🪄\n\nhttps://t.co/cd59YwGigT","date":"Mon Feb 14 17:23:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wishing a happy birthday to my great friend, @SenatorBaldwin! 🎉\n\nWisconsin is lucky to be represented by someone who embodies authenticity, dedication, and service. Thank you for all you’ve done to pave the way for progressive values in Congress and back home. https://t.co/2qyUhOGQKc","date":"Fri Feb 11 20:10:55 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations on your well-earned retirement, @TommyThompsonWI! Thank you for leading with an unwavering commitment to keeping our community safe during a difficult time for our state and the @UWSystem. \n\n#OnWisconsin \n\nhttps://t.co/IPr45mDCOp","date":"Fri Feb 11 16:38:26 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can't wait to hear a staunch defense of flushing documents from the \"but her emails\" crowd. \n\nhttps://t.co/4BzdI3M4aF","date":"Fri Feb 11 16:30:52 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Childcare is infrastructure.","date":"Fri Feb 11 14:33:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Bravo, Nick! Making Madison proud!\nhttps://t.co/YKvevT6Fll","date":"Fri Feb 11 01:29:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Inflation makes a great scapegoat for corporate greed.\n\nThread ⬇️","date":"Thu Feb 10 20:52:54 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Making Wisconsin proud!","date":"Thu Feb 10 18:48:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Electric vehicles are a critical way to reduce carbon pollution. Today, the @WhiteHouse announced Wisconsin will receive over $11 million to invest in EV charging infrastructure, all thanks to the bipartisan infrastructure bill. https://t.co/47xumyy3vb","date":"Thu Feb 10 18:18:17 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Around the world, we’ve seen a shocking uptick in violence against the LGBTQ+ community. \n\nI proudly voted in support of the #GlobalRespectAct because we must extend our commitment to protecting these individuals beyond our borders. https://t.co/0CKtqxQZ0p","date":"Wed Feb 09 16:59:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"While wages are rising and jobs are being created at a historic rate, women in particular are still being held back from returning to the workforce. \n\nWe can’t unlock our full economic potential until we make childcare accessible and affordable for all.\n\nhttps://t.co/AFaPijIX2j","date":"Tue Feb 08 18:09:13 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Victims of sexual abuse already face enough hurdles which stop them from sharing their stories; fine print shouldn’t be one of them. \n\nI was proud to vote for the #EndForcedArbitration Act and put the power back into the survivor's hands.","date":"Tue Feb 08 00:32:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What an absolute slap in the face to Amazon’s blue-collar delivery drivers and warehouse workers who keep the company running. \n\nIf the foundation of your company relies on food stamps to get by, you’re likely giving a raise to the wrong people. \n\nhttps://t.co/TORlflGgm3","date":"Mon Feb 07 21:56:01 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As families brace for the second month without payments, here’s your reminder that 100% of House Republicans voted against extending the Child Tax Credit.","date":"Mon Feb 07 21:34:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It can be hard to follow what’s going on in Washington when all you see are snippets — I want to make sure you get the bigger picture. Enjoy today’s throwback #MagicMonday!\n\nhttps://t.co/jx44IOSbEw","date":"Mon Feb 07 17:14:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS, I urge you to use your pardon power to free Leonard Peltier. It could save his life. https://t.co/bgKZRmZToR","date":"Sun Feb 06 22:04:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I agree. It's time to free Leonard Peltier. https://t.co/JirCl4cQYO","date":"Fri Feb 04 21:32:42 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"With 6.6 MILLION jobs added in the last year, it's clear the president's economic plan is working. \n\nJoe Biden is the jobs guy. https://t.co/Tc3Kxb6ebz","date":"Fri Feb 04 19:24:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need answers to why a US citizen died at an Israeli military checkpoint.","date":"Fri Feb 04 18:49:39 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"By investing in our supply chains, increasing our manufacturing capacity for critical goods on American soil, and strengthening our scientific and technological leadership, we’re putting America in the best position to increase our global competitiveness. \n\n#AmericaCOMPETES","date":"Fri Feb 04 17:52:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Marijuana should be legalized. RT if you agree.","date":"Fri Feb 04 15:07:43 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As a card carrying union member myself, consider me on board! #1u","date":"Fri Feb 04 00:02:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The images from January 6 left a stain on our country, but we can’t let the stealthier attempts to install fraudulent electors and overturn our elections go by unnoticed or unpunished. https://t.co/dECrv9ASYu","date":"Thu Feb 03 18:19:46 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Money might not be able to buy you happiness, but for the right price, it can knock down historic bridges if your yacht’s too big to pass. Apparently.","date":"Thu Feb 03 15:23:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is exactly why I asked the DOJ to investigate these fraudulent electors and their organized attempt to subvert democracy. \n\nWe must ensure this can never happen again, because trust me, they'll try.","date":"Wed Feb 02 19:20:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our country’s incarcerated population is often treated as less than human. While denying them voting rights, mapmakers love to count large prison populations in their gerrymandering schemes. These are people with homes of their own; they shouldn’t be treated like political pawns.","date":"Wed Feb 02 15:53:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wondering why gas prices are high? \n\nBefore you blame the president, take a look at Exxon’s $9B fourth quarter profit. Price gouging is okay when it’s making your shareholders even richer, right? Gimme a break 🙄\n\nhttps://t.co/0RaCyupIZp","date":"Tue Feb 01 23:21:19 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A reminder this #BlackHistoryMonth: actions speak louder than words. \n\nLet's use this month to do more than merely talk about injustice; let’s spend each day addressing systemic inequities by securing voting rights, raising the wage, ensuring access to childcare, and more.","date":"Tue Feb 01 15:07:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Who’s ready for some curling!? \n\nI can’t wait to cheer on these Madison locals in just a few days. #Beijing2022","date":"Mon Jan 31 19:31:49 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"82 years ago, the first #SocialSecurity check went out, beginning a promise between generations. Through the Social Security 2100: A Sacred Trust Act, we will ensure this program continues to serve our country for years to come! https://t.co/PEDLTlVOyG","date":"Mon Jan 31 19:03:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"One of my all-time favorite #MagicMonday guests was @RepLowenthal. Enjoy this throwback trick!\n\nhttps://t.co/pAWWEG1Weq","date":"Mon Jan 31 16:28:45 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"🟩⬜️⬜️⬜️⬜️\n🟩⬜️⬜️⬜️⬜️\n🟩⬜️⬜️⬜️⬜️\n🟩⬜️⬜️⬜️⬜️\n🟩🟩⬜️⬜️⬜️\n🟩🟩🟩🟩🟩\n🇺🇸🇨🇳🇮🇳🇷🇺🇬🇧\n\nNot wordle. Just massive US defense spending compared to other countries.","date":"Fri Jan 28 21:28:44 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm glad the @January6thCmte is taking the issue of fraudulent electors seriously and I look forward to the DOJ continuing its investigation. \n\nThis should have never happened and should never happen again.","date":"Fri Jan 28 19:53:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The last thing you should have to worry about on your commute to work, your drive to visit family, or your trip to grab groceries is whether your roads and bridges will hold up. \n\nGrateful for incoming infrastructure investments, and wishing a quick recovery to all injured today.","date":"Fri Jan 28 19:05:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On Holocaust Remembrance Day, we mourn the lives lost and families torn apart during one of the darkest times in history. Today, we recommit our pledge to fight antisemitism and all forms of hatred. #NeverAgain","date":"Thu Jan 27 19:34:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"“President Biden’s first year in office was the strongest year for economic growth since 1984. Here’s why that’s bad for Biden:” - Right-wing media any minute now (probably)","date":"Thu Jan 27 17:37:54 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"They're not even trying to hide that death and destruction = profitability. \n\nQuite the business model, Raytheon 🥴","date":"Thu Jan 27 17:01:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Alternate headline: Trillion dollar company relying on taxpayer dollars to pay employees 🙄\n\nhttps://t.co/ZV6Jc2SLjo","date":"Wed Jan 26 21:10:09 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our work in Congress should be focused on service, not our own stocks. https://t.co/rWap5qLFYN","date":"Wed Jan 26 20:06:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The virus doesn’t recognize borders. It doesn’t care what country you’re from. If we want to defeat COVID, we must vaccinate the world. \n\nhttps://t.co/VButYNPkIz","date":"Wed Jan 26 18:57:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Justice Breyer served the court with pragmatism, integrity, and optimism. I congratulate him on a well-earned retirement.\n\nhttps://t.co/FHq8vpXGBW","date":"Wed Jan 26 17:36:37 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good.\n\nhttps://t.co/7ZwaPzo1mx https://t.co/EdJDmzXNZ4","date":"Tue Jan 25 22:03:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Omar Abdalmajeed As’ad’s death after being detained during a raid on an occupied West Bank village is a tragedy that demands answers. We need an investigation into how his death happened and why.\n\nhttps://t.co/UpuByQv7V6","date":"Tue Jan 25 21:43:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Republicans tried and failed to undermine the #CleanAirAct in Congress. Now, they're trying to get the Supreme Court to do it for them. \n \nI’m joining 190+ of my Democratic colleagues in asking the Supreme Court to defend life-saving clean air protections.","date":"Tue Jan 25 20:02:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Read my full letter here: https://t.co/z5wYxvSdi7","date":"Tue Jan 25 17:15:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our nation’s runaway defense spending which lines the pockets of defense contractors must end.\n\nIn August, I sent a letter to the @FTC underlining the dangers of military contractor monopolies, including this mega-merger. I’m glad to see real action is being taken.","date":"Tue Jan 25 17:12:53 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"You've got to be kidding me. https://t.co/fD7WG04m8X","date":"Tue Jan 25 16:47:31 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Union busting is disgusting 🤢","date":"Tue Jan 25 02:10:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Grateful for a @POTUS who knows that every worker deserves to be paid a living wage and treated with dignity. #RaiseTheWage\n \nhttps://t.co/c7Twf4TboM","date":"Mon Jan 24 21:25:53 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Signing this letter was a no-brainer. \n\nMembers of Congress should be focused on their constituents  — not advancing their own stock portfolios.","date":"Mon Jan 24 18:35:32 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Whether I’m in Washington or Wisconsin, the most important part of my job is listening to constituents — just like in today’s throwback #MagicMonday!\n\nhttps://t.co/byMXKhKkgK","date":"Mon Jan 24 18:17:57 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you made $1 million per year, you’d have to work 1,000 years to earn what these billionaires made in a day. Oh yeah, and they made that much during a global pandemic. \n\n#TaxTheRich","date":"Sat Jan 22 20:10:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Nearly 50 years after #RoevWade was decided, the right to choose is under attack once again. \n\nWe must pass the Women's Health Protection Act and remember that #Roe is the floor, not the ceiling. https://t.co/jqshV4r4PJ","date":"Sat Jan 22 16:11:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I sent a letter to U.S. Attorney General Merrick Garland urging him to investigate the ten individuals who fraudulently claimed to be electors from Wisconsin in an attempt to overturn the 2020 election.\n\nhttps://t.co/a5BdsUXmG6 https://t.co/SHEuqWIOA6","date":"Fri Jan 21 15:56:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In the first year of the Biden Administration, @HouseDemocrats worked with @POTUS to deliver for everyday Americans. Now, we turn our focus to the next year — there’s important work to be done. \n\nhttps://t.co/8ZBGuZXMd2 https://t.co/B0dRjgEf6e","date":"Thu Jan 20 16:25:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This you? 🤔 https://t.co/MEG6ewZqpE","date":"Thu Jan 20 16:13:35 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last night, in the cover of darkness &amp; freezing cold, the homes of the Salhiyeh family in Sheikh Jarrah, Jerusalem, were destroyed by Israeli forces leaving 15 people homeless. This is unacceptable and must end. #SaveSheikhJarrah\n    https://t.co/DrpsXceAaR","date":"Wed Jan 19 20:33:24 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Give the people what they want! #taxtherich\n\nhttps://t.co/599bt5lfrb","date":"Wed Jan 19 14:38:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/fYKekQ2DcG","date":"Tue Jan 18 20:59:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Starting today, each household can now order four rapid #COVID tests at ZERO cost. \n\nVisit https://t.co/vqUjCg7bIe to place your order, or visit https://t.co/YZQfuNs413 for more information on testing sites near you and test reimbursements through insurance. https://t.co/5M9peJHVpC","date":"Tue Jan 18 20:56:22 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last year, America saw the greatest job growth in our nation’s history. \n\nThat’s not by accident. That’s what leadership looks like. Thank you, @POTUS.","date":"Tue Jan 18 20:09:59 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We’re almost a year into the Biden Administration, and while there’s a lot left on the to-do list, it’s clear that one party is focused on progress while the other is focused on obstruction. https://t.co/yEkN9sOKLL","date":"Tue Jan 18 17:24:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hey @Amazon, you missed a quote:\n\n“The labor movement did not diminish the strength of the nation but enlarged it,\" -Martin Luther King Jr., the union supporter.","date":"Tue Jan 18 14:53:05 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On this day of action, we honor the life and legacy of Dr. King — recommitting ourselves to daily the fight for justice. \n\nIt’s time for Congress to pass the #VotingRightsAct. https://t.co/ISfFJvEJKm","date":"Mon Jan 17 17:32:46 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Watching what is happening in Texas at Congregation Beth Israel. Hoping for a quick and peaceful resolution. https://t.co/ASRIhkbHPt","date":"Sun Jan 16 00:09:48 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Taking bets ‼️ How many Republicans do we think will “honor” Dr. King's legacy this weekend by posting a hand-selected quote that fits their agenda, all while doing nothing to advance voting rights legislation?","date":"Fri Jan 14 20:24:02 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, more than 30 million families are without the #ChildTaxCredit for the first time in months — all because the #BuildBackBetter Act is stalled in the Senate. \n\nNeed a reminder on the importance of these payments and the countless ways they were helping everyday families? 👇","date":"Fri Jan 14 19:42:39 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Having reliable, affordable health insurance is more important than ever during the COVID19 pandemic. Visit https://t.co/9gKhjrHnXA to #GetCovered before the deadline ends TOMORROW, January 15.","date":"Fri Jan 14 18:23:10 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week, the @WhiteHouse announced the country’s largest bridge investment since the construction of the interstate highway system. \n\nWho’s ready? 🙋‍♂️ https://t.co/1BJpplhxnh","date":"Fri Jan 14 16:50:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Seems like a good time to remind folks that a life appointment to the Supreme Court only requires 51 votes in the Senate 👀","date":"Thu Jan 13 19:48:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good trouble. Necessary trouble. \n\n#FightForVotingRights","date":"Thu Jan 13 16:42:50 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Inciting an insurrection is unpresidential. Asking for votes to be “found” is unpresidential. Destroying relationships with our allies is unpresidential. \n\nCalling for democracy to prevail? Yeah, that’s my president.","date":"Wed Jan 12 19:05:14 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Betsy DeVos bought herself a cabinet seat and used her position to defund Special Olympics and push her anti-public school agenda. \n\nThought she couldn’t get worse? Think again 🤪 \n\nhttps://t.co/1TpI6edxeS","date":"Wed Jan 12 18:01:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I see a lot of Republicans tweeting about inflation today, but few suggesting plans to actually help. \n\nIf only there was a piece of legislation sitting in the Senate that 17 Nobel-winning economists agreed would ease longer-term inflationary pressures...\n\nhttps://t.co/x4556fLce5","date":"Wed Jan 12 16:51:46 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"Will we choose democracy over autocracy, light over shadow, justice over injustice? I know where I stand. I will not yield. I will not flinch. I will defend your right to vote and our democracy against all enemies, foreign and yes, domestic.\"\n\n- @POTUS","date":"Tue Jan 11 21:40:25 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As @POTUS just said, \"The right to vote is a fundamental right from which all other rights flow.\" \n\n#RestoreTheVote","date":"Tue Jan 11 21:37:38 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It ain’t rocket science: if we don’t secure the right to vote, democracy is in danger. It’s on us to protect #VotingRights. No matter what it takes. https://t.co/vXkpECQLdK","date":"Tue Jan 11 18:16:36 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Be smart. Get vaccinated. Do your part to keep Wisconsin safe. \n\n@RWHC https://t.co/IXHT0X3WYf","date":"Mon Jan 10 20:58:13 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last week, 39 million Americans began receiving their #ChildTaxCredit payments. \n\nI asked you to tell me how these payments would benefit you and your family. Here's what you had to say ⬇️ https://t.co/018VKv7lrg","date":"Thu Jul 22 19:00:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Americans are tired of watching CEOs get richer every day while telling their workers they can’t afford to pay them a living wage. \n\nEveryone deserves to be treated with respect, dignity, and fairness in the workplace. This is more than a moment. It’s a movement.","date":"Mon Jan 10 20:01:28 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you argue that we can’t afford to invest in our planet because the “cost is too high,” I have to ask: the cost compared to what? \n\nWe're already spending billions on relief; it's time to invest in prevention. The Senate must #BuildBackBetter.\n\nhttps://t.co/DzzEaeB5zN","date":"Mon Jan 10 19:07:07 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Live look at Jim Jordan: https://t.co/99LO2R8bIK","date":"Mon Jan 10 16:51:22 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ve been a small business owner since I was 23, so the printing business is in my blood. Enjoy today’s throwback #MagicMonday to find out how it’s in my tricks too! \n\nhttps://t.co/8Dx6eTPHVj","date":"Mon Jan 10 16:34:55 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Low temperatures can make it tempting to gather inside, but with Omicron surging statewide, we need to take steps to prevent spreading COVID and overwhelming our hospitals. If you haven't already, please #GetVaccinated  — and boosted!  \n\nhttps://t.co/kzWWSfczqr","date":"Fri Jan 07 20:16:04 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"BREAKING: According to GOP, jobs are... bad for the economy?","date":"Fri Jan 07 15:38:33 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"And we're live! Join me on Facebook now: https://t.co/acHf8t19mv https://t.co/p20KmM2RDZ","date":"Fri Jan 07 00:36:51 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When Trump's goons attacked the Capitol, disrespected our law enforcement, and chanted \"Hang Mike Pence,\" Republicans shared our anger and disbelief. \n\nNow? It's all crickets from the so-called \"party of law and order.\"","date":"Thu Jan 06 21:48:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My statement on the anniversary of the January 6th insurrection: https://t.co/KPAvoiKwBD","date":"Thu Jan 06 19:40:00 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From those who stormed the Capitol, to those who incited violence from a distance, every person who participated in the January 6 armed insurrection deserves to be held accountable. \n\nRT if you agree.","date":"Thu Jan 06 18:17:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There's only one explanation as to why so many of the Republicans who condemned the violence of January 6 last year are silent today: they're afraid of their cult leader retaliating. \n\nI spoke with @JulieMason this morning about the grim anniversary of the attack on the Capitol. https://t.co/LJD3eBM5sc","date":"Thu Jan 06 17:20:37 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last year's armed insurrection wasn't a random gathering, and it sure as hell wasn’t a regular day of tourists visiting the Capitol. It was planned, organized, and incited by Trump and his sheep. \n\nHistory won’t forget.","date":"Thu Jan 06 14:11:34 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Reminder: I'll be going live on Facebook tomorrow night to answer your questions. Hope to see you then! \n\nhttps://t.co/ZX8Oom5G8N","date":"Wed Jan 05 21:49:39 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The rules have changed! Thanks to a new law, people now have new protections against surprise medical bills. \n\nGo to https://t.co/scZhMQbhSV to learn more! #NoSurpriseBills https://t.co/H56QmVXFoD","date":"Wed Jan 05 18:46:11 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congress pours trillions of taxpayer dollars into the Pentagon, and yet it is the ONLY federal agency that has never passed an audit.\n \nWe must pass the #AuditthePentagonAct and put an end to the culture of financial waste, fraud, and abuse.\n\nhttps://t.co/LvhII7V0Vl","date":"Wed Jan 05 17:30:41 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/ngItIsAiXs","date":"Wed Jan 05 17:06:03 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just took a DNA test, turns out I'm 100% in favor of taxing the rich","date":"Tue Jan 04 21:13:12 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Join me this Thursday at 6:30 CT for a Facebook Live Town Hall as we gear up for the second year of the 117th Congress. I'll be answering the questions that matter most to you, and marking the anniversary of the January 6th insurrection.\n\nhttps://t.co/acHf8t19mv https://t.co/1UmVuDFiZS","date":"Tue Jan 04 19:56:58 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"*sigh* https://t.co/I29HwIWVNi","date":"Tue Jan 04 17:42:55 +0000 2022","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Betty White could get anyone to laugh. An American icon - may she forever be Golden.","date":"Fri Dec 31 20:45:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Remember \"stand back &amp; stand by\"?\n\nWe saw this violent fascism coming, and the @GOP encouraged it.","date":"Wed Jan 06 19:37:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Here's to 2022! 🎉 https://t.co/tycmXKtUtl","date":"Fri Dec 31 02:30:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Proud to be an alum of this excellent university!","date":"Thu Dec 30 20:11:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A fighter till the end, Harry Reid was a champion in the Senate who helped bring affordable healthcare to millions. My thoughts are with his family tonight. https://t.co/zFsWNgOODB","date":"Wed Dec 29 01:38:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Vaccines save lives.","date":"Wed Dec 22 20:22:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you won’t listen to me and get vaxxed, listen to (and I can’t believe I’m saying this) Donald Trump.","date":"Tue Dec 21 17:12:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm sick &amp; tired of these kool-aid drinking Fox News hosts. \n\nDr. Fauci is a national treasure. \n\nJesse Watters is a disgrace.","date":"Tue Dec 21 15:25:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looking for an easy way to entertain your friends and family over the holidays? Join me for this throwback #MagicMonday to learn a trick that's sure to impress the whole table. \n\nhttps://t.co/FFXR6ouykT","date":"Mon Dec 20 15:39:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@SenSchumer is right to have a vote on BBB in January. The time for talk is over, it's time for action. A vote will show more than months of on-camera rhetoric: who is with their constituents &amp; who isn’t.\n\nI wouldn't want to be the one siding with special interests, would you?","date":"Mon Dec 20 13:04:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations Chris and Vann! I’m excited for you both on this new chapter in your lives.","date":"Sun Dec 19 23:30:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What a terrific team win by @BadgerVB!\n\nProud of these national champions 🏐❤️🦡 #OnWisconsin","date":"Sun Dec 19 03:54:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looking forward to the weekend? \n\nThank a union.","date":"Fri Dec 17 21:02:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you want to know what someone prioritizes, take a look at where they spend their money. \n\nIt’s beyond time to put #PeopleOverPentagon.\n\nhttps://t.co/BHOsOfFDEx","date":"Fri Dec 17 15:47:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a union. \n\nPass it on.","date":"Thu Dec 16 15:38:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wisconsin, we’re trending in the wrong direction. As many of us prepare for time with family over the holidays, give your loved ones the gift of caution. \n\nGet vaccinated, wear a mask, and get your booster shot. Let's spread joy; not COVID.\n\nhttps://t.co/3ucOCCfAaS","date":"Wed Dec 15 21:48:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In 2021 —\n\n💉 The CDC’s ANNUAL budget was just under $8 billion. \n\n💣 The Pentagon's WEEKLY budget was nearly $14 billion. \n\nTell me again... why shouldn't a pandemic that’s taken 800,000 lives in America be treated like the biggest threat to our national security? 🧐","date":"Wed Dec 15 20:01:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When Democrats say we're fighting #ForThePeople, we actually mean it.\n\nPayments from the #ChildTaxCredit have been a huge relief for families across Wisconsin, but we can’t let today’s be the last. \n\nLet’s make this tax cut permanent. https://t.co/sPKQ09DqkE","date":"Wed Dec 15 17:10:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s simple: Islamophobia is wrong. \n\nWrong when the KKK does it. Wrong when the Proud Boys do it. Wrong when Members of Congress do it.\n\nIt is our duty to stand up to discrimination, hatred, and intimidation. \n\n#StopIslamophobia","date":"Wed Dec 15 01:51:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Dick Wagner was a leader, an activist, and a champion for LGBTQ+ rights. Most importantly, he was a mentor and a friend. \n\nHis legacy will not soon be forgotten. https://t.co/aImuu6jxp6","date":"Tue Dec 14 23:36:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Make it make sense ¯\\_(ツ)_/¯","date":"Tue Dec 14 18:45:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From lowering prescription drug prices, to extending the child tax credit, to investing in climate change, the #BuildBackBetter Act will make real, tangible improvements in the lives of hardworking Americans. \n\nIt’s time for the Senate to act. Who's with me?","date":"Tue Dec 14 18:06:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The president’s #BuildBackBetter Act just passed the House and is on its way to the Senate! \n\nWondering what’s in this legislation that makes it life-changing for so many Americans? Here’s the scoop: https://t.co/46wgQfLwMT","date":"Fri Nov 19 14:55:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Clean drinking water is a right. Time to make it a reality. \n\nhttps://t.co/l5IUy6tQlV","date":"Mon Dec 13 19:45:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There are just two days remaining in open enrollment ‼️ \n\nDon't miss this window to #GetCovered before the new year with low rates thanks to the #AmericanRescuePlan.","date":"Mon Dec 13 17:04:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Big pharma has been taking advantage of Americans for too long. @HouseDemocrats are taking action.\n\nhttps://t.co/3J695zDxsb","date":"Fri Dec 10 13:46:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Great news! #1u ☕️","date":"Thu Dec 09 19:40:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"And I oop —","date":"Wed Dec 08 21:38:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"“You rang?” -Watson (probably) https://t.co/acjszXjt89","date":"Wed Dec 08 20:14:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s economics 101: when demand goes up and supply is low, prices are bound to increase. \n\nLet's talk inflation. https://t.co/yhhsi1qsew","date":"Wed Dec 08 19:21:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Cutting the Pentagon’s budget could help fight threats like COVID, climate change, and more. \n\nOur work to cut the Pentagon's budget and reallocate funds to help communities across the country is just beginning. The fight doesn't end tonight.","date":"Wed Dec 08 02:54:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"(•_•)\n&lt;)   )╯ I will not\n/    \\\n\n\\(•_•)\n(   (&gt;    vote to increase\n/    \\\n\n (•_•)\n&lt;)   )&gt;   the Pentagon’s budget\n /    \\","date":"Tue Dec 07 22:21:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Reminder: I'll be hopping on Zoom tonight at 7 CT to discuss my recent trip to Israel and Palestine. \n\nWI-02 residents, register to join at the link below ⬇️","date":"Tue Dec 07 17:25:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Need to #GetCovered? \n\nThe open enrollment deadline is December 15 for coverage beginning on January 1. Visit https://t.co/EMiQuEk3f4 today for help finding a plan that works for you and your family.","date":"Tue Dec 07 15:59:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wisconsin Republicans tried to punish schools that observed health and safety precautions during the pandemic, but thanks to @USEdGov, now *all* K-12 students in WI will benefit from this $500 million in #AmericanRescuePlan funding.\n\nhttps://t.co/5nKs5JQI9F","date":"Mon Dec 06 21:22:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #MagicMonday! In this throwback video, I share the power of something all Wisconsinites know to be magical: cheese 🧀\n\nhttps://t.co/uCDZuMLFRn","date":"Mon Dec 06 18:20:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just gonna leave this here 🥱\n\n#StudentDebtCrisis https://t.co/8gKH3N0cKP","date":"Mon Dec 06 17:37:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"*Jeopardy music plays in the background*","date":"Mon Dec 06 16:47:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'll be giving an update from my recent congressional delegation trip to Israel this Tuesday. After some brief remarks about my trip, I'll hold a Q&amp;A about my experience. WI-02 residents, sign up here to join: https://t.co/4VhAgZA4Sv","date":"Sun Dec 05 19:45:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I know five-year-olds who are better at hide-and-seek 🙄","date":"Fri Dec 03 20:29:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As you and your family begin making holiday plans, there’s one item we can’t afford to leave off the to-do list: getting vaccinated. \n\nCases and hospitalizations are climbing in Wisconsin, and it’s going to take all of us to end this pandemic for good. \n\nhttps://t.co/5Ug0PinSMN","date":"Fri Dec 03 18:56:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Republicans would rather shut down the government than deliver life-saving vaccines to Americans. Government funding is essential to strengthen our communities, care for our veterans, and protect our national security. It's time for Republicans to come to the table.","date":"Thu Dec 02 20:38:09 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every day it becomes more and more clear: #ClimateAction cannot wait. \n\nThe Senate must pass the #BuildBackBetter Act and make the largest climate change investment in our nation's history. There's no time to waste.","date":"Thu Dec 02 19:10:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We've still got a lot to learn about the omicron variant, but there are steps we can take to stay safe. It's not about politics; it's about doing what we can to protect our communities. Wear a mask, get vaccinated, and get your booster shot. https://t.co/Dl6fqRtxHf","date":"Wed Dec 01 21:40:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The right to bodily autonomy is not up for debate.\n\nReproductive freedom is not up for debate. \n\nThe right to choose is not up for debate.\n\nIt’s simple. #AbortionIsEssential","date":"Wed Dec 01 15:42:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I joined my colleagues in the Wisconsin delegation for a moment of silence to honor the victims of the Waukesha tragedy, this evening. My thoughts are with the families who lost loved ones and those still recovering. We will get through this. https://t.co/EIdAgefmwV","date":"Wed Dec 01 03:11:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, @POTUS signed the bipartisan Protecting Moms Who Served Act into law! I proudly voted for these critical investments to ensure our nation's veterans receive world-class maternal healthcare. https://t.co/nO4XbUe4QF","date":"Tue Nov 30 17:02:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"After years of fighting to deny people healthcare, the GOP's next goal is *checks notes* gatekeeping pre-k. \n\nhttps://t.co/mqXbmV1W7y","date":"Tue Nov 30 14:50:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@GOPLeader needs to spend less time trying to get in the record books for world's longest speech and more time actually leading his side of the aisle. Our constituents deserve representatives who act like adults. \n\nhttps://t.co/CFkkHuzVYi","date":"Tue Nov 30 14:21:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I meant what I said and I said what I meant.","date":"Mon Nov 29 21:13:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When Republicans try to out-crazy each other in the never ending battle to win Trump's affection: https://t.co/3ZRnM93mrB","date":"Mon Nov 29 19:44:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tune in soon — I'll be on @MSNBC with @GarrettHaake  in just a few minutes to discuss what's going on in Washington this week.","date":"Mon Nov 29 18:13:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Interested in interning with my Madison office? Don't miss out — applications are due this Wednesday, December 1.","date":"Mon Nov 29 17:07:07 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Monday morning after a holiday weekend can move pretty slowly. Let's kick off the week with a throwback #MagicMonday that'll wake you right up!\n\nhttps://t.co/xhqCzMNbab","date":"Mon Nov 29 15:50:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No one wrote a tune like Stephen Sondheim. Thank you for shaping musical theater for decades! https://t.co/YvLvhUiTAu","date":"Fri Nov 26 22:51:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wishing a Happy Thanksgiving to all celebrating! \n\nEnjoy this time with loved ones and eat a second (or third) helping of your favorite dish.","date":"Thu Nov 25 21:38:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The road towards justice is long, but today we took a step forward.\nhttps://t.co/PNaSEj218N","date":"Wed Nov 24 19:34:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This Thanksgiving season, I’m grateful @POTUS’s Build Back Better agenda is working — and that people are too!\n\nhttps://t.co/MRJyirWNkQ","date":"Wed Nov 24 15:50:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Sitting in holiday traffic serves as a great reminder that we need an infrastructure upgrade. From roads and bridges to broadband and clean water, here's a look at what's coming to Wisconsin: https://t.co/qOcGDXoQkk","date":"Wed Nov 24 15:17:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm grateful the system worked. Hate has no home in the United States and it's about time we let everyone know. \n\nhttps://t.co/AxvUDoPTKT","date":"Tue Nov 23 20:15:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As a journalism major, this grinds my gears. Local journalism is vital to a healthy democracy. I’m sick and tired of these hedge funds coming into states and towns like a pack of vultures, hollowing these companies out and all but shutting them down.","date":"Tue Nov 23 18:41:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Want a guaranteed return on investment? Look to the future and invest in the American people.\n\nhttps://t.co/fZsf01LaDd","date":"Tue Nov 23 17:48:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I led 25 of my colleagues in sending @SecBlinken a letter outlining our concerns with the Israeli Government’s efforts to advance settlements in the E-1 area near Jerusalem in the West Bank. Read more: https://t.co/c36fp3TEmK","date":"Mon Nov 22 21:41:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My office is hiring interns for the spring semester in Washington, DC &amp; in Madison, WI. The deadline for DC is November 15, and WI is December 1. Apply today! https://t.co/icXJxJHmSr https://t.co/pjmq44GA0o","date":"Wed Oct 13 21:24:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Defending human rights &amp; the environment in Colombia can be a death sentence. I stand with those who are working to preserve the one planet we have, and encourage the administration to do the same. #DefendEarthDefenders\n\nhttps://t.co/j4CnsqSXXx","date":"Mon Nov 22 21:40:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Alright US, it's our turn to do the same. \n\nhttps://t.co/dqnc4aZQ8G","date":"Mon Nov 22 20:01:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Don't just take it from me, take it from this defense industry worker: the Pentagon doesn't need a bigger budget.\n\nhttps://t.co/b4BgtyUvZU","date":"Mon Nov 22 17:09:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Do you hear that? It's the world's smallest violin playing for the ultra-wealthy who can't get their yachts fast enough. \nhttps://t.co/xGoq3QGHFO","date":"Mon Nov 22 16:31:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"With so many of us headed out of town for Thanksgiving, it can be hard to find things to do with all that travel time. In this throwback #MagicMonday I share my tip for passing the time during my travels. What's your go-to?\n\n https://t.co/qAyGd1rv7Z","date":"Mon Nov 22 15:55:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On to the Senate! https://t.co/jxzYzseoyn","date":"Sun Nov 21 17:54:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Birthday @POTUS! Thanks for working so hard for the #buildbackbetter act! Looking forward to getting if over the finish line. https://t.co/oXoX8qEjHx","date":"Sat Nov 20 18:54:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today is #TransDayOfRemembrance. \n\nI'm proud of my colleagues, @RepMarieNewman, @RepJayapal, and @RepWexton, along with the @LGBTQEqCaucus who are leading this effort to raise awareness for some of the most persecuted people in the LGBTQIA+ community.","date":"Sat Nov 20 17:18:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This might be a longer video than usual, but #BuildBackBetter is a bigger bill than usual. Let's talk about the ways this legislation will impact everyday Americans. https://t.co/tyoBT5kvt1","date":"Sat Nov 20 15:23:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It is wild to me that a teenager can cross state lines with an AR-15, murder two people in cold blood and call it self defense. The system didn’t serve justice and we need to work towards a day where murderers are punished for their crimes regardless of the color of their skin.","date":"Fri Nov 19 22:42:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What a week to be one of my Washington interns! Thank you for your hard work and dedication this semester. Everyone on the team appreciates all that you do. https://t.co/ARBBONzhvY","date":"Fri Nov 19 21:00:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When large corporations game the system to avoid paying taxes, it hurts small businesses like mine that follow the rules. \n\nThe #BuildBackBetter Act fixes that. https://t.co/bO4tIoCqH3","date":"Fri Nov 19 16:34:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The president’s #BuildBackBetter Act just passed the House and is on its way to the Senate! \n\nWondering what’s in this legislation that makes it life-changing for so many Americans? Here’s the scoop: https://t.co/46wgQfLwMT","date":"Fri Nov 19 14:55:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My statement on the House passage of the #BuildBackBetter Act: https://t.co/mK3ipwQDzB","date":"Fri Nov 19 14:47:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The childcare provisions where you don't have to pay more than 7% of your income -- saving families $1,000's a year!","date":"Fri Nov 19 04:55:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Kevin McCarthy auditioning for the adult table at Mar-a-Lago. https://t.co/Hj80apuTwK","date":"Fri Nov 19 04:35:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Two+ hours in, this is what Americans are thinking… https://t.co/dVZoV0b52U","date":"Fri Nov 19 04:09:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Which Kevin did it better? \nCc: @BBBaumgartner https://t.co/gH8zVgqYm0","date":"Fri Nov 19 03:47:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Is it just me, or did @GOPleader's hair have color when he started this speech?","date":"Fri Nov 19 03:37:09 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Unofficial @ratemyskyperoom score - 2/10. \nBackground too pale, too male, rhetoric a wee bit stale. And definitely GOP members playing candy crush behind you. https://t.co/OeoClZ5hMr","date":"Fri Nov 19 03:24:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Quite remarkable, really to see @GOPLeader stand upright for so long since he’s shown on so many occasions that he doesn’t have much of a spine.","date":"Fri Nov 19 03:10:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@GOPLeader’s actual audience. https://t.co/4KbrzLGmSy","date":"Fri Nov 19 02:57:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Live look at @GOPLeader on the floor right now. https://t.co/TICdhATM6x","date":"Fri Nov 19 02:21:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our children's children will have children by the time this speech is over.","date":"Fri Nov 19 02:17:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank god I didn't play the \"Mr. Speaker\" drinking game tonight.","date":"Fri Nov 19 02:13:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I think @GOPLeader has lied more times in this speech than there'll be dollars spent in the #buildbackbetter act.","date":"Fri Nov 19 02:06:19 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"🤔🤔🤔","date":"Thu Nov 18 22:20:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @CNN with @PamelaBrownCNN to discuss @HouseDemocrats will be passing the #BuildBackBetter act in just a few hours! Be sure to tune in! https://t.co/lrpTFNUGqB","date":"Thu Nov 18 21:14:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you’re waiting for a sign to #GetVaccinated, this is it. With the holiday season approaching, let’s all work together to protect our families and communities.\n\nhttps://t.co/z5TmJEjflC","date":"Thu Nov 18 15:30:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's officially 🚧 infrastructure decade 🚧 https://t.co/VCUYthxOX6","date":"Wed Nov 17 22:45:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Have we learned nothing from January 6th? \n\nRep. Gosar’s video was not funny – it was a call to arms and a violation of the oath he swore to protect.\n\nIt’s a shame it came to this and hopefully we learned our lesson that actions have consequences.","date":"Wed Nov 17 21:30:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Anyone else tired of hearing so-called “deficit hawks” make claims that we can’t afford to #BuildBackBetter while voting to authorize a defense budget 3x as big? 🙋🏼‍♂️\n\nThank you @SenSanders for speaking out against the military-industrial complex and the grip it holds on Congress.","date":"Wed Nov 17 20:46:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What has a starting salary of $72,000 and a 92% employment rate upon graduation? Registered Apprenticeships.\n\nIt would be a great day for the Senate to pass the #NationalApprenticeshipAct and create millions of new opportunities. #NAW2021","date":"Wed Nov 17 20:05:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Big oil has been making record profits while forcing Americans to pay more at the pump. @POTUS is looking out for us &amp; trying to get to the bottom of this deceptive behavior. https://t.co/LqjQ8sObm2","date":"Wed Nov 17 17:32:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The longer we fail to reach a 70% global vaccination rate, the longer COVID-19 will be able to mutate and produce dangerous variants. I joined @AppropsDems to discuss ways to speed up vaccine manufacturing and international distribution. \n\nhttps://t.co/UtmLLNk6de https://t.co/dS1uhQQdCt","date":"Wed Nov 17 16:58:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My guess is the Pentagon will find a way to make do with the largest amount of defense spending authorized in our nation's history. But that's just one man's opinion.","date":"Tue Nov 16 22:24:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tap to pause this gif and find out which of these #BuildBackBetter priorities will change lives for the better. \n\nSpoiler alert — it's all of them 😉 https://t.co/Ab85OwvZL0","date":"Tue Nov 16 20:50:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I came to Congress to create tangible improvements in the lives of everyday Americans. \n\nNow that the bipartisan infrastructure bill has been signed into law, it’s time to #BuildBackBetter and invest in the most important part of our nation — our people.","date":"Tue Nov 16 16:15:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS made a promise to improve infrastructure across the country. In less than a year, that vision was signed into law. \n\nWondering what’s in it for Wisconsin? ⬇️ https://t.co/WAAXzuw8EG","date":"Mon Nov 15 21:21:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The infrastructure bill is being signed today. \n\n#BuildBackBetter is set for a vote this week. \n\nBenefits of the #AmericanRescuePlan are continuing to pay dividends in restoring our nation and workforce. \n\nSay what you want, but #BidenDelivers. \n\nhttps://t.co/m5JKj7Ibi1","date":"Mon Nov 15 19:27:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The process of passing #BuildBackBetter has taken some attention off of the ways this impactful legislation will change lives. Just like in today’s throwback #MagicMonday, we often need to look beyond what we’re being told to focus on.\n\nhttps://t.co/hDnyaxSynJ","date":"Mon Nov 15 18:20:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, Wisconsin families are receiving payments from the #ChildTaxCredit to help cover the costs of clothing, school supplies, utilities, rent, &amp; more. If you haven't filed taxes in 2+ years, today is the last day to apply for benefits. Visit https://t.co/BcsPw4LKCM for details.","date":"Mon Nov 15 16:33:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Vanderbilt, Rockefeller, Zuckerberg, Bezos, Musk. \n \nThe names have changed, but the fact that American families are living paycheck to paycheck while a handful of ultra-wealthy get richer by the hour has stayed the same. \n \n#TaxTheRich","date":"Fri Nov 12 20:40:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When it comes to the economy, I trust the guy who has helped create more than 5 million jobs since taking office.","date":"Fri Nov 12 20:16:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thanks to the #ChildTaxCredit, Shawn's family is getting the help they need. Don't forget to sign up before November 15 if you haven't already! https://t.co/YgLz0xb4k3","date":"Fri Nov 12 17:38:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Don’t Ask Don’t Tell has been repealed, but the records of those discharged under its harmful policies have yet to be updated to reflect their honorable service. \n\nEvery #VeteransDay, I’m reminded of the urgent need to pass the Restore Honor to Service Members Act.","date":"Thu Nov 11 21:10:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Reminder: Kids 5+ can now receive the COVID-19 vaccine to help protect their families and keep our communities safe. Make a plan today to protect your family and #GetVaccinated. \n\nhttps://t.co/nJScTmd0pu","date":"Thu Nov 11 17:43:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It takes courage, sacrifice, and true patriotism to serve our country. This #VeteransDay, we recognize those who risked their lives to protect our freedoms, and reaffirm our commitment to ensuring they have access to healthcare, housing, education, &amp; good-paying jobs. https://t.co/MzQPjTVUXV","date":"Thu Nov 11 14:21:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A little extra help each month can make a big difference in the lives of many American families.\n\nIf you’re a nonfiler who hasn’t signed up yet for benefits from the #ChildTaxCredit, you have until November 15. Visit https://t.co/FteyGbi8AJ for more information. https://t.co/GodzjY1tkk","date":"Wed Nov 10 18:41:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Stories like this are proof that we need to make the #ChildTaxCredit permanent. These crucial payments are helping families #BuildBackBetter while we wait for the rain to clear.","date":"Wed Nov 10 17:38:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"By creating thousands of jobs, restoring our roads and bridges, and connecting our communities, the bipartisan infrastructure bill will create tangible improvements in the lives of everyday Wisconsinites. \n\nHere’s a look at what’s in store: \nhttps://t.co/xbDIxrkdub","date":"Wed Nov 10 15:53:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"How has the #ChildTaxCredit helped your family bounce back? \n\nThere are only 5 DAYS for nonfilers to sign up for benefits this year. Visit https://t.co/FteyGbi8AJ to ensure you receive your payments.","date":"Wed Nov 10 14:44:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The bipartisan infrastructure deal tackles more than just roads and bridges — it’s going to create tangible change in the lives of everyday Americans. Watch to find out what’s in store when @POTUS signs this bill into law: https://t.co/tvWzO0kYcH","date":"Tue Nov 09 20:31:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"318,000+ Wisconsinites lack broadband coverage. \n\nThe bipartisan infrastructure bill tackles that, making internet more affordable for almost a quarter of Wisconsin families. https://t.co/R9xZed7Mfe","date":"Tue Nov 09 18:58:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wisconsin roads, you just got paid!\n\nhttps://t.co/eQ7lOmGqjm","date":"Tue Nov 09 17:26:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As we saw last week when the House voted to pass the bipartisan infrastructure bill, sometimes passing legislation requires a bit of ✨magic✨\n\nEnjoy this throwback #MagicMonday!\n\nhttps://t.co/I2ivM2UGSn","date":"Mon Nov 08 17:39:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Don't miss your chance to apply! The deadline for internship applications is a week from today ➡️ https://t.co/icXJxJHmSr","date":"Mon Nov 08 16:20:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Bipartisan Infrastructure bill along with the #BuildBackBetter Act will give the economy the jumpstart it needs and put America back to work. This bill repairs our crumbling roads &amp; bridges, invests in public transit &amp; rail, expands broadband, &amp; secures clean water for kids. https://t.co/S4SrcwCvzX","date":"Sat Nov 06 03:30:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The nonpartisan Congressional Budget Office predicted we'd reach 4.6% unemployment by the end of 2023. Under the leadership of @POTUS, not only are we back on track, we're two years ahead of schedule.\n\nTLDR: 531,000 jobs in one month is no small potatoes.\n\nhttps://t.co/UejXD4oWTd","date":"Fri Nov 05 15:45:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm in too. \n\nWho's with me?","date":"Fri Nov 05 15:09:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My office is hiring interns for the spring semester in Washington, DC &amp; in Madison, WI. The deadline for DC is November 15, and WI is December 1. Apply today! https://t.co/icXJxJHmSr https://t.co/pjmq44GA0o","date":"Wed Oct 13 21:24:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Only in America does a 50-49 vote mean failure. #EndTheFilibuster","date":"Thu Nov 04 14:24:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What spin... \"We got our employees deathly ill with COVID, and now we're making sure we can pack our meatpacking plants full by vaccinating everyone. Look how great we are!\"","date":"Thu Nov 04 13:32:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's November and that can only mean one thing: it's time to Build Back Better (Taylor's Version)","date":"Wed Nov 03 21:12:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @CNN with @PamelaBrownCNN in just a few minutes. Don’t miss it!","date":"Wed Nov 03 20:23:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"About to speak with @TeamCavuto on @FoxBusiness in a few moments. Tune in now! https://t.co/yYuDVyiETB","date":"Wed Nov 03 17:41:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The @CDCgov has authorized the COVID vaccine for children 5-11. \n\nDay by day, more and more Americans are getting vaccinated as getting us out of this pandemic. \n\nhttps://t.co/04hYeu2YtU","date":"Wed Nov 03 00:50:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The @HouseDemocrats are committed to getting the President's #BuildBackBetter agenda across the finish line. Let's get this done. https://t.co/o2JR7a885j","date":"Tue Nov 02 22:09:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Who'da thunk it — when the vaccination rate climbs and childcare facilities open, the hiring would tick up?\n\nhttps://t.co/AVm8rMOgp8","date":"Tue Nov 02 19:17:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich tax the rich","date":"Tue Nov 02 18:40:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @cspanwj in a few minutes, live on @cspan. Tune in! https://t.co/leJNntmCUJ","date":"Tue Nov 02 12:36:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’d say it’s hard to believe how quickly a woman’s right to choose has been brought before the courts, but we all knew this was coming. \n\nIt is the responsibility of the Supreme Court to fulfill its obligation to the constitution and protect reproductive rights. #SB8","date":"Mon Nov 01 19:13:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I hope the media covers the transformational benefits for families in the #BuildBackBetter act as much as they’ve covered the process. As I’ve said since the beginning, this is the storm before the calm. https://t.co/xytHwx4PHI","date":"Mon Nov 01 17:18:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Heading into the weekend, I'd like to remind my friends in the Senate that everyone prefers treats over tricks. \nInaction is spooky; it's time to #EndTheFilibuster and stop moving at a zombie-like pace.","date":"Sat Oct 30 17:46:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Nothing to see here, folks. Totally normal behavior for someone who’s innocent.","date":"Sat Oct 30 15:45:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This weekend, #LGBTQHistoryMonth comes to an end, but we can’t forget the work left to be done. \n\nIt is our duty to make the #EqualityAct the law of the land and ensure that who you love can never determine what freedoms you have. https://t.co/mlQqGp9rTp","date":"Fri Oct 29 20:43:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Parents: soon, kids 5+ will be able to receive the lifesaving COVID vaccine. It’s on us to end this pandemic by working together. #GetVaccinated\n\nhttps://t.co/s55i61GPxv","date":"Fri Oct 29 18:11:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The #BuildBackBetter Act will change lives. Let's get it done!","date":"Fri Oct 29 17:54:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Postmaster General DeJoy has failed the USPS and our postal workers greatly. When he visits Madison today, he’ll have to tell the American Postal Workers Union why.","date":"Fri Oct 29 16:25:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The last group of Americans who need another tax cut right now are the ultra wealthy.","date":"Fri Oct 29 13:44:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'll save you the click: nope. \nhttps://t.co/7pxq040ENr","date":"Thu Oct 28 20:48:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last year, Texas pocketed $83 billion in Pentagon contracts and salaries. In that same year, Russia’s entire military budget was $61.7 billion. It's time to cut the Pentagon budget and invest in American families.\n\nhttps://t.co/ALGpBih070","date":"Wed Oct 27 20:19:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last I checked, your eyes, ears, and mouth are parts of your body. They should be covered too. https://t.co/ZJfxOeYFXI","date":"Wed Oct 27 18:16:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Adjust those dials - joining @CNN with @jimsciutto soon to discuss the #BuildBackBetter act. https://t.co/bScFutoSz6","date":"Wed Oct 27 13:31:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"In reality, what I care about is that we get the right things in the bill. We're so close. Let's just get it across the finish line in a way that benefits the most Americans possible.” https://t.co/86Ibc9b3pX","date":"Wed Oct 27 13:24:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In a single day in 2020, over 11,000 calls from victims of domestic violence went unanswered. If we claim to #SupportSurvivors, even one unanswered call is too many. \n\nToday, I voted to fund programs aimed at preventing violence and protecting victims.","date":"Tue Oct 26 22:22:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tune in soon! Joining @HallieJackson on @MSNBC in a few moments. Don’t miss it!","date":"Tue Oct 26 19:35:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Keeping the                   Passing bills that    \nstatus quo                     benefit Americans https://t.co/LXTyZBpYz1","date":"Mon Oct 25 20:49:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looks like @LeaderMcConnell is saying the quiet part out loud – Having enough money to hire out “wise” decisions shouldn’t come with tax perks too; this isn’t a buy-one-get-one sale.","date":"Mon Oct 25 20:19:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ya think?\n\nhttps://t.co/VCb4Pldn3v","date":"Mon Oct 25 17:38:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Israel should rescind their blanket decision to label Palestinian civil rights organizations as terrorist groups. Many of these organizations are working to bring peace in the region and are vocal critics Hamas &amp; the PA.\n\nhttps://t.co/TTYHQ94n6O","date":"Fri Oct 22 14:16:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #SpiritDay - and all days - I stand against bullying. It's why earlier this year I introduced the Tyler Clementi Higher Education Anti-Harassment Act with @PattyMurray @SenatorBaldwin  to help #StopBullying.","date":"Thu Oct 21 21:32:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just voted to hold Steve Bannon in contempt of Congress - punishable by up to a year in a 6 by 6 cell. https://t.co/CiTGcnKRNJ","date":"Thu Oct 21 20:13:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today I introduced a bill to protect workers' &amp; communities' assets from wall street looting. The Stop Wall Street Looting Act will finally hold predatory private equity firms accountable and protect workers from the consequences of firms' greed.\nhttps://t.co/GJlYsZd718","date":"Wed Oct 20 21:41:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Senate Republicans just filibustered voting rights and voting protections for Americans. They stand only for themselves and voter suppression. \n\nIt’s time to abolish the filibuster.","date":"Wed Oct 20 20:05:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Paid family and medical leave will help countless families across the country. No one should have to choose between paying their bills or taking care of their loved ones. Not in the richest country in the world.","date":"Wed Oct 20 18:41:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need a modern definition of \"defense\" to help us defeat climate change, future pandemics, and a whole host of other issues.","date":"Wed Oct 20 16:20:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Turn the channel to @FoxNews. Joining @BillHemmer and @DanaPerino in a few minutes.","date":"Wed Oct 20 13:37:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tune in now! Joining @CuomoPrimeTime on @CNN to discuss the #BuildBackBetter Act.","date":"Wed Oct 20 01:31:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There is no opposing view of the Holocaust. End of story. \n\nhttps://t.co/zoF8sSFghP","date":"Sat Oct 16 02:14:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I don't know about you, but this is one of my favorite days of the year! #NationalCheeseCurdDay\n\nhttps://t.co/ubs0EtIBH6","date":"Fri Oct 15 13:03:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wall Street just making Wall Street richer. \nhttps://t.co/Hdbkg570X4","date":"Thu Oct 14 21:27:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"👀\nhttps://t.co/rCXxkwotcC","date":"Thu Oct 14 20:48:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The amount of good we could do if we cut the defense budget by 10% is what we should strive for. \nhttps://t.co/9S5MHalQkL","date":"Thu Oct 14 19:06:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My office is hiring interns for the spring semester in Washington, DC &amp; in Madison, WI. The deadline for DC is November 15, and WI is December 1. Apply today! https://t.co/icXJxJHmSr https://t.co/pjmq44GA0o","date":"Wed Oct 13 21:24:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I wanted to *crack* a joke about this pumpkin, but came up *seedless.*🎃\n\nAnd Mike, this counts as the largest pumpkin in my book! Way to go!","date":"Wed Oct 13 20:36:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I believe we must take #ClimateActionNow. There is no time to waste. That is why I am fighting with @HouseDemocrats &amp; @AppropsDems to invest more than $14 billion to develop clean, affordable, and secure American energy. https://t.co/dxdADuZnWY","date":"Wed Oct 13 19:14:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"ICYMI: I joined @JakeTapper on @CNN earlier today to discuss the #BuildBackBetter agenda and why it's good for the American people. https://t.co/jB2tiLA8KJ","date":"Wed Oct 13 00:19:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just voted to lift the debt ceiling to help cover the more than $1 trillion Trump tax cut for the wealthy. Maybe it’s time we got rid of the debt ceiling. https://t.co/u7PPBP5ucu","date":"Tue Oct 12 23:48:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @TheLeadCNN with @jaketapper in a few minutes to discuss why we’re voting on the #DebtCeiling this week and the Build Back Better agenda. Tune in. https://t.co/dDa1sCRbez","date":"Tue Oct 12 20:13:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wisconsin's farmers are what makes Wisconsin the best state in the country! #NationalFarmersDay https://t.co/z2Wi3olOxi","date":"Tue Oct 12 18:07:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What he said. 👇","date":"Tue Oct 12 16:13:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tax.👏The.👏Rich.👏\nhttps://t.co/WqOw4ycQsm","date":"Tue Oct 12 14:31:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I have 3 flags in my office - the US flag, the official state of Wisconsin flag, and the flag for the Ho-Chunk Nation, a consistent reminder of the rich history and traditions the Ho-Chunk bring to our state and our country. Happy #IndigenousPeoplesDay! https://t.co/P5X06xKkTb","date":"Mon Oct 11 20:53:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I have always had a great relationship with @beckyblank at @uwmadison. I wish her the best, but maybe not for the @NorthwesternU football team!","date":"Mon Oct 11 18:29:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS has taken his job seriously, getting Americans vaccinated and back to work. The next step is to pass the #BuildBackBetter Act and the bipartisan infrastructure plan, with the goal of creating millions of new jobs over the next 10 years.","date":"Fri Oct 08 17:19:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Building back better means: \nUniversal pre-k for 3 &amp; 4 year-olds🎒\nCheaper prescription drugs💊\nFighting climate change🌎\nPaid family leave👨‍👩‍👧\nHousing🏘️\nAnd more!\n\nIt's time to pass the #BuildBackBetter Act.","date":"Fri Oct 08 16:43:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a good, fair wage and safe working conditions. #1u","date":"Fri Oct 08 13:21:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Nothing to hide here. 🧐\n\nhttps://t.co/t2JBjxfAiO","date":"Thu Oct 07 21:06:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is what we've been saying all along! Not about the price tag, it's about providing for the American people and making sure we #BuildBackBetter!","date":"Thu Oct 07 16:40:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Time to call a spade a spade and just admit this was a bad idea from the start. It's time to scrap the Space Force.","date":"Wed Oct 06 19:10:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Even the Space Force knows these uniforms are ugly. \nhttps://t.co/3HJclW6n1o","date":"Tue Oct 05 17:47:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s not about when or how it will happen. It’s about making it happen.\n\n@HouseDemocrats want to extend the child tax credit, expand Medicare, create universal pre-k, lower the cost of prescription drugs, &amp; truly #buildbackbetter for the American people.","date":"Mon Oct 04 20:28:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Turn the channel to @MSNBC - joining @CapehartJ on @TheLastWord in just a few minutes to discuss what I heard from @potus earlier today.","date":"Sat Oct 02 02:03:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Discussing the Build Back Better agenda soon on @MSNBC. https://t.co/JTI93O1XKy","date":"Fri Oct 01 18:07:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Really great news. @hitchop is a proven champion for consumers' rights and is exactly the type of leader we need at @CFPB.","date":"Thu Sep 30 18:56:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"At a time when America spends more on its military than the next 11 closest nations combined, we should be able to sacrifice a little over 1% of the Pentagon's budget to save lives. \n \nToday I'm proudly introducing the #COVIDDefenseAct so that we can put an end to this pandemic. https://t.co/bwL7bn2OIh","date":"Thu Sep 30 18:08:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just tax the rich already.","date":"Thu Sep 30 17:56:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The when doesn’t matter. \n\nIt’s what’s in @POTUS’ Build Back Better agenda that matters.","date":"Thu Sep 30 16:11:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @mitchellreports on @MSNBC right now! Tune in. https://t.co/Ywueyzl9SS","date":"Thu Sep 30 16:00:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Once a Badger, always a Badger! \n\nGreet meeting with students from @UWMadison today at this morning’s D.C. Breakfast hosted by \n@WisPolitics. \n\n#OnWisconsin https://t.co/Ue5MgQCzS0","date":"Wed Sep 29 19:29:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@UWBadgers athletes deserve the right to unionize in the same way @Packers do.","date":"Wed Sep 29 19:11:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just like you wouldn't doubt the @Packers, don't doubt @HouseDemocrats &amp; @SenateDems. We're going to get the 𝙚𝙣𝙩𝙞𝙧𝙚 Build Back Better Agenda done. https://t.co/GqPEVtACaf","date":"Wed Sep 29 16:52:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ready to join @JohnKingCNN on @InsidePolitics to discuss @POTUS’ Build Back Better Agenda. Tune in now! https://t.co/zWjVWsfTOg","date":"Wed Sep 29 16:11:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Millions of jobs that address our climate crisis.\nLower health care and child care costs. \nHistoric tax break for working families. \nFree community college. \nMedicare expansion. \nUniversal pre-k. \nPaid leave. \n\nWe're going to get this done.","date":"Wed Sep 29 15:12:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @TheLeadCNN now with @JakeTapper to discuss the Build Back Better Agenda. Tune in! 📺","date":"Tue Sep 28 21:31:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Build Back Better Act delivers for the American people. https://t.co/kTFZ0JPOHU","date":"Tue Sep 28 21:24:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #NationalVoterRegistrationDay! Registering to vote and ensuring your voter registration information is current are the first steps to making your voice heard at the ballot box. Register to vote at https://t.co/TP6EHZYbCm. https://t.co/BBYQlzIAcc","date":"Tue Sep 28 17:22:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happening soon: Joining @chucktodd on @MSNBC in a few moments to discuss the #BuildBackBetter Act","date":"Tue Sep 28 17:00:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's been 4 years this September since Sarah Hegazi waived the pride flag at a @mashrou3leila concert in Egypt and was met with torture and exile. \n\nToday I spoke with Amb. @MotazZahran to reiterate the importance of equality for all in her honor. #RIP. \n\nhttps://t.co/xtzAYtcqvR","date":"Tue Sep 28 16:19:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today is #InternationalSafeAbortionDay and we're in the midst of an all-out assault on abortion access in this country. We need to make sure that every person's reproductive rights are protected—here and worldwide. \n\nAbortion = health care. Period. #RepealHelms https://t.co/3on0Jl7HL9","date":"Tue Sep 28 14:53:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These uniforms are a big ugly reminder that we chose to create a space force in this country before choosing to invest in things like ending poverty or homelessness.","date":"Tue Sep 21 15:42:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Democrats will pass the #BuildBackBetter agenda—which includes BOTH the Build Back Better Act and the bipartisan infrastructure bill—because we know that when working people are cut into the deal, America thrives. https://t.co/poCkMrtIkF","date":"Mon Sep 27 17:52:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good morning! Today would be a great day to cut the Pentagon budget by 10% and give the American people things they actually need, like housing, health care and jobs... not funding for private contractors.","date":"Mon Sep 27 15:50:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Interested in attending a U.S. service academy? Join my office this Saturday for a virtual information session to learn more about being nominated. Register now! \n\n🔗 https://t.co/F1YUNoiyR7 https://t.co/pvVMIaYd8H","date":"Mon Sep 27 15:22:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"ICYMI - my interview with @CapehartJ from this morning: https://t.co/ixpz7xx00M","date":"Sun Sep 26 23:24:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @CapehartJ this morning on @MSNBC. Tune in!","date":"Sun Sep 26 13:56:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We are one step closer to more affordable childcare and healthcare, and giving our planet a fighting chance!","date":"Sat Sep 25 23:12:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Exactly.","date":"Fri Sep 24 14:59:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Roe v. Wade is the floor for reproductive healthcare—not the ceiling—and it's under attack.\n\nToday I'll vote to pass the Women's Health Protection Act to ensure that the constitutional right to abortion is protected &amp; accessible for everyone. #ActForAbortionAccess https://t.co/wk4NYPu01r","date":"Fri Sep 24 13:40:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I proudly voted against the #NDAA this evening. Read my statement here: https://t.co/Lw8ceGXKhL","date":"Fri Sep 24 01:27:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Proud of the 85 other members who voted to cut 10% of our ballooning defense budget. I will continue to fight to redirect this money to fighting the threats here at home, like COVID-19 and climate change.","date":"Thu Sep 23 21:38:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Imagine what we could accomplish with a 10% cut to the pentagon. Things like: \nVaccinating the world from COVID-19\nEnding both hunger and homelessness in the United States or\nFunding the CDC at current levels for nearly a decade","date":"Thu Sep 23 21:18:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #BiVisiblityDay! \n\nToday we celebrate those in our bisexual community and recommit to fighting for full equality for our entire LGBTQ+ community. https://t.co/Ji4GQFgJI1","date":"Thu Sep 23 17:49:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I guarantee that Democrats are going to pass BOTH the #BuildBackBetterAct and the Bipartisan Infrastructure Agreement. \n\nIf Republicans don't want to work with us, fine. We'll be the ones (again) to deliver for the American people. https://t.co/V39Cg9KkUX","date":"Thu Sep 23 16:39:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @ChrisJansing on @MSNBC - tune in now!","date":"Thu Sep 23 14:38:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The #BuildBackBetterAct is already paid for. This isn't about a deficit. \n\nWhat it is about? Making a real, lasting impact on the lives of our constituents—not special interests. https://t.co/4TN8TF0IWM","date":"Wed Sep 22 22:17:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's time we cut the Pentagon's budget by 10% and reinvest in the real needs of the American people.","date":"Wed Sep 22 21:19:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joining @jaketapper on @CNN at 3pm CT. Tune in soon! https://t.co/bsdOyhbwDc","date":"Wed Sep 22 19:49:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every student should feel safe in their learning environment. \n\nThat's why I'm reintroducing the Tyler Clementi Higher Education Anti-Harassment Act w/ @SenatorBaldwin &amp; @PattyMurray to protect students from being targeted based on sexual orientation.\n\nhttps://t.co/pF6F9YNe8q","date":"Wed Sep 22 19:31:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"More. Of. This. \n\nAnd by that, I mean let's pass the #COVIDDefenseAct and vaccinate the world's most vulnerable. \n\nhttps://t.co/qnD8XP9Ld9","date":"Wed Sep 22 19:20:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This isn’t a fight between moderates &amp; progressives - it’s a fight between the special interests who don’t want to pay their fair share and Building Back Better for the American people.","date":"Wed Sep 22 13:16:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In a worsening pandemic, it’s unconscionable that any lawmaker would vote against a resolution that keeps the government open and lights on in homes across this country. \n\nWhen my Senate colleagues take up this funding bill, I hope they remember they’re working #ForThePeople.","date":"Wed Sep 22 01:03:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm live now answering questions you have about the #BuildBackBetterAct and more. Tune in!\n\nhttps://t.co/jRFQCrNxSr","date":"Tue Sep 21 23:13:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The best way to pass the infrastructure bill is to pass the #BuildBackBetterAct. One doesn’t pass without the other. Let’s make sure we pass both.","date":"Tue Sep 21 22:42:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s not too late to RSVP for my Virtual Town Hall this evening! See you soon ⏰\n\n🔗 https://t.co/xov8vvTTau https://t.co/l1EMoKVoGa","date":"Tue Sep 21 22:40:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These uniforms are a big ugly reminder that we chose to create a space force in this country before choosing to invest in things like ending poverty or homelessness.","date":"Tue Sep 21 15:42:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Agreed, @POTUS. Bombs and bullets won't defend us against COVID-19, but vaccines will. That's why we should cut the Pentagon's budget and reinvest in global vaccination efforts. #COVIDDefenseAct https://t.co/NaXSqkisd9","date":"Tue Sep 21 15:10:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Pouring billions more into the Pentagon's budget won't tackle real and present dangers to our national security like COVID and climate change. Why not cut just 10% of this bloated budget and reinvest in fighting our greatest threats?\n\nhttps://t.co/FYWyHlfvZI","date":"Tue Sep 21 13:50:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Join me tomorrow for a Facebook Live Town Hall to discuss the #BuildBackBetterAct and answer questions about issues that matter most to you.\n\nRSVP ➡️ https://t.co/7VFbYOVlTo https://t.co/Kh9CN86eHi","date":"Mon Sep 20 22:38:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These iPhone alerts are becoming scary accurate. https://t.co/XeMKFwkp8l","date":"Mon Sep 20 20:38:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There is nothing dishonorable about serving your nation as a member of the LGBTQ+ community.\n\nOn the anniversary of the repeal of 'Don't Ask, Don't Tell,' I'm reintroducing my bill to #RestoreHonor to those who were dishonorably discharged because of their sexual orientation. https://t.co/GLfPfrvHj6","date":"Mon Sep 20 18:30:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Indefensible and unfathomable that our border patrol agents would use violence on those seeking asylum in the United States of America. This is not what we stand for. End the cruelty now. \n\nhttps://t.co/ExvgrO9nZ3","date":"Mon Sep 20 18:15:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"One of the best parts about MagiFest is the chance to get to learn from some of the greatest magicians across the country, including @nate_staniforth. \n\nEnjoy today's #MagicMonday trick performed by this pro magician!\n\nhttps://t.co/A8wnP4QhFv","date":"Mon Sep 20 14:37:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our nation was built by immigrants. It's paramount on #CitzenshipDay and every day that we recognize the endless contributions made by immigrants and work harder to ensure a pathway to citizenship. And for the record: #HomeIsHere.","date":"Fri Sep 17 18:02:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"#SnacksAreInfrastructure!","date":"Fri Sep 17 17:09:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is good news, but did you know a 1.3% cut to the Pentagon’s budget could vaccinate nearly 30% of the world’s poorest population? #coviddefenseact","date":"Fri Sep 17 16:29:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’d love for my Republican colleagues to tell me why this is a bad thing.\n\nhttps://t.co/EakdRYze3N https://t.co/K1IUl0CGYk","date":"Fri Sep 17 13:24:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congress allocated millions in funding to help people stay in their homes, and we've got to do a better job in getting these funds in the right hands. \n\nIf you're behind on rent or mortgage and facing eviction, please know there are resources available to you. https://t.co/K7vSCrDL6i","date":"Thu Sep 16 18:28:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Join me on Tuesday for a Facebook Live Town Hall to discuss the #BuildBackBetterAct and answer questions about issues that matter most to you. https://t.co/ogtQTgwe5r","date":"Thu Sep 16 16:12:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There are endless attractions in Wisconsin's 2nd Congressional District, and Taliesin is certainly one of them. Not only is it a great place to visit, it's now a  @UNESCO world heritage site!\n\nhttps://t.co/RBxpCRfD7h","date":"Wed Sep 15 20:32:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The #BuildBackBetter plan: \n\n👉 Lowers costs for American families\n👉 Includes a permanent tax break for families w/ children\n👉 Creates millions of jobs to tackle climate change\n\nThe icing on top? This bill will be funded by finally making the ultra-wealthy pay their fair share. https://t.co/WbEItFvCHA","date":"Wed Sep 15 19:11:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Translation: 1 out of every 153 American workers doesn't have union protections. We've really got to pass the #PROAct. \n\nhttps://t.co/BUi8aBxBBd","date":"Wed Sep 15 17:30:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"#HispanicHeritageMonth is an important moment for Americans to recognize the rich contributions and influence Hispanics have made to the history, culture, and achievements of the United States. https://t.co/BXn8CAecLe","date":"Wed Sep 15 15:47:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"https://t.co/JIaJyyIDMT","date":"Wed Sep 15 15:43:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"39 million families will receive another round of their #ChildTaxCredit payments today! If you're one of them, how will you be spending yours? https://t.co/xUbk71hGnD","date":"Wed Sep 15 14:46:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's almost like passing legislation to get people out of poverty actually gets people out of poverty.","date":"Tue Sep 14 21:12:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻|\n┻┳|\n┳┻| _\n┻┳| •.•)  Tax the rich \n┳┻|⊂ﾉ  \n┻┳|","date":"Tue Sep 14 17:05:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Q: What do your ears, eyes and teeth all have in common?\n\nA: They're all part of your body, but aren't covered by Medicare. \n\nIt's time we expand Medicare to include coverage for dental, vision and hearing. The #BuildBackBetterAct gets this done.","date":"Tue Sep 14 13:46:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As a small business owner, I know that small businesses are the lifeblood of our communities &amp; local economies. That's why I fight hard to ensure they've got the support they need to thrive. \n\nHappy #SmallBusinessWeek to our small businesses in Wisconsin &amp; across the country! https://t.co/Hivbpa9LDl","date":"Mon Sep 13 15:53:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week, we’re throwing it back to a live #MagicMonday with special guest @RepValDemings! \n\nhttps://t.co/gdCncIteij","date":"Mon Sep 13 15:30:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today we remember the 20th anniversary of the tragic events of 9/11, a day that senselessly took the lives of 2,997 Americans and shook our country to its core and say, “never again.”","date":"Sat Sep 11 12:32:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's our obligation to thank those who protected our soldiers in Afghanistan for 20 years, and we're going to make sure they're apart of this country. \n\nSee my full interview on @TheLastWord with @AliVelshi discussing this matter ⬇️ https://t.co/7dwkm9nQI3","date":"Fri Sep 10 19:04:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Another weird thing billionaires have in common? 🤪 Not paying their taxes. \n\n#TaxtheRich.\n\nhttps://t.co/sHWeveUd6l","date":"Fri Sep 10 17:38:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today is #WorldSuicidePreventionDay. Please remember that you are not alone. You can ALWAYS call 1-800-273-8255 and speak to someone immediately. https://t.co/56IAPVawtH","date":"Fri Sep 10 13:24:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Up next on @TheLastWord with @AliVelshi. Tune in!","date":"Fri Sep 10 02:39:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"8 million Americans rely on SSI, but the benefits are below the poverty line. \n\nWe finally have a real opportunity to strengthen SSI by including it in the #BuildBackBetter package. Let's get it done. #DemolishDisabledPoverty","date":"Thu Sep 09 19:20:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Grateful to have a leader in the @WhiteHouse who understands the dire need to curb the rising costs of prescription drugs. \n\nIt's time for Congress to step in and help. \n\nhttps://t.co/gmKuXiaAqs","date":"Thu Sep 09 16:26:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Alternative headline: U.S. taxpayers are paying $163 billion a year to fund billionaires' space races and fuel their super yachts.","date":"Wed Sep 08 20:13:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What building has a budget so ridiculously big that cutting it by even just a little (1.3%) could vaccinate the world's most vulnerable? \n\nHINT: https://t.co/kjd8VZ33aF","date":"Wed Sep 08 17:28:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Great speech, @POTUS! Now it's time for the Senate to pass the #PROAct. https://t.co/JRPRFKLGPA","date":"Wed Sep 08 16:21:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank you, @POTUS for advocating for the #PROAct! Worker power is essential to expanding the middle class and we owe it to workers to give them every opportunity we can to unionize and encourage collective bargaining.","date":"Wed Sep 08 16:13:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS is right - unions built the middle class.","date":"Wed Sep 08 16:05:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Defense contractors.","date":"Wed Sep 08 15:48:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Look what I got in the mail today! Proud that I've been a member of the @SierraClub for 25 years and to fight for critical legislation that will protect our planet. 🌎 https://t.co/8cHNYQuq1y","date":"Wed Sep 08 14:27:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Birthday to my friend, @SenSanders! https://t.co/PTWvg5HSBY","date":"Wed Sep 08 13:54:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tune into @peacockTV now. I’m joining @mehdirhasan to discuss the PRO Act, unemployment, and Afghan refugees.","date":"Tue Sep 07 23:46:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today I witnessed the incredibly hard work being done at Fort McCoy to safely resettle Afghan refugees. \n\nIt’s our obligation to help the hundreds, if not thousands, of refugees and their families at this base who've directly helped our government the past 20 years. https://t.co/tN2RMWfRKC","date":"Tue Sep 07 22:27:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our planet is warming so fast that animals are literally shapeshifting to keep up. We can't air condition the rainforest. We need to tackle the climate crisis NOW.\n\nhttps://t.co/YjDR7AQlsV","date":"Tue Sep 07 20:47:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Things you can legally do in Texas:\n- Become a citizen bounty hunter and sue Uber drivers who take women to their doctor \n- Carry a gun without a permit \n\nThing you can't legally do in Texas:\n- Drop off your mail ballot or register to vote online \n\nAnyone see the problem here?","date":"Tue Sep 07 16:32:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's voting rights or the filibuster. \nIt's climate action or the filibuster. \nIt's racial justice or the filibuster. \nIt's worker's rights or the filibuster. \nIt's reproductive justice or the filibuster. \nIt's our democracy or the filibuster. \n\nEnd the filibuster. Period.","date":"Tue Sep 07 15:10:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There’s no better time to help the American people than right now.\n\nhttps://t.co/htQDKaC3Dw","date":"Tue Sep 07 12:25:19 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Best way to honor workers on #LaborDay? 🤔","date":"Mon Sep 06 18:57:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Labor unions are what made America and what will help America Build Back Better.\n\nhttps://t.co/u20sIoAVbZ","date":"Mon Sep 06 16:44:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #LaborDay! Today we celebrate American workers and the proud history of the labor movement. \n\nAs a card-carrying union member, I understand the value of organized labor and the importance for workers to have a voice in the workplace. #1u ✊ https://t.co/QOCg7DWwFq","date":"Mon Sep 06 13:27:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you’re like @DollyParton and workin’ only 9 to 5, thank a #union! Happy Labor Day! https://t.co/mhk7m9kG8Y","date":"Mon Sep 06 13:08:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Enjoy today's throwback #MagicMonday, #LaborDay inspired! \n\nhttps://t.co/BtzctqhxZv","date":"Mon Sep 06 12:08:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Corporate America’s silence is deafening. They acted in NC to help reverse the “bathroom bill” but where are they when women need them most?\n\nhttps://t.co/IVXFTVsdcP","date":"Sat Sep 04 21:32:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Sending a big congratulations to @SecretaryPete and @Chasten on this special day!","date":"Sat Sep 04 16:30:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Who else is ready for a #Badgers win today? https://t.co/oszAVD8Ivk","date":"Sat Sep 04 15:09:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Child care should be affordable to all families, regardless of what zip code they live in. \n\nBy making direct relief available through child care providers, we can get more help to more families—in every state and every community.","date":"Fri Sep 03 23:00:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Signing off for a long Labor Day weekend? \n\nThank a union.","date":"Fri Sep 03 21:07:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Proud to work with my colleagues as Co-Chair of the COVID-19 Global Vaccination Caucus to help vaccinate the world and put an end to this pandemic.","date":"Fri Sep 03 17:27:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Did you hear? @GovEvers is extending the $100 COVID-19 incentive program. \n\nWhat’s your reason for getting the vaccine?\n\n🔘 Family 🫂\n🔘 Favorite activities 🎫\n🔘 Less anxiety🧘\n🔘 For your community 🤝\n🔘 All of the above","date":"Fri Sep 03 17:00:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Supreme Court’s disgusting attack on women is yet another reason why we need to #EndTheFilibuster and #ExpandTheCourt \n\nhttps://t.co/2YboTaMGCT","date":"Thu Sep 02 16:00:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The vote to increase NDAA spending today by my colleagues was unwarranted and unnecessary, especially when we could be using that money to fight our most pressing national security threats here at home. \n\nMy full statement ⬇️ https://t.co/lONs5oyUbG","date":"Wed Sep 01 20:42:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our biggest national security threat is COVID-19, which is running rampant all around the country. Another $24 billion isn’t going to make us safer. We should be trying to stop this virus and help vaccinate the world.","date":"Wed Sep 01 19:06:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Restricting access to the ballot box. Loosening common-sense gun safety laws. Denying a woman the right to make her own reproductive decisions. Why is the Texas legislature so gung-ho on taking us back to the Wild Wild West?","date":"Wed Sep 01 18:04:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This abortion ban is more than an assault on women's reproductive freedom in Texas. It's part of a concerted effort to strip every woman of the constitutional right to control her own healthcare decisions.\n\nIf the Supreme Court won't defend constitutional rights, Congress must.","date":"Wed Sep 01 15:56:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Abortion is a constitutional right.","date":"Wed Sep 01 13:53:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When Democrats say we're fighting #ForThePeople, we actually mean it. Let's make the #ChildTaxCredit permanent.","date":"Mon Aug 30 22:22:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"America's longest war is finally over. As we pause to reflect on the thousands of lives we've lost over these 20 years, let's also commit to stopping endless wars. Never again. \n\nhttps://t.co/y2uDCWXG3V","date":"Mon Aug 30 20:57:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Extra proud to be a Badger today! Congrats to @UWMadison on placing *FIRST* among all public universities across the nation. 🏆🏆🏆","date":"Mon Aug 30 19:16:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The @billboard top 5 the last year we raised the federal minimum wage. Feel old yet?\n\nRaise the damn wage. https://t.co/2AubOH6bAd","date":"Mon Aug 30 18:24:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's time we invest in fighting real threats to our national security &amp; not lining defense contractors' pockets.  \n\n@RepBarbaraLee &amp; I led 25 of our colleagues in a letter to @HASCDemocrats Chair @RepAdamSmith to ensure no NDAA spending increases for FY2022. https://t.co/5vBqKcTvql","date":"Mon Aug 30 16:38:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations, @SecDebHaaland! Wishing you and your husband a lifetime of happiness.","date":"Mon Aug 30 15:02:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For today's throwback #MagicMonday, my friend @RepAnnieKuster and I show you the magic of working together. \n\nEnjoy! \n\nhttps://t.co/VEFDYDVwUP","date":"Mon Aug 30 14:11:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is great news, Wisconsin!","date":"Sun Aug 29 00:43:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Horrifying to think that millions of Americans have to worry about losing their housing in the middle of a pandemic. \n\nI'm proud to join my colleagues in the fight to extend the #EvictionMoratorium. Congress must act.","date":"Fri Aug 27 17:40:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"✅ The first ever federal paid leave program.\n✅ Universal pre-K &amp; 2 years of free community college.\n✅ A clean energy future.\n✅ Expanded health coverage for seniors.\n\nDemocrats are lowering costs for hard-working Americans &amp; budgeting for a better, stronger future. https://t.co/9Z4Cjq6yxc","date":"Fri Aug 27 17:19:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Supreme Court blocking the eviction moratorium while the pandemic is killing 1,000 people a day is appalling. Congress should immediately come back into session and extend the moratorium. https://t.co/cQHtg97Juw","date":"Fri Aug 27 02:13:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My thoughts are with the families of the brave service members who lost their lives in Kabul today. We need to continue to do everything we can to evacuate Americans and Afghan refugees as quickly and safely as possible.","date":"Thu Aug 26 20:27:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On #WomensEqualityDay, we celebrate the adoption of the 19th Amendment, guaranteeing women the right to vote. \n\nDid you know Wisconsin was the first state to ratify this amendment? I'm proud that our state has always been guided by our motto... #Forward. https://t.co/NAUXOG7Jzu","date":"Thu Aug 26 15:16:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Nothing says tax the rich like American billionaires making $1,800,000,000,000 during a global pandemic.\n\nhttps://t.co/lQ0zkQF00a","date":"Wed Aug 25 17:04:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Cheering on all the Wisconsin athletes competing in the Paralympics! Bring home the gold for #TeamUSA.","date":"Wed Aug 25 16:05:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Birthday, @NatlParkService! 🎂\n\nEnjoy free entry to any national park today in Wisconsin: https://t.co/cJueW67oXK.","date":"Wed Aug 25 14:43:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The right to vote is the most sacred right we have as Americans. \n\nI voted to protect all voters from discrimination by restoring and strengthening the protections of the #VotingRightsAct, protecting our democracy, and protecting the right to vote for all. https://t.co/2OEEIryhdR","date":"Tue Aug 24 23:19:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Elections matter. Today’s vote to #BuildBackBetter to strengthen the social safety net, fight climate change, stand up for immigrants, and invest in everyone - from children to caregivers - will make our country safer, healthier, greener, and better for all. https://t.co/L2o4Br4Ux6","date":"Tue Aug 24 20:15:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This year alone, 18 states have enacted restrictive laws that make it harder for Americans to vote. \n\nWe need to #RestoreTheVRA to put an end to these suppressive, antidemocratic tactics and give every citizen an opportunity to participate in our democracy. https://t.co/L43sUnkxdf","date":"Tue Aug 24 18:32:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Climate change isn't a problem of the distant future. Climate change is here.\n\nWe need bold investments now to fight our climate crisis today. Lives are on the line.","date":"Tue Aug 24 17:12:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As a business owner myself and card-carrying union member, I want to congratulate the workers of Colectivo for successfully unionizing last night. With stronger unions, workers can secure higher wages, better benefits, and safer working conditions. Every worker deserves a union.","date":"Tue Aug 24 15:57:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As we get ready to consider #HR4 in the House, I'm thinking about John Lewis, who devoted his life to fighting for the sacred right to vote. \n\nToday we will honor his legacy by voting to ensure every American has access to the polls.\n\nToday we will get into some #GoodTrouble. https://t.co/rSDSIil7BQ","date":"Tue Aug 24 14:20:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Defense isn't just F-35s and funding private contractors. It's also protecting us from pandemics and fighting climate change, both of which are present dangers to our country. \n\nWe need to cut the Pentagon's budget and reinvest in the American people.","date":"Mon Aug 23 21:24:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's been one year since Jacob Blake was shot, and 15 months since George Floyd's murder.\n\nIn that time, the House has passed a police reform bill not once, but twice. \n\nIt's time the Senate take up the #JusticeinPolicingAct.","date":"Mon Aug 23 19:21:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Get your vax and get some cash 💰","date":"Mon Aug 23 18:04:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Palestinian Authority must stop committing human rights abuses and respect the freedom of speech of all Palestinians. Arresting peaceful human rights defenders is never OK. Full stop. https://t.co/ry5taDlVNF","date":"Mon Aug 23 16:48:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@uwlaxecho @DaneVarese Glad we could help, @uwlaxecho!","date":"Mon Aug 23 15:55:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The FDA just confirmed what we already knew. These vaccines are safe and effective. \n\nGet vaccinated today ➡️ https://t.co/jGdyZ4bTpW\n\nhttps://t.co/xcCoXZSLcs","date":"Mon Aug 23 15:03:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week, the House will vote to pass the John Lewis Voting Rights Advancement Act, which ensures that every American can participate in our democracy. \n\nIn that spirit, I hope you’ll participate in today’s throwback #MagicMonday! \n\nhttps://t.co/As5F2HaMxi","date":"Mon Aug 23 13:49:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Egypt should reverse this unproductive &amp; ultimately harmful decision. Isolating Gaza won’t lead to lasting peace. I sent a letter w/ 52 of my colleagues urging @SecBlinken to work w/ his counterparts to ensure aid gets into Gaza through Israel &amp; Egypt. https://t.co/pA3KbkOIeo","date":"Sun Aug 22 22:51:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Now let’s make it permanent!\nhttps://t.co/UyVsstATip","date":"Thu Aug 19 20:35:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today I sent, along with @RepDebDingell &amp; 51 of our colleagues, a letter to @SecBlinken urging him to work with his counterparts to ensure humanitarian aid is able to get into Gaza, and help the 1.3 million Palestinians who are being deprived of their basic human needs. https://t.co/1O5izFG6Ix","date":"Wed Aug 18 20:40:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A sliver of the Pentagon's budget could vaccinate the world's most vulnerable people. #COVIDDefenseAct https://t.co/fUHIA3wEK1","date":"Wed Aug 18 17:48:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The greatest risk to our national security is COVID-19. Redirecting just 1% of the Pentagon’s budget to vaccinate the world would make a real difference in the defense of our country. #COVIDDefenseAct https://t.co/rbS25yDDwO","date":"Wed Aug 18 16:00:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We can’t bomb our way out of a global pandemic. That’s why I’m introducing the #COVIDDefenseAct to cut our bloated Pentagon budget by 1% to vaccinate nearly 30% of the world’s poorest population. \n\nhttps://t.co/h0zv1qI4Rf https://t.co/h2kqXYouCB","date":"Wed Aug 18 13:37:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Yes it is.","date":"Tue Aug 17 16:58:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS is right. Our mission in Afghanistan was not about nation building. Our current mission needs to be helping to evacuate the Afghani citizens and families who helped our troops.","date":"Mon Aug 16 20:45:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The United States has a duty to honor its commitment to the Afghanis who helped our efforts, such as guides and translators. \n\nWe must ensure these refugees are allowed to reach our shores as safely and as quickly as possible.","date":"Mon Aug 16 16:41:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In today's throwback #MagicMonday, we're showing you how chaos in Washington can actually lead to legislation 🪄\n\n https://t.co/2VAGrl6Wrf","date":"Mon Aug 16 14:48:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank you, @LeaderHoyer!","date":"Sat Aug 14 20:40:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Saving lives one cream puff at a time. Go get your COVID-19 vaccine #TheWisconsinWay!","date":"Wed Aug 11 16:30:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Had a great time yesterday meeting with Rev. Dr. Alex Gee to discuss progress on The Center for Black Excellence and Culture in Madison. \n\nI’m proud to have secured $1,000,000 for this important project with House passage of appropriations bills. https://t.co/t7rvoZ3TbK","date":"Wed Aug 11 15:26:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It has been an honor to work alongside my colleague, @RepRonKind. \n\nI wish Ron, Tawni and the rest of his family best wishes as he starts a new chapter in his life. https://t.co/dcUZz1HrJv","date":"Tue Aug 10 20:38:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Inaction is no longer an option when it comes to PFAS chemicals. \n\nWe need to pass federal legislation into law immediately to get these toxic chemicals out of our drinking water. \n\nThose responsible for this contamination must be held accountable. \n\nhttps://t.co/K4dp7X0QbH","date":"Tue Aug 10 17:46:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Vaccines save lives. Period. \n\nFind a vaccination site near you: https://t.co/88Jj3nUj42.","date":"Tue Aug 10 15:07:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"POP QUIZ: What do all of the below have in common?\n \n👉 🦷\n👉 👁\n👉 👂\n \nANSWER: All 3 are apart of your body, but aren’t covered by Medicare.\n \nIt’s past time we expand coverage to include dental, vision, and hearing. Democrats' $3.5 trillion budget proposal will get this done.","date":"Mon Aug 09 19:45:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The future of our planet is literally in our hands. We must fight climate change like hell.","date":"Mon Aug 09 16:18:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today's throwback #MagicMonday focuses on the importance of political compatibility: https://t.co/EzHpXj3HmT\n\nEnjoy!","date":"Mon Aug 09 13:24:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A half century after the #VotingRightsAct was signed into law, the right to vote is still under attack. \n\nWe must end the filibuster to pass federal legislation that will allow every American access to the ballot box.","date":"Fri Aug 06 18:19:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A proper way for the United States to commemorate the 76th anniversary of Hiroshima would be to lead the charge in eliminating nuclear weapons worldwide. \n\nhttps://t.co/HynrBe8DKx","date":"Fri Aug 06 15:42:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Deeply saddened by the loss of a true champion for working people. Richard Trumka will be sorely missed, but we will carry his fight onward.\n\nhttps://t.co/kruVBMzums","date":"Thu Aug 05 16:32:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"TRAVEL ADVISORY: Due to delays @StateDept, it could take 4-6 months to process your passport application. If you’re planning to travel abroad, apply for your passport now! \n\nhttps://t.co/XkBYZJFJhW","date":"Thu Aug 05 13:57:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The new eviction moratorium will keep millions of Americans in their homes. \n\nBut we clearly have to do more to get emergency rental assistance funds out the door.  \n\nIf you’re behind on rent or utilities, find out how to apply for assistance here: https://t.co/9jKF4qGano https://t.co/bEBCqyLAYK","date":"Wed Aug 04 18:53:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Welcomed @SBAIsabel to Madison this morning to meet with our small businesses owners and discuss how we can be helpful to their recovery from COVID-19. I'll keep fighting to ensure that our small businesses have the relief they need to rebuild from this crisis. https://t.co/mxtZumMPSS","date":"Wed Aug 04 14:24:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you needed any more reasons on why we need the #PROAct, read this thread.","date":"Tue Aug 03 17:58:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Housing is a human right and I will continue fighting to #ExtendTheMoratorium.\n\nIf you're behind on rent or mortgage and facing eviction due to COVID-19, there are resources available to you. ⬇️ https://t.co/QQvivgQjcK","date":"Tue Aug 03 13:23:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hey @amazon, remember me? The congressman that you admitted your employees have to pee in bottles to? \n\nAnything you want to admit about your potential illegal unionbusting activities to me?","date":"Mon Aug 02 23:10:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What better way to kick off a Congressional District Work Period than with a magic trick?\n\nEnjoy today's throwback #MagicMonday! \n\nhttps://t.co/VsQXSSQowy","date":"Mon Aug 02 14:30:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Get. Vaccinated. \n\nhttps://t.co/63FdtgSbHS","date":"Mon Aug 02 13:52:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Pertinent reminder.","date":"Sat Jul 31 20:07:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Small businesses are the heart and soul of our communities. As a small business owner, I understand the impact these businesses have on our local economies. \n\nI'm excited that the House approved $173,000 in funding for a Small Business Development Center at @UWMadison! https://t.co/VzK1cvDb7m","date":"Fri Jul 30 21:15:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The COVID-19 pandemic has exposed the long-standing inequities in the rural health care.\n\nThat's why I fought to secure $200,000 for a mobile health outreach unit at Green County's Aging &amp; Disability Resource Center in the @HouseDems' appropriation bills. https://t.co/bhqmvslIYu","date":"Fri Jul 30 20:08:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm proud to support the transformational work @MiCentro does to improve the lives of Latinx families in Dane County every day. \n\nWith approval from the Senate and signature from @POTUS, the Centro Hispano of Dane County will receive $200,000 in federal funding! https://t.co/S3iO4o62pP","date":"Fri Jul 30 19:23:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Announcing $220,000 for a new community center in Reedsburg! \n\nThis investment is included in @AppropsDems' we passed this week in the House. https://t.co/sc16msqIKV","date":"Fri Jul 30 18:18:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The @StatelineBGC is a critical asset to the entire Beloit community. \n\nI'm proud to announce $500,000 in appropriations funding to make this facility more accessible for our children. https://t.co/Oy4vMhNA3x","date":"Fri Jul 30 17:14:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The best way to celebrate Medicare’s 56th birthday? \n\n✨Providing Medicare for All. ✨","date":"Fri Jul 30 16:33:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thrilled the @HouseDemocrats' funding bills we passed this week includes $1,000,000 for the construction of the Center for Black Excellence &amp; Culture in Madison.\n\nThis project will create a space dedicated to Black enterprise, art, history, performance, and culture. https://t.co/1OIcZje9B6","date":"Fri Jul 30 15:47:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Included in appropriations legislation passed by the House is a $1,200,000 investment I secured for a next-generation weather instrument at \n@UWMadison.\n\nThis funding will help researchers predict severe weather and address climate change. https://t.co/V9mW5LiRds","date":"Fri Jul 30 14:29:07 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The COVID-19 pandemic has only exacerbated our housing crisis in Wisconsin and across this country. \n\nI'm proud to have secured $2,000,000 in federal funding to open a new homeless shelter in Madison. https://t.co/tNFgWPvoGI","date":"Fri Jul 30 00:40:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Announcing $4,000,000 for a new agricultural research facility at @UWMadison with the House passage of appropriations bills! \n\nThis investment will support @USDA's vital agricultural research and provide hands-on research experience for over 150 students. https://t.co/RgoaTBIRqh","date":"Thu Jul 29 23:37:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Must've been a little cooler on the Senate side for the snowflakes who refuse to wear a piece of cloth on their face to prevent people from dying.","date":"Thu Jul 29 22:42:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Proud to have voted today to pass nine spending bills that include millions of dollars for Wisconsin's 2nd Congressional District. \n\nRead more: https://t.co/ml1AX1gOEs https://t.co/rDfOm57mbK","date":"Thu Jul 29 22:12:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's long past time we let Medicare negotiate drug prices. \n\nWe must end the monopolies of pharma corporations and put the power back in hands of the people. https://t.co/goKdHXydsG","date":"Thu Jul 29 19:32:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Nobody should be denied a college education because they can't afford it. Period. \n\nThat's why I introduced the Pell Grant Preservation &amp; Expansion Act with @BobbyScott to double the Pell Grant and expand eligibility to include DREAMers. https://t.co/TypJWCv9Ud","date":"Thu Jul 29 17:09:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Almost like there's a pattern here? \n\nWe need to fight climate change—NOW.","date":"Wed Jul 28 22:10:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Listening to Republicans cry about masks is like listening to babies cry about wearing diapers. \n\nThe real question is: How many of them are enabling the problem by not getting vaccines? https://t.co/aAwqCkLovz","date":"Wed Jul 28 15:49:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"Normal tourists\" don't electrocute police officers with tasers.","date":"Tue Jul 27 15:43:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is good news 👏 Now is the time to get the vaccine if we want to avoid a Delta surge.","date":"Mon Jul 26 19:02:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For today's throwback #MagicMonday, I'm going to let you in on a little secret about magic: https://t.co/ZRKDlSq6O1 \n\nEnjoy!","date":"Mon Jul 26 12:48:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last week, 39 million Americans began receiving their #ChildTaxCredit payments. \n\nI asked you to tell me how these payments would benefit you and your family. Here's what you had to say ⬇️ https://t.co/018VKv7lrg","date":"Thu Jul 22 19:00:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a union. \n\nIt's time to pass the #PROAct. https://t.co/rHyGUKTxIx","date":"Thu Jul 22 17:22:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"...Says the insurrection denier.","date":"Wed Jul 21 20:33:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In Wisconsin, PFAS chemicals have been found in the drinking water of over 50 cities. \n\nI joined my colleagues on the PFAS Task Force this morning to highlight the need to pass the PFAS Action Act to get these toxic chemicals out of our water. We must act now. https://t.co/f6TSOupEPj","date":"Wed Jul 21 14:17:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What a great day to be from Wisconsin! #BucksIn6","date":"Wed Jul 21 12:25:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"🎨 Congratulations to the winners of my office’s annual Congressional Art Competition! 🎨\n\nFirst place goes to @MCDSPrairieHawk student, Grace Sherill. Grace’s work, “Lofty Prairie,” will be displayed in the Capitol. https://t.co/H9YHSISDyE","date":"Tue Jul 20 21:18:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Translation: “Thanks for letting me exploit your labor and profit off of you literally peeing in bottles so that I could enjoy a few seconds at zero gravity!”","date":"Tue Jul 20 16:29:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"2.2 billion people don’t have access to clean drinking water….but, hooray!  Another billionaire just made it to the edge of space.","date":"Tue Jul 20 13:40:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"New @benandjerrys flavor just dropped: Peace in the Middle East Pecan 🍨","date":"Tue Jul 20 00:39:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Almost like our planet is trying to tell us something…? https://t.co/P5AL75Rm5e","date":"Mon Jul 19 19:57:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week’s throwback #MagicMonday comes with an important reminder: Everybody deserves health care. Period. \n\nhttps://t.co/dnJLfUYtYz","date":"Mon Jul 19 12:36:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A reminder to apply for your passport early if you plan to travel internationally! \n\n✈️  https://t.co/bPq8vajoEQ","date":"Fri Jul 16 17:48:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I wonder if the Amazon peeing in a bottle unofficial policy applies in space? Maybe the spaceship will be equipped with pee bottles?","date":"Fri Jul 16 15:38:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you’ve received your #ChildTaxCredit payment today, how are you planning on using it? 💰💰💰","date":"Thu Jul 15 20:41:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"39 million families will receive #ChildTaxCredit payments today thanks to hard work by Democrats in getting the #AmericanRescuePlan across the finish line.\n\nThis money will deliver one of the biggest reductions of child poverty ever. More at https://t.co/7evaGAUrF0. https://t.co/ioDTGufEjF","date":"Thu Jul 15 17:15:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hint: Pay your workers more.","date":"Thu Jul 15 15:03:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"TOMORROW: Thousands of Wisconsin families start receiving payments from the expanded #ChildTaxCredit.\n\nMake sure your funds are deposited in the right place by visiting the new IRS portal today➡️ https://t.co/dpEmg9oX2W https://t.co/uSsaz5IXUn","date":"Wed Jul 14 19:50:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The U.S. should absolutely do what we can to support peace and reconstruction in Afghanistan. \n\nBut the irony here is ridiculous. \n\nJust a thought: Maybe we should’ve considered these consequences before invading 20 years ago to begin with? \n\nNo more endless wars.","date":"Wed Jul 14 15:06:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Perhaps we need a re-entry fee of $2 billion to come back into Earth's orbit?\n\nThat's one way to get billionaires to pay their taxes. \n\nhttps://t.co/vY9rlgtVoh","date":"Tue Jul 13 20:37:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Not a single one.","date":"Tue Jul 13 18:25:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thousands of people are still living with the consequences of the Trump administration’s xenophobic Muslim ban. \n\nMy amendment with @RepGraceMeng, @RepEspaillat, and @NormaJTorres would reissue diversity visas to those whose visas expired while this racist policy was in place. https://t.co/kNeaDIfU3X","date":"Tue Jul 13 17:29:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Standing with @SEIU and thousands of care workers today who are demanding to be respected, protected, and paid. \n\nInvesting in our caregiving workforce will create good-paying union jobs, boost our economy and support our seniors. A no-brainer. #CareIsEssential","date":"Tue Jul 13 15:27:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can you imagine having a federal minimum wage that actually reflected America's cost of living? #RaiseTheWage https://t.co/EZ9mIn42D5","date":"Mon Jul 12 20:43:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Do you brie-lieve in magic?\n\nThis week's throwback #MagicMonday is all about the power of cheese.\n\nhttps://t.co/e7ehNCYl7l","date":"Mon Jul 12 14:03:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"FILL IN THE BLANK ⬇️\n\nWe need to __________:","date":"Fri Jul 09 19:58:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Climate change is destroying our infrastructure and our planet. We have to invest in BOTH. \n\nAn infrastructure deal that addresses our climate crisis head-on will kickstart our economy and create jobs for years to come.","date":"Fri Jul 09 14:20:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Couldn’t make it to our town hall tonight? No problem! \n\nHead over to https://t.co/222QDVq8aY now and follow along live.","date":"Thu Jul 08 23:12:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joined @KidsForwardWI and State Rep. Sheila Stubbs today to speak about the #ChildTaxCredit that qualifying Wisconsinites will begin receiving on July 15. \n\nThese payments will help families:\n\n🍲 Put food on the kitchen table\n⛽ Put gas in the car\n🧒🏻 Pay for child care\n&amp; more. https://t.co/s2Ad38lHDe","date":"Thu Jul 08 20:45:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Zero. 👏","date":"Thu Jul 08 14:35:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"TODAY: Are you RSVP'd for my town hall in Madison with @StateRepHong?\n\n Register now ➡️ https://t.co/o8GBa1n0WT https://t.co/lEdDKJrrDj","date":"Thu Jul 08 13:22:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On July 15th, qualifying families will begin receiving monthly #ChildTaxCredit payments. \n\nIn Wisconsin's 2nd Congressional District, more than 134,000 children could benefit from this expansion. That's 83% of all children in our district.\n\nLearn more at https://t.co/7evaGAUrF0.","date":"Wed Jul 07 20:36:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Why didn’t Mitch McConell vote for helping his constituents? Because he made more campaign cash by not. His words.","date":"Wed Jul 07 14:35:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"TOWN HALL REMINDER: Don't forget to RSVP to my town hall in Madison with @StateRepHong this Thursday at 6PM CT. \n \nMore info ➡️➡️ https://t.co/o8GBa1n0WT https://t.co/JWBvuBKtnR","date":"Tue Jul 06 19:42:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Heads up, Wisconsinites: If you are considering traveling internationally, apply early! Passport processing is taking up to 18 weeks for routine service and 12 weeks for expedited service.\n \nTo renew your passport or to apply for a new passport, visit https://t.co/xVnJkCqegK.","date":"Tue Jul 06 17:27:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need to redefine what defense and national security means in this country. \n\nThat begins by cutting the Pentagon’s budget and reinvesting in the American people. https://t.co/ZL6bvrVKEE","date":"Tue Jul 06 16:17:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week’s #MagicMonday is all about the importance of listening to your constituents. \n\nGive it a watch and then RSVP for my town hall in Madison this Thursday ⬇️\nhttps://t.co/9XI8NgqgLi\n\nhttps://t.co/byMXKhKkgK","date":"Mon Jul 05 14:34:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wishing a safe and happy #4thofJuly to all! https://t.co/852Kt8uSJh","date":"Sun Jul 04 16:04:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Apply for an internship in my office today! Learn more at https://t.co/icXJxJYXJZ. https://t.co/3iIal9YcGC","date":"Fri Jul 02 21:56:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We could end homelessness in America by cutting the Pentagon's budget by just 5%.","date":"Fri Jul 02 17:28:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thanks to @POTUS’s leadership &amp; Democrats’ efforts to pass the #AmericanRescuePlan, we’ve put: \n\n✅ People back in jobs\n✅ Shots in arms \n✅ Money in pockets \n\n@GOP would be smart to work with us. \n\nhttps://t.co/4npFeNlGEE","date":"Fri Jul 02 15:06:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"SECURED: $18 million in funding for transportation projects in Wisconsin's 2nd Congressional District with House passage of the #INVESTAct. \n\nThese projects would be transformative to revitalizing South Central Wisconsin infrastructure. Learn more: https://t.co/mKjfSm8gnD https://t.co/VbqiMLmdm6","date":"Thu Jul 01 17:12:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good. It’s about time we get rid of this offensive and burdensome requirement. \n\nLet’s take it a step further and guarantee federal protections for all gender diverse people.","date":"Wed Jun 30 18:21:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's good policy to lift people out of poverty. #RaiseTheWage","date":"Wed Jun 30 16:15:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Wisconsin @GOP continues to stand by an education budget that could jeopardize billions of dollars in federal funding for our children. \n\nToday I led a letter w/ fellow JFC alum @RepGwenMoore to urge the @GOP to take caution before submitting the proposal for final passage. https://t.co/iaeCIYagsL","date":"Tue Jun 29 20:21:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A reminder that it is still legal to discriminate against LGBTQ+ Americans.","date":"Tue Jun 29 15:27:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"👇 #SaveSilwan.","date":"Tue Jun 29 13:44:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I’ll be live this morning at 8am ET on @cspanwj. Tune in!","date":"Tue Jun 29 11:25:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today we reflect on the sacrifices made by LGBTQ+ Americans, led by  trans women of color, during the #StonewallRiots. \n\nAs anti-trans violence continues to rise, we must do more. \n\nWe can begin by passing the #EqualityAct into law. https://t.co/gWRAsLew7M","date":"Mon Jun 28 18:41:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ever wonder what goes into drafting legislation? \n\nThen you'll want to check out this week's throwback #MagicMonday with @RepDebDingell as we dive into the creative process of drafting a bill.  \n\nhttps://t.co/BVclf85qCF","date":"Mon Jun 28 14:44:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Joined @POTUS today for the bill signing to designate #Pulse nightclub as a National Memorial and honor the victims of this horrific tragedy. \n\nWe must keep up the fight to end perpetual violence against our LGBTQ+ communities and gun violence in America. https://t.co/9jbeRWxiMw","date":"Fri Jun 25 18:48:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"TOWN HALL ANNOUNCEMENT: Join @StateRepHong and I on Thursday, July 8 to discuss the critical issues affecting Wisconsinites. \n\nRSVP now: https://t.co/o8GBa1n0WT. https://t.co/0X1W0XFzLq","date":"Fri Jun 25 17:43:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today I asked @SecBlinken to work with his Israeli counterparts to end the arrest and arbitrary detention of Palestinian journalists. \n\nFreedom of the press must be protected everywhere. https://t.co/G1d10ZK4W9","date":"Thu Jun 24 17:33:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Let’s be clear: We need to raise the minimum wage.","date":"Thu Jun 24 14:49:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Great! Now let’s pass a Green New Deal.","date":"Wed Jun 23 19:00:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Unacceptable: 3 in 5 workers 45+ are affected by age discrimination. \n\nToday, I'm proud to vote for legislation that will restore workplace protections for older Americans. #JusticeforWorkers https://t.co/E1dIvxDEGm","date":"Wed Jun 23 17:20:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"An arcane set of rules is currently enabling @GOP senators to dodge the will of two-thirds of the American people. \n\nEnough. End the filibuster.","date":"Tue Jun 22 20:52:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Another night of violent outbursts by Israeli settlers against Palestinian residents in #SheikhJarrah. \n \nHow many Palestinians must be displaced from their homes, attacked, or killed before the United States demands an end to Israel's state-sanctioned police violence?","date":"Tue Jun 22 16:06:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Tuesday! Today's a beautiful day to put people over profit. #TaxTheRich","date":"Tue Jun 22 13:45:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"As of today, student loan borrowers in the United States owe a collective $1.8 trillion. \n\nImagine the amount of student debt we could cancel by choosing not to increase a bottomless Pentagon budget.","date":"Mon Jun 21 19:49:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Remember when @amazon launched an anti-union campaign against their employees instead of just ensuring safer working conditions, proper wages, and sufficient break time? \n\nI do. We need the #PROActNow. \n\nhttps://t.co/VtJeZkDoie","date":"Mon Jun 21 18:35:09 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week, I'll join my colleagues on @AppropsDems to begin the process of solidifying a spending budget for Fiscal Year 2022. \n\nToday we're posting a #MagicMonday on all the different numbers needed to make up a budget. Watch here ⬇️\n\nhttps://t.co/Bv6WHU3fwA","date":"Mon Jun 21 13:13:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wishing a happy #FathersDay to all the dads &amp; father figures in Wisconsin and across the country! https://t.co/x3rdjYhDtP","date":"Sun Jun 20 15:29:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Friday reminder that the continued expansion of Israeli settlements in Palestine is illegal under international law.","date":"Fri Jun 18 15:52:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The #PROAct would protect the rights of every American worker. \n\nPassing this bill should be a no-brainer for the \"party of working people,\" right @senategop?","date":"Thu Jun 17 19:44:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Putting an end to bottomless Pentagon budgets starts with ending endless wars.\n\nProud to have just passed @RepBarbaraLee's bill to repeal the outdated and overused 2002 Authorization for the Use of Military Force Against Iraq. https://t.co/FpvX1IVovU","date":"Thu Jun 17 15:32:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There is absolutely no justification to have a 19-year old Authorization for the Use of Military Force. #StopEndlessWar","date":"Thu Jun 17 14:42:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For almost 20 years, the 2002 AUMF has been used as an excuse to justify decades of endless wars abroad—without Congressional approval.\n\nTomorrow, I will proudly vote for @RepBarbaraLee's bill to repeal this outdated justification for war-mongering &amp; bottomless Pentagon budgets. https://t.co/5bnS5HJzKD","date":"Wed Jun 16 20:26:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We already knew @elonmusk was a union-buster.\n\nNow listen to Richard Ortiz, an ex-Tesla worker, who was interrogated and fired for trying to organize a union.\n\nHey Elon, it's illegal to fire workers for unionizing.","date":"Wed Jun 16 19:46:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No one should be denied a chance at a higher education just because they can't afford it.\n\nToday, @BobbyScott, @maziehirono, @PattyMurray &amp; I introduced legislation to double the Pell Grant, permanently index it to inflation, &amp; expand access to DREAMers.https://t.co/yQsMI6DE8C","date":"Wed Jun 16 18:30:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Did you know that every worker deserves a union?","date":"Wed Jun 16 16:14:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Friendly reminder that we do not need any new nuclear weapons.","date":"Tue Jun 15 15:17:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Last week, after over a year of social distancing, I got to travel across our state to talk to the great people of Wisconsin's 2nd District.\n\nToday's #MagicMonday is a throwback with @GovMLG to remind us: it's all about the constituents. \nhttps://t.co/eWVOUvdF0a","date":"Mon Jun 14 13:44:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Start your Saturday by reading this integral piece by @SecDebHaaland.","date":"Sat Jun 12 14:02:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Great to also see Reedsburg Mayor Dave Estes &amp; City Administrator Tim Becker, who showed me around the site of a new community center and housing coming soon to Reedsburg! https://t.co/90gBCKTbAx","date":"Fri Jun 11 19:44:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It was great to meet Baraboo's new mayor, Mayor Rob Nelson, and City Administrator Casey Bradley as I traveled across Wisconsin's 2nd Congresional District today! https://t.co/8C4DnC1RQq","date":"Fri Jun 11 17:15:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Tune in to today's @ClimateCrisis hearing to listen to Madison's own @MayorOfMadison discuss the urgent need to protect Wisconsin communities from the global threat of climate change!","date":"Fri Jun 11 16:06:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #Pride, I want to honor Madison's own Patrick Farabaugh. \n\nPatrick is the founder of @MadGayHockey—the world's largest LGBTQ+ hockey league.\n\nHe's also founder &amp; publisher of Wisconsin's only LGBTQ+ magazine, @OurLivesWI.\n\nWisconsin is lucky &amp; proud to have you Patrick! https://t.co/rsro7c0VJX","date":"Fri Jun 11 15:11:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I am once again asking the Wisconsin @GOP to just do their jobs in Wisconsin.","date":"Fri Jun 11 14:26:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Wisconsin state @GOP's inaction is about to cost Wisconsinites $2.3 billion in federal aid for our students, schools &amp; teachers.\n\nBut glad to see they're spending their time in...Arizona?","date":"Thu Jun 10 17:30:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"So it wasn't a worker shortage after all...just a shortage of living wages.","date":"Thu Jun 10 13:54:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The COVID-19 pandemic has proven just how important caregiving is to American families, jobs &amp; our economy. \n\nThe American Families and Jobs Plans makes a critical investment in our #CareEconomy, so we can all get back to work knowing our loved ones are safe &amp; cared for. https://t.co/n57zP3ACT5","date":"Wed Jun 09 18:27:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We do not need a $753,000,000,000 defense budget.\n\nWe do need healthcare, housing, education, climate security &amp; jobs. https://t.co/ajCM7nJGoP","date":"Wed Jun 09 16:31:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thanks to the @ADRCSouthwestWI for having me today in Monroe.\n\nAnd of course, I had to make a stop at @NorthwoodsPremi in Beloit.\n\nGreat to be traveling across the 2nd District today! https://t.co/gP6YxmzH1I","date":"Tue Jun 08 19:44:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Roe v. Wade is the floor for reproductive healthcare—not the ceiling—and it's under attack.\n\nIt’s time for Congress to pass the Women's Health Protection Act to ensure that the constitutional right to abortion is protected &amp; accessible for everyone. #ActForAbortionAccess https://t.co/HFu6n9Xdqr","date":"Tue Jun 08 18:31:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, I sent a letter to @Venmo asking about reports that their platform is blocking Palestinian-related transactions—including recent humanitarian fundraising efforts.\n \nI would like to know why a large corporation like @Paypal is possibly discriminating against Palestinians? https://t.co/DfPKq8HDAE","date":"Tue Jun 08 17:04:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Great to meet with the @StatelineBGC today at the site of what will be their new building.\n\nAfter almost 60 years of being in the same building, I'm glad young Wisconsinites will have a new space to grow in! https://t.co/QNBCgV68Eq","date":"Tue Jun 08 16:06:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"From 2014-2018, @JeffBezos paid less than 1% in taxes.\n\nIn 2007, he paid nothing.\n\nHow much do you think @amazon workers paid?\n\nTax the rich.","date":"Tue Jun 08 13:05:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There is no place &amp; no excuse for the hateful rise in antisemitism occurring in our country.\n\nI joined over 130 of my colleagues urging President Biden to act now against this indefensible increase in antisemitic incidents.","date":"Mon Jun 07 14:19:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #MagicMonday! \n\nHere's a throwback trick with the governor that has led Wisconsin through a pandemic—getting over 5,000,000 COVID-19 vaccine shots in arms—Wisconsin's own @GovEvers. https://t.co/F6liPVZASQ","date":"Mon Jun 07 13:04:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Over 50% of voters across the political spectrum support both the PRO Act &amp; the For the People Act.\n\nImagine that, worker’s rights &amp; voting rights are actually bipartisan.\nhttps://t.co/hRQPnfjUd9","date":"Sun Jun 06 20:16:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We didn't need an op-ed to know you're unwilling to protect our democracy. \nhttps://t.co/fTmhsljy0h","date":"Sun Jun 06 13:02:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Rethinking our national security starts with cutting the Pentagon's budget. https://t.co/1yLK1WYmRn","date":"Sat Jun 05 15:19:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There have been 244 mass shootings already this year.\n\nToday, I #WearOrange on Gun Violence Awareness Day to remember the lives that could have been saved if the @SenateGOP cared enough.\n\nThe epidemic of gun violence is preventable. https://t.co/FHk0uVr9ur","date":"Fri Jun 04 16:18:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"There's no #pride in war-mongering. https://t.co/29mTlF240p","date":"Fri Jun 04 14:48:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We cannot let corporations profit off misclassifying workers anymore.\n\nGig workers—like every employee—deserve the right to unionize.\n\nWe need the #PROAct.","date":"Thu Jun 03 19:36:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If we want to build back better, we should not be funding Donald Trump's $1.5 trillion nuclear weapons plan.\n\nThat money could pay for a whole other American Rescue Plan.\nhttps://t.co/BRH3Gzv302","date":"Thu Jun 03 17:03:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a union.","date":"Thu Jun 03 13:41:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No, it doesn't.","date":"Wed Jun 02 20:26:12 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What if we cut the defense budget and used the money to actually help the American people? https://t.co/nUTYy3tPZ9","date":"Wed Jun 02 17:22:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's #Pride!\n\nA month of celebration in defense of LGBTQ+ rights—a celebration built by the resistance of Black and brown trans women.\n\nSo far this year, almost 30 trans people have died in at the hands of anti-trans violence.\n\nNone of us are free until all of us are free.","date":"Tue Jun 01 21:09:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I cannot believe I have to say this: we should not use Nazi-style gas chambers to kill people.\n\nEnd the death penalty.\nhttps://t.co/3Qdzo4EFM0","date":"Tue Jun 01 18:23:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"One of Amazon's recent excuses for treating their workers so poorly was that it's an \"industry-wide issue.\"\n\nWell, @amazon warehouse workers are twice as likely to suffer serious injuries than workers at other warehouses.\n\nSeems like an @amazon problem, actually.","date":"Tue Jun 01 16:26:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Maybe we shouldn't keep giving defense contractors billions of taxpayer dollars to build broken things.","date":"Tue Jun 01 12:53:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"On #MemorialDay, we remember those that sacrificed their lives in their service for our country. \n\nLet's honor their memory by ensuring that every veteran who does return home recieves the healthcare, social services &amp; support they deserve.","date":"Mon May 31 17:42:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Personally, I don't think the defense budget should be 86x the size of the CDC budget. https://t.co/IPqoB2yniQ","date":"Sun May 30 00:46:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Birthday to the great state of Wisconsin! \n\n173 never looked so good! 🦡 https://t.co/q7UXanbH21","date":"Sat May 29 22:37:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A $753,000,000,000 defense budget is a failure.\n\nJob security, healthcare security, housing security, climate security—these are the national security crises we should be defending our nation against—not more futile wars abroad or lucrative contracts for defense corporations. https://t.co/arF78k8w68","date":"Fri May 28 18:13:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Believe the @GOP when they show you who they are.\n\nIf you needed another reason to #EndTheFilibuster, here's 35.","date":"Fri May 28 17:15:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"CONFIRMED: The @usedgov just let us know that the Wisconsin @GOP's insufficient education budget proposal would disqualify Wisconsin from receiving $1.5 billion in federal COVID aid for students, schools, colleges &amp; universities.\n\n@GOP, stop playing games &amp; fund education. https://t.co/ChaYCXbYAl","date":"Fri May 28 16:34:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Wisconsin @GOP is about to screw Wisconsinites out of $1.5 billion in federal COVID aid for students, schools, colleges &amp; universities.\n\nThe @GOP barely showed up to work in the last year, but somehow made time to threaten billions in federal food, healthcare &amp; education aid.","date":"Fri May 28 14:51:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today is a great day to cut—not increase—the Pentagon's $740,000,000,000 budget.","date":"Fri May 28 12:54:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's not \"bipartisanship\" if it doesn't actually help people.","date":"Thu May 27 17:36:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Alternatively, they could also treat their workers better &amp; stop union-busting.","date":"Thu May 27 16:29:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Munduruku Indigenous leaders are being attacked by armed illegal gold miners in their own homes.\n\nWe cannot let the Amazon be destroyed &amp; its indigenous population attacked—Brazilian authorities must remove armed illegal miners from Munduruku territory. #DefendEarthDefenders","date":"Thu May 27 14:49:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"After living through a global pandemic, make it make sense.\n\nCut the Pentagon's budget. https://t.co/tMLwQ2iDop","date":"Wed May 26 18:11:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Yesterday, the Wisconsin @GOP spent less than a minute in session to reject $1.6 billion in federal aid &amp; oppose making healthcare cheaper for 91,000 Wisconsinites.\n\nBut today, they found time to have three transphobic hearings to try and discriminate against kids playing sports.","date":"Wed May 26 13:46:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Can you imagine surviving a pandemic that killed thousands...then rejecting $1.6 billion in federal aid AND opposing making healthcare affordable for 91,000 more people?\n\nWell, the Wisconsin @GOP just did that.\n\nWhy help the people you serve, right?\nhttps://t.co/HbbmB6391z","date":"Tue May 25 20:12:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ending endless wars should mean ending bottomless Pentagon budgets. https://t.co/6zrURlWp9L","date":"Tue May 25 18:13:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A year ago today, George Floyd was killed.\n\nIt shouldn't have taken the murder of another Black man for Congress to take action on police violence.\n\nThis isn't about just one murder—it's about a broken policing system.\n\nThe least we can do is pass the Justice in Policing Act. https://t.co/1vTswqSTTF","date":"Tue May 25 15:44:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Let's remember that it's white Christian nationalists that have popularized and spread hate in our country—both antisemitism &amp; Islamophobia—and turned it into a brand to sell to their followers.\n\nLet's stand up together against all forms of hate &amp; end white supremacy. https://t.co/dPO3dA6gRA","date":"Tue May 25 14:12:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Patiently waiting for @GOP deficit hawks to condemn this outsized spending...","date":"Mon May 24 22:36:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Do you think our defense budget should be higher than Donald Trump's defense budget?\n\nI don't.","date":"Mon May 24 20:07:19 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A ceasefire is not a greenlight to forcibly displace Palestinians from their homes in Sheikh Jarrah.\n\n@SecBlinken must demand Israel stop the violent removal of Palestinians from the homes they've lived in for generations. #SaveSheikhJarrah","date":"Mon May 24 16:45:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today's throwback #MagicMonday reminds us that the @GOP live in a distorted reality.\n\nLike when they call themselves the party of \"working people,\" but vote against COVID relief, raising the minimum wage &amp; protecting union rights. \nhttps://t.co/rDrX7nn9aK","date":"Mon May 24 14:08:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wages are rising too quickly?\n\nDoes @SenRonJohnson know that the minimum wage hasn't increased in 12 years?","date":"Sun May 23 16:02:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Friday message to the @GOP, courtesy of the @LindaLindas_.","date":"Fri May 21 22:29:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Withdrawing troops from Afghanistan could save us $50,000,000,000.\n\nThat means the Pentagon's budget should be cut by at least $50,000,000,000.\n\nWe're urging @POTUS to use this peace dividend to fund the American people's needs.\n\nWhy not, for example, end homelessness in America? https://t.co/msO9ORgCjD","date":"Fri May 21 15:26:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is horrible.\n\nThroughout this pandemic, corporations put profits above workers' lives—too often it was frontline migrant workers who paid the price. \n\nA paycheck should not be a death sentence.\n\nWe cannot shield corporations from accountability—we must protect every worker.","date":"Fri May 21 14:20:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A ceasefire is a crucial first step to end the current violence.\n\nBut this didn't just start 12 days ago.\n\nThis is about decades of Israel's home demolitions, illegal settlement expansion, blockades in Gaza + Hamas' rocket fire.\n\nThe US must do more to promote peace &amp; justice.","date":"Thu May 20 23:50:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"How can we possibly go forward with a weapons sale to Israel right now? https://t.co/gRnx0qmLrV","date":"Thu May 20 20:03:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Just a peaceful protest where people peacefully broke into the Capitol, destroyed &amp; stole property,  beat &amp; bludgeoned Capitol police officers, tried to stop an election from being certified, and threatened violence against members of Congress.\n\nDefinitely not an insurrection!","date":"Thu May 20 15:00:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Are these the surgical, targeted attacks against Hamas we keep hearing about? \n\nJust like the 65 Palestinian children that are now dead?\n\nWe need a cease-fire immediately.","date":"Thu May 20 13:29:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need a cease-fire now—giving Israel $735,000,000 worth of weapons won't get us any closer to that. https://t.co/UjxQ3YeTJV","date":"Thu May 20 03:03:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Alongside over 130 members of Congress, I am urging @POTUS to demand an immediate cease-fire in Israel &amp; Palestine.\n\nNo more lives should be lost. https://t.co/jEc2uZcgOS","date":"Wed May 19 21:55:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's almost as if raising the minimum wage is good for workers, businesses &amp; customers alike.","date":"Wed May 19 19:58:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need @POTUS to demand a cease-fire immediately.\n\nWe cannot just wait this violence out while Palestinians are being killed with US-funded weapons.\nhttps://t.co/YaH1qe4i3I","date":"Wed May 19 15:07:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We need an immediate cease-fire @POTUS.\n\nI joined @hereandnow to explain why this isn't a conflict that started this month.\n\nThis is about decades of mistreatment of Palestinians, the continued expansion of illegal Israeli settlements, &amp; U.S. complicity. https://t.co/fvmHYuVL6t","date":"Tue May 18 23:11:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Behind-the-scenes look at the @GOP who refused to wear a mask on the House floor posing for a group picture.\n\nSo brave... https://t.co/HVosGQvqZa","date":"Tue May 18 22:19:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A reminder that 16 million people in Yemen are going hungry.\n\nYemenis are without food, water or electricity—@POTUS must demand the Saudi government #EndTheBlockade immediately. https://t.co/q0eex4PUOt","date":"Tue May 18 19:08:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We should not be giving Israel another blank check for war.\n\nWe should not be allowing any more homes, press offices or apartment buildings to be destroyed with a disproportionate amount of force.\n\nWe must demand a cease-fire immediately &amp; a commitment to protecting human rights. https://t.co/rml7BlJKky","date":"Tue May 18 17:27:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is the right decision. \n\nOver 200 Palestinians are dead—including 61 children.\n\n10 people in Israel—2 kids—are dead.\n\nHomes, roads &amp; news offices have been destroyed in Gaza.\n\nAnother blank check for Israel is not going to end this violence.\n\nThe US must demand a cease-fire.","date":"Tue May 18 02:24:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Abortion is a constitutional right.\n\nBased on the Supreme Court's own rulings, this case should have already been dismissed.\n\nIf they can't defend constitutional rights, then Congress must act to protect reproductive freedom.","date":"Mon May 17 17:34:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Amazon says it will invest $300 million into \"safety projects\" for its workers in 2021.\n\nThat is only 0.2% of the $108.5 billion in revenue it earned in the first three months of 2021.","date":"Mon May 17 16:23:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"Some Democrats and economists\" is actually just Larry Summers—who I suppose is technically a \"Democrat\"  &amp; \"economist\"—but the media should probably talk to more than just one person who consistently opposes helping the American people.","date":"Mon May 17 15:41:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's #TaxDay! \n\nHere's a throwback #MagicMonday to remind you that the #GOPTaxScam helped the wealthiest top 1% &amp; the @GOP's corporate allies—not everyday Americans.  \nhttps://t.co/zgzsatpzoj","date":"Mon May 17 14:38:24 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Palestinians in Gaza live in an open-air prison under air, land &amp; sea blockade with little access to water, food, electricity &amp; healthcare.\n\nIsrael keeps expanding illegal West Bank settlements.\n\nThis isn't about just the last week, but about decades of human rights violations.","date":"Sun May 16 02:51:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congrats John Rohrer—medical center director at Madison’s Middleton Memorial Veterans Hospital—for winning the @SecVetAffairs Award for Excellence in Nursing &amp; Advancement of Nursing Programs!\n\nThank you to the VA hospitals nationwide for serving our vets!\nhttps://t.co/uwfYKxTuzL","date":"Sun May 16 00:49:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@laila_barhoum Thank you for sharing your experience during this unthinkable time Laila. Your voice deserves to be heard!","date":"Fri May 14 22:37:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"We are exhausted. Day after day, we watch the bombs fall on homes where our friends &amp; family live and buildings where our colleagues work, wondering if we will be next.\"\n\nPlease read Laila Barhoum's op-ed describing life for Palestinians living in Gaza, under attack right now.","date":"Fri May 14 18:31:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Friday reminder to listen to our only Palestinian member of Congress, @RashidaTlaib, and remember that even if some folks don’t want to acknowledge Palestinians—they do exist and their human rights do matter.\nhttps://t.co/fxWmRX0FGp","date":"Fri May 14 14:12:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, my colleagues and I stood up because no one should suffer the loss of life, liberty, or dignity that the Palestinian people have suffered.\n\nIf you are neutral in situations of injustice, you have chosen the side of the oppressor. https://t.co/R1mSiP2QZA","date":"Thu May 13 23:29:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you cannot even acknowledge the humanity of the Palestinian people, then you're not actually defending human rights.","date":"Thu May 13 21:29:29 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, @RepMarieNewman &amp; I will be leading a special order hour to discuss the violence in Palestine &amp; Israel.\n\nWe cannot pick and choose whose humans rights we defend. \n\nTune in shortly: https://t.co/lIIunutf0j","date":"Thu May 13 21:11:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thanks to all our colleagues who joined us in this effort. https://t.co/tPQgksiyEk","date":"Wed May 12 22:22:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We can't allow the forced displacement of Palestinians who have lived in Sheikh Jarrah for generations.\n\n@RepMarieNewman &amp; I led our colleagues urging @SecBlinken to demand Israel stop this displacement.\n\nEven our allies must be held accountable for human rights violations. https://t.co/PiKAJPXGuz","date":"Wed May 12 22:22:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Eligible households can enroll by contacting their internet service provider and asking to sign up.\n\nTo learn more – including whether you qualify – visit: https://t.co/nM91EaoMog","date":"Wed May 12 17:18:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Enrollment for the Emergency Broadband Benefit—which will provide qualifying families a discount on monthly internet bills—opens today!\n \nAs a member of the Rural Broadband Taskforce, I am proud to fight to bring broadband to all Wisconsinites.\n\nhttps://t.co/nM91EaoMog","date":"Wed May 12 17:17:06 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm seeing a lot of right-wing extremists criticize my wonderful colleague, @IlhanMN, because she rightly condemned the murder of Palestinian children &amp; Israel's violence against Palestinians in Sheikh Jarrar &amp; at Al-Aqsa.\n\nI did the same, wonder why they're not criticizing me?","date":"Wed May 12 02:06:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank you @SenSanders!\n\nThe Pentagon's bloated budget increases every year without any oversight.\n\nIt's time to cut the Pentagon's waste.","date":"Tue May 11 19:49:08 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If there's one thing that @Amazon's union-busting in Alabama proved, it's that workers need the #PROAct.","date":"Tue May 11 19:17:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It should not be this difficult to condemn the murder of Palestinian children.","date":"Tue May 11 17:52:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Live feed of the @SenateGOP defending voter suppression. 🤡\nhttps://t.co/6qQSxId9mT","date":"Tue May 11 17:15:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Agreed.\n\nWe cannot just condemn rockets fired by Hamas and ignore Israel's state-sanctioned police violence against Palestinians—including unlawful evictions, violent attacks on protestors &amp; the murder of Palestinian children.\n\nU.S. aid should not be funding this violence.","date":"Tue May 11 02:20:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Thank you @POTUS, no one should be denied health care because of who they are or who they love.\n\nThey also shouldn't be denied housing, education or employment.\n\nNext, the Senate must pass the #EqualityAct.","date":"Mon May 10 17:35:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #MagicMonday! Here's a throwback to a year ago reminding us of the importance of wearing a mask, social distancing, &amp; washing your hands to #StopTheSpread. https://t.co/Wna06YDbh5","date":"Mon May 10 14:06:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy Mother's Day to my mom &amp; all the moms out there today! https://t.co/edBrcSMdUf","date":"Sun May 09 19:36:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Saturday night reminder that union-busting is disgusting. 🚀","date":"Sun May 09 04:07:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"When the tyranny is profitable:","date":"Sat May 08 18:14:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Attention corporate America: Pay your workers more.","date":"Fri May 07 18:12:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Sounds like the Chamber's corporate members need to pay their workers a living wage.","date":"Fri May 07 16:37:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"You voted for a $1.5 trillion tax cut for the rich.\n\nYou voted for a $740 billion defense budget. \n\nBut increasing corporate CEO's taxes will add to our deficit?","date":"Fri May 07 13:51:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"These corporations will spend millions on everything except their workers.","date":"Fri May 07 03:23:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"100% of Mitch McConnell's focus is on \"stopping this new administration.\"\n\nWell, Democrats want to actually help the American people.\n\nThat's why we need to #EndTheFilibuster. https://t.co/FM4kEv87Ym","date":"Thu May 06 21:41:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Colombian National Police's violent repression of protests in the country has killed at least 24 people, with even more \"disappeared.\"\n\nThis reprehensible violence cannot be supported by US aid.\n\nSolidarity with the people of Colombia protesting and facing this violence.","date":"Thu May 06 20:14:19 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Join me today for a Q&amp;A on the filibuster!\n\nI'll be talking filibuster reform and taking your questions on Facebook Live.\n\nSee you there at 12:30 PM CT on https://t.co/SBzWIuyby7! https://t.co/HG3uOLQtAk","date":"Thu May 06 14:10:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The Israeli police violence against Palestinians in Sheikh Jarrah is completely unacceptable. \n\nThe Israeli military is forcing hundreds of Palestinians out of their homes. \n\nUS taxpayer dollars should not fund annexation of Palestinian land or destruction of Palestinian homes.","date":"Thu May 06 00:51:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's almost as if Big Pharma relies on keeping life-saving medicine inaccessible.","date":"Wed May 05 21:01:05 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is great news.\n\nThis is a global pandemic and it deserves a global response.\n\nSaving Lives &gt; Big Pharma's Profits","date":"Wed May 05 19:40:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Shouldn't 100% of your focus be, I don't know, passing laws &amp; helping the American people?","date":"Wed May 05 16:40:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A new study from @CIPolicy found that about half of the Pentagon's $740 billion budget goes to private defense contractors. \n\nCan someone explain how lining the pockets of defense corporations makes us safer?\nhttps://t.co/gTxfxL575W","date":"Wed May 05 15:54:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Join me this Thursday for a Q&amp;A on the filibuster.\n\nI'll be on Facebook Live—discussing the need for filibuster reform and answering all your questions!\n\nSee you there at 12:30 PM CT on https://t.co/SBzWIuyby7! https://t.co/VuIBwke1Cs","date":"Wed May 05 03:10:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"India is being devastated by the COVID-19 pandemic.\n\nI joined 110 of my colleagues demanding @POTUS support a #TRIPSWaiver, so the world has access to life-saving COVID vaccines.\n\nWe must put people's lives over Big Pharma's profits. #FreeTheVaccine https://t.co/HuQSZ1KQxq","date":"Tue May 04 19:16:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I'm in Milwaukee ready to hear our @VP discuss how the American Jobs Plan will improve the lives of all Wisconsinites! https://t.co/56b81b1J9B","date":"Tue May 04 18:25:19 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"If the public wants to think more than thank, it needs to end the legislative madness: reassert Congress’ war powers, clip the Pentagon’s brass parachutes and rationalize the military budget.\"","date":"Tue May 04 14:43:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"When it comes to our military, the mantra of the public has become: Thank, don’t think.\"\n\nA great read by Afghan War vet, @EdstromErik, on why we have a duty to question &amp; criticize our nation's war-mongering.\nhttps://t.co/bDn19q52SE","date":"Tue May 04 14:43:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We must be a nation committed to welcoming refugees.\n\nThis an integral step towards fulfilling your promise, \n@POTUS.\n\nWe won't stop demanding a more humane immigration system until it is a reality for every person who comes to this country.","date":"Mon May 03 21:08:52 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"In just 7 years, our defense budget has increased to $740,000,000,000.\n\nFor what?\n\nThe American people need health care not more aircraft carriers.","date":"Mon May 03 18:19:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #MagicMonday, we're throwing it back to a trick that's all magic—no politics—at Wisconsin's own @WollersheimWine!\nhttps://t.co/jbUMSFmUCU","date":"Mon May 03 14:32:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My heart is with the Oneida Nation, Ashwaubenon &amp; Green Bay communities, the injured victims, &amp; the families of those whose lost their lives. \n\nGun violence is an epidemic that will continue until every legislator treats it with the urgency the American people deserve.","date":"Sun May 02 21:19:56 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Supporting working people means support their right to unionize.","date":"Sat May 01 20:30:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"#MayDay Challenge:\n\nEnd the filibuster &amp; protect every worker’s right to unionize by passing the #PROAct.\n\nHappy International Workers Day!","date":"Sat May 01 16:03:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Friday reminder that every worker deserves a union.\n\nNow enjoy your weekend (courtesy of unions)!","date":"Fri Apr 30 23:51:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week, more abortion restrictions were signed into law than any other week in the last decade.\n\nTake that in for a second.\n\nA reminder to the @GOP: abortion is a constitutional right. \n https://t.co/uiM0cPHCNI","date":"Fri Apr 30 18:04:07 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A reminder that anti-trans legislation is rooted in hate—not reality.","date":"Fri Apr 30 15:55:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Must be nice to profit off a pandemic &amp; union-busting.\nhttps://t.co/764HB1OFap","date":"Thu Apr 29 22:14:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's almost as if Wall Street relies on the exploitation of workers!","date":"Thu Apr 29 16:28:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Gig workers—like any employee—deserve the right to organize &amp; unionize.\n\nThe #PROAct would let them.\n\nWe cannot let corporations profit off of misclassifying workers anymore.","date":"Thu Apr 29 16:03:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every worker deserves a union.\n\nYou heard the @POTUS, it's time to pass the #PROAct.","date":"Thu Apr 29 02:28:20 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"If you're an elected official, you should want to make voting easier for every person in this country.\n\nIf you don't, why do you represent our democracy? #JointAddress","date":"Thu Apr 29 02:11:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Trans rights are human rights. #JointAddress","date":"Thu Apr 29 02:04:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"White supremacy is terrorism.\n\nOur policing system is broken.\n\nWe must reimagine public safety in our country. #JointAddress","date":"Thu Apr 29 02:00:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Speaking of Yemen, Yemen is facing the greatest humanitarian crisis in the world.\n\n16 million people—over half of the country's population—are going hungry.\n\nWe must demand Saudi Arabia #EndTheBlockade.","date":"Thu Apr 29 01:57:43 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"End the forever wars.\n\nBring the troops home.\n\nCut the Pentagon's budget.","date":"Thu Apr 29 01:55:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"American foreign policy must be rooted in peace &amp; diplomacy—not more wars &amp; bombs.","date":"Thu Apr 29 01:53:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Say it with me: trickle-down economics has never worked. #JointAddress","date":"Thu Apr 29 01:47:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"How do we pay for the American Jobs Plan?\n\nWell to start, increase taxes on corporations and the extremely wealthy. #JointAddress","date":"Thu Apr 29 01:46:47 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every person in America deserves access to education.\n\nEveryone.","date":"Thu Apr 29 01:44:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"America pays the highest prescription drug prices in the world.\n\nIt's time to lower the cost of prescription drugs by letting Medicare negotiating with Big Pharma. #JointAddress","date":"Thu Apr 29 01:41:54 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We have so much work to do, but I cannot tell you how refreshing it is to hear a pro-union, pro-worker president celebrate our labor movement. #JointAddress","date":"Thu Apr 29 01:33:21 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"No one can survive on starvation wages.\n\nCongress must pass the #RaiseTheWage Act, because every worker deserves a living wage. #JointAddress","date":"Thu Apr 29 01:31:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wall Street did not build this country.\n\nUnions built this country.\n\n@POTUS is right: It's time to pass the Protecting the Right to Organize Act.","date":"Thu Apr 29 01:29:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"#BuyAmerican means investing in American workers, American jobs, and American unions. #JointAddress","date":"Thu Apr 29 01:27:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We are going to combat the climate crisis AND create millions of good union jobs. #JointAddress","date":"Thu Apr 29 01:25:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Every American deserves access to clean water. #JointAddress","date":"Thu Apr 29 01:21:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"The American Rescue Plan has put us on track to cut child poverty in half by the end of the year.\n\nThere's no such thing as helping the American people too much. #JointAddress","date":"Thu Apr 29 01:20:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Everyone over the age of 16 is eligible to get vaccinated.\n\nEveryone.\n\nPlease get vaccinated America. #JointAddress","date":"Thu Apr 29 01:13:28 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #WorkersMemorialDay, we remember all the workers we lost at the hands of inadequate workplace protections &amp; corporate greed.\n\nEvery worker deserves to feel safe in their workplace.\n\nEvery worker deserves a union.\n\nEvery worker deserves the #PROAct.\n https://t.co/wbWdHwzZEX","date":"Wed Apr 28 17:58:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Cut the Pentagon's budget.","date":"Tue Apr 27 15:37:04 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Next time the @GOP tells you that they're the party of working people, ask them to prove it by endorsing the #PROAct.","date":"Mon Apr 26 20:22:07 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Native &amp; Indigenous nations lived, governed, and thrived here before their land was stolen and they were murdered in a mass genocide, you ignorant white supremacist.","date":"Mon Apr 26 15:43:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week's #MagicMonday is a throwback trick that everyone can participate in—try it out yourself! https://t.co/cfVWdkDR2X","date":"Mon Apr 26 14:18:44 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Attention #WI02 high-schoolers: Today is the last day to submit your work for this year's Congressional Art Competition!\n\nhttps://t.co/k5BNpIvM0p","date":"Sun Apr 25 17:15:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Union-busting is disgusting. 🚀🚀🚀","date":"Sat Apr 24 21:15:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your Friday reminder that we don't need to spend $753,000,000,000 on \"defense.\"","date":"Sat Apr 24 00:05:50 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Burmese trade unions &amp; workers are under attack by the Burmese military.\n\nWe stand in strong solidarity with these workers facing violence and fighting for democracy in the face of military rule. https://t.co/ihBUtcKYxG","date":"Fri Apr 23 17:16:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We have extended our deadline for this year's Congressional Art Competition until Sunday, April 25!\n\n#WI02 high-schoolers, submit your work &amp; have your art displayed in the Capitol for an entire year! \n\nLearn more &amp; submit here:\nhttps://t.co/k5BNpIvM0p","date":"Thu Apr 22 19:29:00 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@iamcardib is 100% right.\n\nCongress should be focused on ending police violence against Black people—not policing Black women's bodies.\n\nThis Wisconsin Congressman supports @iamcardib's freedom to express herself and control her own body.","date":"Thu Apr 22 16:19:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For too long, the Senate's outdated rules have blocked progress.\n\nFor voting rights, for workers' rights, for LGBTQ+ rights, for immigrant rights, for justice—it's time to #EndTheFilibuster.\n\nProud to join @RepCori for a better, more just America.","date":"Thu Apr 22 15:01:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy #EarthDay!\n\nWe need a Green New Deal.","date":"Thu Apr 22 14:43:35 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Happy 4/20!\n\nBy the way, it's 2021\n\nLegalize marijuana\n\nAnd remember,\n\nZero people should be in jail for buying, selling or smoking marijuana, so\n\nExpunge records too","date":"Tue Apr 20 20:07:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"After decades of forever wars waged over oil costing trillions of dollars, it’s time we reinvest in the needs of the American people and create a future reliant on renewable energy—not planet-destroying fossil fuels. \n\nProud to co-sponsor the Green New Deal with @AOC.","date":"Tue Apr 20 18:40:34 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Oh no, are you going to stop taking their money?","date":"Tue Apr 20 15:06:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congrats @BadgerVB, #1 gets it done! #GoBadgers","date":"Tue Apr 20 01:57:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Workers in Arizona and Virginia also deserve to have their right to organize protected.","date":"Mon Apr 19 19:52:15 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Your 4/19 reminder that marijuana should be legalized nationwide.","date":"Mon Apr 19 14:22:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week's we're throwing it back to @MichaelKent's special #MagicMonday three-card Monte.\n\nCan you follow the queen? https://t.co/dfiLApSvHP","date":"Mon Apr 19 14:10:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"I talked with @NicholsUprising about  being a proud @GoIUPAT member, why @amazon's social media antics shows the arrogance of corporations that get too big, &amp; how their union-busting proves we need the #PROAct.  https://t.co/hhWmvfICMj","date":"Sat Apr 17 19:06:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We don't need a Ku Klux Klan Kaucus in Congress, thanks.","date":"Fri Apr 16 21:39:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"America didn’t elect Donald Trump in November.\n\nSo why would we continue his cruel and historically low caps on refugees—when thousands need our help?\n\nKeep your promise @POTUS.","date":"Fri Apr 16 20:50:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This is unacceptable.\n\n@POTUS, you made a promise and thousands of refugees are depending on you.\n\nWe can &amp; must do better than Donald Trump.","date":"Fri Apr 16 17:12:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"For 4 years, the Trump administration waged an assault on refugees seeking to come to the U.S. as a safe haven.\n\nProud to join @IlhanMN, @RepJayapal, @janschakowsky, and over 30 of my colleagues to ask @POTUS to act now so we can meet our nation's commitment to welcome refugees.","date":"Fri Apr 16 15:51:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's time to redefine our national security.\n\nJob security, healthcare security, housing security—that's what the American people need—not more bombs and nukes.\n\nWe need to cut the Pentagon's budget.","date":"Fri Apr 16 15:06:23 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Proud to co-sponsor this bill ensuring taxpayer dollars don't fund:\n🚫Military detention or abuse of Palestinian kids\n🚫The illegal seizure/destruction of Palestinian homes\n🚫Israel’s unilateral annexation of Palestinian territory\n\nPeace means respecting Palestinian human rights.","date":"Thu Apr 15 22:19:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Adam Toledo was unarmed, shot and murdered by the Chicago Police.\n\nHe was 13 years old.\n\nHis hands were up, he complied, and then the police lied about it.\n\nThis is despicable.\n\nHis family deserves justice, but they will never get their child back.","date":"Thu Apr 15 21:30:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Glad you're finally admitting @amazon workers deserve better.\n\nHere's some ideas for you:\n📦Stop union-busting\n📦Improve working conditions\n📦Increase worker pay\n📦Give workers more break time\n\nOh, and endorse the #PROAct.","date":"Thu Apr 15 16:10:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Our democracy needs a Supreme Court not run by partisan extremists. \n\nOne that puts the American people first.\n\nFor Republican voters, for Democratic voters, for Independent voters.\n\nIt's time to #ExpandTheCourt.\nhttps://t.co/1CPxPva47E","date":"Thu Apr 15 14:55:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"China announced last month that their defense budget would be $209 billion.\n\nThe United States' proposed $753 billion defense budget is:\n💸 $544 billion more than that\n💸 113% greater than that\n💸 3.6x larger than that\n\nWe can afford to cut some wasteful Pentagon spending. https://t.co/jx77PQdsHY","date":"Wed Apr 14 20:15:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We should not be spending $13 billion more on defense spending than Donald Trump.\n\nWe should be cutting the Pentagon's budget.\nhttps://t.co/DwYi2iyY8R","date":"Wed Apr 14 17:24:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Things we could cut from the defense budget, instead of increasing it by $13,000,000,000:\n\n✂️ Private defense contractor profits\n✂️ The Overseas Contingency Operations fund\n✂️ New funding for nuclear weapons https://t.co/qopg9I03A1","date":"Wed Apr 14 00:46:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A failure by our justice system.\n\nJacob Blake was shot at by Kenosha police 7 times in front of his children.\n\nHe is paralyzed from the waist down.\n\nThis officer should not have a job, he should be facing a trial.\n\nThe Blake family deserves better than this, they deserve justice.","date":"Tue Apr 13 22:52:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Glad to see @POTUS take the first step to end a war that has lasted 20 long years.\n\nWe must continue investing in peace &amp; diplomacy—rather than war.\n\nPaired with a reduced Pentagon budget, we can rethink our national security to finally meet the real needs of the American people.","date":"Tue Apr 13 20:58:45 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"First, the Wisconsin @GOP threatens $70 million/month in federal food aid with their inaction on our state's emergency order.\n\nNow they want to waste over $1 billion in American Rescue Plan aid?\n\nStop playing games with money that belongs to Wisconsinites.https://t.co/vkvMhp5lwx","date":"Tue Apr 13 19:35:57 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Looking forward to seeing @SecVilsack tomorrow in front of @AppropsDems.\n\nI will be asking him in-person if we can figure out a solution to the @GOP's inaction on Wisconsin's emergency order—which could cost Wisconsinites up to $70 million per month in federal food assistance.","date":"Tue Apr 13 18:28:36 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Daunte Wright should be alive today. \n\nIt doesn't matter if he got pulled over for an air freshener or for expired license tags—he should be alive.\n\nPolice violence against Black people isn't an accident—it's systemic in a broken policing system.\n\nHis family deserves justice. https://t.co/ds0ADp6Req","date":"Mon Apr 12 21:19:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Attention #WI02 high-schoolers—this is the last week to submit your work to this year's Congressional Art Competition and have your art displayed in the Capitol for an entire year! \n\nLearn more &amp; submit your artwork here: https://t.co/k5BNpIvM0p","date":"Mon Apr 12 20:54:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Workers didn't lose a fair union election in Alabama—@amazon just successfully exploited our broken labor laws.\n\nWe need the #PROAct to prevent that from ever happening again. https://t.co/BLmqu2UIv5","date":"Mon Apr 12 16:24:09 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #MagicMonday, we're throwing it back to a trick with my friend &amp; colleague, @repdinatitus who represents more magicians per capita than anywhere in the country!\nhttps://t.co/lJFCDjwLcY","date":"Mon Apr 12 13:28:41 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Spending more money on the American people doesn't justify spending $13,000,000,000 more on defense spending. https://t.co/gIjZuGUmXL","date":"Mon Apr 12 02:31:53 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@amazon's ability to union-bust and intimidate workers proves we need new labor laws.\n\nWe need the #PROAct.\nhttps://t.co/ZT9Av9oVlf","date":"Sun Apr 11 16:13:30 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It means that the Senate needs to pass the #PROAct so workers can organize without employer interference &amp; intimidation.","date":"Sun Apr 11 00:46:10 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@POTUS' budget has a lot of key investments for the American people. \n\nBut the Pentagon's budget shouldn't be $170,000,000,000 larger than the budgets for Agriculture, Education, Energy, Health &amp; Human Services, Housing &amp; Urban Development, Transportation, the VA, &amp; EPA combined.","date":"Sat Apr 10 22:08:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"A $13,000,000,000 increase in defense spending is unacceptable.\n\nCorporate defense contractors don't need a stimulus right now.","date":"Sat Apr 10 01:17:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Despite @amazon's campaign of intimidation, union-busting &amp; interference, fearless @BAmazonUnion workers organized &amp; didn't back down.\n\nI stand in solidarity with @RWDSU's call for an investigation into Amazon's actions.\n\nThis election has made it clear: workers need the #PROAct.","date":"Fri Apr 09 18:35:59 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":".@POTUS' budget has a $13 billion increase in defense spending.\n\nSpending 1.7% more on defense than Trump isn't building back better.\n\nCut the Overseas Contingency Operations fund, contractor profits, &amp; any new spending on nukes.\n\nWe need to actually decrease the Pentagon budget.","date":"Fri Apr 09 17:50:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My full statement on this unacceptable increase in Pentagon spending: https://t.co/jkJBbMXdZn","date":"Fri Apr 09 17:50:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Imagine if instead of spending all that money on union-busting, intimidation, &amp; interference, @amazon just respected their workers.","date":"Thu Apr 08 21:13:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"What's happening in Yemen is the worst humanitarian crisis on the planet.\n\n16 million people—over half of the country's population—are going hungry.\n\nYemenis are without food, water, fuel or electricity, @POTUS must demand the Saudi government #EndTheBlockade. https://t.co/cO62zj9Tw7","date":"Thu Apr 08 02:52:51 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Democratic President, Democratic House, Democratic Senate.\n\nLooks like it's time to cut the Pentagon's bloated $740,000,000,000 budget. https://t.co/MlcJ6LPfEW","date":"Wed Apr 07 21:46:32 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"UPDATE: Wisconsin is slated to lose up to $70 million/month in federal food assistance—$20 million more than previously thought.\n\nWe need the @GOP-controlled state legislature to act immediately.\n\n$70,000,000/month in food aid is on the line. https://t.co/C5iU1nEahe","date":"Wed Apr 07 17:03:22 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Let me guess, \"better\" voters don't include Black people, women, immigrants, the LGBTQ community, or formerly incarcerated people?\n\nNo thank you.\n\nI prefer my democracy to include all people.","date":"Wed Apr 07 15:10:11 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Without an emergency order, Wisconsin could lose $50 million/month in federal food assistance—possibly even more.\n\nThe @GOP-controlled state legislature must step in to ensure we don’t lose this crucial food aid.\n\nAny other action is not only cruel, but fiscally irresponsible.","date":"Wed Apr 07 00:06:01 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"400,000 Yemeni kids under the age of 5 could die from hunger this year.\n\nThe Saudi government's blockade has created a humanitarian crisis.\n\n@RepDebDingell, @RepRoKhanna &amp; I led a letter demanding @POTUS publicly pressure the Saudi government to immediately end their blockade. https://t.co/ek40ar6Ntu","date":"Tue Apr 06 18:37:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Counterpoint: Elected officials should not pass voter suppression laws.\n\nAlso, corporate dollars should stay out of politics—I am talking about political contributions. #EndCitizensUnited","date":"Tue Apr 06 17:27:31 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Workers are the backbones of businesses like Wisconsin’s @ColectivoCoffee and CEOs should treat them with the respect and dignity they deserve. \n\nI stand in strong support of every worker’s right to unionize—including the frontline workers at Colectivo.","date":"Tue Apr 06 16:27:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Hey @amazon, looks like there's some more employees you forgot to apologize to.\n\nAlternatively, you could just listen to your workers and treat them with the dignity &amp; respect they deserve.","date":"Mon Apr 05 14:52:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It's #MagicMonday, here's a throwback reminder that you can't fund infrastructure with magic. https://t.co/N4lqkg7UTt","date":"Mon Apr 05 13:11:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Sigh.\n\nThis is not about me, this is about your workers—who you don't treat with enough respect or dignity.\n\nStart by acknowledging the inadequate working conditions you've created for ALL your workers, then fix that for everyone &amp; finally, let them unionize without interference.","date":"Sat Apr 03 12:25:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Heartbreaking to hear about the tragic loss of another USCP officer.\n\nThinking of their family and hoping for a speedy recovery for the other officer with injuries.","date":"Fri Apr 02 19:09:16 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Let's try this again:\n\nIt’s a great day to cut the Pentagon’s $740,000,000,000 budget and invest in the actual needs of the American people.","date":"Fri Apr 02 15:08:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"To anyone who needs to hear this, doing pull-ups—of any kind—will not prevent COVID-19.\n\nPlease wear a mask and get the vaccine when it's your turn.","date":"Thu Apr 01 19:37:17 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"It’s a great day to cut the Pentagon’s $740,000,000,000 budget and invest in the actual needs of the American people.","date":"Thu Apr 01 13:33:02 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"To recap, the Wisconsin @GOP's priorities include:\n\n🤡Overturning a mask order that protect Wisconsinites \n\n🤡Rejecting $50 million/month in federal SNAP benefits to feed Wisconsinites\n\n🤡Honoring Rush Limbuagh","date":"Wed Mar 31 18:26:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This #TransDayOfVisibility comes as GOP-led state legislatures across the country—including in Wisconsin—attempt to push through transphobic laws and bans on healthcare for trans kids.\n\nEvery trans person should be able to live freely &amp; without discrimination. \n\nWe are with you. https://t.co/sdmEUiG9MI","date":"Wed Mar 31 16:58:58 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Please just let your workers unionize.","date":"Wed Mar 31 00:35:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Union-busting is by definition \"unnecessarily antagonistic.\"","date":"Mon Mar 29 16:42:33 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good morning to all workers!\n\nIt's a great day to join a union.","date":"Mon Mar 29 13:35:25 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"This week's #MagicMonday is a throwback to Wisconsin's very own @rickwilcoxmagic.\n\nRick is going to be on @CWPennandTeller #FoolUs on April 16—what a honor to be on a national magic show! https://t.co/H5l8NVG0KX","date":"Mon Mar 29 13:06:48 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"\"What a union does is give you an organized seat at the table—it allows you to plot, plan, strategize, organize &amp; mobilize.\"\n\nNothing but the truth from @KillerMike.","date":"Sun Mar 28 14:46:37 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"All you're missing are your white hoods.\n\nPeople who champion voter suppression don't deserve to hold public office in our democracy. \n\nWe're going to make sure the Senate passes #ForThePeopleAct.\n\nYou Jim Crow politicians should be ashamed of yourselves.","date":"Fri Mar 26 03:27:55 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Wait, so the company with a well-documented history of poor workplace conditions &amp; union-busting actually knew about its awful workplace conditions and did nothing to help its workers?\n\nAnd here I thought @amazon was a \"progressive workplace.\"","date":"Thu Mar 25 21:25:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Health care is a human right.","date":"Thu Mar 25 18:05:42 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Surprise, @amazon workers weren't lying about their awful workplace conditions.\n\nSo then why did @amazonnews try and deny it? https://t.co/Vro6GlH1OX","date":"Thu Mar 25 16:18:40 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"110 years ago today, 146 workers—a majority of which were immigrant women &amp; girls—were killed in a fire in the Triangle Shirtwaist factory.\n\nThe company had locked the doors to exits so workers couldn't take breaks.\n\nIt was unions that fought back for better worker protections.","date":"Thu Mar 25 15:10:03 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Good morning to all workers.\n\nYou all deserve a union.","date":"Thu Mar 25 13:46:38 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"@amazonnews And yes, I do believe your workers.\n\nYou don't?","date":"Thu Mar 25 04:13:49 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Also, https://t.co/B3MLHaU6IP","date":"Thu Mar 25 02:52:27 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"But you do union-bust?","date":"Thu Mar 25 02:52:26 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Congratulations Dr. Levine on your history-making confirmation as the first openly transgender federal official confirmed by the Senate!\n\nWe are so ready to get to work with you on our country's most pressing health care issues.","date":"Wed Mar 24 23:42:18 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Today, in @EdLaborCmte we're trying to pass pro-worker legislation to:\n\n☑️End the gender pay gap\n☑️Protect pregnant workers from discrimination\n☑️Protect health care &amp; social service workers from workplace violence\n\nWhy do my @GOP colleagues oppose these?https://t.co/U5YGNRM8JO","date":"Wed Mar 24 17:25:13 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"Ted Cruz was still in law school the last time Congress passed a federal gun safety law.","date":"Wed Mar 24 00:32:39 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"My heart goes out to the families of those who lost loved ones today and the entire city of Boulder. \n\nGun violence won't go away with thoughts &amp; prayers.","date":"Tue Mar 23 01:59:14 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"We should not throw billions more taxpayer dollars at an agency that already has a $740,000,000,000 budget and can't pass an audit.\n\nWe should cut the Pentagon's budget. \nhttps://t.co/I8KJ8Zmnnd","date":"Mon Mar 22 22:21:46 +0000 2021","user_id":"1206227149"},{"handle":"RepMarkPocan","text":"One year ago Amazon was so terrified of their worker's fighting for a safe environment they illegally interrogated &amp; threatened their workers according to @nlrb. \n\nThis isn't the mob.\n\nProtect our workers who have provided for us throughout this pandemic. https://t.co/LHBnPrSBif","date":"Mon Mar 22 20:49:01 +0000 2021","user_id":"1206227149"}]