[{"handle":"RepMGriffith","text":"Under President Biden, American workers are taking home less in pay. From May 2021 to May 2022, real average weekly earnings decreased by 3.9% due to inflation.\n\nRampant inflation endangers the American dream.","date":"Thu Jun 16 14:42:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"After gas prices doubled during his tenure, President Biden finally says refiners should produce more gasoline and diesel.\n\nHe should have called off his war on domestic production months ago, or better yet, never launched it. https://t.co/L37XxZV2b8","date":"Wed Jun 15 18:06:28 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi’s caucus is divided over this bill, which passed the Senate unanimously, to protect the Court. Is that why it took her so long to put it on the floor?","date":"Tue Jun 14 19:11:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Supreme Court justices shouldn’t be subject to intimidation and violence. \n\nI voted to expand security for them and their families so they can do their jobs. It’s disgraceful that 27 Democrats voted no even after the attempted assassination of Justice Kavanaugh.","date":"Tue Jun 14 18:57:14 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"You're a grand old flag\nYou're a high-flying flag\nAnd forever in peace may you wave\nYou're the emblem of\nThe land I love\nThe home of the free and the brave\n\nOn this day in 1777, the Continental Congress approved the design of the American flag. Happy Flag Day! https://t.co/csADzTXeXo","date":"Tue Jun 14 12:00:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It’s been a great couple of days for Ninth District high school athletes. Congratulations to the following teams on their state titles:\n\nJohn Battle in class 2 boys tennis\nGlenvar in class 2 girls tennis\nEastern Montgomery in class 1 girls soccer","date":"Sun Jun 12 21:26:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glenvar in class 2 girls soccer\nGalax in class 1 boys soccer\nAuburn in class 1 softball","date":"Sun Jun 12 21:26:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"In 1951, Norton fielded the first integrated Little League teams in Virginia. A historical marker now recognizes this important moment for equality. Honored to be part of the dedication ceremony. https://t.co/rXMqOrbRLF","date":"Sun Jun 12 17:47:49 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Under Joe Biden, the national average price for a gallon of gas has hit $5. Analysts predict it will pass $6 by August.\n \nThe Biden Administration must change course and help deliver more energy production, not gimmicks and finger-pointing.","date":"Sat Jun 11 15:28:07 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.10.22 Topic: Health Care Modernization: Delivering on the Promise of the 21st Century\nhttps://t.co/fx3KysZUOw","date":"Fri Jun 10 20:40:33 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The cost of living continues to soar. In May, inflation hit 8.6%, the latest 40-year high.\n\nEven worse, that inflation was largely due to increases in essentials like energy and groceries.\n\nAmericans can’t afford President Biden’s policies.","date":"Fri Jun 10 14:38:13 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Summer shouldn’t mean blackouts, but there are troubling signs that the electric grid will struggle during the year’s hottest months.\n\nI joined my @HouseCommerce colleagues in asking the Biden Administration what it is doing to prevent this dire outcome. https://t.co/OYCWJE0N38","date":"Thu Jun 09 14:46:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"High gas prices are putting a strain on everything from daily commutes to vacation plans for our region’s residents.\n\nThey’ve doubled since Joe Biden became president. High prices aren’t inevitable, but they largely result from bad policy.\nhttps://t.co/QjMXmOSDSI","date":"Wed Jun 08 22:55:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It’s alarming that Justice Kavanaugh was apparently targeted for murder.\n\nHis would-be assailant has been charged with attempted murder. Perhaps the Supreme Court leaker should be charged as an accessory.","date":"Wed Jun 08 19:52:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was honored to be present for the 78th anniversary of the D-Day landings at the National D-Day Memorial.\n\nAfter the ceremony, I was able to spend time with World War II veteran Todd Eakin. https://t.co/hgig5k1qab","date":"Mon Jun 06 23:01:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.6.22 Topic: A Return to Reality in Energy?\nhttps://t.co/MbkImo3rXi","date":"Mon Jun 06 19:49:21 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"On June 6, 1944, American and Allied forces landed in Normandy, part of the heroic effort to liberate Europe from Nazi tyranny. The sacrifices of D-Day were great, but its purpose and achievement were greater: freedom. We honor those sacrifices on this 78th anniversary. https://t.co/ho9TfEjV7s","date":"Mon Jun 06 13:13:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Yesterday afternoon we also held a roundtable discussion on telehealth with representatives of @BalladHealth in Marion, Virginia. https://t.co/Bcj3mv5UnX","date":"Sat Jun 04 00:30:30 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Yesterday, I held a roundtable discussion on telehealth with representatives of Carilion Clinic in Pearisburg, Virginia. @CarilionClinic https://t.co/unLFLbmp3q","date":"Fri Jun 03 20:55:20 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Southwest Virginia has the assets a business needs to thrive. Scholle IPN’s decision to invest $31.1 million and create 75 new jobs is a tribute to Smyth County’s workforce and economic climate. I look forward to the benefits this expansion will bring to the region. https://t.co/PzIsDnThRP","date":"Thu Jun 02 13:53:37 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to @GovernorVA for coming to Southwest Virginia for the jobs announcement in Smyth County and to discuss economic development in our region. https://t.co/sm1qGNxPT7","date":"Wed Jun 01 23:42:13 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Abandoned Mine Land Economic Revitalization Program funding helped turn this location from an abandoned coal processing plant to an industrial site. I look forward to the opportunities it will bring to the people of Russell County. https://t.co/TzmVBOySTw","date":"Wed Jun 01 21:50:32 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"On Memorial Day, we honor those who gave their lives in defense of our country and our liberty.\n\nCitizenship imposes obligations on all of us, but these individuals gave more. Sometimes, they gave all they could give. https://t.co/oCIhHuS7AL","date":"Mon May 30 11:49:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.28.22 Topic: Memorial Day\nhttps://t.co/61loKZmxQP","date":"Sat May 28 17:31:09 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I have heard from folks all over Southwest Virginia who are having issues providing the most basic need for their infants.\n\nThe big question I have today is why the Biden Administration let the infant formula shortage become so dire before acting with any urgency. https://t.co/2OPdPxW4OT","date":"Wed May 25 16:22:59 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to learn of the heartbreaking events in Uvalde. Any shooting is tragic, but targeting children is an absolutely horrific crime. \n\nI am driving up to DC now, and each time I hear more the grievous toll goes up &amp; up. My thoughts are with the victims &amp; their loved ones.","date":"Wed May 25 00:56:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is the day President Biden planned to end Title 42. A federal judge has put a stop to that bad idea for now, but the Biden Administration still has no plan to secure the border and enforce our immigration laws. https://t.co/FvhKo63JbP","date":"Mon May 23 20:05:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The baby formula shortage is a serious problem, and I support and voted for legislative solutions that will help fix it, like the Access to Baby Formula Act.\n\nBut $28 million in additional funding to the FDA for salaries and bureaucratic overhead will not help solve the shortage. https://t.co/qXjqRexBlW","date":"Sat May 21 15:37:41 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.20.22 Topic: Missed Signals, Misplaced Priorities: A Biden Administration Pattern https://t.co/4JMpKy9lt8","date":"Fri May 20 20:59:02 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"As House Democrats blame high gas prices on gouging, here's a reminder that just three weeks ago President Biden's Energy Secretary said, “I’m not sure anyone is saying there is wholesale gouging.”","date":"Thu May 19 15:05:18 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Victory for free speech: the Biden Administration is not proceeding with its Ministry of Truth.\n\nAs a cosponsor of @GOPLeader’s bill to defund the so-called DHS Disinformation Governance Board, I welcome this news. I will stay vigilant against threats to the First Amendment.","date":"Wed May 18 17:12:25 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"In April of this year, 234,088 illegal immigrants were encountered at the southern border, the highest number in one month on record.\n\nThe crisis at the border continues to grow, and the Biden Administration has no plans to do anything but make it worse.","date":"Tue May 17 21:31:07 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"According to a recent analysis, American families will pay over $5,000 more this year because of inflation.\n\nInflation is a tax on all Americans.\nhttps://t.co/qeZb9H65Oh","date":"Fri May 13 23:00:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi has extended proxy voting to June 28. Long after most Americans have gone back to work and school, Members of Congress are exempted from doing their most basic task in person: voting.\n\nHowever, this Member of Congress will continue to only vote in person.","date":"Fri May 13 19:23:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.13.22 Topic: Baby Formula Shortage: The Latest Biden Crisis https://t.co/xXEdHwoauz","date":"Fri May 13 15:43:34 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Policies have consequences.\n\nThe Biden Administration’s policies have made new energy investment in America difficult. https://t.co/w0TCdjKiPA","date":"Thu May 12 20:43:51 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"During the first quarter of 2022, America’s gross domestic product shrank at an annual rate of 1.4%. American families continue to pay more for goods and services across the board. Far-left policies are increasing inflation rates and diminishing the economy. https://t.co/kTLrcc6UQ0","date":"Thu May 12 15:16:44 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"\"Drug-overdose deaths in 2021 topped 100,000 for the first time in a calendar year, federal data showed, a record high fueled by the spread of illicit forms of fentanyl throughout the country.\"\n\nThe fight against fentanyl must be an urgent priority.\nhttps://t.co/PdhjVD5u7r","date":"Wed May 11 16:32:51 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"During National Police Week, we honor the men and women of law enforcement who protect our communities and keep us safe, often at great risk to themselves. \n\nLet’s thank our police officers and support them, this week and every week.","date":"Wed May 11 14:38:26 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"🚨 Gas prices have set a new record. The national average price of a gallon of gas hit $4.37 according to AAA.\n\nThe Biden Administration’s poor choices on energy policy continue to cost Americans at the pump.","date":"Tue May 10 21:50:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Fentanyl has contributed to a devastating increase in overdoses in this country. We must do more to protect Americans from this scourge, including passing the HALT Fentanyl Act I’ve introduced with @boblatta and securing the southern border.","date":"Tue May 10 18:13:51 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.6.22 Topic: Fearmongering Over the Supreme Court https://t.co/loa3R5t9FA","date":"Fri May 06 22:31:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.2.22 Topic: Oversight of the Executive Branch https://t.co/LWKYhouVPl","date":"Mon May 02 18:27:47 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It’s a big day for Southwest Virginia in the NFL draft. Congratulations to Honaker’s Jordan Stout on being drafted by the Baltimore Ravens and Big Stone Gap’s James Mitchell by the Detroit Lions.","date":"Sat Apr 30 21:15:26 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am honored to be recognized by the @ACUFoundation  with its Award for Conservative Achievement. https://t.co/5fQI8gcvky","date":"Sat Apr 30 14:38:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I attended the official unveiling of the first phase of the largest 3D-printed project in the world - starting in the Town of Pulaski.\n\nAlquist 3D began construction of a 3D-printed home using Black Buffalo 3D's NexCon printer. https://t.co/4HMQ8mzTIF","date":"Fri Apr 29 20:15:12 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Arbor Day is a reminder of the ways we can enjoy and benefit from the natural world around us, and how we in turn can make it better.\n\nI recently joined students of E.B. Stanley Middle School in planting trees for Abingdon’s 21st annual Arbor Day celebration. https://t.co/GCJryHZhw2","date":"Fri Apr 29 14:24:38 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Lend Lease helped defeat tyranny in World War II. \n\nI cosponsored a bill that passed the House today to bring it back to aid  Ukraine. We can show once again America’s power as the Arsenal of Democracy.","date":"Thu Apr 28 22:56:33 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"During the Days of Remembrance of Victims of the Holocaust, our country remembers the victims of Nazi genocide. Six million Jews and people of other targeted groups were murdered in the Holocaust, a horrific toll that we must never forget.","date":"Thu Apr 28 13:13:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"EcoHealth Alliance has not been transparent about the research it conducted at the Wuhan Institute of Virology using NIH grant money. \n\nNIH should investigate to find out what EcoHealth knew and whether it intentionally misled in order to conduct dangerous research.","date":"Mon Apr 25 20:09:25 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Read more about the Service Academy nomination process at https://t.co/Cw0P3PuHzo.","date":"Mon Apr 25 16:23:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I will be hosting the 2022 Service Academy Day this Saturday in Wytheville. Ninth District high school and junior high students, parents, and educators are invited to learn about the Service Academies, ROTC, and other programs. https://t.co/dGnC6IitnW","date":"Mon Apr 25 16:23:28 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.22.22 Topic: Biden Administration Can’t Get Its Story Straight on COVID https://t.co/3WgbjbPhWl","date":"Fri Apr 22 20:28:28 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Great discussion with the students of Dr. Matthew Smith's Communication and Leadership class at Radford University. https://t.co/MS5acecnl2","date":"Fri Apr 22 14:42:06 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Russian government recently imposed sanctions on me for supporting Ukraine’s right to defend itself. \n\nI can live with that. It won’t stop me from voting for and cosponsoring bills such as ending Russian energy imports and arming Ukraine as it fights back.","date":"Wed Apr 20 17:49:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The bravery of the Ukrainian military and people in the face of Russian aggression has been an inspiration to free people across the world. https://t.co/BrMNe6xqeb","date":"Wed Apr 20 13:14:08 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"In March, 210,000 illegal immigrants were encountered at the southern border, a 24% increase over last March.\n\nThe border under President Biden is out of control, yet he still plans to end Title 42, one of the few measures impeding more illegal crossings. https://t.co/tL3Ln3DqGu","date":"Tue Apr 19 14:36:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Tax Day. Don’t forget to file your federal income taxes if you haven’t already.\n\nAlso, don’t forget that the Biden Administration wanted to vastly expand the power of the IRS to snoop on bank accounts.","date":"Mon Apr 18 17:40:53 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Easter! He is risen! https://t.co/fgijNCxI6F","date":"Sun Apr 17 11:00:03 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"While in Bristol, I spoke to WCYB about my work to lower prescription drug prices. https://t.co/TivvbShvxs","date":"Sat Apr 16 21:25:48 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Fifteen years ago on this day, 32 lives at Virginia Tech were taken too soon. We honor their memory today.","date":"Sat Apr 16 13:33:15 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topics: Easter and Personal Protective Equipment https://t.co/NUoOUqXz7Y","date":"Fri Apr 15 14:15:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Prices in March were up 8.5% from the previous year, the highest such increase since December 1981.\n\nCosts for food, fuel, and housing have been surging for months, well before the invasion of Ukraine, due to the failed leadership of the Biden Administration.","date":"Tue Apr 12 21:03:40 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.8.22 Topic: Biden Cannot Shirk Blame for High Energy Prices https://t.co/UMnYpFJlYG","date":"Fri Apr 08 21:58:32 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Medical Marijuana Research Act allows work to be done to understand marijuana's medical properties, how it could help people, and potential long-term negative effects.\n\nI spoke to WCYB about this bill I cosponsored, which passed the House this week. https://t.co/aJvLZSNvVj","date":"Fri Apr 08 19:18:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke at a Committee on Appropriations Member Day hearing to advocate for the Abandoned Mine Land Economic Revitalization Program.\n\nThis program has brought new hope to a lot of communities. https://t.co/nhV8CvnDK1","date":"Thu Apr 07 18:23:50 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Rather than deflect blame, President Biden should consider his own culpability for high energy prices thanks to his relentless pursuit of policies that discourage domestic energy production, driving gas prices up to levels not seen since Mr. Biden was Vice President.","date":"Wed Apr 06 14:58:04 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"When President Biden points to Vladimir Putin, or Big Oil, or other scapegoats as the culprit behind high gas prices, I am reminded of the words of the Wizard of Oz: “Pay no attention to the man behind the curtain.” https://t.co/wD7zRqlMUk","date":"Wed Apr 06 14:57:35 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I cosponsored the Medical Marijuana Research Act to expand opportunities for scientists to get the info we need about marijuana’s potential benefits and harms. \n\nI am glad the House passed our bill today, and I hope this commonsense change to the law will continue to advance. https://t.co/tiRP2JvZ1J","date":"Mon Apr 04 23:10:52 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.1.22 Topic: In Opposition to Supreme Court Nominee Judge Jackson https://t.co/26Q9YQ2ByP","date":"Fri Apr 01 18:11:03 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Biden budget spends more money on plenty of misplaced priorities. One of the few items it cuts is Immigration and Customs Enforcement by $150 million next year. \n\nIf enacted, this budget would make the border crisis worse.","date":"Fri Apr 01 13:59:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Releasing more oil from the Strategic Petroleum Reserve will have a minimal, short-term impact on gas prices and decrease the stockpile for future emergencies.\n \nInstead of gimmicks, now is the time to produce more energy here in America. https://t.co/yMhcCNsCPr","date":"Thu Mar 31 20:18:56 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Energy costs are soaring, yet the Biden Administration’s budget contains $45 billion in new taxes on domestic energy production.\n\nWhen Americans need relief from high energy costs, President Biden would have us pay more at the pump, to transport goods, and in heating bills.","date":"Thu Mar 31 13:49:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The southern border is already out of control. Ending Title 42 would make the crisis worse.\n\nI’ve joined my @freedomcaucus colleagues in calling on Democrats to help prevent this avoidable catastrophe. https://t.co/xXIm7EYooS","date":"Wed Mar 30 20:08:16 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Presidential budgets don’t become law, but President Biden said they show “what we value.” What are the values of his budget?\n\n📈Taxes – $58 trillion of them\n📈Spending – the highest sustained amount in US history\n📈Debt – $45 trillion total by 2032 (not accounting for inflation)","date":"Wed Mar 30 14:14:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It’s ridiculous that long after most Americans have returned to work, Members of Congress don’t even need to show up to vote. Speaker Pelosi nevertheless just extended proxy voting to May 14. This decision sacrifices the Constitution to keep a tight grip on power.","date":"Tue Mar 29 17:31:18 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Vietnam War Veterans Memorial Day. We honor the nine million Americans who served in the Vietnam era, including the 58,000 warfighters who paid the ultimate price.","date":"Tue Mar 29 13:23:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.25.22 Topic: Strengthening Supply Chains: Creating Security and Opportunity https://t.co/3KNCtivmDn","date":"Fri Mar 25 20:01:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"For senior citizens, paying taxes on Social Security benefits are an unwelcome burden atop fixed incomes. I’ve cosponsored a bill that would get rid of these taxes, the Senior Citizens Tax Elimination Act.","date":"Thu Mar 24 14:56:12 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Especially in tough economic times, tax policy should seek to let hard-working Americans keep more of their money. That’s why I cosponsored legislation to make the 2017 tax cuts permanent.","date":"Thu Mar 24 14:56:12 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"As this year’s tax filing deadline approaches, the IRS still has a backlog of millions of unprocessed returns from previous years. I’ve cosponsored the IRS PRIORITIES Act, which would prohibit the agency from hiring more enforcement personnel until it processes these returns.","date":"Tue Mar 22 17:57:23 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Agriculture Day. Please join me in thanking the farmers of Virginia’s Ninth District for all they do to grow and produce the agricultural products we rely on every day. https://t.co/rWDNlCPJCy","date":"Tue Mar 22 13:14:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Labor Department data found that wholesale prices in February had risen 10% over the previous year, the highest annual spike on record. Keep in mind that Russia’s invasion of Ukraine began with only four days left in the month.","date":"Mon Mar 21 18:00:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The inflation resulting from President Biden’s policies continues to take a toll on family and business budgets.","date":"Mon Mar 21 18:00:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Don Young was a one of a kind representative. He was a forceful and fearless champion of Alaska, and his presence will be missed in the House of Representatives.","date":"Sat Mar 19 02:56:41 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.18.22 Topic: Help Ukraine Protect Its Borders. Protect Our Own, Too. https://t.co/aRwKTsQ6ZS","date":"Fri Mar 18 20:06:43 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congress heard from Ukrainian President Zelenskyy this week asking for help protecting his country’s borders. I support helping Ukraine, but we should protect our own borders, too. https://t.co/KUSAUvg4oh","date":"Fri Mar 18 14:52:13 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden has slashed enforcement of our immigration laws.\n\nFrom fiscal year 2020 to 2021, deportations of illegal immigrants dropped from 185,884 to 59,011. Administrative arrests in FY 2021 dropped to 74,082, roughly 50% of the average from 2017 to 2019.","date":"Fri Mar 18 14:52:12 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"New numbers indicate that 105,732 people in the United States died of drug overdoses in the twelve-month period ending in October 2021, a record total for one year.\n\nFentanyl-related substances drove this surge. https://t.co/1ibSmOQUfE","date":"Thu Mar 17 22:06:25 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Democrats again just blocked the American Energy Independence from Russia Act on the House floor. I’m a cosponsor of this bill to approve the Keystone XL pipeline, lift liquid natural gas export restrictions, and restart oil and gas leasing on federal land.","date":"Wed Mar 16 20:04:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"If record gas prices and Russian aggression still haven’t convinced them to support domestic energy production, what will?","date":"Wed Mar 16 20:04:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Ukrainian President Zelenskyy is virtually addressing Congress this morning. I appreciate the chance to hear from him and admire the resolve he is showing in the fight for his country’s freedom. https://t.co/VcAClyTPDa","date":"Wed Mar 16 13:11:07 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The death of Covington Police Officer Caleb Ogilvie in the line of duty is a great tragedy for the people of Covington and a reminder of the dangers law enforcement officers can face every day. My thoughts are with his family, colleagues, and community.","date":"Tue Mar 15 17:54:38 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to ACC champions Virginia Tech! https://t.co/Ad65qxLiG1","date":"Sun Mar 13 20:47:35 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Honaker girls basketball on winning their third Class 1 state championship! https://t.co/K0KEAT93CS","date":"Sat Mar 12 23:28:55 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to the Central Wise girls basketball team on winning the Class 2 state championship!\n\nThanks to Kenny Ford for the photos. https://t.co/5t2WEKPEzq","date":"Sat Mar 12 17:57:26 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.11.22 Topic: White House Misdirection on Energy https://t.co/lyPP9rtIEu","date":"Fri Mar 11 23:04:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The 2022 Congressional Art Competition for the Ninth District is now open 🎨\n\nThe theme for this year’s contest is \"Appalachian America.\" I look forward to seeing how the young artists of the Ninth will use their talents in exploration of this theme. https://t.co/eDSfQN2IBu https://t.co/q7kbAc3Gxt","date":"Fri Mar 11 19:53:49 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Cave Spring boys basketball on winning the Class 3 state championship! https://t.co/HdZKsktyyg","date":"Fri Mar 11 03:04:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Carroll County girls basketball on winning the Class 3 state championship! https://t.co/1myNp1MAhw","date":"Fri Mar 11 01:12:36 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden’s policies are burdening Americans with higher costs on goods and services they rely on every day. https://t.co/dLYyNhAAYx","date":"Thu Mar 10 16:43:05 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"On top of the record gas prices we’ve seen this week, the Labor Department reported today that inflation in February hit 7.9% over the year, the highest since 1982. These numbers don’t yet reflect the impact of Russia’s invasion of Ukraine, which began on February 24.","date":"Thu Mar 10 16:43:04 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on H.R. 6968, the Suspending Energy Imports from Russia Act: https://t.co/MaeDWGrhUp","date":"Thu Mar 10 04:39:21 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Another argument for American energy dominance. \n\nWhen we supply our own energy, Middle Eastern countries not returning President Biden’s calls have fewer consequences for our heating bills and gas prices. https://t.co/FvyfBoVBrW","date":"Wed Mar 09 17:57:51 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is a time for action on the world scene.\n\nBut we're not taking action on the world scene. We're talking about electric vehicles. https://t.co/TkTZm6aHDP","date":"Tue Mar 08 19:41:33 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"A ban on Russian oil imports is an important measure to cut off funding for Russian military aggression. I have been part of the bipartisan call to take this action, and I am glad that President Biden has finally followed our lead.\n\nRead more⬇️ https://t.co/oXoCxIg0Qq","date":"Tue Mar 08 14:46:39 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"As the national average gas price tops $4 per gallon, where is the Biden Administration looking to meet our energy demands? Iran and Venezuela.\n\nInstead of begging our enemies for help, President Biden should unbind domestic energy production.","date":"Mon Mar 07 19:08:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"You can travel 276 miles and for 4 hours 39 minutes from Covington and still be in Virginia’s Ninth District. You’d be in Ewing in Lee County. https://t.co/3MOXI6LIbv","date":"Mon Mar 07 15:26:23 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Each month, my staff holds traveling office hours throughout the Ninth District to hear your concerns and troubleshoot problems with federal agencies. Learn when traveling staff office hours will be held in your county or city in March⬇️\nhttps://t.co/azCyx4i3gr","date":"Sat Mar 05 17:37:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I participated in a Zoom meeting with Ukrainian officials on the ground in Ukraine to hear updates on the current situation. https://t.co/2rAfptAMYN","date":"Fri Mar 04 22:27:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.4.22 Topic: American Energy Can Counter Vladimir Putin https://t.co/rlV7Io7B6J","date":"Fri Mar 04 17:41:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Save the date: 9th District high school juniors, parents, and school staff are invited to my Service Academy Day in Wytheville on Saturday, April 30 to learn more about options for serving our country while earning a college degree.\n\nRead on at my website: https://t.co/Cw0P3PuHzo https://t.co/p2YOjtkCRQ","date":"Thu Mar 03 20:26:47 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Senate today voted to overturn President Biden’s vaccine mandate for Medicare and Medicaid providers.\n\nI’m a cosponsor in the House on a resolution that would do the same thing. I don’t say this often, but we should follow the Senate’s lead. https://t.co/A4Ww6ryOFQ","date":"Wed Mar 02 22:58:40 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden offered more of the same tonight - the same policies that produced record inflation, lost control of the border, and failed to deter Russian aggression. The State of the Union won’t improve without a course correction.","date":"Wed Mar 02 03:27:52 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m an original cosponsor of the American Energy Independence from Russia Act. It would create jobs and lower prices for Americans and throw a lifeline to countries facing Russian energy blackmail.\n \nBut House Democrats voted it down on the floor today.","date":"Tue Mar 01 21:54:07 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The financial sanctions levied by the United States and our allies are an important measure to make Vladimir Putin pay a price for his war of aggression, but more can be done.\n\nRussian energy should be extensively covered by sanctions as well. https://t.co/rPubH2FDfI","date":"Mon Feb 28 21:36:38 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.25.22 \nTopic: More Alarming News on Inflation\n\nhttps://t.co/oAiA1Rv4eY","date":"Fri Feb 25 15:17:40 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Join me in praying for the people of Ukraine. Vladimir Putin must be punished for his egregious actions against Ukraine. The U.S. can offer support by sanctioning Russian industry &amp; increasing our energy production here at home. Read my full statement here https://t.co/o7m3zIrhW8","date":"Thu Feb 24 22:08:54 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: On WFIR Congressman Griffith says US must provide energy to Europe for sanctions to succeed https://t.co/PsPZYRegYZ","date":"Thu Feb 24 17:22:36 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.18.22 Topic: Reopen the Capitol\n\nhttps://t.co/4lwvQr4e1M","date":"Fri Feb 18 22:19:05 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good meeting in Wise with County Administrator Michael Hatfield and his economic development team. https://t.co/Yy41bp2vD1","date":"Wed Feb 16 19:21:10 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Energy production = U.S. leadership.\n\n“U.S. exports offer relief to a worried Europe, blunt the impact of Vladimir Putin’s energy extortion, and expand the market for U.S. shale-gas drillers who are again increasing production after the pandemic crash.” https://t.co/8i0FafqAEi","date":"Tue Feb 15 14:52:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Drs. Fauci and Collins need to explain why they apparently tried to shut down scientific inquiry into COVID-19’s origins.","date":"Mon Feb 14 19:51:28 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Salem native John Crews Jr. on winning the Bassmaster Elite at St. Johns River this weekend! https://t.co/PsqM1xd8MN","date":"Mon Feb 14 16:42:50 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"If you are an illegal immigrant, vaccinated or not, the Biden Administration welcomes you in.\n\nIf you are a U.S. citizen trying to go from Ukraine to Poland but don’t have a vaccine card, the Biden Administration says tough luck.","date":"Sun Feb 13 16:48:59 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is outrageous. The State Department’s obligation to U.S. citizens fleeing the possibility of war does not depend on vaccination status. https://t.co/BS9STnaEiJ","date":"Sun Feb 13 15:28:56 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.11.22 Topic: What Republicans Are For, Part II: Improving Health Care https://t.co/3TurV468nZ","date":"Sat Feb 12 00:00:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m glad they came to their senses. It’s hard to believe anyone thought this was a good idea, but then again, we are talking about the Biden Administration. https://t.co/nlGBhZk8x9","date":"Fri Feb 11 21:43:39 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Another month of Biden’s surging inflation—up 7.5% since this time last year. This is the highest increase in 40 years. Americans are paying more for almost everything. Far-left policies and radical government spending are out of control. \n\nhttps://t.co/LHd6R8QvS8","date":"Thu Feb 10 19:08:34 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":".@ARCgov's INSPIRE Initiative supports workforce entry and reentry for those struggling with substance abuse. It’s planning to award $10 million for recovery-to-work projects and is accepting proposals. Learn more and submit a letter of intent by 3/3 at https://t.co/ZH1yDSSbhw.","date":"Thu Feb 10 15:52:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"We have tools at our disposal to reduce the availability of illicit substances such as fentanyl and meth and in turn prevent overdose deaths, but they are not being used.\n\nWe need to pass the HALT Fentanyl Act, and we need to finish building the border wall. https://t.co/Apg9tONQ8X","date":"Wed Feb 09 16:49:20 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Sheriff Mike Miller of Bedford County was in Washington for the National Sheriffs' Association Winter Conference. I was glad to talk with him about my continued support for law enforcement. https://t.co/y5IajX0ElJ","date":"Tue Feb 08 20:57:50 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The numbers are in: 1.9 million arrests were made at the border last year, a record high. President Biden’s policies encourage illegal immigration and undermine public safety. https://t.co/2VdYuf5XjQ","date":"Tue Feb 08 15:10:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The planned Lowe’s distribution center will be an asset to Roanoke County. This is great news for jobs and economic opportunity in the area. https://t.co/Ar6WNJPFXg","date":"Mon Feb 07 20:30:19 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Sorry to learn of the unexpected loss of Carl Snodgrass. He was a tireless advocate for economic development in Wise County and a good man. https://t.co/ac456zH0ff","date":"Sat Feb 05 21:58:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I'm saddened by the devastating events that took place in Blacksburg last night. My thoughts go to the loved ones of the victims, as well as all the Blacksburg and Virginia Tech community.","date":"Sat Feb 05 18:22:32 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The bipartisan letter I sent to the White House asks about potential illegal practices by staffing agencies that charge high rates and then keep that money for themselves, not nurses.","date":"Sat Feb 05 15:45:08 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Rumors are that middleman staffing agencies keep as much as 40% of the money they charge for nurses instead of giving more of the money to the nurses.\n\nI do not and will not support legislation to cap nurses’ pay. Anything to the contrary is fake news.","date":"Sat Feb 05 15:45:08 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Disinformation continues to circulate that I have introduced a bill to cap nurses’ pay. That is false.\n\nThere is no bill, and I do not support capping nurses’ pay.","date":"Sat Feb 05 15:45:07 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.4.22 Topic: Still Waiting for a Tough on China Bill https://t.co/pvTpKJaPNC","date":"Fri Feb 04 18:03:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The American Concedes Act is almost 3,000 pages with a $325 billion price tag. The text mentions climate change more times than China. This bill does not hold the Chinese Communist Party accountable — it’s just another path to further the left’s radical agenda. https://t.co/NaNNlP2a5M","date":"Fri Feb 04 15:07:47 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to @repdonyoung for setting the record straight.","date":"Thu Feb 03 22:39:13 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Dr. Fred Gage of Blacksburg was on Capitol Hill today to demonstrate cutting-edge organ preservation techniques for transplants he’s developed. https://t.co/B5nkDyfoGN","date":"Thu Feb 03 19:50:35 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Americans have reportedly been kicked off the organ transplant list solely because they chose not to get the COVID-19 vaccine. This shouldn’t happen, which is why I cosponsored the SAVE Act.","date":"Thu Feb 03 15:25:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Time is running out. The cartels in China and Mexico know how to play games with these fentanyl analogs. \n\nCongress must act to pass the HALT Fentanyl Act before February 18th of this year. https://t.co/Sav1KOOAIL","date":"Wed Feb 02 18:46:20 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Democrat Congress has refused to permanently schedule fentanyl analogs. Instead, like Groundhog Day, they vote for temporary extensions again...and again... and again.\n\nThe emergency scheduling now is set to lapse on February 18. Will the Democrats break the cycle this month? https://t.co/qCy9yZCVzh","date":"Wed Feb 02 14:40:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thinking of the two officers and praying for their families mourning tonight after the shooting at Bridgewater College. https://t.co/1e1M5uCgWp","date":"Wed Feb 02 00:33:06 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"One year ago, Burma’s military seized power in a coup.\n\nI’m a cosponsor of the BURMA Act to promote human rights and help encourage democracy in the country. I support the freedom-loving people of Burma on this sad anniversary.","date":"Tue Feb 01 23:56:45 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"This month, the emergency scheduling of fentanyl-related substances will expire. This would be a terrible blow in the fight against drug overdoses. Congress can prevent this outcome by passing the HALT Fentanyl Act I’ve introduced with @boblatta. https://t.co/RHcvtTGrQk","date":"Tue Feb 01 15:37:43 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.28.22 Topic: What Republicans Are For\nhttps://t.co/tUEFRUCP9V","date":"Fri Jan 28 23:06:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Biden’s economic crisis has caused inflation to skyrocket 7%. Last year, average hourly wages fell 2.4% when adjusted for inflation. After a year of one-party control, the American people are making less and paying more. https://t.co/U3OiqPqZWF","date":"Fri Jan 28 17:01:10 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"On International Holocaust Remembrance Day, we remember the six million Jews and all the victims of genocide committed by Nazi tyranny.","date":"Thu Jan 27 14:42:18 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Cryptocurrency is emerging as a valuable technology in today’s economy. It is important for policymakers to be aware of the potential benefits to our local economy &amp; the demands on local infrastructure. I would like to thank Manifold Mining of New Castle for hosting me. https://t.co/8NbZzBwBnm","date":"Wed Jan 26 21:59:02 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Biden’s border crisis is out of control. Since he took office, there have been nearly 2 million illegal border crossings. Even as illicit narcotics and other drugs are flowing into our country, progressives continue to push their open-border policies. Where does it end? https://t.co/vY9k0Op1c8","date":"Wed Jan 26 17:25:36 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The US should never again be dependent upon foreign suppliers of personal protective equipment during an emergency like the coronavirus pandemic.\n\nRead more about my new bill, the Domestic SUPPLY Act: https://t.co/ZoP9XRtoDr","date":"Tue Jan 25 18:27:03 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.21.22 Topic: A Dreadful First Year https://t.co/iDmlKCJPKO","date":"Fri Jan 21 20:41:10 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am proud to earn an A+ on the @SBAList pro-life scorecard. I will continue to vote in defense of the right to life for the unborn and to protect the conscience rights of Americans who don’t want their tax dollars to pay for abortions. https://t.co/lm0zSWKCGT","date":"Fri Jan 21 15:19:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It’s a disgrace that the House of Representatives under Speaker Pelosi is still buying masks from China nearly two years after the pandemic arrived in our country.\n\nI joined my colleagues in a letter protesting this action. https://t.co/SgTSbDi7IH https://t.co/1hnR2TjDw7","date":"Thu Jan 20 22:52:54 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Joe Biden became President one year ago. What have we experienced since then?\n\n-inflation not seen in decades\n-unconstitutional vaccine mandates\n-a disastrous withdrawal from Afghanistan\n\nThat’s not much to celebrate on this first anniversary.","date":"Thu Jan 20 14:29:55 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"For a breakfast meeting today, I was required to show photo ID and proof of vaccination due to the leftist D.C. government.\n\nMeanwhile, Sen. Schumer is putting on the Senate floor a bill that would block state voter ID laws. \n\nID for eggs, no ID to vote. This is madness.","date":"Wed Jan 19 15:32:16 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we commemorate the birth of Dr. Martin Luther King Jr., one of America’s great champions of freedom and equality. Through courage, eloquence, and commitment to nonviolence, he summoned our country to live up to the self-evident truths of our founding. https://t.co/0z0Whu5zJ7","date":"Mon Jan 17 13:58:11 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to new Governor Glenn Youngkin, Lieutenant Governor Winsome Sears, and Attorney General Jason Miyares on taking office today. I look forward to the good work they will do on behalf of the people of Virginia.","date":"Sat Jan 15 17:58:49 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"“I think CMS has made a huge error and I think the Biden administration will rue this from a public policy standpoint … people are going to be left without care and we’re gonna have some problems.” https://t.co/Lufgo3HhTd","date":"Sat Jan 15 14:24:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"It was an honor to receive the Friend of the Family Award from @FaithandFreedom. I will continue my commitment to vote in defense of the family, support of religious liberty, and alliance with our friend Israel. https://t.co/rVYEQ0t85h","date":"Fri Jan 14 22:49:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.14.22 Topic: No Oversight, No Accountability https://t.co/jePwUEh9Qo","date":"Fri Jan 14 19:35:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The HALT Fentanyl Act I’ve introduced with Rep. @boblatta would help reduce the threat posed by fentanyl. \n\n2021 data shows why it’s needed. More fentanyl than heroin was smuggled across our border for the first time, leading to an alarming increase in overdoses and deaths.","date":"Fri Jan 14 15:51:34 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"As a result of the Court’s decision today, the vaccine mandate will drive workers away from hospitals, nursing homes, long-term care homes, and other Medicare- and Medicaid-funded facilities. Patient care will suffer as a result.","date":"Thu Jan 13 20:27:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Supreme Court was right to block President Biden’s vaccine mandate on private employers. I wish it had done the same to the Administration’s mandate on health care providers. Health care workers should not have to shoulder more burdens imposed by the Federal Government.","date":"Thu Jan 13 20:27:31 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"But why should we be surprised she connects this issue with NASA? Speaker Pelosi has always been out of touch with this world and probably also favors giving the vote to extraterrestrials.","date":"Thu Jan 13 16:53:17 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi’s latest gambit to federalize elections takes a bill about NASA and loads it with provisions to undermine election security: taking away state powers, putting up hurdles to voter ID, and blocking voter roll maintenance. It’s a desperate stunt.","date":"Thu Jan 13 16:53:17 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Under President Biden’s big spending administration, inflation continues to soar. Prices are going up for goods and services Americans depend on every day. https://t.co/JRWTLSXz4c","date":"Wed Jan 12 19:15:49 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"New this morning: the Labor Department confirms that prices rose in December by 7%, the highest rate of inflation since 1982.\n\nThis is more evidence that the Biden agenda is failing the American people.","date":"Wed Jan 12 14:52:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden and Vice President Harris are in Georgia today talking about voting legislation. Here’s what’s in it:\n\n-federalized election administration\n-legalized ballot harvesting\n-taxpayer dollars for political candidates\n\nThis is about a Democrat power grab, not democracy.","date":"Tue Jan 11 19:10:01 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"The heart transplanted into Mr. Bennett came from a genetically altered pig provided by Revivicor, a regenerative medicine company based in Blacksburg, Va.\" https://t.co/EgDAXah11i","date":"Tue Jan 11 16:36:23 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Law Enforcement Appreciation Day. Thank you to all law enforcement officers for serving our communities, often at personal risk. We are grateful for all you do. https://t.co/Dz9ylvrzSV","date":"Sun Jan 09 14:28:29 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.7.22 Topic: The Inauguration of Virginia’s New Governor https://t.co/HVMAHRxeJJ","date":"Fri Jan 07 22:50:39 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Pulaski County's Joe Guthrie on his appointment by Governor-elect Youngkin as Commissioner of the Department of Agriculture and Consumer Services. https://t.co/bPmCPxomV2","date":"Thu Jan 06 15:52:44 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Virginia will be fortunate to have Chuck Slemp as Chief Deputy Attorney General. He will bring to Richmond the expertise and commitment to the law that has served Wise County so well. Congratulations to my good friend. https://t.co/MQqnS7ybSl","date":"Tue Jan 04 15:14:54 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy New Year! May you and your loved ones enjoy a blessed 2022. https://t.co/FPzpelfUdG","date":"Sat Jan 01 13:02:00 +0000 2022","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.30.21 Topic: Cause and Effect https://t.co/8zjNfMk3f7","date":"Thu Dec 30 19:40:20 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Mac McClung on debuting in the NBA and scoring. He continues to make Southwest Virginia proud. https://t.co/cbojfpeUfQ","date":"Thu Dec 30 15:42:01 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I would like to wish you and your loved ones a Merry Christmas. https://t.co/E4Uvgnb0uf","date":"Sat Dec 25 12:35:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Europe’s recent energy struggles show the value of maintaining all of the above energy policies. We shouldn’t give up reliable and affordable sources of energy for ones that can’t fully power our country. https://t.co/DquVtChHUx","date":"Thu Dec 23 15:18:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.17.21 Topic: White Christmas https://t.co/ntBwOL1QQF","date":"Fri Dec 17 21:16:45 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":".@HHSGov has many tasks assigned to it by law. It is doubtful that creating yet another office focused on climate change is one of them.\n\nLearn more about the questions Leader @cathymcmorris and I have about this effort’s legal standing and inefficiency: https://t.co/F9hrfh5EhA","date":"Wed Dec 15 19:07:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the debt limit: https://t.co/AYKBltqkiQ","date":"Wed Dec 15 05:33:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"@CAHutch1990 Unfortunately, no one in the Ninth District applied to West Point this year.","date":"Tue Dec 14 22:50:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Each year I have the honor to nominate a limited number of young men and women to U.S. Service Academies. These outstanding students deserve our thanks for their willingness to serve our country. I am proud to nominate them and wish them all the best in their future endeavors.","date":"Tue Dec 14 18:59:17 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Ninth District Nominees:\n\nU.S. Air Force Academy\nD.J. Albert — Narrows\nNicholas Brians — Blacksburg\nMorgan Dales — Cedar Bluff\nBrenna Mills — Radford\nTrenton Watkins — Marion\nAudrey Williams — Weber City\n\nU.S. Naval Academy\nCamden Cormany — Radford\nJack Thompson — Blacksburg","date":"Tue Dec 14 18:59:17 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topic: Taking Action to Combat Fentanyl https://t.co/Dte5NqtNwn","date":"Fri Dec 10 20:34:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Health care workers have borne a great deal during the coronavirus pandemic. Biden Admin's decision to impose vaccine mandates places even more upon their shoulders. This imposition adds to the challenges already faced by health care providers. \n\nRead on: https://t.co/qXga9ALAmg","date":"Thu Dec 09 22:42:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am pleased to announce that the winner of this year’s Congressional App Challenge in the Ninth District is the team of Christian Musick, Theodore Boyd, Isabella Ashby, and Ava Deckard of Lebanon High School for their app, \"Codeucation.\" https://t.co/phHaGqpA2z","date":"Thu Dec 09 19:44:18 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"@boblatta Our bill doesn’t stop there. It streamlines research on fentanyl analogues so we can better understand the effects of these substances.\n\nThere are as many as 4,800 fentanyl analogues. We have data on fewer than 30 of them – in other words, fewer than one percent of them.","date":"Wed Dec 08 16:24:06 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Fentanyl related substances are contributing to the surge in overdose deaths, but under current law, their temporary placement in Schedule I expires in February. The HALT Fentanyl Act introduced by @boblatta and I would make that scheduling permanent.","date":"Wed Dec 08 16:19:46 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we remember the individuals lost at Pearl Harbor and the Americans who fought for victory in the following years.\n\nBelow is an interesting article about the lives lost on the U.S.S. Arizona on December 7, 1941: https://t.co/YO1yFp6oCz","date":"Tue Dec 07 14:09:31 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Eighty years ago was “a date which will live in infamy.”\n\nImperial Japanese forces launched a surprise attack on Pearl Harbor, killing more than 2,400 Americans. The United States formally entered World War II the next day. https://t.co/ZLJd4CiOoc","date":"Tue Dec 07 12:55:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Bob Dole was one of the great statesmen of the Greatest Generation. He overcame a horrific injury in World War II to faithfully serve his country in the House, the Senate, and as a Republican presidential candidate. His long and honorable career was a true American success story.","date":"Sun Dec 05 17:21:35 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.3.21 Topic: No to Vaccine Mandates https://t.co/K9hZPOyWXL","date":"Fri Dec 03 20:47:23 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"While this ruling will not be the final word, it is the right call. President Biden’s mandate infringes on liberties and further strains health care providers. https://t.co/t8kfQwu00u","date":"Wed Dec 01 22:54:19 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Honaker High School alum Jordan Stout on being named Big Ten Punter of the Year! https://t.co/FVc3TtU3ei","date":"Wed Dec 01 17:09:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Hanukkah! Best wishes to all celebrating this festival of lights. https://t.co/nlZxHrLv7g","date":"Tue Nov 30 16:10:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Buying an electric car is not a realistic option for most 9th District families. The median household income in VA-9 in 2019 was $46,909. A low-end electric vehicle is $39,999.\n\nThe Administration continues to distract, deflect, and distort on gas prices. \nhttps://t.co/UiRejN62SE","date":"Mon Nov 29 21:47:54 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.26.21 Topic: To Lower Energy Prices, Embrace American Energy Dominance https://t.co/essZlaQixN","date":"Fri Nov 26 18:14:06 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Wishing all Virginians and Americans a very happy Thanksgiving! https://t.co/ARfPnlSBki","date":"Thu Nov 25 13:00:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Wytheville today to break ground on the Blue Star NBR and Blue Star AGI facility, site of a $714 million investment and the anticipated creation of nearly 2,500 jobs. https://t.co/lkZhlxU6Ko","date":"Mon Nov 22 22:32:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Public Health Thank You Day. I offer my sincerest thanks to all the public health care workers who resiliently serve in Ninth District communities. Your efforts are greatly appreciated.","date":"Mon Nov 22 18:20:01 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Exciting developments are under way in the Town of Pocahontas. The Abandoned Mine Land funding we secured for Virginia has helped kickstart growth and renewal. https://t.co/9xXxoxlDMU","date":"Mon Nov 22 15:36:01 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Auburn and Glenvar volleyball on earning VHSL titles today! https://t.co/Y0NWQbOmx4","date":"Sat Nov 20 21:15:24 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.19.21 Topic: The First Thanksgiving https://t.co/hIJpEzNuDj","date":"Fri Nov 19 21:30:39 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Democrat reconciliation bill is a mess. It promises to ‘Build Back Better’ but is littered with policies that will make life more expensive and less free for the average American.\n\nMy full statement below:\nhttps://t.co/cz8Sw7Xz0J","date":"Fri Nov 19 15:43:37 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"The underlying problem is we have sent a message to the market that the United States is not interested in doing our own exploration and producing our own oil and making sure that we are self-sufficient on energy.\" https://t.co/9yXSvQ8kuT","date":"Thu Nov 18 21:00:42 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This story shows where Democrat priorities really lie.\n\nThe only thing the reconciliation bill will Build Back Better is bank accounts of the wealthy in high-tax areas. It takes tax dollars from Marion to bail out Manhattan fat cats. https://t.co/RYC8W7vbdN","date":"Wed Nov 17 20:54:55 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Vaccine mandates are a tremendous burden on businesses already struggling with the pandemic's economic upheaval. To protect the livelihoods of 9th District workers and Main Street employers, I have joined this effort to overturn the Biden Administration’s executive overreach.","date":"Wed Nov 17 15:15:37 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Oct., a record 164,303 illegal immigrants were apprehended trying to cross the southern border, many of whom were then released into the U.S.\n \nCBP also seized 899 pounds of fentanyl &amp; 15,631 pounds of meth.\n \nBiden border policies enable illegal immigration &amp; endanger lives. https://t.co/UGJQlG9pW7","date":"Tue Nov 16 22:46:19 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/0KjjCs3zvO","date":"Mon Nov 15 23:34:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/cXmUC2dueO","date":"Mon Nov 15 22:01:35 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"My staff in the Christiansburg and Abingdon district offices and I were honored to join all who gathered along the route of the Heroes Escort for Big Stone Gap Officer Michael Chandler. https://t.co/mQvrLgxWwB","date":"Mon Nov 15 21:59:55 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I send my deepest condolences to the family and loved ones of Officer Michael Chandler. He courageously served, protected, and defended those around him. His death is a tragedy for Big Stone Gap and all who respect the dangerous yet essential work of law enforcement.","date":"Sun Nov 14 22:19:53 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topic: The Trouble With the Infrastructure Bill\n\nhttps://t.co/gTGnQ5G6jV","date":"Fri Nov 12 22:08:49 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"While John Kerry is in Scotland trashing American coal, Southwest Virginia is showing how coal will continue to play a role in the world economy.\nhttps://t.co/5uHE8Qxf1q","date":"Fri Nov 12 19:14:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanksgiving is fast approaching, but unfortunately celebrating this year will be costlier than ever. President Biden’s policies are driving up prices of the staples served on this holiday. https://t.co/UK0W75DGQJ","date":"Fri Nov 12 17:00:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"“On such an occasion as this, amid such a scene, our thoughts alternate between defenders living and defenders dead. A grateful Republic will be worthy of them both. Our part is to atone for the losses of heroic dead by making a better Republic for the living.”","date":"Thu Nov 11 13:42:48 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"In my most recent weekly e-newsletter, I quoted the speech of President Warren Harding dedicating the Tomb of the Unknown Soldier 100 years ago today. His words are worth remembering on this day:","date":"Thu Nov 11 13:42:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we honor Veterans Day. Thank you to all the men and women in Virginia’s Ninth Congressional District and across the land who have served our country in uniform. We appreciate all you risked and gave for our liberties.","date":"Thu Nov 11 13:42:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Update: the President signed this bill into law today.","date":"Wed Nov 10 18:43:30 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Uncovering the origins of COVID-19 is important for accountability and preventing future pandemics. We will continue to press for answers from the agencies with information about what might have happened in Wuhan.","date":"Tue Nov 09 19:03:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I have extended the deadline for interested students to apply for a nomination to the U.S. Service Academies. Applications are now due to the Abingdon district office by close of business on Monday, November 15th. Learn more about the nomination process ⬇️ https://t.co/Cw0P3PuHzo","date":"Tue Nov 09 16:12:07 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topic: Veterans Day https://t.co/BD10Qs5IdM","date":"Sat Nov 06 19:42:53 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"“Remember, remember the Fifth of November,” goes the famous rhyme about the failed Gunpowder Plot in the UK.\n\nIn the U.S., which historic failure of Speaker Pelosi’s will this Fifth of November be remembered for?","date":"Fri Nov 05 19:03:06 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"At 8:13 am, the House took up a motion to adjourn.\n\nSix hours later, the vote is still open - the longest vote in House history.\n\nWhat will it take to end this vote? Departure time for Speaker Pelosi's jet for her European trip?","date":"Fri Nov 05 18:13:41 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Here I am with the latest version of the reconciliation bill.\n\nThere’s no way members will be able to read and understand all of it before voting.\n\nAmericans have had enough of “We have to pass the bill so that you can find out what is in it.” https://t.co/lnav22Nnhs","date":"Fri Nov 05 15:08:45 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On Wednesday, President Biden says \"That’s not gonna happen” about illegal immigrants receiving $450,000.\n\nToday, his staff says he’s “perfectly comfortable” with it.\n\nThese mixed messages will only encourage more illegal border crossings. https://t.co/z9kHdVt6lW","date":"Fri Nov 05 00:01:01 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"As House Democrat leaders continue to pursue their socialistic drug pricing scheme, remember that they still have not made the case that it’s even constitutional. https://t.co/vqdjT6RjPA","date":"Thu Nov 04 20:28:39 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Rural health care systems already have trouble recruiting and retaining workers. The vaccine mandate rolled out today by President Biden will only add to the burdens carried by hospitals in rural areas. https://t.co/QqWtipOlde","date":"Thu Nov 04 16:16:04 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"What’s one of the additions to this bill? Raising the cap on the state and local tax deduction, which will primarily benefit the wealthiest Americans who live in high-tax areas.","date":"Wed Nov 03 21:45:45 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi’s reconciliation bill last week was 1,700 pages. Today a new version was released that magically grew to over 2,000 pages, and it came out just an hour before the Rules Committee met to discuss it. \n\nThat’s no way to legislate.","date":"Wed Nov 03 21:44:54 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Glenn Youngkin on his election as Virginia’s 74th Governor. I am confident he will do a great job for the people of our Commonwealth.","date":"Wed Nov 03 12:11:18 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Election Day in Virginia. For Americans, voting is our civic responsibility and ensures that our government is of, by, and for the people. Virginians can find election information, including local ballot details and polling place locations, at https://t.co/0FR5r1i3FZ.","date":"Tue Nov 02 10:04:15 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Paying $450,000 per person to any illegal immigrant is an insult to taxpayers and will only encourage more lawbreaking. As with so many of its ideas, this Biden Administration proposal defies logic. https://t.co/sucG8imdvp","date":"Mon Nov 01 18:38:35 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Democrat big government reconciliation bill is full of budget gimmicks but lacks the Hyde Amendment. It taxes natural gas that heats your home but subsidizes electric cars for a family making up to $800,000. https://t.co/XqkAcTpSTI","date":"Sat Oct 30 17:20:01 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am proud that both the House and the Senate have now on a bipartisan basis advanced this measure to improve oversight over opioids and prevent future abuses, and I look forward to its enactment in the near future. https://t.co/MnT36RE04v","date":"Wed Oct 27 19:47:25 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.29.21 Topic: A Failure to Govern https://t.co/iikfX1GUhB","date":"Fri Oct 29 20:37:28 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the death of Governor Linwood Holton: https://t.co/JILpQOqGPg","date":"Thu Oct 28 23:03:54 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"For all that is in the reconciliation bill, it lacks the Hyde Amendment to prevent taxpayer funding of abortions. Democrats, including Joe Biden, long supported this protection for conscience, but no more.","date":"Thu Oct 28 22:28:30 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Even as energy prices skyrocket, the natural gas tax remains in reconciliation. It will drive up heating bills and costs for products made with natural gas such as plastics, hitting consumers in their wallets and endangering jobs.","date":"Thu Oct 28 21:59:49 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Under this bill to “Build Back Better,” the Federal Government provides subsidies for buyers of new electric vehicles.\n\nA low-end new electric vehicle costs only a few thousand dollars less than the median household income of the Ninth District.","date":"Thu Oct 28 20:56:07 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m currently reading Speaker Pelosi’s 1,700 page reconciliation monstrosity, just released this afternoon. What I am holding in my hands is only the first 800 pages.\n \nI’ll be reading to see which of her big government priorities made the cut. https://t.co/uCx5m6LstQ","date":"Thu Oct 28 20:28:20 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Biden Administration wants to expand the IRS and give it more access to your bank account. I am committed to opposing this invasive power grab. It is as if the president read George Orwell’s 1984 and came away thinking Big Brother is the hero. https://t.co/9vfPGLDP8i","date":"Thu Oct 28 14:14:56 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am proud that both the House and the Senate have now on a bipartisan basis advanced this measure to improve oversight over opioids and prevent future abuses, and I look forward to its enactment in the near future. https://t.co/MnT36RE04v","date":"Wed Oct 27 19:47:25 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"According to AAA, Virginia’s average gas price today is $3.29 compared to $2.06 a year ago. \n\nApparently “Build Back Better” means stay at home or pay more at the pump.","date":"Wed Oct 27 14:38:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Since Joe Biden became President, energy prices have risen sharply. If he doesn’t change course and support all-of-the-above energy policies, worse is yet to come. The Energy Information Administration projects heating bills will increase by as much as 54% over last winter.","date":"Wed Oct 27 00:33:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"@HouseCommerce wrote to Energy Secretary Granholm asking what the Biden Administration’s strategy is for avoiding further price surges and supply shortages. https://t.co/CWYh22DaE4","date":"Tue Oct 26 21:40:19 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"As winter approaches, Americans are confronting rising energy prices. According to Energy Information Admin, since this time last year:\n\n📈home heating oil went up from $2.15 to $3.36/gallon\n📈gasoline rose from $2.14 to $3.38/gallon\n📈natural gas went up from $3.02 to $5.09/mBtu","date":"Tue Oct 26 21:39:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"More from Route 58 and Route 220 Business in Martinsville. https://t.co/ytBa0G5Map","date":"Tue Oct 26 14:22:11 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"We can’t afford to pass a $1.2 trillion infrastructure bill that won’t fix bridges like this. https://t.co/9NhwIviXXS","date":"Mon Oct 25 20:27:30 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’d vote for an infrastructure bill that would help rebuild bridges like this one on Virginia State Route 663 in Montgomery County. The current $1.2 trillion bill won’t. https://t.co/zJe1J4pNkX","date":"Mon Oct 25 14:24:46 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This bridge, part of U.S. 221 in Floyd County, needs help. It won’t get it from the $70 billion for transmission and battery storage in the infrastructure bill President Biden wants passed. https://t.co/rt8CDo6gln","date":"Fri Oct 22 20:32:11 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.22.21 Topic: A Historic Failure at the Border https://t.co/bcqxP0yV76","date":"Fri Oct 22 17:16:31 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden wants Congress to pass a $1.2 trillion infrastructure bill, but only a portion of the bill actually spends money on the infrastructure we all benefit from - roads and bridges - and even less of that is new spending. \n\nThis bill is a wasted opportunity. https://t.co/afeyrzOQQk","date":"Fri Oct 22 14:57:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This Saturday is National Prescription Drug Take Back Day. Unused or expired medications are prone to abuse, so Take Back Day is a chance to safely dispose of them and protect loved ones from drug addiction. Find a collection site near you at https://t.co/jFQtNlKy1C. https://t.co/aQf63Z3LMT","date":"Thu Oct 21 15:54:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to see this great honor for my friend @DrPhilRoe today. He was a great advocate for veterans and for East Tennessee during his time in the House. https://t.co/RBTTdK7fOy","date":"Wed Oct 20 22:25:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Prohibiting IRS Financial Surveillance Act would protect taxpayers from the intrusive monitoring proposed by President Biden. I am proud to join this effort to deny the IRS its power grab. https://t.co/JFpRJZg9Ty","date":"Wed Oct 20 16:02:41 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Biden Administration wants to give the IRS more power to pry into the details of your private bank account. Residents of Virginia’s Ninth Congressional District have made it clear that they oppose this intrusion into their rights, and I am determined to fight it.","date":"Wed Oct 20 16:02:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter Topic: Hearing From You https://t.co/z9uy8kph6p","date":"Sat Oct 16 15:13:45 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congrats to William Shatner for going to space. He is clearly living a long and prosperous life!\n\nhttps://t.co/hzqPNsURGi","date":"Wed Oct 13 15:45:56 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good luck Captain Kirk!","date":"Wed Oct 13 14:47:02 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.8.21 Topic: Logan’s Lament https://t.co/EV6klr09E4","date":"Fri Oct 08 17:56:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Gas prices are at their highest since the Obama-Biden Administration. Diminishing American energy production means higher prices for Americans at the pump. https://t.co/coO9gNUk57","date":"Thu Oct 07 17:28:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The arrival of Blue Star NBR, LLC and Blue Star AGI in Progress Park, creating nearly 2,500 manufacturing jobs and investing over $714 million, is tremendous news for the region. https://t.co/KfKanmmn5c https://t.co/4TsTI78ea8","date":"Mon Oct 04 20:45:55 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.1.21 Topic: Democrats Target Natural Gas https://t.co/j0JWLQBmJz","date":"Fri Oct 01 18:48:51 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Manufacturing Day. Join me in celebrating the Ninth District’s manufacturers and supporting the next generation of great American creators. @MFGDay #MFGDay21 https://t.co/IFoH5AB7DZ","date":"Fri Oct 01 14:35:35 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Democrat reconciliation bill would devastate small businesses by:\n\n▪️raising the top income tax rate which many small businesses pay\n▪️limiting the 20 percent Small Business Deduction\n▪️imposing costly new mandates\n\nSmall businesses deserve better than to be tax code targets.","date":"Thu Sep 30 14:28:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Natural gas prices around the world are soaring while inflation here takes a toll on family budgets. Yet the Democrat reconciliation bill would impose a natural gas tax hike that threatens to eat up even more that Americans earn and save. https://t.co/0ttzBvx7Mn","date":"Wed Sep 29 21:03:29 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"Federal legislation that would expand the consumer market for hemp and CBD products is expected to have widespread support once it moves forward in Congress, U.S. Rep. Morgan Griffith said Tuesday.\" https://t.co/SDfBZxahgp","date":"Wed Sep 29 18:09:20 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Americans and Ninth District taxpayers across the board will feel the brunt of the Democrat tax hike plan.","date":"Wed Sep 29 14:09:11 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The tax breaks found in the Democrats’ reckless reconciliation bill won’t benefit hardworking Ninth District taxpayers, but they will support lavish lifestyles among the wealthy.","date":"Tue Sep 28 21:16:25 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am pleased that SCHOCK has selected the Patriot Centre Industrial Park for its first U.S. manufacturing operation. The jobs projected to come to the Martinsville-Henry County area over the next several years will be a great contribution to the community. https://t.co/1GaGTRQsSU","date":"Tue Sep 28 17:55:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.27.21: Funding the Democrats’ Spending Spree\n\nhttps://t.co/fI8zN3zyNB","date":"Mon Sep 27 16:22:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This week during my Oversight and Investigations Subcommittee hearing, I asked witnesses about the impact COVID-19 has had on children.\n\nhttps://t.co/iGgfgATI9G","date":"Fri Sep 24 19:45:49 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This week during my Oversight and Investigations Subcommittee hearing, I delivered opening remarks regarding the impact COVID-19 has made on children. \n\nhttps://t.co/2D18dR2jP2","date":"Thu Sep 23 21:26:53 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"It was a pleasure to meet with Gretchen Carlson today to discuss H.R. 4445, which would end forced arbitration of sexual assault and harassment claims. https://t.co/5Rs1P5KS6t","date":"Thu Sep 23 18:56:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.17.21: The Services My Office Provides\n\nhttps://t.co/bgCm0h1iwD","date":"Fri Sep 17 14:24:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today in the Energy and Commerce Committee Markup, I made comments on gain-of-function research in the COVID origins investigation.\nhttps://t.co/7Qy1Y9JsX0","date":"Wed Sep 15 20:49:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.10.21: Griffith Remembers 20th Anniversary of 9/11\nhttps://t.co/73J3Afw857","date":"Fri Sep 10 18:28:02 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Met with representatives from Dickenson County in Clintwood. https://t.co/nuqKZ11lcp","date":"Wed Sep 08 22:54:46 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Visited Abingdon today, and listened to members of law enforcement and other community leaders discuss challenges with mental health treatment in Virginia. https://t.co/gn83r78dWK","date":"Tue Sep 07 17:26:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On the first Monday of September, Americans observe Labor Day. Today, we honor and celebrate American workers. I wish you a safe and happy Labor Day with family, friends, and community. https://t.co/DoKDydtqNT","date":"Mon Sep 06 14:00:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.3.21: A Time for Accountability https://t.co/7yNaArCD9m","date":"Fri Sep 03 15:00:21 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Visiting J &amp; D Tire, a small business in Pulaski. https://t.co/kH4xl1nszC","date":"Thu Sep 02 23:30:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Visited Carroll County and discussed economic development opportunities in the area. https://t.co/Yv4qznLyzj","date":"Thu Sep 02 20:54:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/OKMP8D9Of6","date":"Wed Sep 01 16:16:49 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Due to the amount of recent rainfall and current ground saturation levels, residents across the ninth district should take proper precautions and make necessary preparations in anticipation of possible flooding with the arrival of Ida Tuesday.","date":"Mon Aug 30 18:20:15 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.27.21: No to a Second Death Tax \n\nhttps://t.co/xD7JBgjKZW","date":"Fri Aug 27 17:13:34 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am praying for our troops who are risking their lives in Afghanistan to safely evacuate Americans and our Afghan allies. My heart goes out to the families of our brave service members who have lost their lives or have been wounded in today’s attack.\n\nhttps://t.co/j5RWyVQnLs","date":"Thu Aug 26 18:03:07 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Pleased to give remarks today in Marion regarding the expansion of Woodgrain Inc. https://t.co/fSPPVgtdjz","date":"Fri Aug 20 16:47:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.19.21: Botched Exit\n\nhttps://t.co/azwaWs5aPL","date":"Thu Aug 19 18:48:59 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The U.S. Department of Transportation has awarded $5,144,800 to the Cumberlands Airport Commission located at the Lonesome Pine Airport in Wise County to help improve drainage and erosion control and rehabilitate the runway.\n\nhttps://t.co/bsRFWxkV3D","date":"Thu Aug 19 18:33:15 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"While I have supported an orderly withdrawal of our troops from Afghanistan, President Biden and his Administration have botched America’s exit. The problem was not withdrawing American troops, but that the President’s team did not have an adequate plan to see it through.","date":"Mon Aug 16 21:01:17 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/fAOs8XsghC","date":"Mon Aug 16 21:01:17 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.13.21: Neurodegenerative Diseases\nhttps://t.co/6qFwLGotbl","date":"Fri Aug 13 16:58:28 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I participated in the announcement that more than $2.2 million has been awarded to Ecotourism in Nature’s Wonderland as a part of the federal Abandoned Mine Land Economic Revitalization Program. https://t.co/p4fmecbouW","date":"Thu Aug 12 16:29:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I toured the Mountain Empire Airport and met with the Smyth-Wythe Airport Commission. https://t.co/CA71x64BE8","date":"Wed Aug 11 21:00:07 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I attended a meeting at Integrated Textile Solutions, in Salem, with representatives from Integrated Textile, CW Armor, and Dupont. https://t.co/WyKwFNruCO","date":"Tue Aug 10 20:43:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.6.21: A Health Care Agenda for the Future\n\nhttps://t.co/KBEqPhDYEK","date":"Fri Aug 06 14:43:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I discussed policy issues with executives at Ingevity in Covington. They make a variety of activated carbon products used to make the world a cleaner place. https://t.co/MkL27f2vgi","date":"Wed Aug 04 18:39:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"While in Craig County yesterday, I had a meeting with the County Administrator, Dan Collins. https://t.co/fvgLY7hofl","date":"Wed Aug 04 14:59:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I visited the LewisGale Medical Center in Salem for the announcement of the new robot-assisted technology, which enables earlier detection of lung cancer. https://t.co/WEjPoQO8Ab","date":"Tue Aug 03 21:55:23 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I joined two of the Boy Scouts from the Ninth District, Braxton Brummett and Dakota Osborne, to tour the Buchanan Sanctuary and see their service projects. Braxton has already received his Eagle and Dakota is finishing his Eagle. https://t.co/ekJCvhHUyz","date":"Tue Aug 03 00:56:04 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I met with Glenmary Berries of Bristol, Virginia, and it’s head, Michael Richard. https://t.co/POIGKbBMfn","date":"Mon Aug 02 18:52:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.30.21: Charade\nhttps://t.co/sMop4KG4Ei","date":"Fri Jul 30 20:47:11 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"At today's Health hearing: ALS and more\nhttps://t.co/CNOCtCLQWH","date":"Thu Jul 29 19:35:21 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"My questions at the Energy &amp; Commerce hearing on electric transmissions. https://t.co/3LHjsIwRij","date":"Tue Jul 27 21:12:34 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I had the honor of meeting &amp; listening to Dick Heller at the Second Amendment Caucus Meeting. Mr. Heller is best recognized for his role in the Supreme Court case, D.C. v. Heller. This case overturned the D.C. gun ban &amp; protected the right to keep &amp; bear arms for self-defense. https://t.co/qrVpt5c2Ja","date":"Wed Jul 21 15:26:18 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m glad to have time between votes and a meeting this evening to join the Lebanon Pioneers at Nationals Stadium for champions night. I offer my congratulations to them for their great achievement of winning the Virginia High School League Class 2 State Championship! https://t.co/EO87ytg6tc","date":"Tue Jul 20 23:18:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today at my Oversight and Investigations Subcommittee, I pressed for how we can better protect patients and healthcare facilities from ransomware attacks. https://t.co/6VIDJw85Eu","date":"Tue Jul 20 18:21:52 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"This morning I did a live interview with WFIR. You can listen to it here. https://t.co/rBLZU6mrvW https://t.co/xd8bS0PhTa","date":"Fri Jul 16 20:20:42 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Keeping taxpayers out of the abortion business should not be a partisan issue. I stand with the majority of Americans who don’t want their tax dollars to pay for abortions. That’s why I proudly support the Hyde Amendment. #HydeSavesLives https://t.co/BzHTjIpHvH","date":"Thu Jul 15 17:55:14 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.9.21 Topic: The Importance of the Hyde Amendment https://t.co/QVF6vMbBx7","date":"Fri Jul 09 18:12:21 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The USDA’s award of more than $3 million for the restoration of the town’s outdated pipes and service lines will be a tremendous benefit for the people of Hillsville.\nhttps://t.co/XxdWKpTZZ0","date":"Wed Jul 07 16:44:08 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.2.21 Topic: Born on the Fourth of July https://t.co/iRWj3XY2Px","date":"Fri Jul 02 14:31:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"While we fight to protect the Hyde Amendment at the federal level, starting today Virginia taxpayer-supported exchanges can offer abortion coverage, a violation of the principles Hyde protects. Thanks to Senator David Suetterlein for pointing this out.","date":"Thu Jul 01 15:20:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The assault on the Hyde Amendment threatens to undo this important protection for the lives of millions and the consciences of millions more.\n \nThat’s why we need H.R. 18, the No Taxpayer Funding for Abortion Act. https://t.co/9mRImXX4m7","date":"Wed Jun 30 16:51:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The assault on the Hyde Amendment threatens to undo this important protection for the lives of millions and the consciences of millions more.\n \nThat’s why we need H.R. 18, the No Taxpayer Funding for Abortion Act. https://t.co/9mRImXX4m7","date":"Wed Jun 30 16:51:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Auburn for earning both baseball and softball state titles and to Lebanon for winning a baseball title today.","date":"Sat Jun 26 22:13:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Congressional App Challenge is now open for Ninth District middle school and high school students. Full details about the contest can be found on my website. https://t.co/5QVcm7TCKD","date":"Sat Jun 26 18:14:37 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"When I went to the border, I saw unused materials that had already been contracted for lying by open gates and parts of the unfinished wall, the result of President Biden’s illogical and wasteful decision to immediately stop all construction on the wall.","date":"Thu Jun 24 15:07:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The surge of illegal immigrants and contraband into the country that followed was entirely avoidable and reflects poorly on the Biden Administration’s ability to fulfill its constitutional duties.","date":"Thu Jun 24 15:07:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The heightened crisis at the southern border is almost entirely one of President Biden’s own doing. For purely ideological reasons, his Administration ended policies that were working to secure the border and protect the American people. https://t.co/ZrSD0Lzkxr","date":"Thu Jun 24 15:07:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"VP Harris’ trip to the border is belated, but if she goes with open eyes she will see the consequences of President Biden’s policies: open gates, material for the wall lying unused in the sun, overstretched Border Patrol, and a surge in illegal crossings. https://t.co/ukrQiTYFin","date":"Wed Jun 23 21:58:20 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.18.21 Topic: In Memory of Barbara Stafford, Public Servant https://t.co/AkilpVZzoa","date":"Fri Jun 18 14:39:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House of Representatives can't represent Americans when all Members aren't even required to show up in person. @SpeakerPelosi, tear down the fence and reopen the House. https://t.co/hd5Yol61Vf","date":"Wed Jun 16 14:52:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to be recognized by @ACUConservative with the Award for Conservative Achievement for my voting record in defense of our constitutional principles. https://t.co/JzwTZLyrnl","date":"Tue Jun 15 22:22:48 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On June 14, 1777, the Second Continental Congress approved a resolution that created the flag of the United States. Ever since, the Stars and Stripes has been a symbol of our aspiration to liberty and justice for all. Happy Flag Day! https://t.co/NPHqLHPvfZ","date":"Mon Jun 14 17:43:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.11.21 Topic: Reopen the House of Representatives https://t.co/ODxZw68Utq","date":"Fri Jun 11 16:58:54 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today for an Energy and Commerce markup I came to the committee room. Only one other member joined for a time. The country is reopening and returning to normalcy. The House and its committees should, too. https://t.co/tjMtRhQQqB","date":"Thu Jun 10 16:19:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I joined Evening Edit with Liz MacDonald on Fox Business to discuss the @HouseCommerce Republican investigation into COVID-19's origins. We need to get all of the answers for the American people. https://t.co/ipZkwHlFQu","date":"Wed Jun 09 14:25:41 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.7.21 Topic: Investigating the Origins of COVID-19 https://t.co/p1GHE219Ul","date":"Mon Jun 07 16:17:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"77 years ago, Allied forces stormed the beaches of Normandy. When I spoke to the athletes of Ironman 70.3 Virginia’s Blue Ridge this morning, I noted the steep price our region paid on D-Day. Those heroes guaranteed our freedoms, and their deeds deserve our honor today.","date":"Sun Jun 06 19:02:02 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke with WCYB this week about what I witnessed at a refugee facility on my trip to the southern border. It is imperative they do a better job of vetting where they send the children after they leave these facilities. We have an obligation to make sure these children are safe. https://t.co/Ys1al1moSH","date":"Fri Jun 04 21:16:05 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Memorial Day, let us remember those that sacrificed their own lives for the liberty and freedom of country. We are forever grateful for your service. https://t.co/NWjJwwPbEn","date":"Mon May 31 12:51:53 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I joined the Fox News Rundown to discuss the investigation into COVID-19's origins, infrastructure, and more.\n\nWas it an accidental release of the virus? What kind of research was the Wuhan lab doing? We need more answers. https://t.co/yr4Mho554a","date":"Thu May 27 18:13:34 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke to @newsmax about what I saw at the southern border. President Biden's order to halt construction on the border wall has led to absurd outcomes. We need to finish the wall. https://t.co/p5kQhSuvos","date":"Thu May 27 14:46:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was his campaign’s Emory &amp; Henry College coordinator during his first fight for the Republican nomination for Senate. I fondly remember putting signs together in the modest hotel suite of the future senator and his then-wife Elizabeth Taylor.","date":"Wed May 26 12:29:57 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"John Warner was an old friend. More importantly for the country and the Commonwealth, he was a giant of VA politics. For five terms he represented VA with distinction in the U.S. Senate, and among his achievements, he helped drive the military expansion that won the Cold War.","date":"Wed May 26 12:29:57 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was honored when he repaid the favor by assisting me in my first race for the House of Delegates. \n\nA true gentleman and patriot, John Warner will be missed but not forgotten.","date":"Wed May 26 12:29:57 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"SunCoke Energy is an important asset for Buchanan County’s economy. The company’s planned $50 million investment reinforces its commitment to jobs in the region, strengthens Buchanan County’s economic outlook, and indicates the positive possibilities for coal’s future.","date":"Tue May 25 16:00:21 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.21.21 Topic: The Biden Agenda: No to American Energy, Yes to Russian Energy? https://t.co/imwmJnrVTf","date":"Fri May 21 19:57:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"\"Rep. Morgan Griffith, R-Salem, the top Republican on the Oversight and Investigations Subcommittee, along with other GOP lawmakers, wrote a letter to Blinken requesting documents be declassified to help them investigate 'the possibility of an accidental laboratory leak.'\"","date":"Fri May 21 15:50:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"One in five people in the United States have a mental health condition, according to @SAMHSA data. It’s important to take care of your mental health today and every day. Make the time this #MentalHealthMonth to check in on yourself and the people you care about. https://t.co/ABOvRhFFgf","date":"Thu May 20 16:29:04 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden’s failure to secure the border has given a green light to drug trafficking. As a consequence, more Americans are vulnerable to the opioid crisis. https://t.co/5zrbsI5E2o","date":"Tue May 18 18:09:28 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.17.21 Topic: Now is the Time to Stand With Israel https://t.co/QwChs0TcEy","date":"Mon May 17 14:43:48 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am pleased to announce I have received @NTU’s “Taxpayers’ Friend Award” for my voting record supporting economic freedom and low taxes during the 2020 Congressional session. Only 33 out of 435 House members received this honor.","date":"Fri May 14 15:18:38 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"During this #NationalPoliceWeek, let’s thank all the brave men and women who put their lives on the line to protect our communities and families every day. Virginia is proud to #backtheblue! https://t.co/NP7SZloDVG","date":"Thu May 13 21:29:10 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I support the people of Israel as they defend themselves against the vicious rocket attacks of Hamas. The United States must stand by its strongest ally in the Middle East against terrorists who deny Israel’s right to exist.","date":"Wed May 12 16:33:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Mother’s Day to my mother, my wife, and all the great mothers in Virginia and across the country. https://t.co/rMGmww56VU","date":"Sun May 09 16:21:27 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am praying for Norton Police Chief James Lane after he was wounded in a shooting today.","date":"Fri May 07 22:20:25 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.7.21 Topic: Prescription Drugs: Lower Prices, More Cures https://t.co/6RWFBwkzZS","date":"Fri May 07 21:00:57 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Finding the origins of COVID-19 means following the evidence. @HouseCommerce leaders including myself ask that Secretary of State Blinken declassify documents that may shed light on links between Chinese military research and the coronavirus outbreak.","date":"Fri May 07 17:25:34 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Correctional officers engage in difficult but essential work. During National Correctional Officers and Employees Week, let’s thank them for the job they do in the name of public safety.","date":"Fri May 07 14:24:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.3.21 Topic: Biden’s First 100 Days: An Oversight Update https://t.co/PkwKugTNL1","date":"Mon May 03 15:07:46 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to learn of the death of NASCAR driver Eric McClure. He and his family have long been Southwest Virginians. My condolences to his loved ones.","date":"Sun May 02 20:05:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Salem on its tenth state football title.","date":"Sat May 01 23:07:11 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I stopped by the Law Day Blood Drive in Lebanon. Special thanks to Bruce Russell for organizing.\n\nBlood supply levels are very low in SWVA. If you can get to a blood bank to give, please do so. https://t.co/WU5G68t8Lq","date":"Fri Apr 30 21:21:59 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Pocahontas today to announce a $379,178 Abandoned Mine Land Pilot Project grant for renovations of the exhibition mine. https://t.co/JNmEauIYYD","date":"Fri Apr 30 17:58:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"More innovative uses for drone technology in our area. https://t.co/HSa5VPKALV","date":"Thu Apr 29 15:54:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 4.26.21 Topics: Johnson &amp; Johnson Vaccine; The President’s Climate Summit: A Missed Opportunity https://t.co/uW3eFYwvgu","date":"Mon Apr 26 14:54:39 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"It has been a history-making week for Ninth District school athletics. Congratulations to Alleghany for its boys cross country state title, the school’s first in any team sport, and Giles for its first girls volleyball state title, the school’s first for its girls teams.","date":"Sun Apr 25 00:20:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Reminder: National Prescription Drug Take Back Day is tomorrow.","date":"Fri Apr 23 20:20:50 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Clean air should not fall victim to bureaucratic inertia. Instead, we can trust the innovatory spirit and good sense of the American people.\n\nRead more from my op-ed in the Washington Times: https://t.co/57ncpMcTvm","date":"Thu Apr 22 20:52:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"It is essential – for science, accountability, and history – that we have a full and impartial investigation into the origins of COVID-19.","date":"Fri Apr 16 20:42:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today marks fourteen years since the shooting at Virginia Tech. This senseless tragedy claimed 32 lives and forever changed many others. We honor those lost, mourn with their loved ones, and embrace those who survived the events of that terrible day.","date":"Fri Apr 16 13:46:55 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am proud to sponsor this small but important fix that will assist in fighting the opioid epidemic that has hurt too many. https://t.co/8zAaFXtZq4","date":"Fri Apr 16 00:24:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"ARC’s award of $500,000 for the Millwald Theatre’s restoration will be a tremendous benefit for the project and, ultimately, the people of Wytheville. I look forward to seeing a show there when it is completed. https://t.co/6jVS2miMwj","date":"Mon Apr 12 22:36:25 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.12.21 Topic: Technological Advances in the Ninth District https://t.co/kBf8mWXFuE","date":"Mon Apr 12 18:42:38 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Students in Wise County Public Schools are able to access the internet through Starlink, a satellite broadband service. I learned more about the program during a presentation yesterday and discussed the issue with WCYB. https://t.co/lbFYBdIG8Y","date":"Fri Apr 09 15:49:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Shuttered Venue Operators Grant program is now accepting applications. Eligible entities include live venues, movie theaters, performing arts productions, and others. Learn more, including how to apply, at https://t.co/ybOcrsgqXa.","date":"Thu Apr 08 17:35:47 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Holocaust Remembrance Day, we vow never to forget the six million Jews and other innocent victims killed by the Nazi regime. The atrocities of the Holocaust warn of the evils that can be committed out of hatred and urge us to prevent their recurrence. https://t.co/eObAidkSyL","date":"Wed Apr 07 16:54:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"An honor to recognize Wythe County Sheriff’s Deputy Jacob Goins today with the Congressional Badge of Bravery. Even after being struck by gunfire, Deputy Goins pursued the suspect in an armed robbery. He exemplifies devotion to duty despite the dangers faced by law enforcement. https://t.co/GPca1se9Sb","date":"Tue Apr 06 17:50:53 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I wish you and your loved ones a happy Easter. https://t.co/K3OHcC0hRb","date":"Sun Apr 04 13:57:43 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.2.21 Topic: The Perseverance of Faith https://t.co/ZecxB9BuzZ","date":"Fri Apr 02 15:07:29 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"For spring cleaning this year, consider clearing out any unused and expired prescriptions in your medicine cabinet.\n\n@DEAHQ will hold Take Back Day on April 24. Learn more about safe disposal of prescriptions, including collection locations near you, at https://t.co/7XkGXl8OKd. https://t.co/6qH7KXCCAi","date":"Thu Apr 01 14:44:09 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden’s crisis at the southern border continues. Border patrol agents continue to be pulled from their duties to process illegal immigrants, and facilities are struggling with capacity. https://t.co/crhc5XsuQl","date":"Tue Mar 30 16:01:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Over the course of the Vietnam War, about 2.7 million Americans military men and women served in the country, and 58,000 gave their lives. We honor their service today on National Vietnam War Veterans Day. https://t.co/LNCjdb2IlR","date":"Mon Mar 29 15:40:24 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Best wishes to all celebrating Passover starting tonight. https://t.co/UmLVTGraJA","date":"Sat Mar 27 20:24:12 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 3.26.21 Topic: Reality Check for the Democrat Agenda https://t.co/GOeLwvntwl","date":"Fri Mar 26 18:14:36 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Agriculture Day. Virginia’s Ninth District is home to many who make farming their way of life. Their work makes a difference in all our lives. https://t.co/DPUXZBe10R","date":"Tue Mar 23 13:17:56 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 3.19.21 Topic: Biden’s Crisis at the Southern Border https://t.co/5fSTxrneks","date":"Fri Mar 19 16:05:14 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Highest priority of vaccinations must be to protect our population. For doses that might expire before use here, sending them abroad would avoid waste, boost US standing. I suggested this to Biden Admin officials yesterday and am encouraged that they took this action today.","date":"Thu Mar 18 17:08:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Community health centers provide vital medical services to many residents of VA-09. The HHS award of $2,087,196 to Southwest Virginia Community Health Systems will benefit patients who rely on health centers for the care they need. https://t.co/ygEDCqbvfZ","date":"Wed Mar 17 20:05:21 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 3.12.21 Topic: Standing up for the Second Amendment https://t.co/Svj2HmahXb","date":"Fri Mar 12 19:54:31 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Another reason why Joe Biden's $1.9 trillion bill misses the mark. State revenues have weathered the storm and even grown. https://t.co/Tpa28cFdLO","date":"Fri Mar 12 16:20:55 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"H.R. 1446 would allow the government to delay background checks. When people are purchasing guns for self-defense, these delays could put them in danger.\n\nI am strongly opposed to both bills. The constitutional right to bear arms must be protected.","date":"Thu Mar 11 16:12:26 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House is voting on two bills today, H.R. 8 and H.R. 1446, to restrict Second Amendment rights while doing nothing to prevent gun violence.\n\nH.R. 8 would criminalize the private transfer of firearms by law-abiding gun owners.","date":"Thu Mar 11 16:12:26 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden’s bungled approach to the border has caused a security and humanitarian crisis. His administration needs to acknowledge that fact and act now to secure the border. #BidenBorderCrisis https://t.co/TD6EHGHEmc","date":"Tue Mar 09 19:11:06 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Great to see Gate City's Mac McClung earn even more accolades.\nhttps://t.co/lN7qssbasd","date":"Tue Mar 09 14:50:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"House Democrats this week are pushing H.R. 1, a bill that would erode the integrity of our elections. Among other things, it would:\n \n-ban voter ID\n-require states to permit ballot harvesting\n-expand mail-in voting\n-divert federal dollars to political candidates https://t.co/NnLI0DBQ17","date":"Wed Mar 03 14:33:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The pandemic has exacted a great toll on young people. School closures and suspending extracurricular activities leave many feeling isolated and forgotten, and almost all teens are frustrated that they are not able to have a normal schedule.","date":"Tue Mar 02 16:08:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this World Teen Mental Wellness Day, we should do all we can to help our teens get back to school and back to normal.","date":"Tue Mar 02 16:08:58 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Last night I went to the floor to vote against a $1.9 trillion “COVID relief” bill, most of which has nothing to do with COVID.\n \nBut it does include $112 million for a pet project of Speaker Pelosi’s: a subway to Silicon Valley.\n \nThis isn’t COVID relief. It’s a Pelosi payoff. https://t.co/XoqXXXQqa1","date":"Sat Feb 27 13:03:08 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden and Speaker Pelosi want to rush nearly $2 trillion through Congress now, but $1 trillion from previous coronavirus relief bills has not even been spent. https://t.co/2XCX7rscm6","date":"Fri Feb 26 15:23:34 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Joe Biden asks of his $1.9 trillion bill, “What would you have me cut?”\n\nSome suggestions:\n\n-Speaker Pelosi’s $112 million Silicon Valley Subway\n-Senator Schumer’s $1.5 million Seaway Bridge to Canada\n-Mismanaged blue states receiving $350 billion","date":"Thu Feb 25 20:53:07 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden calls his $1.9 trillion bill the American Rescue Plan.\n \nBut students aren’t rescued from schools that won’t reopen. Only 5% of money for K-12 schools would even be spent in 2021.\n \nCoronavirus relief should focus on the pandemic, not the progressive agenda.","date":"Thu Feb 25 15:23:13 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Biden wants to spend $1.9 trillion and asks, “What would you have me cut?” when only 9% of the bill goes to public health spending.\n\nNearly half the bill’s spending won’t even happen until 2022.\n\nIt’s a liberal wish list, not a plan to defeat COVID-19.","date":"Wed Feb 24 21:38:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Starting today through Wednesday, March 10, the U.S. Small Business Administration is offering Paycheck Protection Program loans exclusively to businesses with 20 or fewer employees and sole proprietors. Learn more: https://t.co/vzgaCZb1pV","date":"Wed Feb 24 14:34:03 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"When his show was first getting started and airing on WFIR, I was fortunate enough to hear him speak when he came to Salem.","date":"Wed Feb 17 18:47:33 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"For decades, millions of Americans, including myself, regularly tuned in to Rush Limbaugh to hear him make the case for conservative beliefs in a compelling, articulate, and entertaining way. His voice on the airwaves will be missed.","date":"Wed Feb 17 18:47:32 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Community health centers offer essential services to many residents of VA-09. Today’s award of $2,002,021 to the Community Health Center of the New River Valley by HHS will go far in providing health care to people in need in our region. https://t.co/Pb3ZTu5Cb8","date":"Wed Feb 17 16:44:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Bridging the digital divide requires the deployment of more broadband infrastructure. The bill I introduced today, the BROADBAND Leadership Act, will facilitate this goal. \n\nRead more: https://t.co/Xan5jQ883c","date":"Tue Feb 16 21:01:28 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Sorry to see President Hemphill leave Radford. He has done a great job for the university, and he is sure to do great things at Old Dominion. https://t.co/uhje3FGJto","date":"Fri Feb 12 19:38:17 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The science has been clear for months: children need in-person learning, and they can be taught in person safely. I urge President Biden to follow through on his pledge to get kids back to school. This is too important an issue for him to retreat.","date":"Thu Feb 11 17:33:30 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.24.21 Topic: Presidential Inaugurations https://t.co/wtXSl7Ftf2","date":"Mon Jan 25 00:07:41 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The U.S. Department of Agriculture (USDA) Rural Development today awarded a $49,500 grant to Craig County to purchase a new sheriff’s vehicle and an EMS vehicle. Read more: https://t.co/fCkX41tK48","date":"Fri Jan 22 20:17:40 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Our country faces grave challenges, and I appreciated the new President’s speech pledging to seek unity in addressing them. I will work with the new Administration to find areas where we can agree while I expect to disagree with them at other times.","date":"Wed Jan 20 20:51:49 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to President Biden and Vice President Harris on taking their oaths of office. https://t.co/Xh3z4tuRQU","date":"Wed Jan 20 20:51:48 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we honor Dr. Martin Luther King Jr. He relentlessly urged our country to live up to its highest ideals. Through eloquence, courage, and a commitment to nonviolence, he advocated for civil rights and equality. https://t.co/gFn0DdQeTC","date":"Mon Jan 18 13:46:44 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.15.21 Topic: Strides in Closing the Digital Divide https://t.co/PW4Z69ju32","date":"Sat Jan 16 00:08:19 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to be a part of the Montgomery County Sheriff’s Office annual meeting this morning and to speak with these dedicated law enforcement personnel. https://t.co/6wAujhRPYQ","date":"Tue Jan 12 16:58:36 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.11.21 Topic: Priorities for the New Congress https://t.co/df0NJOMqi2","date":"Mon Jan 11 17:07:59 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"I especially want to thank the officers of the U.S. Capitol Police who risked their lives to protect the Capitol from rioters and honor the memory of Officer Brian Sicknick, who died in the effort.","date":"Sat Jan 09 14:54:02 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"On National Law Enforcement Appreciation Day, let’s thank all the law enforcement professionals who work to keep our communities safe.","date":"Sat Jan 09 14:54:02 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Capitol is the place where Americans debate issues peacefully and according to our rules and Constitution. It should not be subject to break-ins and violence. Its occupiers must leave and face justice, and the business of the people must continue.","date":"Wed Jan 06 20:23:29 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/QFAsUtfgqG","date":"Wed Jan 06 14:30:22 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Update: after many objections, Democrats have removed the language restricting free speech from the final rules package. \n\nThe overall package still has many problems, but the principle of free speech survived this attempt to limit it.","date":"Mon Jan 04 19:51:59 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"The new House rules put forward by Speaker Pelosi clamp down on free speech by making it an ethics violation to express views that are deemed “misinformation.” Who decides? Who knows?\n\nThese rules are wrong for an institution that should be the free voice of the American people.","date":"Mon Jan 04 14:48:00 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Senator Ben Chafin was a great legislator as well as a friend. As a native of SWVA, he cared deeply for its people and was a tremendous advocate for them in the state Senate. I will miss this good and dedicated public servant. My prayers are with his wife Lora and his family.","date":"Sat Jan 02 01:42:16 +0000 2021","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.31.20 Topic: Operation Warp Speed: A Success Story of 2020 https://t.co/T7NfO3szyg","date":"Thu Dec 31 15:58:08 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Merry Christmas!\n\nhttps://t.co/TN02R04JOm https://t.co/DtqGVEVUq7","date":"Fri Dec 25 14:04:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the omnibus appropriations legislation: https://t.co/EDmc3vismZ","date":"Tue Dec 22 02:14:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Have the official version of the omnibus bill now. My bootleg copy was just over 3,000 pages. The official bill is 5,600.","date":"Mon Dec 21 18:56:25 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"While waiting on the omnibus spending bill over the weekend, I asked if even just part of the text was available to read and was told no. I’ve gotten a bootleg back alley copy of the bill today to start reading.","date":"Mon Dec 21 18:51:51 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.21.20 Topic: Christmas Traditions https://t.co/TN02R04JOm","date":"Mon Dec 21 18:36:19 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@RepBenCline and I thank the @DeptVetAffairs for their efforts to get the COVID-19 vaccine to veterans as quickly as possible. As such, @VASalem will begin receiving the Moderna vaccine this week. This is good news for our region's veterans and Southwest Virginia residents.","date":"Mon Dec 21 14:13:25 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Ninth District traveling staff office hours in Russell County scheduled for tomorrow, December 17, have been cancelled.","date":"Wed Dec 16 19:46:17 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Due to inclement weather, Ninth District traveling staff office hours in the Counties of Carroll and Grayson and the City of Galax scheduled for tomorrow, December 16, have been cancelled.","date":"Tue Dec 15 18:05:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.14.20 Topics: Candy Apples and Toads; The Right Way to Legislate on Marijuana https://t.co/hJbYiTq9mg","date":"Mon Dec 14 15:40:38 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is another significant diplomatic accomplishment for @realDonaldTrump and his Administration. https://t.co/bMfSlbikCg","date":"Fri Dec 11 15:02:48 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Best wishes to all celebrating Hanukkah starting tonight. https://t.co/YePkHG0kqr","date":"Thu Dec 10 22:19:42 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Americans citizens on American soil should not be subject to indefinite detention. This should be a bedrock constitutional principle. The NDAA, however, potentially allows it, which is why I have voted no before, and I am voting no again this year.","date":"Tue Dec 08 22:41:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Coronavirus relief and appropriations legislation should be kept separate. My full statement: https://t.co/ZmK7TxDD57","date":"Tue Dec 08 19:24:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This lawsuit raises interesting constitutional questions regarding federal election integrity. https://t.co/47ZRr5mHcT","date":"Tue Dec 08 15:57:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we remember the 2,403 Americans killed in the Imperial Japanese attack on Pearl Harbor on this day in 1941. It remains, as President Franklin Roosevelt called it, “a date which will live in infamy.” https://t.co/b5LgqNUxlF","date":"Mon Dec 07 19:45:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Three days later, Nazi Germany declared war on the United States. These acts galvanized the country in its united determination to defeat the totalitarian Axis powers.","date":"Mon Dec 07 19:45:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 12.7.20 Topic: Marijuana Legislation: Wrong Time, Wrong Bill https://t.co/72pb2DNldL","date":"Mon Dec 07 16:37:02 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Motor Voter law is outdated and leaves open the opportunity for non-citizen voting. I cosponsored @RepAndyBiggsAZ bill to repeal the Motor Voter law and protect the integrity of our elections. https://t.co/9boACGnqmy","date":"Sat Dec 05 18:37:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"May you have a safe, peaceful, and blessed Thanksgiving.\n\nYou may enjoy this newsletter from 2019 describing Virginia's first Thanksgiving in 1619 at Berkeley Hundred. https://t.co/0FZ1FuDA4Q","date":"Thu Nov 26 19:33:19 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Adoption is a momentous decision for the birth family, the adoptive family, and the adopted child alike. November is National Adoption Month, so let’s celebrate the families who made these decisions out of love for adopted children. https://t.co/cbPKj5j7k2","date":"Sun Nov 22 16:44:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.20.20 Topic: Giving Thanks and Giving Help https://t.co/lYCl9jEem3","date":"Fri Nov 20 18:32:28 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Rural Health Day. The doctors and nurses of rural health care services provide vital care to our communities, so let’s thank them for all they do. https://t.co/32PL1BtaZV","date":"Thu Nov 19 18:11:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"A bill I introduced, the Ensuring Compliance Against Drug Diversion Act, passed the House today. I spoke on the House floor about this small but important fix that will assist in fighting the opioid epidemic. https://t.co/uw2irn7Xye","date":"Tue Nov 17 20:19:18 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"You can now follow me on Parler @RepMGriffith https://t.co/X256JZcvKF","date":"Tue Nov 17 15:29:40 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Reminder for any individuals who don't typically file a tax return and haven't received an Economic Impact Payment: register to receive your payment using the Non-Filers: Enter Info Here tool on https://t.co/HRfjvQ7mzQ by Saturday, November 21. https://t.co/LrXZnLcTuc","date":"Mon Nov 16 17:17:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi’s proxy voting scheme is unconstitutional and unwise. Voting by text would be even worse.\n\nIt should not need to be said, but Members of Congress should vote in person.","date":"Thu Nov 12 19:52:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 11.12.20 Topic: It’s Not Over https://t.co/ENGvS6ZrjA","date":"Thu Nov 12 17:19:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Richard Stine served in the Army Air Force and was slated to deploy to China to forecast the weather for the planned invasion of Japan. On this Veterans Day, we thank them and all vets for their service. https://t.co/278hhSwXug","date":"Wed Nov 11 18:09:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Martinsville today to honor two World War II vets. Houston William Smith was a waist gunner in the 466th Bombardment Group who learned the war in Europe was over while in the air.","date":"Wed Nov 11 18:09:20 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"We have to do more to support sexual assault victims. That's why I introduced the Sexual Assault Victims Protection Act (H.R. 4758), so people like Megan can receive the care that they need after such an awful, traumatic experience. \n\nhttps://t.co/TeJjQjgxRA","date":"Fri Nov 06 21:11:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.6.20 Topic: Honoring Our Veterans\n\nhttps://t.co/ZzMO1HnLj9","date":"Fri Nov 06 18:04:17 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Heroism honored by Virginia Tech for 9th District man\n\nhttps://t.co/t42G2FSkaw","date":"Fri Nov 06 12:37:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Connected Care Pilot Program (telehealth) will provide up to $100 million from the Universal Service Fund for connected care services.","date":"Thu Nov 05 16:53:18 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Fracking helps us reach energy independence.\n\nAlso, overregulating our energy industry passes costs on to consumers.","date":"Tue Nov 03 11:51:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.30.20 Topic: Protecting Our Interests From China\n\nhttps://t.co/tbHYzwyLHG","date":"Fri Oct 30 17:14:38 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"A little history to take you away from the political noise.\n\nhttps://t.co/VDgQhgh4Cv","date":"Thu Oct 29 19:25:20 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is terrific news! The U.S. economy grew at a record pace in Q3. \n\nEven CNBC acknowledges we are witnessing a tremendous recovery thanks to @realDonaldTrump 's strong economic policies. \n\n  https://t.co/EOM3oepyIg","date":"Thu Oct 29 14:04:37 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"A very nice story on a World War II Veteran who was present at Pearl Harbor.\n\nhttps://t.co/CGvUzdt1dj","date":"Tue Oct 27 14:44:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Justice Amy Coney Barrett, now confirmed to the United States Supreme Court.","date":"Tue Oct 27 00:12:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"An interesting article on a 9th district native son. \n\nhttps://t.co/0f1SMDPDPi","date":"Sun Oct 25 15:19:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"\"Our Constitution and laws place checks on arbitrary and expansive executive power in other spheres, and the internet deserves the same protections.” \n\nApplies to any President.","date":"Fri Oct 23 19:31:41 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.23.20 Topic: Perspectives on Opinion Polls https://t.co/o595VQLi2O","date":"Fri Oct 23 17:47:21 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Tomorrow is National Prescription Drug Takeback Day. Unused prescription drugs can be a health hazard, and disposing of them safely is a simple but important act to combat substance abuse. To learn more, including collection sites near you, visit https://t.co/jFQtNlKy1C. https://t.co/AhelbfqfSp","date":"Fri Oct 23 14:53:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Republicans are willing to put together a new COVID-19 stimulus package. Speaker Pelosi is too focused on provisions that don't belong in it, like lifting the SALT deduction cap to benefit San Francisco, not Southwest Virginia. https://t.co/e59n6UwFA7","date":"Thu Oct 22 22:50:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Feeding Southwest Virginia helps fight hunger in our region. I stopped by their recently renovated children's kitchen in Abingdon to thank them for their good work. https://t.co/X8S4XePvCR","date":"Thu Oct 22 19:38:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This new hotline will be an important resource to those battling suicidal thoughts or experiencing a mental health crisis. I was proud to support this legislation when it came through committee and on the House floor.","date":"Tue Oct 20 21:33:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am honored to be named a Guardian of Small Business by @NFIB for the 116th Congress. Small businesses across the Ninth District create jobs and support our local economy, and they have my support in the House of Representatives. #smallbizguardian https://t.co/8In1HeOkOJ","date":"Tue Oct 20 18:50:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This week is National #ForestProductsWeek. Forest products contribute significantly to the Ninth District’s economy. Their manufacture also calls for responsible stewardship of forest environments.","date":"Mon Oct 19 19:43:52 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI from @SecBrouillette: \"With our abundant resources, cutting-edge technology and export opportunities, it is to our benefit that coal remains a part of our energy future.\" https://t.co/cAbFSMPllO","date":"Sat Oct 17 15:04:55 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 10.16.20 Topic: Judges Should Judge – and Legislators Should Legislate https://t.co/NOH9ZFZ8fl","date":"Fri Oct 16 19:47:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@SecBrouillette makes a good point: “Economic markets around the world, especially Asia, are going to depend on this energy source for decades to come.” https://t.co/4r4PWEYn8I","date":"Fri Oct 16 14:37:15 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke to WVVA about my call for an investigation into social media censorship. Freedom of political speech has always been a hallmark of this country, but Twitter has violated that trust. https://t.co/k4Xq3s09fm","date":"Thu Oct 15 23:23:46 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Millions of Americans use social media. How can they expect to be treated fairly when their elected reps are silenced in such an arbitrary and heavy-handed manner?\n\nAs a member of @HouseCommerce O&amp;I, I believe this issue deserves our intense scrutiny. https://t.co/wgCKi1s8kG","date":"Thu Oct 15 17:41:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am shocked by this censorship of Members of Congress. I am calling for an investigation by the Energy and Commerce Subcommittee on Oversight and Investigations. https://t.co/XzGxlAcEhu","date":"Thu Oct 15 16:11:18 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Planting a trillion trees worldwide is a straightforward, practical way to benefit our environment. I applaud @realDonaldTrump's executive order advancing the Trillion Trees Initiative as another step toward this important goal. https://t.co/N8QsLZ2Y0w","date":"Thu Oct 15 15:27:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In 2001, FDA approved a label change for OxyContin. We need more information on this decision to understand if it played a role in the opioid crisis, so @HouseCommerce leaders including myself are asking for answers from the agency.","date":"Wed Oct 14 15:04:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 10.12.20 Topic: Keep the Electoral College https://t.co/0VOVmJnxK6","date":"Mon Oct 12 14:29:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"At Feeding Southwest Virginia this morning to show support for the important work they do in our region. https://t.co/nb9ZrgocCk","date":"Thu Oct 08 17:44:06 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The water pooled in abandoned mine sites could serve industrial operations requiring substantial water use, such as data centers. This innovation would be a way to draw economic opportunities to Southwest Virginia. https://t.co/yruEAwMgCv","date":"Tue Oct 06 19:34:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I appreciate the commitment of the Trump Administration and @HUDgov to the people of our region who may need a bit of assistance in achieving independence. The new EnVision Center in Lebanon will be a great support for people on the path to self-sufficiency.","date":"Mon Oct 05 21:56:24 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 10.5.20 Topic: Speaker Pelosi’s Wrong Priorities for Coronavirus Relief https://t.co/n3RL7ZkH3K","date":"Mon Oct 05 14:22:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Manufacturing in Virginia’s Ninth District creates goods people need and want while providing jobs that support families. On #MFGDay20, let’s celebrate the people of our manufacturing sector, its heritage, and its future.","date":"Fri Oct 02 19:12:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Our national security and economy depend on critical minerals, including rare earth elements, yet the supply chains for these minerals are far too vulnerable to foreign pressure. I applaud President Trump for taking action to secure our access to critical minerals.","date":"Thu Oct 01 20:35:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi is blocking a bill to let businesses apply for a second loan and increase the program’s flexibility. Today I signed a discharge petition to bring it to the floor. The House should act.","date":"Wed Sep 30 18:50:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Ninth District small businesses have used the Paycheck Protection Program to survive the pandemic and keep their workers on payroll. It has been a lifeline for many of our local shops, restaurants, and service providers.","date":"Wed Sep 30 18:50:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"America must maintain its primacy in developing technologies to solve the challenges of the 21st century. Our national security and economic prospects depend on it.\n\nRead more below about the American COMPETE Act, which passed the House today.\nhttps://t.co/wHKxYxgSeE","date":"Tue Sep 29 22:13:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@USDOL in partnership with @ARCgov has awarded a total of $2,297,356 to recipients based in Virginia’s Ninth Congressional District through the Workforce Opportunities for Rural Communities (WORC) program. Read more ⬇️ https://t.co/RplwMrGkrT","date":"Tue Sep 29 19:46:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.25.20 Topic: Pandemic Procedures Produce Poor Policy https://t.co/DGJNZRoFfF","date":"Fri Sep 25 15:58:55 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Adwolfe firefighter Charles C. Woods has died in the line of duty. This event is a tragedy, and it reminds us of the dangers first responders brave to protect our neighborhoods. My prayers are with his family and the Adwolfe Volunteer Fire Department. https://t.co/M7lsb8ZIWN","date":"Wed Sep 23 16:52:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to learn of the death of Justice Ginsburg. Her service as only the second woman on the Supreme Court was the capstone of a long and notable legal career.","date":"Fri Sep 18 23:53:15 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Best wishes to all celebrating Rosh Hashanah starting this evening. https://t.co/E9m45ft4BK","date":"Fri Sep 18 19:57:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.18.20 Topic: Waging Peace in the Middle East https://t.co/jIvSlv1aNt","date":"Fri Sep 18 16:04:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this National POW/MIA Recognition Day, we honor all the American service members who have been held as prisoners of war or who are missing in action. We will not forget their sacrifice. https://t.co/lRLqupowtV","date":"Fri Sep 18 13:18:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On September 17, 1787, the Constitution was signed in Philadelphia. The document would later be improved by Virginia's insistence on a bill of rights.\n\nCelebrate Constitution Day 2020 by testing your knowledge with the @America250 Constitution quiz. https://t.co/UOfl055WB7","date":"Thu Sep 17 14:26:40 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Learning today requires Internet access. @FCC’s E-Rate program helps schools meet their connectivity needs. To learn more about the program, visit https://t.co/wpXs0UAvh1","date":"Wed Sep 16 19:17:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The normalization of relations between Israel, the United Arab Emirates, and Bahrain is a major breakthrough for peace. Their agreement marks a historic achievement for the region and the diplomacy of President @realDonaldTrump.","date":"Tue Sep 15 19:28:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.14.20 Topic: Health Legislation Moves Forward https://t.co/7GxBJypH1O","date":"Mon Sep 14 15:52:24 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Like many Americans, I still recall where I was nineteen years ago. Evil sought to do its worst to our country, but instead, at the World Trade Center, the Pentagon, and in Shanksville, our country’s heroes displayed our best. Today we honor the victims and heroes of 9/11/2001.","date":"Fri Sep 11 13:18:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"K-12 Bridge to Broadband, a project of @NCTAitv and @EdSuperHighway, seeks to connect more students to reliable Internet access. Education increasingly requires connectivity, especially during the current pandemic. This is an important initiative for schools and students.","date":"Thu Sep 10 22:45:53 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I cosponsored H.R. 945, the Mental Health Access Improvement Act.\n\nMental health treatment is a vital component of health care. Especially in the current pandemic, which has placed a strain on the mental health of many, promoting access to such treatment should be a priority.","date":"Wed Sep 09 22:10:31 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This bipartisan legislation would make long-overdue improvements to the Fed Govt’s policies on marijuana research. It would advance the work of scientists and provide more reliable information about any benefits and harmful consequences that result from medicinal marijuana use.","date":"Wed Sep 09 22:10:31 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"A @HouseCommerce markup today advanced several bills I introduced or cosponsored:\n\nI introduced H.R. 4812, the Ensuring Compliance Against Drug Diversion Act, to limit the transfer of registrations to manufacture, distribute, or dispense controlled substances","date":"Wed Sep 09 22:10:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was an original cosponsor of H.R. 3797, the Medical Marijuana Research Act, and introduced the bill in past Congresses. \n\nWhatever our views on marijuana legalization as legislators, we all ought to support the collection of scientific data to guide our decisions.","date":"Wed Sep 09 22:10:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The abuse of legal manufacturing and sales of opioids heavily contributed to the opioid crisis. H.R. 4812 would tighten restrictions on registrations to manufacture, distribute, or dispense them, helping to reduce opioid abuse as our country continues to face this crisis.","date":"Wed Sep 09 22:10:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 9.4.20 Topic: Protecting Americans From Surveillance https://t.co/HP9TclB5sT","date":"Fri Sep 04 17:37:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The assistance provided by @US_EDA will upgrade Pulaski’s infrastructure, an important asset for manufacturing in the area. These measures will encourage the manufacturing that supports jobs and economic growth in our communities.","date":"Fri Sep 04 14:30:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Yesterday, I was in Martinsville for the 75th anniversary of the end of World War II. Thank you to Buck Powell and all of our veterans for your service. https://t.co/dErhai7ICU","date":"Thu Sep 03 18:33:02 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Scott County this morning for the announcement of $9 million in @USDA funding for broadband. https://t.co/azcQ47BbgJ","date":"Mon Aug 31 16:41:51 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.31.20 Topics: Seventy-Five Years Since World War II; Conventions https://t.co/jI14WNnwAo","date":"Mon Aug 31 14:21:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.24.20 Topic: California, Here We Come? https://t.co/vgIKgvpioQ","date":"Mon Aug 24 18:52:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Purchasing and equipping modern vehicles for public services can place a strain on budgets in rural communities. Today’s award of $405,800 from @usdaRD will assist in a variety of services upon which rural residents rely. Learn more: https://t.co/fHUJ0kBFGg","date":"Mon Aug 24 16:29:51 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to learn of the passing of former Lt. Gov. Hager. He overcame the challenge of polio to serve our Commonwealth with distinction. https://t.co/ciowJTn6oz","date":"Mon Aug 24 00:00:21 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"It's not too late! There is still time to complete the 2020 Census if you have not yet filled it out.","date":"Fri Aug 21 19:25:43 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good to see County Administrator Cellell Dalton at Carroll County office hours this morning. https://t.co/5UX9ZmKkHQ","date":"Wed Aug 19 16:14:46 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this day 100 years ago, the Nineteenth Amendment was ratified, guaranteeing the right to vote for women. It was a landmark for equality in our country’s history. https://t.co/65dCs3gefC","date":"Tue Aug 18 20:32:43 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.17.20 Topics: Coronavirus Relief; Middle East; Women’s Suffrage https://t.co/lPmOrF3Vnh","date":"Mon Aug 17 18:22:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Responding to the #2020Census is important. An accurate count is essential for our region’s representation in Richmond and Washington, as well as receiving our share of federal funding. https://t.co/I5dorY6M9p","date":"Thu Apr 30 15:56:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Small businesses have suffered heavily due to COVID-19. EDA’s $770,000 grant to the Cumberland Plateau Planning District Commission directs CARES Act funding to some of these businesses in the district, helping them stay afloat and keep employees on the payroll.","date":"Thu Aug 13 21:27:38 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Coronavirus relief should address coronavirus and its effects, not a partisan wish list of unrelated items. https://t.co/G1NOkEGCft","date":"Wed Aug 12 20:38:44 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I held a meeting in my Abingdon office today to discuss telehealth and families with children who have special medical needs. https://t.co/ksxJTyE0aS","date":"Tue Aug 11 17:27:17 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In the Energy and Commerce Committee, I backed the No Surprises Act, which authorizes five years of funding for CHCs. Through the years I have supported numerous bills providing funding to CHCs in our area. They are doing great work, and I continue to support them.","date":"Mon Aug 10 19:05:45 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"During National Health Center Week, let’s thank the medical professionals at community health centers. VA-9 has 35 CHC locations that served 84,994 patients in 2017, the last data available. They are essential in our district and have been helpful in responding to COVID.","date":"Mon Aug 10 19:05:45 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.7.20 Topic: Early Voting and Debates https://t.co/RMJnDyVElb","date":"Fri Aug 07 19:04:29 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On August 7, 1782, General George Washington created the Badge of Military Merit. Today we call the award the Purple Heart, and it is given to servicemen and women who have been wounded or killed in action. We honor them and their sacrifices on this Purple Heart Day. https://t.co/eQykHDZyZ1","date":"Fri Aug 07 13:28:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"As a strong supporter of telehealth, I appreciate the Trump Administration’s commitment to expanding it. During the pandemic, it has shown its value in connecting more people to high-quality care, especially in rural communities.","date":"Tue Aug 04 16:50:59 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 8.3.20 Topic: Recent Advances in Space https://t.co/t9PJIKkrzT","date":"Mon Aug 03 14:41:51 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I applaud @FCC's decision to approve Project Kuiper, expanding the number of companies working to utilize satellite technology to provide high-speed broadband. This is a significant contribution to closing the digital divide.\n\nRead more: https://t.co/WQJ4BN24oN","date":"Fri Jul 31 18:27:31 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Sixty-four years ago today, “In God We Trust” was officially adopted as our national motto. It is expressed by this plaque in the Longworth House Office Building in Washington, D.C. https://t.co/AhTiGHo0sV","date":"Thu Jul 30 15:17:29 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Abandoned Mine Land Pilot Program supports projects such as the Pocahontas mine. Glad to see the federal funding we secured bear fruit. https://t.co/1kd1ez1rcx","date":"Wed Jul 29 14:57:15 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I applaud this initiative from the Trump Administration to support rural transportation infrastructure.","date":"Mon Jul 27 19:19:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.27.20 Topic: Rethinking Our Defense Strategy https://t.co/c2wR4dH9nu","date":"Mon Jul 27 16:22:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.20.20 Topics: More Coronavirus Resources for Nursing Homes; Suicide Prevention https://t.co/1wTKiWP3Na","date":"Mon Jul 20 15:04:01 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"A year or so ago, I had the opportunity to introduce my son Davis to Congressman John Lewis. He was honored to meet this icon of the civil rights movement, who had marched tirelessly but peacefully for equality. https://t.co/bA22zNj2mB","date":"Sat Jul 18 12:55:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"https://t.co/dPDsQVCKCp","date":"Tue Jul 14 16:08:06 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 7.10.20 Topic: Don’t Defund the Police https://t.co/zI8VquzCRi","date":"Fri Jul 10 21:51:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"It's extremely important that we actually follow the real science and not just the fear that has been created by this disease, and it is a serious disease.\" https://t.co/16W2neud19","date":"Fri Jul 10 16:58:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Local school districts should be able to reopen based on the conditions in their communities. Today I spoke at a press conference with scientists and House Freedom Caucus colleagues about school reopening. https://t.co/8wFy6Xt1H0","date":"Thu Jul 09 18:28:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Small business owners: The Paycheck Protection Program has been extended. Applications will now be accepted until August 8.\n\nLearn more ⬇️https://t.co/d5VkuB0CEA","date":"Tue Jul 07 15:08:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"Griffith asked Fauci at an Energy and Commerce Committee meeting last week about his views on localizing plans to reopen schools.\" https://t.co/EXCXZJv75g","date":"Wed Jul 01 18:12:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"PILT is vital to jurisdictions with large areas owned by the Federal Govt, including many in VA's 9th District. These local govts are deprived of tax revenue from federal lands. By replenishing their coffers, PILT allows them to continue providing essential services to residents.","date":"Tue Jun 30 14:44:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I introduced a resolution encouraging local decisions on school reopening.\n\nDecisions about reopening schools should be made at the local level. Our country and our commonwealth are too broad for one size fits all. https://t.co/klTVHE9EIw","date":"Mon Jun 29 20:18:10 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.29.20 Topic: Jefferson, Adams, and the Fourth of July https://t.co/1W80AGBmIx","date":"Mon Jun 29 15:52:43 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Bridging the digital divide requires the deployment of more broadband infrastructure. The bill I introduced today, the BROADBAND Leadership Act, will facilitate this goal. \n\nLearn more⬇️ https://t.co/gWXcIcEB2h","date":"Thu Jun 25 17:31:52 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"Two prominent national medical experts involved in the COVID-19 pandemic response agree with local Virginia elected officials and school leaders that localities should have more control over decisions made regarding pandemic restrictions.\" https://t.co/YxhqEvKdm4","date":"Wed Jun 24 20:44:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Israel is a strong ally and friend to the U.S. I was proud to sign this letter to ⁦@IsraeliPM⁩ Benjamin Netanyahu affirming support for its rights as a sovereign nation. https://t.co/sJNk9iMu4T","date":"Wed Jun 24 16:31:43 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.22.20 Topic: America’s Energy Future https://t.co/LTDCkca2mq","date":"Mon Jun 22 16:05:41 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is #Juneteenth, honoring the day in 1865 when news of emancipation reached Texas. Juneteenth represents our capacity for progress toward achieving the nation’s promise for all Americans.","date":"Fri Jun 19 16:53:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@realDonaldTrump's executive order on policing takes the right approach. It will encourage transparency, best practices, and accountability.\n\nI look forward to working with the Trump Administration and my colleagues in Congress on further reforms.","date":"Tue Jun 16 19:03:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"We must instill confidence in all citizens that their civil rights will be protected, while assuring police officers, the great majority of whom do their jobs with dedication and responsibility, that they are supported in carrying out their vital work.","date":"Tue Jun 16 19:03:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"June 30 is the last day the Paycheck Protection Program will accept new applications. If you intend to seek funding from the program, talk to your local lender today. https://t.co/d5VkuB0CEA","date":"Tue Jun 16 15:03:28 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The U.S. Department of the Army has awarded a $9.36 million contract to Moog, Incorporated of Blacksburg to build components used in the upgrade of Light Armored Vehicles. My statement: https://t.co/PndaceFPAu","date":"Mon Jun 15 21:38:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.15.20 Topic: Make Sure You’ve Been Counted in the Census; Moving Forward From the Pandemic https://t.co/0n4VIJODYX","date":"Mon Jun 15 18:32:20 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this day in 1777, the Continental Congress approved a resolution: “That the flag of the United States shall be of thirteen stripes of alternate red and white, with a union of thirteen stars of white in a blue field, representing the new constellation.” \n\nHappy Flag Day! https://t.co/EggScQhjTD","date":"Sun Jun 14 12:20:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"These projects funded by @ARCgov will create jobs, attract visitors, and grow the economy in the coalfields. They are significant investments in the future of our region. https://t.co/wgrxubXTti","date":"Thu Jun 11 20:15:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Opioids sold illegally online have fueled the opioid crisis that confronts our nation. I appreciate the steps the @US_FDA and @NTIAgov are taking to crack down on this scourge. https://t.co/7agjss32xv","date":"Wed Jun 10 16:47:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@NIST has awarded $876,000 to GENEDGE ALLIANCE of Martinsville to support Virginia-based U.S. small- and medium-sized manufacturers, including rural manufacturers, respond to the coronavirus pandemic. Read more ⬇️\nhttps://t.co/Xj8jzCKQ4u","date":"Tue Jun 09 14:45:08 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 6.8.20 Topic:\nStriving to be a Better Nation https://t.co/wsvuGSWejO","date":"Mon Jun 08 19:14:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Funding from the CARES Act will support manufacture of millions of N95 ventilation filters and respirators in Floyd County. https://t.co/7hV94fy0og","date":"Mon Jun 08 17:13:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The 5G Upgrade Order would streamline regulations for building out the next generation of broadband. I encourage this helpful step forward to close the digital divide and connect more Americans.","date":"Wed Jun 03 17:16:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Washington with @HouseCommerce GOP colleagues for a hearing on state coronavirus responses. None of the Democrats chose to be here. https://t.co/Te0PwnGMTX","date":"Tue Jun 02 15:07:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.31.20 Topic: Unconstitutional Dangers https://t.co/ihfDPXPrGD","date":"Sun May 31 20:05:53 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to hear about the passing of my former colleague Sam Johnson of Texas. Beside his service in the House, he earned our country’s gratitude for the great trial he endured as a POW in Vietnam.","date":"Thu May 28 01:36:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke on the floor of the House today calling for the proxy voting rules to be suspended until the courts can rule on their constitutionality. https://t.co/6dYVl9z82T","date":"Thu May 28 00:34:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I stopped by the flag display in Marion, where a flag is put up for all the town’s veterans who have passed on. https://t.co/JX3cYDHQTK","date":"Mon May 25 20:09:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Memorial Day, let us honor all who gave their lives in service to our country. From the Revolution to Iraq and Afghanistan, men and women have been willing to sacrifice everything for our liberty. https://t.co/mOnxiLPwbq","date":"Mon May 25 13:14:00 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.22.20 Topic: Memorial Day https://t.co/r9UrbKCfaI","date":"Fri May 22 15:28:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"We can’t depend on other countries to guarantee U.S. economic leadership, shield our stockpile of critical supplies, or secure the benefits of technological progress to our people. It is up to us to do that.\n\nMore about encouraging manufacturing and tech⬇️\nhttps://t.co/t5b8542Fsc","date":"Tue May 19 18:39:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter Topic: Science Advances Against the Coronavirus https://t.co/6pZLD1HlyQ","date":"Mon May 18 16:01:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"UPDATE: House Democrats just changed the rules. Now they can send men and women off to combat, raise your taxes, or pass socialized medicine without a majority even showing up to vote in person.","date":"Fri May 15 23:25:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m voting against H.R. 6800, Speaker Pelosi’s $3 trillion, 1,815 page long liberal wish list. Her bill outrageously attempts to use the present crisis to radically transform America.\n\nRead more about the preposterous provisions of H.R. 6800 ⬇️\nhttps://t.co/4zfUgraRSU","date":"Fri May 15 19:25:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House has met and voted several times during the pandemic, as has the Senate. Further, committees have met live in Washington, D.C. This is not a job that can be done just be phoning it in.","date":"Fri May 15 14:24:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Allowing vote by proxy opens that door to serious mischief and legislative malfeasance. Gathering in person is essential to the legislative process. It’s how we talk through issues, gather support for bills, and build relationships for effective lawmaking.","date":"Fri May 15 14:24:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Citizens should not trust the future of our great Republic to those who demand they be allowed to do their essential jobs while sitting at home in their La-Z-Boy recliner.","date":"Fri May 15 14:24:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"As Members of Congress, we can and must do our jobs without tossing aside the Constitution. The United States House of Representatives should not be a sparsely attended debating society.","date":"Fri May 15 14:24:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House majority has proposed a change in the rules that defies the Constitution and undermines the House of Representatives as a legislative body.","date":"Fri May 15 14:24:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Constitution requires a majority of the House to conduct business, a provision George Mason called ‘valuable &amp; necessary.’ The Framers knew that mischief could take place if the House met with less than a majority of its members.","date":"Fri May 15 14:24:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"We remember Trooper Dowell and honor all the men and women in law enforcement who protect us.","date":"Thu May 14 19:26:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This week is #PoliceWeek. During this year’s observance, Virginia State Trooper Lucas Dowell, a Chilhowie native who died in the line of duty last year, was honored by the National Law Enforcement Officers Memorial. https://t.co/rjPpGBnd4d","date":"Thu May 14 19:26:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Read more about our bipartisan efforts to preserve paper options for retirement documents ⬇️ https://t.co/51H9PvTldS","date":"Wed May 13 20:30:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"For retirees in rural and remote areas underserved by Internet access, including parts of Virginia's Ninth Congressional District, electronic delivery of retirement plan documents is simply not an option. Shifting to default electronic delivery places an unfair burden on them.","date":"Wed May 13 20:30:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.11.20 Topics: Don’t Redefine “Flattening the Curve;” Supply Chains in Danger https://t.co/dZp2RGpC3f","date":"Mon May 11 14:13:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I had the opportunity to meet with members of the New River Public Health Task Force yesterday and visit a PPE decontamination site. https://t.co/wHjKRw74xB","date":"Sat May 09 13:23:10 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is in addition to the $3.3 billion the Federal Government appropriated to help the state deal with the coronavirus, and hopefully this additional money will help lift Virginia out of the bottom ten states for testing.","date":"Fri May 08 15:27:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"More coronavirus testing will advance public health and help the safe reopening of our economy. The award of $1,603,213 from @HHSGov to Ninth District Community Health Centers means expanded testing capacity and more personal protective equipment. https://t.co/7qUGEf9HTj","date":"Fri May 08 15:27:06 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Americans have often turned to prayer, whether in thanksgiving or in petition. We do so again on this National Day of Prayer. https://t.co/59R3RyZtF7","date":"Thu May 07 19:55:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Find answers to frequently asked questions about coronavirus Economic Impact Payments, including address changes, how to return payments made to people who have died, and more, at the IRS Economic Impact Payment Information Center. https://t.co/7MFHuy9lbd","date":"Thu May 07 15:30:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":".@US_EDA’s support for the Floyd Growth Center Building is a significant investment in our region’s economic development. It will promote long-term growth and job creation, as well as build capacity for resilience and recovery in the face of natural disasters.","date":"Tue May 05 19:05:19 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This week is Teacher Appreciation Week. My mother was a teacher, so I learned early what an important and demanding profession it is. Whether in a classroom or by remote learning, teachers are committed to the education and growth of students, and we thank them for their work. https://t.co/IXJE8HcIjg","date":"Tue May 05 14:37:10 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 5.4.20 Topic: Getting Ready to Reopen https://t.co/CJ4xc4UU9b","date":"Mon May 04 19:16:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m calling on Governor Northam to reopen churches in Virginia. https://t.co/DrveEWLu0P","date":"Sun May 03 23:13:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"'Fortunately PPP, the program that helps takes care of payroll...has been a fairly good success, not perfect, but a fairly good success,' said Rep. Griffith.\" https://t.co/5RZAgXszX2","date":"Fri May 01 14:00:00 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Responding to the #2020Census is important. An accurate count is essential for our region’s representation in Richmond and Washington, as well as receiving our share of federal funding. https://t.co/I5dorY6M9p","date":"Thu Apr 30 15:56:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"\"What I learned from that weekend was that Heath is hard working, humble and kind, in part because that is who the people of Honaker are – a small town of people with big hearts and strong hands.” https://t.co/qUwA0tuNnz","date":"Thu Apr 30 13:55:34 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"🚨@HUDgov has awarded $274,168 to public housing agencies in Virginia’s Ninth Congressional District to support housing assistance for low-income residents. More information ⬇️ https://t.co/Gf6Pro2idY","date":"Wed Apr 29 20:37:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"From the IRS: VA, SSI recipients with eligible children need to act by May 5 to quickly add money to their automatic Economic Impact Payment https://t.co/64y9eCx4Un","date":"Tue Apr 28 17:54:06 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"Congressman Morgan Griffith says the latest round of coronavirus relief should help struggling businesses, but the state and nation also need to develop guidelines that will allow more businesses to reopen.\" https://t.co/GeWY4XZgFR","date":"Mon Apr 27 19:50:02 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.27.20 Topic: Congress Amid the Coronavirus https://t.co/mSSJuJZFsw","date":"Mon Apr 27 15:27:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Arbor Day. Trees add beauty to our lives, habitats for wildlife, oxygen for the air we breathe, and storage for carbon.\n\nAs you may know, Virginia’s state tree is the flowering dogwood. https://t.co/GEHjBVqXoi","date":"Fri Apr 24 13:39:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Back in Washington today to support aid for our small businesses. https://t.co/eqbwsjCBei","date":"Thu Apr 23 22:17:29 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Food banks are hurting right now, but our fellow citizens are stepping up. This is a great act of charity that will help many in our region. https://t.co/pL4tSWAyXb","date":"Thu Apr 23 19:09:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I applaud the ⁦@FCC⁩ for unanimously approving opening the 6 GHz band for unlicensed use. My full statement ⬇️ https://t.co/tLvGIj1uOM","date":"Thu Apr 23 16:21:24 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to see that more of the funding for hospitals we included in the CARES Act is on its way.","date":"Wed Apr 22 22:02:19 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: \"Congressman Morgan Griffith says he and his colleagues should vote in person on all matters before the House of Representatives — and not do so by proxy with just a few House members present in Washington.\" https://t.co/HIsoR0713s","date":"Wed Apr 22 17:39:38 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"🚨@SocialSecurity has important information about economic impact payments for Social Security retirement, survivors, and disability insurance beneficiaries with dependent children and who did not file 2018 or 2019 taxes. https://t.co/rjMZoKQ010","date":"Tue Apr 21 14:42:45 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I held a video conference call today with the Virginia Bankers Association featuring bankers from the 9th District. Through their participation in the Paycheck Protection Program, they have helped employees stay on the payroll and businesses keep afloat. https://t.co/9OunPvahjG","date":"Mon Apr 20 21:29:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.17.20 Topic: Sustaining Jobs and Businesses During the Coronavirus https://t.co/xZ68R1Glju","date":"Fri Apr 17 18:45:48 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I stopped by an essential, family-run business today for a service, and the owners wanted to know what is wrong with Nancy Pelosi. Their PPP loan application is in, but because Nancy Pelosi and Chuck Schumer have blocked more funding, they won’t be receiving a loan anytime soon.","date":"Fri Apr 17 15:18:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"While I was there, they had their bills spread out on the desk, trying to figure out what they can or can't pay as their money is held up.\n\nThe Paycheck Protection Program was working, and it should be working for these business owners. But Dems have decided to obstruct instead.","date":"Fri Apr 17 15:18:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi and the House majority need to stop playing games and fund the Paycheck Protection Program. American jobs and wages are on the line.","date":"Thu Apr 16 15:55:57 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The IRS has provided an app on its website for you to check the status of your economic impact payment and determine whether the agency needs more information from you to process your payment. https://t.co/Xxs2Z3rk4m","date":"Wed Apr 15 16:28:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The coronavirus outbreak has inflicted tremendous damage on airports, including the general aviation airports in the Ninth District.\n\nThrough funding provided by the CARES Act, @FAANews has awarded $357,000 to Ninth District airports. Learn more ⬇️\nhttps://t.co/tMOsg28sWm","date":"Tue Apr 14 21:28:44 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Virginia Medical Reserve Corps is recruiting 30,000 volunteers across the Commonwealth to aid public health. Medical training not needed – logistics, communications, coordination, and technological support roles are available. Learn more at https://t.co/VtJhizF6GJ.","date":"Mon Apr 13 19:27:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Health care providers: applications for the FCC’s COVID-19 Telehealth Program are now open. It will support telehealth care to patients at home or at mobile locations in response to the coronavirus epidemic. https://t.co/GVlj7FnksI","date":"Mon Apr 13 16:56:27 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"May you have a happy and blessed Easter. https://t.co/6ZiZgDUCkN","date":"Sun Apr 12 12:25:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.10.20 Topic: Seeing the Light https://t.co/Dq3N9YgUBN","date":"Fri Apr 10 16:12:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Here we go again. Are the Democrats blocking more aid for small businesses unless they can get taxpayer dollars for unrelated agenda items like the Kennedy Center? https://t.co/25DQmmHPVH","date":"Thu Apr 09 14:51:21 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was glad to join with Virginia colleagues from both sides of the aisle in support of our nursing homes and assisted living facilities.","date":"Wed Apr 08 20:42:59 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"\"A bipartisan quartet of Virginia congressional representatives wants the federal government to distribute at least $25 billion in emergency relief to nursing homes and assisted living facilities that are especially vulnerable to the coronavirus pandemic.\" https://t.co/zbAHEqbNgo","date":"Wed Apr 08 20:42:59 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"🚨@HHSGov has awarded $4,848,350 to health centers in VA's 9th Congressional District for addressing the coronavirus.\n\nRead more ⬇️\nhttps://t.co/aRPCRr8VVL","date":"Wed Apr 08 15:47:39 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this World Health Day, let’s thank the doctors, nurses, EMTs, and all the health care professionals who look out for us, especially during this time of pandemic. https://t.co/Qk8OHdGR6F","date":"Tue Apr 07 19:40:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Answers to frequently asked questions about Paycheck Protection Program loans, courtesy of @USTreasury and @SBAgov. https://t.co/7F5XwtIIyD","date":"Tue Apr 07 16:21:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"My website has a new page devoted to the coronavirus. On it, you can find resources on prevention, government programs to help with economic distress due to the outbreak, legislation, and more: https://t.co/JCwxdJymme","date":"Mon Apr 06 21:31:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.6.20 Topic:\nFrequently Asked Questions About Coronavirus Legislation https://t.co/NMVBvqwxME","date":"Mon Apr 06 16:47:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: “Apply for everything you can get to keep your business afloat,” Rep. Morgan Griffith, R-Salem, told more than 60 people on a video call hosted by the Roanoke-Blacksburg Technology Council on Friday.      https://t.co/1LTPgPPz5E","date":"Mon Apr 06 14:43:26 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I joined a bipartisan group of congressmen and senators earlier this week in urging the U.S. Department of Health and Human Services to prioritize financial relief to rural hospitals. https://t.co/yLxXbKo187","date":"Thu Apr 02 20:15:37 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Important update from @USTreasury.","date":"Thu Apr 02 16:06:29 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is a forward-thinking proposal that will increase spectrum for broadband use. More good work from @AjitPaiFCC to expand broadband access to all Americans.","date":"Wed Apr 01 22:43:04 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Important information on economic impact payments from the IRS.\nhttps://t.co/gqcey0ALRr","date":"Wed Apr 01 20:20:00 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Contact a Small Business Development Center in your area for additional assistance. https://t.co/ZMUE83RiTa","date":"Wed Apr 01 16:55:08 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Paycheck Protection Program helps small businesses keep employees on the payroll despite the impact of the coronavirus. \n\nFind out more, including the application a small business would need to submit to its SBA participating lender ⬇️.\nhttps://t.co/diI1xxu0DK","date":"Wed Apr 01 16:53:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Nice work @AppPharm! https://t.co/3qrmiYqva3","date":"Tue Mar 31 19:26:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"🚨@HUDgov has awarded $640,972 in funding to four jurisdictions in Virginia’s Ninth Congressional District through the Community Development Block Grant program. This funding was authorized by the CARES Act.\n\nRead more ⬇️\nhttps://t.co/xbgBcx9bSy","date":"Tue Mar 31 14:57:08 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.30.20 Topics: The CARES Act; Ninth District Constituent Services https://t.co/O7DqUj1WiI","date":"Mon Mar 30 16:45:43 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Ninth District has suffered our first fatality due to the coronavirus. My condolences to the family of the deceased on this loss. https://t.co/f7YCCIZfUC","date":"Sun Mar 29 21:11:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Vietnam War Veterans Day. Thousands of Virginians fought in Vietnam, and more than 1,300 died there. The soldiers, sailors, airmen, and Marines who served there deserve our gratitude. Let’s use this day to honor them.","date":"Sun Mar 29 18:35:55 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"What’s in the CARES Act? Aid to employers and small businesses. https://t.co/f7P3MZrp2f","date":"Sun Mar 29 16:17:24 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"What’s in the CARES Act? Economic support for Americans. https://t.co/KBgRy0cz7r","date":"Sat Mar 28 22:45:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I have read the complete text of the CARES Act. While I do not agree with everything in the bill, I believe that it will deliver on its most important goals.\n\nRead my full statement on the CARES Act and what's in the bill ⬇️\nhttps://t.co/UDqKOZNU57","date":"Fri Mar 27 18:10:02 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am continuing to read through the CARES Act (coronavirus bill number 3). As with any bill, I have to read it before I vote on it. I need to know that this bill does some good things for the Ninth District. https://t.co/3RLPdj1hep","date":"Thu Mar 26 16:38:41 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Just announced: @HHSGov has awarded $418,976 to seven community health centers located in VA's Ninth Congressional District. The funding may be used for screening and testing, acquiring medical supplies, and boosting telehealth capacity. \n\nLearn more⬇️\nhttps://t.co/b6NcPaUkBu","date":"Tue Mar 24 16:46:29 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: I spoke to WJHL about how we are working to address the coronavirus. https://t.co/oJhgR9Sbym","date":"Tue Mar 24 13:44:12 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.23.20 Topic: The Federal Government Responds to the Coronavirus https://t.co/ml2Dw537pZ","date":"Mon Mar 23 15:02:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"During the coronavirus outbreak, donating blood is a vital way to help our fellow citizens. If you are healthy and qualified, please consider visiting a local blood bank or blood drive and donating. Your donation could help save a life. https://t.co/KiMP00aP71","date":"Fri Mar 20 16:48:02 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Many small businesses have been hit hard by the coronavirus’ economic impact. Those in VA are now eligible for Economic Injury Disaster Loans through @SBAgov, receiving up to $2 mil in assistance. These loans can be a lifeline out of financial devastation. https://t.co/NwKI9lm7SL","date":"Thu Mar 19 21:18:39 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am reminded of the adage that the best time to steal your neighbor's pig is in the middle of a hurricane. And Washington is full of pork hounds. https://t.co/2PXBSArz38","date":"Wed Mar 18 20:24:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Telemedicine and remote learning provide valuable services in rural areas. In the present situation, they are essential. I applaud the @FCC for listening to rural schools and medical providers and providing flexibility for telemedicine and remote learning efforts.","date":"Wed Mar 18 18:54:41 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Due to closures in response to the coronavirus outbreak, Grayson County’s office hours scheduled for today, Wednesday, March 18 have been cancelled.","date":"Wed Mar 18 18:32:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: “I think the economy will come back strong; I’m very optimistic. The question I have is do we have a bounce [additional cases]? Once we round out from the initial peak, that’s what we don’t want to have happen — and we don’t know yet.\" https://t.co/I59WKCb8GV","date":"Wed Mar 18 18:03:21 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"During this trying time, it is encouraging to see companies plan to hire more workers to help bring relief during the coronavirus outbreak. https://t.co/KV6IwhEUaZ","date":"Wed Mar 18 14:44:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Some of the locations that host my staff in the Ninth District’s jurisdictions have decided to close temporarily during this public health situation, and others could make the same decision. \n\nRead the latest on my traveling staff office hours: https://t.co/LnzpmPYk35","date":"Tue Mar 17 19:56:16 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: I discuss the coronavirus outbreak and the Federal Government's response with @WFXRnews. https://t.co/qC8s5vesoM","date":"Mon Mar 16 20:35:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"It is with regret that I have chosen to postpone the Ninth District 2020 Service Academy Day indefinitely. Read my full statement: https://t.co/FEe1RWSNUq","date":"Mon Mar 16 16:27:34 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Veterans can find the latest information on the coronavirus and steps taken by the @DeptVetAffairs at https://t.co/lRF2XMl94I","date":"Mon Mar 16 14:11:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I plan to support the bill the House will vote on tonight to counteract the economic and social damage inflicted by the coronavirus. It is not perfect, but it will help. I stand with @realDonaldTrump and the administration’s efforts to turn the tide.","date":"Sat Mar 14 04:28:03 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thank you to the @FCC for leading on maintaining broadband and telephone connectivity with the Keep Americans Connected pledge as well as to the companies serving the Ninth District that have taken the pledge.","date":"Fri Mar 13 22:08:46 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.13.20 Topic: Coronavirus https://t.co/brF6LreM0p","date":"Fri Mar 13 17:03:30 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Information to know about coronavirus testing ⬇️ https://t.co/bUbH8wOM9B","date":"Fri Mar 13 14:13:19 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"It is encouraging to see private entities step up their capacity for quick, accurate coronavirus testing. https://t.co/rX7GczkI2w","date":"Fri Mar 13 13:07:49 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"White House tours have been cancelled for the foreseeable future.","date":"Thu Mar 12 14:37:15 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Due to the coronavirus, all tours of the Capitol have been suspended until April 1. My staff is reaching out to all constituents who have booked tours through my office for the remainder of March.","date":"Thu Mar 12 14:32:52 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I did, however, vote in favor of renaming FISA the “Federal Initiative to Spy on Americans Act.”","date":"Wed Mar 11 22:05:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on FISA renewal: https://t.co/CJj3AiFK4d","date":"Wed Mar 11 21:15:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Practicing good hygiene is essential to prevention. Also, consider rearranging large activities and gatherings, and be careful when making travel plans.","date":"Wed Mar 11 18:00:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Symptoms of coronavirus include fever, shortness of breath, and cough. Seek medical attention if you come down with these symptoms and avoid contact with those who have them. Older individuals and those with significant underlying conditions are most at risk.","date":"Wed Mar 11 18:00:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am receiving frequent briefings about this outbreak from medical professionals and public health officials. Please check my website (https://t.co/DxAGNU0Hj7), Facebook (https://t.co/2cdOIJC01R), and Twitter (https://t.co/EHsnaNEaNd) for more updates.","date":"Wed Mar 11 18:00:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Centers for Disease Control and Prevention (CDC) website, https://t.co/VWm6qGSpxn, features many resources on the coronavirus, including information about symptoms, prevention, and testing.","date":"Wed Mar 11 18:00:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"VA’s Department of Health currently imposes strict guidelines on their testing, but commercial labs including Quest and LabCorp are available to process tests if they are ordered by a doctor. Most insurers are covering these tests but check with your insurer first to make sure.","date":"Wed Mar 11 18:00:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Testing is a clear concern for many. Last night on a telephone town hall, one of the questions I received involved tests. Testing capacity is growing rapidly.","date":"Wed Mar 11 18:00:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The coronavirus currently poses a public health threat in the United States. Although no cases are presently confirmed in Southwest Virginia, I want to share with you information and resources that will help prepare you and your family to stay healthy.","date":"Wed Mar 11 18:00:13 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Simple precautions will help protect you from coronavirus. Avoid touching your eyes, nose, and mouth, wash your hands with soap and water, and avoid contact with people who are sick.\n\nNo cases have been confirmed in SWVA at present, but if you feel symptoms, contact your doctor. https://t.co/exSNIi9yeE","date":"Tue Mar 10 20:17:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The 2020 Congressional Art Competition for high school students in the Ninth District is now open! Learn more 👇https://t.co/INclrIvAxn","date":"Tue Mar 10 16:36:53 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.9.20 Topics: Coronavirus and Illegal Drugs https://t.co/MrWPZYC9CH","date":"Mon Mar 09 21:15:10 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Technology companies are finding a home in Southwest Virginia. The IT provider 1901 Group plans to create 150 new jobs and invest $1.15 million in Washington County. This is great news for the region and shows we can successfully compete for the tech jobs of today’s economy. https://t.co/2Q8l3caxgO","date":"Mon Mar 09 15:10:06 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"ICYMI: @ONDCP Director Jim Carroll and I held a roundtable discussion in Wise on addressing substance abuse. https://t.co/5KQXWU77gx","date":"Sat Mar 07 18:30:59 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to @ONDCP Director Jim Carroll for visiting Wise and hearing from health professionals, law enforcement, and local leaders about confronting drug abuse in our communities. https://t.co/2ycnEAMkre","date":"Fri Mar 06 19:24:09 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Enjoyed discussing economic development in our region with @InvestSWVA. https://t.co/DtOql3WRmj","date":"Thu Mar 05 21:48:58 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"So did at least five signers of the Declaration of Independence and several U.S. presidents, including Virginians Thomas Jefferson, James Madison, and James Monroe.","date":"Wed Mar 04 17:36:46 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"March 1 was St. David’s Day, and the daffodils on Capitol Hill are still celebrating.\n \nSt. David is the patron saint of Wales, and daffodils are a national symbol. Many in Appalachia including myself trace our ancestry back to Wales. https://t.co/Rb6BiOpu9N","date":"Wed Mar 04 17:36:45 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Israel and the United States enjoy a strong alliance based on our shared values and interests. I appreciated the opportunity to meet again with @AIPAC members today to discuss the enduring partnership between our two countries.","date":"Tue Mar 03 20:50:36 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"In addition to my district offices in Abingdon and Christiansburg, my staff hold traveling office hours each month in the other jurisdictions of the Ninth District. Find out when they will be in your county or city in March. https://t.co/FkwiN9T4Ka","date":"Mon Mar 02 18:57:40 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I signed this letter b/c I strongly feel that the separate issues of fighting the coronavirus and reauthorizing FISA should not be combined to dodge a serious debate on the numerous abuses of current FISA law. If they are put together as 1 package, I would likely have to vote no.","date":"Sat Feb 29 00:46:23 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"TV white spaces offer promise for expanding affordable broadband access in rural areas. I applaud the FCC’s commitment to bridging the #digitaldivide by moving to update white space rules.","date":"Fri Feb 28 18:12:57 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.28.20 Topic: A Fence, A Wall, and a Better Immigration System https://t.co/jXLSRs9igl","date":"Fri Feb 28 16:24:25 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I just voted on the House floor to condemn Bernie Sanders’ positive comments on Fidel Castro. The Castro regime was built on political repression and economic misery, and Senator Sanders should stop trying to minimize this shameful record.","date":"Thu Feb 27 19:58:58 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"By the way, the family of the resolution’s sponsor, Rep. @MarioDB, fled Cuba because of Castro, and so did many of his constituents. They know better than to fall for socialist propaganda. It is unfortunate that Bernie Sanders does not.","date":"Thu Feb 27 19:58:58 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Attention young entrepreneurs: @ARCgov is hosting a four-week, all expenses paid Appalachian Entrepreneurship Academy this summer in Pittsburgh. Appalachian rising high school seniors are eligible to apply. The deadline is March 6. \n\nTo learn more, visit https://t.co/BqJ889Q1J3","date":"Wed Feb 26 16:40:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Katherine Johnson, one of the “hidden figures” of the 1960s space race, has passed away at 101. Her mathematical calculations made the giant leaps of our space program possible. Before working at NASA, this American hero lived in SWVA and taught in Smyth and Tazewell Counties.","date":"Mon Feb 24 17:37:04 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.21.20 Topic: The Trouble With Socialism: First in an Occasional Series https://t.co/I9pzkvS1FI","date":"Fri Feb 21 18:17:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The #2020Census is approaching, and @uscensusbureau is hiring census takers in our communities. You can help make sure everyone is counted and earn money in the process. Pay varies by jurisdiction from $13.50-18.50/hour. Learn more and apply online at https://t.co/ETpSewzZf6. https://t.co/y5s7f1KGWQ","date":"Tue Feb 18 16:22:07 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.14.20 Topic: No Road Back for the ERA https://t.co/EX2IbGNRs1","date":"Fri Feb 14 19:12:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Heavy rainfall in our region has caused flooding in some areas and may lead to more. Please be alert, avoid driving on flooded roads, and pay attention to the weather advisories in your area. My office has been in contact with local officials to see how I can be of assistance.","date":"Thu Feb 06 17:18:34 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Senate has finally ended an ordeal that never should have started.\n\nMy statement on President Trump's acquittal ⬇️ https://t.co/sPVj7KuGVM","date":"Wed Feb 05 21:55:35 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"@realDonaldTrump put forward an agenda that will build on his Administration’s successes and continue to advance the well-being of the American people. https://t.co/Mx0wy86xrL","date":"Wed Feb 05 03:37:59 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.3.20 Topic: Staying Safe from Coronavirus https://t.co/xJlQdU22nc","date":"Mon Feb 03 15:48:54 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Brexit was a choice made by the people of the U.K. exercising their rights as a sovereign nation. As such, it must be respected.\n\nWhile the economic and political relationship between the U.K. and Europe changes, the Special Relationship between the U.K. and the U.S. endures.","date":"Fri Jan 31 15:01:28 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Brexit creates an opportunity for our countries to strengthen the ties that bind us. The United States can now aspire to an era of renewed friendship, political cooperation, and economic partnership with the United Kingdom and the four nations of which it consists.","date":"Fri Jan 31 15:01:28 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Mack Truck’s decision to locate its new manufacturing operation in Roanoke County is great news. Through this $13 million investment and creation of 250 new jobs, it has made a tremendous commitment to the region. https://t.co/FSqFBlHIzk","date":"Thu Jan 30 17:18:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.27.20 Topic: Economic Development Hits and Misses: AML and Baseball https://t.co/uK43hWvNVx","date":"Mon Jan 27 17:19:18 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I attended today's economic development announcement in Pulaski County, where Patton Logistics is planning to establish a new logistics and warehousing operation, investing $12 million and creating 33 new jobs. https://t.co/418Yuz8XNp","date":"Tue Jan 21 19:37:18 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we celebrate the life of Dr. Martin Luther King, Jr. His leadership on behalf of civil rights appealed to our highest ideals as a country, and his eloquence and commitment to nonviolent protest still inspires. Let us honor his life and the noble truths he advocated. https://t.co/4115Uj9Q6s","date":"Mon Jan 20 13:17:32 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I sent the following letter to the Governor about the risks posed to the habitats of Virginia's birds by the Hampton Roads Bridge-Tunnel. https://t.co/4JZcM5im9N","date":"Fri Jan 17 20:49:56 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Broadband access is vital to economic opportunity in rural areas in Virginia and nationwide. Chairman @AjitPaiFCC's proposed Rural Digital Opportunity Fund will help connect more homes and businesses. I appreciate this commitment to serving rural communities.","date":"Thu Jan 16 14:31:11 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Southwest Virginians are proud of our musical heritage. This @NEAarts grant of $25,000 will support the Mountains of Music Homecoming at the Crooked Road, highlighting our rich music and culture.\n\nMore⬇️https://t.co/oPv5aVHp0B","date":"Wed Jan 15 21:50:14 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Lapses across the drug supply chain contributed to the opioid crisis, which has devastated communities across the country and in the Ninth Congressional District particularly.","date":"Tue Jan 14 15:47:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"We need more information from Insys, Mallinckrodt, and Purdue in order to understand how drug manufacturers may have affected the course of the crisis. Learning from the mistakes of the past will help prevent such tragedies in the future.","date":"Tue Jan 14 15:47:47 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.13.20 Topic: Second Amendment https://t.co/VUbrqiGDcU","date":"Mon Jan 13 15:18:39 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on Speaker Pelosi saying she will send the articles of impeachment to the Senate next week ⬇️ https://t.co/swXx1KcMuZ","date":"Fri Jan 10 18:10:33 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Whether or not to wage war is a matter of the greatest significance to our country.\n \nUnfortunately, the War Powers Resolution introduced by Democrats does not do justice to the topic. \n\nMore ⬇️ https://t.co/O8jr68QEgm","date":"Thu Jan 09 23:36:00 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Law Enforcement Appreciation Day, let's thank the men and women who protect our communities every day. https://t.co/RU0MJwUgi5","date":"Thu Jan 09 22:50:21 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am concerned for our troops in harm’s way after Iran’s missile attacks on U.S. personnel in Iraq. This is a serious action on Iran’s part. Congress must debate and vote if the conflict escalates.","date":"Wed Jan 08 01:30:05 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.3.20 Topics: New Laws, Impeachment, and Airstrike https://t.co/sfxoofsWyQ","date":"Fri Jan 03 21:24:22 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"@DrPhilRoe has been a great partner in the House of Representatives on the many matters of shared interest between East Tennessee and Southwest Virginia. He is always ready to work together to advance our common agenda.","date":"Fri Jan 03 17:56:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"He has also been an important voice in Congress on behalf of veterans. I will miss having this friend and devoted public servant in the House when he departs. I wish Phil, Clarinda, and their family all the best as they go forward.","date":"Fri Jan 03 17:56:50 +0000 2020","user_id":"234057152"},{"handle":"RepMGriffith","text":"Read my Op-Ed in Richmond Times-Dispatch,\n“Proportional Representation Promotes Fairness”\nhttps://t.co/tu6Lrm1Te2","date":"Mon Dec 30 15:28:52 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"May you have a merry Christmas. https://t.co/d1yhMkkZxo","date":"Wed Dec 25 13:04:10 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.24.19 Topic: O Little Town of Bethlehem https://t.co/CEXkvMexTo","date":"Tue Dec 24 19:26:33 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Best wishes to all celebrating Hanukkah beginning tonight. https://t.co/yUY39KayfG","date":"Sun Dec 22 20:31:52 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Democrats want the people of Marion to help shoulder the tax burden in Manhattan and the people of Stuart to subsidize the tax burden of living in San Francisco. That is unfair to the people of the 9th District and most of America. My statement on SALT ⬇️ https://t.co/1EzWtXNXwE","date":"Thu Dec 19 21:38:05 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I spoke to WFIR News about why the abuses of FISA uncovered by the Justice Department's inspector general deserve more than a strong letter. They call for sanctions. https://t.co/NlaCQJzVdX","date":"Thu Dec 19 16:08:47 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"House Democrats today abused the power of impeachment. I am sorry they did so, for the millions of Americans who voted for President Trump and for the Constitution that has been damaged. https://t.co/oACi0GWQLJ","date":"Thu Dec 19 02:01:53 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Breaking: Obamacare's individual mandate found unconstitutional https://t.co/LZyPEnk08o","date":"Wed Dec 18 22:17:37 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Lawyers who practice in a court are considered ‘officers of the court.’ ‘Officers of the court,’ including James Comey and others, misled the FISA court.\n\nRead more on why I believe FISA abuses call for sanctions⬇️\nhttps://t.co/gM5TeBHWJB","date":"Wed Dec 18 17:08:06 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I will be voting no on impeachment today. A few people under the Bristol sign might disagree, but I have found no impeachable offenses, just partisan politics. https://t.co/Dl5svWig9R","date":"Wed Dec 18 14:39:07 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"As we build out broadband in rural areas, it is vital that we have accurate information about coverage.\n\nRead more about two bipartisan bills I cosponsored that would solve this problem here⬇️ https://t.co/zaEjfIcRlU","date":"Mon Dec 16 21:52:20 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topic:\nNo on Impeachment https://t.co/U0eUgfrmW4","date":"Mon Dec 16 15:10:45 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Under H.R. 3, the government wouldn't negotiate on drug prices. It would make an offer you cannot refuse. https://t.co/vkgAdRfA0w","date":"Thu Dec 12 14:16:55 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The right to keep and bear arms is a foundational freedom of our country. In fact, Virginia demanded a bill of rights as a condition of ratifying the Constitution. Throughout my time in public service, I have been a strong supporter of the Second Amendment.","date":"Tue Dec 10 22:47:09 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Many constituents have expressed legitimate concerns about how their right to bear arms will be treated by the incoming Gen. Assembly, and I share their concerns. For my part, as a Congressman I will continue to stand up for this God-given right acknowledged in the 2nd Amendment.","date":"Tue Dec 10 22:47:09 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today’s Energy and Environment Innovation Showcase highlighted the work of organizations like MOVA Technologies of Pulaski. Creative thinking and design will help us solve environmental and economic challenges #InnovatEandC https://t.co/JDDNXrCuu8","date":"Mon Dec 09 22:52:37 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.9.19 Topic: Prescription Drug Prices: Two Paths https://t.co/ZF5s6mUZtS","date":"Mon Dec 09 21:08:54 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we remember Pearl Harbor. https://t.co/TNWrNfDtC6","date":"Sat Dec 07 15:56:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Miners Day. We appreciate all that miners do to keep our lights on, power our homes, and contribute to our economy.","date":"Fri Dec 06 15:32:28 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Innovation will unlock a cleaner, more prosperous future. I am excited by the possibilities, especially those that may come from Virginia’s Ninth Congressional District.\n\nRead more at https://t.co/eEDHcIPFhS https://t.co/JIQwgTQ1hz","date":"Thu Dec 05 15:48:45 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I just voted for the TRACED Act to crack down on robocalls. My statement: https://t.co/pS00MJ2oWe","date":"Wed Dec 04 19:31:59 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.2.19 Topic:\nHong Kong: How We Got Here https://t.co/LeXfUJ3pT6","date":"Mon Dec 02 16:52:40 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"May each of you have a peaceful and happy Thanksgiving.","date":"Thu Nov 28 13:55:59 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.25.19 Topic: Thanksgiving\nhttps://t.co/0FZ1FuDA4Q","date":"Mon Nov 25 14:55:03 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Will you be following the @SalemSpartans vs. GW Danville game tonight? @RepRiggleman and I will be. https://t.co/VhVm12qdxu","date":"Fri Nov 22 14:28:14 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.18.19 Topics:\nMaternal Mortality and Self-Defense https://t.co/wth8unn3Yk","date":"Mon Nov 18 17:44:39 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter Topics: November 11: 1919 and 2019 https://t.co/Sb6HYNUDcO","date":"Mon Nov 11 14:08:24 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to see the Senate take a look at New Source Review reform, which has been a priority of mine. This is commonsense legislation to promote efficiency and pollution control. Good for the economy and the environment.","date":"Wed Nov 06 15:06:07 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.4.19 Topics: Halloween Tricks https://t.co/tPllqfLTy7","date":"Mon Nov 04 18:28:34 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was proud to stand with my colleagues yesterday to mark Domestic Violence Awareness Month and to support victims and survivors of domestic violence. https://t.co/bc10NvF5S4","date":"Thu Oct 31 22:50:18 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m about to vote no on the Democrat impeachment resolution against ⁦@realDonaldTrump⁩. https://t.co/SJAOPjaP8z","date":"Thu Oct 31 15:02:05 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am in the Rules Committee room where Democrats are marking up their impeachment resolution.\n\n@RepDLesko offered an amendment requiring any evidence which is exculpatory regarding the President to be given to the Judiciary Committee.\n\nDemocrats rejected it.","date":"Wed Oct 30 23:35:01 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Democrat impeachment resolution is an attempt to ratify their ongoing faulty process. \n\nIt is not a serious document, and it will not provide the transparency and fairness required of an impeachment inquiry. https://t.co/xzOBcHNrUB","date":"Wed Oct 30 21:01:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Having read the resolution, it's clear: you can have due process if the Democrat chair or majority agrees to it.","date":"Tue Oct 29 19:50:47 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Here is the resolution being rushed by Democrats to the floor without any Republican input to ratify their “impeachment inquiry.” They are not capable of running a fair, transparent, and impartial process. https://t.co/UiPnHCXoBw","date":"Tue Oct 29 19:27:56 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am saddened to learn that former Governor Gerald Baliles has passed away. He served our Commonwealth faithfully as a member of the House of Delegates, Attorney General, and Governor. https://t.co/ewBVT3w0eR","date":"Tue Oct 29 14:55:30 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Under @repgregwalden’s leadership, @HouseCommerce made great strides for Americans in tackling the opioid crisis, promoting energy dominance, enacting Right to Try, and on countless other issues. He will be missed when he leaves the House, and I wish him the best.","date":"Mon Oct 28 20:36:48 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The death of Abu Bakr al-Baghdadi is a victory for our country and justice for all who suffered at the hands of ISIS. Thank you to the brave Special Forces who carried out the raid.","date":"Sun Oct 27 14:19:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.25.19 Topic: Help for Sexual Assault Victims https://t.co/bSClneEjfR","date":"Fri Oct 25 17:22:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Find the collection site nearest you at https://t.co/jFQtNlKy1C. https://t.co/IciMB3JlYu","date":"Fri Oct 25 13:35:48 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"October 26th is National Prescription Drug Take Back Day. It is a great opportunity to safely and anonymously dispose of prescription drugs of all kinds. I commend the national effort by the Drug Enforcement Agency to help stop prescription drug abuse.","date":"Fri Oct 25 13:35:47 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to join @POTUS and @VP in the Cabinet Room yesterday.\n\nOfficial White House Photo by Shealah Craigead https://t.co/UgHcaLG3pD","date":"Wed Oct 23 21:31:20 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I have learned from Democrat press conferences and Washington Post leaks that this body has an ongoing so-\ncalled \"impeachment inquiry.\"\n\nBut can I, as a Member of Congress, watch the testimony?\n\nNo.\n\nCan you watch the testimony at home so you can decide for yourself? \n\nNo. https://t.co/ePO8Dooa1f","date":"Wed Oct 23 14:10:05 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Adam Schiff has not been honest with the American people and is incapable of leading a fair, transparent, and impartial investigation. I am a cosponsor of @RepAndyBiggsAZ’s resolution to #censureSchiff and voted to do so tonight.","date":"Mon Oct 21 23:11:33 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.21.19 Topics: Pelosi Drug Bill; Secretary of Energy Rick Perry https://t.co/y7W7GclSy8","date":"Mon Oct 21 17:52:45 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"We have to do better for sexual assault victims. The bill I have introduced, the Sexual Assault Victims Protection Act, will help. \n\nRead more: https://t.co/nSdflRcLWa","date":"Fri Oct 18 16:50:19 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.11.19 Topics: Broadband’s New World; Health Care https://t.co/1Sb7jhhdgC","date":"Fri Oct 11 19:41:36 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The @FCC has authorized nearly $24 million for fast and reliable broadband access in Southwest Virginia. Read more: https://t.co/1KSTGiNXIg","date":"Thu Oct 10 16:49:29 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Speaker Pelosi and House Democrats have taken an unprecedented and unfair approach to their so-called “impeachment inquiry.” It is appropriate for the White House to demand due process and transparency.","date":"Wed Oct 09 21:51:14 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Ballad Health Urgent Care facility in Lee County is now open. I joined in cutting the ribbon and spoke at the facility last night. https://t.co/Z47Wtlf9aH","date":"Wed Oct 09 15:10:20 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.7.19\nTopic: Impeachment: A Partisan Distraction https://t.co/4k1uCUAFA7","date":"Mon Oct 07 16:15:30 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.30.19 Topic: Should Illegal Immigrants Be Placed Ahead of Veterans? https://t.co/VOR6fFJBwP","date":"Mon Sep 30 20:17:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Rural Retreat Elementary on its recognition as a National Blue Ribbon School by @usedgov! https://t.co/TEtG3VRPo2","date":"Thu Sep 26 18:27:54 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on President Trump and Ukraine: https://t.co/t54npIzfBR","date":"Wed Sep 25 16:19:34 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.23.19 Topic: Energy Production Means Energy Security https://t.co/zo3K8zVuom","date":"Mon Sep 23 16:32:18 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I joined @WFXRnews to talk about the opioid crisis, upcoming workshops I am hosting with USDA Rural Development, and the recent drone strikes in Saudi Arabia. Watch my full interview or read more at the link: https://t.co/VkvUHOt1om","date":"Tue Sep 17 20:20:23 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is Constitution Day. On this day in 1787, 39 delegates in Philadelphia signed the Constitution after a summer of deliberation and debate. It remains the law of the land today, and we continue to honor it as we seek “to form a more perfect Union.” https://t.co/1lPoFpZLZF","date":"Tue Sep 17 14:51:44 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.16.19 Topics: Fixing Health Care; WOTUS https://t.co/BB7XAQZEL9","date":"Mon Sep 16 17:01:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today, we again honor the victims and the heroes of September 11, 2001. This morning, I participated in a moment of silence in memory of all who lost their lives on this day eighteen years ago. https://t.co/bF6tn0gRBO","date":"Wed Sep 11 13:08:56 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The first responders who ran into burning buildings, the Flight 93 passengers who took back the plane aimed at the Capitol, all who risked and, in many cases, gave their lives to save others on 9/11, will be remembered as long as our country endures.","date":"Wed Sep 11 13:08:55 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Americans will never forget the evil committed by terrorists in New York, Virginia, and Pennsylvania on September 11, 2001. I still remember the disbelief I felt when watching the attacks.","date":"Wed Sep 11 13:08:55 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Like most Americans, I could not fathom the hatred and cruelty that would lead anybody to kill almost 3,000 innocent people in such a horrifying manner. But just as we will not forget the evil of that day, we will always remember the heroism.","date":"Wed Sep 11 13:08:55 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.9.19 Topics: More Resources to Fight the Opioid Crisis; USDA Rural Development Grant Workshops https://t.co/wdCnCEPRTi","date":"Mon Sep 09 14:17:46 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.2.19 Topics: Labor Day; Serving You https://t.co/DcKcxNAMXn","date":"Mon Sep 02 12:34:04 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Got good insight on issues in Grundy in a meeting today with Grundy Town Manager James Keen","date":"Wed Aug 28 17:32:43 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.23.19 Topics: National Parks\nhttps://t.co/HkSpvxh9tw","date":"Mon Aug 26 14:11:19 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.19.19 Topics: The Melungeon People; Congressional App Challenge https://t.co/QYIq78VNq3","date":"Mon Aug 19 14:42:03 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.12.19 Topics: Socialized Medicine: Not What the Doctor Ordered https://t.co/vn28qUgGWn","date":"Mon Aug 12 14:43:33 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I introduced legislation to help employees at companies that have filed bankruptcy, like Blackjewel. Read my statement below: https://t.co/EEdWFnjQGp","date":"Fri Aug 09 15:22:07 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The 2019 Congressional App Challenge is now open! Learn more: https://t.co/vdNffEZYSU","date":"Thu Aug 08 16:05:06 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"George Washington awarded the first Purple Heart on this date in 1782. Today, it is awarded to those killed or wounded by enemy action while serving in the U.S. Armed Forces. On Purple Heart Day, we honor these men and women who have sacrificed for our country. https://t.co/ZCaHRP7dc8","date":"Wed Aug 07 13:22:00 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.5.19 Topics: Abandoned Mine Land Reclamation Funding; Congressional Award; Defense Industry in the Ninth District https://t.co/i1DTNuerpl","date":"Mon Aug 05 18:45:22 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"In Wise today for the award of $500,000 in Abandoned Mine Land (AML) Pilot Program funds to develop a solar project at the Mineral Gap Data Center. https://t.co/UwT3zNPRIQ","date":"Wed Jul 31 21:12:14 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.29.19 Topic: Continuing to Fight the Opioid Crisis https://t.co/j4B6j8eme2","date":"Mon Jul 29 16:04:52 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The federal funding I secured for the Abandoned Mine Land Pilot program is bringing new economic opportunities to Southwest Virginia: https://t.co/n3y4mbxsID","date":"Fri Jul 26 15:09:25 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Boycott, Divestment, and Sanctions (BDS) Movement unfairly targets Israel, one of America’s staunchest allies, and seeks to exclude it from the community of nations. Today I voted to condemn BDS and stand with our ally.","date":"Tue Jul 23 23:39:24 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.22.19 Topics: Blackjewel and Bipartisanship https://t.co/nG2TD7ZW59","date":"Mon Jul 22 19:50:23 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"50 years ago, the astronauts of Apollo 11 made history by landing on the Moon. I remember watching on TV this giant leap for mankind, a leap propelled by American innovation, talent, and grit. It remains an incredible feat and a reminder of the great things our country can do. https://t.co/aZ66xArIqS","date":"Sat Jul 20 12:30:18 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"People are fed up with the scam calls they receive from numbers that look familiar. Today @HouseCommerce acted on a bipartisan basis to end this scourge. Learn more: https://t.co/C0mzpWVDoi","date":"Wed Jul 17 14:49:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I have previously said that the President should tone down his Twitter rhetoric, and I would say that again.","date":"Mon Jul 15 19:30:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I think he is correct to be unhappy when Members of Congress constantly talk of our country with disrespect. I grew up with Merle Haggard, who sang, \"When they’re runnin’ down our country, man, they’re walkin’ on the fightin’ side of me.\"","date":"Mon Jul 15 19:30:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.15.19 Topic: Defense, Freedom, and Trees https://t.co/fUMjFF1wOq","date":"Mon Jul 15 14:39:32 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.8.19 Topic: Robocalls\n\nhttps://t.co/jnJYo3FVsF","date":"Mon Jul 08 19:11:59 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I enjoyed continuing my tours with the Farm Credit to farms in the area earlier today. This afternoon I visited the Dehart Farm in Floyd, where we continued discussing issues affecting our farmers. https://t.co/G98bO0cNZj","date":"Tue Jul 02 21:53:27 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to visit Mountain Meadows Farm today, in Meadows of Dan, VA. I was joined by representatives from Farm Credit, and had the opportunity to discuss issues impacting our farmers in the 9th district.  Great folks! https://t.co/4sAYnHj4iq","date":"Tue Jul 02 16:04:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to visit PBE electronics in Tazewell, VA! Pyott-Boone Electronics has provided technology &amp; infrastructure in mining &amp; tunnelling for over 50 years! Thanks for the tour! https://t.co/Uw718YteqA","date":"Mon Jul 01 17:25:52 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"In beautiful Burke’s Garden at the World Headquarters of the Burke’s Garden Telephone Company, where you can get high tech broadband internet and see the Amish! https://t.co/EmoJfjt22j","date":"Mon Jul 01 16:31:04 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.1.19 Topic: Independence Day \n\nhttps://t.co/hY7bSGePAy","date":"Mon Jul 01 15:37:54 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Spent the morning with folks at RAM in Wise. https://t.co/IXSPq5IBOG","date":"Sat Jun 29 15:43:14 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"It was great to see Harry Kelly and some of his grandchildren today at the Farmers Market in St. Paul, VA. https://t.co/TP77skWibr","date":"Sat Jun 29 15:28:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Volvo Trucks’ enormous investment in Pulaski County is a tremendous sign of confidence in the business climate of the New River Valley. Read more here: https://t.co/AXAIHW1v6c https://t.co/21obKnI9n4","date":"Fri Jun 28 15:26:40 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on funding to address the border crisis: https://t.co/Bc3GPD7bv2","date":"Thu Jun 27 21:22:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"⁦⁦@RobWittman⁩ and I enjoyed seeing Dr. Rene Rodgers, Head Curator of Bristol’s Birthplace of Country Music Museum, tonight on Capitol Hill. https://t.co/Y4qEce3oI0","date":"Tue Jun 25 22:41:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.24.19 Topic: A Week in the House https://t.co/6HS0nd5wwo","date":"Mon Jun 24 15:46:37 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"“Rep. Morgan Griffith, R-Va., asked McLemore whether ‘reproductive justice’ included the right to obtain late-term abortions, even up until dilation.” https://t.co/Eq99ylbtKC","date":"Sat Jun 22 22:08:16 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thank you for coming to Laurel Fork. FCC's commitment to telehealth will promote accessible and affordable care for SWVA and rural Americans across the country.","date":"Fri Jun 21 17:05:49 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"This is good news. Flatwoods Job Corps will stay open. https://t.co/z4y9ynUZWV","date":"Thu Jun 20 02:00:30 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.17.19 Topics: Setting the Table for Economic Growth; Michelle Jenkins https://t.co/mw7ZvHfj9y","date":"Mon Jun 17 14:51:39 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Father’s Day to all dads today.","date":"Sun Jun 16 17:26:26 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I welcomed @SecretaryRoss to Salem and discussed commerce and economic development at Wabtec Graham-White, a manufacturer for the transportation industry since its founding by the Frantz family in 1914. Thanks to Director of Operations Dan Hughes and the facility for hosting us. https://t.co/ya3VpTUcc0","date":"Fri Jun 14 15:25:38 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.10.19 Topics: The Wrong Approach to Immigration Reform; D-Day Part III https://t.co/k7EwlrW3UW","date":"Mon Jun 10 14:41:31 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today I am headed to France to honor the heroes of D-Day. https://t.co/hBO9czHSkV","date":"Wed Jun 05 13:31:35 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.31.19 Topics: Rare Earth Elements; D-Day Part II https://t.co/iY4bLOBDW7","date":"Fri May 31 21:03:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Had a productive day of meetings with Clifton Forge Town Manager Darlene Burcham and Craig County Administrator Dan Collins. https://t.co/ZMdgCY8hJF","date":"Wed May 29 20:57:28 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Memorial Day, we honor the men and women of our Armed Forces who died in the service of our country. We will never forget their sacrifice. https://t.co/Vsi2Bk9YbO","date":"Mon May 27 13:22:11 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.24.19 Topic: Honoring D-Day This Memorial Weekend https://t.co/OAWxHI6YeD","date":"Fri May 24 16:54:22 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"It was an honor to meet some of the unsung heroes of World War II: sailors of the U.S. Merchant Marine and the women who built their ships. https://t.co/sq0eWZDCW1","date":"Wed May 22 22:31:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.20.19 Topics: Robocalls, Taxes, and Prescription Drugs, Oh My! https://t.co/zVPCWD6ACX","date":"Mon May 20 15:11:54 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"This National Police Week, we honor and remember the men and women of law enforcement who sacrificed their lives in the line of duty. Shielding our communities from harm can come at a cost, and many police officers have paid the ultimate price. https://t.co/5z1e6B2BrF","date":"Wed May 15 13:17:33 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I had the chance to visit Blue Ridge Cancer Care in Blacksburg yesterday and learn more about the work they do. https://t.co/I8ynysNEJG","date":"Tue May 14 14:28:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.13.19 Topic: From Orwell to Mueller: Fiction Becomes Fact https://t.co/QIPSWEzUyU","date":"Mon May 13 15:21:20 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Mothers Day to all moms today, including my own. Thank you for all that you do.","date":"Sun May 12 14:46:03 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to be recognized by ⁦@ACUConservative⁩ with their award for Conservative Excellence. https://t.co/CFX3ofU9ar","date":"Tue May 07 23:46:14 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 5.6.19 Topic:\nResist Socialism https://t.co/9GXXSxHtVh","date":"Mon May 06 16:08:16 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is the National Day of Prayer. Our country has often turned to prayer throughout its history, and we do so again today in thanks for the blessings we enjoy and to seek strength and guidance through hardships. https://t.co/mDwZZjw93u","date":"Thu May 02 21:30:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"At this morning's Holocaust remembrance ceremony in the Capitol, I read the following names:\nStefan Flaszczynski\nAaron Herzbach\nGolda Katz\nToba Borys\nHendel Wajsberg\nMarjan Mazurek\nFeigel Lipszyc\nHersh Lipszyc\nBreindel Altman\nHermanne Tanzer","date":"Thu May 02 13:33:12 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Horrific shootings at synagogues have targeted people gathered to worship. They were perpetrated by individuals with fringe ideas, but anti-Semitism was also recently seen in a cartoon published by one of the country’s foremost newspapers.","date":"Thu May 02 12:42:35 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"If we are truly to remember the lessons of the Holocaust, we must recommit now to ending the hate of anti-Semitism.","date":"Thu May 02 12:42:35 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"On this Holocaust Remembrance Day, #WeRemember the six million Jewish and other victims of Nazi tyranny. Although Hitler’s regime has been consigned to an ignominious place in history, recent events have shown that anti-Semitism still lingers.","date":"Thu May 02 12:42:35 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.29.19 Topic: Technology Investment and Jobs https://t.co/FoNgRWXnPc","date":"Mon Apr 29 15:09:07 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Relieved to hear that all are safe at Cyclops Cave. Thanks to the first responders who skillfully handled the rescue.","date":"Sun Apr 28 22:30:40 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Tomorrow is Prescription Drug Take Back Day. Unused or expired medications can be dangerous. #TakeBackDay safely collects and disposes of drugs so they will not be abused. Visit https://t.co/SCU2TOPJbI to find participating locations in and around the Ninth District. https://t.co/CKVzh5ejxZ","date":"Fri Apr 26 18:22:31 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Easter! https://t.co/AEQjNpc4Im","date":"Sun Apr 21 12:34:02 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Best wishes to all celebrating Passover starting tonight. https://t.co/DKmitKP9g6","date":"Fri Apr 19 21:27:40 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith’s Weekly E-Newsletter 4.19.19 Topic: Hope and Redemption https://t.co/iBcGskvuSV","date":"Fri Apr 19 14:48:30 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the Special Counsel’s report: https://t.co/wBNBz2GMhi","date":"Thu Apr 18 17:08:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to be speaking this morning in Floyd at the Citizens Rural Broadband Initiative Breakfast. https://t.co/iSJAR2pEBa","date":"Thu Apr 18 14:48:16 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today, we remember and grieve the 32 lives lost and the lives irreversibly altered at Virginia Tech twelve years ago.","date":"Tue Apr 16 13:11:01 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Don't let anyone tell you otherwise: Americans across the board benefited from the Tax Cuts and Jobs Act. https://t.co/8YsBJJmgmA","date":"Mon Apr 15 20:53:55 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.15.19 Topic: “Trust Us” Isn’t Good Enough on Drug Prices https://t.co/TGkti8zCDq","date":"Mon Apr 15 18:24:59 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to @NRCCedu for giving me a tour of their labs this morning. https://t.co/34Dor5UqZW","date":"Thu Apr 11 15:15:22 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Serving our country is a high calling, and it is an honor for me as a Congressman to nominate a number of young men and women who want to make that commitment to the United States Service Academies. Read more &gt; &gt; https://t.co/9ckqT6tT9o https://t.co/rYibLlJsrD","date":"Tue Apr 09 17:48:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.8.19 Topic: The Radford Arsenal: A Vital Mission https://t.co/hmEwPVkW9U https://t.co/n8jK8P3G0r","date":"Mon Apr 08 18:14:40 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"It was an honor to have you in the Ninth District!","date":"Fri Apr 05 16:10:13 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I discussed agricultural policy with the Virginia Cattlemen's Association this morning. https://t.co/VhelwALwnt","date":"Wed Apr 03 20:28:09 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I support protecting people with preexisting conditions. I’ve voted for these protections before. Instead of Democrat show votes like H. Res. 271, I am ready to work on real legislation that improves health care and includes these protections.","date":"Tue Apr 02 17:57:20 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 4.1.19 Topic: The Ninth District: On the Cutting Edge of Biological Engineering for Health Care https://t.co/r5xjG41avx","date":"Mon Apr 01 16:27:43 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to be at the Whitetop Mountain Maple Festival this morning at the old Mt. Rogers School. https://t.co/zaHgkgsT0C","date":"Sat Mar 30 15:26:11 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My office sponsors Academy Day each year so young men and women can learn more about serving their country in the Armed Forces. This year's Academy Day is on Saturday, April 6 in Wytheville. Learn more: https://t.co/CO6iesy0wl","date":"Wed Mar 27 16:47:22 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"The team from Virginia Tech's Feed the Future Innovation Lab for Integrated Pest Management came by my office today to discuss their work. https://t.co/gn7BnOxBxV","date":"Tue Mar 26 16:03:16 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.22.19 Topic: Promising Developments in Research https://t.co/5QuVLQwH2S","date":"Fri Mar 22 16:20:22 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Read my op-ed in the Roanoke Times, \"Innovation will reduce carbon emissions\"  &gt; &gt; https://t.co/XL5iTOF5Zo","date":"Wed Mar 20 16:51:31 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.18.19 Topics:\nFDA Commissioner Gottlieb; Condemning the Attacks in New Zealand https://t.co/2Bn1C70FnR","date":"Mon Mar 18 14:25:12 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to Farm Credit of the Virginias for coming by my office this afternoon to discuss the agricultural economy. https://t.co/aNEH6NMWKp","date":"Wed Mar 13 18:07:01 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.11.19 Topics: We Must Call Out Anti-Semitism; Real Health Reform is Still Needed https://t.co/uZZ9js1f4e","date":"Mon Mar 11 16:29:51 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congrats to Northside High School and longtime head coach Billy Pope on winning the class 3 boys basketball state championship!","date":"Thu Mar 07 21:26:42 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"It is unacceptable for Nicolas Maduro to detain Cody Weddle, an American citizen and a journalist, reporting to the world on what is happening in Venezuela. This action must not stand, and I demand Cody’s immediate and safe release.","date":"Wed Mar 06 18:04:12 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 3.4.19 Topics: Jobs in the Energy Sector; Congressional Art Competition https://t.co/V3J5suWSgP","date":"Mon Mar 04 20:23:58 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I voted to protect the Second Amendment and oppose H.R. 8. H.R. 8 would not prevent gun violence. It would make the exercise of Second Amendment freedoms and the right to self-defense more difficult for law-abiding citizens.","date":"Wed Feb 27 21:06:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the Senate vote on the Born-Alive Abortion Survivors Protection Act: https://t.co/wDeznFwZwV","date":"Tue Feb 26 00:20:45 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.25.19 Topics: Insulin Prices; A Live Legacy of the Revolution https://t.co/ymTxAkEuF3","date":"Mon Feb 25 19:00:25 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"This morning in Salem I held a meeting about juvenile diabetes. It included children who have the condition and told me their story. https://t.co/zbblk6YJhV","date":"Fri Feb 22 17:57:33 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today’s announcement of $459,764 for broadband deployment is great news. It will provide a significant boost to economic development and open doors to new opportunities for the people of Bland County. https://t.co/qccdRpKkc8","date":"Thu Feb 21 18:33:35 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.18.19 Topic: The Border Wall Emergency, and Anti-Semitism Has No Place in America https://t.co/xlKAjIyRO4","date":"Mon Feb 18 16:12:21 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"This declaration will help prevent the illegal trafficking into our country of deadly drugs, the illegal and inhuman trafficking of sex slaves, and other illegal actions being undertaken by Mexican cartels at the southern border. https://t.co/wzmLz9xc8x","date":"Fri Feb 15 16:28:30 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good to meet with Dink Willis and Brian Shoemaker from USP Lee yesterday. https://t.co/cDcFG665Je","date":"Tue Feb 12 14:25:57 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.11.19 Topic: No Green Light for the Green New Deal https://t.co/kP0Ekshhxo","date":"Mon Feb 11 18:30:58 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on #SOTU https://t.co/dGOL4B4DVu","date":"Wed Feb 06 03:48:26 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am sorry to learn that Trooper Lucas B. Dowell of the Virginia State Police was killed in the line of duty. He was a native of Chilhowie and had served in the State Police since 2014. His family is in my thoughts and prayers. May we never forget his sacrifice.","date":"Tue Feb 05 15:29:03 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 2.4.19 Topics: Did Your Power Stay On During the Cold Spell? Thank Coal; Prescription Drug Prices: A Bipartisan Priority https://t.co/ixamxMLVKm","date":"Mon Feb 04 17:16:37 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Great to meet with some of the board members and staff and tour the facility at Warm Hearth Village in Blacksburg. https://t.co/CXwYSxfDud","date":"Thu Jan 31 22:22:15 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.28.19 Topics: Fiscal Restraint; The Border Crisis is an Environmental Crisis, Too https://t.co/UB2M9hbTvi","date":"Mon Jan 28 16:25:12 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we honor Dr. Martin Luther King Jr. He led the civil rights movement through his eloquence and his commitment to nonviolence, urging Americans to live up to our best ideals. On this day, let us remember his life and the noble truths for which he advocated. https://t.co/4Gy2C7gVx4","date":"Mon Jan 21 13:56:01 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.18.19 Topics: Partial Government Shutdown; Committee Assignments https://t.co/StoBlPO58d","date":"Fri Jan 18 16:53:41 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.14.19 Topic: Facts About the Southern Border https://t.co/nFzUyNJMsu","date":"Mon Jan 14 19:14:47 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good to talk to constituents last night on my first regional telephone town hall of the year. Over the coming weeks, this opportunity will be available for all jurisdictions of the Ninth District. https://t.co/9O83w3bZ1q","date":"Fri Jan 11 14:52:44 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today is National Law Enforcement Appreciation Day. Thanks to all the law enforcement officials working around the clock to keep our communities safe. https://t.co/6oYclrbFFx","date":"Wed Jan 09 16:23:36 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 1.7.19 Topic: Breaking the Rules\nhttps://t.co/h1Dr2WACDp","date":"Mon Jan 07 15:36:08 +0000 2019","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.31.18 Topic: 1619 and Today\nhttps://t.co/VGhoF8aPhl","date":"Mon Dec 31 15:11:49 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Peace on earth, good will to men! Best wishes for a safe and merry Christmas. https://t.co/kwXFudylT7","date":"Tue Dec 25 14:11:49 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.21.18 Topic: Christmas Traditions https://t.co/NEj2CrFclc","date":"Fri Dec 21 22:35:53 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Last night I spoke on the House floor about border security. We need to protect our borders and protect our laws. https://t.co/GWVXTWcgcv","date":"Thu Dec 20 14:03:14 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.17.18 Topic: Big Stone Wall https://t.co/gVBQckAZUv","date":"Mon Dec 17 15:31:41 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Thanks to ⁦@RedCross⁩ for sponsoring #HolidaysforHeroes. I stopped by this morning to write holiday greetings to our service members stationed around the world. https://t.co/oMzjJDstHR","date":"Tue Dec 11 16:18:43 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 12.10.18 Topics: Help for Sexual Assault Victims; The Greatest Generation https://t.co/IupM2Y1BXj","date":"Mon Dec 10 15:21:06 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"On December 7, 1941, Imperial Japanese naval and air forces launched a surprise attack on the U.S. military base at Pearl Harbor. 2,403 lives were lost in the attack, which drove America into World War II. Seventy-seven years later, we remember the date which will live in infamy.","date":"Fri Dec 07 14:04:53 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Glad to attend today's big announcement in Roanoke of the Fralin Biomedical Research Institute at VTC. https://t.co/x3dODII4VQ","date":"Thu Dec 06 18:11:00 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"My statement on the death of former President George H.W. Bush: https://t.co/f1RNXD0vah","date":"Sat Dec 01 14:18:47 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.30.18 Topic: A Sad Subject\nhttps://t.co/dcXeEYS25J","date":"Fri Nov 30 20:53:37 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.23.18 Topic: Job Growth in the Ninth District https://t.co/7qLpdakHUo","date":"Fri Nov 23 21:32:45 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"May you and your family have a blessed and peaceful Thanksgiving.","date":"Thu Nov 22 20:09:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.16.18 Topic: Two Churches and Thanksgiving https://t.co/FVBENMclxb","date":"Fri Nov 16 21:47:59 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today’s grant announcement is great news for homes and businesses in Scott County. I was pleased to have supported this $3,000,000 investment, which will open doors to new opportunities. https://t.co/achBgr8JEY","date":"Tue Nov 13 17:47:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today we honor the men and women who have served our country in the Armed Forces. Those who sacrificed to protect the American way of life have earned our everlasting gratitude.","date":"Sun Nov 11 13:41:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"At the eleventh hour on the eleventh day of the eleventh month 100 years ago, the guns fell silent. That event was later commemorated as Armistice Day, and today we know it as Veterans Day.","date":"Sun Nov 11 13:41:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 11.9.18 Topic: Veterans Day and Unfinished Business for the 115th Congress https://t.co/zQs0BYW3Fm","date":"Fri Nov 09 19:28:04 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.29.18 Topic: Next Steps in the Fight Against Opioids https://t.co/iaTDgdC1g5","date":"Mon Oct 29 20:51:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I would also like to express my gratitude to the first responders who are on the front lines when cowardly attempts to silence political speech are made.","date":"Wed Oct 24 16:43:39 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Violence is never acceptable, but it is particularly appalling when it occurs in place of the debate and deliberation upon which self-government depends.","date":"Wed Oct 24 16:43:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"We can disagree strongly yet civilly in the public square and at the ballot box, but violence directed against political opponents has no place in a free society.","date":"Wed Oct 24 16:43:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am glad that President Trump has signed into law my legislation making commonsense reforms to licensing for closed-loop pumped storage hydropower projects. Read more: https://t.co/nbskOV84Cj","date":"Tue Oct 23 20:37:54 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.22.18 Topics: Prescription Drug Costs; Good News for Manufacturing https://t.co/vphKx9vuFh","date":"Mon Oct 22 16:24:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.15.18 Topics: Health Tidbits; Flu Season https://t.co/fQffDpHQQa","date":"Mon Oct 15 16:11:59 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Project Intersection industrial site in Norton is in a great position to attract new manufacturing and industrial operations to the coalfields. Today’s ARC grant provides additional funding for developing the site. https://t.co/14F0NZmwgU","date":"Thu Oct 11 18:21:58 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Closed-loop pumped storage hydropower is a source of renewable energy that can be harnessed with infrastructure, including abandoned mines. Read more: https://t.co/UF8AK8knGu","date":"Wed Oct 10 16:39:38 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.5.18 Topic: Energy and Commerce Work https://t.co/LdHPXe2MP8","date":"Fri Oct 05 17:04:03 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Attended the Bristol Chamber of Commerce Breakfast this morning. https://t.co/WzsxTQ1NHG","date":"Fri Oct 05 14:26:58 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I was proud to support the STOP School Violence Act. Roanoke County Public Schools will receive $133,665 for training to prevent violence and to care for those coping with mental health emergencies. https://t.co/YylTeG96gl","date":"Wed Oct 03 15:35:41 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Attended the GO Virginia Region 1 meeting in Grundy this morning. https://t.co/yyOpkSBJtu","date":"Tue Oct 02 20:41:11 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 10.1.18 Topic: Appalachia: Cradle of Music https://t.co/MWUTa06GBw","date":"Mon Oct 01 20:24:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The opioid crisis is the most urgent health crisis of our time, as many residents of the Ninth District know from painful personal experience. Acting to alleviate it has been a priority of the House of Representatives as well as of mine.\n\nRead more here: https://t.co/I9oel6Lg2l","date":"Fri Sep 28 16:53:33 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I will be sponsoring my 2018 Service Academy Day on Saturday in Wytheville, and I urge interested Ninth District students to attend. Learn more: https://t.co/eaTOCYBhO9","date":"Thu Sep 27 16:56:21 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"WestRock’s $248.4 million investment in improving its manufacturing operation is great news for the Alleghany Highlands. The company is a staple of our area’s economy. This new investment reaffirms that fact and shows a long-term commitment to the area. https://t.co/OdzJlnB53O https://t.co/6kp99PeXdY","date":"Tue Sep 25 15:45:28 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.24.18 Topic: Cutting Red Tape https://t.co/VvJ2mMeLNR","date":"Mon Sep 24 19:01:16 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Celebrated good news in Henry County yesterday. Monogram Foods is investing $30 million in an expansion that will create 300 new jobs. https://t.co/81k2Nz8r6M","date":"Thu Sep 20 13:28:33 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Learned about research and development taking place at the Virginia Tech Corporate Research Center during today's #VTCRCMediaDay. https://t.co/3fF1DtbQ4Y","date":"Tue Sep 18 18:53:34 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 9.17.18 Topics: Bipartisan Health Care Legislation; Good News for American Energy https://t.co/cPikydNzKb","date":"Mon Sep 17 18:41:48 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Closed-loop pumped storage hydropower is a technology with great promise for Southwest Virginia. My legislation streamlines federal permitting to prevent red tape from obstructing the benefits of closed-loop pumped storage hydropower projects. https://t.co/hljl140kyG","date":"Thu Sep 13 18:09:33 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Good to see Dan Boyer of Galax, a member of the Veterans of Foreign Wars' National Legislative Committee. https://t.co/qwxBWzaYKx","date":"Wed Sep 12 22:04:10 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"President Trump has declared a state of emergency in VA in response to a request made by Gov. Northam and endorsed by the congressional delegation. This action provides federal assistance as we prepare for and respond to Florence. https://t.co/QFgz6LqkvU","date":"Tue Sep 11 20:30:56 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Do not walk, swim, or drive through flood waters. Turn around, don’t drown. https://t.co/SSaewbuoNq","date":"Tue Sep 11 14:02:46 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Also, don’t forget to check in on your family, friends, and neighbors who may need some extra help. Does anyone you know have a medical device that depends on electricity? Have a backup plan in the event of a power loss and other contingencies.","date":"Tue Sep 11 14:02:45 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Our part of Virginia will likely face heavy rain and winds from Hurricane Florence. Be prepared. Pay attention to the forecast and emergency updates, and make sure you have enough food, water, medication, batteries, and other supplies to last for a few days if necessary.","date":"Tue Sep 11 14:02:44 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"We can never forget September 11 as long as this nation endures https://t.co/7Mb42akeLX https://t.co/LNnfpqPnWO","date":"Tue Sep 11 13:12:04 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Topic: An Open Letter to the Social Media/Tech Industry https://t.co/3SqOrguVME","date":"Fri Sep 07 19:15:34 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"This $500,000 investment in outdoor recreation in the Coalfields will make it easier to access all that this beautiful part of our Commonwealth has to offer, and they will support new businesses and 54 new tourism jobs. https://t.co/pRiBtYxZ9N","date":"Fri Sep 07 17:22:13 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"FEMA’s announcement of $90,000 to the Patrick Springs Volunteer Fire Department is welcome news. With these funds, new protective equipment will be critical in keeping the firefighters of Patrick Springs safe as they protect our communities. https://t.co/xtNEiwvdNA","date":"Fri Sep 07 16:31:14 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"FEMA’s announcement of $178,616 to the Fries Fire Department is welcome news. With these funds, they will be able to recruit new members for the department. The support provided will be critical in keeping Fries and surrounding areas safe. https://t.co/1U4LGmICpw","date":"Fri Sep 07 15:47:14 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Met today with members of the Oncology Nursing Society, including Catherine Mowrey of Blacksburg. https://t.co/5m9Nhd3epu","date":"Thu Sep 06 20:44:11 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am honored to be recognized for my efforts to protect jobs and fight against regulatory and administrative overreach. I will continue working to ensure we have policies in place that help Ninth District businesses to flourish. https://t.co/kM1WbsvAfZ https://t.co/i9zu3Ftc6E","date":"Fri Aug 31 14:09:00 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"This Rural Development investment will support the Wise Public Works Department’s efforts to improve sewer utilities. The awarded grant will be put towards the purchase of a new, properly equipped, service truck and bed for the town's sewer department. https://t.co/WH00HYiPHQ","date":"Thu Aug 30 14:54:25 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"This investment in the work of the Public Guardian Partnership in Alleghany will improve the quality of life for senior citizens in our communities. The $14300 grant will be used to purchase a vehicle for the elderly population in need of home visits. https://t.co/cNq86Xe0Fu","date":"Wed Aug 29 22:02:16 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"These grants will provide community coalitions funding to prevent youth substance use and support the good work of SATIRA and Piedmont Regional Community Services to bring together 9th District communities in support of youth drug use prevention efforts. https://t.co/Oxs6lzgDBz","date":"Wed Aug 29 19:06:12 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The town of Chilhowie, Virginia was awarded $232,280.00 in grant funds for the construction of a town farmers’ market. Thanks to this Rural Development grant, our communities will enjoy greater economic opportunity. https://t.co/nOomQQs269","date":"Wed Aug 29 18:12:46 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The town of Dungannon, Virginia was awarded $27,000.00 in grant funds for the improvement of a town farmers’ market within an existing structure in Dungannon. Thanks to this Rural Development grant, our communities will enjoy greater economic opportunity. https://t.co/MlOnlvzy8t","date":"Wed Aug 29 18:12:15 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The town of Hillsville, Virginia was awarded $84,720.00 in USDA grant funds for the construction of a building to hold a town farmers’ market. Thanks to this Rural Development grant, our communities will enjoy greater economic opportunity. https://t.co/7HRMCQHqkh","date":"Wed Aug 29 18:11:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.27.18 Topic: Reclaiming Damaged Land for New Use https://t.co/lhhbK3HYnH","date":"Mon Aug 27 18:08:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"My thoughts are with his family in this time.","date":"Sun Aug 26 14:02:08 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I am saddened to hear of the death of Senator John McCain. He showed great courage while enduring terrible hardship as a prisoner of war in Vietnam, and he continued to serve his country with distinction as a congressman, senator, and presidential candidate.","date":"Sun Aug 26 14:02:08 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"This site in Dickenson County will be restored and become part of the Cranes Nest Trail. Thanks to the support provided by this grant, the trail will be more accessible for the enjoyment of visitors seeking to hike, bike, or ride horses. https://t.co/lgEHCG4Cpx https://t.co/FjkhKz2P5U","date":"Thu Aug 23 19:12:22 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Over $3 million will be provided to ready a site for industrial use adjacent to additional sites being prepared for similar use. The project will create jobs and lead to new economic activity in Russell County. https://t.co/H7hdIQF04c https://t.co/4WcyKm9o6b","date":"Tue Aug 21 17:18:21 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Visiting Covington and speaking with constituents today. https://t.co/orrWAXf9lU","date":"Mon Aug 20 19:51:01 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.20.18 Topic: The Farm Bill - Supporting Farming for Food and Industry https://t.co/ZbGQRfrJNX","date":"Mon Aug 20 16:47:48 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Celebrated the arrival of Speyside Bourbon Cooperage in Atkins. https://t.co/UAXLg9OFbQ","date":"Fri Aug 17 20:51:03 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congratulations to Kolbe Bush of Abingdon for earning @theaward     Bronze Medal! https://t.co/zCMgZPPvBH","date":"Thu Aug 16 22:49:34 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The cleanup of damaged and abandoned land presents great opportunities for economic development and community improvement. Securing funding for reclamation projects has been a priority of mine in the House of Representatives. https://t.co/62oZezRY5P https://t.co/0W7Qym0Ftt","date":"Thu Aug 16 20:03:44 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Visited Lee County Hospital this afternoon. https://t.co/LohpC4OHB9","date":"Tue Aug 14 22:31:42 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.13.18 Topic: Health Care: A 2018 Checkup https://t.co/3zZ601fSiV","date":"Mon Aug 13 18:57:09 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Today’s announcement means that more health care services will be available in Dickenson County. ARC’s grant supports the good work of the Health Wagon in meeting the need for vital medical, dental, and vision care services among underserved populations. https://t.co/tyR0wFubbj","date":"Tue Aug 07 17:18:54 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 8.6.18 Topics: Help for Veterans; Volunteerism https://t.co/cJsxzVVKo0","date":"Mon Aug 06 22:00:08 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"E. Dillon &amp; Company of Russell County celebrated its 150th anniversary over the weekend. I attended the festivities along with Senator Ben Chafin and Delegate Todd Pillion. https://t.co/Nv2YeZSHco","date":"Mon Aug 06 14:54:19 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"We are seeking answers in an effort to understand how drug manufacturer practices may have affected the course of the opioid crisis. https://t.co/GIEOx8VQua","date":"Fri Aug 03 14:46:28 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Talked with the health care professionals of LewisGale Hospital Montgomery in Blacksburg during my visit today. https://t.co/q4oREXMF6t","date":"Tue Jul 31 18:28:33 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to present American flags to veterans in Martinsville this afternoon. https://t.co/vnSDS1ZJFW","date":"Mon Jul 30 21:30:15 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Press Glass is the latest company to recognize that Southside Virginia has the assets for manufacturing to thrive. Its plans to create 212 jobs and invest $43.55 million represent a significant boost for economic development in the area. https://t.co/iqM2467giV","date":"Mon Jul 30 16:25:31 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Met with representatives of Lee County Hospital this evening. https://t.co/aJekGisX1E","date":"Wed Jul 25 23:31:55 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Educational programs should provide students with the skills they need to thrive in the workforce. Career and technical education programs provide a vital way to prepare prospective employees for jobs. https://t.co/XOUDwC2D0m","date":"Wed Jul 25 19:37:41 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.23.18 Topic: Progress on Rural Broadband https://t.co/67XvNe8OhY","date":"Mon Jul 23 20:16:39 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House of Representatives adopted an amendment I co-sponsored to the Interior and Environment appropriations bill to continue funding for a pilot project to reclaim abandoned mine land, distributing $10 million to Virginia.\nhttps://t.co/a17zQ3aQrh","date":"Wed Jul 18 21:18:06 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to receive the ⁦@FreedomWorks⁩ FreedomFighter Award for supporting economic freedom and individual liberty. https://t.co/eIrc3K2kuO","date":"Tue Jul 17 15:46:53 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.16.18 Topic: A Lawyer’s Lament\nhttps://t.co/oVlixSafzL","date":"Mon Jul 16 16:12:57 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The House Energy and Commerce Committee today advanced bills in a full committee markup, including H.R. 2345, the National Suicide Hotline Improvement Act. Those with thoughts about taking their own lives need to know that other people are ready to help.\n\nhttps://t.co/lUxol8R1Ov","date":"Thu Jul 12 19:07:43 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"The Energy and Commerce Committee made progress in a bipartisan manner on our priorities today, including connecting more Americans to broadband.\n\nhttps://t.co/zfTKRngJa1","date":"Thu Jul 12 18:52:35 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"For those suffering from serious illnesses, palliative care can bring comfort. I was pleased to support the bipartisan Palliative Care and Hospice Education and Training Act as it advanced out of the Energy and Commerce Committee today.\nhttps://t.co/xCSK6ufAxv","date":"Thu Jul 12 18:32:17 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Met with Farm Credit of the Virginias to discuss agricultural issues this morning. https://t.co/ElAQjsxBX5","date":"Wed Jul 11 18:39:43 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.9.18 Topic: No, We're Not Cutting Social Security\nhttps://t.co/pjTxB2frrs","date":"Mon Jul 09 19:25:07 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"While traveling throughout the Ninth District today, I toured the Norton Community Hospital. https://t.co/eXcpToGRvu","date":"Fri Jul 06 20:58:00 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I enjoyed meeting with Ninth District constituents during traveling office hours in Norton today. https://t.co/PSmjgzKgI6","date":"Fri Jul 06 20:01:01 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I accompanied Governor Northam in Dungannon today as the Scott County Economic Development Authority announced a $3.76 million investment by Mountain Top Timber Products to bring 50 new jobs to the county for the Virginia-grown timber industry. https://t.co/efM9HbG5B6","date":"Fri Jul 06 19:13:25 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Happy Independence Day!\n\nRead on to learn more about the familiar names that link the American Revolution to Southwest and Southside Virginia: https://t.co/POPpEzjni8 https://t.co/Qm9J9bfTWf","date":"Wed Jul 04 12:51:21 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 7.2.18 Topic: The Real Independence Day? https://t.co/58pq0O5Yyw","date":"Mon Jul 02 14:41:04 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Joined Lee County’s 4th of July celebration in Jonesville yesterday. https://t.co/XEDcyWowkH","date":"Sun Jul 01 15:58:49 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Honored to speak at Andrew Lewis Day in Salem. Among the attendees were Bob Bushnell and Lewis Pitzer, descendants of Andrew Lewis. https://t.co/oSUQ67OVE8","date":"Sat Jun 30 18:01:54 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Griffith Dam Bills Pass Senate https://t.co/HjieaZU0tS","date":"Fri Jun 29 15:35:12 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"This Rural Development funding is good news for SWVA. Norton &amp; Clintwood will be able to replace their older police vehicles. The more modern equipment provided by these grants and loans will support the work of our police officers &amp; enhance public safety https://t.co/hG51WHiy7y","date":"Wed Jun 27 22:42:09 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Had a good visit with Buchanan County Supervisor Trey Adkins this afternoon. https://t.co/8fu3MRUGQm","date":"Tue Jun 26 22:46:44 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"See when Ninth District staff will hold traveling office hours in your jurisdiction for July: https://t.co/WvDVMMhBsX","date":"Tue Jun 26 18:58:51 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.25.18 Topics: Farm Bill; House Action on Opioids https://t.co/jX5oA9Ii9u","date":"Mon Jun 25 18:41:48 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Toured the William King Museum of Art in Abingdon today. Thanks to the museum’s director, Betsy White, for showing me around. https://t.co/AfncxThhgD","date":"Sat Jun 23 22:59:48 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Together, the House has acted to support the people in our communities struggling with opioid addiction. https://t.co/bDv8t7nkCD","date":"Fri Jun 22 16:11:46 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Griffith Statement on “Goodlatte Bill” to Reform Immigration https://t.co/wLJgMwWQkI","date":"Thu Jun 21 18:59:46 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I met with members of the National Federation of Independent Businesses today and discussed the benefits of the Tax Cuts and Jobs Act for small businesses. https://t.co/F9dflXm8aT","date":"Wed Jun 20 21:52:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.15.18 Topic: Working Across the Aisle to Solve the Opioid Problem https://t.co/ECenrvWFMf","date":"Fri Jun 15 19:49:15 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Griffith Applauds Award of $50,000 Grant to Fight Drug Abuse in Roanoke County https://t.co/dTDmH5buqf","date":"Fri Jun 15 17:08:58 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Griffith Bill to Combat Opioid Crisis Passes House https://t.co/K1MofKOJVr","date":"Tue Jun 12 22:57:17 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Congressman Griffith's Weekly E-Newsletter 6.11.18 Topic: America’s Energy Future Depends on Research https://t.co/VRXFYXcTiG","date":"Mon Jun 11 18:44:53 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"Griffith Applauds ARC Grant for Buchanan County https://t.co/4H1ZsJYs11","date":"Mon Jun 11 14:50:01 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I’m working on a bipartisan bill to improve mental heath care access for our children. https://t.co/NLrGYZmQHi","date":"Fri Jun 08 14:41:36 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I met with Virginia Tech's Dr. Roe-Hoan Yoon this afternoon to discuss rare earth elements, which could be a part of Southwest Virginia's economic future. https://t.co/sQQXn5kskW","date":"Wed Jun 06 19:05:06 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"I had the honor of knowing one of the heroes who came back, Bob Slaughter, and introducing him to my daughter. Bob and many of his generation are gone now, but we will always remember the brave soldiers who fought on D-Day for our freedom. https://t.co/IUFDHjogx2","date":"Wed Jun 06 14:15:24 +0000 2018","user_id":"234057152"},{"handle":"RepMGriffith","text":"These soldiers included the Bedford Boys of the 116th Infantry Regiment of the 29th Division of the Virginia National Guard, headquartered in Roanoke, and nineteen of them did not survive the day.","date":"Wed Jun 06 14:15:24 +0000 2018","user_id":"234057152"}]