[{"handle":"RepMikeRogersAL","text":"Americans struggling to afford gas would disagree with out-of-touch millionaire John Kerry.","date":"Thu Jun 16 19:01:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our Strategic Petroleum Reserve is for emergencies but Biden has been depleting it for political gain while refusing to unleash the production of American energy.","date":"Thu Jun 16 15:09:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There you have it – the culprit is President Biden and his policies. \n\nPresident Biden needs to stop playing the blame game and unleash the American production of energy.","date":"Thu Jun 16 14:46:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden can lie all he wants to but Americans know the truth – Joe Biden has done nothing but fail Americans.","date":"Wed Jun 15 20:52:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @USArmy for dropping off these amazing cupcakes! Happy 247 years! https://t.co/SVVV17ZB3o","date":"Wed Jun 15 20:24:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s failed policies are to blame for the rise in gas prices. \n \nThe solution is simple: unleash the American production of energy.\n \nBut Biden would rather beg foreign countries for oil &amp; gas.","date":"Wed Jun 15 20:11:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wow! Great work by @AuburnU's Will Jordan! \nhttps://t.co/BtmTu0eEDy","date":"Wed Jun 15 19:46:56 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There’s no reason that U.S. taxpayer dollars should be going to organizations that take their marching orders from the Chinese Communist Party.\n\nThat’s why I introduced legislation to withdraw the U.S. from the useless UN and worthless WHO. \nhttps://t.co/0FmA73NyON","date":"Tue Jun 14 19:25:11 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Why won’t Biden unleash the production of American energy? Americans should not have to spend $160 more a month just to fill up their cars.","date":"Tue Jun 14 19:15:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Insane. The left wants to censor anyone who disagrees with their Green New Deal socialism. \nhttps://t.co/gzayhAjn14","date":"Tue Jun 14 19:02:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"LET’S GO!! Congrats to @AuburnBaseball! #WarEagle","date":"Tue Jun 14 18:54:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden, Americans’ lives have changed for the worst. \n\nBiden’s reckless spending &amp; socialist policies have led to high inflation and high gas prices.\n\nIt’s obvious that Biden’s policies are hurting American families.","date":"Tue Jun 14 18:22:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The U.S. flag is a powerful symbol of freedom. This Flag Day, we pay tribute to the brave men and women who are currently serving and who have served in the U.S. Armed Forces to protect those freedoms. https://t.co/5Z4ceEw0Di","date":"Tue Jun 14 16:33:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"As we celebrate the @USArmy’s 247th birthday, we honor the brave men and women throughout our nation’s history who have selflessly answered the call to serve in the United States Army. It is because of their sacrifice that we are free. #AlwaysReady https://t.co/TesQd8mgNj","date":"Tue Jun 14 16:32:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Five years ago today, several of my Republican colleagues were nearly killed by a leftist attacker in a politically motivated assassination attempt.\n\n@SteveScalise nearly lost his life that day.\n\nPolitically motivated violence by the left must be called out and condemned.","date":"Tue Jun 14 15:50:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans know the economy is in a bad place.\n \nSo why doesn’t President Biden seem to understand that?\nhttps://t.co/hlTNaAXikg","date":"Fri Jun 10 19:02:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration has done more to help the CCP export slave labor solar panels than it has to help your family afford groceries.","date":"Fri Jun 10 18:02:23 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation has climbed again — rising to 8.6%.\n\nThis comes after the Biden administration wrongly claimed, \"the economy is in a better place than it has been historically.\"\n\nAmericans feel the pinch of inflation every day — the Biden administration can't lie their way out of it.","date":"Fri Jun 10 15:48:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s America consists of rising inflation, high gas prices, and bare shelves. https://t.co/rXQhivNqA6","date":"Fri Jun 10 15:22:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The rising price of gas under Joe Biden is putting Americans in difficult positions. We need to unleash the American production of energy.","date":"Thu Jun 09 20:38:34 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Tyler, Anna Louise, and Drake for their hard work and for spending their summer interning in my office!\n\nInterns are invaluable members of our team. I was glad to speak to a group of interns today about the great work they’re doing in their Congressional offices. https://t.co/LDHEJFKLRy","date":"Thu Jun 09 18:08:00 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"They hired an ABC exec to sensationalize this circus hearing and now they’re already selling their product on Amazon. \n \nThis tells you just how ridiculous Pelosi’s political witch hunt is. It’s all Democrat political theatre.","date":"Thu Jun 09 17:44:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden and Democrats need to condemn these vile acts of violence against the pro-life movement.","date":"Thu Jun 09 16:08:34 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Another example of why Congress must pass my legislation to withdraw the United States from the United Nations. \n \nThe UN is completely worthless and their anti-Israel bias is disgusting. \nhttps://t.co/xwAypJ4oJq","date":"Thu Jun 09 15:48:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The economy WAS in a historically better place under President Trump. \n \nPresident Biden has tanked the economy trying to see if he can beat Jimmy Carter's inflation rate.","date":"Thu Jun 09 12:38:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden admin encouraged protests outside the homes of SCOTUS Justices.\n\nSen Schumer threatened that Justice Kavanaugh 'will pay the price'.\n\nWhen will Biden and his fellow Democrats condemn the dangerous &amp; violent rhetoric that their own party has been pushing?","date":"Wed Jun 08 17:30:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas Prices under President Biden are out of control – just as he wants. \n\nPresident Biden doesn’t want to unleash the American production of energy to lower gas prices because it would hurt his socialist Green New Deal scheme. \nhttps://t.co/QnJgsVHuVT","date":"Tue Jun 07 17:12:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Yesterday marked @ChiefBPartridge’s 35th year of service with the @CityOfOxfordAL! Thank you for all you do for the community!","date":"Tue Jun 07 15:50:43 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden keeps failing Americans.","date":"Tue Jun 07 15:11:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good luck to Talladega’s Brian Hutton and Team Alabama in this year’s Special Olympics!\nhttps://t.co/Ta4tsML3Lm","date":"Tue Jun 07 14:56:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The UN has repeatedly proven itself to be an utterly useless organization &amp; the WHO lost all credibility when they chose to put public health second to the Chinese Communist Party.\n\nMy legislation would withdraw the U.S. from the UN &amp; WHO.\nhttps://t.co/0FmA73NyON","date":"Mon Jun 06 18:17:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Insane. We need to secure the border now!\nhttps://t.co/55vrTchEIu","date":"Mon Jun 06 17:45:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Yep. We have oil and natural gas here in the U.S. \n\nWhen will President Biden unleash the American production of energy?","date":"Mon Jun 06 17:37:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, we remember and honor the sacrifices made by the brave U.S. &amp; Allied troops who stormed the beaches of Normandy on D-Day.\n\n“The eyes of the world are upon you. The hope and prayers of liberty-loving people everywhere march with you.” — Gen. Dwight D. Eisenhower https://t.co/uRH98fxhpR","date":"Mon Jun 06 13:08:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s inflation is wreaking havoc on our economy.","date":"Thu Jun 02 17:57:45 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden needs to unleash the production of American energy.","date":"Thu Jun 02 16:19:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices keep climbing and President Biden still won’t unleash the production of American energy.","date":"Wed Jun 01 21:10:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"25 percent of Americans are delaying retirement due to Biden’s inflation. President Biden continues to fail Americans. \nhttps://t.co/8gpDRVhkoA","date":"Wed Jun 01 19:06:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Not even the grill is safe from Biden’s inflation. \nhttps://t.co/4EuqhhXRqr","date":"Wed Jun 01 18:19:28 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"\"Greater love has no one than this: to lay down one’s life for one’s friends.\" John 15:13\n\nPlease take today to remember the selfless heroes in our armed forces who gave their last full measure of devotion in protection of this great nation and our freedoms.\n\nFreedom is not free. https://t.co/QU3bQudv9l","date":"Mon May 30 11:04:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans can’t afford Biden’s inflation.","date":"Fri May 27 20:12:45 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"On day one, President Biden began dismantling the energy independence that President Trump built. Now, Americans are paying the price for Biden’s socialist policies.","date":"Fri May 27 18:19:44 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans are tired of paying insane prices for gas while Biden refuses to unleash the production of American energy.\nhttps://t.co/LMdmNwe2T4","date":"Fri May 27 17:32:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to these amazing students!\nhttps://t.co/SospdSkbF6","date":"Thu May 26 22:50:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The students at Ragland High School are a real example of how anyone, no matter their age, can effect positive change in their community. These students worked hard to make a difference and I was honored to advocate for this grant on their behalf.\nhttps://t.co/ESh2d6ccRe","date":"Thu May 26 19:19:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Savannah McCartney and Sydney Ezekiel, the 2022 Valedictorian and Salutatorian for Sylacauga High School!\nhttps://t.co/YJcnsHZt8Q","date":"Thu May 26 18:05:56 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wow! Great work by Anniston’s Kevin Daugherty!\nhttps://t.co/72SPwqTR7w","date":"Thu May 26 18:03:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The MAJORITY of Americans support Title 42. The Biden administration should listen.\nhttps://t.co/uJBs7JYQlw","date":"Tue May 24 19:00:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden then: “No ability for the oil industry to continue to drill.”\n\nBiden now: High gas prices are part of an \"incredible transition\" away from fossil fuels.\n\nTaking more of your hard-earned money is all part of his socialist plan.\nhttps://t.co/3HEKI62BLg","date":"Tue May 24 16:59:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Sounds like Biden just admitted higher gas prices are all part of his socialist plan.","date":"Tue May 24 16:02:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Seeing higher gas prices this weekend? You can thank Joe Biden. \nhttps://t.co/wO2UZs1YHX","date":"Mon May 23 21:02:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s runaway inflation means more money is coming out of your pocket just to buy the necessities.\nhttps://t.co/kzjiVHTWxw","date":"Mon May 23 19:32:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Parents deserve a say in their children’s education.","date":"Mon May 23 19:06:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Most Americans think we’re heading into a recession – Biden’s policies are to blame. \nhttps://t.co/gp9jk4DiZi","date":"Mon May 23 18:06:33 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration needs to take the crisis at our southern border seriously. \n \nFinish building President Trump’s wall and secure the border.","date":"Mon May 23 17:44:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden keeps failing Americans.","date":"Mon May 23 16:39:45 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today and every day we honor the countless sacrifices of the brave men and women who serve in the U.S. Armed Forces.\n \nU.S. service members are the greatest force for good the world has ever seen. https://t.co/pbCbaXY4dr","date":"Sat May 21 17:52:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Open borders mean that drug cartels have unfettered access to our communities. The majority of fentanyl in the U.S. comes across the southern border – but Biden has continued to ignore this crisis.","date":"Fri May 20 20:15:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to secure our border and finish building President Trumps border wall. https://t.co/kBMwarEAqM","date":"Fri May 20 19:35:43 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Of the nearly quarter of a million migrants that crossed our border last month (a record high), nearly half were expelled via Title 42. Biden wants to undo Title 42 next week, ignoring Congress, border communities, and border patrol agents. https://t.co/frGuKnWl7L","date":"Fri May 20 18:06:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Over 2.6 million illegal migrants have crossed our border since President Biden took office. Now, he’s looking to undo Title 42 NEXT WEEK even as the crisis worsens at our southern border. https://t.co/ojp67iuPKV","date":"Fri May 20 14:40:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s rising inflation and gas prices are making it harder for all Americans to make ends meet. https://t.co/1Or768gyGO","date":"Wed May 18 20:20:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Lifting Title 42 as record numbers of illegal migrants flood our borders is like walking outside in a Hurricane. It’s dumb.","date":"Wed May 18 20:03:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The far-left have intimidated Justices outside of their homes, attacked a pro-life office, and continue to try to bully and harass the Supreme Court into ignoring the Constitution for political purposes. \nhttps://t.co/4UXzQQMvSi","date":"Wed May 18 19:42:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Department of Homeland Security should take all funding meant for the ‘Ministry of Truth’ and direct it towards securing our border and finishing President Trump’s border wall.\nhttps://t.co/vtYVOEFYQv https://t.co/La5MqLk2t6","date":"Wed May 18 19:30:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A ‘pause’ of Biden’s Ministry of Truth isn’t enough. \n\nDHS should use all funding from Biden’s Ministry of Truth to finish building President Trump’s border wall and secure our border. \nhttps://t.co/FjACMFpyDB","date":"Wed May 18 19:17:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi forced through the House, a politically motivated sham impeachment resolution against President Trump. I proudly joined @RepMullin in cosponsoring legislation that would expunge the unjust second impeachment against President Trump.\nhttps://t.co/Mm3FczDwyD https://t.co/pFjR5gGAsf","date":"Wed May 18 18:52:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden wants to lift Title 42 next week as millions of illegal migrants pour across our border under his administration.\n \nWe need to keep Title 42 in place and finish President Trump’s wall.","date":"Tue May 17 20:54:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"While President Biden continues to restrict American energy production – folks in Alabama are being hit with record high gas prices.\n\nWe have the ability to produce oil and gas here in the USA – President Biden just needs to lift his socialist restrictions\nhttps://t.co/d0ekY8Uevh","date":"Tue May 17 20:30:23 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nearly a quarter of a million migrants came to our border in April alone. \n\nNearly 100,000 were expelled via Title 42 – which Biden wants to lift next month. \n\nCBP needs every tool available to stop the flow of illegal immigration.","date":"Tue May 17 20:13:56 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Read my full statement here ⬇️\nhttps://t.co/clf3PQm7k6","date":"Tue May 17 17:59:35 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"As gas prices continue to rise, Joe Biden is starting to rival Jimmy Carter for the worst president ever. Folks in Alabama don’t need Joe Biden’s Green New Deal nonsense – what they need is to be able to fill up their tanks so they can get to work without paying an arm and leg. https://t.co/3byH61Do2G","date":"Tue May 17 17:59:34 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is a massive crisis – American parents should not have to worry about finding formula for their babies. \n\nWe need answers on why the Biden administration didn’t act sooner.","date":"Mon May 16 21:26:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden’s economy has made life harder for every American.","date":"Mon May 16 18:56:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Defund Biden’s Ministry of Truth!\nhttps://t.co/LjIuZst1lX","date":"Mon May 16 17:36:59 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is the economy that less than two years of One Party Democrat rule has gotten us.","date":"Mon May 16 17:04:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas and grocery prices have skyrocketed, there is a baby formula shortage, and there is an unmitigated disaster at our southern border. \n\nWhat is President Biden doing??","date":"Mon May 16 16:00:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations!","date":"Mon May 16 15:44:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"As American parents are struggling to find baby formula for their children Biden is reportedly shipping pallets of formula to the border.\n\nWe need answers!\nhttps://t.co/jdpvaeAdlz","date":"Fri May 13 20:48:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Grocery prices only keep going up for Americans while Joe Biden laughs about the inflation crisis he created.","date":"Fri May 13 20:38:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Incredibly sad news. I am praying for the Callahan family as they mourn the loss of Karen Callahan. \nhttps://t.co/BSaJ3cWMJr","date":"Fri May 13 18:19:05 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s ministry of truth wants to edit your social media posts. Insane.","date":"Fri May 13 18:13:35 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"During #NationalPoliceWeek I want to acknowledge the work done by @AuburnU to train counterterrorism dogs. These police K-9’s are vital in keeping our communities safe. https://t.co/2dADslKODC","date":"Fri May 13 17:47:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Trump we had American energy independence. Biden destroyed that with his Green New Deal socialism. https://t.co/tWBTAuIohw","date":"Thu May 12 20:54:43 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This report comes after the Biden administration claimed their ‘Safe Smoking Kits’ didn’t include crack pipes – contrary to previous reporting.\n \nWe need answers on if the Biden admin is using taxpayer money on crack pipes.\nhttps://t.co/x7K6tRu89E https://t.co/0Ol5YlKGUQ","date":"Thu May 12 20:02:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Glad to see that USDA has approved a nearly $50k grant for the city of Lanett to help maintain the grounds of the Lanett Municipal Airport! #AL03","date":"Thu May 12 19:21:47 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices keep climbing as Biden keeps killing the production of American energy. \n\nhttps://t.co/JEtq2OBjxP","date":"Thu May 12 18:59:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration needs to work quickly to address the baby formula shortage. Our nation’s most vulnerable are being affected – where is Biden’s plan?\nhttps://t.co/7RLWL39CQ2","date":"Thu May 12 18:38:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"An energy crisis, an economic crisis, and a crisis at our southern border. \n\nThe Biden administration has ZERO idea what they’re doing and the American people are paying the price.","date":"Thu May 12 18:03:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’m thrilled to see that the far-left radical abortion bill failed to pass the Senate. \n\nI will always work to protect the sanctity of life.","date":"Wed May 11 21:16:53 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices have only continued to skyrocket under President Biden.","date":"Wed May 11 19:13:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Democrats refuse to vote on our bill to abolish Biden’s Orwellian 'Ministry of Truth’. \n\nWhy won’t they join us in protecting free speech?","date":"Wed May 11 18:42:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Police officers are always the first on the scene to help our communities in times of tragedy. \n\nDuring National Police Week we honor their sacrifices. \n\nI will always #BackTheBlue. https://t.co/8YMpHvKBVn","date":"Wed May 11 18:06:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is awful. Mothers are struggling to feed their babies in Biden’s America. This crisis should have never happened.","date":"Wed May 11 17:56:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The left has intimidated SCOTUS justices at their own homes, set fire to a pro-life office in Wisconsin, intimidated Americans at their places of worship, and now a prominent Democrat politician is calling for political violence.","date":"Wed May 11 17:18:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s Green New Deal socialism comes at the cost of your hard-earned paycheck.","date":"Wed May 11 17:00:23 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration is apparently completely okay with the intimidation of SCOTUS justices by mobs outside their homes.","date":"Wed May 11 16:15:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Welcome news! President Trump should have never been banned in the first place!","date":"Wed May 11 16:00:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s 40-year high rate of inflation has continued for the second month in a row. \n\nMeaning Americans have only continued to lose more money with Bidenflation. \nhttps://t.co/5UzrOYHoM5","date":"Wed May 11 15:39:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to secure the border and stop the flow of deadly drugs into our country.","date":"Mon May 09 19:40:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Terror watchlist suspects have tried to enter our country through the chaos at the Southern Border. Yet, President Biden’s administration continues to ignore the crisis.\n \nBiden is putting American lives in danger by not securing the border.\nhttps://t.co/1bJf3xXbD6","date":"Mon May 09 17:48:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s skyrocketing inflation is causing the majority of Americans hardship. Yet, he has done nothing to get our economy back on track.","date":"Mon May 09 17:27:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Energy prices continue to soar and Americans are paying higher prices just to fill up the tank. Meanwhile, President Biden continues to push his devastating Green New Deal policies – destroying American energy independence.","date":"Mon May 09 16:23:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is a horrifying and disgusting act of violence against Americans advocating to protect the lives of the unborn.\nhttps://t.co/5eYfK0gaYJ","date":"Mon May 09 16:04:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Celebrating Mother's Day with my incredible wife Beth who is a remarkable mother to our three kids. \n \nWishing everyone a happy Mother's Day! https://t.co/ocURM8dapA","date":"Sun May 08 13:59:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The far-left is threatening to dismantle the Supreme Court by expanding it and packing it with liberal justices. \nhttps://t.co/paljtZJWRo","date":"Fri May 06 18:36:02 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unreal. Supporting late term abortion is further proof that President Biden’s administration is radically far left and out of touch with Americans.","date":"Fri May 06 18:19:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our service members and their families make countless sacrifices in service to our nation. \n\nToday and every day we honor military spouses. 🇺🇸\n#MilitarySpouseAppreciationDay. https://t.co/LZDmrVnaw6","date":"Fri May 06 18:02:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden thinks inflation is a joke meanwhile American families are struggling to afford necessities.","date":"Thu May 05 18:04:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans can’t afford the Democrats' socialist policies.","date":"Thu May 05 18:02:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Yet another lie from President Biden. \nhttps://t.co/dZDMZU6Kqm","date":"Thu May 05 17:14:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Disgusting. If you don’t do what the liberal left wants they will try to censor you, they will try to intimidate you, and bully you into supporting their insane policies. \nhttps://t.co/dxVBAWdqZT","date":"Thu May 05 17:03:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will always stand up for our First Amendment rights. \nhttps://t.co/LjIuZst1lX","date":"Thu May 05 15:59:56 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Psalm 66:19 \"But God has surely listened and has heard my prayer.\" \n \n#NationalDayofPrayer https://t.co/YeB4R1akAo","date":"Thu May 05 14:58:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Left wants to police free speech and pack the Supreme Court – don’t believe their lies.","date":"Wed May 04 17:09:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The left leaked a draft Supreme Court opinion to subvert SCOTUS and attempt to intimidate Justices. Now, the left is calling for court packing in another attempt to undermine and politicize our nation’s highest court.\n\nThere is no low they won’t stoop to.\nhttps://t.co/Gxr5pVN5oY","date":"Wed May 04 16:55:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The administration that wants to start an Orwellian 'Ministry of Truth' is unsurprisingly spreading disinformation.","date":"Wed May 04 16:14:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’m glad to join @RepMikeJohnson &amp; colleagues in introducing a bill to immediately defund Biden’s Orwellian ‘Ministry of Truth’. The government should have no role in policing our First Amendment rights.\nhttps://t.co/ipeQyIPopc","date":"Wed May 04 16:08:56 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden’s time in office has been marked by staggering failures across the board. So what does he do? Call Republicans ‘extreme’. \n \nNo, Mr. President, we’re not extreme we just want our country to get back on track.","date":"Wed May 04 15:59:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans are sick and tired of President Biden’s inflation eating into their bank accounts.","date":"Tue May 03 18:42:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The left leaked an unpublished opinion by the Supreme Court in an attempt to subvert the court by attempting to intimidate Justices.\n \nWhile wrongly leaked, the draft opinion is a sound argument that supports the right to life and overturns the wrongly decided Roe v. Wade.","date":"Tue May 03 17:46:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden is failing American families.\n \nAmericans know we can’t afford the Democrats socialist policies.","date":"Tue May 03 17:35:44 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy National Small Business week! Small Businesses are the backbone of our communities. https://t.co/ITvE5lnPY8","date":"Tue May 03 16:50:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will always support the sanctity of human life.","date":"Tue May 03 16:26:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Leaking an unpublished opinion by the Supreme Court is a clear attempt by the left to subvert the process of our nation’s highest court.\n \nRoe v. Wade was wrongly decided. Standing up for the sanctity of human life and overturning Roe v. Wade is the right thing to do.","date":"Tue May 03 16:09:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden is wrecking our economy. \nhttps://t.co/NyGO2YIQjg","date":"Mon May 02 18:53:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with some wonderful folks in Clanton today. #AL03 https://t.co/SWU8LbYWAQ","date":"Mon May 02 18:47:00 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden may be able to ignore inflation but American families don’t have that luxury. \nhttps://t.co/I3a0IugSw9","date":"Mon May 02 18:35:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with Clanton City officials today! #AL03 https://t.co/jcTzk3sqb2","date":"Mon May 02 18:18:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Out of touch and callous. If Joe Biden had to buy gas or groceries like the rest of us he’d understand that the inflation crisis he created is not a joke.","date":"Mon May 02 18:05:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"DHS is expecting 18k migrants DAILY if Title 42 is life. This comes after Secretary Mayorkas falsely claimed the border was ‘effectively managed’. \n\nWe need to secure the border.","date":"Mon May 02 17:37:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to the Weaver High School wrestling team! #AL03 https://t.co/Nveustg0gd","date":"Mon May 02 17:22:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden laughed at a fancy dinner with celebrities over the economic crisis he has created.\n \nThe Biden admin is indifferent to the pain their runaway inflation is inflicting on American families. \nhttps://t.co/b3ScNaegD4","date":"Mon May 02 17:19:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will always stand up for the 1st amendment. The government should have ZERO role in policing your right to free speech.","date":"Fri Apr 29 17:58:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s inflation is hurting American Small Businesses. \nhttps://t.co/sXAL8fEeB2","date":"Fri Apr 29 17:48:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation continues to rise as President Biden does nothing. \nhttps://t.co/CaJek8Ykzx","date":"Fri Apr 29 17:23:47 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s Ministry of Truth is an abuse of your tax dollars. \n \n(I hope the thought police don’t fine me for telling the truth)","date":"Fri Apr 29 17:07:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Absolutely no one besides Joe Biden wants to relive the Carter administration.","date":"Fri Apr 29 16:59:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"So far Biden has done more to police free speech than he has to police the southern border. \nhttps://t.co/NTnsMa2hYr","date":"Fri Apr 29 16:46:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The left thinks that anything that doesn’t fit their narrative is disinformation. \nhttps://t.co/6Zxn2fZjLU","date":"Fri Apr 29 16:33:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“I’m from the government and I’m here to help.”","date":"Fri Apr 29 15:54:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Will Biden’s new Ministry of Truth come with thought police too?","date":"Fri Apr 29 15:46:48 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I don’t understand why the Biden administration has continued to ignore the crisis at our southern border. An open border is a threat to our national security.","date":"Thu Apr 28 18:29:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden needs to stop misusing the strategic petroleum reserve and unleash the production of American energy. https://t.co/dCdsAx1YnE","date":"Thu Apr 28 18:05:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Why won’t the Biden administration just build the wall and secure our border?","date":"Thu Apr 28 17:50:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Sounds like more political science from Fauci.","date":"Thu Apr 28 17:26:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden is destroying our economy.","date":"Thu Apr 28 16:42:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today we remember the victims of this tragic storm. Please keep their families and loved ones in your prayers.","date":"Wed Apr 27 20:04:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need American energy independence!","date":"Wed Apr 27 19:29:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Fact check: Extremely false.","date":"Wed Apr 27 18:47:57 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s runaway inflation means Americans are paying more for all essentials. \nhttps://t.co/6ekm6hmKpb","date":"Wed Apr 27 18:19:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration knows the damage that lifting Title 42 will do – but they’re going to do it anyway.","date":"Wed Apr 27 17:40:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The American people deserve to know how involved Joe Biden was in Hunter Biden’s business dealings.\nhttps://t.co/PsPk7mhvGF","date":"Wed Apr 27 16:35:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Exactly right @elonmusk.","date":"Wed Apr 27 16:35:05 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Since Biden took office, OVER 2.4 MILLION illegal immigrants have been apprehended at our southern border.","date":"Wed Apr 27 14:55:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Border security is national security!","date":"Wed Apr 27 13:17:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"More than 7,000 migrants crossed the border per day, on average, in March. Yet, deportations are down 68% under President Biden.🤔","date":"Tue Apr 26 21:26:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good. President Biden should not lift Title 42 at a time when our border is being flooded with illegal migrants.\n\nWe need to secure our border!","date":"Tue Apr 26 19:07:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Big tech should not be allowed to silence and censor conservatives. That should not be a controversial opinion.","date":"Tue Apr 26 17:42:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is insane. It doesn’t matter if potential terrorists crossing the border are ‘rare’ it only takes one terrorist making it across our border for Americans to be at risk.","date":"Tue Apr 26 16:49:50 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s inflation is eating into every American’s wallet. https://t.co/Y8EiPo4PSO","date":"Tue Apr 26 14:01:11 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @elonmusk! Free speech is a right for every American.","date":"Mon Apr 25 20:24:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Power hunger bureaucrats are upset they can’t force Americans to wear masks. \nhttps://t.co/65mOTsV6cq","date":"Mon Apr 25 18:28:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Awful. So far 101 officers have been shot in the line of duty this year. \n\n'Defund the Police' rhetoric from the left is dangerous. We need law and order.\nhttps://t.co/9wlMh4pgxi","date":"Mon Apr 25 17:54:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to the state champions — the Jacksonville High School Boys Basketball team! #AL03 https://t.co/8oh6AYBP3p","date":"Mon Apr 25 17:30:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden knows that lifting Title 42 will do irreparable harm to our southern border. His administration just doesn’t care. \nhttps://t.co/sxhTXzXF0R","date":"Mon Apr 25 17:27:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’m glad to announce that Tori Williams, a Senior at Oxford High School, took first place in the Third Congressional District Art Competition, for her artwork titled ‘Enduring Love’.\nhttps://t.co/ykDwPnI4IN https://t.co/fbVK1XmWga","date":"Mon Apr 25 16:35:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I hope a change in leadership will encourage Big Tech to stop censoring conservative voices.","date":"Mon Apr 25 16:19:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with some future leaders at Alexandria Middle School today! #AL03 https://t.co/jCaw6e44H2","date":"Mon Apr 25 16:04:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Sunny King Automotive Group and Patty King on 100 years! What a milestone!  #AL03 https://t.co/W1UHSXcuSC","date":"Sat Apr 23 21:54:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Reminder: Over 2 million illegal migrants were apprehended at our southern border last year. This year the number could be even higher if Biden lifts Title 42. https://t.co/KrqmUnbg7R","date":"Fri Apr 22 18:37:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met some rock stars today at the Cheaha Regional Head Start Center! #AL03 https://t.co/LOetWFscoJ","date":"Fri Apr 22 18:32:50 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices have skyrocketed under President Biden and his administration still cares more about appeasing the far left than helping American families.","date":"Fri Apr 22 18:25:17 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans are struggling with record high prices at the gas station and at the grocery store but President Biden cares more about making you wear a mask at the airport.","date":"Fri Apr 22 16:33:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In Anniston for the ribbon cutting at Southern Edge Connect! Congrats to Steven Whatley! #AL03 https://t.co/FcPolhOjWk","date":"Fri Apr 22 16:12:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great talking with Jock this morning! Hope y’all were able to listen in! #AL03 https://t.co/38pv4J7tvY","date":"Fri Apr 22 16:11:48 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Ted’s Carpet and Floor on their 25th anniversary!  #AL03 https://t.co/TvU35M5XUV","date":"Thu Apr 21 22:58:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to secure the border!","date":"Thu Apr 21 18:34:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Trump made American energy independence a priority and supported the production of American energy. \n\nUnder President Biden’s Green New Deal nonsense, Americans are faced with high prices that keep climbing. \nhttps://t.co/0TAtGPFfZQ","date":"Thu Apr 21 18:27:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with Ranburne Police Chief Glen Stiles. I will always #backtheblue. #AL03 https://t.co/ogT1AxDhF9","date":"Thu Apr 21 18:24:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great lunch today at Country Boys! #AL03 https://t.co/ElWNuKVkZO","date":"Thu Apr 21 18:23:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It is disgusting that Harvard gave the CCP a free microphone to spout their propaganda.","date":"Thu Apr 21 17:23:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is a joke right? The Biden administration is wasting taxpayer dollars fighting the repeal of their insane mask mandate. \nhttps://t.co/ZwodfIoJGJ","date":"Thu Apr 21 16:59:59 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Enjoyed chatting with folks at the Ranburne Senior Center. #AL03 https://t.co/1WoFj6e45f","date":"Thu Apr 21 16:13:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I love to see Alabama small businesses flourishing. Today, I met with Ever After Prom and Bridal Shop owner Kelly McMahan. #AL03 https://t.co/efYykahtEo","date":"Thu Apr 21 16:08:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Enjoyed my visit to Ranburne Powersports today! #AL03 https://t.co/EfUYzvBgaN","date":"Thu Apr 21 15:59:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Insanity. The far-left wants to force Americans to stay in masks forever. \nhttps://t.co/lgg7EbwHOL","date":"Wed Apr 20 18:59:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great speaking with community leaders in Chambers County! #AL03 https://t.co/5LRRMUkRJc","date":"Wed Apr 20 18:53:59 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is all Biden’s fault. \n \nAmerican energy independence should be his first priority – not far-left climate policies. \nhttps://t.co/9F42btUkHl","date":"Wed Apr 20 18:42:50 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If President Biden ends Title 42 the crisis at our southern border will become an unmitigated disaster. https://t.co/6ymq2zye7T","date":"Wed Apr 20 17:32:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the Valley Kiwanis Club for inviting me to speak today. #AL03 https://t.co/RlN2H2xFFz","date":"Wed Apr 20 16:46:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices have hit record highs under President Biden and now he wants to drive prices even higher by prioritizing the Green New Deal over American energy independence. \nhttps://t.co/dSI3ZyMlww","date":"Wed Apr 20 16:44:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Productive discussion with Childersburg Mayor Ken Wesson and members of the City Council this afternoon. #AL03 https://t.co/CczgLL8C5d","date":"Tue Apr 19 20:18:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to unleash the power of American energy production! https://t.co/JZOEiYJFkC","date":"Tue Apr 19 19:52:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@SteveScalise is right. As Americans suffer the impacts of high inflation President Biden refuses to take any responsibility for the crisis he created. \nhttps://t.co/ITR1CMrXXr","date":"Tue Apr 19 19:24:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Border security is national security.","date":"Tue Apr 19 19:08:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaking to community leaders in Sylacauga. Thank you for having me! #AL03 https://t.co/Kao4KSrFZZ","date":"Tue Apr 19 18:43:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Lifting Title 42 will only make the crisis at our southern border worse.\n \nWhy won’t Biden secure our border??","date":"Tue Apr 19 18:37:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"That’s nearly a quarter of a million illegal migrants being encountered at our border in a single month. \n \nWe need to secure our border now!","date":"Tue Apr 19 18:19:35 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Fantastic morning at the Alabama Graphite groundbreaking. #AL03 https://t.co/v6aLQqNZvd","date":"Tue Apr 19 16:14:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good luck to Bret Holmes, the 2020 ARCA Menards Series champion, as he competes this week! https://t.co/WrXz3BZp6z","date":"Tue Apr 19 15:47:43 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s inflation is eating into every American’s bank account.","date":"Mon Apr 18 20:57:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Mike Sutterer for showing me around Bonnie Plants today! #AL03 https://t.co/roZVCuPb76","date":"Mon Apr 18 20:45:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s high gas prices and inflation are eating into the budgets of Sheriff departments in Alabama.\n \nWe need to unleash the production of American energy to bring down prices ASAP. \nhttps://t.co/jKmGzeuP05","date":"Mon Apr 18 20:34:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Not even fast food can escape Biden’s inflation.\nhttps://t.co/U4FAzEqhZd","date":"Mon Apr 18 20:17:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to be in Auburn today meeting with Mayor Ron Anders, Jr. and City Manager Megan McGowen Crouch! #AL03 https://t.co/KoQKeM3gXI","date":"Mon Apr 18 20:00:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"23 people on the terror watchlist were stopped at the southern border trying to enter our country.\n\nBorder security is national security.\nhttps://t.co/LaNvmRz0pq","date":"Mon Apr 18 19:10:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nearly a quarter of a million migrants were encountered at our southern border in March. This is reportedly the most in any single month during the Biden administration.\n \nThe border crisis is spinning out of control. Biden is throwing gasoline on the fire by lifting Title 42.","date":"Mon Apr 18 18:27:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is great news. The Biden administration has abused the use of mask mandates for far too long.","date":"Mon Apr 18 17:58:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Easter to you and your family! \n \n“He is not here; he has risen!” Luke 24:6 https://t.co/FVSVyeGQQD","date":"Sun Apr 17 13:48:34 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see Mayor Woody Baird and Al Jones at the Alexander City Chamber Annual Meeting! #AL03 https://t.co/MJSqtohKYo","date":"Fri Apr 15 13:44:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy 150th anniversary to Alexander City! Glad to present Mayor Baird with a Congressional Record honoring the history of the city. #AL03 https://t.co/qDHwIl3cra","date":"Fri Apr 15 13:43:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today is the last day that Students can drop off their artwork for the Third Congressional District Art Competition! \n\nThe deadline for submission is Today, Friday, April 15th at 5:00p.m. \n\nRead more here ⬇️\nhttps://t.co/lZVrAoVv8o","date":"Fri Apr 15 12:33:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing everyone a blessed Good Friday. \n\n\"He himself bore our sins in his body on the tree, that we might die to sin and live to righteousness. By his wounds you have been healed.\" 1 Peter 2:24 https://t.co/3pe9u77S66","date":"Fri Apr 15 12:30:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always a great day when I get to hang out with Kenny Dean. Thank you for having me. #AL03 https://t.co/tM6PwCTFMS","date":"Fri Apr 15 00:01:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to learn more about the Russell Legacy Project. Thank you to the folks at Russell Medical for having me today. #AL03 https://t.co/A3CXK0aBKw","date":"Fri Apr 15 00:00:53 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Border Patrol is expecting a record breaking surge at our southern border. \n\nWe need to secure our border now! \nhttps://t.co/EEDCpptvsx","date":"Thu Apr 14 20:54:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"\"Right now, Title 42 is all that stands between us and an effectively open border. That’s because, on taking office, Biden reversed President Donald Trump’s other successful border policies.\" via @marcthiessen\nhttps://t.co/NK2eC4gSJ8","date":"Thu Apr 14 20:38:11 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Tomorrow is the last day that Students can drop off their artwork for the Third Congressional District Art Competition! \n\nThe deadline for submission is Tomorrow, Friday, April 15th at 5:00p.m. \n\nRead more here ⬇️\nhttps://t.co/lZVrAoVv8o","date":"Thu Apr 14 20:22:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Sharing a laugh with my friend Lee before our interview today. Thanks for having me. #AL03 https://t.co/956uHK57JN","date":"Thu Apr 14 19:44:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Border Patrol is overwhelmed. Lifting Title 42 will only make the crisis at our southern border worse. \nhttps://t.co/xVxsv7gcaf","date":"Thu Apr 14 19:32:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"70% of Americans disapprove of how Biden has handled inflation.\n\nThe American people are tired of excuses and blame. We need solutions NOW!","date":"Thu Apr 14 18:48:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Over half of all Americans disapprove of how President Biden is handling his duties. \n\nThe American people know that Joe Biden has failed our country at every turn. \nhttps://t.co/oLpDviw4gT","date":"Thu Apr 14 18:30:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’m saddened to learn of the passing of former Auburn quarterback and Loachapoka High School teacher and coach, Mr. Jeff Klein.\n\nI am praying for his students, family, and loved ones as they mourn his passing.","date":"Thu Apr 14 18:29:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the Anniston Kiwanis Club for inviting me to speak! #AL03 https://t.co/D8xvBX8WJG","date":"Thu Apr 14 18:25:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to @TuskegeeUniv students for taking fourth place in the @hcasc!","date":"Wed Apr 13 19:43:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It's unconscionable that Americans have had to cut back on groceries due to Biden’s increasing inflation. \nhttps://t.co/Np1Vicejkt","date":"Wed Apr 13 19:22:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is what President Biden has done to our economy.","date":"Wed Apr 13 18:21:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@GOPLeader is right. Under President Biden food has become more expensive and our communities have become less safe. \nhttps://t.co/SYEXIocoJF","date":"Wed Apr 13 17:25:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is insane. \nhttps://t.co/ifjmUKOhYp","date":"Wed Apr 13 16:49:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden continues to ignore Americans as he does nothing to secure our border. \n\nRepealing Title 42 will only make the crisis at our southern border worse!","date":"Wed Apr 13 16:26:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today is the first day that Students can begin dropping off their artwork for the Third Congressional District Art Competition! \n\nThe deadline for submission is Friday, April 15th at 5:00 p.m. \n\nRead more here ⬇️\nhttps://t.co/C4Jd0rF5BW","date":"Wed Apr 13 15:03:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Life under President Biden’s economy means having less cash to spend on things your and your family enjoy.","date":"Tue Apr 12 19:49:57 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In less than two years Joe Biden has completely destroyed the booming economy we had under President Trump.","date":"Tue Apr 12 19:10:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden inflation keeps going higher and your wallet keeps shrinking.","date":"Tue Apr 12 18:09:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden’s soaring inflation has made it harder for all Americans to put food on the table and gas in their tank...It’s clear that President Biden’s America Last agenda has left American families worse off.\nhttps://t.co/c92ED3R6eG https://t.co/bY6B7zswIx","date":"Tue Apr 12 17:22:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is Biden’s economy:\n\n“From rising rent to higher heating bills, surging inflation impacts everybody, but it poses a particular hardship for people with little extra money to spare.”\nhttps://t.co/qdB4Dpajgh","date":"Tue Apr 12 16:31:23 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Life in Biden’s economy means you’re paying more just to feed your family. \nhttps://t.co/O47X4wzGPe","date":"Tue Apr 12 15:14:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation may not impact President Biden’s bank account but it is taking a toll on American families across our nation.\nhttps://t.co/AJXwTwX7yA","date":"Tue Apr 12 14:48:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation under Biden has reached another 40+ year high.\n\nSo far we’ve heard a lot of blame from the Biden administration but have seen zero action to jumpstart the American economy and unleash American energy production. \nhttps://t.co/1pPVGAH8o1","date":"Tue Apr 12 14:01:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The USDA is predicting that food prices will continue to INCREASE. \n \nThat means more money out of your pocket because of Biden’s socialist policies. \nhttps://t.co/6ujPOpemBC","date":"Mon Apr 11 19:36:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"So, the Biden Administration will lift Title 42 even with millions of illegal migrants streaming across our southern border but Joe Biden still thinks you should wear a mask on an airplane.","date":"Mon Apr 11 19:27:59 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to my good friend @repjimbanks for inviting me to the inaugural Northeast Indiana Defense Summit. \n\nOur nation faces unprecedented threats from China and Russia. It’s critical that our military have the funding they need to combat these threats and keep our nation safe. https://t.co/ktlEwBrttk","date":"Mon Apr 11 17:26:33 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to secure our border!","date":"Mon Apr 11 16:50:45 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The left’s COVID insanity has been a living nightmare for students and their parents. Enough is enough. \nhttps://t.co/eBS77BurKb","date":"Mon Apr 11 15:53:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden needs to stop listening to the far-left and start listening to Americans!","date":"Mon Apr 11 15:22:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congressional Democrats may not care about the border but Congressional Republicans will continue to demand the Biden administration do more to secure our southern border. \nhttps://t.co/12343ptGl6","date":"Mon Apr 11 14:48:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing everyone a blessed Palm Sunday. https://t.co/jjaW8In7Ce","date":"Sun Apr 10 17:42:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the brave folks at the Anniston Fire Department for meeting with me today. Thank you for all you do to keep our community safe! #AL03 https://t.co/T6Xj2M6W7Q","date":"Fri Apr 08 17:08:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Jon Hegeman for showing me around Greenway Plants today! #AL03 https://t.co/iDVEukFbIR","date":"Fri Apr 08 17:08:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is tragic. \n\nWe need to secure our border and stop the flow of drugs into our communities. \nhttps://t.co/mUskKeOHi1","date":"Fri Apr 08 16:38:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Planning to take a family trip this spring or summer? \n\nBiden’s inflation is making it a lot harder and a lot more expensive. https://t.co/1XC8kCx6bE","date":"Fri Apr 08 15:21:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Reckless. \n \nPresident Biden needs to unleash American energy production and stop abusing our Strategic Petroleum Reserve.","date":"Fri Apr 08 14:48:05 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Over HALF of all Americans agree that ending Title 42 is a bad idea. \n \nPresident Biden needs to reverse course before it’s too late. \n \nDo not make the crisis at our southern border worse! \nhttps://t.co/0eegfVDTU4","date":"Fri Apr 08 13:25:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nearly half of all Americans are thinking about rising prices 'all the time.'\n\nThis is what Biden's economy has done to financial security for American families.\nhttps://t.co/VNkicGwLfk","date":"Fri Apr 08 12:07:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We must do all we can to punish Putin for his vile acts in Ukraine. \n\nToday, I was proud to vote in favor of legislation that bans the importation of all Russian mineral fuels &amp; products to the U.S. and suspends 'Permanent Normal Trade Relations' for Russia.","date":"Thu Apr 07 20:54:17 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended the Alabama Farm-City awards. I continue to be a proud supporter of Alabama’s farmers! #AL03 https://t.co/SfDzsxvu0K","date":"Thu Apr 07 19:43:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Kyle Dorsett for winning the MLF Phoenix Bass Fishing League event! \nhttps://t.co/lVhPKZSrXp","date":"Thu Apr 07 19:39:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden admin claimed this would be temporary – but it’s only gotten worse.","date":"Thu Apr 07 18:46:17 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"So the Biden admin’s response to the crisis at the southern border is to give those who cross the border illegally a free smartphone? \nhttps://t.co/3EyYdPW0cm","date":"Thu Apr 07 16:18:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will always put America first!","date":"Thu Apr 07 15:40:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gas prices have increased 81% under President Biden!","date":"Wed Apr 06 20:52:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need to protect Americans and secure the southern border.","date":"Wed Apr 06 19:53:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Keep an eye on severe weather that could reach East Alabama today. Stay up to date and stay safe!","date":"Wed Apr 06 18:40:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is bad.","date":"Wed Apr 06 17:27:02 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We must secure the border!","date":"Wed Apr 06 15:29:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our border patrol agents are overwhelmed. President Biden will only make it worse by ending Title 42. \nhttps://t.co/JTTieLeD7p","date":"Wed Apr 06 13:51:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"REMINDER: The Third District Congressional Art Competition is officially open! \n\nThe deadline for submission is Friday, April 15th at 5:00 p.m. \n\nRead more here ⬇️\nhttps://t.co/C4Jd0rF5BW","date":"Tue Apr 05 17:33:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden has kept only one promise and that is to diminish America’s energy independence and make sure you’re paying more at the pump just to get to work.","date":"Tue Apr 05 16:24:17 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden's far-left policies are causing your grocery bill to skyrocket.\n📈Beef: +16.2%\n📈Pork: +14%\n📈Poultry: +12.5%\n📈Fish and seafood: +10.4%\n📈Eggs: +11.4%\n📈Dairy: +5.2%\n📈Fats and oils: +11.7%\n📈Fresh fruits: +10.6%\n📈Fresh vegetables: +4.3%\nhttps://t.co/JcnqcBBcZB","date":"Tue Apr 05 15:03:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“I think [Joe Biden] has been wrong on nearly every major foreign policy and national security issue over the past four decades.” Secretary Robert Gates","date":"Mon Apr 04 19:23:28 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Why does President Biden continue to ignore the inflation crisis facing every American?","date":"Mon Apr 04 18:52:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Big tech and the media censored stories about Hunter Biden. Now they’re finally starting to admit the truth! \nhttps://t.co/JzhnhkqZRD","date":"Mon Apr 04 18:03:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@GOPLeader is completely right. By ending Title 42, President Biden is actively working to make the crisis at our southern border worse. \nhttps://t.co/9dlvtFgQQE","date":"Mon Apr 04 17:00:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration’s decision to roll back Title 42 will only worsen the crisis at our southern border. CBP currently encounters an average of 7,000 migrants a day.\n \nThis could reportedly increase to 12,000–18,000 migrant encounters every day.","date":"Mon Apr 04 16:20:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We need answers on Hunter Biden’s foreign business dealings! \nhttps://t.co/KMh7NdN4j2","date":"Mon Apr 04 15:07:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations! #WarEagle \nhttps://t.co/kT52ROo7YA","date":"Mon Apr 04 14:30:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If President Biden had to shop at a grocery store like you or me he’d see the economic hardship that his socialist policies have created. https://t.co/YaOQu6ge10","date":"Mon Apr 04 14:06:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"RT if you support American energy independence! https://t.co/AnciqHAkd4","date":"Mon Apr 04 13:35:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden’s socialist policies have left American families behind. \n\n“Nearly half of U.S. voters say they are ‘financially worse’ than they were one year ago, shortly after the end of former President Trump’s four years in office.” \nhttps://t.co/OYv7NYBRCs","date":"Mon Apr 04 13:09:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden’s inflation is making it harder for every American to make ends meet.","date":"Sat Apr 02 18:48:28 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is awful.\n\n\"Soaring costs of raw materials such as milk, sugar &amp;  cocoa, and a shortage of aluminum used to make wrappers, have sparked a surge in the cost of candy, making it more expensive than ever for the Easter Bunny to fill baskets on April 17.\"\nhttps://t.co/yyvCc7qE6k","date":"Sat Apr 02 18:47:00 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Beauregard Elementary School on being named the best elementary school in Lee County! \nhttps://t.co/pnauw3uEak","date":"Thu Mar 31 15:43:48 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Instead of unleashing the full power of America’s energy sector, President Biden has had to dip into our Strategic Petroleum Reserve for the 2nd time this month alone. \n\nWhy won't Biden just support American energy independence like President Trump?","date":"Thu Mar 31 14:55:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Had to double check my calendar to make sure this wasn’t an April Fools joke.","date":"Thu Mar 31 13:34:10 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Irresponsible. Border crossings are surging and deportations have been lagging behind.\n\nIf President Biden actually cared, he would go to the southern border and see this crisis with his own eyes.\n\nThis decision will only worsen the crisis at our southern border.","date":"Wed Mar 30 20:48:02 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My colleagues in the Senate should not confirm Judge Ketanji Brown Jackson for a post on the Supreme Court. I was troubled by her testimony before the Senate Judiciary Committee – her far-left political views &amp; soft-on-crime sentences for child sex predators are concerning.","date":"Tue Mar 29 18:52:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Because of Biden’s inflation, American families are spending more of their hard-earned money just to pay for groceries. https://t.co/JmcSJwrf0o","date":"Tue Mar 29 15:05:05 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"AUBix will give East Alabama a critical edge in cyber. From improving cybersecurity to giving students access to computer science training – there are many ways this data center will benefit our communities. https://t.co/NQOCM6AzZ8","date":"Mon Mar 28 18:39:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Is destroying our energy independence the only promise Biden has been able to keep?","date":"Mon Mar 28 18:03:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The consequences of Biden's open borders: Deportations of illegal immigrants dropped by over 68% while the number of illegal border crossings skyrocketed.\n\nSince Joe Biden took office, over 2 million illegal immigrants have tried to cross our border. https://t.co/XkTJQKd7H3","date":"Mon Mar 28 17:06:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Every American is paying more at the gas pump because of President Biden’s socialist energy policies and inflation. https://t.co/hnjNEYvhjZ","date":"Mon Mar 28 15:29:44 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Disgusting. \nhttps://t.co/NCQb9VehNn","date":"Mon Mar 28 14:44:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If reports are accurate, President Biden’s decision to cut key U.S. nuclear modernization programs is yet another example of this administration’s inability to confront the dangerous reality of the strategic threats facing the United States and its allies.","date":"Fri Mar 25 17:35:33 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bennie Adkins' acts of heroism during battle in 1966 earned him the highest honor in our nation.\n\nOn #nationalmedalofhonorday we remember &amp; honor Bennie's bravery, sacrifice, and service to our nation.\n\nOur service members are the greatest force for good the world has ever seen. https://t.co/buARVLVbXB","date":"Fri Mar 25 16:12:50 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, we remember the six lives that were lost when tornadoes ripped through East Alabama last year. I am praying for their families and loved ones on this painful anniversary. \n\nThe damage our communities sustained from the storms was heartbreaking. https://t.co/451uj4rZRB","date":"Fri Mar 25 15:50:57 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the great folks at the Pell City Rotary Club for having me speak! #AL03 https://t.co/VTbEanQIUT","date":"Wed Mar 23 17:45:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with Mayor Bunt of Ragland, Spencer Weitman of National Cement, and Jason Roberts of the St Clair Co EDC about the needs of Ragland. #AL03 https://t.co/KiPFWUuo8O","date":"Wed Mar 23 17:42:57 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Planning to participate in the Third District Congressional Art Competition? \n\nThe competition is open to 7th through 12th graders in Alabama's 3rd Congressional District.\n\nThe deadline for submission is Friday, April 15th at 5:00 p.m. \n\nRead more here ⬇️\nhttps://t.co/C4Jd0rF5BW","date":"Wed Mar 23 17:16:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good thing President Biden gave Putin a list of U.S. critical infrastructure that he shouldn’t attack. I’m sure that’ll really help our defense.","date":"Tue Mar 22 17:45:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"False. Under President Trump we had energy independence. Biden has done everything to destroy that independence – Psaki knows this yet continues to spread misinformation to the American people. #BidensBaghdadBob \nhttps://t.co/iJPzH1y7MH","date":"Mon Mar 21 21:26:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If President Biden hadn’t canceled the Keystone XL pipeline we would have had another avenue to get oil here in the United States. Instead, Biden canceled it and now his administration claims it wouldn’t have made difference. That’s a lie.#BidensBaghdadBob\nhttps://t.co/7obCYYCYO6","date":"Mon Mar 21 18:56:43 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration is hindering the ability for American companies to produce energy in our own country.\n\nPsaki continues to make misleading and false claims. #BidensBaghdadBob\nhttps://t.co/siT75RWDKd","date":"Mon Mar 21 18:29:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“No ability for the oil industry to continue to drill. Period.” – Joe Biden \n\nHigh gas prices are Joe Biden’s fault.","date":"Mon Mar 21 18:23:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Beth and I are praying for the families and loved ones of the 4 U.S. Marines killed in a training accident in Norway.\n\nOur nation is grateful for their service and we mourn their loss.\nhttps://t.co/GENH5MApTm","date":"Sat Mar 19 14:29:58 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am incredibly saddened to hear of the passing of the Dean of the House, Rep. Don Young.\n\nDon represented his district like no one else could. His fierceness was an example to us all.\n\nHe will be missed dearly.","date":"Sat Mar 19 13:40:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I joined 128 of my Republican colleagues in demanding the Biden administration rescind its arbitrary extension of the federal transportation mask mandate.\nhttps://t.co/UMProbAz54 https://t.co/MpUetEloG5","date":"Thu Mar 17 18:01:26 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy to announce that today the Third District Congressional Art Competition is officially open! \n\nThe deadline for submission is Friday, April 15th at 5:00 p.m. \n\nRead more here ⬇️\nhttps://t.co/C4Jd0rnudm","date":"Wed Mar 16 17:30:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am praying for the Wadley High School students injured this afternoon. \nhttps://t.co/yITDHrkVoX","date":"Wed Mar 16 00:07:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Why is the Biden administration finalizing an agreement with a terrorist regime that is attempting to kill U.S. politicians and public servants on U.S. soil? \nhttps://t.co/La5bJ5FWfv","date":"Tue Mar 15 17:11:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Deportations under Biden fell while illegal border crossings have reached record highs. \n \nPresident Biden has only continued to ignore the crisis at our southern border – emboldening traffickers and hurting communities. \nhttps://t.co/Oek4BS3Bsg","date":"Tue Mar 15 16:07:47 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A gallon of gasoline has surpassed $4 per gallon for the first time since 2008. Which will likely cost the typical household an additional $2,000 per year in gasoline costs.\n \nBiden needs to support the American production of energy NOW.\nhttps://t.co/ZG9Hzvxt11","date":"Tue Mar 15 15:58:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Leader McCarthy is right. \n \nWhen will President Biden learn that energy independence is economic and national security?","date":"Mon Mar 14 17:57:53 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden could have prevented this energy crisis but instead he decided to undo President Trump’s hard work to make America energy independent. Now Americans are suffering because of his socialist policies. \nhttps://t.co/qkMDATmYuF","date":"Mon Mar 14 16:12:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Whether you’re a Republican or a Democrat everyone agrees that changing our clocks twice a year is an outdated nuisance.\n\nMy legislation would let states like Alabama stay on Daylight Saving Time year-round. \nhttps://t.co/sVClngx1qV https://t.co/aM11VeCDGi","date":"Fri Mar 11 18:42:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Trump understood that supporting the production of American energy was the best way to keep prices low. Why won’t the Biden administration do the same?","date":"Thu Mar 10 19:50:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Insane. Joe Biden let people go maskless to his own State of the Union but still wants you to wear a mask on an airplane. Makes no sense.","date":"Thu Mar 10 18:12:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden’s failed leadership the price to feed your family only keeps going up.","date":"Thu Mar 10 16:53:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’ve said it once and I’ll say it again – energy independence is economic and national security.\n\nUnfortunately, President Biden undid President Trump’s pro-energy policies and Americans are suffering because of it. \n\nMy statement ⬇️\nhttps://t.co/JXsSWcpTXz https://t.co/Jgmkhi9G6W","date":"Tue Mar 08 20:08:34 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Every barrel of Russian oil we buy has Ukrainian blood on it.\n\nEnergy independence is economic &amp; national security –  President Trump knew this and made it a priority. \n\nBiden needs to support all American energy production &amp; stop importing Russian oil. \nhttps://t.co/XcKaZXmjky","date":"Mon Mar 07 17:06:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Jacksonville High School boys basketball on winning the 2022 4A state title!  Go Golden Eagles!\nhttps://t.co/62e5QFx6qg","date":"Sat Mar 05 20:52:17 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations! #WarEagle \n\nGreat work by the athletes and @coachbrucepearl","date":"Sat Mar 05 20:23:33 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to present a Congressional Record statement today to The Donoho School Lady Falcons for winning the AHSAA Class 1A state volleyball title. Go Falcons! #AL03 https://t.co/ILKomvRJBY","date":"Fri Mar 04 19:18:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Please take a moment today to remember the 23 Alabamians who were tragically killed by the devastating tornados on March 3, 2019. \n\nPsalm 34:18 \"The LORD is close to the brokenhearted and saves those who are crushed in spirit.\" https://t.co/bnh8KzCTay","date":"Thu Mar 03 19:53:02 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joined the great folks with @AlfaFarmers for breakfast this morning. #AL03 https://t.co/OvraGsinEc","date":"Thu Mar 03 16:13:47 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to it Jeff!","date":"Thu Mar 03 16:09:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Productive discussion with Alabama School Principals on ways to improve teacher retention and mental health services in schools. #AL03 https://t.co/lXdi0WcmOx","date":"Wed Mar 02 21:56:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good meeting with Talladega’s City Manager Seddrick Hill! #AL03 https://t.co/f3WpbI4ld9","date":"Wed Mar 02 21:48:40 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with folks from the Electric Cities of Alabama today here in DC. #AL03 https://t.co/QUC8d4NhbA","date":"Wed Mar 02 20:24:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always great to meet with @ALBroadcasters! Thank you for taking the time to come chat with me! https://t.co/3VNQFuRtUg","date":"Wed Mar 02 16:28:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s soft on crime rhetoric and policies have only emboldened criminals. We need law and order. \nhttps://t.co/GNzdLefiPw","date":"Tue Mar 01 19:14:44 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden’s reckless economic policies are hurting folks in Alabama. We need to get our economy back on track. \nhttps://t.co/dTNcF5rt7I","date":"Tue Mar 01 18:03:38 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Alabama residents have faced skyrocketing gas prices due to President Biden’s far-left energy policies. \n \nIn the last month alone in Alabama, there has been a 27-cent increase per gallon of gasoline. Energy independence is economic &amp; national security. \nhttps://t.co/N6o5TDLPaG","date":"Tue Mar 01 17:30:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Had the honor of presenting the City of Oxford with a Congressional Record celebrating the city’s 170th anniversary! #AL03 https://t.co/hklIKAfEGa","date":"Fri Feb 25 19:57:02 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Presented these great young men with a Congressional Record recognizing their hard work and celebrating their state championship win! #AL03 https://t.co/pnZGpB0h8F","date":"Fri Feb 25 19:51:48 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with some great folks at Oxford HS today. Thank you to Coach Sam Adams, Principal Heath Harmon, and Larry Davidson for showing me around! #AL03 https://t.co/ZTexJQ06Ve","date":"Fri Feb 25 19:51:20 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Last night I had the privilege of joining many current and former members of the Alabama Legislature in Montgomery to honor Rep Victor Gaston of Mobile on his 40 years of service. #AL03 https://t.co/lxan6I7KtN","date":"Thu Feb 24 15:51:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Zackary Gentile of Ford Meter Box in Pell City for showing me around their facility today! #AL03 https://t.co/KRLD0ABDHo","date":"Wed Feb 23 21:13:48 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, I had the honor of presenting Lyman Lovejoy with a Congressional Record recognizing his 50 years in business and devotion to the St. Clair community. #AL03 https://t.co/s1KgHKIwlB","date":"Wed Feb 23 20:31:47 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Awesome lunch with Chief Deputy Donnie Grant and K-9 Officer Nathanial Morrow with the Randolph County Sheriffs Department. #BacktheBlue #AL03 https://t.co/FQ3woURuRL","date":"Wed Feb 23 00:28:50 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Touring Wedowee Winery joined by Mayor Tim Coe and owner Scott Bayliss. Thank you for having me! #AL03 https://t.co/C3YAC1epz5","date":"Tue Feb 22 21:58:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great chatting with Woodland Commissioner Pam Johnson and Mayor Scott Carter. #AL03 https://t.co/8oGclNP7ii","date":"Tue Feb 22 21:57:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Wedowee Marine South for showing me around today! #AL03 https://t.co/0tYRDJGNMp","date":"Tue Feb 22 20:37:46 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to join Mayor Tim Coe and Ramonda Crouch, Kim Fransden, and Tricia Stearns, owners of Old Waters Inn. #AL03 https://t.co/lY1Hy6oi6o","date":"Tue Feb 22 19:46:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Toured the Randolph Roanoke Career Tech Center with Logan Cofield. Great work training folks for great careers. #AL03 https://t.co/xmnvFHUBrG","date":"Tue Feb 22 19:41:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to https://t.co/OK8ldrVgOe owner Barry Waldrep for showing me around his workshop! #AL03 https://t.co/xHxmHPHQ3A","date":"Tue Feb 22 19:06:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Attended a ribbon cutting for a new East Alabama Health clinic. Thank you for having me! #AL03 https://t.co/BU0BsxGpUB","date":"Tue Feb 22 19:02:54 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see Paul Wilson, the owner of Red C Cafe and pastor of the 1st Baptist Church of Wadley. #AL03 https://t.co/KRF9vUgk2U","date":"Tue Feb 22 16:21:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great time talking with Teresa at 100.7. Thank you for having me! #AL03 https://t.co/NDCIm0TkU5","date":"Fri Feb 18 21:39:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Visiting with Kevin Moon of God’s Country Radio. Some very cool collections too! #AL03 https://t.co/s7xscMPeZ4","date":"Fri Feb 18 21:30:00 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great conversation with Mike Sparks &amp; Clay Co EDC about Clay County’s needs. #AL03 https://t.co/CJ9slHGQlc","date":"Fri Feb 18 21:29:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Some very cool research being done by the students and faculty at @AuburnAg! \nhttps://t.co/MJgi76sYEQ","date":"Fri Feb 18 19:59:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Where's the accountability?\n \nThe Clinton campaign paid a technology company to 'infiltrate' servers belonging to Trump Tower, &amp; later the White House, attempting to create a FALSE link between Trump &amp; Russia.\n \nClinton spied. President Trump was right. \nhttps://t.co/ZYNH3iQIY9","date":"Fri Feb 18 19:47:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rep. Jim Hagedorn was a great man. Beth and I are praying for his family and loved ones as they mourn his loss. \n\nMatthew 5:4: \"Blessed are those who mourn, for they shall be comforted.\"","date":"Fri Feb 18 14:11:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Spoke at eggs and issues this morning in Montgomery. Thank you for having me! #AL03 https://t.co/zlxA7IHL2V","date":"Thu Feb 17 23:13:57 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Talking with the great folks at Maxwell Air Force Base about base security. #AL03 https://t.co/kVcSPes2w8","date":"Thu Feb 17 21:51:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Toured MGMWERX which is doing great work to support innovation in answering some of the toughest issues facing our warfighter. #AL03 https://t.co/bQtYg357aH","date":"Thu Feb 17 21:11:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Touring the new tower at the air traffic control at Maxwell Air Force Base. #AL03 https://t.co/3ha26IKFYV","date":"Thu Feb 17 21:10:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It's always a good day when you’re meeting with America’s best Governor:@GovernorKayIvey #AL03 https://t.co/yMkyNVUyt4","date":"Thu Feb 17 16:41:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great lunch and great conversation’s in Rockford. #AL03 https://t.co/aXUxARfb25","date":"Thu Feb 17 16:18:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Stopped by good friend Jim McClendon’s office. The Alabama Senate is losing a great man with Jim’s retirement. #AL03 https://t.co/cq73cBLVc6","date":"Wed Feb 16 21:48:45 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to @MichaelBrannon and RadioAlabama for having me today! Always great to visit with y’all!  #AL03 https://t.co/0Tz54Thifv","date":"Wed Feb 16 18:32:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Toured the VA clinic in oxford. Ensuring our veterans get the care they deserve continues to be a top priority for me. #AL03 https://t.co/P6ineKqIZQ","date":"Wed Feb 16 18:27:07 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to chat with folks at the Regional Business After Hours with Calhoun, Cleburne and Talladega Chambers of Commerce. Thanks to the Civilian Marksmanship Program for hosting. #AL03 https://t.co/6h9friJJ03","date":"Wed Feb 16 18:22:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Tex Carter from @BIG95WHMA for having me on the show today! #AL03 https://t.co/i8VHzlWFXA","date":"Tue Feb 15 22:03:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is insane. The DoD spent 5,889,082 man-hours on woke trainings for the military. \n \nhttps://t.co/wggVPMBSZ7","date":"Tue Feb 15 17:54:35 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am forever grateful that every day I get to call this beautiful and incredible woman my wife. Happy Valentine’s Day Beth! ❤️ https://t.co/p0LHD0Lw3y","date":"Mon Feb 14 16:54:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see some outstanding Alabama lawmakers in Opelika! #AL03 https://t.co/A3WRDB74xm","date":"Fri Feb 11 22:32:11 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Enjoyed meeting with Opelika City officials today. #AL03 https://t.co/zYA3XYWmI0","date":"Fri Feb 11 22:31:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Your Superbowl party will be much more expensive this as inflation hits a 40 year high due to Joe Biden’s reckless fiscal policies. \n \nhttps://t.co/DJZcCdvE1j","date":"Fri Feb 11 16:02:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation has risen to its highest in decades under Joe Biden.\n\nMeaning more money is coming out of your hard-earned paychecks just to cover the cost of groceries.\nhttps://t.co/9OlD6liBjr","date":"Thu Feb 10 14:04:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"More than a million Americans have died from drug overdoses. \n\nJoe Biden’s plan? \n\nFree crack pipes. \nhttps://t.co/laJLIvGVra","date":"Thu Feb 10 00:03:09 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended the City of Oxford’s 170th Anniversary Celebration. Incredible event from the hard-working people of Oxford. Thank you for having us! #AL03 https://t.co/MmEe1bZmgM","date":"Wed Feb 09 20:38:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I agree. We need answers on Hunter Biden’s dealings with CCP connected companies. \nhttps://t.co/LeYGqzE5CI","date":"Wed Feb 09 19:15:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Democrats don’t care about ‘the science’ only about control. #EndMaskMandates\nhttps://t.co/NTJE2yqgrZ","date":"Wed Feb 09 19:04:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The CCP must be held accountable for their egregious and disturbing human rights abuses. Every day that Joe Biden hesitates in holding China accountable for genocide &amp; slave labor the CCP only grows more emboldened in their campaign of evil.\nhttps://t.co/ykGPlyPySF","date":"Wed Feb 09 17:51:19 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Democrats are the party of keeping schools closed and kids in masks.","date":"Wed Feb 09 16:01:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It's clear that President Biden lacks the willingness to take proper steps to deter Russian and Chinese aggression.\nhttps://t.co/1xc9xVDYHd","date":"Wed Feb 09 14:17:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Russia reportedly has over 100,000 troops on the border of Ukraine and the Army has decided that *now* is the time to unveil their climate agenda. \n \nThis is a waste of department resources.","date":"Tue Feb 08 20:20:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In 2021, U.S. drug overdoses due to fentanyl skyrocketed, and it is now reported to be the leading cause of death for Americans aged 18-45.\n \nMeanwhile, President Biden has done NOTHING to stop the dangerous flow of drugs coming across our southern border. https://t.co/wEbrjB9yKo","date":"Tue Feb 08 19:46:04 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s far-left DOJ is trying to turn the whole country in San Francisco. \n \nWe need border security and tougher policies to stop drugs from flowing into this country in the first place. \nhttps://t.co/O6Rk4Jc8o7","date":"Tue Feb 08 19:29:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The abhorrent reality of the Olympics occurring in a genocidal state will leave a permanent stain on the legacy of Beijing 2022 and the International Olympic Committee. \n\nRead our letter to @USOPC_News ⬇️\nhttps://t.co/LoAXXMcl83 https://t.co/DmlOS3YAHZ","date":"Mon Feb 07 17:31:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Dr. Christopher B. Roberts on his selection as Auburn’s 21st President! #WarEagle #AL03","date":"Fri Feb 04 22:34:53 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended a joint breakfast with the Calhoun and Cleburne County Chambers. Thank you for having us! #AL03 https://t.co/dx7lDijgOQ","date":"Fri Feb 04 21:57:23 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The 2022 Olympics on NBC brought to you by Uyghur slave labor. NBC asks that you ignore the genocide being committed by the Chinese Communist Party.","date":"Fri Feb 04 17:28:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey @SpeakerPelosi don’t tell American citizens to worry about upsetting the Chinese Communist Party’s fragile feelings.","date":"Thu Feb 03 22:42:28 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nancy Pelosi’s so-called COMPETES ACT does absolutely nothing to make our nation more competitive against China. Worse, this bill distracts from the modernization of our military to combat the threat from China with pointless Green New Deal projects.\nhttps://t.co/5dgp19949L https://t.co/hpgGlBdW6Z","date":"Thu Feb 03 16:21:52 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I warned the Biden administration for months of what was going to happen in Afghanistan &amp; urged them to have a plan.\n \nThis NSC Memo proves that they shamefully sat on their hands until Kabul fell. This is undeniable proof of the negligence &amp; incompetence of the Biden admin.","date":"Wed Feb 02 20:11:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Disgusting. Taking the CCP’s money while staying quiet on China’s campaign of repression and genocide that the CCP is waging against Uyghurs.","date":"Wed Feb 02 17:42:31 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is heartbreaking. I am praying for the loved ones of these brave officers who are just trying to keep our communities safe. \nhttps://t.co/Sn1VzDRxmh","date":"Tue Feb 01 20:22:14 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"During Biden's first year in office, American cities experienced record high murders due to the left's soft on crime policies. \n\nEnough is enough. \nhttps://t.co/JctdsTG4n6","date":"Tue Feb 01 20:06:59 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The average price for a gallon of gasoline in the United States rose for the fifth week in a row! Meanwhile, President Biden continues to ignore the energy crisis his far-left policies have created. \nhttps://t.co/WnQSbv8K5j","date":"Tue Feb 01 19:56:37 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Actually, it seems like the Biden administration is living in an ‘alternate universe.’ Meanwhile, Americans are having to live with the consequences of the Biden administration’s terrible policies. \nhttps://t.co/9pCPKAcNjv","date":"Tue Feb 01 19:17:00 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Democrat's \"China\" bill actually provides the Chinese Communist Party with MORE opportunities to steal our intellectual property.","date":"Tue Feb 01 19:08:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Insanity. House Dems want our military distracted by Green New Deal projects while the threat our nation faces from China only continues to grow.","date":"Tue Feb 01 18:30:22 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"China has ramped up building nuclear weapons, steals secrets from American companies, &amp; threatens overall global stability.\n \nPelosi's sham bill gives billions to climate initiatives &amp; does nothing to actually combat China. It's clear that Dems don't care about national security.","date":"Tue Feb 01 15:41:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A disgusting political ‘report’ from Amnesty International targeting Israel. I will always stand firm with our strongest ally Israel. \n \nAmnesty International should be ashamed. \nhttps://t.co/blhWHdxg2K","date":"Tue Feb 01 15:39:42 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the kind folks at Lee Brass for showing me around today. It was great to see the work being done to make quality #MadeinAmerica products. #AL03 https://t.co/vrWO2XW6fk","date":"Mon Jan 31 22:20:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to speak with Cleburne County High School students about how our government works. #AL03 https://t.co/dugsBomIWj","date":"Mon Jan 31 19:51:21 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Deadly fentanyl is flowing across our borders and fueling a tragic epidemic of drug overdose deaths. \n \nThe Biden administration continues to do nothing to combat the crisis at our southern border.","date":"Thu Jan 27 22:17:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today marks the 77th anniversary of the liberation of the Auschwitz-Birkenau concentration camp. Please take today to remember the countless innocent lives lost in the Holocaust. #InternationalHolocaustRemembranceDay https://t.co/vvCh5sYETl","date":"Thu Jan 27 22:14:51 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended the Calhoun County Chamber’s 43rd Annual Meeting.  Congrats to Don Killingsworth as he takes over as Chair and congrats to Larry Deason on being named The Anniston Star’s Citizen of the Year.  #AL03 https://t.co/iAgycrziUs","date":"Thu Jan 27 19:33:06 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing @GOPLeader a very happy birthday! 🇺🇸","date":"Wed Jan 26 22:45:30 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"CBP reported that 178,840 illegal migrants apprehended last month, beating the worst previous December by over 100,000.\n\nJust awful. When will President Biden take this crisis seriously? \nhttps://t.co/i5wzKYdZay","date":"Wed Jan 26 15:15:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unbelievable. DHS recorded more than 2 million encounters with illegal immigrants at the southern border last year.\n\nPresident Biden has continued to ignore this crisis and our nation is suffering the consequences. \nhttps://t.co/Hq6jgkxX9y","date":"Wed Jan 26 13:43:24 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations!","date":"Mon Jan 24 15:17:18 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to the Oxford High School boys basketball team for taking home the title in the Calhoun County Boys’ Basketball Final! Great work! #AL03\nhttps://t.co/sGFQ6SV99o","date":"Mon Jan 24 15:00:41 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Incredible work by the Oxford High School girls basketball team to take home the title in the Calhoun County Girls’ Basketball Final! #AL03!\nhttps://t.co/iNv1JrbgvW","date":"Mon Jan 24 14:57:49 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Join me in praying for a quick recovery for Oxford Fire Chief Gary Sparks. #AL03 \nhttps://t.co/ESBwx6veIt","date":"Mon Jan 24 14:54:39 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to @AuburnMBB and @coachbrucepearl on their big win today!  #WDE #AL03","date":"Sat Jan 22 20:45:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Honored to meet Auburn University’s Students for Life. We should be so proud of these wonderful young people standing up for life. #WhyWeMarch https://t.co/KyuDsgkAtI","date":"Fri Jan 21 19:57:36 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Adorable! Can't wait to meet Armie!","date":"Fri Jan 21 14:07:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with Brig. Gen. Terrence A. Adams who was born in Tuskegee, Alabama. Proud of the role the men and women from Alabama’s Third Congressional District play in keeping our nation safe. #AL03 https://t.co/KDpj0jD1lO","date":"Thu Jan 20 20:30:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We have been very clear in our sentiment against Chinese-made PPE—including most recently in the FY22 National Defense Authorization Act which prohibited the Department of Defense from procuring PPE from China and other non-allied nations.\n\nWe need answers from Speaker Pelosi.","date":"Thu Jan 20 20:22:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Last month, I had the honor of naming Atticus Cornett as the winner of the 2021 Congressional App Challenge! I’m so glad he was able to stop by on his trip to D.C. #AL03 https://t.co/KvPqOomp94","date":"Thu Jan 20 18:58:29 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden administration bureaucracy and red-tape is putting Ukrainian security at risk.  I fear that an Afghanistan-like event in Europe is looming.  Give the Europeans the green light, Mr. President.","date":"Wed Jan 19 21:46:25 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am deeply honored to receive an A+ rating from Susan B. Anthony list as one of the nation’s strongest pro-life advocates. As a Christian and a father of three, there is nothing more precious and beautiful than the life of a child. https://t.co/mLapw0gQKq","date":"Wed Jan 19 21:41:01 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, I had the honor of administering the oath of office to USMC corporal Jalen Drummond, my former intern from Randolph county. We are all so incredibly proud of you Jalen! #AL03 https://t.co/tDykqfPWwd","date":"Wed Jan 19 01:05:08 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, we honor and remember the life and legacy of Martin Luther King Jr. and the profound impact he had on our nation. #MLKDay https://t.co/GOJE1vUpwa","date":"Mon Jan 17 17:24:32 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended the ribbon cutting for Bonnie Plants in Opelika! Glad to see more businesses continuing to make Alabama’s Third Congressional District their home! #AL03 https://t.co/aJEYSUNtwQ","date":"Fri Jan 14 20:19:15 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great news! SCOTUS has blocked the Biden administration's unconstitutional COVID-19 vaccine mandate for private businesses. \n\nAmericans in the private sector should have never faced the threat of losing their jobs due to presidential overreach.","date":"Thu Jan 13 20:46:13 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden inflation reached a 40 year high last month and grocery stores have empty shelves.\n\nMeanwhile, the Biden administration seems completely unfazed by the hardships facing Americans.","date":"Wed Jan 12 20:25:55 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Incredibly proud of Jahzara Elm, a senior at Pell City High School, who has been appointed to the United States Military Academy at West Point.\nhttps://t.co/RWjzRDcHmX","date":"Tue Jan 11 23:44:03 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi forces every Member of the House to wear a mask on the floor or face absurd fines. Yet, the masks being provided to offices are not even made in the U.S.A. – they’re all made in China.","date":"Tue Jan 11 21:06:35 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden has continually failed to stand-up to Putin and now it seems his administration is doing Putin's bidding by pushing against Nord Stream 2 sanctions.\n\nMeanwhile, in the US, Biden killed thousands of jobs just to prevent the Keystone XL pipeline from being built.","date":"Tue Jan 11 21:03:16 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden continues to mislead the American people on the COVID-19 pandemic. Americans are facing skyrocketing COVID-19 rates &amp; long testing lines. Biden said he’d get COVID-19 under control — a year later, it’s just another failure of his administration.","date":"Thu Jan 06 20:31:12 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden's OSHA COVID-19 vaccine mandate on private businesses is a power grab by the federal government that will cost hard working Americans their livelihoods. \n\nGlad to join my colleagues in opposing this mandate.","date":"Mon Jan 03 21:35:27 +0000 2022","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing you and your family a merry Christmas! 🎄\n \n“Behold, the Lamb of God, who takes away the sin of the world!” – John 1:29 https://t.co/ejRjSzz6nM","date":"Sat Dec 25 15:26:02 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work by Ron Goodenough, Talladega Assistant Fire Chief, who sprung into action to help tornado victims in Kentucky. \nhttps://t.co/9N2eScHarz","date":"Thu Dec 23 20:39:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work by @AuburnFootball cornerback Nehemiah Pritchett who is working to make this Christmas a little brighter for Clarke County kids. \nhttps://t.co/n7gUeX0vmT","date":"Thu Dec 23 20:30:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Merry Christmas from the @AuburnU gingerbread village! 🎄 https://t.co/04xHH8Ydiy","date":"Tue Dec 21 19:40:46 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Birthday @SpaceForceDoD!","date":"Mon Dec 20 18:58:06 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to BR Williams on being named the best trucking company in Alabama! #AL03\nhttps://t.co/1zGzTiJl8w","date":"Thu Dec 16 16:16:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to join @RepDarrellissa @RepFredKeller in standing up for the American worker and urging Speaker Pelosi to immediately bring legislation to the floor to nullify President Biden's dangerous vaccine mandate for private businesses. https://t.co/C85MYMHa4n","date":"Wed Dec 15 19:41:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden’s socialist policies are continuing to harm middle-class families across our nation. Americans everywhere are being faced with skyrocketing gas and energy prices. \nhttps://t.co/tCy06kYa12","date":"Wed Dec 15 15:37:43 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It is my privilege to announce Atticus Cornett of Springville as the winner of the 2021 Congressional App Challenge! #AL03\nhttps://t.co/CwgsbimeUk","date":"Tue Dec 14 19:01:22 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Birthday Alabama! https://t.co/Htwm0OvVzO","date":"Tue Dec 14 15:09:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden inflation has reached a 39 year high.\n \nHeading into Christmas, Americans are paying for just about everything. \n \nMake no mistake, President Biden has continued to exacerbate this crisis by pushing through his socialist spending spree.","date":"Fri Dec 10 16:41:43 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations @ChiefBPartridge!","date":"Fri Dec 10 13:41:16 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to *meat* with the Alabama Cattlemen's Association today! #AL03 🐄 https://t.co/9m8tOCe3V7","date":"Wed Dec 08 20:46:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended a moving ceremony today at Cheaha Mountain for the dedication of a repository for the ashes of retired American flags. #AL03 🇺🇸 https://t.co/dkIF8EcwI8","date":"Wed Dec 08 00:48:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Lauren and Landon Marks of Cherokee County for winning the Excellence in Agriculture award at the Alabama Farmers Federation kicked off its 100th annual meeting! @AlfaFarmers \nhttps://t.co/6ckETU2PI7","date":"Mon Dec 06 17:23:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Pike Road on becoming the Class 5A state champions! \nhttps://t.co/x5iIKBBtkE","date":"Fri Dec 03 15:44:47 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"One thing I hear from leaders across all Services is that multiple CRs are actively damaging military readiness.\n\nThis CR is another example of Democrats’ inability to govern.\nhttps://t.co/iMNtXKi1SF https://t.co/3KPmcZDnjN","date":"Thu Dec 02 22:46:29 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Piedmont High School! Such an exciting game! #AL03\nhttps://t.co/IFc4EczH33","date":"Thu Dec 02 21:09:54 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing all who celebrate, a very happy #Hanukkah!","date":"Mon Nov 29 19:00:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy 100th birthday to Ina Hendley! #AL03 https://t.co/pyuuubn7BY","date":"Mon Nov 29 18:54:20 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing everyone a happy Thanksgiving 🦃\n\n1 Thessalonians 5:16-18: \"Rejoice always, pray without ceasing, give thanks in all circumstances; for this is the will of God in Christ Jesus for you.\" https://t.co/cxjkhKekuB","date":"Thu Nov 25 14:37:19 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My colleagues and I expressed our concern that the Biden administration is leveraging its power in a way to establish a federal gun registry.\n\nAs a stronger supporter of the 2nd Amendment, I will fight against this unconstitutional proposal.","date":"Mon Nov 22 21:55:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"While Americans are struggling this holiday season with rapid inflation, Nancy Pelosi and Democrats are trying to ram through President Biden’s $1.5 trillion tax and spend bill – burdening taxpayers.\n\nhttps://t.co/ebl5WBmBB5 https://t.co/Q8iAKOfnC4","date":"Thu Nov 18 21:33:59 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Members of my office met with Colonel Eric A. McCoy Commander of the Anniston Army Depot #AL03 https://t.co/ULZCHIpBIX","date":"Thu Nov 18 18:56:25 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My colleagues and I are working to stop this unprecedented government overreach by President Biden's administration.","date":"Wed Nov 17 21:05:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with students from Trinity Christian School with @SenTuberville today in D.C. #AL03 https://t.co/6FLqM03nuG","date":"Tue Nov 16 20:22:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Since Biden took office, over 1.6 million illegal immigrants have been apprehended at our southern border. \n\nThe crisis continues to spin out of control. 17,126 illegal immigrants were released into the U.S. by Border Patrol just in this past month.\n\nWhere is President Biden?","date":"Tue Nov 16 20:16:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Grinch                      President Biden \n                               🤝\n             Ruining Christmas\nhttps://t.co/13t6J8qfTu","date":"Tue Nov 16 18:27:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"John Kerry and the Biden administration continue to put our national security at risk for fake promises from the CCP on climate issues. https://t.co/pND3SRUvm6","date":"Mon Nov 15 18:52:18 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to be in Sylacauga today to honor and remember our veterans! 🇺🇸 #veteransday #AL03 https://t.co/SxnMrxNWpv","date":"Thu Nov 11 23:37:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We must remember that our freedom is not free – It is only possible because of the sacrifices made by the incredible men and women who have served our nation.\n\n#VeteransDay2021 \nhttps://t.co/cIHpImiqEs https://t.co/tb0EWOulAW","date":"Thu Nov 11 14:23:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation brought on by Biden's socialist agenda is harming our nation's most vulnerable. Meanwhile, the Biden administration could not seem to care less about the damage inflation is causing. \nhttps://t.co/F6suQgsikC","date":"Wed Nov 10 17:41:41 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Inflation caused by Biden’s socialist agenda is a tax on every American family. \n \nThis was the largest annual increase in 30 years and there's still no end in sight. \nhttps://t.co/nmQkawucM9","date":"Wed Nov 10 17:15:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing @USMC a happy 246th birthday. The brave men and women who serve in the Marine Corps are some of our nation’s best and most selfless leaders. I am incredibly grateful for all who have served our nation. https://t.co/gNmzY7P8jS","date":"Wed Nov 10 16:52:02 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Incredibly concerning report. If the Biden administration is trying to create a national database of gun owners that is a clear violation of the law. We need answers. \nhttps://t.co/BrNrMCnxqW","date":"Mon Nov 08 21:23:23 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Build Back Socialist agenda impedes and bans domestic energy and mineral production, increasing our dependencies on resources supplied by OPEC, Russia, and China.\n\nIt also raises taxes on natural gas... making it more expensive for every American.","date":"Fri Nov 05 16:25:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our nation went from energy independence and a booming economy under President Trump to your Administration begging OPEC and Russia, to increase their oil production. \n\nMy letter to President Biden and Energy Secretary Granholm ⬇️\nhttps://t.co/pMtw1C9ZEb https://t.co/6eoR2mExGR","date":"Fri Nov 05 15:05:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden and the Democrats are trying to pass their socialist agenda without letting the American people know how much it will cost. Why? What are they hiding?","date":"Fri Nov 05 14:27:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden's Build Back Socialist scheme kills jobs. \n\nThe bill overturns provisions included in the Tax Cuts and Jobs Act that authorized energy production in the Arctic that will result in 130,000 Americans losing their jobs.","date":"Fri Nov 05 14:12:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden's Build Back Socialist scheme grants mass amnesty to millions of illegal immigrants and includes over $400 billion in small business tax hikes.","date":"Fri Nov 05 13:47:05 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Some of the pork 🐷 your tax dollars would be spent on in the Democrats Build Back Socialist scheme: \n\nTax credits for electric bicycle's 🚲","date":"Fri Nov 05 13:36:43 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with students from Ranburne High School and learn about the work they’re doing in the Family, Career and Community Leaders of America. #AL03 https://t.co/VBrdu8vJ0B","date":"Thu Nov 04 17:52:47 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My full statement: \nhttps://t.co/kZAmlRyasq","date":"Thu Nov 04 16:27:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Let me be clear, the Biden admin has 0 authority to make health care decisions for private citizens. This unprecedented mandate will have serious &amp; adverse effects on our economy &amp; the lives of hard-working Americans.\n\nThis is an unprecedented display of socialist gov't overreach https://t.co/HhVouYcEUG","date":"Thu Nov 04 16:27:34 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden has made America less safe, trashed our economy, and now he wants to take your hard-earned dollars to fund a socialist spending spree.","date":"Wed Nov 03 18:16:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The American people don't want D.C. Democrats telling them how to raise their kids.","date":"Wed Nov 03 18:01:59 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Alabama passed legislation to have year-round Daylight Saving Time but it takes an Act of Congress to allow them to actually make the change.\n\nToday, I introduced legislation that will allow states like Alabama to stay on Daylight Saving Time year-round.\nhttps://t.co/kNj7rFYlMn https://t.co/hxxPB5i5i7","date":"Tue Nov 02 20:00:13 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden's socialist policies have created an energy crisis.\n \nThis winter Americans could expect to see their heating bills jump as much as 54% compared to last winter.\n \nMeanwhile, President Biden is falling asleep at a European climate summit.\nhttps://t.co/eTMZhK8Emn","date":"Tue Nov 02 17:52:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There are scores of American families who will feel the pinch of inflation in their wallets this Thanksgiving. Meanwhile, President Biden’s administration thinks this is a “high class problem”. Shameful.","date":"Tue Nov 02 16:54:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Overall President Biden and Democrats in Congress have made our nation less safe and caused skyrocketing inflation.","date":"Tue Nov 02 16:14:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Every day we honor and support our military families.  They make incredible sacrifices for our nation, and we thank them. \n\nAs Lead Republican on @HASCRepublicans I will continue to support and fight for our military families – they deserve nothing less. https://t.co/qu9qrOiW2Y","date":"Mon Nov 01 19:59:06 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is insane. President Biden is directly fueling the border crisis.\n\nBiden's not only paying illegal immigrants (potentially a million per family) but according to this article, they could receive more than some families of 9/11 victims received.\nhttps://t.co/YkKAfFvoru","date":"Fri Oct 29 18:30:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My staff attended a ribbon cutting for a new VA clinic in Oxford. #AL03 https://t.co/hFg86gGLZI","date":"Fri Oct 29 18:12:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to speak with the Calhoun County Chamber this morning. #AL03 https://t.co/8VS73CHCp8","date":"Fri Oct 29 17:28:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, we honor all first responders who work every day to keep our communities safe. #NationalFirstRespondersDay https://t.co/HUGriF1CUI","date":"Thu Oct 28 18:09:28 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@RobWittman &amp; I were joined by colleagues in voicing our concern to @POTUS &amp; @SecDef regarding the vaccine mandate for DoD contractors.\n\nWe warned of the long-term damage that this mandate will inflict at a crucial turning point in our deterrence of China\nhttps://t.co/XsatTILfke https://t.co/POblefAzkA","date":"Thu Oct 28 14:33:33 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"‘Blind Eye’: Republican Rep. Slams Biden Admin, Says Supply Chain Crisis Is Affecting School Lunches In His District\nhttps://t.co/41MBOJn64H","date":"Wed Oct 27 19:31:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended a groundbreaking for a new Buc-ee’s in Auburn. This will be a huge addition for the Auburn community. #AL03 https://t.co/TYBHuqNhbt","date":"Wed Oct 27 19:03:20 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"While President Biden and his administration have shamefully tried to spin the supply chain crisis as a ‘high class problem,’ there are children in my district who now face uncertainty when it comes to school meals.\nhttps://t.co/11ls07Ze9K","date":"Wed Oct 27 15:13:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I joined my colleagues in sending @SecBlinken a letter asking for better guidance for processing casework to help American citizens, lawful permanent residents, thousands of SIV applicants who are still trapped in Afghanistan months after Biden's arbitrary withdrawal date. https://t.co/RMA5rqxzvQ","date":"Tue Oct 26 18:10:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Joe Biden's run away inflation is making Thanksgiving more expensive for your family. Meanwhile his administration thinks these are ‘high class problems’.\nhttps://t.co/DkShcne6Ho","date":"Tue Oct 26 15:00:13 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Attn all middle and high school coders in #AL03: This is the last week to submit your app for this year’s App Challenge! For more info, please visit: https://t.co/X1YltBLoTb","date":"Tue Oct 26 14:56:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Alabama families are struggling and now schools, in MY district, are unable to feed children because of the supply chain issues being perpetuated by the Biden administration’s policies. \n\nYet, the Biden administration doesn’t even seem to care. \nhttps://t.co/qgKi3RFLKF","date":"Mon Oct 25 19:18:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Shot                                  Chaser https://t.co/nw3HUquml0","date":"Mon Oct 25 17:45:32 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats!","date":"Fri Oct 22 14:58:16 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Glad to see @EnesKanter speaking out for freedom and calling out the CCP's atrocities. \n\nThe NBA could learn a thing or two from him. \nhttps://t.co/shbJmSHzCo","date":"Thu Oct 21 16:58:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden administration has fueled this supply chain crisis by increasing energy costs, triggering significant inflation through reckless unchecked spending, and attacking American businesses.\n \nNow Americans are struggling and the holiday season for many could be in trouble.","date":"Thu Oct 21 16:19:28 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden admin wants to invade the privacy of every American by allowing the IRS to spy on their bank accounts.\n \nThis isn't about making sure everyone is paying their 'fair share' this is just textbook government overreach.","date":"Thu Oct 21 16:17:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today is Support Your Local Chamber of Commerce day! Chamber of Commerce's do invaluable work strengthening local businesses of all sizes.","date":"Wed Oct 20 19:13:43 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Chatted with Rabren Construction about the football performance center they’re building at AU. #AL03 https://t.co/O1ufy8dyQj","date":"Mon Oct 18 20:05:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet these great students and future leaders from the Auburn High School Key Club! #AL03 https://t.co/wAmnY1DIVk","date":"Mon Oct 18 19:33:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to speak with the Auburn Kiwanis Club! #AL03 https://t.co/qP6RVRHUgu","date":"Mon Oct 18 17:29:25 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Birthday @GovernorKayIvey!","date":"Sat Oct 16 00:36:59 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations!","date":"Thu Oct 14 19:50:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy birthday @USNavy!\n\nGrateful for the brave men and women currently serving and who have served in our naval forces for over 200 years. https://t.co/ZEQy2CLbST","date":"Wed Oct 13 17:29:00 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The g̶r̶i̶n̶c̶h̶  President who stole Christmas.","date":"Tue Oct 12 20:24:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🎙Chatting with @jeff_poor this afternoon. https://t.co/hFUDt1AQ2D","date":"Thu Sep 30 19:30:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unsurprisingly, the people who brought you ‘pass it to find out what’s in it’ don’t want to ‘talk about numbers and dollars.’\n \nHere are the facts since Speaker Pelosi won't say them: Americans will be footing the bill for the Democrats' $3.5 trillion socialist wish list.","date":"Mon Sep 27 22:03:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Disgusting comments from John Kerry.\n \nHe should know that the protection of democracy, freedom, and human rights are paramount – everything else pales in comparison.\nhttps://t.co/WWWO4uSrgP","date":"Fri Sep 24 12:41:24 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"These comments are disgusting. Anti-Semitism has no place in the House of Representatives and @SpeakerPelosi needs to make that clear.\n \nI will always be proud to stand up in support of Israel and I was glad to vote in support of Israel’s right to defend itself.","date":"Fri Sep 24 11:45:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#WarEagle","date":"Mon Sep 20 14:10:24 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing all who observe an easy and meaningful fast on this sacred day of reflection and atonement. #YomKippur\n \nG'mar Chatimah Tovah. https://t.co/Xi6isfmeXV","date":"Wed Sep 15 22:23:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I’ve been saying this for weeks. Go ahead and ask any of President Biden’s top military advisors. They’ll tell you they advised against Biden’s unconditional withdrawal.","date":"Wed Sep 15 15:02:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"So, Members of Congress are fine with attending some New York gala with a bunch of celebrities but not with showing up to vote or attending committee hearings in-person? \n \nIt's time for Speaker Pelosi to end the double standard and end proxy voting.","date":"Tue Sep 14 15:03:22 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Powerful statement from my @HASCRepublicans colleagues ⬇️","date":"Mon Sep 13 16:24:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bidenomics: \n \nInflation + higher taxes = disaster for American families.","date":"Mon Sep 13 13:06:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Suggestion: Maybe the Biden admin should be spending more time pressuring China to release the over 1 million Uyghur's inhumanely imprisoned instead of focusing on climate. \nhttps://t.co/lcf6yCeaeJ","date":"Thu Sep 09 15:40:02 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Afghanistan withdrawal was a catastrophe. There was nothing remarkable about it. \n \nAmerican service members were killed, Americans were left behind, and a dangerous terrorist organization is now in charge.\n \nShame on Speaker Pelosi. \nhttps://t.co/2PpPMWWFPI","date":"Thu Sep 09 15:07:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We don't take orders from communists. \nhttps://t.co/aHl3OMdqtQ","date":"Thu Sep 09 14:44:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Chipman never should have been nominated in the first place. \n \nThe Biden administration needs to nominate someone who will protect our #2A rights. \nhttps://t.co/7hdIrajSEa","date":"Thu Sep 09 14:22:41 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Democrats want to use your tax dollars to fund abortions. \n\nFor more than 40 years, the Hyde Amendment has ensured that Americans are not forced to pay for abortions with their tax dollars. \n\nI will proudly stand up for the Hyde Amendment. #HydeSavesLives","date":"Wed Sep 08 16:58:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to my friend @RepStefanik! \n\nBeth and I are wishing you, Matt, and Sam the very best! 💙","date":"Mon Aug 30 14:12:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It was great to speak at the ribbon cutting and groundbreaking for Wellborn Cabinet! This new facility will have a positive impact on the community’s economy. #AL03 https://t.co/1SoBJNZkJo","date":"Fri Aug 27 18:28:24 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I'm glad to see the Supreme Court protect U.S. national security by ruling that the Biden administration must restart a critical policy by President Trump that protected our southern border. \nhttps://t.co/ll0HJZpxdS","date":"Wed Aug 25 15:04:22 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am praying for my friend and colleague @Robert_Aderholt as he and his family mourn the passing of his father Judge Bobby Ray Aderholt. \n\n\"And we know that in all things God works for the good of those who love him, who have been called according to his purpose.\" Romans 8:28","date":"Wed Aug 25 14:10:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am praying for the family of Lt. Justin Roberts of the Anniston Fire Department who passed away this week after a battle with COVID-19. \n\nhttps://t.co/SZnSs8cITy","date":"Fri Aug 20 19:05:00 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My office attended the leaders of industry and agriculture meeting hosted by the City of Tallassee. Thanks to Mayor Johnny Hammock for the invite. #AL03 https://t.co/1xxp8npTYv","date":"Thu Aug 19 17:48:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to the Webster’s Chapel Volunteer Fire Department for receiving a $49,523.81 grant from the U.S. Department of Homeland Security. This funding will help the fire department purchase new operations and safety equipment.\nhttps://t.co/OWVCMkwPij","date":"Wed Aug 18 16:59:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to the Lay Lake Volunteer Fire Department for receiving an $11,714.29 grant from the U.S. Department of Homeland Security. This funding will help the fire department purchase new operations and safety equipment.\nhttps://t.co/exJ12cGjq9","date":"Wed Aug 18 16:50:16 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to LaFayette Fire &amp; EMS for receiving a $48,619.05 grant from the U.S. Department of Homeland Security. This funding will help the fire department purchase new operations and safety equipment.\nhttps://t.co/SRmVAmXgqO","date":"Wed Aug 18 16:46:22 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am saddened to hear of the passing of my former colleague Rep. Paul Mitchell.\n\nBeth and I are praying for his wife Sherry and their family as they mourn his loss.","date":"Mon Aug 16 16:52:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to join my colleagues in standing up for life. \n\nIt is unconscionable that the Justice Department decided to drop a lawsuit against a federally-funded hospital that forced several nurses to assist in elective abortions despite their objections. \nhttps://t.co/Ua48jqogF0","date":"Fri Aug 13 16:56:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🚨Our office is seeking interns for the upcoming Fall 2021 semester! \n\nFor more information, please visit the link below ⬇️\nhttps://t.co/V8VNdSjVKo","date":"Fri Aug 13 16:48:28 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to host the 2021 Congressional App Challenge \n@CongressionalAC! \n\nAny #AL03 student in middle school or high school can submit an app! #Congress4CS\n\nLearn more here ⬇️\nhttps://t.co/1ZMwMJoHv7","date":"Fri Aug 13 16:45:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you so much to the Alabama League of Municipalities for having me speak. #AL03 https://t.co/qCHMXPjFN8","date":"Fri Aug 13 16:37:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden is STILL ignoring the crisis on our southern border.","date":"Fri Aug 13 14:09:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great meeting with Lincoln mayor Lew Watson, Joey Callahan, and Brandon Tate. #AL03 https://t.co/HKyRAuKVUN","date":"Thu Aug 12 22:07:09 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Shot:                                                  Chaser: https://t.co/R9mtJN8YVQ","date":"Wed Aug 11 19:44:26 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Not only is President Biden's ATF nominee wholly unqualified for the position - Chipman also did an interview with China state T.V. and then failed to disclose his 2012 appearance on a part of the Chinese Communist Party's propaganda machine. \nhttps://t.co/wDnp2Ytx9c","date":"Wed Aug 11 16:11:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with the good folks of the Montgomery Chamber of Commerce. #AL03 https://t.co/2OikYQVoWd","date":"Tue Aug 10 23:16:16 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Because of #Bidenflation, Americans are making less and paying more for just about everything.\nhttps://t.co/0C9ACuX0VG","date":"Tue Aug 10 15:39:01 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great meeting with community leaders in Sylacauga regarding the East Alabama Rural Innovation and Training Hub. #AL03 https://t.co/BvQhn2uXvt","date":"Mon Aug 09 20:15:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I met with Michael Smith and Candace Gulley of Tallapoosa County Girls Ranch and had the honor of presenting them with a Congressional Record in memory of those killed in the tragic car wreck on I-65. The victims continue to be in our prayers. https://t.co/e7voWuIAhH","date":"Mon Aug 09 20:15:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bobby Bowden was a man of incredible character. \n\nI am praying for his family and loved ones.","date":"Sun Aug 08 23:47:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🚨Democrats doled out $783.5 million in stimulus checks to violent criminals in prison.\n\nShameful. \nhttps://t.co/GaXmcGsuub","date":"Sat Aug 07 19:32:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am shocked and saddened to hear about the tragic death of a Pentagon police officer today. I am praying for the family and loved ones of the victim. I am continuing to monitor the situation.","date":"Tue Aug 03 19:41:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Colonel Walker has served honorably as the 36th Commander of the Anniston Army Depot since July 2019. \n\nCongratulations to Colonel Walker on his retirement as Commander of the Anniston Army Depot and thank you for your service to our nation. 🇺🇸\nhttps://t.co/4C6fnW5JwA","date":"Fri Jul 30 14:12:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Power-trip Pelosi is making vaccinated folks at the Capitol wear masks – refusal to comply w/ this political theatre could result in arrest.\n\nSpeaker Pelosi is more focused on D.C. swamp theatre than addressing skyrocketing violence, the crisis at our border, &amp; sky-high inflation","date":"Thu Jul 29 17:10:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The appropriations bills put forth by House Dems last night were partisan wish lists filled with poison pill language – including allowing tax-payer-funded abortions. \n \nI stood up to House Dems, on behalf of my #AL03 constituents, and voted no on these harmful far-left policies.","date":"Thu Jul 29 14:19:10 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A huge congratulations to incoming @AuburnU freshman Sunisa Lee for winning gold in the women’s all-around! #WarEagle \nhttps://t.co/UEiQBIBQWU","date":"Thu Jul 29 14:11:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to host the 2021 Congressional App Challenge \n@CongressionalAC! \n\nAny #AL03 student in middle school or high school can submit an app! #Congress4CS\n\nLearn more here⬇️\nhttps://t.co/1ZMwMJoHv7","date":"Thu Jul 29 13:50:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It's abundantly clear how little Biden cares about securing our southern border. \n\nThis is completely asinine. \n\nPresident Biden's continued inaction and lack of concern is putting our nation at risk.","date":"Tue Jul 27 19:27:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Praying for the family and loved ones of officer Marquis Moorer. \n\nThis is heartbreaking news. \nhttps://t.co/TcqMoNznYd","date":"Tue Jul 27 18:44:41 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Remember to slow down and move over!\nhttps://t.co/DTopnwTqWU","date":"Tue Jul 27 18:19:33 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The young men and women who choose to attend one of our nation’s prestigious service academies embody the very best of what it means to be an American.\n\nCongratulations to the students from #AL03 who will be attending a service academy this fall! \nhttps://t.co/ur5k6GrjmA","date":"Mon Jul 26 15:52:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden's ATF nominee is completely unfit to serve in this role. His comments mocking law-abiding gun owners are disgraceful. \n \nI am proud to always uphold the constitution and protect #2A rights. \nhttps://t.co/N1KWY7qPdm","date":"Thu Jul 22 16:41:13 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Americans are now paying more for things they and their families need than they have in the past 13 years. \n\n• Gas prices are up 45.1%\n• Milk is up 5.6%\n• Fruit is up 7.3%\n\nAmerican families can't afford Bidenflation.","date":"Mon Jul 19 17:34:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to the Opelika Chamber of Commerce on 80 years of service to small businesses! #AL03","date":"Fri Jul 16 18:54:46 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see Auto Custom Carpets open a new location in Oxford and expanding their business in #AL03\n\nCongrats on this new chapter! https://t.co/Tw2lOeimij","date":"Fri Jul 16 16:42:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to host the 2021 Congressional App Challenge @CongressionalAC! \n\nAny #AL03 student in middle school or high school can submit an app! #Congress4CS\n\nLearn more here⬇️\nhttps://t.co/1ZMwMJoHv7","date":"Thu Jul 15 18:18:26 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🚨🚨Democrats are trying to remove the Hyde Amendment – forcing taxpayers to cover the cost of abortion.\n\nI will always be proud to stand up for life and say NO to taxpayer funded abortions. #HydeSavesLives","date":"Thu Jul 15 15:27:16 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The only time Democrats won't spend taxpayer money is when it involves protecting our national security.","date":"Wed Jul 14 18:04:13 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bidenflation is costing your family.","date":"Wed Jul 14 15:18:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Freedom is a God-given right to all – which is why socialism and communism will never stand a chance.","date":"Tue Jul 13 19:27:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bidenflation is costing American families more and more everyday. \n\nPresident Biden's out of touch liberal agenda has created an economic crisis that hurts everyone. \nhttps://t.co/bUeTPLdxli","date":"Tue Jul 13 17:58:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Socialism will always fail.","date":"Tue Jul 13 17:41:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It’s great to see that Command Sgt. Maj. Bennie Adkins’ incredible legacy is being honored with a new veterans home in Alabama. \nhttps://t.co/gnxoYpdHLn","date":"Mon Jul 12 19:26:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I stand with the people of Cuba in their brave fight for freedom as they protest the evil communist regime. #SOSCuba #PatriaYVida","date":"Mon Jul 12 16:34:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden's policies are making our nation less safe.","date":"Fri Jul 09 17:46:33 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@GOPLeader is right: President Biden’s disastrous energy policies have increased costs for American families and decimated American energy independence. \n\nhttps://t.co/ADXrKb83rD","date":"Fri Jul 09 14:29:41 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Join me in praying for @RepHagedorn as he fights cancer. \n \nLuke 1:37: “For with God nothing shall be impossible.”","date":"Thu Jul 08 14:33:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden violence is skyrocketing across the nation. We need law and order. \n \nFund the police.","date":"Tue Jul 06 16:12:00 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I thank God every day that we live in the land of the free. 🇺🇸\n\nHonoring all the brave men and women who protect our freedoms every day.\n\n2 Corinthians 3:17: \"Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom.\" https://t.co/xkWD0WE9Th","date":"Sun Jul 04 13:12:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under President Biden Americans are dealing with: \n\n📈Skyrocketing crime rates \n📈Increased gas prices \n📈Soaring inflation","date":"Wed Jun 30 16:32:11 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Paying more for gas this weekend? You can thank President Biden.","date":"Wed Jun 30 16:17:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to host the 2021 Congressional App Challenge @CongressionalAC! \n\nAny #AL03 student in middle school or high school can submit an app! #Congress4CS\n\nLearn more here⬇️\nhttps://t.co/1ZMwMJoHv7","date":"Wed Jun 30 16:08:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":".@SteveScalise is completely right.","date":"Tue Jun 29 21:34:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden's far-left policies are coming at the cost of your hard-earned money 💸","date":"Tue Jun 29 21:32:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to incoming @AuburnTigers freshman Sunisa Lee for qualifying to compete in the Tokyo Summer Olympics!\n\nhttps://t.co/KHALNjcyIP","date":"Tue Jun 29 20:13:42 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"You can tell a lot about someone's priorities by looking at their checkbook.\n\nI spoke w/ @hughhewitt about how President Biden has put our national security at risk by cutting defense spending.\n\nWe are at a critical point in history. We cannot allow ourselves to fall behind China https://t.co/9cRQIdGkSr","date":"Tue Jun 29 17:21:08 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden wants to cut spending for the military and decimate spending for ICE, while far-left Democrats try to defund the police. \n\nIt's clear the radical-left policies coming from the Biden administration will only make our nation unsafe.","date":"Tue Jun 29 16:08:09 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Apparently, Speaker Pelosi thinks that Members of Congress shouldn’t have to show up to work – I completely disagree. \n \nThe American people elected us to do a job: show up and vote. Politicians don’t deserve special treatment. \n \nProxy voting shouldn’t be extended.","date":"Mon Jun 28 23:19:05 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There is no reason to continue to allow proxy voting.\n\nThe American people expect us to be here and to do the job we were elected to do. \n\nMy friends @RepGallagher and @SteveScalise are right.","date":"Fri Jun 25 21:10:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I submitted a statement into the Congressional Record in honor of the 10 lives lost this weekend on I-65. \n\nMatthew 19:14 “But Jesus said, ‘Let the little children come to me and do not hinder them, for to such belongs the kingdom of heaven.’”\nhttps://t.co/AXw3Zpx1Qo https://t.co/d39X3v5r9e","date":"Fri Jun 25 16:39:59 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"We are mourning the passing of Fmr. Congressman Sonny Callahan. Beth and I send our prayers to his family and loved ones as they grieve.\n \nRomans 8:28: \"And we know that in all things God works for the good of those who love him, who have been called according to his purpose.\"","date":"Fri Jun 25 15:43:51 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden and his far-left policies are failing our communities as violence continues to rise. \n\n“Defund the police” and anti-police rhetoric has very real and tragic consequences. https://t.co/slBokXqHBk","date":"Fri Jun 25 14:16:29 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"When we dedicate scarce defense funding to global climate change, biofuels initiatives, and social engineering experiments with military personnel you can almost hear the cheers and laughter of our adversaries.\n\nMy op-ed with @KenCalvert:\nhttps://t.co/SHXso9hQwT","date":"Thu Jun 24 16:55:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"These numbers paint a disturbing picture of increasing violence that plagues American families across our nation. \n \nPresident Biden needs to step up and lead. “defund the police” is a dangerous and reckless move with real-life consequences.","date":"Tue Jun 22 19:00:28 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am praying for the families of all the victims who were injured or killed in the tragic car wreck on I-65.\n \nIt is devastating to hear that multiple victims were children from Tallapoosa County Girls Ranch, which provides a home for neglected or abused school-age children.","date":"Sun Jun 20 21:10:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Being a father is the most important role I have and everyday I am so grateful to be one. \n\nWishing all dads a happy Father's Day. https://t.co/Q8GO53Se13","date":"Sun Jun 20 11:55:54 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the @USNavy for bringing me a new plaque for my office! https://t.co/PJ1NXcA893","date":"Thu Jun 17 19:18:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It was great to chat with some the folks who are interning for the House of Representatives this summer. The opportunity to work in these halls is an incredible honor that I hope each and every one of you will cherish and learn from. https://t.co/nrAMRFeHZE","date":"Thu Jun 17 19:15:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#OnThisDay in 1885 the Statue of Liberty arrived in New York Harbor. \n \n\"Give me your tired, your poor, your huddled masses yearning to breathe free.” https://t.co/tk8hK1Tdog","date":"Thu Jun 17 15:11:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to @RepBlakeMoore and his wife Jane on this exciting news!","date":"Thu Jun 17 15:03:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to stand up for life with @RepRosendale.","date":"Wed Jun 16 16:51:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Birthday @USArmy! Thank you for the cupcakes  🧁 https://t.co/ksR6nwXjPZ","date":"Tue Jun 15 20:44:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great talking with VADM Hill about adequately funding U.S. missile defenses. I conveyed that we need to get NGI online and replenish Iron Dome. The Biden budget cuts missile defense and short-changes defense of Guam and Hawaii. Our warfighters deserve better. https://t.co/QRpdcmTq8C","date":"Mon Jun 14 22:48:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing @USArmy a happy 246th birthday! Thank you to the brave men and women who keep our nation safe. https://t.co/S6zZ7sh1YB","date":"Mon Jun 14 15:10:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Incredibly grateful for all the brave men and women who have served and are currently serving in our Armed Forces. \n \n#FlagDay 🇺🇸 https://t.co/LICxY1GO2E","date":"Mon Jun 14 15:09:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Commander in Chief should know that the biggest threats facing the U.S. are China &amp; Russia.\n\nIt's a disservice to the brave men &amp; women standing behind him that he would spread political falsehoods about the threats we face.\n\nChina &amp; Russia welcome this weakness from POTUS.","date":"Fri Jun 11 13:49:47 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Beth &amp; I are praying for @RepTerriSewell &amp; the Sewell family as they mourn the loss of her mother, Nancy Gardner Sewell. The first African American councilwomen for Selma — she was a leader &amp; a trailblazer.\n\n\"Blessed are those who mourn, for they will be comforted.\" Matthew 5:4","date":"Fri Jun 11 00:33:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Bidenomics is making life MORE expensive for all Americans. \n\n📈Gasoline is 56.2% MORE expensive today than 12 months ago.\n\n📈Together, food and energy prices have increased 3.8%. That's the fastest rate since 1992!","date":"Thu Jun 10 15:17:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If you're in Bibb, Calhoun, Clay, Hale, Jefferson, Perry, Randolph, and Shelby Counties and you’re seeking federal assistance in your recovery from the tragic tornadoes that affected the area March 25.\n\nYou can apply via FEMA at https://t.co/mBUl2rp0Oq","date":"Thu Jun 10 13:42:12 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Too little too late from Vice President Harris. The Biden administration’s failed policies led to this crisis and the Biden administration must fix it. \n \nEnforce the law. Build the wall.","date":"Wed Jun 09 15:43:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It was wonderful to meet with Mayor Betty Bradley and Mayor Pro Tem Dusty Stinson for lunch today. #AL03 https://t.co/vZ94Gw0Lga","date":"Tue Jun 08 18:57:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In Riverside today hearing from constituents and giving them an update of what I’m doing in D.C. to help them. #AL03 https://t.co/JpYTX1iXzj","date":"Tue Jun 08 18:51:05 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the folks at Amerex for showing me around and for presenting me their Fire Safety Advocate of the Year Award. #AL03 https://t.co/mmlyN2G3p8","date":"Tue Jun 08 18:29:48 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always enjoy time with Kenny Dean on The Front Porch show. Thanks for having me.  #AL03 https://t.co/Sul9k3bUJR","date":"Mon Jun 07 20:45:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with Mayor Woody Baird and State Rep. Ed Oliver today in Alexander City. #AL03 https://t.co/Uc2HJDYMXm","date":"Mon Jun 07 20:27:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great meeting today with Commissioner TC Coley and Chad Odom, Director of the Lake Martin Area Economic Development Alliance. #AL03 https://t.co/5kgqOXVei7","date":"Mon Jun 07 20:21:25 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing the Lincoln rocket team good luck as they prepare for The American Rocketry Challenge 2021 national finals on June 12 🚀 #TARC2021\nhttps://t.co/Hfynov6xxE","date":"Mon Jun 07 19:37:08 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great chat with Mayor Goodman of Dadeville over lunch today at Oskars Cafe. #AL03 https://t.co/TzYW5sktId","date":"Mon Jun 07 19:30:22 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There is still a crisis at our southern border and it is imperative that Congress continues to make our national security a priority. \n \nWe need officials at DHS who will enforce the law.","date":"Mon Jun 07 17:37:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to visit with Bob Dudley at East Alabama Lumber in LaFayette during my time in Chambers County last week. #AL03 https://t.co/d7U74KUGf4","date":"Mon Jun 07 16:45:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Brig. Gen. Tara McKennie on her historic achievement! \nhttps://t.co/OUQxCk0A8L","date":"Mon Jun 07 16:20:18 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“The eyes of the world are upon you. The hope and prayers of liberty-loving people everywhere march with you.” — Gen. Dwight D. Eisenhower\n\nWe must never forget the sacrifices made by the courageous Allied troops who stormed the beaches of Normandy on D-Day. https://t.co/EHmpfWnCfW","date":"Sun Jun 06 15:57:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Beth and I are wishing Elise and Matt the very best! Congratulations!","date":"Sat Jun 05 21:36:06 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📸: Photos courtesy of Shanna Lockwood","date":"Fri Jun 04 19:10:57 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Completely agree with @coachbrucepearl. Israel has the absolute right to defend itself against Hamas and other terrorists.","date":"Fri Jun 04 16:25:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"NOW: Talking with my friend Tex Carter on WHMA 95.3FM!","date":"Fri Jun 04 16:10:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"48% of small business owners reported unfilled job openings.\n \nThis is the #BidenEconomy. Main Street suffers when people are getting paid NOT to work.\nhttps://t.co/oqJ4HE0iKR","date":"Thu Jun 03 21:15:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Toured the Advanced Manufacturing Training Center in Auburn. \n\nAdvanced manufacturing is critical for the future of our economy and national security  #AL03 https://t.co/yjRNsFHlDj","date":"Thu Jun 03 21:14:34 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great lunch today with Mayor Anders, Mayor Fuller and Mayor Haygood. #AL03 https://t.co/QUgMReBOpP","date":"Thu Jun 03 18:59:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Met with Jimmy Sharp and John Sharp and toured John Emerald Distilling Company. \n\nWhen the pandemic started, they helped the community by using their distillery to make hand sanitizer. #AL03 https://t.co/hzF5T1YAh2","date":"Thu Jun 03 18:51:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Seeing the damage at Lanett High School with Head Coach Clifford Story and Superintendent Jennifer Boyd. #AL03 https://t.co/LPkEvzVGRE","date":"Wed Jun 02 20:17:19 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"If you were affected by the tragic tornados that struck the area March 25th – you can apply for a @SBAgov physical disaster loan. \n \nDeadline to apply is June 25th: \nhttps://t.co/82Pvu91XsX","date":"Wed Jun 02 19:00:11 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"These folks are hard at work rebuilding at County Line Volunteer Fire Department in Clay County! #AL03 https://t.co/dlmnWr7FAE","date":"Wed Jun 02 17:24:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In Valley today visiting The Growth Academy with founder Yancey Gatlin.  #AL03 https://t.co/rYNZBRiSWG","date":"Wed Jun 02 17:15:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"That is the truth. I appreciate Lee and Matthew showing me the damage still around Corinth Volunteer Fire Department in Randolph County. #AL03 https://t.co/yxJIXin8Je","date":"Tue Jun 01 23:46:33 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to the 13 newest Alabama Troopers! \nhttps://t.co/EH2rX7dAV7","date":"Tue Jun 01 18:23:57 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work by the outstanding officers with the Pell City Police Department who ran through downtown Pell City to raise money and awareness for the Alabama Special Olympics.\nhttps://t.co/IlZkQZ2gSP","date":"Tue Jun 01 16:53:18 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to be in Randolph County last week for the Business Appreciation Luncheon. #AL03 https://t.co/3DkAKoP73W","date":"Tue Jun 01 16:40:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#BidensBudgetBlunder cuts defense spending by $4 billion dollars but allows for public funding of abortions.\nhttps://t.co/m1C7WmNSED","date":"Tue Jun 01 15:36:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"17-year-old Kieran Moise, of Huntsville, has raised an incredible $20,000 for families dealing with cancer. \n \nThe Air Force Academy will be lucky to have Moise this fall. \nhttps://t.co/o0KKeaWdgY","date":"Tue Jun 01 14:14:49 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“Greater love has no one than this: to lay down one’s life for one’s friends.\" John 15:13 \n \nToday we honor the memories of the selfless men and women who made the ultimate sacrifice in defense of our nation and our freedoms. \n \nFreedom is not free. https://t.co/cg9mSjA7w2","date":"Mon May 31 12:25:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Chinese Communist Party covered-up this virus from the world and their willful deception unleashed a year of global tragedy. \n\nNow, the CCP continues to block investigations into the true origins of COVID-19. \n\nThe American people and the world have a right to the truth.","date":"Fri May 28 15:29:11 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Trump withdrew from the Open Skies Treaty due to Russia’s violations of the treaty, &amp; serious concerns regarding threats to U.S. critical infrastructure. I welcome reports that President Biden will uphold Trump's decision &amp; not attempt to rejoin #OST.","date":"Thu May 27 19:04:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Christine Wormuth on her historic confirmation as Secretary of the @USArmy. \n\nI look forward to working with her in support of the brave men and women who serve in the U.S. Army.","date":"Thu May 27 15:45:26 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Agreed. As General Hyten told me in 2017 “No, our nuclear forces are not on ‘hair trigger alert.’ Comprehensive and redundant personnel, technical, and procedural safeguards preclude the unauthorized use of TRIAD nuclear forces.\" \nhttps://t.co/vJpuCW02qe","date":"Thu May 27 00:41:56 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Biden admin shut down an investigation started by @mikepompeo to find the true origins of the deadly COVID-19 pandemic but will gladly support an \"investigation\" by the WHO which has routinely covered up for the Chinese Communist Party. https://t.co/Ugip1tp1Fo","date":"Wed May 26 15:16:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It was always just politics… https://t.co/eIxPTv6a6W","date":"Tue May 25 13:40:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The antisemitic attacks happening across our nation are vile and despicable. I stand with our Jewish communities.","date":"Mon May 24 18:36:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Just another day for the Biden Border Crisis. \n \nThe Biden admin seems to think that if they continue to ignore this crisis it will go away, meanwhile CBP officers at the southern border continue to be overwhelmed.","date":"Mon May 24 18:29:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I cannot vote in favor of a partisan commission that will not look at all political violence against Members of Congress and Capitol Police. \n\nMy statement: https://t.co/yDfPlw9FBu https://t.co/pEpA82uigT","date":"Wed May 19 23:29:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Maybe President Biden should try to tell the terrorist group Hamas that he expects ‘a significant de-escalation’ in rockets fired at Israel.  \n \nIsrael is our ally and they have a right to defend themselves while being attacked. \nhttps://t.co/z7E38h75zV","date":"Wed May 19 21:46:26 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"While President Biden has killed countless American jobs by halting pipeline projects here in America, he has no qualms about enabling Russia, a foreign adversary, to build its own with Nord Stream 2.","date":"Wed May 19 21:09:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I have no words. These students have bravely committed to serving our nation and protecting our freedoms in the United States Coast Guard.\n \nAnd for some reason, President Biden decided to quote Mao Zedong, a communist dictator and mass murderer, at their graduation.","date":"Wed May 19 21:08:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It was great to meet with the folks of the Alabama Home Builders Association today. https://t.co/u184Y4AzKS","date":"Wed May 19 20:17:20 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today, I was honored to meet with Acting Secretary of the Navy Thomas Harker, Chief of Naval Operations Admiral Mike Gilday, and Commandant of the Marine Corps General David Berger. \n\nI am grateful for their leadership of the men and women in the @USNavy and @USMC. https://t.co/e9bDKKuXuV","date":"Tue May 18 22:02:15 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Sarah Crow, our first place winner in this year’s art competition.  Her winning artwork is titled, “Inspire the World” #AL03 \nhttps://t.co/D0rHixTMCR https://t.co/UJR9Drzz55","date":"Fri May 14 15:46:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to my friend, @RepStefanik!  You are going to do great!","date":"Fri May 14 15:36:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Biden is failing our great ally. I will ALWAYS stand with Israel.","date":"Thu May 13 16:38:20 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Photos from today’s Alabama Law Enforcement Ceremony to remember those who have paid the ultimate sacrifice.  I will always #BacktheBlue. https://t.co/3FsX2bHyPR","date":"Wed May 12 17:15:29 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"To all the wonderful mothers out there, I hope you’ve had a happy Mother’s Day! https://t.co/hpQSdr9bod","date":"Sun May 09 21:49:23 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Rogers on dismal April Jobs Report https://t.co/PtoyM0fHYf","date":"Fri May 07 16:54:58 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to all military spouses for your sacrifices today and every day! https://t.co/DOcqJ0xF1v","date":"Fri May 07 16:06:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today is National Day of Prayer and this year’s theme is:  Lord Pour Out Your Love, Life and Liberty.                                             “Now the Lord is the Spirit, and where the Spirit of the Lord is, there is liberty.” 2 Corinthians 3:17 https://t.co/MxMvCNQ0it","date":"Thu May 06 12:47:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In a virtual House Armed Services Committee hearing this morning. https://t.co/aWSHOZy8tk","date":"Wed May 05 15:48:41 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"What a treat to get to virtually visit with students at Wadley High School this morning! #AL03 https://t.co/mo8SLCrlpv","date":"Tue May 04 17:07:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to @WEACTV24 for having me on today to give an update on what’s been going on in Washington. https://t.co/LSYjB7Raja","date":"Tue May 04 16:10:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Rogers on Biden address to Congress\n “Where President Trump put America first, President Biden is doing everything he can to make America last.” \nhttps://t.co/C2cMcd8Z2A","date":"Thu Apr 29 02:47:58 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden:  America Last.\nTrump:  America First.","date":"Thu Apr 29 01:28:08 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Just like their effort to pack the Supreme Court, Democrats in Congress have no respect for our Constitution.","date":"Thu Apr 22 16:54:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Radical Democrats continue to push their Socialist agenda on America. The DC Statehood bill is a blatant power grab to fundamentally change the US Senate to try and create a permanent majority for Chuck Schumer.","date":"Thu Apr 22 16:54:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI: Standing Against Democrats’ Dangerous Double Standards\n \nhttps://t.co/En9EiEj38y","date":"Tue Apr 20 21:40:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"High School students in #AL03: This is your chance to have your art displayed in the U.S. Capitol! Submit your art to the Congressional Art Competition.\n \nLearn more: https://t.co/C4Jd0rF5BW","date":"Fri Apr 16 15:31:31 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Rogers: Pelosi, Democrats Supporting Infanticide\nhttps://t.co/Yc9FlH6IL0","date":"Wed Apr 14 21:48:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am proud to sign onto this discharge petition to force immediate consideration of the #BornAlive Act and defend the right to life.\n \nProviding life-saving care to the most vulnerable among us should not be controversial.","date":"Wed Apr 14 21:38:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"https://t.co/91db1Tgir6","date":"Wed Apr 14 19:39:51 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"https://t.co/hPC2sVnhKS","date":"Wed Apr 14 13:24:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Only a small percentage of this bill even addresses infrastructure. I’m against this package, and I will fight against it in the House.","date":"Tue Apr 13 20:29:52 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden’s “infrastructure” bill is nothing more than a massive tax hike in disguise. Our nation’s infrastructure is crumbling, but all Joe Biden is focused on is green new deal and liberal, environmentalist job killing.","date":"Tue Apr 13 20:29:51 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great news for Alabama!\nhttps://t.co/tuWboEI9MD","date":"Fri Apr 09 17:31:18 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Today President Biden made official what we’ve known for a while: Democrats are set on dismantling the Second Amendment. https://t.co/XOQJqeuYTP","date":"Thu Apr 08 18:19:09 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"You aren’t taking the guns of law-abiding citizens or our right to bear arms, Mr. President.","date":"Thu Apr 08 16:45:55 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great morning in Montgomery at Eggs and Issues.  Thanks for having me! https://t.co/m47VUXkEuh","date":"Tue Apr 06 13:47:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"He IS Risen!  Happy Easter! ✝️ https://t.co/PQo7grbVx9","date":"Sun Apr 04 17:07:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My staff is on their way to help deliver supplies to Clay County’s damaged area. Supplies can be delivered to Clay County Farmers Market. Contact Clay Co EMA at 256-396-5886 for more information. https://t.co/5QbgACur9W","date":"Tue Mar 30 17:35:48 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Visiting the devastation at Ragan Chapel United Methodist Church. https://t.co/FHQ8WXmfw9","date":"Mon Mar 29 18:31:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"With @ChiefBPartridge and @SenTuberville to look at the tornado damage on the ground. #AL03 https://t.co/vCrEQnzgrc","date":"Mon Mar 29 16:18:58 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"AUsome job!  Congrats and War Eagle!","date":"Sun Mar 28 04:31:21 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our hearts are with all across Calhoun County and the State of Alabama as we mourn the lives lost after yesterday's tragic tornadoes.  Please keep these folks in your prayers as the cleanup and rebuilding of communities and lives begins. #AL03","date":"Fri Mar 26 13:57:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always great to visit with you, Jeff!","date":"Fri Mar 26 13:39:57 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to join over 120 of my colleagues to reiterate our outrage as Pelosi tries to overturn a free and fair election for Iowa’s Second District.  The hypocrisy is through the roof. https://t.co/d7pTMMewuV","date":"Wed Mar 24 15:12:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Instead, Speaker Pelosi and Democrats hope to turn these amnesty recipients into voters to continue pursuing their radical far-left agenda.","date":"Fri Mar 19 17:51:40 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Sadly, instead of addressing Biden’s Border Crisis, Pelosi called a vote on and passed H.R. 6. If Democrats were serious about immigration, they would do something about the national security crisis along our southern border.","date":"Fri Mar 19 17:51:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Just two months into office, President Biden has created a crisis at the border by halting wall construction, preventing any deportations and promising a pathway to citizenship to 11 million illegal immigrants.","date":"Fri Mar 19 17:51:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Just last month, over 100,000 migrants attempted to cross the border, which is more than three times the number of attempts one year prior.","date":"Fri Mar 19 17:51:39 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣High School students in #AL03 can now submit their entries for the 2021 Third Congressional District Art Competition. \n\nSubmissions close April 23rd and the winning entry will displayed in the U.S. Capitol!\n\nFor details, please visit: https://t.co/C4Jd0rF5BW","date":"Fri Mar 19 15:07:17 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to see Alabama join this lawsuit against the Biden Administration. This is why I’m a proud cosponsor of H.R.684, which would reauthorize the Keystone XL Pipeline.\n \nWhen faced with good-paying jobs or catering to radical environmentalists, President Biden made his decision.","date":"Thu Mar 18 18:06:45 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Illegal immigrants are pouring across our border at alarming rates. The Biden Administration has no clue how many have gotten into the United States.  Many are not being tested for COVID-19. Equally aggressive some even showed up on the terrorist watchlist.","date":"Thu Mar 18 17:39:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The only way to fully secure our border is to finish building President Trump’s wall and end the endless migrant caravans at their start.  Unfortunately the Biden Administration is wedded to Open Borders and amnesty instead of putting America first.\n\nhttps://t.co/fB565vsX1z","date":"Thu Mar 18 17:39:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"To echo the top Republican on the House Homeland Security Committee, “there is disorder at the border by executive order.” The illegal immigration crisis at our southwest border is the sole result of Biden’s disastrous policies.","date":"Thu Mar 18 17:39:37 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nancy Pelosi is looking to overturn a valid certified election in Iowa of a sitting Member of Congress.  Nancy Pelosi likes to move the goal posts when the game isn’t going her way.\n\nhttps://t.co/ao0bRuy4oM","date":"Wed Mar 17 19:29:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Be prepared and stay safe!","date":"Wed Mar 17 12:54:34 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Only 9 percent.  That means 91 percent for Pelosi’s pet projects.","date":"Fri Mar 12 03:13:43 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rogers on H.R. 8 and H.R. 1446:  “As a proud gun owner, these two bills disgust me.  I stand in strong opposition to them as they are just more attempts by the left to treat our Second Amendment as a second-class right.”\nRead more here:  https://t.co/1av76IJv7E","date":"Thu Mar 11 18:29:00 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Does Bernie Sanders really think he knows what’s best for Alabama’s workers?","date":"Wed Mar 10 16:37:11 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Glad to see students from @TalladegaColleg and @TuskegeeUniv will represent #AL03 this weekend during the @HCASC National Qualifying Tournament! Good luck! #HCASC","date":"Fri Mar 05 20:52:33 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Any high school student artists in #AL03 out there? If so, check out the 2021 Congressional Art Competition! Details here: https://t.co/C4Jd0rF5BW","date":"Fri Mar 05 16:53:11 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Make no mistake: #HR1 is a complete power-grab by Democrats in Washington.","date":"Thu Mar 04 16:32:30 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I've long advocated for a creation of a cyber academy. Glad to see the @AiCommission recognize the importance of training the next generation of workers and ensure the U.S. can outpace our adversaries. I hope my colleagues will join me to make this a priority in the NDAA.","date":"Tue Mar 02 21:03:27 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣Attention #AL03 Students: The 2021 Congressional Art Competition is officially open! Aspiring young artists in #AL03 can submit their work before Friday, April 23rd for a chance to showcase their talents! Details here: https://t.co/7a1CxMMIMn","date":"Fri Feb 26 20:46:05 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Read my statement today ahead of the vote on H.R. 1319. The legislation was framed as COVID relief, but has proven to be nothing more than Pelosi's plan to cater to progressives. I am strongly opposed to the bill.\nhttps://t.co/tIgyfSwQNo","date":"Fri Feb 26 20:20:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"https://t.co/rBdkSUsAj7","date":"Fri Feb 26 14:43:08 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Just 9 percent.","date":"Fri Feb 26 13:17:28 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Pelosi Payoff is a Ripoff of the American People.","date":"Thu Feb 25 13:04:58 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"While Democrats play politics...Republicans are working to: https://t.co/pfk9wAC4OO","date":"Wed Feb 24 21:19:19 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rest In Peace.\nCome to me, all you who are weary and burdened, and I will give you rest. Take my yoke upon you and learn from me, for I am gentle and humble in heart, and you will find rest for your souls. For my yoke is easy and my burden is light. Matthew 11:28-30","date":"Wed Feb 17 18:09:34 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to sign onto this important letter. Democrats will use any opportunity, including a pandemic, to push through their pro-abortion agenda.","date":"Tue Feb 16 14:57:29 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Acquitted ... again.   At least Democrats can’t pass their Socialist agenda while pursuing political vendettas against President Trump.","date":"Sat Feb 13 22:36:20 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Senator Richard Shelby is one of the greatest statesmen Alabama has ever produced.  He has devoted his professional life to Alabama and our State is stronger and greater because of his service.  We  can never say thank you enough to Senator Shelby and his leadership.","date":"Mon Feb 08 22:23:09 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy birthday to President Reagan! https://t.co/KSr5bfTZQO","date":"Sat Feb 06 18:50:46 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi, just like her Governor Gavin Newsom, think the rules don’t apply to them like they impose on all of us little people.","date":"Sat Feb 06 00:41:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Beth and I were saddened to learn of the passing of Martha.  Our hearts and prayers go out to Jim and his family.\n “The Lord is close to the brokenhearted and saves those who are crushed in spirit.” Psalm 34:18","date":"Thu Feb 04 17:07:14 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Biden has signed 42 executive action in less than two weeks.  Unity? https://t.co/XcpZi2nAkN","date":"Tue Feb 02 16:07:50 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to @AlfaFarmers on 100 years of service!","date":"Mon Feb 01 14:50:36 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"As a father of three and a Christian, standing up for the lives of the unborn is of utmost importance to me. I will always fight for the right to life. #WhyWeMarch","date":"Fri Jan 29 21:21:07 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"As our country now faces a new administration and a Democrat majority in Congress, it has never been more important to stand up for the sanctity of life and the rights of the unborn.Democrats in Washington are as determined as ever to push their pro-abortion agenda on our nation.","date":"Fri Jan 29 21:21:06 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Proud to support the Born Alive Act. It has never been more important to stand up for the right to life #WhyWeMarch","date":"Fri Jan 29 15:39:44 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today marks the 48th anniversary of the Roe v. Wade decision.  As a Christian and father of three, I will always stand up for the rights of the unborn.","date":"Fri Jan 22 20:41:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unacceptable!  This is no way to treat our brave men and women in uniform who are protecting our Capitol.  I will get to the bottom of this.\n\nhttps://t.co/9hjPpSGB3o","date":"Fri Jan 22 03:06:35 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am proud to support these major accomplishments. Thank you, President Trump, for everything you did to make America great again.","date":"Wed Jan 20 17:55:32 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today I voted against the impeachment of President Trump. This action by Speaker Pelosi will only further divide our nation. Just like yesterday when she proceeded with a vote on a resolution concerning the 25th Amendment even after Vice President Pence rejected it.","date":"Wed Jan 13 22:02:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The partisan political divide in our nation can only begin to be addressed by instilling confidence in our elections. Our nation would be better served if Pelosi would work with Republicans to bring trust and confidence in our elections rather than to further divide our nation.","date":"Wed Jan 13 22:02:53 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Statement on Alabama as new home to U.S. Space Command\n\n\nhttps://t.co/w3wm6NE2pi","date":"Wed Jan 13 21:22:38 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"There is no place for political violence in America. Whether it is from the left or the right, it is abhorrent and wrong.  We are a nation built on law and order and must remain so.","date":"Thu Jan 07 13:15:57 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The results of a handful of states critical to both campaigns are in serious doubt. Our elections should be free, fair and transparent. The 2020 election was not. Therefore, I will object to the results of the Electoral College.\nhttps://t.co/LQo25luVqY","date":"Mon Jan 04 18:50:04 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In addition, election officials in certain states appeared to have deliberately acted in an unconstitutional manner to manipulate the results.\nThese allegations of election fraud must be thoroughly investigated before Congress can act.","date":"Mon Jan 04 18:50:03 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our Leader is absolutely right.  Fight for America.","date":"Sun Jan 03 22:43:42 +0000 2021","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great news out of @CityofAuburnAL! #AL03","date":"Mon Dec 21 18:20:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This morning I tested positive for COVID-19.  I immediately consulted with the Office of the Attending Physician and am currently self-isolating. I am experiencing mild symptoms but otherwise I am in good spirits and looking forward to getting back to work soon.","date":"Thu Dec 17 16:49:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to the @USArmyOldGuard for their care and duty in rendering Alabamian and American hero Sgt Mjr Bennie Adkins his honors today as he was laid to rest.","date":"Wed Dec 16 17:39:10 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to @GovernorKayIvey who has ordered Alabama’s flags to be flown at half-staff tomorrow to honor Medal of Honor Recipient Bennie Adkins. Sgt Mjr Adkins was a true American hero. He will he laid to rest tomorrow at Arlington National Cemetery.","date":"Tue Dec 15 15:02:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to USAACE and Fort Rucker for the aerial tour this morning with my good friend @RepMarthaRoby. https://t.co/puSOC33z1l","date":"Mon Dec 14 19:48:57 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rest assured, I am standing in support of the Texas case before the Supreme Court. I am deeply concerned about protecting the integrity of our future elections.","date":"Fri Dec 11 16:58:27 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This year, our office hosted the @CongressionalAC for students in #AL03. Take a look at this creative app from our winner, Atticus Cornett. https://t.co/jUfQnF5pR1 Congratulations Atticus!","date":"Mon Dec 07 19:54:07 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to @MacTXPress, an outstanding example whose voice and knowledge we will miss dearly.","date":"Thu Dec 03 16:05:51 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to our great Leader @GOPLeader for the kind words and support today. https://t.co/ie0GC5kRu0","date":"Thu Dec 03 15:07:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It’s an honor to have just been selected by my colleagues to lead the Republicans as Ranking Member of @HASCRepublicans. I will work to modernize our military, combat our rising adversaries, and dominate the battlefields of this century. https://t.co/okB63ZIdOt","date":"Thu Dec 03 14:26:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to AL03's own Worth the Wait! https://t.co/Sj7K9lzzW3","date":"Wed Dec 02 20:57:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Wishing everyone across Alabama and our great country a happy and safe Thanksgiving today! https://t.co/dAlxHrRFEE","date":"Thu Nov 26 15:46:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This should never happen to another American!","date":"Wed Nov 25 22:02:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am honored to once again be named an #NDAA Conferee. Being at the table to negotiate the #NDAA is more important than ever. With more threats to our great nation every day, I will continue to advocate for a strong National Defense. 🇺🇸 \n\nRead more: https://t.co/rAqBMI2gGF","date":"Wed Nov 18 23:50:45 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I would say this is unbelievable, but unfortunately, Nancy Pelosi’s attempts to weaken our great Congress should be expected at this point.","date":"Thu Nov 12 02:24:14 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This Veterans Day, join me in thanking all who have served. Without you and your loved ones’ sacrifices, America would be much less free and full of opportunity. We thank you #VeteransDay https://t.co/ke3wPBgLqA","date":"Wed Nov 11 13:13:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#HappyBirthdayMarines!","date":"Tue Nov 10 15:12:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to it!","date":"Mon Nov 09 14:12:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Alabama does elections right. Every one of the battleground states should do themselves and our nation a favor and call @JohnHMerrill for help.","date":"Mon Nov 09 00:37:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"@realDonaldTrump is absolutely right to challenge these results through all relevant legal means.This is as much about 2020 as it is for future elections.","date":"Mon Nov 09 00:37:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unfortunately, some states are utterly incompetent at running an election. Many Americans will view the 2020 election in doubt because of the operations of these states. And that will only undermine the integrity in our institutions going forward.","date":"Mon Nov 09 00:35:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great job by my colleague @EliseStefanik!","date":"Sun Nov 08 19:19:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Count the legal ballots only!","date":"Sat Nov 07 21:05:52 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see my friend Lamar Dewberry at lunch with the Clay County Economic Development Council! https://t.co/mwg5jeOlTb","date":"Mon Nov 02 18:29:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🚨 folks in #AL03- be weather prepared for #HurricaneZeta","date":"Wed Oct 28 19:00:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Republicans support our brave law enforcement. Thank you @GOPLeader for your support!","date":"Tue Oct 27 14:56:18 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Another success for @realDonaldTrump and for America.","date":"Tue Oct 27 00:30:45 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to the Pinhoti trail alliance for having me at Calhuga Creek Park to talk about the park and the Pinhoti National Recreation Trail! https://t.co/69s8dbrSsV","date":"Mon Oct 26 21:18:20 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to the folks at Rusken Packaging in Heflin for having me today! https://t.co/I4BDY3a6Cu","date":"Mon Oct 26 20:41:15 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always great to see my friend, Cleburne County Probate Judge Ryan Robertson! https://t.co/pPATGjSWvY","date":"Mon Oct 26 20:20:23 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great tour of the Carillon Oaks Assisted Living in Heflin today! https://t.co/Jss9KbqrVk","date":"Mon Oct 26 19:09:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to the folks at Auburn University College of Engineering for the tour and meeting today! https://t.co/91uK4g9ClC","date":"Thu Oct 22 17:20:13 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always a great day when I get to catch up with Dr. Gogue at @AuburnU! https://t.co/HUJYGMARzO","date":"Thu Oct 22 15:51:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to @AuburnAg and @AuburnU for having me this morning to speak to an Ag Law class! https://t.co/Y4BSZ2Kxss","date":"Thu Oct 22 14:13:44 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great day in Auburn presenting a Congressional Record statement to the Auburn fishing team. Congrats on the National Championship! https://t.co/puqrGSZdnT","date":"Thu Oct 22 13:42:45 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I appreciate Mayor Riley and John Soules giving me a tour of the new John Soules Foods facility in Valley! https://t.co/bPts2BTiTe","date":"Wed Oct 21 17:55:24 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Getting ready for a driving tour of Lanett’s downtown improvements! https://t.co/cEsIUcRM9z","date":"Wed Oct 21 16:30:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great morning in Lanett hearing from Chris Busby of the Chambers County Development Authority! https://t.co/3I6tRnAvHU","date":"Wed Oct 21 15:46:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work by @GOPLeader and @RepMcCaul introducing an Act to finally hold China accountable.","date":"Wed Oct 21 13:50:11 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to the Anniston Kiwanis Club for having me as a speaker today! #AL03 https://t.co/v1NV25kAhg","date":"Thu Oct 15 17:34:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Trump Derangement Syndrome on full display!","date":"Fri Oct 09 13:55:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to it!","date":"Thu Oct 08 13:40:57 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for recognizing this great company. Wickles Pickles are a staple of every Alabamian, and best of all- they were founded in Alabama’s beautiful Third Congressional District!","date":"Wed Oct 07 21:55:20 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Birthday to my good friend @SteveScalise!","date":"Tue Oct 06 21:31:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🗣 spread the word in your communities! Complete your census- too much is at stake not to!","date":"Mon Oct 05 20:49:30 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Calling all middle and high school students in #AL03 interested in coding! Submit an app for the 2020 Congressional App Challenge. #Congress4CS","date":"Mon Oct 05 17:20:18 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Praying for our president @realDonaldTrump as he heads to Walter Reed to get some of the best care in America. https://t.co/FJkNXOEvi5","date":"Fri Oct 02 23:06:09 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our prayers are with @realDonaldTrump and @FLOTUS. Please lift them up as they fight against this virus.","date":"Fri Oct 02 10:34:00 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My colleague @SteveScalise is exactly right. We must hold China accountable for their continued dishonesty. Great work by the #ChinaTaskForce!","date":"Thu Oct 01 13:19:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work Macon and Tallapoosa Counties! #AL03","date":"Wed Sep 30 23:17:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great work by the #ChinaTaskForce!","date":"Wed Sep 30 22:58:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for nominating an incredible judge for the Supreme Court.","date":"Sat Sep 26 21:19:57 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to see Dean Cain, aka Superman today at the Capitol! https://t.co/hEYkmit1lf","date":"Thu Sep 24 17:28:40 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for continuing to stand for life. This Executive Order will protect America’s children and ensure they receive the care they need and deserve.","date":"Thu Sep 24 10:44:22 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"My colleague @RepLizCheney is exactly right!","date":"Wed Sep 23 18:30:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Praying for our friends on the coast of our great state as they restore and rebuild.","date":"Fri Sep 18 19:15:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Attn Community Leaders in AL03: Alabama has compiled a great set of resources to promote the 2020 Census in your communities. We only have 12 days left! \n\nhttps://t.co/39oHltpmSD","date":"Fri Sep 18 14:26:07 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I wish I could say I’m surprised Democrats have yet to offer a Homeland Security reauthorization package. However, this is the party that started out this Congress with calls to abolish U.S. Immigration and Customs Enforcement. Read more @dcexaminer","date":"Fri Sep 18 12:54:00 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#ConstitutionDay","date":"Thu Sep 17 14:46:03 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @USCG!","date":"Wed Sep 16 16:52:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"@HouseGOP, along with @realDonaldTrump, has made a #CommitmentToAmerica. We will rebuild, renew, and restore our American economy.","date":"Wed Sep 16 13:37:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣 Randolph and Macon Counties! Complete your census to stay in the Census bowl! https://t.co/ujbJnwETfv!","date":"Tue Sep 15 15:12:51 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Folks across Alabama: take #Sally seriously and stay weather aware!","date":"Mon Sep 14 18:11:39 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Any middle and high school student coders in #AL03? If so, register for the 2020 Congressional App Challenge! @CongressionalAC #Congress4CS","date":"Mon Sep 14 17:49:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Tune in now!","date":"Fri Sep 11 20:08:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"What an honor to present Corporal Tyler Ledford with the Purple Heart today. Thank you for your service! https://t.co/CLtV8ScWVv","date":"Fri Sep 11 16:23:13 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"America is a resilient country. A country I’m proud to serve and represent in the U.S. House of Representatives. God bless those who are mourning today, and God bless those who ran into harm’s way on 9/11.\n\nRead more in my op-ed in @thehill","date":"Fri Sep 11 14:26:26 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This plaque is in the US Capitol reminding visitors and congressman alike to never forget the 2,977 lives lost on 9/11. We will always remember. https://t.co/lzmM443PY8","date":"Fri Sep 11 12:20:13 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Keep up the good work #AL03 and remember to complete your census at https://t.co/ujbJnwETfv!","date":"Thu Sep 10 18:41:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to #AL03’s own Dr. Andy Jackson!!","date":"Thu Sep 10 18:38:12 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats on your retirement @JanetHallFox6!","date":"Thu Sep 10 14:35:10 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to it @jeff_poor!","date":"Thu Sep 10 14:32:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Tallapoosa County! RT to encourage your neighbors to fill out their census at https://t.co/ujbJnwETfv! https://t.co/tdzsTOnCwE","date":"Thu Sep 10 10:40:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to @realDonaldTrump for the well-deserved honor!","date":"Wed Sep 09 17:55:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Talladega County! Have you filled out your census? RT this to encourage your neighbors to fill it out at https://t.co/ujbJnwETfv! https://t.co/LYpQEXUzel","date":"Wed Sep 09 12:03:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣St. Clair County! RT and make sure your neighbors have completed their census at https://t.co/ujbJnwETfv! https://t.co/d6PWNAmvcc","date":"Tue Sep 08 12:49:11 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I was happy to sign Heritage Action’s Police Pledge committing to vote against any and all of the Democrats’ anti-law enforcement efforts to defund the police. https://t.co/xI2uYqGkBA","date":"Fri Sep 04 17:28:46 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣 Russell County! RT and encourage your neighbors to complete their census at https://t.co/ujbJnwETfv! https://t.co/4tRIKca023","date":"Fri Sep 04 16:28:13 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Randolph County! RT this and encourage your neighbors to complete their census at https://t.co/ujbJnwETfv! https://t.co/bDKzvpsuJh","date":"Thu Sep 03 12:54:33 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Several counties in #AL03 are competing in Alabama’s Census Bowl for up to $65,000 for local schools! RT this and encourage your neighbors to complete their census at https://t.co/ujbJnwETfv! #AlabamaCounts https://t.co/sjGLfjlZmu","date":"Wed Sep 02 20:08:06 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"🗣AL03! Today’s the official start of Alabama’s Census Bowl. How does it work? Official rules are below! #AlabamaCounts https://t.co/B69883Snee","date":"Wed Sep 02 20:07:22 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you for the virtual tour @JEDspirits! #AL03","date":"Wed Sep 02 13:26:15 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Montgomery County! Have you completed your census? RT and encourage your neighbors to complete at https://t.co/ujbJnwETfv! https://t.co/8rEPE9c1QV","date":"Wed Sep 02 13:25:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“Mostly Peaceful”","date":"Wed Sep 02 00:38:28 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Exciting stuff coming tomorrow! #AlabamaCounts","date":"Tue Sep 01 17:56:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻Lee County! Make sure your voice is heard. RT to encourage your neighbors to complete their census at https://t.co/ujbJnwETfv! https://t.co/AS2J2EtUOX","date":"Tue Sep 01 12:14:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Folks in Cleburne County! Have you completed your census? RT this and encourage your neighbors to complete it at https://t.co/ujbJnwETfv! https://t.co/bsXJQycXoh","date":"Mon Aug 31 16:25:53 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nancy Pelosi is trying her best to continue the USPS “crisis” conspiracy theory.","date":"Sun Aug 30 22:52:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Clay County! Have you and your neighbors completed your census? RT this post and go to https://t.co/ujbJnwETfv go complete it! https://t.co/ijolbiXKDz","date":"Fri Aug 28 12:53:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📣 Cherokee County! Retweet and make sure you and your neighbors fill out your census at https://t.co/ujbJnwETfv! It’s never been more important. https://t.co/H4cjHYbgiX","date":"Thu Aug 27 13:29:03 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋🏻 Chambers County! Have you completed your census? Retweet to make sure your neighbors know they can complete it at https://t.co/ujbJnwETfv https://t.co/w4SwRkW18g","date":"Wed Aug 26 12:17:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey Calhoun County! Have you completed your census at https://t.co/ujbJnwETfv? RT to encourage your neighbors! https://t.co/E2yniCHA8b","date":"Tue Aug 25 13:14:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump!","date":"Sun Aug 23 21:49:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Instead of a vote on this made up crisis, Speaker Pelosi should be negotiating with President Trump to bring millions of hardworking Americans relief.","date":"Sat Aug 22 22:13:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today Nancy Pelosi called back the House of Representatives to vote on a fake emergency. House Democrats have continued to push a conspiracy theory about the United States Postal Service, saying it can’t handle November’s mail-in ballots.","date":"Sat Aug 22 22:13:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi could be negotiating a deal for hard-working Americans, but instead we’re voting on a conspiracy theory.","date":"Fri Aug 21 17:51:11 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @gopleader @stevescalise and @repjamescomer!","date":"Thu Aug 20 12:54:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank to Tallassee Mayor Johnny Hammock for having me by to meet today! https://t.co/Kt9uiwXTx3","date":"Wed Aug 19 21:20:01 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nancy Pelosi cares more about her Socialist mob politics than working Americans.","date":"Wed Aug 19 19:58:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Deion Sanders! #AL03","date":"Wed Aug 19 17:07:39 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to @MGMChamber for having me for their virtual Eggs and Issues this morning. Always great to join! https://t.co/sYv5lFL4dB","date":"Wed Aug 19 14:20:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats Casey! #WarEagle","date":"Wed Aug 19 11:55:44 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you for having me!","date":"Tue Aug 18 20:02:48 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great talk with Susana and Ian at @wvtm13 today in Birmingham. https://t.co/TyBRYionme","date":"Tue Aug 18 20:02:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks to @WBRCnews for having me today to discuss what’s going on in Washington! https://t.co/3ky7m0GHtF","date":"Tue Aug 18 19:23:05 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Praying for @realDonaldTrump after the passing of his brother Robert. Please keep the Trump family in your prayers.","date":"Sun Aug 16 13:33:31 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Unacceptable and unforgivable. Does the Mayor of New York despise America this much? \n\nhttps://t.co/c5jeTzpoMw","date":"Fri Aug 14 20:27:27 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to talk with SAFE and Sylacauga Chamber of Commerce leadership about a project today. https://t.co/AQzoyhyuws","date":"Fri Aug 14 20:20:33 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"What a great day seeing the new Radio Alabama Studio in Sylacauga. Thanks to my friend Lee Perryman for having me! https://t.co/rCJza0IORE","date":"Fri Aug 14 18:59:33 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"See what happens in Democrat-led cities across the country that want to abolish the police? Senseless violence!","date":"Wed Aug 12 21:44:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Always great to see Calhoun County Sheriff Matt Wade and Anniston’s new police chief, Nick Bowles. Thank you to these heroes for keeping our community safe. https://t.co/F8kNyFMLyI","date":"Wed Aug 12 17:57:30 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great to meet with orthopedic surgeons today at Anniston Orthopaedic Associates. #AL03 https://t.co/neWeRXKcvL","date":"Wed Aug 12 16:30:12 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to the folks at Russell Medical Center in Alex City for having me today. Hospitals like Russell have been hard at work on the front lines against Covid-19. #AL03 https://t.co/BPMcKWnYP1","date":"Tue Aug 11 18:43:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#AmericaFirst","date":"Tue Aug 11 16:07:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to our great @secretservice. I will always support our brave law enforcement - federal, state and local. #backtheblue","date":"Mon Aug 10 22:50:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Great day to be in Heflin for the groundbreaking of the new @lovestravelstop! #AL03 https://t.co/bINVhVy1tB","date":"Mon Aug 10 15:12:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for decisively acting for the American people. While President Trump is showing leadership, Speaker Pelosi and Senator Schumer are acting out their obsession for mobs and Socialism and leaving hardworking Americans out to dry. #alpolitics","date":"Sat Aug 08 21:30:46 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for your actions against these and other technology companies that have displayed clear signs of manipulation in favor of China's non-stop propaganda agenda.","date":"Fri Aug 07 15:56:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Portland officials carried out a smear campaign against federal officials and passed resolutions preventing local police from providing any assistance, coordination, or information with federal counterparts. That's why I'm requesting a full investigation.","date":"Thu Aug 06 20:51:41 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our Defense sector has stepped up to support Americans during the Covid crisis, and any future response bill should reflect that. Thanks @mactxpress and @repkaygranger for your leadership.","date":"Thu Aug 06 19:00:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump and @secretarycarson!","date":"Wed Aug 05 15:14:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#backtheblue","date":"Wed Aug 05 14:22:13 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to Randolph County’s Johnson Family! #AL03","date":"Wed Aug 05 13:06:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for your commitment to rural Americans like the folks in #AL03!","date":"Tue Aug 04 16:44:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi always puts her Socialist politics over what’s right for America’s.","date":"Mon Aug 03 19:52:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Attn any middle and high school student coders in #AL03: Check out the 2020 Congressional App Challenge @CongressionalAC #Congress4CS","date":"Mon Aug 03 16:55:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi continues to play political games while Americans expect results.","date":"Fri Jul 31 21:37:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Democrats support mobs over jobs!","date":"Mon Jul 27 20:40:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Our religious liberty is under attack.","date":"Sat Jul 25 16:30:14 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @realDonaldTrump!  This is the right move.\nhttps://t.co/9hU2MIe3KZ","date":"Tue Jul 21 21:52:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"\"Therefore, my dear brothers and sisters, stand firm. Let nothing move you. Always give yourselves fully to the work of the Lord, because you know that your labor in the Lord is not in vain.\" 1 Corinthians 15:58\n\nRest in Peace.","date":"Sat Jul 18 13:26:33 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Leader McCarthy is exactly right!","date":"Fri Jul 17 22:34:19 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The radical left will do anything-regardless of how awful-to get their way. \n\nDespicable.","date":"Wed Jul 15 19:54:43 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The current crisis has taught us that America is too reliant on China for our critical infrastructure, including PPE. American farmers and producers, like the hard working folks in #AL03, stand ready to provide goods to keep this manufacturing where it belongs, in America. https://t.co/TmCr3QgGrT","date":"Tue Jul 14 18:33:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"That’s why I was happy to sign onto this letter to Congressional Leadership led by my friend @RepRickCrawford.","date":"Tue Jul 14 18:33:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Calling all middle and high school students interested in coding! Submit an app for the ​2020 Congressional App Challenge @CongressionalAC #Congress4CS #AL03","date":"Mon Jul 13 16:37:06 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under current law, individuals must wait five months after becoming disabled before their disability insurance benefits payments may begin, which just isn’t feasible for folks suffering from this terrible disease.  #AL03","date":"Mon Jul 13 12:19:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"After hearing from our ALS advocates across our great State, I was proud to support H.R. 1407 which eliminates the five month waiting period for Disability Insurance benefits for individuals with ALS.","date":"Mon Jul 13 12:19:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi just sided with the mob against law abiding Americans.","date":"Thu Jul 09 21:18:02 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Heflin!  Exciting news after a lot of hard work!  #AL03\nhttps://t.co/f3R4KveYAM","date":"Thu Jul 09 12:48:40 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Rogers Announces Service Academy Appointees from East Alabama #AL03\nhttps://t.co/yx0VgGGc8C","date":"Thu Jul 09 12:44:04 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you and GREAT JOB, Officer Hardeman!  #BacktheBlue #AL03","date":"Wed Jul 08 16:40:26 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today’s decision by the Supreme Court is a victory for our religious liberties.","date":"Wed Jul 08 16:05:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Yet another good reason to get out of the UN.\n\nhttps://t.co/GNNFiV848w","date":"Tue Jul 07 21:31:02 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Have a happy #IndependenceDay! #AL03 https://t.co/mxdoE3sYQJ","date":"Sat Jul 04 12:02:18 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @realDonaldTrump!\nhttps://t.co/834hqjw0d6","date":"Thu Jul 02 13:35:31 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Rogers' Statement on HASC Passage of the NDAA #AL03 #FY21NDAA\nhttps://t.co/Bk07mSaKbd","date":"Thu Jul 02 13:13:01 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I was pleased to cosponsor H.R. 6829 which authorizes a bilateral grant program with our ally Israel.  It matches funds from both govs to develop health technologies, personalized medicine &amp; data in regards to COVID-19.  It will also help Israel lessen any cooperation with China.","date":"Wed Jul 01 17:14:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This is how Speaker Pelosi chips away at our Constitution everyday.","date":"Wed Jul 01 00:06:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"1 study shows 32 govs have refused 2 share the funding with these communities &amp; this bill would require states to announce a plan 2 share funds with these communities or face potential of having 25% of the funds revoked.  We must look out for our rural &amp; small communities!  #AL03","date":"Tue Jun 30 17:55:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Recently, I cosponsored H.R. 7065, the “Anti-Hoarding” bill.  Rural communities across some of our states aren’t seeing CARES funding that was provided for them.","date":"Tue Jun 30 17:55:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Speaker Pelosi and leftist Democrats continue to chip away at our Constitution.","date":"Mon Jun 29 18:54:08 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will never give up on this effort until all of God’s precious children, both born &amp; unborn, are protected.\nhttps://t.co/azsZ3VZCnv","date":"Mon Jun 29 17:18:48 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I am very disappointed by today’s Supreme Court decision to strike down the Louisiana law requiring abortion providers to have admitting privileges at nearby hospitals.  This commonsense law sought to protect the health &amp; safety of women &amp; their unborn babies.","date":"Mon Jun 29 17:18:48 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This reckless decision is further evidence of activist judges pursuing their political agenda. Our fight to protect the rights of unborn children is &amp; will be a long one.","date":"Mon Jun 29 17:18:48 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I will never stop fighting for the rights of unborn children.","date":"Mon Jun 29 15:40:11 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I have and always will stand up for Israel.  I was proud to join @SteveScalise and so many of my colleagues on a letter to @IsraeliPM to reaffirm the strong alliance between our two great countries. https://t.co/fsLQJ7IoHY","date":"Tue Jun 23 21:06:30 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to Don Killingsworth on being named president of my alma mater, Jacksonville State University!  #AL03 @JSUNews \n\nhttps://t.co/CmFBfjwNox","date":"Tue Jun 23 19:07:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"📌Reminder to all middle/high school students in #AL03 to register by September 10th for this year's Congressional App Challenge.  This is #AL03's first year to participate and we want YOU to be a part of it!  For more information, go to https://t.co/EjKvmN4aDc #Congress4CS","date":"Mon Jun 22 12:28:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"June is PTSD Awareness Month.  #HelpingourHeroesinNeed https://t.co/SWYaIOUCn3","date":"Mon Jun 22 12:01:00 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Father’s Day! https://t.co/s03exaaBzZ","date":"Sun Jun 21 12:01:20 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to hearing Doug start this race from space!  #GEICO500 #AL03","date":"Sat Jun 20 21:30:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#AL03 Students:\nRogers Announces the Third Congressional District 2020 Congressional App Challenge\nhttps://t.co/SijaDCOtiB","date":"Thu Jun 18 16:34:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"President Trump’s Executive Order is a good first step in helping our local law enforcement better serve our communities and towns. https://t.co/qk0z8i93fi","date":"Wed Jun 17 17:51:46 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"#AL03:  Reminder to complete your census! https://t.co/IRbUCaPgh4","date":"Tue Jun 16 16:11:31 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy birthday to the U.S. Army! https://t.co/G6ux4beOHw","date":"Sun Jun 14 22:57:32 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today we celebrate the American flag! https://t.co/H21IXymdJc","date":"Sun Jun 14 22:56:51 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy birthday, @realDonaldTrump! https://t.co/bM3pIYilYP","date":"Sun Jun 14 12:17:44 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"With elected officials today presenting a Congressional Record statement to celebrate Pell City turning 130 years old! #AL03 https://t.co/VF5lVoYgGo","date":"Fri Jun 12 20:23:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to General Charles Q. Brown who was unanimously confirmed yesterday to be the Air Force’s 22nd chief of staff. I look forward to working with you to support our nation's Air Force.\n\n https://t.co/adYkf4MwSC","date":"Wed Jun 10 16:45:26 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Gentlemen, start your engines...NASCAR's back!  #AL03\nhttps://t.co/hHFGUz4j4g","date":"Wed Jun 10 15:01:03 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Honoring their fight for freedom on the 76th anniversary of D-Day. https://t.co/TmhcbCfXPm","date":"Sat Jun 06 19:32:00 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rest in Peace, Moody Police Sergeant Stephen Williams.\n\nGreater love has no man than this, that he who lays down his life for his friends. -John 15:13","date":"Wed Jun 03 13:47:39 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"RIP, Coach!  Soar high with the eagles.  #AL03 #wareagle","date":"Mon Jun 01 18:11:19 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"@realDonaldTrump is working every day. The Senate meets regularly &amp; Americans are getting back to work. But House Democrats have scheduled only ONE day in June and ONLY 13 days over the next 3 months. Why are House Democrats refusing to do their jobs?\n\nhttps://t.co/IALI1y2ZVg","date":"Fri May 29 21:11:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It will extend the loan forgiveness period, allow businesses that receive forgiveness to also receive payroll tax deferment &amp; will allow businesses to spend different amounts on payroll costs &amp; mortgage, rent &amp; other expenses.","date":"Thu May 28 18:40:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I hope these modifications will further help our small businesses that are the heartbeat of our local economies. #AL03","date":"Thu May 28 18:40:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In #Alabama, 60K PPP loans have been issued since early Apr, with the avg loan being $103,586. The bill will add more flexibility to these loans to help small businesses even more.","date":"Thu May 28 18:40:28 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I was pleased H.R. 7010, the Paycheck Protection Program (PPP) Flexibility Act passed the House today with my strong support.  The PPP has been a lifeline of support to so many businesses across East Alabama and the country during the COVID-19 pandemic.","date":"Thu May 28 18:40:28 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The PPP Flexibility Act will provide more help for our small businesses! https://t.co/E3RU9xSM4i","date":"Thu May 28 16:08:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rest In Peace, Sam Johnson.\n\n“I have fought the good fight.  I have finished the race.  I have kept the faith.” 2 Timothy 4:7 https://t.co/0IO0aVjH7Y","date":"Thu May 28 15:56:28 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Pelosi’s unconstitutional power grab at work.","date":"Wed May 27 22:56:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Starting today, any farmer impacted by COVID-19 can apply for financial relief through Coronavirus Food Assistance Program here:  https://t.co/bcd1W5FJWa\n#Ag #AL03","date":"Tue May 26 13:42:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Freedom is not free.  Today we honor those brave men and women who made the ultimate sacrifice for our freedoms. https://t.co/GykXcaAOg1","date":"Mon May 25 12:41:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congrats to John!","date":"Fri May 22 15:42:40 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Enough is enough @SpeakerPelosi - let the House return to work like the Senate is doing! This national crisis is not the time to keep the people’s business sidelined. It’s time for the House to go to work with @GOP &amp; @realdonaldtrump.","date":"Thu May 21 20:01:14 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you @realDonaldTrump for continuing to stand strong against China and always putting America first.\n\nWhite House Report to Congress:  United States Strategic Approach to The People’s Republic of China - \nhttps://t.co/eHMEetR2cv","date":"Thu May 21 13:17:54 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It may look a lot different than any of us anticipated,  but it doesn’t take away from all you’ve achieved.  Congratulations to the Class of 2020! https://t.co/cYtpZPFcOj","date":"Thu May 21 12:44:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Pelosi’s Socialist Proxy Vote scheme has begun. https://t.co/X1fMkBnvu2","date":"Wed May 20 18:02:45 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"@GOPLeader exposes Pelosi Proxy Vote Scheme.","date":"Wed May 20 15:13:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to Matt and Aunie for having me on @realtalk995 today!  #AL03","date":"Tue May 19 14:23:22 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @realDonaldTrump for delivering for the great State of #Alabama during these unprecedented times! #AL03 https://t.co/9TCo6TU5aW","date":"Tue May 19 01:32:10 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you to our Armed Forces today and every day! https://t.co/iW8bIehpgc","date":"Sat May 16 12:07:24 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"In Washington today to fight against Speaker Pelosi’s socialist wishlist. As President Trump said, “America will never be a socialist country.” https://t.co/5nVzOb4Dfx","date":"Fri May 15 17:33:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Approved AL as 7th state to operate the Pandemic Electronic Benefit Transfer (P-EBT), a new program authorized by the Families First Coronavirus Act (FFCRA), which provides assistance to families of children eligible for free or reduced-price meals dealing with school closures.","date":"Thu May 14 14:46:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump, USDA has:\n-Announced Coronavirus Food Asst Program 4 farmers/ranchers/consumers in #Alabama in response 2 COVID-19. $19B will provide $16B in direct support based on actual losses for ag producers &amp; $3B in purchases of fresh produce/dairy/meat https://t.co/mYd77QnxD3","date":"Thu May 14 14:46:20 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"See what is in Pelosi’s Partisan Wish List. https://t.co/movs7Jv1YV","date":"Wed May 13 18:58:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump, HUD, DOJ and DOT have:\n-Made $41.4 M+ in COVID-19 funding available to #Alabama housing voucher grantees\n-Provided FHA multi-family borrowers in AL &amp; across the nation with forbearance for up to 3 mo. if they agree not to evict tenants during that period https://t.co/zz4OODsiyA","date":"Wed May 13 15:36:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Awarded $53.9 M+ from the FAA to help fund continuing operations &amp; lost revenue for airports in AL","date":"Wed May 13 15:36:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Allocated $14.4 M+ in DOJ funds to AL to assist State &amp; local govt response to COVID-19. This includes $9.6 M+ in funding to State &amp; $4.8 M+ to local govts\n-Allocated $131.2 M+ in Federal Transit Admin funds to help AL public transpo systems respond to the challenges of COVID-19","date":"Wed May 13 15:36:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It is National Police Week!  Thank you to all who serve and protect our towns and communities! #AL03 https://t.co/5IdFG5kfDH","date":"Tue May 12 15:02:04 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Made $216.9 M available to AL through the Elementary and Secondary School Emergency Relief Fund of the CARES Act to ensure learning continues for all students\n-Awarded $12.6 M+ in emergency administrative unemployment insurance grants &amp; $1.9 M in dislocated worker grants to AL","date":"Tue May 12 12:54:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump the Departments of Education and Labor have:\n-Suspended federal student loan payments &amp; waived interest during the Federal emergency, which will help up to 599,700 direct loan borrowers in #Alabama","date":"Tue May 12 12:54:54 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Announced $199.1 M+ to support postsecondary ed students &amp; institutions of higher ed in AL\n-Announced $48.8 M+ for flex “emergency block grant” designed to enable govs to decide how to meet needs of students, schools, postsecondary institutions &amp; ed-related orgs in AL","date":"Tue May 12 12:54:54 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Important news for #Veterans who need assistance now: @IAVA has launched a nationwide consolidated-care program for all veterans and their families. Quick Reaction Force is free to use, anonymous, and operates 24/7. Learn more here: https://t.co/doHfl91EZ9","date":"Tue May 12 01:46:16 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump  the VA and DOD have:\n-Provided staffing assistance and consulting services to all Veterans homes in #Alabama\n-Automatically provided $1,200 in Economic Impact Payments to Veterans\n-Used the Defense Production Act to keep our PPE supply strong in #Alabama https://t.co/lbuiyvcEjU","date":"Mon May 11 15:00:08 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Happy Mother’s Day to all the wonderful mamas out there and across #AL03! https://t.co/PwQvxHGFnx","date":"Sun May 10 14:07:01 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A real American hero and life well lived. #AL03","date":"Sun May 10 13:48:14 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"On Matt &amp; Aunie Show this morning - tune in here: https://t.co/SFLUA9pkXg or listen at 99.5 if in the listening area. #AL03","date":"Thu May 07 14:32:57 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, Montgomery County!  Please RETWEET &amp; encourage your friends to complete their census. It is so important to #AL03 because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG https://t.co/sYgktsNz7J","date":"Thu May 07 13:42:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"On this National Day of Prayer, please pray for our country, our health and safety as we face these unprecedented times. 🙏 https://t.co/VNLR5S32j7","date":"Thu May 07 13:17:15 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, Tallapoosa County! Please RETWEET this post &amp; encourage your friends to complete their census.\nIt's important because federal resources are determined based on census participation, including your congressional representation! Go to: https://t.co/lHeOb9bAvG https://t.co/Srkqwg2ZlI","date":"Wed May 06 13:26:04 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"A huge thank you today and every day!   Our nurses across #AL03 and the country are heroes! https://t.co/CsOaEZpklq","date":"Wed May 06 12:51:52 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋 Hey Talladega County!  Please RETWEEt and encourage your neighbors to complete their census. It is vital because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG #AL03 https://t.co/Ew1VcZGhLg","date":"Tue May 05 15:47:10 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, St. Clair County!  Pls RETWEET &amp; encourage your friends to complete their census. It is so important for #AL03 because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG https://t.co/ZPZqxWVFHI","date":"Tue May 05 13:03:24 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Delivered 152,412 N-95 masks, 362,580 surgical masks, 59,699 medical gowns, 1,939 coveralls, 72,922 face shields &amp; 305,359 gloves from the Strategic National Stockpile to AL\n-Obligated $18.7 M for COVID-19 Emergency Management response efforts in AL","date":"Mon May 04 18:23:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump, HHS and FEMA have\n-Awarded over $18.3 M in CARES Act funding to 17 health centers across AL\n-Allocated more than $449.4 M in AL from the Provider Relief Fund\n-Awarded over $3.4 M to support small rural hospitals &amp; promote tele-health in rural communities https://t.co/a7acgTDMxW","date":"Mon May 04 18:23:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"May the 4th be with you!  #wareagle #AL03","date":"Mon May 04 16:27:25 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, Russell County!  Please RETWEET and encourage your neighbors to complete their census. It is vital for #AL03 because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG https://t.co/iAnNmokCZr","date":"Mon May 04 12:57:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey Randolph County!  Please RETWEET and encourage your friends to complete their census. It is important for East Alabama because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9tbne #AL03 https://t.co/6rJwPbhOaj","date":"Fri May 01 21:47:21 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"-Issued over 1.3 M Economic Impact Payments totaling more than $2.4 B to individuals in Alabama\n-Issued $1.9 B to the State of Alabama for Coronavirus-related Expenses Relief","date":"Fri May 01 18:12:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Under @realDonaldTrump, SBA and the Treasury Dept have:\n-Issued over $4.8 B in loans to over 27K Alabama small businesses\n-Approved 14,433 Economic Injury Disaster Loan (EIDL) advances totaling more than $59.1 M in the State of Alabama https://t.co/0J3yUZciea","date":"Fri May 01 18:12:35 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @TuskegeeUniv, for this donation!  #AL03\n\nhttps://t.co/heV8txwm0i","date":"Fri May 01 15:06:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good Morning, Macon County!  Please RETWEET and encourage your neighbors to complete their census. It is vital for #AL03 because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG https://t.co/CJNiRrHHbE","date":"Fri May 01 11:06:17 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, Lee County!  Please RETWEET and encourage everyone you know to complete their census. It is important because federal resources are determined based on census participation, including your congressional representation!  Go to:  https://t.co/lHeOb9bAvG #AL03 https://t.co/pxCk0sFASy","date":"Thu Apr 30 14:33:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"👋 Hey Cleburne County!  Please RT &amp; encourage your friends to complete their census. It is crucial for East Alabama because federal resources are determined based on census participation, including your congressional representation!  Click here:  https://t.co/lHeOb9bAvG #AL03 https://t.co/K9sfWfswkF","date":"Wed Apr 29 21:16:24 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @realDonaldTrump,  for always standing up for American #Agriculture https://t.co/2Rqy1cblBv","date":"Wed Apr 29 16:45:47 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning to Clay County!  Please RT and encourage your neighbors to complete their census. It is so important because federal resources are determined based on census participation, including your congressional representation!  Click here:  https://t.co/lHeOb9bAvG #AL03 https://t.co/C3ZNMh6pNM","date":"Wed Apr 29 14:06:11 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey Cherokee County!  Please RT &amp; encourage everyone you know to complete their census. It is vital to East Alabama because important federal resources are determined based on census participation, including your congressional representation! Click here:  https://t.co/lHeOb9bAvG https://t.co/gJZZYv1XTQ","date":"Tue Apr 28 20:48:44 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Good morning, Chambers County – Please retweet to encourage folks in your community to complete their census. So many important federal resources are determined by census participation, including your congressional representation!  Go to https://t.co/JkgF6RgG9J https://t.co/V4ZoSw28CJ","date":"Tue Apr 28 13:24:24 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey 👋 Calhoun County!  Please RETWEET and encourage your neighbors to complete their census. Important federal resources are determined by census participation, including your congressional representation! #AL03 https://t.co/h3yJidE11j","date":"Mon Apr 27 22:21:08 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The SBA will resume accepting PPP loan applications  this morning at 10:30 a.m. EDT from approved lenders on behalf of any eligible borrower. \n\nhttps://t.co/cXWhC42ioN","date":"Mon Apr 27 11:57:47 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"VIDEO:  Rogers'on House Passage of HR 266 today. #AL03\nhttps://t.co/8oEBBuTKLj","date":"Thu Apr 23 23:06:06 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This action should’ve been taken over 2 wks ago when @realDonaldTrump requested more money for PPP, or it could’ve happened last wk when the program ran out of money. Instead, Speaker Pelosi wasted time with her ridiculous partisan political games.  #AL03\nhttps://t.co/IK8FvCP3EZ","date":"Thu Apr 23 23:01:19 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I voted against the Democrats' Select Committee just now because it is part of the Democrats' Trump Derangement Syndrome Checklist:  \n\nRussia, Russia, Russia ✔️\n\nMueller Witch Hunt ✔️\n\nSham Impeachment ✔️\n\nPelosi’s Select Committee ✔️","date":"Thu Apr 23 20:59:47 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Listen live as I join Bruce this morning on WFEB!  https://t.co/HnxlLl5yPG #AL03","date":"Thu Apr 23 12:30:03 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Spent the last several weeks talking to local businesses, Chambers of Commerce, State legislators, County Commissions, Mayors, EMA Directors, doctors and hospital administrators about their thoughts of getting #Alabama back to work soon in a safe manner. https://t.co/qa5XSDSuvb","date":"Tue Apr 21 00:42:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to hearing more about the state’s plan to reopen our economy.","date":"Tue Apr 21 00:42:50 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you, @yellawood!","date":"Mon Apr 20 23:31:59 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Congratulations to John Michael O'Barr, a senior at St. Clair County High School, for winning first place in the #AL03 Art Competition.  His submission is titled \"Grief\" and the medium is digital artwork.  Great work, John Michael!\nhttps://t.co/FdIu963Pke https://t.co/fd5krah0gN","date":"Mon Apr 20 21:17:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Report from Washington: The Fight Against the Invisible Enemy...https://t.co/4YnEz7ztwv #AL03","date":"Mon Apr 20 17:56:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Rest In Peace, Bennie Adkins. \nHeaven’s gates have never been more secure. \n“For if we live, we live to the Lord, and if we die, we die to the Lord. So then, whether we live or whether we die, we are the Lord's.” Romans 14:8 https://t.co/lbexmECihO","date":"Fri Apr 17 23:06:39 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Once the Democrats stop blocking replenishing funding for the SBA, I look forward to helping SBA get these EIDL grants into the hands of folks who need it in #AL03.","date":"Fri Apr 17 17:53:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"This week, I wrote the Small Business Administration (SBA) to seek information and guidance from the SBA regarding Economic Injury Disaster Loans (EIDLs), how the agency is meeting the challenges facing this program and how Congress can assist the SBA. https://t.co/yb7dwVCp1z","date":"Fri Apr 17 17:53:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Alabama Department of Labor has released a new claim tracker for unemployment claims found here:\nhttps://t.co/c1rwNDGzB9","date":"Thu Apr 16 18:13:55 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"@SpeakerPelosi has chosen her politics over American small businesses. https://t.co/x9qgGngu5h","date":"Thu Apr 16 14:56:29 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Listen live to my interview with @jeff_poor happening now:  https://t.co/NgWwZQfbdJ","date":"Wed Apr 15 19:36:57 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Looking forward to being on with you today, Jeff!","date":"Wed Apr 15 18:43:34 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Note to Pelosi and Schumer: Put Americans above your politics.","date":"Wed Apr 15 15:24:19 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Check the status of your Economic Impact Payment here:  https://t.co/rEDeN0B6t6","date":"Wed Apr 15 13:40:45 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Paycheck Protection Plan has provided a safety net during these unprecedented times for our small businesses! https://t.co/l4nMwOq3eC","date":"Tue Apr 14 18:15:33 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"It is a shame that at this time of crisis where we should put the needs of all Americans first, that Nancy Pelosi and Chuck Schumer chose politics.","date":"Mon Apr 13 23:31:39 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The funds that Congress unanimously supported will run out shortly due to @realDonaldTrump keeping his promise to all Americans in need. Instead of putting American workers first, Speaker Pelosi has chosen her radical, socialist agenda to take precedence.","date":"Mon Apr 13 23:31:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The PPP is absolutely essential for saving American jobs during this unprecedented crisis that has occurred at no fault of any American. Our economy was the strongest in history when hit by this invisible enemy.","date":"Mon Apr 13 23:31:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Nancy Pelosi &amp; Chuck Schumer continue to block the replenishment of the Paycheck Protection Program (PPP) of the CARES Act for solely selfish partisan political reasons.","date":"Mon Apr 13 23:31:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"\"He is not here: for he is risen, as he said.\"  -Matthew 28:6A\n\nHappy Easter!","date":"Sun Apr 12 19:07:44 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The phone lines are open from 9 a.m. - 12 p.m. CDT with experts waiting to answer questions about the CARES Act, unemployment and more.","date":"Fri Apr 10 13:19:05 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"“If my people, which are called by my name, shall humble themselves, and pray, and seek my face, and turn from their wicked ways; then will I hear from heaven, and will forgive their sin, and will heal their land.” - 2 Chronicles 7:14","date":"Fri Apr 10 12:32:05 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"I hope Democrats in both chambers realize now is not the time to play politics.","date":"Thu Apr 09 18:08:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Paycheck Protection Plan has provided a safety net for our small businesses during these unprecedented times and I was extremely disappointed to see Senate Democrats block a unanimous consent request to provide standalone emergency funding for this critical program.","date":"Thu Apr 09 18:08:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thanks, Matt &amp; Aunie, for having me on the show today!","date":"Thu Apr 09 14:21:37 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"The Third Congressional Art Competition will be held virtually this year.  For more information click here:  https://t.co/sRaK62srDx\n\nFor student release form click here:  https://t.co/CwGhqmNHSY\n\nSubmissions (clear photographs of artwork) are due by Apr 9 at 4:00 p.m. CDT  #AL03","date":"Tue Apr 07 13:10:02 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ATTENTION all #AL03 Small Businesses: Starting TODAY, the Paycheck Protection Program will allow you to apply for loans (that are forgivable) and cover payroll to keep making sure folks get paid. More info here: https://t.co/ym89fulGgJ","date":"Fri Apr 03 15:04:58 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"AUsome job!  Thank you to these #Auburn engineers!  #AL03 #WarEagle","date":"Thu Apr 02 17:38:22 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"For all of our farmers! \nICYMI:  Info from ALFA on COVID-19\nhttps://t.co/17yg9p1kzs","date":"Wed Apr 01 19:58:14 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Today is National Census Day!  Make sure you are counted!  \nhttps://t.co/PzYbLIe2eI\n#AL03 #2020Census","date":"Wed Apr 01 19:54:36 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Coronavirus Update:  Where We Go From Here https://t.co/bVPxmEMJeY","date":"Wed Apr 01 19:49:48 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Agree!  Thank you for all you are doing @coosavalleymed!","date":"Wed Apr 01 19:34:42 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Hey Small Businesses in #AL03:   Don’t miss out on federal relief!  More here:  https://t.co/XOXRKhlLyn","date":"Wed Apr 01 15:52:38 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  The Capitol building will remain closed for tours until May 1st.\nhttps://t.co/tnARCB66Pu","date":"Wed Apr 01 13:04:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"ICYMI:  Economic impact payments:  What you need to know\nhttps://t.co/dvFZUOdpcH","date":"Tue Mar 31 14:44:56 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Thank you today and every day!","date":"Mon Mar 30 21:43:15 +0000 2020","user_id":"33977070"},{"handle":"RepMikeRogersAL","text":"Couldn’t agree more!  THANK YOU!","date":"Sun Mar 29 12:14:55 +0000 2020","user_id":"33977070"}]