[{"handle":"RepPfluger","text":"How can @SecMayorkas see this and tell me the border is \"secure\" with a straight face?","date":"Thu Jun 16 20:22:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"You're completely right @MikePompeo. The Permian Basin is the largest secure supply of oil &amp; gas in the world. It's past time to unleash American energy dominance.","date":"Thu Jun 16 16:53:02 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Only 9 months into FY22, and the number of gotaways is already THREE TIMES what it was in FY20. I expect it to be quadruple by the end of this fiscal year.\n\nDoes letting 440k unknown illegal individuals into the U.S. constitute a \"secure border,\" @SecMayorkas ?","date":"Thu Jun 16 15:29:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"NEW: @CBP reporting 239,416 illegal migrant encounters in May. The HIGHEST one-month total EVER, and a 300% increase over the average number of May apprehensions under the Trump Admin.\n\nWe must restore law &amp; order at our border.","date":"Thu Jun 16 12:57:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS blames our oil &amp; gas producers for high gas prices. \n\nThe American people aren’t buying it. \n\nCandidate Biden promised to KILL American energy dominance, and President Biden is following through. @MorningsMaria https://t.co/5jORrN0A68","date":"Wed Jun 15 15:09:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden Admin: you wouldn't have to worry about high gas prices if you drove an electric car or moved to Brazil!\n\n...what?","date":"Wed Jun 15 14:31:02 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m coming up next on @MorningsMaria discussing the Biden Border Crisis.\n\nI have talked to CBP. They have told me directly that the system is exhausted. Border Patrol needs support from the Admin and relief in policy. \n\nTune in!","date":"Wed Jun 15 10:16:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy Birthday to the U.S. Army!\n\nJoin me in honoring 247 years of men and women driven by service and sacrifice. Thank you to all past, present, and future soldiers who have safeguarded our country from enemies foreign and domestic. https://t.co/4ty20FWku4","date":"Tue Jun 14 23:19:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Odessa workers and officials are diligently working to repair the water break and provide relief water. For local information and current updates:\n\n👇👇👇\n\nhttps://t.co/zI97LGTAzr","date":"Tue Jun 14 21:21:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are closely monitoring the Water Main Break in Odessa. Bottled water is on its way to 3 water distribution locations:\n\n🔴Ector County Coliseum\n\n🔴Intersection of FM 1936 &amp; W. University Blvd. in West Odessa\n\n🔴McKinney Park on the south side of town","date":"Tue Jun 14 21:21:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Changing people's lives for the worse.","date":"Tue Jun 14 17:11:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"...the biggest factor in the demoralization of the Border Patrol has been the feeling that Biden has demonized agents for enforcing immigration laws that lawmakers like him passed in Congress.\" -@dcexaminer \n\nTragic. Border Patrol officers are heroes! https://t.co/N9o8y0O3U1","date":"Tue Jun 14 15:54:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. is currently dependent on Russia and its allies for Uranium—a mineral that powers approximately 20% of American homes.\n\n@RepNewhouse &amp; I introduced a bill to spur domestic Uranium production. Energy security is national security!\n \nMORE: https://t.co/siM9c0ejMV","date":"Tue Jun 14 14:51:59 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our National Flag represents the incredible freedoms, rights, and responsibilities entrusted to us as citizens of the greatest country. Join me in proudly waving our flag high today and every day. Happy Flag Day - may God bless our great nation! https://t.co/ffEId47pzm","date":"Tue Jun 14 13:21:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy #DairyMonth to all - including @Vollemansdairy! With 100 employees and producing milk for all of TX, they are critical to our economy - as are all farmers &amp; ranchers.\n\nExcited to return to Volleman's Farm soon. Let's celebrate our dairy farms &amp; workers together this month! https://t.co/fEpEnJet2y","date":"Sat Jun 11 14:01:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Sanctuary Cities (supposedly free from Federal immigration law) exist across the U.S. They encourage illegal immigration into our country.\n\n@POTUS should send the busloads of illegal migrants to sanctuary cities - NOT to West Texas.","date":"Fri Jun 10 14:24:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"JUST RELEASED: Prices are rising at 8.6% - the highest spike in 40 years.\n\nDemocrat policies are hurting American families.","date":"Fri Jun 10 13:03:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Coming up on @foxandfriends exposing the Biden Admin’s plans to possibly drop off buses of illegal migrants in San Angelo, Texas.\n\n@POTUS may be happy allowing nearly 3 million of illegal immigrants into the U.S. under his watch, but West Texas should not suffer the consequences.","date":"Fri Jun 10 10:24:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SpeakerPelosi, you have said, “show me your budget, show me your values.\" Our budget and values align with what Americans care about.\n\nWe value securing the border, protecting taxpayer dollars from the radical Left’s woke agenda, restoring American energy DOMINANCE, &amp; more👇","date":"Thu Jun 09 20:43:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@Deptula_David is spot on. We must address the USAF’s “pass-through funding” issues to help bolster American military readiness and ensure we can compete with China + other adversaries.\nhttps://t.co/WMnQh7eKbR","date":"Thu Jun 09 20:16:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"What a tragedy. May God grant their families comfort.\nhttps://t.co/oxXHcBaXIU","date":"Thu Jun 09 19:35:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Summer blackouts are coming because our policymakers have made our country totally reliant on unreliable energy sources. \n\nThe threat of cybersecurity attacks from Russia + more, combined with our reliance on unreliable energy sources, puts our grid in a dangerous situation.","date":"Thu Jun 09 19:21:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It is despicable that even after an armed man showed up at Justice Kavanaugh's house yesterday, @SpeakerPelosi gaveled the House out for the week without bringing @JohnCornyn's bill to increase protection for Supreme Court Justices and their families.","date":"Thu Jun 09 17:49:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Make Groceries Affordable Again!","date":"Thu Jun 09 13:23:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another shining example of @POTUS' failure in the international arena. His inability to bring his Latin American counterparts to the table shows he is WEAK on the global stage. \n \nWe must restore American leadership now!\n \nhttps://t.co/PZQUSGhnl1","date":"Thu Jun 09 12:58:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Incredible meeting former #NBA player and inspiring defender of human rights @EnesFreedom!\n\nHis fight against human trafficking in China—despite the hypocritical NBA's attempts to silence him—is inspiring.\n\nKeep up the good work, Enes! https://t.co/VmAoZafCGg","date":"Wed Jun 08 19:00:54 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Constitution clearly states that the U.S. Gov MUST protect states from an invasion—yet this admin is presiding over 2.5 million illegal encounters, increased cartel violence, and an influx of dangerous drugs into the U.S.\n\n@POTUS: follow the Constitution &amp; secure the border.","date":"Wed Jun 08 14:12:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats: If you would just be rich enough (like us!) to afford an electric vehicle, you wouldn't have to worry about high gas prices!\n\nCompletely out of touch. As if the price of gas only affects cars...","date":"Tue Jun 07 18:46:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why is @POTUS building more solar panels on the backs of CCP slaves instead of unleashing American oil &amp; gas producers to fuel our Nation? \nhttps://t.co/PBjcniCSyW","date":"Tue Jun 07 16:21:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Awesome! Congrats!","date":"Tue Jun 07 15:54:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's *incredible transition* to American families not being able to afford a tank of gas.","date":"Tue Jun 07 15:29:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The entire fighter pilot community is sending our condolences to Lt. Richard Bullock's loved ones and fellow service members. https://t.co/Mc7TAIrZla","date":"Tue Jun 07 15:28:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are in an energy expansion, not a transition. We must be able to provide for our growing energy needs, and renewables won’t get the job done. \n\nDOE &amp; FERC must focus on reliability, not vague climate goals that only please green special interests. https://t.co/dYJavyQHs9","date":"Mon Jun 06 20:04:47 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"New argument from the Left: Protect \"Democracy\" by censoring our political opponents because they're more popular than us.","date":"Mon Jun 06 17:39:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Lt. Col. James Earl Rudder of Eden, TX played a vital role in the D-Day Allied Invasion of Normandy. He is a hero.\n\nRead more about him, his team, and their courageous mission here: https://t.co/pDaN8eGZby","date":"Mon Jun 06 17:30:04 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats are literally putting on a show to try and distract from the myriad of crises their policies are inflicting on Americans.","date":"Mon Jun 06 17:29:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Where is Nina Jankowicz when you need her?\n\nDISINFORMATION👇","date":"Mon Jun 06 17:24:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Workers' real wages have decreased 10 of the 14 months since you've been in office, @POTUS.","date":"Mon Jun 06 16:04:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"78 years ago, courageous Allied troops stormed the beaches of Normandy⁠—turning the tide of World War II and leading to the defeat of Adolf Hilter and his Nazi regime.\n\nTheir heroism reminds us that freedom was valiantly fought for, and is worth defending still today. https://t.co/5pfoiXYq1W","date":"Mon Jun 06 13:42:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In the last week, we have seen the President and House Democrats display a complete lack of understanding of firearms and disregard for our rights. \n\nThe Second Amendment rights of law-abiding citizens must be defended.","date":"Fri Jun 03 01:56:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"SHAME.\n\nPresident Biden should be prioritizing Odessa, Texas over OPEC. Why is he rewarding our adversaries whose oil is nowhere near as clean as ours?\n\nhttps://t.co/vvieDjyYAY","date":"Thu Jun 02 18:31:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Gas prices rose to a national average of $4.72 per gallon today—nearly DOUBLE what they were when President Biden took office.\n\nUnleash American energy now! https://t.co/pkWLsAOx7D","date":"Thu Jun 02 16:07:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Attacks on US soil will NOT be tolerated.\n\nThe House must pass my Cyber Deterrence and Response Act to fortify our systems and put our safety first. It will force the Biden Admin to respond to cyberattacks from foreign enemies with forceful sanctions.\n\nhttps://t.co/cA4MpnJGvU","date":"Thu Jun 02 16:01:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"You bet it does.","date":"Thu Jun 02 13:54:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Land of the free, because of the brave. \n\nThis Memorial Day, we remember those lost in combat and pray for those left behind. We will never replace them, we can never repay them, and we will always honor them. \n\nGod bless our troops and God bless the USA 🇺🇸","date":"Mon May 30 19:46:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So proud of the heart of these student-athletes….many on this @AF_Baseball  team will soon begin their service to this great nation.\n\nMountain West Conference champs for the first time ever! https://t.co/YJMrD3dFqG","date":"Sun May 29 22:13:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As we learn more details of the heartbreaking tragedy in Uvalde, Camille and I are praying for the loved ones of the victims and for healing for the entire South Texas community.","date":"Tue May 24 21:00:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In the same week we learn: DHS released a suspected terrorist into the U.S. &amp; ISIS operatives planned to assassinate President Bush after illegally crossing the southern border.  \n\nThe threat of a deadly attack on U.S. soil is grave. We MUST secure our border.","date":"Tue May 24 16:38:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Forbes is reporting an ISIS plotter planned to assassinate George W. Bush with four Iraqi compatriots smuggled across the U.S.-Mexico border.\n\nThe threat of terrorism due to our porous southern border grows every day. We must secure our border. https://t.co/B3LsKdzVMq","date":"Tue May 24 16:24:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin’s Department of Homeland Security released a suspected terrorist into the U.S. for nearly three weeks. This is unacceptable, and a huge threat to Americans.\nBorder security is national security! https://t.co/NtBSbyJFij","date":"Tue May 24 14:37:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"American taxpayer dollars should never be used to enrich the #CCP. My bill to prevent DHS grants from going to universities that host Confucius Institutes is a critical step in confronting China's threats to our national security.\n\nRead more:\nhttps://t.co/ZT8hI5iIHf","date":"Mon May 23 15:53:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@CiaranCuffe Great visiting with you!","date":"Mon May 23 14:13:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m glad the court recognizes the harm that would be inflicted on Texas and other states if Title 42 was lifted in spite of Biden’s best efforts to further his open border policies.\n\nhttps://t.co/fGfjIMnjoz","date":"Fri May 20 21:54:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Democrats' latest attempt to smear oil &amp; gas workers and businesses with outcry over made-up claims of \"price gouging\" will do nothing to bring down prices.\n\nThe price gouging claim is a farce.\n\nThe solution to the high prices at the pump is MORE American energy production. https://t.co/8kvEMVxokn","date":"Thu May 19 16:05:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Midland Over Moscow!","date":"Wed May 18 19:57:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@WaPo is reporting that the Disinformation Governance Board is being shut down. Our @HouseGOP bill to defund the board + rightful outrage from Republicans has succeeded.\n\n@RepBoebert @RepFranklin @GOPLeader @RepMikeJohnson @SteveScalise @RepScottPerry    https://t.co/8DHqzybBsf","date":"Wed May 18 15:41:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Last week, Madelon Clark completed her spring internship in my DC office! Madelon is from Menard, Texas, and is studying Ag Comms at Texas Tech. \n\nPlease join me in saying \"thank you\" for Madelon’s hard work on behalf of our district. #TX11 is a better place because of you! https://t.co/i96Dq54M3o","date":"Wed May 18 15:08:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It took House Democrats over 250 days to support my border security tunnel bill. These pictures underscore the extreme sense of urgency we should all have.\n\nSeal the tunnels. Secure the border.\nhttps://t.co/ec1csod8UD","date":"Tue May 17 21:29:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another HUGE smuggling tunnel with electricity and a railway was just found linking California and Mexico.\n\nMy @HomelandGOP bill to give DHS the resources to seal these tunnels passed the House last month. I'm calling on the Senate to immediately bring it up for a vote.","date":"Tue May 17 18:00:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We know that the CCP is sending agents to infiltrate American university campuses and funnel our stolen IP back to the People's Liberation Army. Under no circumstances should U.S. taxpayer dollars be enriching the CCP or the PLA. We must cut these programs off once and for all.","date":"Tue May 17 17:17:02 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"While experts agree that there is no price gouging, Democrats continue to pursue a political messaging bill to try and save face. We need more American Energy! https://t.co/QKXdlyEwxW","date":"Tue May 17 17:10:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"f you like today’s baby formula mess, pass this bill.\" - @WSJOpinion https://t.co/VYrXKwaYhm","date":"Tue May 17 12:43:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Wonderful to meet @WinsomeSears — a fierce advocate for conservative values and the first Black woman elected to statewide office in Virginia. \n\nThank you for taking the time to come to @SteveScalise’s Whip Team meeting tonight! https://t.co/jIPud4spWp","date":"Tue May 17 02:49:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"What we saw this past weekend in Buffalo and Laguna Woods was devastating. Thank you to law enforcement for apprehending the perpetrators of these hate-fueled violent acts. \n\nMy thoughts and prayers are with the loved ones of those who were lost in such a reprehensible way.","date":"Mon May 16 22:12:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Completely unacceptable. This is nearly 1/3 the entire population of my entire Congressional District in ONE month.","date":"Mon May 16 22:02:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is what @SecMayorkas likes to call \"operational control of the border.\"","date":"Mon May 16 21:46:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As @SpeakerPelosi and House Democrats throw a hail mary attempt at saving their majority, the consensus on planet earth is that we need to encourage investment in our energy industry. Let's get serious and get back on the path of energy dominance. https://t.co/XgYreXFKU5","date":"Mon May 16 21:13:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Russia, China, North Korea, and Iran are actively working to harm the US and our allies through cyberspace. Congress must pass my bill (H.R. 7302) to send a clear message that the U.S. will not tolerate any attacks on our critical infrastructure. https://t.co/lCTgUHdnNe","date":"Mon May 16 19:58:33 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My bill deters would-be attackers by making sure the administration responds adequately to any attack and protects the energy sector by codifying its designation as \"critical infrastructure.\"\n\nRead more: https://t.co/sMDvj6Vff7","date":"Mon May 16 19:58:33 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"ECON 101: Let's focus on increasing SUPPLY before we jump into Venezuela's economic playbook.","date":"Mon May 16 18:55:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepMikeGarcia This is great! Can't wait to see it hanging in the Capitol!","date":"Mon May 16 18:46:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration is canceling domestic lease sales while simultaneously blaming oil &amp; gas producers for the high prices caused by their policies. \n\nPresident Biden's economic blunders continue. https://t.co/eNfQjyksqA","date":"Mon May 16 15:33:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Meeting w/ Concho County Sheriff Miller as well as the families of Deputy Leonard and Sergeant Jones - who lost their lives in the line of duty a year ago in Eden, TX. \n\nIt was an honor to thank them for their service and remember all those who have sacrificed. #BackTheBlue https://t.co/H1AQTAVx12","date":"Fri May 13 18:25:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is blaming skyrocketing energy prices on everyone but himself while at the same time canceling domestic oil leases.\nHis war on American energy through ever-changing policies and uncertain regulations is only making it more difficult to produce energy here at home.","date":"Thu May 12 20:30:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am calling on President Biden to immediately pass the Midland over Moscow Act, reduce barriers to increased production, and unleash American energy.","date":"Thu May 12 20:30:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Picketing a Justice's home is against the law. The DOJ must enforce it.\n\nProud to join this effort to stand up for the rule of law.","date":"Thu May 12 18:19:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are in the midst of a historic inflation crisis. Families are suffering and wages cannot keep up.\n\nWhat is the Democrats' answer? To PUNISH American energy producers. They can't be serious.","date":"Thu May 12 17:58:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Honored to join @GOPLeader for the Back the Blue Bike Tour honoring law enforcement officers, including two Concho Valley Sheriff's Deputies who lost their lives in the line of duty last year.\n\nLaw Enforcement officers are heroes. Proud to #BackTheBlue https://t.co/CHlaC0629U","date":"Thu May 12 17:12:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As a father to three young girls, the nationwide shortage of baby formula is personal. The Biden Admin must abandon their failed economic policies that have led to the supply chain crisis and ensure American families can feed their babies. https://t.co/4MZVK1wGRx","date":"Thu May 12 16:29:14 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another dangerous consequence of the #BidenBorderCrisis","date":"Thu May 12 14:34:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Live now!","date":"Wed May 11 16:02:14 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, House Democrats went on record blocking @HouseGOP efforts to DEFUND @POTUS' DHS \"Disinformation Governance Board.\"\nThis board is beyond alarming and a threat to our Constitutional right to free speech. https://t.co/yHEYaHPkwQ","date":"Wed May 11 01:55:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"TONIGHT: Republicans will force a Floor vote on @RepJohnKatko @GOPLeader @RepBoebert @RepMikeJohnson and my bill to defund President Biden’s “Disinformation Board.”\n\nAmericans deserve to know whether or not their Representatives support free speech.","date":"Tue May 10 21:39:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats control the House, Senate, and White House, yet President Biden is trying to pin the blame for record-high inflation on Republicans.\n\nThe American people will not be fooled. We know that President Biden's out-of-control spending programs are fueling inflation.","date":"Tue May 10 17:03:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats control the House, Senate, and White House.","date":"Tue May 10 16:20:09 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepJohnKatko This info used to be published under previous administrations, and I am glad to have restored one element of transparency with DHS.\n\nhttps://t.co/fkabQs7ekA","date":"Fri May 06 17:32:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"After months of pressuring the Biden Administration with RM @RepJohnKatko, DHS has finally accepted our request to regularly publish the number of possible terrorists caught trying to cross our borders.","date":"Fri May 06 17:32:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ms. Ann is a staple in Odessa who brings joy to everyone she encounters while working at @ChickfilA at 91 years young! \nIt was an honor to serve her lunch and thank her for the work she does to brighten the community and inspire future generations. Thank you, Ms. Ann! https://t.co/3kkUQ2VkY6","date":"Thu May 05 21:00:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to MCM Exploration and Diamondback Energy for giving Leader McMorris Rodgers and I a first-hand look at the innovation, entrepreneurship, risk, and hard work that goes into producing oil &amp; gas!","date":"Thu May 05 15:14:33 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is the epicenter of oil &amp; gas production in the Nation. We produce more secure, affordable, reliable, and clean energy than anywhere else in the United States. It was an honor to host @cathymcmorris in Midland for a hands-on look at the industry. https://t.co/ziw6C1Fv8L","date":"Thu May 05 15:14:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Democrats have bowed to green interest groups while demonizing American energy producers. The cult-like efforts by the Left to halt the production of traditional energy production has created an impossible situation for American energy companies.\"\n\nMORE: \nhttps://t.co/C4TVxXYAAx","date":"Tue May 03 19:07:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you for having me!","date":"Tue May 03 18:59:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"ODESSA: Please join me for coffee on Thursday morning at 8am in Odessa! https://t.co/V2hulJ8pNa","date":"Tue May 03 18:40:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@pastorms @SenTedCruz @JohnCornyn I introduced a bill today to defund the Disinformation Governance Board! https://t.co/5HSh97Dgo4","date":"Tue May 03 15:56:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@JoaquinCastrotx Congratulations!!","date":"Tue May 03 15:37:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am introducing a bill to DEFUND the DHS Disinformation Governance Board.\n\nWe don't need the 'fourth branch of government,' (unelected bureaucrats) spending taxpayer money on a program that would limit free speech in the United States of America.","date":"Tue May 03 12:55:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Overturning Roe is a momentous decision for LIFE.\n\nBUT—this leak must be investigated. There must be consequences for any attempt to intimidate the Judiciary.\n\nWe cannot let this go unanswered.","date":"Tue May 03 03:00:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If the Supreme Court overturns Roe v. Wade it will be the most important Supreme Court ruling in my lifetime. The United States can and must stand for life! https://t.co/aYKKeIG2nJ","date":"Tue May 03 01:19:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks so much for coming to the Permian Basin to see first-hand how we produce secure, affordable, reliable, and clean energy!","date":"Mon May 02 20:30:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"ATTENTION Biden's Ministry of Truth... I would like to report disinformation👇👇👇","date":"Mon May 02 15:46:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The @DHSgov Disinformation Governance Board is a threat to our right of free speech. DHS must focus on securing our border and preventing terrorist attacks, not fact-checking and censoring social-media posts.","date":"Fri Apr 29 15:07:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Blessed to be standing with Trevor Reed’s family. What a momentous day!\n\n@freetrevorreed @txmommypaula https://t.co/04ubz2KMS7","date":"Fri Apr 29 02:26:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I also reminded @SecBlinken of the importance of securing the release of @FreePaulWhelan and other Americans held abroad. \n\nIt starts today with Trevor's homecoming, and I hope the momentum will continue. \n\nWe should leave no American behind.","date":"Thu Apr 28 21:18:42 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I had the honor of thanking @SecBlinken and his team in a @HouseForeign hearing today, and I asked him to pass along my personal thanks to @POTUS. \n\nSO many people put patriotism over politics in our work to bring @FreeTrevorReed home. \n\nProud to be an American!","date":"Thu Apr 28 21:18:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Paula and Joey have prayed, advocated, and worked tirelessly to reunify with Trevor. Seeing them together again is a moment I will never forget. He is home. Our prayers have been answered.\n\nThank you to @POTUS for putting patriotism above politics to bring Trevor home!","date":"Thu Apr 28 14:32:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is the moment we have all been praying for. WELCOME HOME, Trevor Reed! 🇺🇸 @freetrevorreed https://t.co/GooLSxSfsk","date":"Thu Apr 28 09:35:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor Reed is Free!","date":"Wed Apr 27 21:27:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The news that my constituent Trevor Reed—a Texan, a Marine, and a patriot—will be reunited with his family in Texas is an answer to prayer.\n\nThankful to all who helped secure his release. @FreeTrevorReed https://t.co/AD2faEFf04","date":"Wed Apr 27 21:13:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepRonnyJackson Thank you, Ronny!","date":"Wed Apr 27 21:00:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Answered prayers! @FreeTrevorReed https://t.co/s2ZL0WmBok","date":"Wed Apr 27 14:55:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@michaelcburgess Thank you for your work and advocacy for Trevor, Dr. Burgess!","date":"Wed Apr 27 14:26:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I want to especially recognize Ambassador Sullivan and his team, as well as those at the NSA, NSC, SPEHA, and @POTUS for their compassion and care in bringing Trevor home.","date":"Wed Apr 27 13:55:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I would like to thank my colleagues in Congress for working in a bipartisan manner to pass our resolution calling for Trevor’s release, and for continuing to draw attention to his case—including @RepMcCaul, @JohnCornyn, @GOPLeader, @JacksonLeeTX18, @JoaquinCastrotx, and more.","date":"Wed Apr 27 13:55:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Reeds have been living a two-and-a-half-year nightmare fighting for their son’s release. Today, our prayers have been answered. I look forward to welcoming Trevor safely home.","date":"Wed Apr 27 13:55:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My constituent Trevor Reed has been released from Russian prison after being held for an anguishing 985 days as a political pawn. \n\nTrevor’s parents, Paula and Joey Reed, have been tireless advocates for their son's release. I cannot imagine their relief. @FreeTrevorReed","date":"Wed Apr 27 13:03:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our nation is blessed with an abundance of natural resources and a strong innovative spirit that encapsulates the American character. \n\nNowhere is that more evident than in the Permian Basin: where we lead the nation in secure, affordable, reliable, and clean energy production. https://t.co/XBLq9YKM7N","date":"Tue Apr 26 18:18:14 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ending Title 42 would mean that our Border Patrol officers would be barred from using one of the few border policies that work. \n\nKeeping it in place is a huge win for national security.","date":"Tue Apr 26 18:10:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Americans deserve security and transparency on our border. \nCongress should pass my bill to force the Biden Administration to report the number of known and suspected terrorists illegally crossing our border monthly.","date":"Tue Apr 26 18:05:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A win for free speech!\n\nhttps://t.co/2iLfTPrFi4","date":"Mon Apr 25 20:40:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"SPC Evans gave his life while trying to save the lives of two illegal migrants in the Rio Grande.\n\nThe border crisis is a complete tragedy. President Biden must work with Republicans to secure the border. \n\nWe are praying for SPC Evans' loved ones. He leaves this world a hero!","date":"Mon Apr 25 18:23:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Rest In Peace to the longest serving Republican Senator, Orrin Hatch. Thank you for your service to Utah and the USA.\n\nCamille and I are praying for his loved ones! \n\nhttps://t.co/tG0VNAorFw","date":"Sun Apr 24 21:17:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Absolutely tragic. Our law enforcement officials should not be paying the price for bad policies that incentivize illegal immigration. \n\nPraying for their loved ones.","date":"Fri Apr 22 22:43:02 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"ICYMI: https://t.co/FRcquKGAew","date":"Fri Apr 22 13:52:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Coffee at Kent Kwik this morning… I have a new appreciation for everyone who works to help others behind a counter or in a restaurant!! Thank you! https://t.co/X2qiQrEKwd","date":"Fri Apr 22 13:52:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy San Jacinto Day!\n\n186 years ago, Texas secured its independence by defeating the Mexican army and ending the Texas Revolution. \n\nWhat a glorious day to be a Texan! https://t.co/C1fnaJPcWQ","date":"Thu Apr 21 19:44:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"An immense amount of innovation, entrepreneurship, risk, and hard work goes into producing oil &amp; gas.\n\nThis industry powers our Nation and world.\n\nFollow along for a quick tour of a drilling rig in Midland, Texas. Thank you @LatshawDrilling for showing us how it’s done! https://t.co/SaRVX7ccnA","date":"Wed Apr 20 04:00:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our border communities and law enforcement officials are overwhelmed.\n\nNot only is President Biden doing nothing to quell this flood of migrants and drugs into our country - his policies and rhetoric continue to invite them in.\n\nEnough is enough. We must secure our border.","date":"Mon Apr 18 15:12:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Almost half of these migrants were expelled under Title 42 - the Trump-era immigration law that @POTUS is rescinding on May 23rd.\n\nUnder President Biden and \"Border Czar\" VP Harris, the Border humanitarian crisis is becoming exponentially worse.","date":"Mon Apr 18 15:11:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"More than 210,000 migrants tried to illegally cross our southern border last month - the highest monthly total in twenty years.\n\nThis is the direct result of President Biden's failing border policies.","date":"Mon Apr 18 15:10:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"He is Risen!","date":"Sun Apr 17 11:19:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"1 Peter 2:24 \"He himself bore our sins in his body on the cross, so that we might die to sins and live for righteousness; by his wounds you have been healed.”\n\n#GoodFriday https://t.co/JOO2pZrfyk","date":"Fri Apr 15 20:44:47 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I have been sanctioned by Russia for standing up against Putin's horrific war in Ukraine. This is a badge of honor. \n\nThe US will remain resolute in our support for the Ukrainian people and their right to remain free.🇺🇸🇺🇦 https://t.co/udbWf9iRuD","date":"Thu Apr 14 20:01:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m up next with Stu Varney on @FoxBusiness talking about President Biden’s disastrous decision to roll back Title 42 — one of the few policies allowing Border Patrol to turn illegal migrants away at the border. \n\nTune in!","date":"Fri Apr 08 14:17:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you Jason!","date":"Fri Apr 08 14:16:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"How can the Biden Administration have a plan to keep our border safe when they don't even know what is going on?\n\nPerhaps if they had ever visited the border, they would have a better idea. I invite Border Czar @VP and @POTUS to accompany me to face their crisis, head-on.","date":"Thu Apr 07 19:16:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Border Security is National Security. To protect our homeland, DHS needs resources to combat drugs and migrants flooding our country above AND below ground. \n\nThis is real problem that calls for real solutions. \n\nRead about my House-passed solution:\n\nhttps://t.co/PyrF3Imk4X","date":"Wed Apr 06 19:09:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, the House passed my legislation to crack down on smuggling rings and drug cartels flooding our country through illicit tunnels under the southern border. \n\nAbove or below ground, I am proud to continue working to secure our border. \n\nRead more: https://t.co/P2Xky19rq2","date":"Tue Apr 05 20:38:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"On #GoldStarSpousesDay, we honor the families of fallen service members. \n\nThinking of Cayssia David of our San Angelo office. Her husband gave the ultimate sacrifice for our country. \nThank you, Cayssia, and thank you to all Gold Star Spouses! Your sacrifice is not forgotten. https://t.co/TsViNUbL9G","date":"Tue Apr 05 19:56:02 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you, @GOPLeader, for hosting this border briefing/press conference. \nBorder Security is National Security - with President Biden's recension of #Title42, we have neither. \n\nMy @HouseGOP colleagues and I urged @POTUS to finally prioritize Border Security. https://t.co/fEZjNkUdjV","date":"Tue Apr 05 15:26:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Border security is national security - yet President Biden’s Border policies invite criminals into our country.  \n\nWhen will the Administration prioritize the safety of our communities?","date":"Mon Apr 04 22:10:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The CDC claims that the pandemic is over and we don't need health precautions at the border (Title 42) ... then WHY are masks still required on airplanes?","date":"Fri Apr 01 17:28:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It's official: the CDC is ending Title 42 on May 23. \n\nThis decision will have heartbreaking consequences for our border patrol, local communities, and country. \n\nAnother big mistake by the Biden Administration.","date":"Fri Apr 01 16:57:30 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Highlighting Ms. Elizabeth Ann Mafford - a local light in Odessa Texas. At the young age of 90, she spreads light and cheer every day through her work @ChickfilA!\n\nLearn more: https://t.co/RBaCN6jAFu https://t.co/GZTv5AxoBz","date":"Fri Apr 01 15:47:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are all blessed to represent the BEST state in the USA. Texans first. @TXStateSociety https://t.co/WNMpGTGeqc","date":"Fri Apr 01 00:46:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It is a huge comfort to all who know and love Trevor that the President of the United States is working to secure his release. \n\nI will continue to lead the effort in Congress to raise awareness to Putin's detainment of Trevor, and will not rest until he is safely home. https://t.co/KHgZcTWcMn","date":"Thu Mar 31 20:58:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Paula and Joey Reed are tireless advocates for their son Trevor—a U.S. Marine Veteran who has been held in Russia as a political pawn since August 2019. I am pleased that @POTUS took the time to personally meet with them in the White House.","date":"Thu Mar 31 20:58:33 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am honored to have hosted our local @MidlandChamber and @OdessaChamber this week in DC. \n\nYou are leaders in our community, working hard to keep the Permian Basin prosperous and innovative! https://t.co/U6NF6kq5h5","date":"Thu Mar 31 20:33:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"His demonization of American oil and gas producers was shameful and political two years ago, and it still is today.","date":"Thu Mar 31 19:52:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration is putting our country into a DANGEROUS situation by drawing down the Strategic Petroleum Reserve to levels below anything that’s been seen during the past two decades. \n\nThis is playing politics with our national security. \nhttps://t.co/98r4Ooi8Ox","date":"Thu Mar 31 15:30:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Meeting with Steve Pruett and Jim Wilkes — two great leaders of @IPAAaccess. \n\nIndependent producers are the innovators &amp; entrepreneurs driving our country’s energy production. They know best how to put #MidlandOverMoscow https://t.co/6PhnJzRqi5","date":"Wed Mar 30 22:34:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The consequences of this decision will not be humane, they will be heartbreaking.\n\nHuman trafficking and smuggling across our border has already reached historic highs. \n\nPresident Biden must absolutely NOT end Title 42.","date":"Wed Mar 30 20:34:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Moderating a bipartisan &amp; productive conversation about energy security and national security with @odessachamber @midlandtxchamber\n \nThank you to my colleagues for working on these critical issues, and taking the time to speak with us today! https://t.co/wFrdlHDjK8","date":"Wed Mar 30 19:08:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Rest In Peace to Don Young—the Dean of the House and a fierce advocate for Alaska. 1933-2022 https://t.co/Kbzallfa6f","date":"Wed Mar 30 00:51:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am honored to be hosting nearly 70 business and community leaders from both Odessa and Midland's Chamber of Commerce organizations in DC this week.\n\nThese leaders make the Permian Basin a better place.\n@OdessaChamber @MidlandChamber https://t.co/3jDywBAyga","date":"Tue Mar 29 21:37:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden’s bloated budget spends $4.5 billion dollars on lawyers for illegal immigrants, billions on electric vehicles and charging stations, and $11 billion in taxpayer dollars to fund the Left’s green climate agenda in OTHER countries. \n\nWe must refocus our priorities.","date":"Mon Mar 28 21:58:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It is clear that @POTUS is not buying his own groceries, filling up his gas tank, or watching his paycheck decrease in value each month. \n\nIf he was, he surely would not have proposed a nearly $6 Trillion budget that further fuels the already record-high inflation.","date":"Mon Mar 28 21:44:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"The Biden administration needs a dose of political and energy reality if we wish to sustain America’s energy dominance and provide a lifeline of oil and natural gas to countries willing to break away from reliance on Russia.\" -Bernard L. Winstein https://t.co/kQYYYDLRYc","date":"Mon Mar 28 17:24:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Honoring two Odessa recipients on this #NationalMedalOfHonorDay - USMC Private First Class Alfred “Mac” Wilson &amp; USA Staff Sergeant Marvin \"Rex\" Young.\n\nThe courage of these young men, who sacrificed their own lives for others, inspires us and reminds us of the price of freedom. https://t.co/ILlLakZM7w","date":"Fri Mar 25 16:42:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Iran is the leading state sponsor of terror and continues to be the greatest threat to regional stability and our ally Israel. \n\nI joined @RepFranklin and others urging Secretary Blinken against this dangerous mistake. Read our letter here: https://t.co/VgUjTQ4Qpb","date":"Wed Mar 23 21:01:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If President Biden continues to abandon national security, our allies and partners in the Middle East are going to look elsewhere for strength. \n\nThe Biden Administration must NOT remove the Foreign Terrorist Designation from the Islamic Revolutionary Guard Corps.","date":"Wed Mar 23 21:01:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's failing policies have caused the border crisis. Ending Title 42 at this time of historically-high illegal border crossings would be a huge mistake.","date":"Wed Mar 23 20:20:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨Just sent a letter to USDA requesting additional resources to help producers recover from the devastating wildfires in Texas. \n\nThank you to @RepRWilliams @JudgeCarter @RepRonnyJackson and @RepPatFallon for joining me in the fight to secure relief for our communities. https://t.co/JD6cC0etxJ","date":"Wed Mar 23 20:10:26 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Candidate Biden promised to shut down the fossil fuel industry.\n\nNow, President Biden claims he has done nothing of the sort and blames energy companies for the skyrocketing costs.\n\nWhich is it, @POTUS? https://t.co/JPZRE7vDis","date":"Wed Mar 23 19:25:54 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The devastation in Eastland County, TX is completely horrible. \n\nIn Carbon, 84 homes (80% of the town) and most of the community was destroyed by the wildfires that continue to rage.\n\nPlease pray for our communities and help where you can. https://t.co/9OHAvABlmK","date":"Wed Mar 23 00:48:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The devastating wildfires ravaging Central and West Texas are a tragic reminder that brush fires can become deadly in the blink of an eye. \n\nThankful our Border Patrol heroes apprehended him before he could do more damage.","date":"Tue Mar 22 19:44:01 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy National Ag Day!\nTexas farmers and ranchers keep food on our tables and clothes on our backs. They are the cornerstone of so many communities in TX-11.\nPlease keep the farmers and ranchers who are battling devastating wildfires in your prayers.\nThank you all! https://t.co/d1PHLKf7SJ","date":"Tue Mar 22 13:46:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's @ATFHQ's new policies threaten our #2A Rights. I joined @RepAndyBiggsAZ in demanding that ATF Acting Director Richardson deliver answers to why our constituents are being denied their right to build silencers. https://t.co/rfWkg5DfsD","date":"Mon Mar 21 20:59:25 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Heartbreaking. We must never forget the service and sacrifice our heroes make every day.\n\nGod bless!","date":"Mon Mar 21 20:44:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨2022 Congressional Art Competition is now OPEN for submissions! \nTX-11 students, apply here: https://t.co/H641nblJmi https://t.co/jKoKtjjvDy","date":"Mon Mar 21 20:36:37 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Rest In Peace to the Dean of the House who dedicated 50 years of his life to serving in Congress, @RepDonYoung. \n\nCamille and I are praying for his family and loved ones. He will be missed!","date":"Sat Mar 19 02:09:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is a dynamic situation, and I advise everyone to stay alert to local news and officials and exercise extreme caution. \n\nMy thoughts and prayers are with those affected, as well as the brave first responders who continue to fight these fires.","date":"Fri Mar 18 16:25:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My office is closely monitoring the multiple wildfires affecting Eastland, Runnels, Coleman, Brown, Mills, and Sterling counties.\n\nIf you are in need of emergency assistance, please call 9-1-1. For additional sheltering and safety information, please call 2-1-1.","date":"Fri Mar 18 16:25:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Later today, I will be introducing the Removing Arms from Terrorists Through Sanctions Act. My bill codifies a Trump Executive Order to forcefully prevent rogue actors like Russia from transferring arms or missiles to Iran.","date":"Thu Mar 17 18:29:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin is reportedly close to resurrecting a new version of Obama's disastrous Iran Deal. Afghanistan should have taught us to never negotiate with terrorists. They are not honest brokers. A new Iran Deal will end with Iran still pursuing a nuclear weapon.","date":"Thu Mar 17 18:29:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy Saint Patrick's Day, #TX11!🍀\n\nGod has blessed me with the best wife in the world, and we are lucky to raise our daughters in the best district in the USA! https://t.co/n0KuACSr9e","date":"Thu Mar 17 14:58:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you for your leadership in working to make America energy dominant again, Senator Cruz!","date":"Thu Mar 17 13:27:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Stay safe, #TX11!","date":"Wed Mar 16 21:51:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"He’s not asking for US troops, he’s asking for fighter jets like the Mig-29. \n\nMr President, stand up to Putin. Sanction Russian elites. Help get Polish fighters to Ukrainian pilots. Lead.","date":"Wed Mar 16 17:20:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When I met with Zelensky several weeks ago in Ukraine, he said he would fight for his sovereign borders, that they mattered. \n\nToday, he told a Joint Session of Congress that he needs help from President Biden. He’s asking @POTUS to lead the world on the issue of freedom. https://t.co/fl7CFsWmcF","date":"Wed Mar 16 17:20:14 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I just attended President Zelenskyy's joint address to Congress.\n\nHe spoke of bravery, courage, and fighting for freedom and human rights. All ideals we hold dear in America.\n\nThe U.S. stands with Ukraine🇺🇸🇺🇦","date":"Wed Mar 16 14:21:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I had a blast meeting Fort Concho Elementary and Action Middle School today on the steps of our Nation's Capitol. Thank you for stopping by, and welcome to DC! https://t.co/3SYZWz8EJM","date":"Tue Mar 15 22:08:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"America should be more than energy independent. We should be energy DOMINANT.","date":"Tue Mar 15 21:08:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Since 1973, 63 million innocent lives have been lost to abortion. Women deserve better than abortion. They deserve the support they need to care for their babies and themselves.\n\nProud to sign this letter with @RepBuddyCarter.","date":"Tue Mar 15 20:45:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to @BenShapiro for having me on air to discuss Russia's war in Ukraine and our vital energy sector here in the U.S. \n\nEnergy security is National security. We must put our resources to use, not only for the U.S., but our partners and allies.\nhttps://t.co/Q1vO4Ebomv","date":"Tue Mar 15 17:21:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"CBP just released the February illegal #border encounters: 164,973.\n\nUnder President Biden: \nFeb. 2022: 164,973\nFeb. 2021: 101,099\n\nUnder President Trump:\nFeb. 2020: 36,585 \nFeb. 2019: 58,317\n\nWe need an administration that prioritizes border security. https://t.co/uIkp6WqYfP","date":"Tue Mar 15 14:15:42 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is President Biden’s America\n\nhttps://t.co/2TeSCdVuJZ","date":"Fri Mar 11 21:52:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden’s Border Policies have failed us. It is time for strength. I will continue to push for strong border security and transparency.","date":"Fri Mar 11 20:52:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My office has learned that Trevor Reed has been transferred to a prison with a hospital - hopefully Trevor will begin to receive the care he desperately needs.\n\nWe will continue to work tirelessly to bring Trevor home. We call on President Biden to work to #FreeTrevorReed","date":"Fri Mar 11 20:44:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today is the one-year anniversary of the ARP/BBB being signed into law.\n\nThis bill caused soaring inflation, paid to keep workers on the sidelines, spent more than $500 billion to keep businesses/schools in lockdown, and has hurt the health of everyday Americans and our economy. https://t.co/TSuPFBHoxk","date":"Fri Mar 11 18:29:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Update from me on the Democrats' disfunction in D.C. today. \n\nAmericans deserve real solutions. https://t.co/fwRclFf7aT","date":"Wed Mar 09 22:37:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"America should be energy independent🇺🇸","date":"Wed Mar 09 20:37:30 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is ready to provide energy security for the US and our partners and allies. It’s past time for President Biden to put #MidlandOverMoscow \n\n@RepJimBanks and I hosted a @RepublicanStudy press conference today on the urgent need for American energy dominance. 🇺🇸 https://t.co/sr97fc0N8I","date":"Wed Mar 09 01:43:43 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should not rely on our adversaries for energy. \n\nPresident Biden’s first phone call should have been to the Mayor of Midland, Texas—not Maduro.","date":"Wed Mar 09 01:29:12 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should not be responding to shocks in the global energy market by becoming more reliant on Saudi Arabia and Venezuela. Let's champion production at home. \n\n@RepArmstrongND and I are inviting @POTUS to our districts to meet our hard-working energy producers. https://t.co/bs4JSg9a29","date":"Tue Mar 08 19:56:26 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It would be hard to find two better people for @POTUS to meet with in Texas than the parents of U.S. Marine veteran Trevor Reed, who has been unlawfully detained in Russia for over 2 years. I urge him to reconsider and meet with the Reeds immediately. https://t.co/ZVfyZCzsu3","date":"Tue Mar 08 19:15:46 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I stand with Paula and Joey Reed and remain extremely concerned about the health and safety of their son Trevor.\n\nHe has been in Russian prison for 935 days. It is long past time for Putin to @freetrevorreed.","date":"Tue Mar 08 14:54:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The President is in Texas today.\n\nHe won't meet with oil producers\nHe won't meet with border patrol\nHe won't meet with the family of Trevor Reed \n\nTrevor is a Texan and Marine Veteran being held as a political hostage in Russia. Texas needs our President to step up.","date":"Tue Mar 08 14:51:55 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. should not be energy dependent, we should be energy dominant.\n\n@POTUS must put #MidlandOverMoscow and unleash American energy to provide security for the U.S. + our partners and allies.\n\n@SundayFutures @MariaBartiromo https://t.co/hhDVYNvHxK","date":"Mon Mar 07 20:27:25 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"1. Ban Russian oil\n2. Unleash American production to provide energy security to our partners and allies around the world \n3. Rescind bans on federal leasing and permitting\n4. Certify North American pipelines\n5. Put #MidlandOverMoscow!","date":"Mon Mar 07 02:54:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My daughter’s volleyball tournament brought me to Lubbock this weekend. Thank you to @TexasTech for providing me with an office to do the segment from!","date":"Mon Mar 07 02:29:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you @MariaBartiromo for bringing @RepEllzey and I on this morning to discuss Russia’s war on Ukraine. We must restore American energy dominance to provide energy security to our allies and partners. \nWatch our segment @SundayFutures: https://t.co/yrUUFR1tjh","date":"Mon Mar 07 02:27:06 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m up next on Fox @SundayFutures with @MariaBartiromo discussing Russia’s war in Ukraine.\n\nWe have abundant natural resources in the Permian Basin. President Biden should call on West Texas producers to provide energy security for the US and our allies and partners.\n\nTune in!","date":"Sun Mar 06 15:45:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I agree! @POTUS and @SecGranholm, the Permian Basin and West Texas stand ready to put #MidlandOverMoscow. \n\nThank you for your support in Ukraine with @SpaceX Starlink!","date":"Sat Mar 05 02:03:06 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Almost impossible to believe I was here four short weeks ago. So much senseless murder and destruction by a war-crazed autocrat hell bent on total domination. We CANNOT let Putin go unchecked. The time to act is NOW. \n\nhttps://t.co/FUNQHUQRS9 https://t.co/7M3mAcX6La","date":"Thu Mar 03 21:46:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"You’re so Pfunny, Jimmy Pfallon! @JimmyFallon @FallonTonight https://t.co/LVfOWnJQY7","date":"Thu Mar 03 15:05:37 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"COMING UP @ 6pET: I'll be joining @SeanSpicer and @LyndsayMKeith on Spicer &amp; Co to discuss the importance of energy security in the midst of Russia's war on Ukraine, what President Biden should have said during the State of the Union, and more. Tune in! https://t.co/4C1SDbkEVc","date":"Wed Mar 02 22:31:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"For a week we have watched the tragic images and videos of war on the Ukrainian people. We must take inspiration from the Lion-like courage of Ukrainian President Zelenskyy. The time to help our Ukrainian partners is NOW. The US stands with Ukraine!\n\nhttps://t.co/diN7e4nx9c","date":"Wed Mar 02 21:23:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin has put their GND religion ahead of safety, the economy, and National Security.\n\nEnergy security is ensured right here in the Permian Basin. #MidlandOverMoscow","date":"Wed Mar 02 19:35:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@JohnCornyn Thank you Senator Cornyn! #MidlandOverMoscow","date":"Wed Mar 02 19:10:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today's Ash Wednesday marks the beginning of Lent—a time of renewal as we look to the hope of Jesus Christ that Easter will bring. Join me in praying for peace and justice across our Nation and globe. Wishing all who observe a blessed Ash Wednesday! https://t.co/s5xPpgscOM","date":"Wed Mar 02 17:49:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"...one by one European governments surrendered to Russian energy dominance.\" - @WSJopinion","date":"Wed Mar 02 16:47:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should never be reliant on our enemies for energy. #MidlandOverMoscow","date":"Wed Mar 02 14:41:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS: the hearts of our people are strong, and the state of our Nation could be—if you would work with me and my fellow Republicans to pass our common sense solutions to solve your border, economic, and international crises. Let’s get our country back on track.","date":"Wed Mar 02 03:38:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am proudly pro-life!","date":"Wed Mar 02 03:00:46 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden, you can’t call for a secure border when you are intentionally pushing open-border policies that emboldened 2.1 million illegal border crossings in 1 year alone. #SOTU","date":"Wed Mar 02 02:59:26 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There are still hundreds of millions of dollars in unspent “COVID-relief” funds… yet @POTUS thinks we need to spend more? #SOTU","date":"Wed Mar 02 02:52:26 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Inflation is taxation. #SOTU","date":"Wed Mar 02 02:39:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Let’s buy American products….starting with Permian Basin oil and gas. \n\n#MidlandOverMoscow","date":"Wed Mar 02 02:31:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We shouldn’t be releasing barrels of oil from our emergency supply. We should be approving pipelines nationwide and tapping into the Permian Basin instead!","date":"Wed Mar 02 02:19:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Energy Security is National Security... for America and our allies and partners.🇺🇸🇺🇦","date":"Tue Mar 01 20:55:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The SPR is STRATEGIC for a reason! It is for emergencies, not a price lever for the President to use because of his poor policy decisions. We should be approving pipelines nationwide and tapping into the Permian Basin instead! https://t.co/p6LwSXpIMn","date":"Tue Mar 01 17:36:33 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Prayer works.\n\nDuring WWII, the UK issued a call for 7 Days of Prayer. Each was followed by a miraculous victory over Nazi Germany and the Axis forces. \n\nPlease pray fervently for the safety of the innocent Ukranians boldly fighting for freedom. https://t.co/Vk9TGqKfbJ","date":"Mon Feb 28 21:07:40 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Although several members of Congress are calling for limiting U.S. natural gas exports in response to inflation at home, it is a terrible idea, harmful to U.S. foreign policy and useless in lowering prices for American consumers.\" -@samanthaenergy  https://t.co/StjEJdOvUQ","date":"Mon Feb 28 18:31:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ukraine is showing us that freedom is not free. Americans should never take our liberties for granted.","date":"Mon Feb 28 18:07:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Camille and I are saddened to learn of the passing of @SenFeinstein's husband of more than forty years. \n\nWe are praying for Senator Feinstein, and are sending our condolences to all of their loved ones.","date":"Mon Feb 28 17:09:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"For too long, the Left has bowed to their climate religion and demonized American oil &amp; gas—which is the cleanest in the world.\n\nRefusing to unleash our production has allowed Putin to control the lion's share of the energy supply in Europe. \n\nAmerican LNG is the answer! 🇺🇸🇺🇦","date":"Mon Feb 28 16:29:25 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Russia’s invasion of Ukraine is a 3 a.m. wake-up call to President Biden and America’s liberal political class: Cease your war on U.S. energy.\" - @WSJOpinion https://t.co/1qpmUtyFWX","date":"Mon Feb 28 14:29:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is the most prolific oil producing region in the world. We can provide energy security for not only our country, but our allies and partners as well.\n\nBiden’s refusal to unleash US oil &amp; gas in favor of the climate religion cannot stand.\n\nhttps://t.co/epckbaccAa","date":"Mon Feb 28 01:51:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To the brave citizens and leaders in Ukraine: Texans and all Americans stand with you. \n\nYour bravery and courage is admirable and inspiring. God bless you. https://t.co/2yY4XUnnqQ","date":"Sun Feb 27 18:45:06 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ukrainians are teaching the rest of the world a lesson about freedom, resolve, and love of country.","date":"Sun Feb 27 12:21:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"https://t.co/Zz4M7MNRYH https://t.co/FqiYRyrMnK","date":"Sun Feb 27 02:58:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Many leaders would have abandoned ship… Zelenskyy, on the other hand, is taking a stand for freedom, boldly demonstrating that freedom is worth fighting for.\n\nRead the rest of my thoughts in @usatodayopinion here:\n\nhttps://t.co/G9TsdOF6d7","date":"Sun Feb 27 02:38:37 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The United States must continue to #StandWithUkraine","date":"Fri Feb 25 17:58:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Only a few short weeks ago I met with @ZelenskyyUa in Ukraine. He emphasized how Europe's reliance on energy was the main contributor to Putin's aggression. Energy security is national security.\n\nUkrainians love their freedom. Zelensky's courage in fighting for it is inspiring. https://t.co/1vIvzL0B4z","date":"Fri Feb 25 17:58:55 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should be fueling our country and our allies with American, not Russian, energy.","date":"Fri Feb 25 17:24:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Energy Security is National Security","date":"Fri Feb 25 17:06:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden: stop accusing oil &amp; gas companies of hiking prices when you should be cutting the red tape and unleashing domestic production.\n\nWe NEED American energy to provide security for our country and our allies.","date":"Fri Feb 25 01:08:14 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m on Sean Hannity’s radio show right now discussing the importance of the Permian Basin to energy security for the US and our allies.\n\nTune in!","date":"Thu Feb 24 21:18:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In President Biden’s speech, he said he has known that Russia would invade for weeks. \n\nThe rest of the world has known for months and years even. \n\nThat’s why we’ve been demanding strength &amp; deterrence.","date":"Thu Feb 24 21:02:12 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS again accusing American oil &amp; gas companies of hiking up their prices.\n\nThe Permian Basin is the most prolific oil and gas producing region in the U.S. and an asset for security.\n\nStop blaming us and start utilizing American energy.","date":"Thu Feb 24 18:59:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ukraine is a test for the West. If Russia is allowed to take a sovereign country and destroy Democracy in Ukraine—China, Iran, and North Korea will certainly be taking notes.","date":"Thu Feb 24 17:48:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Putin is killing innocent Ukrainians and John Kerry is asking him to stay \"on track\" for the climate? Despicable.\n\nRussian energy is some of the worst for the environment. The Biden Admin climate religion has made our world less safe.","date":"Thu Feb 24 16:49:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden must vocally commit to unleashing American energy producers to secure our country and our allies.\n\nReopen North American pipelines, approve all LNG facility permits, pass Midland Over Moscow.","date":"Thu Feb 24 16:13:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. and her allies should not be reliant on our enemies for energy.\n\n@SpeakerPelosi: Pass Midland over Moscow. Force the White House to develop a plan to fuel the world with American—not Russian—energy.","date":"Thu Feb 24 15:24:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Now is the time for strength, not weakness.\n\nPray for Ukraine.","date":"Thu Feb 24 14:08:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am demanding that President Biden reverse course to finally impose crippling costs on Vladimir Putin and prevent further death and destruction in Ukraine, and to fully defend the United States and our allies from malign actors and enemies.","date":"Thu Feb 24 14:08:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Make no mistake, this is a brutal assault on a sovereign nation by a petty dictator to destroy the democratic nation of Ukraine. Putin and his cronies must be held accountable for their crimes.","date":"Thu Feb 24 14:08:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"For nearly a year now, I have been publicly calling on @POTUS to sanction Nord Stream II. I am glad the sanctions have been re-imposed. President Biden must follow this up by cutting the red tape and unleashing American energy production.","date":"Wed Feb 23 21:48:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In January alone, the Biden Administration released 62,573 illegal migrants into the U.S.\n\nIs it any wonder Putin doesn't believe Biden's claim to respect territorial sovereignty?","date":"Wed Feb 23 21:13:01 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Rather than releasing our strategic petroleum reserves (AGAIN), @POTUS should be approving North American pipelines and halting regulatory overreach! \nhttps://t.co/CwFTSRAtRg","date":"Wed Feb 23 20:18:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepMikeGarcia @WSJ #MACH1!","date":"Wed Feb 23 19:22:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"ATTN: Odessa 👀","date":"Wed Feb 23 18:07:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Even as Russian tanks roll into Ukraine, @POTUS is working to destroy American energy, when ours is already the cleanest in the world. \n\nDoes Biden think Putin measured the \"social cost of carbon dioxide\" before invading? https://t.co/P5WRUtXmsy","date":"Wed Feb 23 17:32:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"America and her allies should NOT rely on our enemies for energy.\n\nBiden must put #MidlandOverMoscow and fuel the world with American—not Russian—oil &amp; gas.","date":"Wed Feb 23 17:00:47 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"We introduced the Midland Over Moscow Act to use American resources to keep the United States and our allies safe and no longer dependent on our adversaries for energy.\" \n\n@RepJimBanks and I wrote an op-ed on #MidlandOverMoscow in the @WashTimes:\nhttps://t.co/4dgs1w6HRu","date":"Wed Feb 23 15:28:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is the most prolific oil and gas producing region in the Nation &amp; a staggering asset to National security.\n\nWhy is your administration leaving this powerful tool of American energy production on the \"do not use\" shelf?","date":"Tue Feb 22 21:27:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Putin is acting now because of President Biden's weakness.\n\nBiden: turned his back on American energy, abandoned Americans and our allies in Afghanistan, and is completely ignoring our own border.\n\nWeakness leads to crisis. We must return to peace through strength.","date":"Tue Feb 22 21:17:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. and her allies should not rely on our enemies for energy.\n\nIf President Biden prioritized #MidlandOverMoscow, we could provide energy security from production in the Permian Basin.","date":"Tue Feb 22 16:27:59 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's anti-American energy policies made our allies more dependent on Russian oil and gas than ever before.\n\nThis, coupled with the sequence of failures at home and abroad, created an environment of weakness and opportunity for Vladimir Putin to strike.","date":"Tue Feb 22 16:08:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Does the Biden Administration have a national energy strategy to get American energy to Europe? No. \n\nCongress must pass the #MidlandOverMoscow Act to cut the red-tape and fuel our allies with U.S. oil &amp; gas. https://t.co/GGsRr1UHnV","date":"Tue Feb 22 15:47:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is the most prolific oil and gas producing region in the U.S. We can provide energy security for our country and our allies.\n\nPresident Biden must unleash Texas oil &amp; gas producers to fuel the world with American—not Russian—energy.","date":"Tue Feb 22 15:11:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Fentanyl deaths have doubled in two years, and black men are seeing the biggest increases in drug overdoses. So why isn’t Vice President Kamala Harris doing something about the illicit drugs coming into the country through the southern border?\" @nypost https://t.co/zJpUmOwNRP","date":"Fri Feb 18 15:58:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Jim Hagedorn was an exemplary public servant for Minnesota, a defender of conservative values, and a champion for farmers and ranchers nationwide.\n\nCamille and I are sending our love and prayers to @RepHagedorn's family and friends—especially his loving wife Jennifer.","date":"Fri Feb 18 14:19:01 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Permian Basin is the most prolific oil &amp; gas producing region and an enormous asset for U.S. national security... yet the White House is keeping this powerful tool of American energy production on the \"do not use\" shelf. @POTUS, put #MidlandOverMoscow\nhttps://t.co/nw4D7FSTbf","date":"Thu Feb 17 21:44:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As we continue to support Ukraine, the U.S. must remain vigilant in backing our other allies in Eastern Europe from Russian aggression. I am proud to co-chair the Congressional Moldova Caucus to strengthen U.S.-Moldova relations + Moldova’s democracy and territorial integrity.","date":"Thu Feb 17 21:20:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This morning, Russian-backed separatists bombed a kindergarten in Ukraine as an attempt to create a false flag event. The Kremlin is spreading misinformation to justify further aggression. I stand with the people of Ukraine and support their efforts to defend their sovereignty.","date":"Thu Feb 17 21:04:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My new bill, the Midland Over Moscow Act, would reduce barriers for American energy producers to increase exports of U.S. Liquid Natural Gas. \n\nWe should be fueling the world with American—not Russian—energy.","date":"Thu Feb 17 18:53:50 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today I am proud to unveil the Midland Over Moscow Act. \n\nThis bill will strengthen U.S. energy independence and force the Biden Admin to develop an energy security strategy that will fuel the world with American—not Russian—energy.\n\n @POTUS must put Midland over Moscow. https://t.co/oh30CLvt2A","date":"Thu Feb 17 01:36:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Mayorkas should resign.","date":"Wed Feb 16 20:52:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I remain extremely concerned about the health and safety of my constituent, Texan Marine Veteran Trevor Reed. He has been wrongfully detained in Russia for over 900 days. Most recently exposed to another prisoner with active tuberculosis. \n\nPutin must @FreeTrevorReed immediately.","date":"Wed Feb 16 16:28:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. should not be waiting for a further Russian invasion to ban Nord Stream II. President Biden should never have greenlit the project in the first place.","date":"Tue Feb 15 20:52:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Intelligence is foundational to warfighting, and some of our military's premier intel experts are trained in #TX11 at Goodfellow Air Force Base. \nHonored to show @SteveScalise and @RepTonyGonzales GFAB's premier intelligence training and Fire Academy.\n https://t.co/O1981DZPa9 https://t.co/OoWuiApR2K","date":"Tue Feb 15 17:37:25 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Secretary Mayorkas is presiding over the worst border crisis in history and lying about it to Congress. His actions are putting the safety of American citizens in jeopardy. @SecMayorkas must resign. https://t.co/1DAjPr3bsF","date":"Mon Feb 14 21:25:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's weakness in foreign and energy policy has enabled the current crisis we are seeing in Ukraine. Instead of prioritizing foreign energy, @POTUS should be putting #MidlandoverMoscow. https://t.co/ba4ZvLsym5","date":"Mon Feb 14 17:21:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Trump was right.","date":"Mon Feb 14 17:04:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Airpower!","date":"Mon Feb 14 15:04:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My four sweet Valentines. I love these girls! https://t.co/1qKF7uKVSO","date":"Mon Feb 14 14:38:54 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Yes… even the NFL needs AirPower. https://t.co/SSA4IgcYbK","date":"Sun Feb 13 23:46:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Working with @SteveScalise and @RepTonyGonzales … you can’t help but get fired up about our country!! https://t.co/HbGJPi5dyK","date":"Fri Feb 11 17:38:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Do you think there’s a single NFL football team out there that would cut their practice in half? Absolutely not. \n\nYet military flight hours are getting cut every year. We can’t cripple US AirPower.\n\nThanks for @Forbes for covering the #MACH1Caucus  https://t.co/wOLCn1TmN5","date":"Fri Feb 11 17:09:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@DaRootDogg @HouseGOP Gig 'em!","date":"Thu Feb 10 15:42:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My look in 1982—the last time inflation was this high. https://t.co/VsQzHrIToj","date":"Thu Feb 10 15:08:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepMichaelGuest @Lancegooden @RepVanTaylor @RepDanBishop @RepMarkGreen @RepMMM @RepTroyNehls @Congressman_JVD @RepKevinBrady  @RepLeeZeldin @RepTedBudd @RepMoBrooks","date":"Wed Feb 09 21:23:12 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to lead a letter to @SecMayorkas with @RepBethVanDuyne and over 30 of our @HouseGOP colleagues demanding answers about Malik Faisal Akram, the foreign national and known criminal who took four people hostage in Colleyville, TX at the Beth Israel Congregation.","date":"Wed Feb 09 21:23:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you for joining us: @RepStefanik @RepBrianBabin @RepMcCaul @RepRonnyJackson @RepMcKinley @michaelcburgess @RepTimBurchett @RepDLamborn @RepDanCrenshaw @RepBillJohnson @RepEllzey @RepRutherfordFL @RodneyDavis @replouiegohmert @RepRWilliams @RepArrington @RepMikeGarcia","date":"Wed Feb 09 21:23:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Texans, and all Americans, deserve clear answers as to how a known criminal was allowed to enter the US and inflict terror on a Texas synagogue.\nhttps://t.co/OHF874YSG7","date":"Wed Feb 09 21:23:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why is @Twitter censoring this tweet? https://t.co/Ymu5dQODyT","date":"Wed Feb 09 18:59:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks to @ShannonBream of @foxnewsnight for having me on to discuss. The security of America and our allies should come first!","date":"Tue Feb 08 19:17:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden should be putting Midland over Moscow. \n\nUnfortunately, his weakness has done nothing but put money in Putin’s pockets &amp; embolden aggression against our allies. https://t.co/faiLyX4aBS","date":"Tue Feb 08 19:12:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Honored to hear from Rabbi Charlie Cytron-Walker of Congregation Beth Israel in Colleyville in his first testimony before Congress. His heroism and emergency training helped save his life and the lives of his congregants. \n\nTune in to @HomelandGOP: https://t.co/zPGBKCNctW","date":"Tue Feb 08 15:36:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Midland, Texas over Moscow!","date":"Tue Feb 08 14:58:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin is spending $30 million taxpayer dollars on smoking kits for \"users to smoke crack cocaine, crystal methamphetamine, and \"any illicit substance.\"\n\nThey are empowering—not preventing—crime. https://t.co/6nnlJXGhHN","date":"Mon Feb 07 20:21:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"February is #NationalCancerPreventionMonth. We have all have been impacted by this horrible disease—whether personally or when fighting alongside family members, friends, and neighbors. As you support your loved ones, please remember to get regular screenings.","date":"Mon Feb 07 19:25:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Props to @Anna_Giaritelli from @dcexaminer for this piece:\n“Our job’s a joke,” said a second Border Patrol agent stationed in Texas, where the bulk of the migrants are crossing. “We’re not doing our jobs. We’re releasing people all day.\" https://t.co/n9BeenDtbf","date":"Mon Feb 07 18:44:07 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@FrRyanRojo Pleasure to visit with you this morning. I hope you have a great week!","date":"Mon Feb 07 15:26:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to speak on behalf of AirPower in Congress with @RepMikeGarcia @RepFranklin &amp; @RepEllzey. #MACH1Caucus https://t.co/pxtahtfgtx","date":"Mon Feb 07 14:44:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden weakness = Russia &amp; China strength https://t.co/ziFgVHgvwQ","date":"Fri Feb 04 18:45:23 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@Montel_Williams @freetrevorreed @JacksonLeeTX18 @JoaquinCastrotx @JohnCornyn @RepMcCaul Thank you Montel! We must work together to bring Trevor home!","date":"Fri Feb 04 16:40:53 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidenBorderCrisis","date":"Fri Feb 04 16:07:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Brave Americans should be supported—not silenced—in standing up to communist China. \n\nThe Olympics should never have been held in a country committing active genocide in the first place.","date":"Fri Feb 04 16:02:59 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The America Concedes Act is chock-full of red-flag provisions that would damage our energy independence, including:\n🚩$3 billion for solar manufacturing program for renewables\n🚩$8 billion for UN Green Climate Fun\n🚩U.S. promising to abide by Paris Climate Agreement","date":"Fri Feb 04 14:58:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The CONCEDES Act will pour $8 Billion American dollars into the unaccountable UN Climate Fund, some of which will certainly be sent to China. My amendment to strike this slush fund was voted down. Democrats are not serious about standing up to China.","date":"Fri Feb 04 14:04:40 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Back the Blue","date":"Thu Feb 03 18:30:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Any attack on a U.S. Border Patrol agent is completely unacceptable. These heroes deserve resources and respect.","date":"Thu Feb 03 18:04:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ukraine is a test for the West. If Russia is allowed to invade a sovereign Democracy—China, Iran, and North Korea will be taking notes. \n\nWe need leaders capable of standing up to our adversaries, who put Midland over Moscow and prioritize our security.\nhttps://t.co/TB7is1Pi7o","date":"Thu Feb 03 01:11:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ukraine is testing the West. If Russia is allowed to invade a sovereign Democracy—China, Iran, and North Korea will be taking notes. \n\nWe need leaders capable of standing up to our adversaries, who put Midland over Moscow and prioritize security.\n\nhttps://t.co/FUa8jyadvT","date":"Wed Feb 02 23:40:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. used to negotiate from a posture of peace through strength. The Biden Doctrine is crisis through weakness.\n\n- Weak energy policies\n- Tragic failures in Afghanistan\n- Disaster at the Southern border\n\nPresident Biden’s weakness has emboldened Putin to act with aggression. https://t.co/YyZ3ssfhzd","date":"Wed Feb 02 22:24:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"About to go live on @FoxNews @AmericaRpts discussing how Biden’s weaknesses in energy policy and border security have emboldened Vladimir Putin. Tune in! https://t.co/IYiw7kiW8G","date":"Wed Feb 02 18:15:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It has been 900 days since Trevor Reed was arrested in Moscow. \n\nThat is 900 days of detainment on the basis of a ludicrous trial, 900 days of inhumane treatment.\n\nIt is way past time to #FreeTrevorReed. I call on @KremlinRussia_E to release Trevor immediately.","date":"Wed Feb 02 16:05:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today on #ChrisKyleDay, we honor the life of Odessa native Chris Kyle. A true hero, Chris served in combat as a SEAL sniper and dedicated his life to his fellow servicemembers.\n\nHis legacy reminds us of the daily sacrifice by brave Americans in uniform. May we never forget. https://t.co/aVqXAjPsoD","date":"Wed Feb 02 15:29:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Alessandra is a first generation American and student at Midland Legacy High School. Her heart has been set on serving in the U.S. military since elementary school—and today I delivered the good news that she has been appointed to the @NavalAcademy. What a special day. https://t.co/NiasxNDAGs","date":"Wed Feb 02 03:30:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration also knows the number of suspected terrorists who are illegally crossing our border, and they refuse to release that number to the American people.\n\nWe deserve transparency. I introduced a bill to force them to release the report.","date":"Tue Feb 01 19:21:30 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Completely unbelievable that the @WhiteHouse doesn't even mention the word \"China\" in their letter urging passage of @SpeakerPelosi's COMPETES Act—a bill to supposedly counter China. \nThis Administration and Democrat Congress are not serious about countering adversarial threats. https://t.co/tJyM00cMkA","date":"Tue Feb 01 19:07:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy #NationalTexasDay! Today, and every other day, we celebrate being the best state in the nation! #TexasForever https://t.co/pQ0OhTbM72","date":"Tue Feb 01 17:59:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"On this day in 1865, President Lincoln signed the 13th Amendment, outlawing slavery. 76 years later, Richard Robert Wright Sr. (American civil rights advocate, politician, and former slave) founded this day to commemorate the freedom of all Americans. \nGod Bless America! 🇺🇸 https://t.co/yys29Izi8z","date":"Tue Feb 01 16:14:53 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The surge in violent crime resulting in lives lost around the country is no laughing matter @PressSec","date":"Mon Jan 31 20:02:01 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We deserve answers @SecMayorkas","date":"Fri Jan 28 19:26:17 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"An illegal migrant murdered a TX police officer during a traffic stop last weekend. \n\nThis is tragic and infuriating. \n\nThe safety of our law enforcement heroes and all American citizens is in jeopardy when our border is not secure. https://t.co/TW4YE0ALLE","date":"Thu Jan 27 23:32:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, on Holocaust Remembrance Day:\n\nWe will honor the victims, the survivors, and the liberators. \n\nWe will remember the 6 million Jews and millions of others murdered by the Nazi regime.\n\nWe will renew our charge to combat anti-Semitism in all forms.\n\nWe will never forget.","date":"Thu Jan 27 23:27:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Unacceptable &amp; flagrant disregard for our National security.","date":"Thu Jan 27 20:14:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Speaker Pelosi's \"China\" bill is weak and chock-full of liberal wish-list policies. @RepublicanStudy introduced a bill with tough sanctions and provisions to stop the #CCP from stealing our IP. It's time to get serious about countering China. https://t.co/gej6xntOKP","date":"Wed Jan 26 21:04:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy Birthday, @GOPLeader! https://t.co/oelB0NOSrg","date":"Wed Jan 26 20:42:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SecMayorkas testified in front of @HomelandGOP multiple times last year that the border is \"secure.\" \n\nYesterday, he admitted that the border is \"worse now, than it, frankly, has been in at least 20 years, if not ever.\" \n\nHis testimony was a lie. https://t.co/xCcyN94nkX","date":"Wed Jan 26 19:24:34 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why is the Biden Administration consistently focused on the wrong things when it comes to COVID? Testing shortage. Lack of critical antibody supplies for states. Now this.\n\nWe shouldn’t ban these life saving treatments.","date":"Tue Jan 25 23:31:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Such a great discussion with these leaders in oil &amp; gas. Thanks for having me on!","date":"Tue Jan 25 17:14:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why have my Democrat colleagues on the Homeland Security Committee refused to hold even ONE hearing on border security?\n\n2 million illegal encounters in 2021 and over 100,000 young Americans dead from fentanyl certainly warrants attention and action.","date":"Tue Jan 25 16:45:42 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Border security should not be a partisan issue—it’s an American issue. \n\nIllegal border crossings topped 500,000 in the first 3 months of FY22–more than double FY21.\n\nWhen will the Biden Admin wake up? Secure the border. \n\n@MorningsMaria @FoxBusiness https://t.co/xXs9BPA4XY","date":"Tue Jan 25 16:36:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Texas has been hit hard by the Biden Administration's self-made border crisis, but with policies like mass release around the country, every state is quite literally a border state.\n\nRepublicans are calling for a safe and strong border.","date":"Tue Jan 25 15:45:28 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Coming up on @FoxBusiness with @MorningsMaria to discuss the new illegal border numbers &amp; my bill to require the Biden Admin to report on the number of Known and Suspected Terrorists attempting to enter the U.S. Tune in!","date":"Tue Jan 25 12:16:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#MidlandOverMoscow 👏","date":"Mon Jan 24 16:52:09 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Tragic. Texas DPS and officers from around the state are heroes who have been forced to leave their homes and families to secure our border. Please pray for his loved ones.","date":"Sun Jan 23 02:40:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Unacceptable. Americans deserve transparency and accountability.","date":"Fri Jan 21 20:43:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Border security is national security. We must know WHO and WHAT is coming across our border.","date":"Fri Jan 21 20:35:31 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today is a huge day for the Pro-Life movement! Add your voice to the movement by taking my survey:\n\nhttps://t.co/FGj6bJcSF4","date":"Fri Jan 21 19:49:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No American should have to choose between their job and a COVID-19 vaccine. Period.\nhttps://t.co/UIrm3wtj4j","date":"Fri Jan 21 19:18:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SecMayorkas has told me and @HomelandGOP that  the border is secure.\n\nIf that's true, why is @DHSgov hiding the number of individuals on the terror watchlist who we know have tried to enter this country?\n\nThanks @AdamShawNY for covering my new bill to restore transparency.","date":"Fri Jan 21 17:12:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@jonfranks @freetrevorreed Thank you Jonathan! It is an honor to advocate on Trevor's behalf. He deserves to come home.","date":"Fri Jan 21 17:02:23 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The pro-life movement is up against the most pro-abortion administration in the history of this country.\n\nThank you to all the brave Texans and Americans who are making their voices heard today in defense the unborn! #ProLife","date":"Fri Jan 21 15:49:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should be supporting the agriculture heroes who feed and clothe our Nation.\n\nInstead, Pres. Biden is crushing them. We need a new direction.","date":"Thu Jan 20 22:48:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"12 year olds on a school trip to Washington, DC cannot eat at a restaurant without a vaccination card, yet illegal migrants can board an airplane with an ARREST warrant?  https://t.co/SVShukIWZJ","date":"Thu Jan 20 21:11:13 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To tackle the \"root causes\" of the illegal immigration crisis—you just have to go to 1600 Pennsylvania Ave. \nInside, you will find an Administration intent on upending our border security protections and laws. https://t.co/xoVsFJbaZp","date":"Thu Jan 20 19:45:56 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden essentially invited Vladimir Putin to invade Ukraine yesterday. \n\nIf he won't act, Congress should. Conservatives have a plan which would impose real costs to deter Putin. I am proud to join @RepublicanStudy in this solution: https://t.co/vgvNFARBhI","date":"Thu Jan 20 18:55:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"100,000 young Americans dead from fentanyl\n2 million illegal entries into the country\n7% inflation\n346 Police officers shot in the line of duty\n49.6% higher gas prices\n100s of Americans abandoned in Afghanistan\nCountless empty shelves\n\nHistoric first year of crisis after crisis.","date":"Thu Jan 20 14:30:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"One year of endless crises","date":"Thu Jan 20 14:23:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Senate Republicans block Democrat federal takeover of elections**","date":"Thu Jan 20 02:28:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I was at the Inauguration last year.\nI heard President Biden's speech.\nI heard him promise to unite the country.\n\nWell, @POTUS has achieved his goal of uniting the country. We can all agree that we are much worse off today than we were a year ago. https://t.co/hsAKApIzt6","date":"Thu Jan 20 01:55:55 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"One year of President Biden = Nearly 2 million illegal border crossings + over 100,000 young Americans killed by fentanyl (majority trafficked across border). \n\nAmericans deserve a safe, operational border, and that is exactly what @HouseGOP is fighting for. #RepublicanRoundtable https://t.co/ZO0tc5MqPO","date":"Thu Jan 20 01:28:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden: \"I haven't attacked anybody publicly.\"\n\nPresident Biden (last week): Compares those who disagree with him to George Wallace, Bull Connor, and Jefferson Davis.","date":"Wed Jan 19 22:17:27 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden says, \"We're going to continue to work on trying to increase oil supplies that are available.\" I am sure the phones in Saudi Arabia and Russia are about to start ringing. We should be choosing #MidlandOverMoscow instead!","date":"Wed Jan 19 22:12:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden says he thinks his report card looks \"pretty good,\" and says he's happy to debate his performance on how he has handled the economy.\n\nToday's Politico/Morning Consult Poll says otherwise: https://t.co/TpmX9bX9gX","date":"Wed Jan 19 21:53:09 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why is President Biden \"guessing\" about President Putin potentially invading Ukraine? \n\nWe can only maintain peace through strength. @POTUS is showing nothing but weakness.","date":"Wed Jan 19 21:43:35 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Border security, energy prosperity, lower taxes, a strong economy, and freedom to start.","date":"Wed Jan 19 21:37:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS is asking the GOP what we are \"for\"... well, here's a few:\n\nStrong border\nSupporting law enforcement\nStanding up for parental involvement in education\nProviding for Veterans","date":"Wed Jan 19 21:26:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden just claimed the answer to inflation is passing more inflation-causing spending bills.\n\nNo.","date":"Wed Jan 19 21:15:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's administration is notorious for their lack of transparency and honesty with the American people.\n\nThey need to fess up to their mistakes and fix them. \n\nRelease the December border numbers now.","date":"Wed Jan 19 20:50:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To conclude... will you finally commit to visiting the border and seeing the suffering your policies and rhetoric have caused?","date":"Wed Jan 19 20:26:11 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Considering your recent comments, do you really think those who support voter ID laws are George Wallace?","date":"Wed Jan 19 20:25:55 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why did you cancel the Keystone XL pipeline, that would have provided 10k+ jobs to Americans, and then turn around and lobby for Russia’s Nord Stream II pipeline? \n\nYou should be putting #MidlandOverMoscow","date":"Wed Jan 19 20:19:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"$6 Trillion in American taxpayer dollars has been spent on so-called “covid-relief,” and hundreds of billions have been lost to fraud, waste, and misuse. \n\nHow can your admin justify asking for even more money for COVID?","date":"Wed Jan 19 20:19:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Your chaotic Afghanistan evacuation led to the abandonment of tens of thousands of Afghan allies and hundreds of American citizens. \n\nWe haven’t forgotten. When will they be rescued?","date":"Wed Jan 19 20:19:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why did your @FBI find it necessary to claim this weekend’s terrorist hostage attack on a Texas synagogue was not motivated by antisemitism?","date":"Wed Jan 19 20:19:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Americans lost 7% of their income to inflation last year after your $2 Trillion American Rescue Plan, that we knew would fuel inflation, was passed. \n\nWhy do you continue to pursue inflationary spending policies?","date":"Wed Jan 19 20:19:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why have you not fired @SecCardonas after he solicited the letter from the School Boards Association comparing concerned parents to domestic terrorists?","date":"Wed Jan 19 20:19:19 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS, under your watch, there have been nearly 2 million illegal border crossings, and more than 100,000 young Americans have been killed by fentanyl (much of which was been trafficked across our border). \n\nWhy do you refuse to acknowledge the border crisis?","date":"Wed Jan 19 20:19:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is slated to finally give a press conference in about an hour. Here are some questions I believe should be asked of the President...","date":"Wed Jan 19 20:19:18 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As a father to three amazing girls, being a pro-life supporter is more than policy, it's personal.\n\nProud to have earned an A+ from the @SBAList for championing LIFE in my first year in Congress. I am proudly #ProLife, and will always remain an outspoken advocate for the unborn. https://t.co/sWkj5BwVbp","date":"Wed Jan 19 19:46:53 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We have now endured a year of the Democrat-led federal government turning its back on border states like Texas—marred by record-high illegal border crossings and historic levels of drug and human trafficking.\n\nAmericans deserve safety and transparency.\n\nTune in to NOW:","date":"Wed Jan 19 18:11:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepMcCaul Happy Birthday Linda!","date":"Wed Jan 19 17:32:40 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨AT 1pm ET: @RepPeteStauber and I are leading the Republican Roundtable on Law and Order—highlighting the #BidenBorderCrisis and crime surge across the US.\n\nTune in here: https://t.co/SmA4JXvecR","date":"Wed Jan 19 17:04:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Last February, President Biden removed the terrorist designation from the Iranian-backed Houthi militia. Now, they have attacked Abu Dhabi's airport and critical oil infrastructure. The US should absolutely not lift sanctions on Tehran. https://t.co/S9s1FqS4LY","date":"Wed Jan 19 16:33:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Tragic and unnecessary.","date":"Tue Jan 18 19:22:23 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Supporting voter ID requirements or opposing this Washington power grab does not make you George Wallace or Jefferson Davis.","date":"Tue Jan 18 18:34:08 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I joined @RepAnnWagner in a letter to NBC urging them to air all footage of human rights protests captured during the coverage of the Winter Olympic Games.\n\nExpose the #CCP.\n\nRead the letter👇 https://t.co/ZsO4WvjnAq","date":"Tue Jan 18 16:03:47 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #CCP is committing genocide against nearly 2 million Uyghur Muslims they have enslaved, forced into abortions, sterilizations, labor &amp; worse.\n\nThe media should expose communist China by amplifying the voices of those brave enough to protest during the Olympic Games.","date":"Tue Jan 18 16:03:46 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Prayers answered!\n\nThankful for our state, local, and federal law enforcement heroes who secured the safety of the hostages.","date":"Sun Jan 16 12:53:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Praying for the law enforcement officers dealing with the hostage situation in Colleyville, and all those affected.\n\nMy office stands ready to help and support this community.","date":"Sat Jan 15 22:54:59 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Praying for Colleyville, TX and the safety of all of those in Congregation Beth Israel.","date":"Sat Jan 15 20:43:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why are Senate Democrats filibustering to protect Biden's pipeline gift to Vladimir Putin? Russia's major cyberattack against Ukraine and impending invasion are serious threats.\n\nAppeasement doesn't work. We cannot abandon another ally. Congress must sanction Nord Stream II.","date":"Fri Jan 14 19:36:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join @RepLisaMcClain and others in sending a letter to President Biden demanding he immediately fire Education Secretary Miguel Cardona. \n\nConcerned parents are not domestic terrorists, and parents have every right to be involved in what their children are taught.","date":"Fri Jan 14 16:30:46 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We now know that @SecCardona solicited the despicable NSBA letter comparing concerned parents to domestic terrorists, rewarded the NSBA president with a Board appointment, and then lied about it all.\n\nHe has betrayed the public trust. @POTUS must fire Sec. Cardona immediately. https://t.co/SzY5AMpypM","date":"Fri Jan 14 16:30:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This video is egregious. Why hasn't @Twitter removed the Iranian Supreme Leader's account? \n\n@PressSec sees it only as \"offensive.\" It's more than offensive—it is an active death threat that must be taken seriously. @POTUS @SpeakerPelosi @SenSchumer must denounce it immediately.","date":"Thu Jan 13 22:13:05 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Vladimir Putin is weaponizing energy and using the Nord Stream II pipeline as leverage over our allies in Eastern Europe. @SpeakerPelosi should immediately call for a vote in the House to sanction Nord Stream II.","date":"Thu Jan 13 21:44:10 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨BREAKING: Supreme Court STRIKES DOWN President Biden’s unconstitutional vaccine mandate for private employers.\n\nFreedom prevails!","date":"Thu Jan 13 19:35:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Honored to spend my morning with this fantastic group. Thank you for the work you all do!","date":"Thu Jan 13 16:22:30 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@j14mish Thank you for stopping by James!","date":"Thu Jan 13 16:21:58 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats are shirking their responsibilities to fix the crises we face. Instead, they're wasting time passing bills to federalize our election system.\n\nWe should be working to:\n- Bring down inflation\n- Secure the border\n- Establish American energy dominance\nJust to name a few… https://t.co/M5aj6m0f2S","date":"Thu Jan 13 16:21:44 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of sanctioning Nord Stream 2, the White House is lobbying against @SenTedCruz's bill to block Putin from weaponizing energy. \n@POTUS won't act so Congress should. Unleash American energy exports to liberate our European allies from Putin's grip. \n https://t.co/SLhAyRCIUG","date":"Thu Jan 13 15:56:24 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Looking forward to this discussion!","date":"Thu Jan 13 15:39:25 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration and Democrats in Congress have led us into a record-breaking season of crises.\n\nInstead of working to fix these issues, my colleagues on the other side of the aisle are attempting to distract the American people. We won't let them. https://t.co/Hmr39Q8FUo","date":"Thu Jan 13 04:45:06 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Supporting voter ID or opposing the Democrats' election power-grab does not make you George Wallace or Jefferson Davis. \n\nDemocrats are trying to distract from the real crises we are facing under their watch. The American people aren't buying it.","date":"Thu Jan 13 03:43:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Tonight, Dems are twisting the rules to nationalize our election system with a bill that sends hard-earned taxpayer dollars to finance political campaigns, requires states to allow felons to vote, and overrides wildly-popular voter ID laws.","date":"Thu Jan 13 02:31:21 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The policies of this administration and Democrat Congress have led us into crisis after crisis.\n\nInstead of working to fix the issues, the President is attempting to distract Americans by parroting lies and slandering states that have strengthened their election systems.","date":"Thu Jan 13 02:31:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Sending a big congratulations to World War II veteran Donald Huisenga, who received his high school diploma last week at 98 years old. \nMr. Huisenga was drafted 3 months before graduating high school and has dreamed of completing that milestone ever since. https://t.co/i2bSQ7otgQ","date":"Wed Jan 12 21:43:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This incredible honor is all due to the dedicated staff at the San Angelo VA and our wonderful community. \n\nThank you to all who were involved in recognizing Mr. Huisenga with his diploma and a graduation ceremony after 80 years of waiting. Just fantastic!","date":"Wed Jan 12 21:43:45 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It is despicable that @Twitter is allowing the Iranian government to issue active death threats against former President Trump and members of his administration.  \n\nThe tweets must be removed and accounts suspended immediately. CC: @TwitterSupport  https://t.co/Ad3uS0KTuj","date":"Wed Jan 12 18:38:40 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Massive Democrat spending has consequences—with inflation surging to the highest level in 40 years.\n\nAmericans are watching the value of their paychecks shrink in real time while @POTUS and his administration continue to ignore and deny the crisis. This is no way to lead.","date":"Wed Jan 12 14:19:41 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud of Camille and the girls for wearing blue today for #humantraffickingawarenessmonth. \n\nHuman trafficking is modern day slavery—and it is tragically occurring every day across Texas and around the world. Let’s work together to #EndTrafficking \n\nAwareness art by Caroline 🎨 https://t.co/c2VwLyfwfw","date":"Wed Jan 12 01:48:37 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Concerned parents are not domestic terrorists &amp; parents have the right to be involved in what their children are taught.\n@SecCardona should testify in front of Congress about this despicable behavior. The Biden Administration must be held accountable. https://t.co/MTrHWsboTI","date":"Tue Jan 11 23:10:52 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you for your participation in #WearBlueDay. We continue to fight against human trafficking as we raise awareness, support victims, and enforce legislation that protects our children and the vulnerable among us! https://t.co/4zQUY8bxqN","date":"Tue Jan 11 23:05:37 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is actively lobbying FOR Russia's Nord Stream II pipeline and AGAINST American energy independence.\nhttps://t.co/gAWeOWhIq4","date":"Tue Jan 11 22:41:29 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Attention high school students! Do you like a challenge? Thinking about serving your country while being paid to attend an elite college? Apply for a week-long summer camp at your favorite Academy NOW!  \nApplications for rising seniors close soon: https://t.co/O5jIXjGbkI","date":"Tue Jan 11 19:49:53 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Midland-based Reflection Ministries of TX is continuing to raise awareness on the human trafficking crisis in our country during #HumanTraffickingAwarenessMonth . I join them today, on #WearBlueDay, as we show our support for human trafficking victims. Join us to raise awareness!","date":"Tue Jan 11 19:21:20 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"At all times, there are 234,000 victims of labor trafficking and 79,000 victims of youth/minor sex trafficking in TX. In this crisis, we face everything from persons trafficked across the border to children trafficked in their own neighborhoods. #HumanTraffickingAwarenessMonth","date":"Tue Jan 11 19:20:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Oil &amp; gas is abundant in Colorado... but instead of utilizing this clean, reliable natural gas supply—the city of Boulder wants its residents to heat their homes by \"harnessing sunshine.\" \n\nThis is the energy future @POTUS and @RepAOC want for Americans.\nhttps://t.co/BLo8V1nEIG","date":"Tue Jan 11 18:39:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This👇I was at the border last week and am again inviting my Democrat colleagues to come to the border with me and see the suffering under the Biden Admin for themselves. \n\nCC: @SpeakerPelosi @POTUS @VP @RepAOC","date":"Tue Jan 11 18:19:12 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Less than a dime of every dollar in President Biden's $2 Trillion \"COVID relief\" bill actually went to fighting COVID. The rest was wasted, misused, and lost to fraud. Americans deserve transparency and have a right to know where their money is going. @POTUS must deliver answers.","date":"Tue Jan 11 16:59:00 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"4 sex offenders arrested in 48 hours crossing into the U.S. illegally. #BidenBorderCrisis","date":"Tue Jan 11 15:41:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"New York is allowing more than 800k non-citizens to vote in elections. The election security implications are blatant. @RepJeffDuncan &amp; I introduced a bill to prohibit federal funding for states and localities that allow non-citizens to vote. https://t.co/856zejZxmS","date":"Mon Jan 10 18:57:36 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"These photos are harrowing. Where is the outrage for the historic #BidenBorderCrisis? \n\nCC: @POTUS, \"Border Czar\" @VP Harris\nhttps://t.co/PyPKPt9xiC","date":"Mon Jan 10 18:40:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Source: https://t.co/03pcDWTW1X","date":"Mon Jan 10 18:19:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Yesterday, @SpeakerPelosi hinted that Dems may spend even more on so-called COVID relief.\n\nThis is an outrage considering rampant waste, fraud, and the fact that nearly half a trillion dollars in American Rescue Plan funds remain unspent.","date":"Mon Jan 10 18:19:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@michaelgwaltz Congratulations Waltz family! What a blessing!","date":"Mon Jan 10 17:37:32 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Supreme Court should strike down @POTUS' unconstitutional vaccine mandate.","date":"Fri Jan 07 19:46:30 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Source: https://t.co/FXeSqQpCbY","date":"Fri Jan 07 19:30:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Having trouble finding a COVID-19 test?\n\nDid you know that the Biden Admin repurposed $850 million—meant to develop COVID-19 testing capabilities—instead spending it on housing for illegal immigrants who crossed in the historic #BidenBorderCrisis","date":"Fri Jan 07 19:30:51 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats want to make it illegal to vote with an ID card and impossible to eat inside without one. Shameful.","date":"Fri Jan 07 16:04:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Lawrence Brooks, the oldest surviving WWII Veteran who helped secure freedom in Australia, has sadly passed away.\n\nGod Bless him and his family! https://t.co/U5bQsHu3b4","date":"Wed Jan 05 21:40:39 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Even CNN can't deny the tidal wave of US LNG that is needed to fuel the world. \n\nWithout American energy, our world would be cold, dark, and hungry.","date":"Wed Jan 05 21:31:48 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Follow me on GETTR...@RepPfluger\n\nhttps://t.co/uFakpLeHKF https://t.co/j6i1oMQnsw","date":"Wed Jan 05 21:07:38 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Large amounts of Fentanyl pour across our border daily, largely due to the failures of @POTUS and his Border Czar. We need concrete border solutions and real protection for our country. Thank you San Angelo PD for stepping up to the plate to keep us safe.\nhttps://t.co/CiG1YZRdsy","date":"Wed Jan 05 20:08:03 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When @POTUS and ‘Border Czar’ @VP Harris refuse to step foot at the border, Texans step up.\n\nThank you to @TxDPS + @CBP heroes here in Del Rio, TX and all along our border. https://t.co/MuKQkTfVXN","date":"Wed Jan 05 16:12:59 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m at the border in Del Rio, TX. Where are my Democrat colleagues? \n\nI am sincerely inviting them to stop playing politics and come with me to see the suffering along the border for themselves.\n\nOur border patrol and TXDPS officers deserve better. https://t.co/h6tfMWZcRL","date":"Wed Jan 05 00:47:53 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We must know who and what is crossing into our country. \n\nI am introducing legislation in the coming days that will require @DHSgov to tell the American people how many known and suspected terrorists have been apprehended at the border.\n\nAmericans deserve safety and transparency.","date":"Tue Jan 04 19:45:16 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Look at the difference in the old border fence vs. President Trump's border wall in Del Rio, TX. \n\nWhich one would deter you from crossing illegally? https://t.co/zPLtMu6UAi","date":"Tue Jan 04 19:45:15 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Actually—because of the actions you took, we have the highest inflation in nearly 40 years. https://t.co/wHDKNMXN9I","date":"Tue Jan 04 15:12:49 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"One Year Ago—I took the oath on the Constitution to serve #TX11 alongside my incredible family.\n\nWe are proud of the progress made in the first year championing conservative values and standing up for Texas. We would like to say a sincere ‘thank you’ for the opportunity to serve. https://t.co/Ms3zlVhh8W","date":"Tue Jan 04 02:56:57 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When Big Tech puts their hand on the scale in favor of specific elite views, the very foundation of our democratic republic is threatened. It is clear that any speech that doesn’t align with the political and media elites’ message is subject to being censored.","date":"Mon Jan 03 20:51:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I stand for transparency and accountability, and I stand ready to join my colleagues in protecting the free speech of all Americans—from educators to physicians to members of Congress.","date":"Mon Jan 03 20:51:22 +0000 2022","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of securing the border, the Biden Administration is spending their time trying to strike policies that actually work. \n\n#BidenBorderCrisis  https://t.co/9TLN8wwMfh","date":"Thu Dec 30 16:06:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Wishing you and your family a blessed and meaningful Christmas Eve! \n\nI hope you will spend this time remembering the true reason for the season: the birth of our Savior Jesus Christ—the deliverer of salvation and Prince of Peace. https://t.co/873oTHHD4i","date":"Fri Dec 24 16:50:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"US oil &amp; gas has lifted a billion people out of poverty. Now we're delivering critical fuel and warmth to our neighbors in Europe.\n\nBiden Admin should stop vilifying this reliable energy source and allow us to produce and export American LNG freely! \nhttps://t.co/xWdZ8sEot4","date":"Thu Dec 23 18:25:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The judges should follow the Constitution and strike down these mandates.","date":"Thu Dec 23 00:39:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@BillFOXLA @FoxNews Thanks for all you do!","date":"Wed Dec 22 21:12:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Huge WIN for conservatives! @Sen_JoeManchin is a NO on BBB agenda on Fox News Sunday:\n\n\"And I cannot vote to continue with this piece of legislation. I just can't. I've tried everything humanly possible. I can't get there.\"\n\n\"This is a no.”","date":"Sun Dec 19 14:24:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS, let’s cut the red tape and export more of our AMERICAN NATURAL GAS to China and India to bring down emissions and coal consumption. \n\nMy bipartisan bill, the LNG Export Expansion Act will do this.\n https://t.co/UvBNLC89Pf","date":"Sun Dec 19 00:35:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@jaketapper @freetrevorreed Thanks Jake. Collecting letters here: https://t.co/hpekypoaqQ","date":"Thu Dec 16 02:22:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@quinn_mriann @jaketapper Hi Mairann, you can upload a handwritten note or write one in the text box here: https://t.co/1lUFrUIDJ3","date":"Thu Dec 16 01:43:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@Thee_Instig8or @jaketapper Yes ma'am! My office is delivering copies to Paula and Joey to encourage them as well... you are welcome to address one directly to them.","date":"Thu Dec 16 01:42:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@jaketapper Thank you and please keep up the attention. They are about to miss another holiday season imprisoned for being Americans.\n\nI'm collecting cards to encourage Trevor if you or your viewers would like to send one: https://t.co/1lUFrUIDJ3","date":"Thu Dec 16 01:14:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@jonfranks @GOPLeader @freetrevorreed @txmommypaula Thank you Jonathan!","date":"Thu Dec 16 00:49:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to represent Paula and Joey Reed and advocate for the release of Trevor. He has been held hostage by Vladimir Putin for too long. #FreeTrevorReed","date":"Thu Dec 16 00:49:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Although @POTUS vaccine mandates have been struck down by courts, Congress has a responsibility to halt them for good. There is no excuse for @SpeakerPelosi to delay on the bill to repeal these mandates. I joined my fellow Republicans in calling on her to bring this bill to vote!","date":"Wed Dec 15 19:01:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our Nation is facing many major crises—inflation, looming energy crisis, and a disaster on our southern border (to name a few).\n\nInstead of working to fix these problems, Democrats are recycling their old tricks and wasting time to punish a former president yet again.","date":"Wed Dec 15 04:04:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor Reed's parents - Paula &amp; Joey of Granbury - are about to spend their 3rd Christmas without Trevor. I'm proud to have been joined by @GOPLeader as we gave Trevor's parents some of your #LettersToTrevor and discussed ways we campaign @KremlinRussia_E  to bring Trevor home. https://t.co/5EHTP5hYi3","date":"Tue Dec 14 23:39:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Stop the distractions. Secure the border. Finish the wall.","date":"Tue Dec 14 19:48:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join RM @CathyMcMorris in pushing forward legislation to unleash American energy!","date":"Tue Dec 14 19:47:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We have:\n\n❌Skyrocketing inflation\n❌Americans STILL stranded in Afghanistan\n❌Impending energy crisis\n❌Record-breaking illegal border crossings\n\nWe're not addressing ANY of these major crises in Congress today.","date":"Tue Dec 14 18:03:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am so proud of the people of #TX11 who are volunteering and donating to Kentucky, helping with the response efforts after parts of the state were devastated by deadly tornado outbreaks. What a great community!\nhttps://t.co/gTUTIydUHM","date":"Tue Dec 14 17:41:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks to vocal, bipartisan pushback from myself, @RepCuellar and more over the past few weeks, the White House has officially taken a Crude Oil Export Ban off the table.\n\nA WIN for American-made energy!\nhttps://t.co/MV5173MtAZ","date":"Tue Dec 14 16:53:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"CBO has informed President Biden that his $5 Trillion plan will not cost $0.","date":"Fri Dec 10 19:05:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"What is the Democrats' plan to combat the unbearable inflation spike? More spending! \n\nNext week they intend to raise our debt limit even higher to allow for the passage of their Build Back Bankrupt spending spree that @USCBO just confirmed will cost $5 Trillion.","date":"Fri Dec 10 19:03:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Seems our economy has had more reckless spending than it can take. \n\nThe highest inflation spike in 40 years should serve as the official cease-and-desist notice to BBB. https://t.co/VVkXutXio7","date":"Fri Dec 10 18:38:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepCarolMiller Grateful for your support!","date":"Fri Dec 10 16:02:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@AF_Academy Awesome, Sam!","date":"Fri Dec 10 15:35:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Is this what they're calling the #BidenBoom?","date":"Fri Dec 10 15:22:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This week Democrats BLOCKED my amendment which would prevent non-citizens from voting in elections. \n\nIt's simple. Only American citizens should be able to cast a vote in American elections. \nhttps://t.co/w9IGrYAErs","date":"Fri Dec 10 15:21:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Stop incentivizing this! Tragic. https://t.co/wejbfXI7oV","date":"Fri Dec 10 15:16:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A bipartisan letter I led with @RepCuellar got the attention of the @WhiteHouse today. A crude oil export ban would be catastrophic mistake for Texas energy workers and raise prices for consumers. \n\nInstead, let's remove barriers for AMERICAN producers #MidlandoverMoscow https://t.co/17mKVCUPMP","date":"Thu Dec 09 22:40:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to Karin and Cayssia from our San Angelo office for participating in San Angelo READS! Day today with @SanAngeloISD \n\nEducation is the foundation for a strong future!","date":"Thu Dec 09 19:30:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Rest in Peace, Senator Dole.","date":"Thu Dec 09 15:06:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepGrothman @RepRWilliams @POTUS Thank you for your support!","date":"Wed Dec 08 23:10:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor Reed is a Texan and Marine Veteran being held in a Russian prison as a political pawn. Trevor and his parents are spending their third Christmas apart this year.\n\nHe needs to know that we will never forget him. Please send a letter to Trevor here: https://t.co/1lUFrUIDJ3 https://t.co/lz10mqx48c","date":"Wed Dec 08 22:01:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Extremely saddened to learn of the passing of Seal Team 8 Commander Brian Bourgeois, who leaves behind a loving wife and five children. \n\nCommander Bourgeois leaves this world a hero. \n\nCamille and I are praying for his loved ones and fellow unit members. https://t.co/yChlmhHdtV","date":"Wed Dec 08 18:46:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The FY22 NDAA includes absolutely NO infringement on the Second Amendment—or so-called “red flag” laws, does not draft our daughters, and blocks the Biden Administration from forcing our troops to take classes on extremism. Read my full statement: https://t.co/E0G2W8VkIb","date":"Wed Dec 08 03:11:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Putin is testing American resolve, and our allies and partners around the world are watching. \n\nThe Biden Admin must take strong and decisive action to deter Russia through sanctions and lethal assistance to Ukraine.\n\nRead my full statement:\nhttps://t.co/TDQtyjUTGb","date":"Tue Dec 07 15:41:08 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"80 years ago today, hundreds of enemy planes descended on our naval base in Hawaii. In only a few hours, 2,400 Americans were forever entombed in the harbor’s waters. \n\nToday we remember those lost in the attack on Pearl Harbor—and honor their valiance and sacrifice.","date":"Tue Dec 07 14:32:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidenBorderCrisis","date":"Mon Dec 06 15:10:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepStefanik Thank you for your support Chairwoman Stefanik!","date":"Mon Dec 06 00:59:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Saddened to learn of the passing of Bob Dole—a World War II hero and lifelong public servant. His memory will serve as inspiration for generations to come. Camille and I are sending our deepest condolences to his family and loved ones. \n\nRest In Peace, sir!","date":"Sun Dec 05 17:11:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"An export ban will lead to even higher costs for American families down the line. U.S. energy policy should put #MidlandOverMoscow.","date":"Fri Dec 03 23:13:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepRosendale @RepRWilliams Thanks for your support!","date":"Fri Dec 03 20:05:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@MichaelCBurgess\n@RepCloudTX\n@RepGrothman\n@RepVanTaylor\n@RepAdrianSmith\n@RepChrisStewart\n@RepLizCheney\n@RonnyJacksonTX\n@RepBenCline\n@RepTedBudd\n@RepMann\n@RepBlakeMoore\n@RepKayGranger\n@RepMcClintock\n@RepCawthorn\n@RepHerrell\n@RepDLesko\n@RepBost\n@RepTonyGonzales\n@RepLoudermilk","date":"Fri Dec 03 19:31:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@TXRandy14 \n@RepKevinHern\n@RepBalderson\n@RepMMM\n@RepGregPence\n@BobLatta\n@KenCalvert\n@RepJimBaird\n@RepBrianBabin\n@JayObernolte\n@RepDonaldsPress\n@RepBurgessOwens\n@RepSteveChabot\n@RepRosendale\n@RepDanCrenshaw\n@RepTomEmmer\n@RepJohnJoyce\n@RepBentz\n@RepStefanik\n@RepJuliaLetlow","date":"Fri Dec 03 19:30:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks for the support\n@KevinBrady\n@RepArrington\n@RepRichHudson\n@StephanieBice\n@RepNewhouse\n@RepLaTurner\n@RepMichaelGuest\n@USRepGaryPalmer\n@LaurenBoebert\n@RepDavidValadao\n@ChipRoyTX\n@RepMcKinley\n@RepBobGood\n@RepBethVanDuyne\n@RepGosar\n@RickCrawford\n@RepMaryMiller\n@RepBuddyCarter","date":"Fri Dec 03 19:30:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨The Biden Admin may be considering re-imposing a disastrous Crude Oil Export Ban on American energy producers.\n\n@RepRWilliams and I led a letter with 61 Republicans opposing the ban that would be disastrous for the Permian Basin and all American families. #MidlandOverMoscow https://t.co/Lsj7kV9VGl","date":"Fri Dec 03 19:30:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our interns have been a valuable addition to my team this semester, helping my staff serve the people of #TX11. Thank you for all of your hard work Lindsey and Randy! https://t.co/OZq4bqQwei","date":"Fri Dec 03 19:28:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepBlakeMoore Congratulations Moore family! A new blessing!","date":"Fri Dec 03 15:57:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"More proof that the Democrats' massive spending bills are hurting—not helping—the economy. \n\nThe Senate should absolutely not pass the $5 Trillion #BuildBackBankrupt bill.","date":"Fri Dec 03 15:41:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The CR harms national security and military readiness while further exacerbating economic uncertainty and job insecurity. \n\nDemocrats should abandon their economy-killing radical pipe dreams and come to the table to deliver real solutions for American families.","date":"Thu Dec 02 23:21:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrat leadership has once again failed the American people as they demonstrate in real time their inability to govern—this time by kicking the can down the road to delay stable funding for FY22.","date":"Thu Dec 02 23:21:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"What about illegal migrants who are being flown around the country on the taxpayer dime without covid testing or vaccine requirements, @PressSec ? https://t.co/m50aeJN5sr","date":"Thu Dec 02 21:45:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Release 50 million barrels from our emergency supply—without an emergency—so we can get back a whole 2 CENTS?","date":"Thu Dec 02 21:31:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As Russia continues to take antagonistic actions against our allies and partners, it's more imperative than ever that the US support our allies.\n\nToday I introduced a bipartisan resolution with @RepDavidEPrice to strengthen U.S.-Moldova relations.\n\nMore:\nhttps://t.co/UqmnOt7frv","date":"Thu Dec 02 20:43:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden energy strategy:\nCANCEL pipelines\nBAN drilling permits\nPENALIZE American producers\nThen...\nBEG Russia and Saudi Arabia to produce more oil\n\nhttps://t.co/UbZMaaMAfU","date":"Thu Dec 02 16:27:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"POTUS will finally enforce the law and reinstate the Remain-in-Mexico policy. I fear this is too little too late, as his actions to intentionally weaken our border have already caused a record-breaking border crisis. \n\nBetter late than never.\nhttps://t.co/VGxKsneE5T","date":"Thu Dec 02 16:01:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#FreeTrevorReed #FreePaulWhelan","date":"Thu Dec 02 15:08:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Putin doesn’t believe in our country’s strength. \n\nWe deserve a President who will stand up to our international adversaries and protect US interests and allies with a strength and resolve worthy of our nation. \n\nI join @MorningsMaria to discuss @POTUS’s ailing security policy - https://t.co/Buo7woaTXt","date":"Thu Dec 02 15:06:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I thought Twitter took down misinformation 🤔","date":"Thu Dec 02 03:00:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Isaiah 9:6 - For to us a child is born, to us a son is given; and the government shall be upon his shoulder, and his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.","date":"Thu Dec 02 00:45:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The law of armed conflict (which most countries ascribe to) says when an enemy combatant asks for mercy, the combatant must save their life. \n\nYet here in America, we are not saving the lives of innocent babies. Tragic.","date":"Wed Dec 01 23:44:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I will always stand for life and speak up for the unborn. \n\nThe #Dobbs case that #SCOTUS is deliberating this week could overturn Roe v. Wade—the tragic decision that has ended over 62 million lives over the last 50 years in the USA.\n\n#EmpowerWomenPromoteLife https://t.co/GPaMFpvFfu","date":"Wed Dec 01 23:09:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@PressSec proving once again that the Biden Administration doesn't understand how energy markets work.","date":"Wed Dec 01 21:52:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, SCOTUS hears the most critical abortion-case since Roe v. Wade 50 years ago. \n\nI’m at SCOTUS with those speaking up for life. Our Nation has allowed abortions to go on for 50 years - 50 years of lives abandoned. \n\nI urge SCOTUS to make the right decision and defend LIFE. https://t.co/32cGnCP1kh","date":"Wed Dec 01 20:29:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden must follow through on commitments to support our Eastern European allies and loosen Vladimir Putin’s stranglehold on energy in the region. \n\nI joined @RepMcCaul in a letter pushing @POTUS to put #MidlandOverMoscow and empower American energy producers and allies.","date":"Wed Dec 01 20:28:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"https://t.co/GTACAqsUDb","date":"Wed Dec 01 20:28:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Putin is actively weaponizing the global energy industry.\n\nThe Biden Admin must follow through on the commitments made by President Trump to bolster the energy security of our allies and counter Russian aggression. \n\nBiden should put #MidlandOverMoscow \nhttps://t.co/GTACAqsUDb https://t.co/p3UM1bNP2w","date":"Wed Dec 01 19:54:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS &amp; @SecMayorkas, does this apply to the 2.1 million illegal immigrants who \"traveled\" across our southern border this year? https://t.co/gwKA3Vbu7J","date":"Wed Dec 01 19:24:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Extremely sad.","date":"Wed Dec 01 17:35:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. is one of ONLY 7 nations—including China and North Korea—that allow abortion-on-demand beyond the point that babies feel pain.\n\nIt is past time our country acknowledges the humanity of unborn children.\n\nI am urging #SCOTUS to #EmpowerWomenPromoteLife","date":"Wed Dec 01 15:39:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Important to note that Trevor and his family were forced to spend their THIRD Thanksgiving apart last week. Unacceptable. \n\nIt is long past time to #FreeTrevorReed","date":"Tue Nov 30 20:09:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor Reed of Granbury, TX is a Marine veteran who has been wrongfully imprisoned in Russia for 837 days. \n\nTY to @MicaSoellnerDC of @washtimes for shedding light on Trevor's tragic case as we work to secure his freedom. @FreeTrevorReed https://t.co/c8hP1y4bDe","date":"Tue Nov 30 20:05:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Farmers feed and clothe our Nation — and #TX11 is blessed with some of the best. https://t.co/NDopY9xOlQ","date":"Tue Nov 30 19:00:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is exactly why the government-overreach vaccine mandate is so disastrous - and why I am advocating hard to protect Texans against it!","date":"Mon Nov 29 20:36:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"During his campaign, President Biden promised to punish energy producers – and since his first day in office, he has waged war on our oil and gas industry. \n\nI outline @POTUS's attack on US energy and how this Admin endangers our vital producers below: \n\nhttps://t.co/VuNK9rijwc","date":"Mon Nov 29 18:54:00 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"How does the Secretary of Energy not know how many barrels of oil the country produces?","date":"Wed Nov 24 16:10:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS’ SPR release is a short-sighted bandaid that will ultimately lead to higher prices at the pump for all Americans next spring and summer. \n\nThis administration should be encouraging American energy production, not giving more leverage to OPEC and Russia. #MidlandOverMoscow","date":"Tue Nov 23 18:14:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Shocked by the news of the senseless and horrifying act in Waukesha tonight. Praying for the entire community—especially the injured and the families of those lost.","date":"Mon Nov 22 01:58:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Known terrorists are crossing our southern border, and the Biden Admin is hiding the numbers from the American people. I demand transparency. We deserve to know the truth about the threats our nation faces.\n\nRead more on my letter to @SecMayorkas:\n\nhttps://t.co/xDrK4mZ0q7","date":"Sat Nov 20 16:03:00 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Praying for the Airmen and their families at Laughlin AFB in Del Rio.","date":"Fri Nov 19 23:22:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Justice is not for sale. This is America. Due process and rule of law must be upheld.","date":"Fri Nov 19 20:06:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Every Democrat who voted for this radical reshaping of our country voted AGAINST rural America, energy producers, farmers, and families—and voted FOR tax hikes on all Americans, amnesty for illegal immigrants, and suffocating government control.\n\nMore:\nhttps://t.co/3ruQ9a3YI4","date":"Fri Nov 19 15:59:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is where @POTUS wants us to get our oil and natural gas from.","date":"Fri Nov 19 15:38:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are voting NOW on the largest tax increase and spending bill in history. \n\nAnyone who votes for #BBB is voting AGAINST American energy and agriculture dominance, and FOR tax hikes on all Americans, massive inflation, and suffocating government control.","date":"Fri Nov 19 14:39:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats have left the House Floor. They can’t stand to hear the truth of the bill. https://t.co/SF5vaIKwzR","date":"Fri Nov 19 05:28:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SpeakerPelosi and Democrats can’t stand to hear @GOPLeader tell them what’s really in #BBB","date":"Fri Nov 19 05:19:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"House Democrats tried to debate this bill for 10 minutes… now it’s 4 hours…  and counting!","date":"Fri Nov 19 05:08:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Keep up the good work!","date":"Fri Nov 19 04:58:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This Bankrupting bill will destroy our economy and make our energy producers second to adversaries like Russia and China.","date":"Fri Nov 19 03:13:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Build Back the Border 🇺🇸","date":"Fri Nov 19 03:07:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Build Back Bankrupt will cripple our economy and force hard-working Americans to lend their tax dollars to the Democrat’s socialist agenda.","date":"Fri Nov 19 02:56:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Americans deserve to KNOW what’s in the Democrats’ multi-trillion dollar spending scam.\n\n- Tax hikes on ALL Americans\n- Green energy welfare payouts\n- Amnesty for 8 mill. illegal immigrants  \n- Countless new entitlement programs\n\n@HouseGOP is behind @GOPLeader in saying NO. https://t.co/uZIVbs49Vc","date":"Fri Nov 19 02:55:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"CBO confirming what we all knew. The Build Back Bankrupt bill is NOT paid for. https://t.co/iBM5CEZ6oQ","date":"Fri Nov 19 00:09:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another fantastic step in Lithuania's efforts to stand up to up to the bullying and coercion of the #CCP and strengthen their relationship with Taiwan.\n\nThe U.S. will continue to support our friends and allies: #Lituania &amp; #Taiwan \nhttps://t.co/m5wpJ3VlF1","date":"Thu Nov 18 22:11:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Blaming and investigating American oil companies when he's done everything in his power to shut off domestic production... https://t.co/KasLCwij47","date":"Thu Nov 18 19:42:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Congratulations to @CapitolPolice graduates and canines Frodo, Labi, Bony, Velus and Scöby! \n\nThank you ALL for your service!","date":"Thu Nov 18 19:25:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"U.S. energy should come from the Permian Basin—but @POTUS would rather buy from Russia and OPEC. \n\nMr. President, its time to put #MidlandOverMoscow https://t.co/Ue95bpVK6X","date":"Thu Nov 18 19:10:50 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Iran is the largest state-sponsor of terrorism. \n\nThe Biden Administration's efforts to re-enter the Iran Nuclear Deal are dangerous and will only put the world at greater risk.\nhttps://t.co/4iK1tdcLnH","date":"Thu Nov 18 18:52:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To be clear: I am not anti-vaccine, I am anti-mandate.","date":"Thu Nov 18 18:42:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"20 minutes for almost $2 Trillion \n\nThat's all democrats will allow for debate","date":"Thu Nov 18 18:17:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's spending spree includes a massive tax cut for the wealthy in high-tax blue states led by Democrats like New York, New Jersey and California.\n\nSeems like Biden is really only trying to #BuildBackBlueBillionaires\n\nhttps://t.co/Kyoj9VDGbQ","date":"Thu Nov 18 15:09:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BuildBacktheBorder","date":"Wed Nov 17 21:15:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Congress has the ability to nullify @POTUS' illegal COVID-19 mandate, and we should. \n\nProud to join @RepFredKeller and 160 other @HouseGOP + all 50 Senate Republicans in introducing a resolution to protect the jobs and freedoms of hard-working Americans. \nhttps://t.co/z5GiKOOdhg https://t.co/PrZnB1J62Z","date":"Wed Nov 17 19:19:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidenBorderCrisis","date":"Wed Nov 17 14:27:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is trying to help Russia and OPEC AGAIN. \n\nImposing an export ban on US crude oil would be a catastrophic mistake. #MidlandOverMoscow","date":"Wed Nov 17 14:07:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SecGranholm singing about the end of gasoline and fossil fuels in 2018... This is Biden’s Energy Secretary. https://t.co/UzpKHtAp9s","date":"Wed Nov 17 01:54:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No one should be forced to choose between a personal healthcare decision and their job. Good on Texas!👏","date":"Tue Nov 16 22:12:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Natural gas is NOT crude oil... I invite @AOC to meet with me and discuss these differences. \nBoth are critical to an all-of-the-above energy strategy that we need to maintain an abundant and affordable energy supply. https://t.co/DeNP6i8IUE","date":"Tue Nov 16 20:10:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The @WhiteHouse is already urging Dems to disregard the CBO score and claiming that the only way their reckless spending bill will be paid for is by combing through the bank accounts of Americans who spend $28 per day.","date":"Tue Nov 16 20:05:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thread from Vice Chairman Johnson:","date":"Tue Nov 16 19:56:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another record-shattering month at the border: Over 164,000 illegal migrants attempted to cross the U.S.-Mexico border in October. \n\nThe HIGHEST total for October in the history of @DHSgov. #BidenBorderCrisis","date":"Tue Nov 16 13:29:08 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Meanwhile, the #BidenBorderCrisis rages on. https://t.co/AecgnVa3fX","date":"Mon Nov 15 23:22:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Halting American crude oil exports will do nothing to lower gasoline prices for Americans. That isn't how a global market works.","date":"Mon Nov 15 23:12:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It isn't Christmas yet, but @POTUS is already giving OPEC and Putin another gift. \n\nIssuing more drilling bans in America while green-lighting Russian energy projects and giving them more leverage over our European allies. #MidlandOverMoscow\nhttps://t.co/7BbHpmUdw8","date":"Mon Nov 15 16:46:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden's doctrine has created another crisis due to weakness that continues to erode American strength and credibility.","date":"Mon Nov 15 15:28:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden’s decision to remove the Iranian-backed Houthis from the terror list was dangerous and reckless.\n\nHis disastrous foreign policy is failing our allies and partners around the globe while emboldening our adversaries. \n\nhttps://t.co/tg4C9MG1WU","date":"Mon Nov 15 15:28:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"American families are already paying the price of Bidenflation. The last thing we need are tax hikes.","date":"Fri Nov 12 15:59:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Perfect example of the consequences of depending on unreliable energy sources. https://t.co/Q0Z55FkaMq","date":"Thu Nov 11 16:33:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To our veterans: Thank you for your selfless service. Your valiance is not forgotten, and your sacrifices are valued.\n\nBecause of you, my wife and I can raise our daughters in a country that is safe, secure, and full of boundless opportunities. Thank you.\n\n#VeteransDay2021 https://t.co/dQPzb14Cf4","date":"Thu Nov 11 13:33:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is again prioritizing Moscow over Midland. \n\nHis Admin hates American-made energy so much that his radical Comptroller nominee is openly calling for oil &amp; gas producers to go bankrupt—never mind the millions who would lose their jobs. We deserve better.","date":"Wed Nov 10 21:06:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Inflation is tax on everyone, and consumers are going to continue to feel its affects under the Biden Agenda. \n\nLet's change course. \n\nFirst priority is stopping the trillion dollar spending spree proposed by Ds that will only further fuel this crisis.","date":"Wed Nov 10 16:30:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If this is really the @WhiteHouse's \"top issue,\" why aren't they promoting domestic oil &amp; gas production and cutting red tape to unleash AMERICAN energy? #MidlandOverMoscow","date":"Wed Nov 10 01:42:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"On World Freedom day, we celebrate the fall of the Berlin Wall and recall the bravery of those who stood up to tyranny. I am thankful to all the brave men and women who stand today to advance the cause of freedom.","date":"Tue Nov 09 22:16:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks for having me on!","date":"Tue Nov 09 15:05:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Texan and Marine Veteran Trevor Reed has been wrongfully imprisoned in Russia for 815 days. As the deplorable conditions he is being held in continue to worsen, I join his family in again calling on the Putin Regime to @FreeTrevorReed.","date":"Tue Nov 09 14:58:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I will continue doing everything in my power to support the medical freedom of Texans.","date":"Sun Nov 07 23:12:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I applaud the 5th Circuit’s decision to temporarily halt President Biden’s tyrannical Covid-19 vaccine mandate. \n\nForcing private businesses to act as the vaccine police, and workers to choose between their jobs and a personal medical decision is complete government overreach.","date":"Sun Nov 07 23:12:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My statement on the $1.2 Trillion so-called “Infrastructure” bill: https://t.co/Nwhp9vzxUO","date":"Sat Nov 06 14:08:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In their rush to placate green special interests, this Administration and Democrat Congress are prioritizing Moscow over Midland. OPEC over Odessa. Putin over the Permian Basin.\n\nI am voting NO on this radical, anti-small business agenda, and urge my colleagues to do the same. https://t.co/2nn4E3RXYI","date":"Sat Nov 06 01:39:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SpeakerPelosi just announced that they will NOT bring Build Back Better to a vote until we know the true cost to the American taxpayer.\n\nOur messaging is working and the American people are waking up. At least for now, common sense has prevailed.","date":"Fri Nov 05 21:08:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor has been imprisoned for far to long by the Putin Regime. I am proud to advocate for his release today and every day. It's long past time to #FreeTrevorReed","date":"Fri Nov 05 21:00:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"For a start, how about we stop begging OPEC for oil and get back to American energy independence, @SecGranholm?","date":"Fri Nov 05 15:08:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SecGranholm's statement is completely false. From Day 1, the Biden Admin has been kneecapping the American O&amp;G industry. \n\nCompanies in my district are suffering under Biden's policies and have told me first-hand how they are experiencing delays and hurdles to production.","date":"Fri Nov 05 15:08:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Awesome catch Tom!","date":"Thu Nov 04 21:32:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Francisco Cuellar, a 46 year old father of four was murdered by a 24 year old Honduran who posed as a minor and crossed the Mexico-Texas border illegally. \n\nFrancisco should be alive today. Tragic.\n\nhttps://t.co/EylYZZZrX6","date":"Thu Nov 04 21:30:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS and @SpeakerPelosi claim their massive socialist spending spree will cost $0, yet they are rushing it to the Floor before @USCBO can reveal the REAL cost.\n\nI joined @JayObernolte and @HouseGOP calling for the CBO to publish a full cost estimate before it is voted on.","date":"Thu Nov 04 16:27:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I look forward to speaking with @USAmbMex soon to enforce our commitment to this issue.","date":"Thu Nov 04 15:41:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Pleased to see that Ambassador Salazar heeded calls from Texans in Congress to address the discriminatory actions taken by the Mexican government. \n\nVigorous enforcement of the historic #USMCA agreement is critical to shipping more made in Texas goods across North America.","date":"Thu Nov 04 15:41:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"But I thought renewables were the future, @GavinNewsom? It's time for Democrats to embrace natural gas as the reliable fuel to reduce emissions and keep the lights on! https://t.co/Fpp2mbcSIe","date":"Thu Nov 04 14:34:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, I am introducing a bill with @HouseGOP to block the Biden Admin's attempt to reward illegal border crossers with $450k checks.\n\nWe cannot send the message that if you break our laws to cross the border illegally you will get nearly half a million $ https://t.co/KpbbvGFwaY","date":"Thu Nov 04 13:57:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to TX @farmcredit and @Vollemansdairy for making the trip up to DC. \n\nTheir work feeding this Nation and the supporting the next generation of young farmers and ranchers could not be more important. #TXAg https://t.co/BoqPhdDw0p","date":"Wed Nov 03 22:44:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Parents matter 🇺🇸","date":"Wed Nov 03 13:51:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A natural gas tax will disproportionately harm working families, farmers and ranchers, and our energy producers in the Permian Basin.\n\nI am proud to intro' a resolution with over 80 of my @HouseGOP colleagues condemning this tax increase on all Americans:\nhttps://t.co/73Yd8JASMU","date":"Mon Nov 01 20:42:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Trump put America first and made the US energy independent for the first time in decades.\n\nPresident Biden would rather put America last and hob-nob with the global elites. https://t.co/bLE7MfEAuQ","date":"Mon Nov 01 20:26:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is in Europe this week begging our foreign adversaries to produce more oil while pledging to shackle American energy production with needless and harmful regulations.\n\nNothing but America-last policies from this administration.\nhttps://t.co/ANGHZyEBYN","date":"Mon Nov 01 16:55:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I applaud the steps taken by Taiwan and Lithuania—two stalwart defenders of democratic values—to strengthen their ties and cooperation in the face of #CCP aggression.\n\nhttps://t.co/xHIr9UJ5l4","date":"Thu Oct 28 18:38:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Left dreams of a society where your children are dependent on the government from birth until death.\n\nRepublicans are championing an opportunity-rich American economy where families are free to flourish.","date":"Thu Oct 28 14:23:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Illegal border apprehensions this fiscal year: 1.7 million —a 314% increase from last year's 400k. \n\nWhen will @POTUS find time to secure our border?","date":"Wed Oct 27 19:20:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am extremely concerned about who is facilitating these caravans and what organizations are possibly involved in drug and human trafficking along the way. \n\n@POTUS, please come to the table to work with Republicans on commonsense border solutions.\nhttps://t.co/Fhny47FChh","date":"Wed Oct 27 19:14:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to support this legislation to protect U.S. officers and employees serving abroad, and ensure that any threats on their lives can and will be brought to justice. \n\nThank you to @JohnCornyn, @ChrisCoons, @RepCuellar, @RepMcCaul and others for leading this initiative.","date":"Wed Oct 27 18:26:00 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In 2011, ICE Special Agent Jaime Zapata was slain by a drug cartel in Mexico. \n\nTragically, his killers escaped the murder convictions they were found guilty for through a loophole in federal law.\n\nToday, Congress closed that loophole. \n\nJustice must be served. https://t.co/DJfeLiAYGX","date":"Wed Oct 27 18:25:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Another example of the Biden Admin's lack of transparency and accountability👇","date":"Wed Oct 27 14:06:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Over 1.7 million illegal immigrants were apprehended crossing the southwest border this year—the highest number ever. \n\nCBP also seized enough fentanyl to kill every person in the U.S. seven times.\n\n@POTUS, @SpeakerPelosi, &amp; @SenSchumer: work with us to secure the border. https://t.co/sPTtDd0r64","date":"Tue Oct 26 20:26:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today is National #DayOfTheDeployed. Now more than ever, we must stand behind our troops and support the families they leave behind.\n\nThank you to the best among us. You are seen and you are appreciated. 🇺🇸 https://t.co/VsBElYcqls","date":"Tue Oct 26 17:38:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Forcing unreliable energy on developing nations only sabotages their efforts to rise out of poverty.\n \nThey deserve to develop their economies. Unreliable renewables such as wind and solar won't get them there—but clean, reliable natural gas will. https://t.co/NIdPk36Vwk","date":"Tue Oct 26 13:31:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"John Oliver accusing law enforcement heroes of not caring about public safety. Disgusting. \nhttps://t.co/ywPQK52ju3","date":"Tue Oct 26 12:59:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden's @FEMA Administrator admits there is a border crisis, yet denies @GovAbbott's request for help.\n\nBorder security is a federal responsibility. Texans should not be left with the check.","date":"Tue Oct 26 12:53:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"CBP has seized enough fentanyl at the border to kill 2.5 billion people (7X the population of the United States).\n\nWake up.","date":"Mon Oct 25 22:15:23 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Unsurprising. @POTUS leaves Texans holding the bag for his self-made #BidenBorderCrisis https://t.co/fCrF3kCOVl","date":"Mon Oct 25 21:08:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden continues to invent new and unfair ways to tax—as if Americans are a never ending piggy bank for his spending programs.","date":"Mon Oct 25 20:45:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The lunacy of the Left is on full display today with Twitter censoring @RepJimBanks—an elected-Representative and Navy Veteran—while the spokesman for the Taliban—a known terrorist organization who celebrate beheadings—maintains an active Twitter account.","date":"Mon Oct 25 18:48:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Congressional Democrats are pushing a natural gas tax that will reduce our GDP by $9 Billion, kill at least 90,000 jobs, and raise energy bills for all Americans.\n\nI'm intro-ing a bill this week exposing the dangerous impacts of this tax.","date":"Mon Oct 25 17:41:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Tell Biden we are coming...\"","date":"Mon Oct 25 13:30:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When will @POTUS acknowledge this crisis and secure the border?","date":"Mon Oct 25 13:06:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Well, @POTUS was right about one thing in his town hall: inflation IS going to be around for quite a while. \n\nIt is HIS polices that are creating this crisis. https://t.co/lN4wD23cmq","date":"Fri Oct 22 17:41:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So proud of these Midlanders!","date":"Fri Oct 22 17:37:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Is someone cutting onions in here?","date":"Fri Oct 22 14:05:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Mr. President, you DO have a near term answer. \n\nSTOP blocking pipelines on US soil and encourage American oil and gas production rather than demonizing the industry and crippling it with needless regulations.\n\nEveryday Americans NEED relief at the pump.","date":"Fri Oct 22 13:46:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden promised that NO Americans would be left behind. Now his admin. is forced to admit that they stranded almost FOUR HUNDRED.","date":"Fri Oct 22 13:35:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Now @POTUS states he believes that police officers and emergency responders should be fired if they don't comply with vaccine mandates &amp; goes on to mock the ideal of freedom.","date":"Fri Oct 22 01:04:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No surprise here... https://t.co/SrladClFSF","date":"Thu Oct 21 18:03:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"First they said it would cost $0... now Democrats are trying to trick Americans into buying their socialist scam by lowering the cost from $3.5 trillion to $2 trillion.\n\nTaxpayer-funded abortions, IRS surveillance, and tax hikes on all Americans are wrong no matter the price tag.","date":"Thu Oct 21 15:15:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Americans families are already feeling the pain and paying the price for the #BidenEnergyCrisis.\n\nI am urging my Democrat colleagues and @POTUS to reverse course on their anti-American energy crusade and stand WITH the industry that fuels our Nation. https://t.co/7ZHm4k3Ho2","date":"Wed Oct 20 22:07:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Please come to the southern border where illegal crossings have reached all time highs. The security of our Nation should be at the core of your agenda.\n\nSee you soon, @POTUS?","date":"Wed Oct 20 21:04:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We are scarily close to 2 million illegal crossing arrests on our southern border. When will @POTUS pay attention to this tragedy? https://t.co/lWzoTN9fol","date":"Wed Oct 20 20:53:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@MatureAmericans Thank you for having me on!","date":"Wed Oct 20 20:51:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🇺🇸DRILL USA🇺🇸\nMidland &gt; Moscow\nPermian &gt; Putin\nOdessa &gt; OPEC","date":"Wed Oct 20 20:40:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of unleashing American producers in the Permian Basin who are more than capable of fueling our Nation, our president is begging our foreign adversaries to produce more oil &amp; gas.","date":"Wed Oct 20 20:37:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Businesses shouldn’t have to compete with Uncle Sam for labor.","date":"Wed Oct 20 19:20:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepCuellar @JohnCornyn @tedcruz Proud to work with you!","date":"Wed Oct 20 16:44:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Joined by Texans: @JohnCornyn @SenTedCruz @RepCuellar @RepMcCaul @michaelcburgess @TXRandy14 @RepRWilliams @RepBrianBabin @RepGonzalez @RepArrington @RepCloudTX @RepDanCrenshaw @RepVanTaylor @Lancegooden @RepRonnyJackson @RepTonyGonzales @RepBethVanDuyne @RepEllzey @PeteSessions","date":"Tue Oct 19 21:32:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨Mexico is violating the USMCA and taking advantage of Texas in the process.\n\nProud to lead a bipartisan, bicameral letter to the recently-appointed @USAmbMex urging him to hold Mexico's feet-to-the-fire in ensuring fair trade for our agriculture and energy producers in Texas. https://t.co/XV7MJVZmE5","date":"Tue Oct 19 21:32:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The return of the Permian Basin Oil Show is another indicator of the resilience of our community.\n\nThank you to every person in the Permian Basin who is tirelessly working to fuel our country and the world—&amp; happy Oil Show!\n\nhttps://t.co/2uu5AfUCfZ","date":"Tue Oct 19 16:08:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Combing through the bank statements of Americans is a gross invasion of privacy, a security risk, and a blatant abuse of power. \n\n@HouseGOP is saying NO. \nhttps://t.co/sfc6ZVmVEd","date":"Tue Oct 19 15:42:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS wants to become the first president EVER to mandate taxpayer-funded abortions, so it's no surprise that his @TheJusticeDept is asking the Supreme Court to block our life-saving abortion ban in Texas. \nhttps://t.co/LTNsJdVHGO","date":"Mon Oct 18 22:11:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of calling our foreign adversaries to produce more oil, @POTUS must unleash AMERICAN oil &amp; gas producers in West Texas.\n\nMidland &gt; Moscow \nOdessa &gt; OPEC\nPermian &gt; Putin","date":"Mon Oct 18 21:02:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The White House is claiming that @POTUS $3.5 Trillion \"Build Back Better\" agenda will cost $0. \n\nDo you agree with President Biden's math?\nhttps://t.co/J3t4jpad0h","date":"Mon Oct 18 20:28:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"1. Free college for illegal immigrants\n2. Higher taxes\n3. Taxpayer-funded abortions \n\nEven one would be enough reason to vote against @POTUS' $3.5T agenda. \n\nTragically, these are only 3 of the 40+ radical initiatives. \n\nhttps://t.co/lxLfleojKm","date":"Mon Oct 18 20:03:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Camille and I are sending our deepest condolences to the family of Colin Powell—U.S. Army General and former Secretary of State—who dedicated his life to the service of our Nation. God bless him and his family.","date":"Mon Oct 18 15:09:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“Trillion of dollars in spending are on the line. Big Tech is now doing its part to protect the Green New Deal and radical green ideology from dissenting views.”\n\nhttps://t.co/V4gGUNq4lG","date":"Fri Oct 15 19:20:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"1 trillion\n2 trillion\n3.5 trillion\n10 trillion\n\nIt's not about the topline number, it's about the radical policies within.","date":"Fri Oct 15 17:50:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Heating bills are forecasted to be 54% HIGHER in 2021.\n\nIt may stay warm and cozy in the @WhiteHouse, but middle class Americans will be forced to think twice before turning the heat on this winter.  https://t.co/ZLsUvffaqu","date":"Thu Oct 14 16:59:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So awesome to see Captain Kirk go up to space and back from West Texas!🖖@WilliamShatner","date":"Wed Oct 13 15:00:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy #NationalFarmersDay to all of the farmers in #TX11 who feed and clothe our Nation!","date":"Tue Oct 12 23:26:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Just three of the COUNTLESS socialist policies in @POTUS' reckless tax-and-spend agenda: https://t.co/xufNavSsYT","date":"Tue Oct 12 22:20:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SpeakerPelosi just confirmed that Democrats are moving forward with @POTUS' plan to give the IRS the power to spy on our bank accounts and track every transaction over $600.\n\nI am supporting legislation to BLOCK this radical proposal.\n\nhttps://t.co/vYCGnjoBSa","date":"Tue Oct 12 19:52:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Fundamental changes that will destroy millions of oil &amp; gas jobs and decimate American energy security so we can enjoy record high utility bills like Europe?","date":"Tue Oct 12 18:57:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is an unprecedented expansion of government surveillance that will turn our community banks into an arm of the IRS.","date":"Tue Oct 12 18:13:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of calling Saudi Arabia and Russia to produce more oil, @POTUS and @WhiteHouse should call on producers in the Permian Basin and shale patch who are more than capable of supplying our Nation with the affordable, reliable energy we need to flourish.","date":"Tue Oct 12 16:02:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden’s Columbus Day Proclamation spends more time condemning America than celebrating the brave voyage that led to the creation of our great Nation. \n\nNo country has done more good for the world and asked so little in return than the USA. Happy #COLUMBUSDay 🇺🇸 https://t.co/5zbwJY8WzV","date":"Mon Oct 11 17:26:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today we celebrate the brave voyage that led to the creation of the greatest Nation the world has ever known. \n\nNo country has done more good for the world and asked so little in return than the USA.\n\nHappy #COLUMBUSDay! 🇺🇸","date":"Mon Oct 11 16:50:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨President Biden’s @DHSgov is TERMINATING all border wall construction in Laredo and the RGV—areas that are being ravaged by the #BidenBorderCrisis https://t.co/ITPXBTFEbB","date":"Sat Oct 09 13:18:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is handing Vladimir Putin a weapon of influence over our Eastern European allies with Nord Stream II.  https://t.co/z92SXjsNpV","date":"Thu Oct 07 21:52:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Every American family is feeling the consequences of Biden's inflation tax. https://t.co/KABsXQavKz","date":"Thu Oct 07 20:59:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Just this week, @SecMayorkas discussed the potential of 350,000 to 400,000 illegal border crossings in October if Title-42 restrictions are lifted. \n\nThat's almost the total number we saw in the entire YEAR of 2020.\n\n@HomelandGOP is demanding solutions:\nhttps://t.co/pJQ2ar5elu","date":"Thu Oct 07 13:41:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Tragic. Biden’s politically-driven decision to leave Bagram Air Base resulted in the release of the suicide bomber who killed 13 American heroes. \n\nThe American people deserve answers.\nhttps://t.co/li3sApRgh1","date":"Wed Oct 06 17:48:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"On of the *many* egregious policies in the Biden tax and spend package is this expansion of government surveillance.\n\nDo you trust the IRS with your family’s personal data? Give me a break.","date":"Tue Oct 05 19:48:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"• And lastly, this tax-and-spend agenda will only pile onto our already unsustainable national debt. Our current national debt is roughly 220K per household…it’s time we put ourselves back on a path of fiscal sanity.","date":"Tue Oct 05 16:20:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"• A new Death Tax that will destroy generational farming — a cornerstone of our communities.\n\n• Trillions in crippling tax hikes on America’s Main Street business and entrepreneurs. As we recover from COVID, new taxes increases are the LAST THING our small businesses need.","date":"Tue Oct 05 16:20:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"• A new natural gas tax that will touch nearly every portion of the U.S. economy—raising your family’s energy bills and harming our producers in the Permian Basin. \n\n• IRS overreach – Democrats propose weaponizing the IRS to spy on the bank accounts of millions of Americans.","date":"Tue Oct 05 16:20:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"• Billions to GND initiatives, including a Civilian Climate Corps, a new “green bank” slush fund, and tax credits for colleges teaching environmental justice.\n\n• $200 million for @SpeakerPelosi's Presidio Park in San Francisco, CA.","date":"Tue Oct 05 16:20:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"• Corporate welfare giveaways for unreliable energy sources. The current energy crisis in Europe further underscores our need for reliable and affordable energy.\n\n• Tax credits for e-bikes. Yes, you read that correctly.\n\n• 50K-per-year tax credit to pay journalists' salaries.","date":"Tue Oct 05 16:20:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I want to focus on a FEW of the harmful provisions Democrats want to enact:\n\n• Expanded subsides for electrical vehicle purchases for America's wealthiest individuals. A family making up to $800,000 annually could purchase two EVs and receive 25k in tax credits.","date":"Tue Oct 05 16:20:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"While the “topline number” may change, most of the harmful, socialist policies included in the package won’t. Once a federal program exists, it rarely ever goes away. Want to live forever? Become an “expiring” tax credit (i.e. wind and solar credits).","date":"Tue Oct 05 16:20:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"THREAD: There has been a lot of talk about negotiating the topline number in the $3.5 Trillion budget reconciliation bill. \n\nAmericans rightfully reject this wasteful spending, but don’t be fooled if Democrats come to a “compromise.”","date":"Tue Oct 05 16:20:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"REMINDER:\n\nIf their latest tax and spending spree is passed, House Democrats will have added $13 TRILLION in new spending since they took control in 2019—almost half of the entire national debt.\n\nLet that sink in.","date":"Mon Oct 04 16:43:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Anyone voting in favor of reconciliation is voting against American energy and against the independence that keeps our national security strong. \nhttps://t.co/zAl2XVrrOE","date":"Fri Oct 01 20:57:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"The $3.5 trillion spending bill includes a piece in which journalists would receive up to $50,000 annually. Any pretense of objectivity would be destroyed once the media is on the federal payroll.\" https://t.co/4MbM6p1ITn","date":"Fri Oct 01 16:53:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨I sent a letter this week demanding the immediate release of LTC Stuart Scheller. \n\n#Scheller—an LTC with over 15 years of service and an excellent record—seems to be confined simply for political messaging and retribution. \n\nHe must be released. https://t.co/k6VV8NZ27j","date":"Fri Oct 01 14:58:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"52** Senators can and should be able to defeat this radical socialist reshaping of our country.","date":"Fri Oct 01 14:48:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@KazUSAFA @AF_Academy @AF_Baseball Proud to represent USAFA - the never quit attitude I learned as a Zoomie was just what we needed last night!","date":"Thu Sep 30 13:35:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Tracy @StoneManning is an extreme nominee who is unfit to lead the Bureau of Land Management. Our farmers, ranchers, and rural communities deserve better. I am urging my Senate colleagues to reject her nomination.","date":"Wed Sep 29 17:16:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So proud to hang the @USAirForce seal in my office! Thank you to the Congressional Liaison office for making the delivery. #GoAirForce! https://t.co/kAvm1i6HAq","date":"Wed Sep 29 16:39:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I agree with @RepKevinBrady. This is ludicrous.","date":"Wed Sep 29 16:05:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Cold. Dark. and Hungry. \n\nThat's where our nation will be if @POTUS and Democrats in Congress get their way.\n\nThe anti-energy policies in this reconciliation bill will destroy our energy industry—causing shortages and price hikes that will harm every working class family. https://t.co/OZIEgoPSk6","date":"Tue Sep 28 15:39:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"While Democrats retain razor-thin majorities in Congress, Americans are not buying what they are selling: higher taxes, lower wages, higher prices, further government control, and less economic growth.\" \n\nRead the rest of my op-ed HERE:\nhttps://t.co/97JKu5wadY","date":"Mon Sep 27 20:31:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Coming to an American city near you thanks to @POTUS' radical energy agenda. https://t.co/jw58SDlVHQ","date":"Mon Sep 27 20:23:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This was @SpeakerPelosi's reaction when Democrats passed their egregious abortion bill that would allow elective abortions up until birth. https://t.co/h0fqmFsQBL","date":"Fri Sep 24 16:10:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepHaleyStevens Keep up the good work Representative! #FreePaulWhelan &amp; #FreeTrevorReed","date":"Fri Sep 24 12:05:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Joe Biden left HUNDREDS of Americans, not to mention countless Afghan allies, in the hands of THIS terrorist regime who is vowing to perform public executions and amputations.\n\nAre we still \"judging them by their actions\" @POTUS?","date":"Thu Sep 23 18:45:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Joe Biden says the Taliban is \"going through sort of an existential crisis about do they want to be recognized ... as being a legitimate government.\"\n\nGrowing terrorists and holding gruesome public executions doesn't sound like they have any interest in your legitimacy, @POTUS.","date":"Thu Sep 23 18:44:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No one cares more or knows better about how to care for our earth than the farmers and ranchers who feed and clothe our nation.\n\nThese fine folks don't need the federal government breathing needless, harmful regulations down their necks.","date":"Thu Sep 23 18:19:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Our country is now less secure because of President Biden. Where are the Democrats who just two years ago went to the border and cried?","date":"Thu Sep 23 17:09:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Yeah, the horses were definitely the problem—not the 15,000 illegal immigrants bum-rushing the border.\n\nThe Biden Administration is now demonizing its own border patrol agents and taking away yet another tool they desperately need.","date":"Thu Sep 23 16:57:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This week the Democrats have us voting to legalize abortion until birth nationwide.\n\nTheir bill removes nearly all #prolife protections for unborn babies &amp; abolishes state laws preventing late-term pregnancies. \n\nI will always be a voice for the unborn. Vote NO and protect LIFE. https://t.co/eu5RQdp228","date":"Thu Sep 23 16:33:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"On with my good friend @RepTonyGonzales this morning at 8am CT talking Biden’s border disaster in Del Rio. Tune in!","date":"Thu Sep 23 12:33:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I asked DHS @SecMayorkas if the border was more secure under President Biden's leadership. \n\nHe answered: \"It is no less secure than it was previously.\" \n\nThe border is not secure. Over 1.5 MILLION illegal crossings so far in FY2021—up from 458k in 2020. \nhttps://t.co/n6fO7dYTdu","date":"Wed Sep 22 23:47:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Great to see the @TAMU Athletic Director Ross Bjork on Capitol Hill today. Gig em!","date":"Wed Sep 22 21:56:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Saturday: I saw 15,000 Haitians + others bum rush the Del Rio port of entry and set up a shantytown.\n\nToday: DHS @SecMayorkas tells me “the border is secure.” \n\nThey want us to believe their lies and not our own eyes. https://t.co/pDpjVbLMFx","date":"Wed Sep 22 21:02:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, I spoke on the House floor against the Left's $3.5 trillion spending spree that favors green specialist interests over American wages &amp; livelihoods. \n\nI will ALWAYS oppose any measure that results in higher taxes, lower wages, more debt, fewer jobs, &amp; less economic growth. https://t.co/PJwv4PbKmT","date":"Wed Sep 22 21:02:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"American energy = Clean, affordable, &amp; reliable. \n\nTRUTH👇","date":"Wed Sep 22 18:47:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is what Democrats opposed.\n\nCountless Israeli AND Palestinian lives have been saved by the Iron Dome defense system. Their opposition is as immoral as it is radical. https://t.co/ewx6BC9paS","date":"Wed Sep 22 14:33:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"DHS @SecMayorkas: \"The border is secure. The border is closed. If you come illegally you will be sent back.\"\n\nAlso DHS: Releases thousands of migrants into the interior of the U.S. on a \"very, very large scale.\"\n\nhttps://t.co/7mBMJSqoIi","date":"Wed Sep 22 14:28:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Yesterday, Democrats refused to replenish funds for Israel's Iron Dome defense system that has saved countless Israeli and Palestinian lives.\n\nWhy is this party intent on turning their backs on our allies?","date":"Wed Sep 22 14:16:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden ignored our warnings that Putin would use energy as leverage to spread his malign influence. #NordStream2 further increases dependence on Russian gas. We must support the efforts of our allies to diversify their energy supplies.  https://t.co/nO70ATIx9X","date":"Wed Sep 22 13:30:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SecMayorkas used the strongest language I have heard from him thus far to condemn his OWN Border Patrol agents based on unconfirmed photos. \n\nIf he is truly “horrified” like he says, he would tell @POTUS to secure the border once and for all. \nhttps://t.co/Wa0HNhRJ4R","date":"Tue Sep 21 22:28:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Disgraceful.","date":"Tue Sep 21 22:09:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Senior DHS officials told me today that the border is \"secure\"—just days after I personally saw 15,000 migrants in Del Rio, TX crossing freely into the United States from Mexico.\n\nThe Biden Administration expects the American people to not believe our own eyes.","date":"Tue Sep 21 22:06:50 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am proud to join with @RepJohnKatko and @HomelandGOP to offer a comprehensive border security solutions bill.\n\nI urge my Democrat colleagues to stop playing political games with our national security. We must return to policies that work and stand for border security.","date":"Tue Sep 21 21:05:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I spent Saturday in Del Rio, TX.\n\nI saw nearly 15,000 migrants sweltering in a shantytown in 100-degree heat after crossing illegally. You cannot fathom how horrific and unsanitary the conditions are.\n\nMeanwhile rape, assault, crime, and drugs run rampant when the lights go out. https://t.co/f6vrnytOcO","date":"Tue Sep 21 21:05:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats don't support the Iron Dome anymore. Does that mean they want rockets to hit civilians? This party gets more radical by the day.","date":"Tue Sep 21 17:35:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you @USTradeRep @AmbassadorTai for taking the time to meet with me today and discuss the importance of fair trade to Texas agriculture and energy producers. We must ensure that workers and businesses in #TX11 benefit from the bipartisan success of USMCA!","date":"Tue Sep 21 16:12:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS wants to continue throwing taxpayer dollars at the utopian fantasy of unreliable renewable energy. \n\nWe should be focused on reigning in reckless spending and bolstering reliable energy sources that also reduce emissions--like natural gas. \nhttps://t.co/lDVOBKwVin","date":"Tue Sep 21 16:01:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"According to Jen Psaki, the virus can infect foreign nationals but not migrants who enter the country illegally. How is this \"not the same thing\"?\n\nhttps://t.co/VR56bxWWYd","date":"Mon Sep 20 21:26:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When the Biden Administration put a stop to deportation flights, thousands of Haitians and others waiting in Central America knew it was time to rush our border. Why is @POTUS putting us at risk?   https://t.co/nANpcImx68","date":"Mon Sep 20 18:34:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"400 more CBP agents are being sent to Del Rio and CBP is utilizing flights to repatriate Haitians back to their home country, but based on what’s happening on the ground, this is not nearly enough to tamper the chaotic situation.","date":"Sat Sep 18 22:32:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This crisis has reached a boiling point—Del Rio officials are not equipped to handle nearly 15,000 migrants pouring into their community. What will it take to wake this Administration up to the realities of this crisis? There is a real human cost to Biden’s weak border policies.","date":"Sat Sep 18 22:32:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When I went in up in a helicopter to survey the scene, migrants were literally being pushed over the border. Why is the administration not taking the proper steps to deter this situation?","date":"Sat Sep 18 22:32:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"THREAD: \n\nI spent the day in Del Rio, TX with local and state leaders and law enforcement—what I heard, and what I saw, was devastating. There were nearly 15,000 migrants gathered at the port of entry with hundreds more gathering every hour—up from 12,000 just the day before.","date":"Sat Sep 18 22:32:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Most were military aged males between the ages of 18-35. The majority of migrants were Haitian, but I talked to migrants from 6-7 countries including Cuba, Venezuela, Honduras, and more.","date":"Sat Sep 18 22:32:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This situation is dire. What I heard from CBP agents on the ground in Del Rio, TX is we have not seen the worst of it yet. The time for action is now. @POTUS MUST reinstate President Trump's border policies.\n\nhttps://t.co/XZsDo3rKJl","date":"Sat Sep 18 22:17:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, I was Del Rio where there are 14,878 migrants gathered at the port of entry.\n\nThis is an absolute tragedy of a crisis. @POTUS and @VP come see for yourself. https://t.co/zMNvIj3iaq","date":"Sat Sep 18 20:41:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Devastating scenes from Del Rio today.\n\nI’ve talked to local leaders and seasoned law enforcement officers—the number 1 thing I’m hearing is this the worst they have ever seen it. \n\nWhere is the Administration? What is it going to take to get @POTUS and @VP's attention on this? https://t.co/W8sOzZ4rk8","date":"Sat Sep 18 20:33:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Mr. President, there is a real human cost to your border policies. When is this Administration going to wake up and see this crisis for what it is?","date":"Fri Sep 17 14:25:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Good morning! I will be on @MorningsMaria with @MariaBartiromo around 7:10am CT talking Afghanistan and the Biden Border Crisis surge in illegal crossings. Tune in!","date":"Thu Sep 16 10:53:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A year ago today, President Trump negotiated peace in the Middle East through a historic agreement between Israel and her Arab Allies. Now more than ever, the United States must affirm our support for Israel and a prosperous, peaceful region. #AbrahamAccords","date":"Wed Sep 15 22:42:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"https://t.co/oQFHJzrn63","date":"Wed Sep 15 19:58:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidensBorderCrisis rages on.\n \nAugust 2021 showed a 317% INCREASE in border encounters from August 2020. There is complete incompetence coming out of this Administration when it comes to securing our border. When will @POTUS start prioritizing the safety of border communities?","date":"Wed Sep 15 19:58:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Reminder that American citizens are still trapped in Afghanistan where @POTUS abandoned them.\n\nBiden wants you to forget, so Democrats and the media are running interference to bury the story. \n\n@HouseGOP will not forget or relent until every American and ally is safe.","date":"Tue Sep 14 20:06:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"All Americans should be united against terrorism, but today @HomelandDems voted down my amendment to provide a report on the 5000+ prisoners released in Afghanistan and what their affiliation is with terrorism. https://t.co/8LcDhwrhr6","date":"Tue Sep 14 19:19:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’ll be on with @Varneyco momentarily!","date":"Tue Sep 14 15:14:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is what heroes look like. #911Anniversary #NeverForget https://t.co/yhqPljtcWd","date":"Sun Sep 12 02:34:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you #TX11 for the honor to serve.\n\nI had the opportunity to visit the 9/11 memorial in NYC. It was surreal to walk in the footsteps of our fallen heroes on their final day &amp; reflect on those who went on to wear the uniform &amp; fight the battle in their defense. #NeverForget https://t.co/lOhbKFXJnd","date":"Sat Sep 11 19:04:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Friday Night Lights with the Permian Panthers. God bless the USA 🇺🇸 https://t.co/kq5Rgz2dzh","date":"Sat Sep 11 02:00:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"And this is who @SpeakerPelosi put in charge of the budget committee?","date":"Fri Sep 10 15:10:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Veterans and Gold Star family members of the War on Terror deserve a memorial on the National Mall in Washington, DC.\n\nI’m proud to join with the For Country Caucus calling on Congress and @POTUS to pass the Global War on Terrorism Memorial Location Act. https://t.co/2i2vFhp1Fo","date":"Fri Sep 10 13:51:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m going LIVE on the @EveningEdit with @LizMacDonaldFOX on Fox Biz momentarily. Tune in!","date":"Thu Sep 09 22:53:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to the @RiponSociety for highlighting my story. It was an honor to serve in the USAF following 9/11 and an honor to serve in Congress today.","date":"Thu Sep 09 16:05:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Monumental GOP victory against Biden's radical gun control agenda. \n\nRepublicans will continue doing everything in our power to protect the constitutional rights of all Americans.\nhttps://t.co/xe4mve6HvR","date":"Thu Sep 09 15:30:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden handed away all of our leverage to terrorists and left American citizens stranded at the mercy of the Taliban.\n\nThis is the furthest thing from an \"extraordinary success\" @POTUS @SecBlinken \n   \nhttps://t.co/Q0lg5EKDMr","date":"Wed Sep 08 19:06:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"American citizens are waiting on these flights and we have NO secure airport, military personnel, or embassy on the ground to get them out.\n\nJoe Biden gave away all of our leverage. He owns this.","date":"Wed Sep 08 19:00:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Joe Biden left the safety of hundreds of abandoned Americans in #Afghanistan in the hands of Sirajuddin Haqqani—of the FBI's most wanted terrorists.\n\nHe should have never left until every single American and ally was safely rescued.\nhttps://t.co/yTEC3P7m50","date":"Wed Sep 08 18:17:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Next week, I am hosting two Academy Nights in Midland and San Angelo for students interested in attending a military service academy. \n\nI hope to see you there!\nhttps://t.co/E954YRQcaS","date":"Wed Sep 08 13:31:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration hates American oil &amp; gas and refuses to stand up for U.S. liquefied natural gas (LNG).\n\nNow India, one of our most important allies, is looking to invest in Russian LNG instead. Shameful. https://t.co/xrGKAANWZP","date":"Tue Sep 07 17:24:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud of my colleagues in the #TxLege!","date":"Tue Sep 07 16:42:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"To find out more information about applying for a nomination, please visit my website: \n\nhttps://t.co/f9MZYYXYQ4.\n\nAll materials must be submitted by October 8.","date":"Fri Sep 03 16:09:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Nominating young men and women to our nation's esteemed military service academies is one of the greatest honors of serving in Congress.\n\nI challenge each of the incredible young women and men of #TX11 to think about applying for a service academy.\nhttps://t.co/urwcOBx1pA","date":"Fri Sep 03 16:09:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Bad jobs report today. How is the President addressing this? By proposing crippling tax hikes on energy, Ag, and Main Street Businesses.\n\nhttps://t.co/pX5WMknYnx","date":"Fri Sep 03 15:21:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden’s death tax will devastate farm and ranch families who are already struggling through an over-five year farm recession—and the White House is lying about it. \n\nRead the TRUTH from @CongressmanGT 👇🏻","date":"Thu Sep 02 17:43:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Great tribute!  God bless these heroes.🇺🇸","date":"Thu Sep 02 16:14:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #Lithuanian people are bold in their defiant opposition of the #CCP - foes of freedom and democracy.\n\nNow more than ever, it is critical to reassure our most vulnerable allies of the unflinching support and commitment of the United States. https://t.co/kE30T9tali","date":"Thu Sep 02 16:11:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud of Texans and the courage of my colleagues in #TxLege to stand up for life! #prolife  https://t.co/1zOFJxUlH3","date":"Thu Sep 02 15:13:14 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden said he would get every American out—then he left hundreds behind.\n\nA real leader doesn’t knowingly abandon his own citizens behind enemy lines. https://t.co/mPTKyzkorP","date":"Thu Sep 02 14:47:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"You also gave your word that you wouldn't leave until ALL Americans were rescued. Then, you stranded hundreds of Americans behind enemy lines. \n\nForgive me if your word means nothing, @POTUS.","date":"Tue Aug 31 19:56:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's remarks today are patronizing and antagonistic. \n\nYou can't blame a previous administration for this tragic failure of an evacuation while claiming victory for its \"extraordinary success.\"","date":"Tue Aug 31 19:51:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats are doing everything they can to sweep President Biden's tragic Afghanistan evacuation under the rug.\n\nYesterday, Facebook went so far as to delete the account of a Gold Star mother who is mourning the lost of her heroic son. Sickening.\n\nhttps://t.co/8ARpvA0DKK","date":"Tue Aug 31 18:42:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“Hello Mr. President: Save me and my family,\"\n“Don’t forget me here.”\n\nCompletely chilling.\nhttps://t.co/dF0SFO3pZf","date":"Tue Aug 31 18:00:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats just BLOCKED @HouseGOP from introducing legislation on the Floor that would require @POTUS to produce A plan to rescue the Americans he stranded in Afghanistan.\n\nThey’re afraid of the truth getting out: there is NO plan.","date":"Tue Aug 31 15:43:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Unacceptable. There should not be even ONE left behind.","date":"Tue Aug 31 14:03:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Colossal anti-American failure by President Biden.","date":"Tue Aug 31 02:29:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is Joe Biden’s legacy. \n\nUtterly despicable that the leader of the greatest country on earth abandoned our own citizens and allies, surrendering their safety to a terrorist regime.","date":"Mon Aug 30 22:56:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS is trying to blame his reckless, politically-motivated Afghanistan withdrawal on our military. Despicable. \n\n@HouseGOP will not let him. He owns this.","date":"Mon Aug 30 22:03:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"NOW: I’m in a roundtable with @GOPLeader and other veterans of @HouseGOP calling for Congressional action on Afghanistan. Tune in here: https://t.co/l20biLen0s https://t.co/J870n3mQKm","date":"Mon Aug 30 21:38:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’m at this roundtable with @GOPLeader @RepMcCaul and more in DC. Tune in:","date":"Mon Aug 30 21:34:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Despicable. @POTUS just left hundreds of Americans behind.","date":"Mon Aug 30 21:30:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Last plane carrying American troops just departed Kabul.\n\nI cannot imagine the hopeless despair of the hundreds of Americans that President Biden abandoned.\n\nThis is totally antithetical to what our country stands for.","date":"Mon Aug 30 20:54:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Despite bipartisan outcry against his senseless August 31st deadline, President Biden has knowingly abandoned at least 300 American citizens in Afghanistan. \n\nThe gates are closed. Heartbreaking.","date":"Mon Aug 30 18:38:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"God bless these heroes. Praying comfort and peace for their families and loved ones.","date":"Mon Aug 30 17:49:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There are 13 more Gold Star families waking up this week grieving the loss of their hero. Absolutely heartbreaking.\n\nWe are eternally grateful for these thirteen and all of our valiant service members. Gone but never forgotten.\nhttps://t.co/ckPFq9k5j6","date":"Mon Aug 30 14:31:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepStefanik Congratulations!","date":"Mon Aug 30 13:34:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Praying for our neighbors in Louisiana, and all those in the path of Hurricane Ida. Stay safe.  https://t.co/TpJuHsLZ10","date":"Mon Aug 30 01:15:48 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today our Nation is grieving.\n\nTo all Veterans and their families—especially those who served in Afghanistan—know that your sacrifice is not forgotten. \n\nIf you are struggling:\n\nVeteran Crisis Hotline: 800-273-8255 \n\nhttps://t.co/lcEDsMdv20\n\nYou are valued. You are not alone.","date":"Fri Aug 27 02:47:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There will be a time for accountability, but right now, I implore my fellow Americans to come together and show our troops that we support them. Their efforts are not in vain.","date":"Thu Aug 26 20:39:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As a veteran, it is shameful to see the chaos @POTUS has caused in Afghanistan. \nMr. Biden, Americans demand to know your plan to protect lives and prevent further casualties. You must establish dominance by any and all means necessary to ensure the safety of every American life.","date":"Thu Aug 26 20:39:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"At least 10 US service members tragically killed by terrorists outside the Kabul Airport.\n\nFor years, our Nation has asked these brave Americans to run into the line of fire in defense of freedom. Today is a heartbreaking and somber day for all Americans.","date":"Thu Aug 26 18:07:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Praying for our brave American troops, citizens, allies, and all the innocent lives affected.","date":"Thu Aug 26 14:28:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If @POTUS follows through on his decision to cave to the Taliban's August 31st withdrawal deadline, he is signing the death warrants of the thousands of Americans and allies he will be deserting.\n\n@HouseGOP is working to save these lives. Not one person left behind. https://t.co/63TGMHVXOC","date":"Wed Aug 25 18:38:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden’s decision to commit to the Taliban’s dictated August 31st Afghanistan withdrawal deadline means he is signing the death warrants of countless Americans and allies who will be left behind.\n\nhttps://t.co/dqb7kjxtlR @TexasTribune @JohnCornyn","date":"Wed Aug 25 13:42:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Instead of conveying American strength, he has forever tarnished our country's global reputation, legitimized a brutal regime, and left the lives of American citizens in the hands of executioners.","date":"Tue Aug 24 22:02:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It is completely unacceptable that the commander and chief of the greatest military force in the world is allowing a group of terrorist thugs to order the evacuation of our own citizens.","date":"Tue Aug 24 22:02:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden’s decision to commit to the #Taliban’s dictated August 31st Afghanistan withdrawal deadline means he is signing the death warrants of countless Americans and allies who will be left behind.","date":"Tue Aug 24 22:02:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Embarrassing and disrespectful to the thousands of Americans who are trapped in the hands of the Taliban.","date":"Tue Aug 24 21:33:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A great day for Democrats, @SpeakerPelosi? \n\n🚨WATCH for reality: https://t.co/8blvmbEoxE","date":"Tue Aug 24 21:32:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No questions again. No surprise here.","date":"Tue Aug 24 21:16:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Completely clueless and tone deaf.","date":"Tue Aug 24 21:13:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thousands of Americans are TRAPPED in Afghanistan in the hands of executioners and the first thing out of @POTUS' mouth is his \"Build Back Better\" socialist agenda? Really?\n\nThis is not leadership.","date":"Tue Aug 24 21:08:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This may be a \"great day of pride\" for democrats—who are pushing a $3.5 trillion socialist spending spree while abandoning tens of thousands of Americans and our allies to face certain death, but @HouseGOP is focused on our solemn duty to make sure not one is left behind.","date":"Tue Aug 24 19:29:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join @HouseGOP and @SteveScalise in telling the Biden Administration: every single American citizen comes home safely. Point blank.","date":"Tue Aug 24 15:27:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thousands of Americans and Afghan allies are stranded &amp; in jeopardy of being killed by the terrorist Taliban—and what is Nancy Pelosi focused on? \n\nBringing the House back to raise taxes and inflation with $3.5+ trillion in new spending. \n\nRefocus your priorities, @SpeakerPelosi https://t.co/CJVenlIciE","date":"Tue Aug 24 14:48:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Just yesterday President Biden's @PressSec said: \"It's irresponsible to say Americans are stranded. They are not.\"\n\nYes, @POTUS and Psaki—they ARE stranded. And it's all thanks to your administration's reckless and disastrous withdrawal.","date":"Tue Aug 24 14:05:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is unacceptable. America is the greatest country on earth, and President Biden's weak, unplanned withdrawal has us taking orders from terrorists.","date":"Tue Aug 24 13:51:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"We have no intelligence on the ground now ... That is a victory, not only for the Taliban but for Russia, China and Iran because we can't see their activities in the region anymore.\" -@HouseForeignGOP RM @RepMcCaul  https://t.co/7dZvl8G7RM","date":"Tue Aug 24 13:25:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why is @POTUS allowing a brutal regime of executioners to dictate terms of our withdrawal? Completely atrocious.\n\nhttps://t.co/XpGYId220Q","date":"Tue Aug 24 13:18:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS’s stepped-up basis proposal and capital gains tax increase has real consequences for farm and ranch families.\n\nHear it from this South Texas rancher: https://t.co/Rs7eV398JB","date":"Mon Aug 23 22:03:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Don’t be fooled. Democrats' $3.5 trillion “tax and spend\" bill will not help families. \n\nIt is a liberal wish list that will enact Medicare for All and expand government control over how families decide to raise their children.","date":"Mon Aug 23 17:24:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We have the most powerful military in the world capable of bringing home every American and Afghan partner. \n\nThe US and our Commander in Chief should not let the Taliban dictate the terms of safety and security of American citizens in #Afghanistan.\n\nhttps://t.co/EDYFBJDA7Y","date":"Mon Aug 23 17:23:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Why are British troops rescuing an American reporter? \n\nBecause President Biden's administration is bowing to the will of the terrorist-harboring Taliban.\n\nI asked @SecDef on Friday if we should go outside the wires to get Americans and he skirted the question. \nUnacceptable.","date":"Mon Aug 23 16:53:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This administration's lack of transparency and accountability is abhorrent. \n\nUnfortunately nothing new here.","date":"Mon Aug 23 15:45:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Nothing to see here, just Nancy Pelosi calling the US House back in to discuss $5 TRILLION in partisan spending—but no hearings scheduled on the ongoing situation in Afghanistan.\n\nWashington's priorities are backwards.","date":"Mon Aug 23 13:09:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Does Biden's Secretary of Defense really not have enough confidence to go out and get Americans if they need to be rescued?\n\nWe are the United States of America...we don't need permission from the #Taliban to get our citizens.","date":"Fri Aug 20 21:38:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration continues their trend of lack of transparency and failure to secure the safety of American citizens.\n\nWhen I asked @SecDef if he thought we should go outside the wires to get Americans, he skirted the question and said \"it's a dynamic environment.\"","date":"Fri Aug 20 21:38:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If @POTUS's statement was supposed to strike fear in our enemies and reassure the stranded then it's a big miss.","date":"Fri Aug 20 18:21:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"California trying to quietly revert back to affordable, reliable natural gas to avoid blackouts. \n\nhttps://t.co/s6gLakCGrG","date":"Fri Aug 20 17:28:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS claims they \"don't have the resources\" to go past the airport compound to evacuate Americans.\n\nWe have the greatest military in the world—but he doesn't have the political will to allow them to perform their mission.\n\nThis a problem of leadership, not one of resources.","date":"Fri Aug 20 15:50:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Release the full tape. https://t.co/ILV0y0XIn9","date":"Fri Aug 20 15:44:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Heartbreaking consequences of Biden’s botched Afghanistan withdrawal. \n\nIt didn’t have to be like this.","date":"Thu Aug 19 18:03:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you to @CapitolPolice @FBI and @DCPoliceDept + others for being on the frontlines at the US Capitol investigating the ongoing bomb threat. \n\nMy team and I are all safe.\n\nAny and all threats on our Nation’s Capitol and the lives of Americans are despicable and intolerable.","date":"Thu Aug 19 17:52:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is Biden's 'what difference does it make' moment.","date":"Thu Aug 19 15:19:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If you or someone you know is trying to get out of Afghanistan, please contact my office ASAP at 202-225-3605.\n\nWe will do our best to assist and provide you with the most up-to-date information.","date":"Tue Aug 17 19:40:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's botched #Afghanistan withdrawal has left thousands of Americans and Afghan allies stranded at the mercy of the brutal Taliban regime.\n\nThis is a matter of life and death. @POTUS must immediately evacuate American citizens and our loyal Afghan partners. https://t.co/4EiR60yaYb","date":"Tue Aug 17 17:12:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. must provide all necessary resources to assist the Uzbek government and rescue these Afghanis from being subjected to the brutal Taliban regime. \n\nI am working across our govt. to ensure our promises to these brave men and women are kept and protect them from harm’s way.","date":"Tue Aug 17 15:28:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There are nearly 600 Afghan pilots, servicemembers, and their families stranded in Uzbekistan, including family members of #TX11 constituents. \n\nThe Uzbek government is under immense pressure from the Taliban to repatriate these individuals back to Afghanistan to face reprisals.","date":"Tue Aug 17 15:28:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Congratulations to #India on the 75th anniversary of their independence! \n\nOur Nation relies on strong partners around the world like India.\n\nSpecial wishes to all those who are of Indian American heritage in #TX11! https://t.co/1hYFahFepd","date":"Mon Aug 16 05:00:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This was entirely avoidable. \n\nNow, 20 years since the attacks of 9/11 brought us to war to eradicate this harbor for terrorism, we are turning #Afghanistan over to grotesque human rights abusers and America's enemies.\n\n#TheBidenDoctrine: Crisis from Weakness","date":"Sun Aug 15 16:52:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #BidenDoctrine: Crisis from Weakness.","date":"Sun Aug 15 16:43:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #Taliban is a brutal regime full of human rights abusers. \n\nDo you really think they care that the \"world\" is watching their actions, Madam Speaker?\n\nIn reality, the world is watching the heartbreaking consequences of President Biden's weakness.","date":"Sun Aug 15 16:33:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Security is incredibly hard to achieve and extremely easy to lose. \n\nTragically, @POTUS' hasty #Afghanistan withdrawal has made the sacrifices of so many in vain.\n\nGod bless our troops.","date":"Sun Aug 15 16:01:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Remember, @POTUS on July 8: \"The likelihood there’s going to be the Taliban overrunning everything and owning the whole country is highly unlikely.\"\n\nNOW: US Ambassador and flag have left #Kabul.\n\nThis heartbreaking failure could have been avoided.","date":"Sun Aug 15 15:45:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden’s disgraceful retreat in Afghanistan should be a wake up call to every American. Is this president capable of defending American security? Is he capable of defending anything?","date":"Sun Aug 15 15:19:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This failure has led to the abandonment of our Afghan partners who will surely face reprisals for their service at the hands of the brutal Taliban regime.","date":"Sat Aug 14 22:45:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The rapidly deteriorating environment in Afghanistan is heartbreaking. @POTUS’ poor planning and unwillingness to recognize the realities on the ground has created an unmitigated, entirely predictable disaster.","date":"Sat Aug 14 22:45:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“The Biden plan to raise taxes on American energy is misguided and will harm workers and businesses in Texas and across the country. It will raise prices, threaten high-paying manufacturing jobs and further weaken U.S. energy independence.”\n\nhttps://t.co/Woc0jToLyH","date":"Thu Aug 12 19:30:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin knows that terrorists are entering our country because of their open-border policies—and they are burying the numbers.\n\nThe American people deserve to know the truth. \n\nI sent a letter with @RepJohnKatko &amp; @RepClayHiggins to Sec. Mayorkas demanding transparency. https://t.co/b9dQOmeunQ","date":"Thu Aug 12 16:43:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@BrooksLandgraf Incredible. Congratulations Hector! Our Nation is lucky to have you.","date":"Thu Aug 12 16:33:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Apparently President Biden's \"Made in America\" push doesn't apply to American made oil and gas.\n\nWhat about American workers in the Permian Basin? He's sending their jobs overseas to Russia. \n\nhttps://t.co/rh8TXEKLzX","date":"Wed Aug 11 22:54:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"OPEC+ has conspired against US producers to undermine one of our most critical national security tools—energy independence. Now the Biden Admin is asking them to increase production.\n\nWe should be unleashing American energy, not crippling it.\n\nhttps://t.co/AEKRvPQRhx","date":"Wed Aug 11 14:35:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Pleased to see Lithuania strengthening its relationship with Taiwan while standing up to the #CCP’s coercion and bullying. \n\nThe U.S. will continue to support our friends and allies #Lituania &amp; #Taiwan \n\nhttps://t.co/MGbj8DhNIq","date":"Wed Aug 11 01:24:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We won’t forget the 9,000+ who died after Cuomo sent COVID-19 positive patients back into nursing homes. \n\nHe buried the numbers and the MSM covered for him for over a year.","date":"Tue Aug 10 16:29:01 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Kicking off the 2021 West Texas Legislative Summit with my partners in the #txlege — @DrewDarbyTX and @electcharles. \n\nThank you @AngeloChamber for putting together a stellar evening! https://t.co/Qtm9s6PpRB","date":"Thu Aug 05 04:31:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“As of December, 2020, more than 350 new coal-fired power plants were under construction across Asia, including 184 in China, 52 in India, 7 in South Korea and 13 in Japan.” \n\nAnd @POTUS is still trying to destroy America’s energy industry with the #GND. https://t.co/vkCccEsVLn","date":"Wed Aug 04 21:51:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"A report by @HouseForeignGOP sheds light on evidence that COVID-19 originated from the CCP's Wuhan Institute of Virology. \n\nCountless lives were lost at the hands of the virus. We cannot rest until the truth is uncovered and justice is served.\n\nhttps://t.co/rmGfJWGntd","date":"Wed Aug 04 20:31:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidensBorderCrisis continues to rage out of control.\n\nCBP stopped over 210,000 migrants in July—a 21-year high—along with a new all-time high of 19,000 unaccompanied minors. \n\nThese numbers completely eclipse @VP's claims of \"progress\" at the border.\n\nhttps://t.co/NRWkoFXgbI","date":"Wed Aug 04 19:09:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join @RepFeenstra and 80+ of my Republican colleagues in opposing capping #LikeKindExchange, which would harm rural Americans and burden our farmers.\n\nWe should be expanding opportunities in rural America, not making it harder to produce the food &amp; fiber the U.S. needs.","date":"Tue Aug 03 20:37:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#ResignCuomo","date":"Tue Aug 03 17:22:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Looking forward to a great event kicking off tonight!","date":"Tue Aug 03 17:04:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"HAPPENING NOW: I'm in Austin with @RepJohnKatko @RepMcCaul @RepRWilliams @RepChipRoy to discuss skyrocketing crime and the toll that the Democrats' defund the police movement is having on our local PD's.","date":"Tue Aug 03 16:15:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Andrew Cuomo sent COVID-19 positive elderly New Yorkers back into nursing homes and buried the numbers. Now, multiple sexual abuse allegations are confirmed. Lives were destroyed under his tenure &amp; the media covered it up while hailing him as a hero. \n\nHe must resign immediately.","date":"Tue Aug 03 16:10:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“I judge the president on two simple criteria; is he making the country more secure and more prosperous? With Joe Biden as president and Nancy Pelosi as speaker, the answer to both is clearly no.” \n\nCheck out the rest of my #RepublicanAddress here:","date":"Mon Aug 02 23:39:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We don’t need any form of government picking winners and losers in energy. We must have an all-of-the-above market based approach.","date":"Mon Aug 02 21:56:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Texan Rancher Brent Smith has sustained $60k worth of damage on his property due to illegal immigrants. He deserves to be paid back. My bill, the #RAPIDAct would do just that.\n\nRead more: https://t.co/U7m3mUxq6W","date":"Mon Aug 02 19:48:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Texas rancher says illegal immigrants have caused $60,000 in property damages on his land: 'We don't have the same rights as other people do.'\"\n\nI introduced the #RAPIDAct to help restore order and justice at the border.\n https://t.co/942EDwfe5a","date":"Mon Aug 02 19:44:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepGonzalez Thank you for your partnership and support on the #RAPIDAct !","date":"Mon Aug 02 19:32:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepTonyGonzales @RepCuellar @RepGonzalez Thanks for your partnership on this critical legislation!","date":"Mon Aug 02 19:26:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Does @POTUS still believe the #bordercrisis isn't contributing to rising COVID cases?","date":"Mon Aug 02 19:10:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The price of the Biden Border Crisis should not be paid by American farmers and ranchers.\n\nhttps://t.co/IqC1iRMdbJ https://t.co/1G5hMNArox","date":"Mon Aug 02 16:58:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #BidenBorderCrisis continues to spiral completely out of control.","date":"Mon Aug 02 15:21:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Farmers and ranchers near the border are enduring livestock loss, crop loss, and damage to fences, physical structures, and more at the hands of trespassing coyotes and illegal migrants. \n\nMy bill, the #RAPIDAct, would reimburse farmers for these damages.\nhttps://t.co/jpVQo7bsDi","date":"Mon Aug 02 02:17:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I judge the President on two criteria: are they making the country more secure, and more prosperous? \n\nWith Joe Biden as president, the answer to both is clearly no.\n\nThank you for the opportunity to deliver this week’s #RepublicanAddress, @GOPLeader!","date":"Sun Aug 01 16:06:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@elizabethwhelan @RepHaleyStevens Thank you Elizabeth! I am proud to fight alongside @RepHaleyStevens and others on behalf of your brother, your family, and the Reed’s. We must bring them home.","date":"Sat Jul 31 15:45:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My legislation reforms the ESA to deliver reasonable, common-sense protections for endangered species while preventing overbearing regulations coming from Washington, DC. \n\nThank you to the @TexasFarmBureau for the feature!\n\nhttps://t.co/WDOs6jPhky","date":"Fri Jul 30 18:25:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today in the Washington heat, we as Congress are turning the heat up on Russia. \n\n@POTUS, we ask that you turn the heat up on Vladimir Putin. Bring pressure and the full weight of the U.S. government to #FreeTrevorReed @RepMcCaul \n\nhttps://t.co/pBXuqClisn","date":"Thu Jul 29 23:15:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Ran into the newest Congressman-elect from Texas @JakeEllzey in the Capitol Rotunda today.\n\nI look forward to serving with him to promote Texas values and stand up for conservative, policies that will help all Americans. \n\nCongratulations, Jake! Let’s get to work. https://t.co/Xb7RlUqWZC","date":"Thu Jul 29 23:11:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My bill, the Natural Gas Export Expansion Act, will allow American oil and gas producers to fill the demand void and lift millions of people out of energy poverty. \n\nRead more: https://t.co/63A2ios0r8","date":"Thu Jul 29 21:57:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"European and Asian liquefied natural gas (LNG) prices are some of the HIGHEST on record. Global LNG demand is set to double in the next 20 years, we must cut the red tape and increase the exports of safe and reliable American LNG to our allies and trade partners.","date":"Thu Jul 29 21:57:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thank you for your support, sir! #FreeTrevorReed #FreePaulWhelan","date":"Thu Jul 29 20:21:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor Reed and Paul Whelan are Americans and Marine Veterans currently being held hostage by the Putin Regime on baseless charges. \n\nProud to hold a bipartisan press conference today with @RepHaleyStevens calling for Vladimir Putin to immediately #FreeTrevorReed #FreePaulWhelan https://t.co/QiQfpyfWKS","date":"Thu Jul 29 17:52:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We cannot secure our border if we continue to allow drugs, narcotics, weapons, and to be smuggled unabated back and forth underground and right under our noses. \n\nWe must seal these tunnels and defend American communities.\n\n@OdessaAmerican  https://t.co/4P2X1Q07MM","date":"Thu Jul 29 13:58:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am thrilled that my bill to seal cross-border tunnels has advanced through the markup process in @HomelandGOP! We cannot secure our border if we continue to allow drugs, narcotics, and weapons to be smuggled unabated right under our noses. We must seal these tunnels. https://t.co/n7kPmKKkdO","date":"Wed Jul 28 18:07:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Honored to host Ambassador of Honduras, Luis Fernando Suazo Barahona, in my office this morning.","date":"Tue Jul 27 20:48:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"GAO recently confirmed that over $1 trillion of unspent #COVID funds are wasting away in government accounts instead of in the hands taxpayers. \n\nEven still, Democrats and @POTUS want to spend trillions more, further accelerating inflation and harming American families. https://t.co/f3NonHw5WO","date":"Tue Jul 27 20:38:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"50,000 WITHOUT a courtdate ... that's 50% of the entire population of my hometown of San Angelo, TX.","date":"Tue Jul 27 20:25:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is a complete disaster. @POTUS and @VP Harris MUST secure our border.","date":"Tue Jul 27 19:12:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today House Democrats will vote to destroy the Hyde Amendment and authorize taxpayer-funded abortions for the first time in history. \n\nRepealing #Hyde is a blatant attack on the sanctity of life. Every unborn child should have the right to life. Nothing is more important.","date":"Tue Jul 27 18:29:46 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy Birthday, Leader @CongressmanGT!","date":"Tue Jul 27 13:05:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Over 6,300 new migrants arrived at the southern border per day in June.\n\nLet that sink in. #BidenBorderCrisis \n\nhttps://t.co/AeIJShH0ZN","date":"Mon Jul 26 21:58:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is exactly why I am introducing legislation to reimburse border farmers and ranchers for the vandalism and damage they are enduring due to the #BidenBorderCrisis. Harrowing stuff. https://t.co/JyKYq0ygey","date":"Fri Jul 23 15:22:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"While I was serving overseas, I saw firsthand the death and destruction that terrorist organizations cause. We must guarantee that foreign terrorist organizations cannot expand their operations and bring the fight to the homeland. \n\n@HomelandGOP @RepMeijer https://t.co/VQCcygLLb1","date":"Thu Jul 22 21:37:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am in the process of introducing a bill to reimburse farmers and ranchers whose land is being ravaged by the illegal immigration crisis.\n\nThe price of the Biden Admin's failure to secure our border should not be paid by farm and ranch families.\n\nhttps://t.co/WRVMFxJR6n","date":"Thu Jul 22 20:52:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Wishing a Happy 98th Birthday to American hero, @SenatorDole!","date":"Thu Jul 22 15:24:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join @RepMariaSalazar and many of my other @HouseGOP colleagues denouncing socialism and standing up for freedom in Cuba! #SOSCuba","date":"Wed Jul 21 19:24:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidenBorderCrisis","date":"Wed Jul 21 18:40:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No surprise here. Pelosi just denied @RepJimBanks &amp; @Jim_Jordan from serving on the January 6 Committee. This will be a partisan effort with its conclusions predetermined. Is the Speaker afraid Jim Banks and Jim Jordan might question her management of the Capitol?","date":"Wed Jul 21 17:37:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats in the Appropriations Committee voted to authorize taxpayer-funded abortions last week by stripping the #HydeAmendment from their HHS appropriations package.\n\nWe must protect LIFE and protect Hyde.\n\nWATCH: https://t.co/8Lmb5AdqTx","date":"Wed Jul 21 15:41:05 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We must stand strong with those most susceptible to the malign influence and coercion of the #Putin regime.","date":"Wed Jul 21 15:13:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin is gagging our ally Ukraine while striking a deal on #NordStream2.\n\nThis toothless attempt to appease #Putin at the expense of #Ukraine and other strategic partners and allies only emboldens our adversaries and undermines American resolve. \nhttps://t.co/BE8GQXVqm0","date":"Wed Jul 21 15:13:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The misaligned defense budget proposed by the Biden Admin fails to perform its purpose—defending Americans.\n\n@POTUS is pursuing radical green policies instead of addressing the growing threat of the CCP &amp; Russia. This puts Americans at risk.\n\nhttps://t.co/DACYMRyyLn","date":"Wed Jul 21 14:31:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Cubans have had enough. They are showing us in real-time that socialist government takeovers don't work.\n\n@POTUS must take decisive action to bolster the pro-democracy movement and support the brave #Cubans fighting in their own streets for liberty. @RepMariaSalazar @RepMarkGreen https://t.co/QzAMpTPd1B","date":"Tue Jul 20 19:44:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"900% increase in COVID positivity rates and the Biden Admin still wants to END Title 42 this month? \n\nDangerous.","date":"Tue Jul 20 18:08:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No, @speakerpelosi. Passing #HR1 isn't like the heroic ice-covered river crossing in miserable conditions that led to the founding of our Nation. \n\nIt's a power grab that will fund your campaign ads with taxpayer dollars and outlaw voter ID requirements.","date":"Tue Jul 20 16:35:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats are turning their backs on the DHS, ICE, and CBP agents protecting our border and Nation by calling to defund their departments.\n\n@HouseGOP is grateful for the sacrifice these officers make every day, and will keep working to fully support them.\n\nhttps://t.co/FjqO5fzFGF","date":"Tue Jul 20 13:48:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"#BidenBorderCrisis","date":"Mon Jul 19 19:43:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Need help with a federal agency? Stop by one of my mobile office hours this week for assistance with VA, Social Security, IRS, and more.\n\nVisit https://t.co/U3gdDFVMaS for location information. https://t.co/EkESTjmaP5","date":"Mon Jul 19 18:52:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Complete and utter chaos. Yet @VP @POTUS and @SecMayorkas still deny this crisis.","date":"Mon Jul 19 17:31:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"No.","date":"Mon Jul 19 16:53:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Mass illegal immigration courtesy of the Biden Administration's dangerous policies and open-border rhetoric.\n\nWe must secure our border. @HomelandGOP","date":"Mon Jul 19 15:12:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There have been over 1 MILLION illegal crossings along the southwest border this fiscal year – up 362% from\nthe same time frame last year.\n\nThe last time CBP made more than 1 million arrests in a single year was in 2006.\n\n#BidenBorderCrisis @HomelandGOP","date":"Mon Jul 19 14:45:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Enough is enough. Trevor is innocent. His imprisonment is a sham, and this transfer to a prison camp is completely heartbreaking. \n\nI am calling on Vladimir Putin to immediately end this political game and return Trevor to his family once and for all. #FreeTrevorReed","date":"Sat Jul 17 01:00:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Illegal border crossing encounters:\n\nJune 2018 -&gt; 43,189\nJune 2020 -&gt; 33,000\nJune 2021 -&gt; Nearly 190,000 (!)\n\nThese aren't \"seasonal\" upticks @POTUS &amp; @VP. Your terrible policies and abdication of duty to secure our border are to blame. #BidenBorderCrisis\n https://t.co/c9ZpMVGPhz","date":"Wed Jul 14 18:22:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So, mass illegal immigration across our southern border is welcomed with open arms but #Cuban victims of communism who are starving to death are turned away?\n\nhttps://t.co/zvFO0gCCYg @realDailyWire https://t.co/em8DdQk67S","date":"Wed Jul 14 14:34:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"👇👇👇","date":"Tue Jul 13 19:29:23 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The obstructionist TX Democrats are abandoning their responsibility to the voters and preventing the people’s work from being done in Austin. We don't elect state reps to flee on private jets &amp; preen for the liberal news media in DC. People should see this stunt for what it is.","date":"Tue Jul 13 19:27:14 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My new bill reforms the ESA to deliver reasonable, common-sense protections for endangered species while preventing overbearing regulations from Washington, DC. \n\nWe can protect important species without devastating our local and rural economies. \n\nMORE:\nhttps://t.co/4j2TNPa6tH https://t.co/Pke2rldhuU","date":"Tue Jul 13 15:28:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The United States must stand with the brave Cubans protesting for freedom, and against the brutal and corrupt communist regime that has inflicted devastation and suffering on the Cuban people for decades. #PatriaYVida","date":"Mon Jul 12 15:33:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"First six months in Congress ✅\n\nIt's an immense honor to serve the honest, hard-working folks of #TX11. \n\nRead through to see some of what we've been up to: https://t.co/xfPzktHvjg https://t.co/DQhCYbXcw6","date":"Fri Jul 09 14:47:51 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin is scrambling to find a bogeyman to blame for their self-made border catastrophe. \n\nFirst they claim that there is no border crisis, now it's just a \"COVID problem.\"\n\nIt is a humanitarian crisis, and @POTUS's terrible policies are to blame.","date":"Thu Jul 08 15:17:14 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepHagedorn Praying for you Jim!","date":"Thu Jul 08 11:10:09 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Small businesses and local contractors are often excluded from competing for MilCon projects. \n\nProud to join @RepAndyKimNJ, @RepGaramendi, and @DonaldNorcross in this initiative to increase transparency and prioritize local community hiring.","date":"Fri Jul 02 13:50:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We need to ship more made-in-Texas goods. #USMCA plays a big role in that. \n\nHappy one year anniversary to USMCA implementation!","date":"Thu Jul 01 19:13:32 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It took former President Trump, a private citizen, announcing a trip to the border for the sitting Vice President and “border czar” to even stop over in El Paso on her layover. \n\nComing up NOW on @FoxBusiness with @Varneyco to discuss my trip to the real border with Trump. https://t.co/YgqCRHWzxP","date":"Thu Jul 01 15:32:50 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"At the epicenter of the border crisis with President Trump 🇺🇸\n\nThank you to @RepJimBanks and @RepublicanStudy for assembling the largest congressional delegation ever at the southern border. https://t.co/toTMbVuV1c","date":"Wed Jun 30 21:18:50 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Camille and I are offering our sincere condolences to the family and friends of Defense Secretary Donald Rumsfeld, who passed away after a life well lived and over 60 years in service to our country. Thank you, Secretary. Rest in peace.","date":"Wed Jun 30 20:54:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden inherited the strongest, most secure border in years from President Trump. Within a matter of months his administration has created a chaotic border crisis of epic proportions.\n\n@POTUS, reinstate President Trump’s policies and SECURE OUR BORDER🇺🇸 https://t.co/9FPYDOpYAY","date":"Wed Jun 30 19:44:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Human women and children tagged by traffickers like livestock animals. Heartbreaking. \n\n#BidenBorderCrisis","date":"Wed Jun 30 16:33:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"📍McAllen, TX—Epicenter of the #BidenBorderCrisis \n\nIn my hand are bracelets cartels and coyotes use to identify and indenture the children they are trafficking to our Southern border. This a complete tragedy. \n\nWATCH: https://t.co/X86hmaEzCN","date":"Wed Jun 30 15:55:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Impossible to deny the heartbreaking reality of the #BidenBorderCrisis when these are the faces making the dangerous months-long trip to our southern border.","date":"Wed Jun 30 15:19:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Heartbreaking, but necessary, to witness some of the atrocities of human smuggling happening on our southern border.","date":"Wed Jun 30 14:05:36 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today’s vote is a clear condemnation of the Putin Regime for Trevor's corrupt conviction and detainment. \n\nI will not stop fighting for Trevor until he is back safely on American soil. The Putin regime must immediately release Trevor and reunite him with his loving family.","date":"Tue Jun 29 18:44:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Incredibly humbled that my first bill to pass the House is a resolution calling for the immediate release of #TrevorReed, a Marine Veteran who is being held as a political prisoner in Russia.\n\nWe will not tolerate Putin using Americans as political pawns. @freetrevorreed","date":"Tue Jun 29 18:44:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"2021 Dems 👉 \"Republicans want to defund the police.\"\n2020 Dems 👇","date":"Tue Jun 29 14:37:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is what @VP Harris doesn't want you to see.\n\nI'm heading down to the RGV with President Trump, @GovAbbott, and @RepublicanStudy to shine light on the actual crisis.","date":"Tue Jun 29 14:30:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"\"Cartels and transnational criminal organizations (TCOs) will stop at nothing to cash in on their drug trade. They are utilizing complex, advanced tunnel systems to smuggle mass-amounts of illicit drugs into the country, which eventually end up in our communities.\"-@RepJohnKatko","date":"Mon Jun 28 23:12:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Did you know that @CBP is aware of hundreds of underground tunnels used to smuggle copious amounts of narcotics, weapons, and cash back + forth across our southern border? \n\nI intro'd a bill to finally give CBP the resources to seal them.\n\nRead more:\nhttps://t.co/cNs7tgwgVl","date":"Mon Jun 28 23:07:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin's proposed rules will be disastrous for rural America. Proud to join @HouseAgGOP standing up for farm families.","date":"Mon Jun 28 22:52:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Woke companies like Nike have no problem chastising America while turning a blind eye to the horrific genocide of Uyghur Muslims by the Chinese Communist Party. We must hold China accountable for their human rights abuses. Full stop. https://t.co/Ui27XRJh8M","date":"Mon Jun 28 21:43:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today the House is voting on my resolution, #HRes186, calling for the immediate release of Marine Veteran Trevor Reed who stands to endure a decade of his life in a Russian prison.\n\nWe must reunite him with his loving family. @FreeTrevorReed","date":"Mon Jun 28 18:28:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"96 days after being appointed Border Czar, @VP Harris has still not visited the actual border. #BidenBorderCrisis","date":"Mon Jun 28 13:27:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Reality check: @VP said a border trip would merely be a \"grand gesture\" only weeks ago.","date":"Fri Jun 25 16:39:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I'm behind you all the way @RepArmstrongND","date":"Fri Jun 25 14:59:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Coming up momentarily on @FoxBusiness with @LizMacDonaldFOX. Tune in! https://t.co/sCYqqNc74b","date":"Thu Jun 24 22:00:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to support @GovAbbott's efforts to protect #2A rights with @RepChipRoy and other Texans💪","date":"Thu Jun 24 20:01:35 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In high school, Erik won academic honors and was a fierce competitor in FFA events, all while learning English via a Second Language program. He graduated from De Leon High School in 2017 as a top student with honors. \n(2/3)","date":"Thu Jun 24 19:38:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This spring, Erik graduated from @TarletonState and received the Outstanding Honor Graduate Award. I am extremely proud and honored to have leaders like Erik Perez in #TX11 who make our district a better place. \n(3/3)","date":"Thu Jun 24 19:38:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today I’d like to recognize an outstanding leader in #TX11, Erik Perez! Erik immigrated to the U.S. as a freshman in high school and immediately enrolled in De Leon high school. He is described as extremely hardworking, polite, honest, and conscientious. \n(1/3) https://t.co/ixOaKHeVvD","date":"Thu Jun 24 19:38:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"They failed to communicate with local leaders and law enforcement officers, burdened our local hospital system with unpaid claims, and most importantly, kept our community in the dark. (2/4)","date":"Thu Jun 24 14:16:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I will continue putting pressure on @POTUS and @VP to face reality and secure our border once and for all. (4/4)","date":"Thu Jun 24 14:16:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Despite the site closure, our district is still bearing the brunt of the #BidenBorderCrisis—with alarming increases in drug and human trafficking, dangerous high-speed chases, increased strain on local law enforcement, and damage to farmland and personal property. (3/4)","date":"Thu Jun 24 14:16:27 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"🚨HHS is finally closing the emergency intake site in Midland next week.\n\nThe Biden Administration has run the facility haphazardly since they first moved in during the dead of night in March. (1/4)","date":"Thu Jun 24 14:16:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am calling for all intelligence into the origins of the #COVID19 virus to be declassified.","date":"Wed Jun 23 22:17:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. should not rely on the #WHO, the same organization that covered for the #CCP in the early days of the pandemic, to deliver answers to the American public about the origins of a virus that wrecked our economy and tragically claimed hundreds of thousands of American lives. https://t.co/0TtWtHI9BO","date":"Wed Jun 23 22:17:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join with @RepChipRoy and others supporting @GovAbbott's efforts to protect the Second Amendment Rights of all Texans.\n\nRead more:\nhttps://t.co/RgWHObyAoZ","date":"Wed Jun 23 22:09:06 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Private industry solutions are leading the way, lowering emissions to the lowest levels in over twenty years. We do NOT need radical Green New Deal fantasies, but rather, sound solutions that are good for our environment, grow our economy, and strengthen national security.","date":"Wed Jun 23 21:36:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My statement on @VP/#BorderCzar Harris finally visiting the southern border nearly 100 days late👇 https://t.co/SCivTlcBXw","date":"Wed Jun 23 21:33:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"It took months of shame from Republicans, Democrats, and even international press to FINALLY get @VP to the border.\n \nIf it took anyone else this long to do their job I guarantee they would be out of one.","date":"Wed Jun 23 17:03:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@VP Harris is finally going to the border after 91 days of Republicans and Democrats alike begging her to see the carnage on our southern border for herself.\n\nThink she will finally acknowledge it as a crisis?","date":"Wed Jun 23 16:37:34 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"She's only 91 days late.","date":"Wed Jun 23 16:31:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration's policies are encouraging children and adults to make the life threatening trip to our southern border, and emboldening the cartels and coyotes who exploit them along the way. https://t.co/YqHapgILDg","date":"Wed Jun 23 13:29:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"If S.1/#HR1 passes, Congressional campaign ads will be subsidized by federal funds. \n\nThe Senate should absolutely reject this ludicrous legislation.","date":"Tue Jun 22 19:41:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@cowdery4613 https://t.co/hYdME8jTZk","date":"Tue Jun 22 17:35:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The federal government should NOT be picking winners and losers. Renewable energy must stand on its own viably and economically.","date":"Tue Jun 22 16:45:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@TexasFarmBureau @RepKevinBrady A very well-deserved honor! 👏@RepKevinBrady","date":"Tue Jun 22 16:39:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"80% of Americans support voter ID requirements. \n\nPass it on.","date":"Tue Jun 22 16:18:31 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In May, more than 40,000 people from nations other than Mexico, Guatemala, Honduras, and El Salvador were encountered crossing the southern border by @CBP—a 320% increase from January.\n\n@VP and @POTUS are opening our borders to the world and threatening our national security.","date":"Tue Jun 22 15:36:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Midland High grad Bryce Hoppel is Olympic bound!","date":"Tue Jun 22 12:52:59 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So we close the border to those looking to enter legally, but open it for illegal immigrants, coyotes, &amp; drug cartels? Where is the logic @POTUS @VP?","date":"Mon Jun 21 20:42:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration has created a crisis of epic proportions on our southern border. \n\nI joined @bennyjohnson on @TheBennyReport discuss. WATCH: https://t.co/WGaK8Pgk6K","date":"Mon Jun 21 19:43:58 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Allowing a transgender weightlifter (who used to compete in men’s events) to compete in the women’s division is completely unfair to the female athletes who have trained and competed their entire lives to earn a shot at the Olympic gold medal. https://t.co/RIPAaILthD","date":"Mon Jun 21 19:32:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@POTUS is permitting Putin to harbor cybercriminals operating indiscriminately within Russia’s border to advance his malign agenda. \n\nI have severe doubts of the effectiveness of handing Putin an “off-limits” list. \nhttps://t.co/lnRePLxqoT","date":"Mon Jun 21 17:06:07 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Every life is precious and worth defending. #ProLife","date":"Mon Jun 21 16:43:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"With over 180k encounters in May alone, you would think @POTUS and @VP would start to take the crisis on our southern border seriously. Instead, they're looking to end all expulsions of illegal family crossings—a move that will only exacerbate the crisis. https://t.co/zVMhRHQInz","date":"Mon Jun 21 16:36:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There were over 180,000 illegal migrant encounters at the southern border in May alone. This is nearly one and a half times the population of Midland, TX—the largest city in my district.\n\n@POTUS and @VP must bring order to our border.","date":"Mon Jun 21 15:44:39 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Voluntary conservation efforts are working—nearly doubling the population of the lesser prairie chicken (LPC) since 2013. Listing the LPC will harm our rural economies and threaten the livelihoods of ag and energy producers.  https://t.co/L2xrwOYOMr","date":"Mon Jun 21 15:22:38 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Admin's proposed rule on the lesser prairie chicken will have negative ramifications for the Permian Basin and rural America. \n\nThanks to @RepWesterman @RepHerrell &amp; @RepNewhouse for helping to protect our critical ag &amp; energy industries:\n\nhttps://t.co/fItcFtRk5t","date":"Thu Jun 17 19:11:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We recently had 2 high-speed chases in #TX11 where over $500k of meth, fentanyl, and cocaine were apprehended.\n\n@POTUS and @VP have abdicated their responsibility to secure the border, causing law enforcement across border states to suffer.\n\n#BidenBorderCrisis @HomelandGOP https://t.co/Tc9DTTRHTW","date":"Thu Jun 17 17:46:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"As usual @DHSgov @SecMayorkas refuses to acknowledge the crisis of epic proportions at our southern border. My district is sick of it. Texas is sick of it. \n\n@POTUS and @VP: secure the border, now. https://t.co/lxyaPBpiYw","date":"Thu Jun 17 17:27:13 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"My statement w/ @GOPLeader: \"Trevor and Paul’s imprisonment has been politically motivated [...] Their loved ones deserve answers, accountability, and most importantly, confidence in the knowledge that they will soon be safely reunited.\"\n\nFull statement: https://t.co/1jiyE3GszG https://t.co/iI1QGRm4gZ","date":"Thu Jun 17 16:09:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepBlakeMoore Congratulations Blake! Awesome news!","date":"Thu Jun 17 14:24:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"An absolute honor to introduce my daughter to @NikkiHaley, a champion for conservative values and inspiration for all women, at today's @RepublicanStudy meeting. https://t.co/6JgLGiG37b","date":"Wed Jun 16 19:02:47 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Great to hear the President confirm, by name, that he discussed Trevor and Paul with Vladimir Putin.","date":"Wed Jun 16 17:32:08 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Pleased to hear @POTUS say he raised the heartbreaking imprisonment of U.S. Marines Paul Whelan and Trevor Reed with Vladimir Putin.\n\nNow let's bring our heroes home.\n@freetrevorreed @freepaulwhelan","date":"Wed Jun 16 17:27:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepMichaelGuest @HomelandGOP Congratulations!","date":"Wed Jun 16 16:24:20 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Biden is meeting face-to-face with Putin right now. \n\nHe must use this opportunity to demand that Trevor Reed and Paul Whelan are freed immediately.\n\n@freetrevorreed @freepaulwhelan \n  https://t.co/3Br7hALn0U","date":"Wed Jun 16 15:10:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@RepYoungKim @HouseForeignGOP Thank you for your support!","date":"Wed Jun 16 14:56:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join @RepRichHudson and others pushing back on the Biden Admin's proposed rule to limit firearms with attached stabilizing braces. \n\nThis rule is an attack on our #2A rights, and specifically discriminates against disabled veterans who rely on these braces. https://t.co/ACelOT3LaF","date":"Wed Jun 16 14:55:55 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden must demand that Vladimir Putin release U.S. Marines Trevor Reed and Paul Whelan during their meeting today.\n\nWe must bring these two heroes home. Now. @freetrevorreed @freepaulwhelan","date":"Wed Jun 16 13:40:23 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@Montel_Williams @RepHaleyStevens @freetrevorreed @freepaulwhelan Thanks Montel! It’s an honor to represent Trevor and fight for the release of both he and Paul Whelan!","date":"Wed Jun 16 01:28:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration must stand up for our ally Israel and the safety of American citizens.","date":"Tue Jun 15 20:46:25 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When @POTUS meets with Putin tomorrow, he must make it clear: the U.S. will not tolerate the politically-motivated arrests of Trevor and Paul or any other American citizen. \n\nTrevor has been detained for 669 days and Paul almost 900. They deserve to come home to their families.","date":"Tue Jun 15 20:14:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today @RepHaleyStevens and I sent a bipartisan, bicameral letter to @POTUS with nearly 50 cosigners, urging him to address the arrest and detention of our constituents Trevor Reed and Paul Whelan, two U.S. Marine Veterans who are being held as political pawns by the Putin Regime. https://t.co/Ufm2SaR9DO","date":"Tue Jun 15 20:14:29 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Migrants from over 160 countries have illegally crossed our border this year.\n\nIn May, over 40k migrants entered from countries other than Mexico, Guatemala, Honduras and El Salvador – up from around 9k in January. \n\nWe must gain a handle on who, and what, is crossing our border.","date":"Tue Jun 15 16:09:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@SpeakerPelosi once said, ‘Show me your budget, show me your values.’ Today, Nancy Pelosi and House Democrats showed us theirs by attempting to sneak a measure establishing $1.5 trillion in discretionary spending into an unrelated bill—preventing Republican input and debate.","date":"Mon Jun 14 22:29:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This move is not only tactless, but breaks the law by violating the 1974 Budget Act. It is apparent that the Democrat party believes the federal government should control every aspect of our lives, and they will destroy transparency and debate in to make their agenda happen.","date":"Mon Jun 14 22:29:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration is bound by law to provide Congress the opportunity to review any nuclear agreement reached with Iran. \n\nI joined @RepMcCaul and others on @HouseForeignGOP in sending a letter to @SecBlinken reminding the Biden Admin that they must answer to Congress. https://t.co/MQhB8fOLHH","date":"Mon Jun 14 22:07:40 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The U.S. Army has been defending America for 246 years—before the official birth of our great Nation. Today we honor the soldiers, past a present, who have donned the @USArmy uniform to fight for freedom. \n\nThank you! #ArmyBday https://t.co/oIJ6fBuEES","date":"Mon Jun 14 16:26:52 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Happy #FlagDay! The red, white, and blue is representative of our core values as a nation: freedom, liberty, and individualism. \n\nToday, we honor the symbolism and our flag and especially those who have fought to protect it. https://t.co/8FRxhjVru0","date":"Mon Jun 14 15:12:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Trevor is a hero, and Vladimir Putin's comments decrying his character are offensive and patently false. Read my statement: https://t.co/6Il1UmMr2a","date":"Mon Jun 14 14:44:42 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This methane rule has already been struck down in federal court, proving democrats will attempt anything to harm the O&amp;G industry. Private industry innovation has already led the U.S. to lower harmful emissions to all-time-lows. We need more innovation, not harmful regulations.","date":"Fri Jun 11 21:46:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration is hell-bent on debilitating the American oil and gas industry with overbearing regulations that will kill energy jobs, cripple output, and make our Nation less safe in the process.","date":"Fri Jun 11 21:46:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":".@Ilhan's track record of hate speech and antisemitic, anti-American statements and conduct make her unfit to be on @HouseForeign. She must be removed immediately. \n\nhttps://t.co/g5rzUd3HXB","date":"Fri Jun 11 21:46:03 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am calling for Representative @IlhanMN to be removed from the Foreign Affairs Committee due to her recent heinous statement comparing the U.S. &amp; Israel to terrorist orgs like Hamas and the Talaban, as well as her track record of hate speech while in Congress. https://t.co/RpBdusIwPL","date":"Fri Jun 11 20:38:11 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Very proud to serve with Rep. Donalds and promote conservative values. This message is spot on.","date":"Fri Jun 11 20:27:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"BREAKING: @POTUS is lifting sanctions on over a dozen former Iranians and energy firms. \n\nThis, combined with handing Russia the #NordStream2 pipeline, signals Biden Admin's willingness to hand American energy independence away to malign foreign powers. \n\nhttps://t.co/yXh6eP0RGe","date":"Thu Jun 10 17:58:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"First @POTUS killed the #KeystoneXL pipeline and its thousands of American jobs, then he paved the way for Russia to build #NordStream2, and now he could be looking to lift sanctions on Iranian oil. \n\nWhy is his admin trying to sabotage American energy? \nhttps://t.co/T7ImAEdDrf","date":"Thu Jun 10 17:07:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@donisewell Do you really think Russia, China, Iran, and Saudi will follow the recommendations of the IEA? \n\nSaudi for one already said the IEA is living in La La Land.\nhttps://t.co/ccn4DnNB0K","date":"Thu Jun 10 15:54:53 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"With American-made energy declining, these malign foreign actors are sure to harness their increase in power to tramp-down the United States, our allies, our freedom, and the way of life we defend. \n\nEnergy security IS national security.","date":"Thu Jun 10 15:10:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Global demand for energy is estimated to skyrocket in the next 10+years. With @POTUS kneecapping American oil and gas production, where will the world turn for energy? Russia, China and Iran. \n\nhttps://t.co/2qyJpll5lY","date":"Thu Jun 10 15:10:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"👏👏👏","date":"Thu Jun 10 14:46:30 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"May 2021 encounters are nearly 8 times higher than May 2020. \n\nThe #BidenBorderCrisis continues to escalate.","date":"Thu Jun 10 14:44:08 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"https://t.co/puCCNnQrg4","date":"Wed Jun 09 16:27:28 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"So @VP, was your 2018 visit to the border when President Trump was in office just a \"grand gesture\" as well?","date":"Wed Jun 09 16:24:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Russia is violating international law by putting the life of Trevor Reed in jeopardy. Trevor is a U.S. Marine being held on laughable charges brought down by a kangaroo court. It is long past time for this to end. Putin must immediately #FreeTrevorReed.","date":"Tue Jun 08 21:20:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“Biden gets in and suddenly the floodgates open. We are scared. This is not the same thing.” -Sandra Carroll of South Texas.\n\nAmericans are scared on their property and in their own homes because of the Biden Admin's dangerous \"open-border\" policies. \nhttps://t.co/JndiZKl1PM","date":"Tue Jun 08 17:33:10 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"When will you depart on your first domestic travel of your presidency to the southern border?\n\nBorder states are suffering, @POTUS. We need to see a “renewed commitment” from you to the communities, law enforcement, and border patrol agents who are suffering under your policies.","date":"Tue Jun 08 15:51:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Can't believe I need to say this, but @VP Harris— the humanitarian crisis is not a joke to laugh at.\n\nAlso, no @VP, you haven't visited the border since President Trump was in office.","date":"Tue Jun 08 15:02:24 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Today, I received confirmation from @SecBlinken that pressure will continue to be applied on the Putin regime to release former U.S. Marine and Texas native Trevor Reed from Russian prison.\n\nWe will not stop until we see justice for Trevor and his family. @freetrevorreed https://t.co/7nypi9eTub","date":"Mon Jun 07 20:56:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We cannot allow our Eastern European allies to be beholden to hostile nations such as Russia for energy. That's exactly what I told @SecBlinken in today's @HouseForeignGOP hearing.\n\nWe must stand for American energy freedom and security. https://t.co/AViOIBX1ln","date":"Mon Jun 07 18:32:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"IEA report: Electric vehicles require 6X more mineral inputs than conventional cars, and onshore wind plants require 9X more minerals than gas-fired plants.\n\nGreen New Deal polices make us beholden to China, who produces over 80% of rare earth minerals.\n\nhttps://t.co/Xt6RqL8VQ5","date":"Mon Jun 07 14:46:57 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Congratulations on your growing family, Chairwoman!","date":"Sat Jun 05 21:41:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The #COVID19 crisis in #India is heartbreaking. \n\nThe US has a responsibility to help our ally. We should immediately send additional vaccines and critical medical supplies.","date":"Sat Jun 05 18:04:41 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I’ll be on @MorningsMaria this morning with @MariaBartiromo on @FoxBusiness at 6:10am TX time. Tune in!","date":"Fri Jun 04 10:39:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I am wholly opposed to @POTUS' exorbitant $6 trillion budget that weakens our hand against China and will harm our economy, small businesses, and rural America. \n\nWe cannot pursue policies that will raise taxes, skyrocket inflation, and lower paychecks for American families.","date":"Fri May 28 18:55:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This week I submitted a letter to @HouseAgDems  @HouseAgGOP advocating on behalf of the farmers and ranchers in #TX11 as the committee begins looking towards the next Farm Bill. \n\nWe must continue to prioritize the needs of our farmers and ranchers who feed and clothe our Nation. https://t.co/t8hJn1e0h0","date":"Fri May 28 16:03:22 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to join my Republican colleagues in calling for a complete and thorough investigation into the origins of the #COVID19 pandemic.  \n\nIf the #CCP is indeed found responsible for the leak and cover up, they must be held accountable for the needless loss of life.","date":"Fri May 28 14:36:00 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Midland's hospital system shouldn't be footing the bill for the Biden border crisis. \n\nI am working to make sure they get paid back in full. \n\nhttps://t.co/zmG0oR1IHV","date":"Fri May 28 02:33:26 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden's HHS owes Midland Memorial Hospital over $200,000, and they so far haven't processed any claims to pay it back.\n\nIt's an outrage that our local hospital is literally paying the price for the #BidenBorderCrisis.\n\nRead more:\nhttps://t.co/EaXld2Qzyp #FoxNews","date":"Thu May 27 21:40:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"American families are literally paying the price for the Biden Administration's failing policies at the gas pump.\nhttps://t.co/WRM599Nj7W","date":"Thu May 27 20:44:45 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"@mikepompeo Happy Anniversary!","date":"Thu May 27 18:30:00 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"We should be promoting production and exporting energy from right here in the Permian Basin to developing nations such as China and India, which will drastically reduce their emissions. \n\nWe cannot allow @POTUS to make our country more dependent on hostile sources for energy.","date":"Thu May 27 17:44:04 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"The Biden Administration continues to place a bullseye on affordable, reliable American energy production while ignoring the fact that #China’s carbon emissions are growing at the fastest rate in the past decade.\nhttps://t.co/03zl7Wydxj","date":"Thu May 27 17:41:14 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"At least 40 illegal immigrant minors have been treated at Midland Memorial Hospital—racking up charges in excess of $200,000. \n\nTo date, the Biden Admin hasn't processed a claim or paid back a single cent. \n\nLocal hospitals are literally paying for the #BidenBorderCrisis","date":"Thu May 27 15:14:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I have already begun knocking down doors to demand that Midland Memorial Hospital is paid back in full.","date":"Thu May 27 15:14:17 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Gross but not surprising: the MSM blaming President Trump for their own malpractice in squashing the #COVID19 lab leak story almost a year ago. https://t.co/Ft5gUjPP6p","date":"Wed May 26 23:23:23 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrats in Congress should immediately join Republicans in our call for an investigation. The American people, and all those around the world who have lost loved ones, deserve answers.","date":"Wed May 26 20:45:16 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President #Trump and @mikepompeo raised concerns of a COVID-19 lab leak in April of 2020, yet social media companies and traditional news outlets censored the story due to their vitriol hate for our former President.","date":"Wed May 26 20:45:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There is mounting evidence that the COVID-19 pandemic, which has tragically claimed millions of lives and wrecked our global economy for over a year, originated in a Chinese lab, and the #Chinese Communist Party (#CCP) covered it up.","date":"Wed May 26 20:45:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"There can be no more denying. The United States must immediately launch our own independent investigation into the origins of the #COVID-19 pandemic. If the #CCP is indeed found responsible for the leak and cover up, they must be held accountable for the needless loss of life.","date":"Wed May 26 20:45:15 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Labor shortages are crippling small businesses in my district and across the U.S. Ending enhanced unemployment benefits nationwide is necessary for economic recovery. \n\nWe have to get back to work. \n\nhttps://t.co/lfzCxehc7s","date":"Wed May 26 18:25:21 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Daniel's Law is named after Daniel Kirwan, whose Down Syndrome caused him to be denied from the transplant list. He later passed away.\n\nThank you @BrooksLandgraf @KSeliger and all who championed this bill across the finish line, especially Daniel's sister, Kathleen Kirwan-Haynie.","date":"Wed May 26 18:09:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Every human life is precious. I am pleased to see @GovAbbott has signed Daniel's Law to ensure that Texans with special needs or disabilities are not discriminated against when applying for organ transplants.\nhttps://t.co/Qr5gAqXD9A","date":"Wed May 26 18:09:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"EVERYONE loses when corporate taxes increase—including Texas critical business owners and homeowners.\n\nhttps://t.co/WPdgv6n9Rz","date":"Wed May 26 17:23:12 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I was honored to join the good people of #TX11 in paying tribute to Sergeant Jones and Deputy Leonard who gave their lives in defense of this community.\n\nI'm proud of the community members who came together in support of our officers and their families.\n\nhttps://t.co/n18GfE8Jcj","date":"Tue May 25 20:13:37 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Before this meeting, Putin should release U.S. Marine Veterans #TrevorReed and #PaulWhelan. @freetrevorreed","date":"Tue May 25 15:24:02 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"“The federal government hasn’t been very transparent – it’s almost embarrassing – all we’re talking about is good communication that will help protect communities and the kids.”\n\nRead the rest of my interview with the OA here:\nhttps://t.co/5YUZENIz5E","date":"Tue May 25 05:07:19 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"📍Coleman, TX — Deep in the heart of #TX11 https://t.co/EAYuaLFWT4","date":"Tue May 25 00:23:43 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"This is @POTUS's America:\n- rising inflation\n- tax hikes \n- higher prices on just about everything. \n#Demflation","date":"Mon May 24 19:46:44 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Thanks to the @RiponSociety for having me and @RepBethVanDuyne on to talk about our priorities as in the TX freshman class.","date":"Mon May 24 18:25:49 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Democrat support for Israel is going down while anti-Semitic violence is going way up. It has never been more important to stand in solidarity with our strongest ally in the middle east and condemn all forms of anti-Semitism and prejudice.\n\nhttps://t.co/ao6PwaFpJ2","date":"Fri May 21 18:47:54 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Incredible shot!","date":"Thu May 20 19:31:18 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"Proud to have been joined by Ross Copeland from @TexasFarmBureau in standing up and advocating for our farm and ranch families! \n\nWATCH: https://t.co/THdqZdsN1N","date":"Thu May 20 19:26:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"In West Texas, no one suffers more from the drought conditions than the farmers and ranchers who work the land. \n\nUnfortunately, instead of providing relief to ag producers, @POTUS is proposing new taxes, including a death tax that that will devastate farm and ranch families.","date":"Thu May 20 19:26:33 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"I cannot fathom how it is in our national interest for @POTUS to cancel the Keystone XL pipeline, which would have brought over ten thousand jobs to American citizens, and help #Russia build Nord Stream 2 instead.\n\nhttps://t.co/KwGmN12xod","date":"Wed May 19 22:24:56 +0000 2021","user_id":"1341120751399809026"},{"handle":"RepPfluger","text":"President Biden is handing #VladimirPutin a direct path to power over the global energy market by loosening sanctions on Russia. https://t.co/Oqygz9WN8M","date":"Wed May 19 21:56:18 +0000 2021","user_id":"1341120751399809026"}]