[{"handle":"RepRoKhanna","text":"Congratulations to the @warriors on their 4th championship in 8 years!","date":"Fri Jun 17 11:48:53 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Thrilled to see Levi Stadium in Santa Clara chosen to host the @FIFAWorldCup in 2026! I look forward to cheering alongside our community in the South Bay.","date":"Fri Jun 17 01:05:47 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Today, San Jose and the Bay Area gathered to honor one of my personal heroes, Secretary Norm Mineta.  \n\nAs described by President Bill Clinton, “Mineta spent a lifetime trying to be a builder, not a breaker. A uniter, not a divider.” He will be deeply missed. https://t.co/RrQwXFdJNJ","date":"Fri Jun 17 00:56:14 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Stealthing is a violation of trust and a dangerous form of sexual assault. \n\n@NormaJTorres, @RepMaloney, and I are working to support survivors and create a path for legal action.","date":"Thu Jun 16 20:44:47 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Putin’s invasion of Ukraine is driving a severe global fertilizer shortage causing food prices to rise. \n\nThe House just passed the Lower Food and Fuel Costs Act, which includes my amendment to help lower costs for farmers and hardworking Americans. https://t.co/W30my0NikA","date":"Thu Jun 16 19:51:12 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"UPDATE: My town hall will be rescheduled for Tuesday, June 21st at 6pm PT / 9pm ET. \n\nRSVP here: https://t.co/IZMMKESzYx","date":"Thu Jun 16 14:48:36 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"In building a multiracial coalition, @unitethepoor is rejecting propaganda from elite, wealthy interests, and opening the door to justice. If there's anything that's going to change this country, it's what they're doing. https://t.co/bypIWHkFD4","date":"Thu Jun 16 12:53:19 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Thanks to @UniteThePoor, @RevDrBarber &amp; @liztheo for leading a powerful discussion about ending poverty and inequality in our country. \n\nLet's pass @RepBarbaraLee &amp; @RepJayapal’s Third Reconstruction resolution to center the needs of 140 million low-income people in our country. https://t.co/jUPwwdtyB4","date":"Thu Jun 16 01:18:40 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"@RepCasten My heart breaks for you and your family. This is a beautiful tribute.","date":"Wed Jun 15 23:57:11 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Why did this country think that shipping jobs offshore was a good economic strategy? It's past time we brought manufacturing and good-paying jobs back to the US. Thanks to @CWAUnion for inviting me to speak today. https://t.co/7BjhMxbUnM","date":"Wed Jun 15 21:00:23 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"A conditions-free photo op with MBS only emboldens this dictator who's behind countless civilian deaths in Yemen &amp; the hacking to death of a Washington Post journalist. \n\nAny meeting should be predicated on bringing the war in Yemen to a close &amp; permanently lifting the blockade.","date":"Wed Jun 15 15:54:14 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"This is exactly why we need to pass the PRO Act. The PRO Act will make it easy to unionize without disinformation and intimidation campaigns targeting vulnerable workers based on their identity.","date":"Tue Jun 14 22:19:39 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Raise the wage and make the ultra-wealthy pay more in taxes.","date":"Tue Jun 14 21:14:24 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Thanks to @PikettyLeMonde for joining me today for a thoughtful conversation with my @USProgressives colleagues on tackling massive wealth inequality through a massive investment in education and a wealth tax.","date":"Tue Jun 14 18:44:38 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"On average, Black student loan borrowers have 50% more debt after graduation than their white peers. \n\nCanceling student debt is a matter of racial and economic justice. It's time, @POTUS.","date":"Tue Jun 14 17:37:24 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Join me on Thursday, June 16th at 6pm PT / 9pm ET for a Facebook Live Town Hall where I'll discuss the latest on gun reform legislation and what Congress can do to lower costs for hardworking Americans. RSVP here: https://t.co/IZMMKFabn7 https://t.co/QiACzx0HW1","date":"Tue Jun 14 00:48:48 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Every worker deserves the opportunity to join a union and organize for a fairer workplace. \n\nGlad to see @Microsoft respecting that right and reaching an agreement with @CWAUnion. Good to see innovative business and labor leaders working together.","date":"Mon Jun 13 23:23:28 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Medicare for All will save lives and cut spending on healthcare by billions every year. It’s good policy and the right thing to do.","date":"Mon Jun 13 20:23:42 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"On the 6th anniversary of the Pulse nightclub shooting in Orlando, we remember the 49 people who were tragically killed. \n\nDuring Pride Month &amp; every month, let's work to protect the rights &amp; safety of LGBTQ+ people across the country. That includes passing meaningful gun reform.","date":"Sun Jun 12 22:07:54 +0000 2022","user_id":"816298918468259841"},{"handle":"RepRoKhanna","text":"Today, we mark Women Veterans Day, an opportunity to celebrate and remember the women who have served to protect America’s national security and founding ideals. Our nation is stronger because of them. https://t.co/gxSGcU3nC9","date":"Sun Jun 12 17:41:54 +0000 2022","user_id":"816298918468259841"}]