[{"handle":"RepRonnyJackson","text":"“Jane’s Revenge” is a TERRORIST organization!! The DOJ should be working overtime to STOP their VIOLENT firebombing spree. We know what the DOJ would do if it were a Conservative group!","date":"Fri Jun 17 15:04:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The House voted on H.R. 7606 today, which will exacerbate fractured supply chains, skyrocketing input costs, and historic levels of inflation, all of which are hammering American consumers. I voted NO! Learn more HERE: https://t.co/XmtIXwipn2","date":"Thu Jun 16 17:12:20 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden has weaponized his administration to PUNISH farmers and ranchers. As a result, the ag industry's input costs are through the roof (fertilizer, fuel, basic parts for equipment, etc.). @CongressmanGT and I will NOT let them get away with this!! @HouseAgGOP https://t.co/fIvxg7e3gG","date":"Wed Jun 15 20:31:09 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"There have been 27 versions of the American flag, but one thing has always stayed the same: it represents the land of the FREE and home of the BRAVE. Today, and every day, I am PROUD to be an American!! #FlagDay2022","date":"Tue Jun 14 20:55:13 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden should be leading the charge to abolish rogue, anti-American organizations like the WHO, not surrendering American sovereignty to people who side with COMMUNIST regimes! Learn more about my new legislation to BLOCK the Global Pandemic Treaty: https://t.co/fbjirc6ECv","date":"Mon Jun 13 23:28:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"“Shall not be infringed.” It’s that simple. #2A","date":"Sun Jun 12 00:13:50 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden is blaming everyone but himself for the economic crisis we’re in. When are we going to see him take responsibility for his actions, which have caused the worst inflation rate in 4 DECADES? Stop deflecting blame and DO SOMETHING, Joe!!","date":"Fri Jun 10 18:16:24 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Gas prices are at a record high, inflation is out of control, our southern border is wide open, but what are the Democrats doing tonight? Hosting a political CIRCUS on January 6th to go after their political opponents! They’re calling it prime time TV, I’m calling it DISGUSTING! https://t.co/hLrVTa4fOY","date":"Thu Jun 09 20:49:26 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I voted against Democrats’ RADICAL gun control agenda. Shredding the constitution and taking away law-abiding citizens’ ability to defend themselves is NOT the answer!! #2A","date":"Thu Jun 09 15:31:07 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Schumer has publicly threatened Kavanaugh. \n\nPelosi won't let the House take up legislation to strengthen Justices' security.\n\nThe White House encouraged the mob to go to Justices' homes.\n\nMAKE NO MISTAKE: Democrats caused this!!\nhttps://t.co/93XLorUHIR","date":"Wed Jun 08 22:00:51 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden knows the solution to skyrocketing gas prices is in our own back yard, he just doesn't care. Liberal Elites are completely out of touch with the American people!","date":"Tue Jun 07 22:07:51 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On the 78th anniversary of #DDay, let us never forget the bravery our troops showed on the beaches of Normandy to defend our liberty. They truly were the GREATEST generation!","date":"Mon Jun 06 20:38:09 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"For too long, rural America has been taken advantage of by the IRS. That stops NOW! Learn more about the Rural IRS Accountability Act that I introduced. ⬇️\n \nhttps://t.co/6djpuLRsXF","date":"Fri Jun 03 00:37:10 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Americans cannot AFFORD Joe Biden’s failed policies. Prices are through the roof for just about everything, and he thinks throwing more money (that we don’t have) at his Socialist agenda is going to solve things. WRONG!","date":"Wed Jun 01 18:15:56 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden is breaking records, but not in a good way. Gas prices are at an all-time high! Depleting our Strategic Petroleum Reserve is wrong and won't fix things, but unleashing American energy production WILL!","date":"Tue May 31 14:27:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This #MemorialDay2022, we pay tribute to those who made the ultimate sacrifice to protect the freedoms we hold dear in this country. We’ll NEVER forget the true cost of freedom!","date":"Mon May 30 19:40:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ALL Texans are grieving with the people of Uvalde tonight. Jane and I are devastated for the families and friends of the innocent children and adults who lost their lives, and we pray God keeps His hand on them during this unimaginable time.","date":"Tue May 24 23:35:28 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Half of Biden's Twitter followers are fake, and those are probably the only followers who believe in Biden's \"Putin Price Hike\" talking point. What a joke!\nhttps://t.co/kE5PeyxOjf","date":"Tue May 24 00:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Life begins at conception!! Period!! #ProLife","date":"Mon May 23 00:30:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"According to new CBP data, there were 234,088 migrant encounters at our southern border in April. That’s the highest in U.S. history for one month. Mark my words, this INVASION is only going to get worse if Democrats get their way and end Title 42.","date":"Sun May 22 00:08:33 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Americans are concerned that Biden will surrender U.S. sovereignty to the WHO. I am tracking this closely, and will do everything in my power to make sure Biden doesn't give them any more authority. Rogue, anti-American organizations like the WHO and UN need to be abolished!","date":"Fri May 20 13:28:33 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m in the presence of HEROES today! I was proud to join my Texas colleagues in welcoming the Anheuser-Busch Honor Flight to Washington. These distinguished veterans came from Texas to see our Nation's Capital. It was an honor to meet them! https://t.co/5JN5jad0GW","date":"Thu May 19 21:23:54 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Applying for a U.S. passport has never been easier! Use this online tool to help you prepare for the application process: https://t.co/NTlU5EdY8Q","date":"Wed May 18 21:40:23 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm supporting a discharge petition to bring the Protection of Women and Girls in Sports Act to the House Floor for a vote. Our daughters and granddaughters shouldn't have to compete against biological men!!","date":"Tue May 17 22:39:17 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Did you know there are more cattle than people in #TX13? We're PROUD to be the Beef Capital of the World! #EatBeef #NationalBeefMonth","date":"Mon May 16 19:08:31 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Inflation is a tax on ALL Americans, and it has increased every month since Joe Biden took office.","date":"Sun May 15 23:24:58 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Make no mistake: Joe Biden doesn't care about his self-made border crisis. \n\nExample: The Biden Administration spent $72 MILLION to STOP border wall construction instead of using those resources to protect Americans from the INVASION going on at our southern border","date":"Sat May 14 22:41:52 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Our BRAVE law enforcement officers put their lives on the line to keep us safe, only to be disrespected by the Radical Left. #TX13 and the @HouseGOP will never turn our back on them! #BackTheBlue #NationalPoliceWeek","date":"Fri May 13 19:32:04 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've joined @RepBlaine and @RepAnnWagner in the fight to make sure YOUR tax dollars aren't funding the CORRUPT Planned Parenthood organization, or research using aborted fetal tissue. We must protect the sanctity of LIFE! Read our full letter: https://t.co/IAzROvU4ut","date":"Fri May 13 15:32:28 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Last time I visited the border, processing facilities were stocked full with formula. Apparently illegals are STILL getting formula from the U.S. government even when we can’t get enough to our own citizens. SICKENING! Biden is Ultra America Last!!","date":"Thu May 12 17:47:59 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My @HouseGOP colleagues and I tried to put an END to Biden’s “Ministry of Truth” last night, but Democrats blocked it. They want to take away your #1A RIGHTS! They want RADICAL Nina Jankowicz (who said Hunter’s laptop was fake) to be the arbiter of truth. God help us!!","date":"Wed May 11 14:47:12 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Retweet if you’re PROUD to be “ultra-MAGA!” I know I am!","date":"Tue May 10 20:39:14 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree → Joe Biden needs a cognitive test!","date":"Mon May 09 22:13:09 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In #TX13, we're SICK of Liberal Elites telling us to go buy expensive electric vehicles to deal with skyrocketing gas prices. We don't need \"Liberal Logic,\" we need Joe Biden to STOP his War on American Energy!","date":"Mon May 09 00:28:39 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden thinks it's funny that Americans are paying more for just about everything under his FAILED leadership. Inflation is a tax on ALL Americans, and it's certainly NOT a joke!","date":"Sun May 08 00:11:14 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The person who leaked Justice Alito's draft opinion MUST be held accountable! The intimidation campaign they've started is WRONG. Any Democrat who doesn't condemn this lawless act has no respect for judicial independence or the rule of law.","date":"Fri May 06 16:07:06 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s great to have @HouseAgGOP Ranking Member @CongressmanGT in #TX13!  We were in Paducah today talking all things ag with my constituents. GT and I are leading the charge to protect rural America in Congress! https://t.co/fHhvJrYkfG","date":"Fri May 06 00:08:53 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"\"One Nation Under GOD.\" \n\nChristian values have long guided our GREAT Nation, and we can never let that change. Say a prayer today and every day for the future of our Republic! #NationalDayofPrayer","date":"Thu May 05 16:44:04 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"There are ONLY two genders.","date":"Thu May 05 01:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We're hopefully on the cusp of a HUGE win for the pro-life movement thanks to President Trump! PRAY for our Supreme Court Justices. May they NEVER give in to mob rule!","date":"Wed May 04 13:13:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This week in a @HASCRepublicans hearing, I spoke with Air Force leadership about the new T-7 Red Hawk advanced trainer aircraft that will be flown at @SheppardAFB. We are fighting to modernize Sheppard, and the message was clear – we can’t get the T-7 fast enough. https://t.co/iddQ1e5qhY","date":"Mon May 02 00:43:36 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The V-22 Osprey built by Bell Helicopter in Amarillo is a game changer. The Navy &amp; Marines told me during a @HASCRepublicans hearing that they need MORE V-22s to support their mission &amp; to upgrade the current fleet! I told them the workforce in Amarillo is up for the challenge! https://t.co/cIgmD3QJTo","date":"Sat Apr 30 20:17:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration’s COMMUNIST “Ministry of Truth” cannot stand! I’m working with my @HouseGOP colleagues to put a STOP to this. Stay tuned!","date":"Sat Apr 30 00:52:13 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration’s foreign policy FAILURES have hurt our allies and emboldened our adversaries. Today I asked Secretary Blinken what he’s doing to clean up the image of WEAKNESS they’ve displayed on the world stage. WATCH: https://t.co/9eDPKlHX3S","date":"Thu Apr 28 20:59:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"COGNITIVE TEST NOW!","date":"Thu Apr 28 17:57:55 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you to my friend and colleague @RepPfluger for his tireless work to bring Trevor Reed home - it would NOT have been possible without him! TX-11 is BLESSED to have such a committed Representative!","date":"Wed Apr 27 20:58:50 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"PRAISE GOD! Trevor Reed, a Texan and Marine Corps veteran, is coming home after being wrongfully imprisoned in Russia since 2019. Please continue praying for Trevor and his family as he recovers both mentally and physically.","date":"Wed Apr 27 15:06:14 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Secretary Mayorkas has allowed #BidensBorderCrisis to rage for too long. He doesn't care about the innocent Americans who are being CRUSHED by this crisis. That's why I'm calling for his impeachment alongside @RepJimBanks and @RepBrianBabin. MAYORKAS MUST GO!","date":"Wed Apr 27 13:11:27 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I fully believe that Coach Kennedy will be vindicated because there is NO situation where the government can restrict an American’s right to choose the time or place of a PRIVATE prayer! I was proud to support Coach Kennedy's case with an amicus brief to the Supreme Court!","date":"Tue Apr 26 14:49:41 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@ApolloMedFlight is doing incredible, lifesaving work to help patients during medical emergencies in Texas and beyond. I’m proud to say they’re headquartered right here in Amarillo! https://t.co/V46LAOqOCp","date":"Mon Apr 25 17:39:24 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Critical Access Hospitals are the backbone of rural healthcare! I want to thank the team at Collingsworth General Hospital for having me out to tour the hospital and for keeping me up to date on issues I can help with in Congress. Rural America won’t be left behind on my watch! https://t.co/CXTKfq3WI3","date":"Sun Apr 24 21:04:18 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Yesterday was a GREAT day for the future of veterinary medicine in West Texas! The Amarillo community, @TexasTech leadership, @GovAbbott, and students came together to celebrate the new @TTUVetMed program. This top-notch program will produce incredible doctors for years to come! https://t.co/SZkMU0RUj6","date":"Sat Apr 23 20:53:38 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Texas ag community is something special and I’m always grateful for their friendship and collaboration!","date":"Sat Apr 23 02:53:24 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today, I hosted an ag roundtable with a very special guest — former Ag Committee Chairman Michael Conaway! We had a great conversation with local farmers and ranchers in #TX13 about the challenges they face and how we can address those challenges in the next Farm Bill. https://t.co/kBUbMMju8j","date":"Sat Apr 23 02:53:23 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you, @MSUTexas, for having me join a trauma simulation with nursing students this morning! I had a lot of fun being back in scrubs and teaching our future frontline heroes. These students have bright futures ahead of them! https://t.co/9nzUlhSAVy","date":"Thu Apr 21 18:31:42 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was a great afternoon in Lubbock with my @WesternCaucus colleagues and the Texas ag community! We toured @TexasTech’s Plant &amp; Soil and Animal &amp; Food Sciences Centers. Our Caucus is PROUD to be the voice for Rural America in Congress! https://t.co/dS4mmbTynR","date":"Wed Apr 20 23:42:24 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Big Tech has another thing coming if they think they won't be held accountable for their violations of our First Amendment rights. SOON! The @HouseGOP will NOT let Big Tech’s unfair censorship practices stand.","date":"Tue Apr 19 23:20:12 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@HASCRepublicans recently received a briefing on Future Vertical Lift. For the Future Long Range Assault Aircraft, SPEED and RANGE need to be the priority!","date":"Tue Apr 19 01:14:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"He is risen! Jane and I wish you all a joyous #Easter2022!","date":"Sun Apr 17 13:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: I recently introduced legislation to BAN taxes, user fees, or other similar charges as a condition for owning a firearm. I'll ALWAYS fight back against any attempt to erode our #2A rights!\nhttps://t.co/ASyegWKwfN","date":"Sat Apr 16 13:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Have a blessed and peaceful #GoodFriday. Jane and I are grateful today and every day that Jesus died for our sins.","date":"Fri Apr 15 16:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was an honor to meet with President Tsai in Taiwan! The U.S. stands proudly with Taiwan and its people —  we must provide Taiwan with the support it needs to defend itself against the Chinese Communist Party.","date":"Fri Apr 15 12:34:06 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Trump was RIGHT!","date":"Fri Apr 15 00:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree → Lessons about sexual orientation and gender identity don’t belong in our kids’ classrooms.","date":"Thu Apr 14 00:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Our southern border will become completely unrecognizable when Title 42 is lifted. We can expect it to be a full-scale invasion. Enough is enough!","date":"Wed Apr 13 00:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"A new study found that Joe Biden’s inflation crisis will now cost the average American household OVER $5,000 this year. Thanks for NOTHING, Joe! #BidenPriceHike","date":"Mon Apr 11 13:00:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It's very revealing to see so many Democrats squirm at the idea of Elon Musk having the ability to promote free speech on Twitter. Why are they so afraid of different viewpoints?","date":"Sat Apr 09 23:30:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@DanScavino &amp; @RealPNavarro are good men who've served our country honorably! Sadly, they are now targets of the ILLEGITIMATE Jan. 6 Committee simply because Democrats don't like their political beliefs. I voted NO on a baseless resolution to attack them in the House last night! https://t.co/kKCXSkhw9G","date":"Thu Apr 07 14:23:44 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The families of our service members undoubtedly serve our country too, especially those who carry the heavy burden of never having their service member come home to them. Today, on Gold Star Spouses Day, we honor them. Our fallen HEROES' legacies live on through YOU!","date":"Tue Apr 05 22:52:50 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#ICYMI: My new pro-Israel legislation would give us a critical tool to combat Iran's plan to annihilate the Jewish State of Israel.\n \nMore from @KAMRLocal4News: https://t.co/gkNlyv6Caq","date":"Tue Apr 05 14:07:28 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden is planning to end President Trump's Title 42 policy, which prevented countless illegals from entering our country. We can fully expect #BidensBorderCrisis to get MUCH WORSE with the end of Title 42, yet he has NO PLAN to address it. Not good!\nhttps://t.co/As8Xqx4Yz3","date":"Mon Apr 04 18:05:12 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden is releasing our strategic oil reserves because of his own FAILED policies.\n \nWhat he should be doing:\n-End freeze on new oil/gas leases\n-Fast-track pending LNG export permits\n-Expedite approval of pipeline development\n-End regulatory assault on U.S. energy/financing","date":"Sun Apr 03 23:04:37 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If we don't stop the Radical Left from enforcing a tax on gun owners in San Jose, California, we'll soon see a push for that tax to be implemented at the federal level. NOT ON MY WATCH!\n \nCheck out @AWRHawkins' latest story on my pro-2A legislation ⬇️","date":"Fri Apr 01 17:31:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm PROUD to be leading this bipartisan effort to protect our friends in Israel from the world’s leading state sponsor of terror and its proxies in the Middle East! We can't afford to ignore the threat posed by Iran-backed proxies like Hamas and Hezbollah. Learn more ⬇️","date":"Thu Mar 31 17:51:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great meeting with @SecAFOfficial this morning to discuss the brand NEW T-7A Red Hawk that’s coming to @SheppardAFB in #TX13! https://t.co/u3s2INcXqo","date":"Thu Mar 31 15:06:56 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On this Vietnam War Veterans Day, we say THANK YOU to the Patriots in #TX13 and around the country for their sacrifice and service! We'll never forget their heroism. We MUST support our veterans as they return home and deal with the heavy toll of war!","date":"Tue Mar 29 20:48:13 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The latest NBC News polling reflects what millions of Americans know to be true: Joe Biden is a WEAK and INEFFECTIVE \"leader.\" It's heartbreaking to see what this FAILURE of a President is doing to our GREAT country.","date":"Tue Mar 29 00:07:48 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden told service members they're going to Ukraine and vocalized support for regime change in Russia. Then the White House had to clean up after him by telling us what he supposedly meant. Apparently the leader of the free world can't speak for himself. Who's REALLY in charge?","date":"Sun Mar 27 19:29:32 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 Students: If you're interested in applying to a U.S. Service Academy I'd encourage you to attend the North TX Service Academies Forum on Saturday, April 9 in Fort Worth! I'm proud to be co-hosting this event with many of my Texas colleagues. DETAILS: https://t.co/SeIWESJnrW","date":"Fri Mar 25 19:24:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Instead of working FOR the American people, Kamala Harris has worked AGAINST us by ignoring her duties as Border Czar. Today, I introduced a resolution calling on Joe Biden to REMOVE her from the role. We need a REAL leader at the helm who will SECURE our southern border!","date":"Thu Mar 24 23:59:20 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Last year, Congress rejected Biden’s proposed cut for defense spending on a BIPARTISAN basis. My @HASCRepublicans colleagues and I are calling on the administration to modernize our military and provide service members with needed resources!","date":"Thu Mar 24 20:54:49 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Six students received official appointments to U.S. Service Academies after I nominated them last year. I'm wishing nothing but the BEST for their bright futures at their respective service academies and beyond! Learn more: https://t.co/larLIL2ztt","date":"Wed Mar 23 17:19:19 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The @TXMilitary Department is doing everything it can to help DEFEND our southern border and PROTECT innocent Americans since the Biden Admin refuses. I was glad to be with them at the border yesterday for an update on their important work! God bless Texas! #OperationLoneStar https://t.co/znZHSnHX63","date":"Wed Mar 23 01:07:20 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The ag producers in #TX13 are a HUGE part of what makes our District GREAT! As the top-rated ag district in Texas, this industry is vital to our economy and national security. #ThankAFarmer on this #NationalAgDay!","date":"Tue Mar 22 17:23:46 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If “Border Czar” Kamala Harris won’t do her job to secure our southern border, it’s time to put someone in the role who will. Stay tuned! Big announcement coming this week. https://t.co/xywkVy2sAE","date":"Tue Mar 22 13:33:21 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As local officials and first responders continue to assess the damage, please join me in praying for those who've been impacted by tornadoes in Jacksboro and Bowie. #TX13","date":"Tue Mar 22 01:04:59 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm at our southern border today to see what our BRAVE @CBP officers are experiencing firsthand. Why won't Biden or Harris come see the realities of their self-made border crisis? What a mess! #BidenBorderCrisis https://t.co/kjtkIRQgi2","date":"Mon Mar 21 21:33:53 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree → Border security IS national security!","date":"Sun Mar 20 23:21:17 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The border crisis is STILL getting worse! Encounters by Border Patrol are up, yet deportations are WAY down. Biden is siding with CRIMINALS over our law enforcement officers. Know that the people of #TX13 stand with you, @CBP and @ICEgov!","date":"Sat Mar 19 23:07:25 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden needs to unleash the FULL power of American energy production! He can start by taking his foot off of Texas oil producers' throats.","date":"Fri Mar 18 18:14:51 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Abortion is NOT health care, it's murder. I'm PROUDLY joining @RepBuddyCarter in defense of innocent, human LIFE!","date":"Thu Mar 17 14:55:29 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Great meeting with a representative from Albers Aerospace today. This veteran owned, cutting edge defense and aerospace company will be right at home in Amarillo! #TX13","date":"Wed Mar 16 23:00:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"GREAT news for #TX13! A transportation bill I cosponsored last year has been signed into law. Texas is a hub for economic opportunity, and the projects that will stem from the Ports-to-Plains Act will ensure that remains the case for years to come! https://t.co/s1IYfvbUUf","date":"Wed Mar 16 17:45:30 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm PROUD to have secured funding for many #TX13 defense priorities last week. Federal resources are on their way to @PantexPlant, @SheppardAFB, and @BellFlight for historic projects that will be completed in OUR district, and they'll keep Americans safe for generations to come!","date":"Wed Mar 16 13:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"American oil over foreign oil, ALWAYS!","date":"Tue Mar 15 13:08:11 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Gas prices are through the roof, and the best the White House can do is blame Americans who can't afford EXPENSIVE electric vehicles. The people of #TX13 are SICK and TIRED of Liberal Elites! They're running our country into the ground.","date":"Mon Mar 14 13:24:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"You know things are bad in the Biden White House when the best \"diplomat\" they could send to meet with our NATO partners in Poland and Romania is Kamala Harris. We're talking about the kind of \"leader\" who thinks the Ukrainian refugee crisis is funny. Lord help us!","date":"Sun Mar 13 18:32:18 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Nurses working to serve our veterans are HEROES. The Biden Administration is telling medical professionals at the Amarillo VA that they will be fired if they don’t comply with the UNCONSTITUTIONAL vaccine mandate. This is an irresponsible and unforgivable move from Biden’s VA!","date":"Sat Mar 12 17:53:46 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was a Navy Physician for 25 years. I KNOW why it's important to have medical personnel in the room when decisions are made about the care that'll be available to our active duty forces. When looking at the future of our military, medical readiness should NOT be an afterthought! https://t.co/0GAqGwEUf1","date":"Fri Mar 11 15:05:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a retired Navy Admiral and current member of the @HASCRepublicans, I am proud to know that the future of America’s defense capabilities will be built in our own backyard. Learn more about the funding I've secured for #TX13 defense priorities: https://t.co/Vsn0935HCf","date":"Thu Mar 10 17:26:29 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We're in the middle of sweeping Military Health System (MHS) reforms, and we can't let times of change cost us medical personnel or overall readiness. I'm COMMITTED to ensuring MHS reforms succeed while keeping our forces ready to SERVE. Our troops depend on it! @HASCRepublicans https://t.co/hfwC8fGjMc","date":"Wed Mar 09 15:05:12 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texans will NOT be fooled by Joe Biden's LIES! He could increase American energy production here at home to curb gas prices. Instead, he's pandering to a Venezuelan dictator to increase their oil production. WHY is he blocking energy production in places like Texas? Go home, Joe!","date":"Tue Mar 08 21:45:41 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I spent a lot of time at @WRBethesda throughout my career as Physician to the President. Today I went back for a visit as a member of @HASCRepublicans. The level of care and treatments offered for our service members at this FIRST CLASS facility are second to none! https://t.co/vBCGThB2lr","date":"Mon Mar 07 21:57:29 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"War Criminal Vladimir Putin is financing his war with OUR tax dollars from buying Russian oil! If Biden wanted to show leadership on the world stage, he’d end his war on American energy production so we can cut off Putin’s funding and return to American energy independence.","date":"Mon Mar 07 01:11:39 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"\"The right of the people to keep and bear Arms, shall not be infringed.\" The Constitution is CLEAR! I'll ALWAYS fight to protect our inalienable #2A rights in Congress.","date":"Sat Mar 05 23:43:29 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree →  Biden should focus on the invasion at OUR southern border with the same level of attention he's giving Ukraine's border.","date":"Fri Mar 04 23:39:14 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Pelosi needs to re-open the PEOPLE'S House NOW!","date":"Thu Mar 03 18:38:20 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas is the BEST state in the Union. Don’t mess with Texas!! My fellow Texans, HAPPY INDEPENDENCE DAY!","date":"Wed Mar 02 17:49:14 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What does Chuck Schumer stand for? Well, he doesn't even know!? https://t.co/t5ZaEvA2vh","date":"Wed Mar 02 02:55:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Ahead of Biden's #SOTUinCrisis address tonight, check out the REAL State of the Union from those who've been impacted by Biden's FAILED leadership. Skip to 5:50 to hear from Melisa Nichols of Wichita Falls. She was fired from @URHCS for making her own medical decisions. SHAMEFUL!","date":"Tue Mar 01 23:54:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a member of @HASCRepublicans and @HouseForeignGOP, it has been painful to watch the Biden Administration's reactionary approach to foreign policy. It has cost LIVES! It's time for America to LEAD on the world stage again! https://t.co/Sc0qFZilOv","date":"Tue Mar 01 21:25:31 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@SenHawleyPress and I have introduced legislation to restore American energy independence! We should NOT be financing Putin's war with our tax dollars, and we MUST provide relief to the American people who are being crushed by Biden's War on Energy! AMERICA FIRST!","date":"Tue Mar 01 16:38:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s a sad day for my House Democrat colleagues! We’re FINALLY getting rid of their beloved mask mandate on the House Floor. What will they now do with all of their Made In China masks??","date":"Mon Feb 28 23:58:38 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Ukrainian people have shown INCREDIBLE bravery in fighting back against a bloody, ruthless dictator who has no respect for INNOCENT life! Putin has committed HORRIBLE war crimes- HE NEEDS TO GO!","date":"Mon Feb 28 16:09:52 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I said during the Afghanistan withdrawal that our adversaries were laughing at us, and we see the fallout of that now. Russia has started a war not seen since World War II and China has been bombarding Taiwan airspace. We need a Commander-in-Chief who shows STRENGTH!","date":"Sat Feb 26 00:07:08 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"When President Trump left office, America had achieved energy independence and deterred our adversaries from threatening the GREAT United States of America. We've lost that standing in the world because of Biden's failed policies. PRAY for our country and allies!","date":"Fri Feb 25 01:05:32 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"House Democrats recently held a hearing on abolishing the debt ceiling because they want an easier pathway for their out-of-control spending and Socialist agenda. Inflation is already at a 40 year high and they're only looking to make things worse. INSANE!","date":"Wed Feb 23 17:36:22 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We are blessed in #TX13 to have dedicated first responders like the ones in Memphis and all of the surrounding small towns who worked so hard to put out the fire and protect this community. https://t.co/JrofnGalyH","date":"Tue Feb 22 23:34:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I stopped in Memphis today to tour the damages from yesterday's fire which destroyed some of this community's historic buildings.","date":"Tue Feb 22 23:34:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden continues to show he’s all bark and no bite. These sanctions are WEAK! His performance was WEAK! We need strong, tough leadership like President Trump ALWAYS delivered- NOT a slurred speech read from a teleprompter.","date":"Tue Feb 22 21:03:49 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Russia doesn't take us seriously because Biden has shown he's not a good leader. This situation NEVER would've happened under President Trump's leadership!","date":"Tue Feb 22 00:22:35 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We've wrapped up at the Munich Security Conference. Despite no leadership from the White House, my colleagues and I reassured our partners and allies that they have our full support in Congress!","date":"Sun Feb 20 16:40:30 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a part of the U.S. delegation to Munich, we're meeting with foreign leaders and discussing ways the U.S. can be a global leader in countering bad actors like Russia, China, and Iran. The Biden Administration has ignored the threat posed by these bad actors for far too long.","date":"Sun Feb 20 00:08:23 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was glad to meet with representatives of the @AlzAssociation in Amarillo this week. More than 6 MILLION Americans are living with Alzheimer's. We MUST work together in Congress to help #ENDALZ. https://t.co/E35issV8vZ","date":"Sat Feb 19 17:33:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"GREAT NEWS! Abortions in Texas fell 60% during the first month of our new state law. Human lives have been saved! #ProLife","date":"Fri Feb 18 15:53:58 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm off to the Munich Security Conference today as a representative of @HASCRepublicans and @HouseForeignGOP. I'm PROUD to represent the United States at this global forum! We're facing security threats in many places around the globe - just look at our own southern border.","date":"Thu Feb 17 21:43:06 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Liberals are praising Justin Trudeau for freezing PEACEFUL protesters' bank accounts, but I can only imagine what their response would've been had the same thing happened when THUGS were burning our communities down and looting businesses during the Summer 2020 Antifa \"protests.\"","date":"Thu Feb 17 14:10:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrat politicians expect us to \"thank\" them for \"giving\" us our freedoms back. Never forget that science (and the American way) has long been on the side of FREEDOM. The only difference now is Democrats are worried about re-election. NEVER FORGET what they did to us!","date":"Thu Feb 17 01:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration should leave law-abiding citizens alone and DO SOMETHING about the crime in our streets, the invasion at our southern border, out-of-control inflation/cost of living, etc. WAKE UP! Check out this story from @AWRHawkins⬇️ \nhttps://t.co/G6hAUDddX7","date":"Wed Feb 16 23:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"A scandal bigger than Watergate has been exposed, but the FAKE NEWS media and Biden White House don't even want to talk about it. Their silence speaks volumes! #DurhamReport","date":"Wed Feb 16 21:02:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"During the Afghanistan evacuation and in the 6 months since, many stories have come to light that show how the Biden White House's failures resulted in such a humiliating withdrawal. This conversation is far from over. Read our @HouseForeignGOP statement: https://t.co/42P4aD8cCm","date":"Tue Feb 15 22:12:25 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"UNMASK OUR KIDS!","date":"Mon Feb 14 14:40:11 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Home heating costs have risen 32% for Americans - an unprecedented increase! It's truly SAD that Biden's War on Energy stems from a hatred of President Trump and American GREATNESS (energy independence).","date":"Sat Feb 12 23:28:39 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Trump had me administer a cognitive test because he had nothing to hide. Why won’t Biden do the same? We can only assume the worst if he doesn’t submit to the same precedent that his own party demanded of the last administration.","date":"Fri Feb 11 19:54:12 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As Democrat Jamie Raskin said in 2018, \"it's not hard to think that there will be future situations where the President's physical and mental state may create issues for us.” That future situation is NOW. Joe Biden needs a cognitive test IMMEDIATELY!","date":"Thu Feb 10 21:20:44 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was a White House physician to three U.S. Presidents, and I can tell you something isn’t right with Joe Biden's cognitive state. My colleagues and I are AGAIN asking Biden to take a cognitive test! \n \nMore from @HoustonKeene of @FoxNews:\nhttps://t.co/Avz9ao3nro","date":"Wed Feb 09 12:36:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Alarming amounts of fentanyl continue to pour across our southern border, and fentanyl overdoses are now the leading cause of death for Americans aged 18-45. So why won't the Biden Administration act? Biden’s failure at the border is costing too many young lives, he must act NOW!","date":"Tue Feb 08 15:47:19 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden can no longer deny the fact that he has created an economic CRISIS! According to an ABC Poll, 75% of Americans AGREE the economy is doing poorly, and ONLY 1% think it is excellent. What do you think? Take this ONE question survey: https://t.co/kaJfXOSD5d","date":"Mon Feb 07 22:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICE is supposed to focus on protecting us from acts of terrorism, immigration enforcement, and stopping drugs/crime from crossing our borders. But NONE of this is happening in the Biden Administration. @RepBenCline and I are demanding answers! Learn more: https://t.co/UvWlTOkzpN","date":"Mon Feb 07 17:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"How many lives could've been saved from suicide, drug overdose, untreated cancer, heart disease, etc. if liberals hadn't embraced lockdowns? Lockdowns only reduced COVID deaths by 0.2%. Liberals &amp; the FAKE NEWS media LIED! It's about fear, control, &amp; unsolicited mail-in ballots!","date":"Mon Feb 07 14:14:46 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've joined @RepChipRoy in pledging NOT to vote for vaccine mandate funding later this month! We the PEOPLE don't need the federal government making healthcare decisions for us and we DEFINITELY don't need to waste taxpayer money on politicians’ unprecedented power grab.","date":"Sun Feb 06 21:38:17 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Studies now show that those who previously had COVID were BETTER protected than vaccinated individuals during the Delta wave. Writing off the value of natural immunity will go down in history as one of the biggest failures of Biden's handling of this pandemic.","date":"Sat Feb 05 15:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Moscow and Beijing are taking advantage of Biden's cognitive INCAPACITY and FAILED leadership. What an embarrassment!","date":"Fri Feb 04 21:00:05 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"\"Border Czar\" Kamala Harris has had nearly a year to DO HER JOB and put an end to #BidensBorderCrisis, but all she has done is pose for photos and waste taxpayer money on foreign trips. Today, I introduced the Border Czar Accountability Act to hold her accountable. Learn more ⬇️","date":"Fri Feb 04 17:45:47 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Nancy Pelosi's CONCEDES Act is a JOKE! I won’t support her WEAK legislation that does nothing to hold the Chinese Communist Party accountable for its malign influence. ANY decent bill that addresses China would punish the CCP for developing and covering up COVID!","date":"Fri Feb 04 15:14:49 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Tonight, 3 of my amendments passed on the House Floor.\n\n✅ Ending the UN's RIDICULOUS investigation of Israel\n✅ Preventing future Olympic Games from being held in countries that are committing genocide\n✅ Protecting our ag supply chains from foreign interference\n\nHUGE wins!","date":"Thu Feb 03 23:29:20 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What’s happening on the Ukraine/Russia border would NEVER happen under the leadership of President Trump! Do you agree? Let me know by participating in this ONE question survey: https://t.co/eIN19Jzl83","date":"Thu Feb 03 22:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Who else misses Kayleigh McEnany and Sarah Huckabee Sanders?? Jen Psaki laughing while dismissing the crime surge that has victimized so many Americans makes my blood boil. Democrats' culture of lawlessness and embrace of crime is DISGUSTING!","date":"Thu Feb 03 17:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden buying COVID test kits from China has to be one of the DUMBEST decisions he has made (and that's saying a lot). Giving a Chinese COMMUNIST Party company $1.3 BILLION of our tax dollars rewards China for unleashing this virus on the world! Biden puts America LAST!","date":"Thu Feb 03 14:41:30 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 – As the potential for severe winter weather approaches, check out these important winter safety tips: https://t.co/hU8eb35Rgi","date":"Wed Feb 02 22:48:56 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"76% of Americans don't want Joe Biden to be RACIST and SEXIST when picking his SCOTUS nominee. The fact that this even has to be said shows how backwards things are in the Democrat Party. “Reverse racism” is just RACISM!","date":"Wed Feb 02 17:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"God bless the BRAVE men and women of law enforcement across this great country. BACK THE BLUE!","date":"Wed Feb 02 14:22:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I proudly support the Canadian truckers who are standing up for their freedoms! Say NO to mandatory COVID vaccines! #TruckersForFreedom2022","date":"Tue Feb 01 22:27:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Russia's escalation against Ukraine didn't happen overnight. Biden had plenty of opportunities to stand up to Vladimir Putin, but he didn't. You have to ask yourself why. He's a DELUSIONAL failure!","date":"Tue Feb 01 14:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm closely monitoring Putin's aggression toward Ukraine with my @HASCRepublicans and @HouseForeignGOP colleagues. This crisis could have SERIOUS implications for our servicemembers, citizens abroad, and allies. This NEVER would have happened under President Trump’s leadership!","date":"Mon Jan 31 22:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Last year, I worked with my colleagues on a bipartisan basis to provide disaster relief assistance to Texas farmers who've seen their livelihoods crushed by extreme weather conditions. An extension of WHIP+ was signed into law, but the @USDA STILL hasn't administered the program.","date":"Mon Jan 31 16:12:48 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This is bureaucracy at its finest, something I know Texans will NOT stand for! I’m glad to join my Texas colleagues in urging @SecVilsack to do his job and see this important program through IMMEDIATELY. Learn more: https://t.co/qDHcX6DHox","date":"Mon Jan 31 16:12:48 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was the first White House Chief Medical Advisor, so it sickens me to know the influence a LIAR like Fauci has in shaping public health policy. He continues to prove to us that he can't be trusted. When will Biden FINALLY #FireFauci!?","date":"Mon Jan 31 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 — If you're working with a federal agency and aren't receiving an answer in a timely fashion, or you feel you've been treated unfairly, my office may be able to help you resolve the problem or get more information. You can get in touch with us HERE: https://t.co/rvhwbrTCiM","date":"Sun Jan 30 20:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today my wife Jane and I celebrate 29 years of marriage! She’s my better half and best friend. We’ve experienced so much together over the years and I’m grateful to have had her by my side through it all. https://t.co/le3jxKWAOO","date":"Sun Jan 30 18:31:18 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The January 6th WITCH HUNT Committee has one goal: make sure President Trump can't be President again.\n\nWhy are they so scared of President Trump? It's because he has always exposed corrupt Washington politicians for the HYPOCRITES that they are.","date":"Sat Jan 29 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Our BRAVE law enforcement officers are being ambushed in brazen attacks around the country because of Democrats' message of hate and disrespect toward them. It's a SICK world that we live in where thugs are protected and HEROES are demonized. I will ALWAYS #BackTheBlue!","date":"Fri Jan 28 19:07:53 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"After losing his cool on Peter Doocy, the White House made sure Biden had an ice cream and shopping day. I've seen this before in my career as a physician. When an elderly person is declining cognitively they have a tendency to lash out and need to cool down. COGNITIVE TEST NOW!","date":"Fri Jan 28 13:58:48 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a veteran combat physician and dedicated member of @HASCRepublicans, I won't stop advocating for Future Vertical Lift or MEDEVAC modernization. Speed and range NEED to be the focus for future MEDEVAC aircraft.\n\nRead my new op-ed in the @MilitaryTimes. \nhttps://t.co/6qghm2FzpU","date":"Thu Jan 27 23:00:15 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's approval has TANKED to 33%. The American people are FED UP with his failed policies and misplaced priorities. What do YOU think of Biden's job performance?  Take this ONE QUESTION survey: https://t.co/0p75A7Q7DO","date":"Wed Jan 26 14:58:23 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I co-signed a request for ANSWERS from OMB's Acting Director. Biden's EO 14019 is a SAD attempt to use taxpayer money to destroy voter integrity! Who are these \"approved\" third-party orgs managing voter registration? Sounds like a recipe for FRAUD to me.\nhttps://t.co/MM9pbctWab","date":"Tue Jan 25 16:31:21 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration and the FAKE NEWS media care more about Ukraine’s border than they do our own southern border. SAD!","date":"Mon Jan 24 22:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am PROUD to co-sponsor @RepJeffDuncan's Congressional Review Act. The Supreme Court let the vaccine mandate for healthcare HEROES go into effect, so Congress MUST act! We already have a healthcare worker shortage- things WILL get worse if Congress doesn't block Biden's mandate.","date":"Mon Jan 24 17:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Does Joe Biden even know what day of the week it is? Probably not.","date":"Mon Jan 24 14:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Secretary Cardona thought concerned parents would go away quietly when he secretly weaponized the teachers' union and the DOJ to go after them. Just the opposite! Concerned parents around the country won't stand for this. Cardona must RESIGN!\nhttps://t.co/GFSqJkcWjV","date":"Sun Jan 23 20:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Children are made in God's image. As Democrats pursue their anti-life agenda, we in the @HouseGOP will NEVER turn our backs on the unborn! The sanctity of life MUST be protected.\n\n#NationalSanctityofLifeDay","date":"Sat Jan 22 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I will ALWAYS stand up for the most vulnerable among us - the unborn! Are you #ProLife? Let me know by taking this ONE QUESTION survey: https://t.co/k0Q16a1w9g","date":"Fri Jan 21 22:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"“Before I formed you in the womb I knew you, before you were born I set you apart.” Jeremiah 1:5\n\nEvery child is a GIFT from God! #ProLife","date":"Fri Jan 21 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@RepGregMurphy and I are DEMANDING answers from the NIH! Lockdowns are NOT the answer- they've crushed our economy, stolen our freedoms, and negatively impacted Americans' health. ENOUGH!\nhttps://t.co/vXKnm2dONQ","date":"Thu Jan 20 23:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's Year in Review:\n\n📌 Border Crisis\n📌 Inflation Crisis \n📌 Crime Crisis\n📌 Supply Chain Crisis\n📌 Afghanistan Crisis\n📌 Economic Crisis \n📌 Authoritarian vaccine mandates\n📌 Concerned parents = \"domestic terrorists\"\n\nHeck of a legacy. Thanks for NOTHING, Joe!","date":"Thu Jan 20 17:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree → Joe Biden's first year in office has been an absolute DISGRACE!","date":"Thu Jan 20 14:21:33 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WOW! Teleprompter, hand selected reporters, and total softball questions, and yet Biden STILL can't form a coherent thought or inspire ANY confidence. SAD!","date":"Wed Jan 19 22:17:33 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am PROUD to have earned an A+ on @SBAList’s pro-life scorecard. With the Supreme Court's decision on Dobbs coming out later this year, I'm optimistic that 2022 will be the year that the Court FINALLY protects the unborn! https://t.co/eMRiRdaR1E","date":"Wed Jan 19 15:28:53 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden is a disaster and ruins everything he touches! The economy, the border, inflation, national security, and the list goes on. Americans are SICK of Biden's failed leadership. The worst part is, he probably doesn't remember any of it!","date":"Tue Jan 18 22:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The safety of our servicemembers should NEVER be a partisan issue! As part of this year’s NDAA, the Servicemember Safety and Security Improvement Act was signed into law. I'm proud to have been a leader on this important bicameral issue. Learn more ⬇️ https://t.co/gz0aTAAG4r","date":"Tue Jan 18 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DHS data shows that 47 THOUSAND illegals who Biden released into our communities haven't reported to ICE. Shocking- NOT! Biden's plan to let them INVADE our country then get voting rights is working out perfectly. This lunacy MUST stop, or we won't recognize our country anymore!","date":"Mon Jan 17 22:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Fauci thinks Senator Marshall is \"a moron,\" but I wonder if Fauci realizes that's what MILLIONS of Americans think about HIM? He clearly can't stand being held accountable. FIRE FAUCI!","date":"Mon Jan 17 14:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden said he would shut down the virus. HE LIED.\n\nBiden said he would never issue vaccine mandates. HE LIED.\n\nBiden said his Build Back Better agenda cost $0. HE LIED.\n\nDo you see the trend here? \"His word as a Biden\" means NOTHING. He has FAILED us miserably!","date":"Sun Jan 16 19:00:01 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Sadly, #HumanTraffickingAwarenessMonth is a poignant reminder of how serious Biden's Border Crisis is. We MUST work to end this modern day form of slavery, and we start by securing our border! https://t.co/JHauEGR3aS","date":"Sat Jan 15 15:00:02 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Trashing the filibuster would mean \"doomsday for democracy.\" - Chuck Schumer in 2005. I couldn't agree more, Chuck! Enough with your HYPOCRISY- leave the filibuster alone!","date":"Fri Jan 14 14:00:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Capitol Building is STILL closed to tours over COVID- a decision NOT informed by science! The Capitol is supposed to be open to the American people. They shouldn't be denied access any longer! That's why I joined @MikeKellyPA and @BobLatta's letter pushing for a reopening!","date":"Fri Jan 14 05:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's Crime Crisis is breaking records, and not in a good way! Homicides are up in Democrat-run cities around the country and NOTHING is being done to stop it. SHAME on \"leaders\" like Biden and Lori Lightfoot who allow this lawlessness! Americans deserve much better.","date":"Thu Jan 13 22:00:00 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WE WON! The Supreme Court just BLOCKED Biden's illegal vaccine mandate for workers at large businesses. It's a great day for COMMON SENSE, but I will not stop fighting for our healthcare heroes who were left out of this decision!","date":"Thu Jan 13 20:06:45 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree → Big Tech is out of control and MUST be held accountable!","date":"Thu Jan 13 16:32:16 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden is a FRAUD! He now says you're on the side of George Wallace if you don't support a federal overhaul of elections. Biden was once very PROUD of being praised by fellow Democrat George Wallace. He's totally disingenuous, don't buy into his latest attempt to gaslight us.","date":"Wed Jan 12 18:09:46 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In December, inflation grew at the fastest rate we've seen in four DECADES! This is the latest sign that Democrats' out-of-control spending is only worsening the economic crisis. Americans are now making less while paying more for just about everything. OUTRAGEOUS!","date":"Wed Jan 12 15:05:47 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: I joined many of my @HouseGOP colleagues in sending an amicus brief to the Supreme Court arguing against Biden's ILLEGAL vaccine mandate. This unprecedented overreach CANNOT stand! Learn more ⬇️\nhttps://t.co/XYv0PbuFsV","date":"Wed Jan 12 00:15:21 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On the same day Joe Biden received the WORST jobs report of his presidency, his Administration argued before the Supreme Court that they should be able to FIRE you from your job for refusing an ILLEGAL vaccine mandate. Their priorities are all wrong!","date":"Mon Jan 10 23:31:26 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"With the recent passing of one of @AmarilloPD’s finest, join me in praying for the family, friends, and fellow officers of Corporal Mike E. Sanchez. He served our community for 16 years with honor and distinction. His legacy will live on through his wife Brandi and 5 children.","date":"Mon Jan 10 00:35:03 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I stopped by the Montague County Youth Fair to see the kids prep for their big county show. They work hard all year to get their animals ready! Thanks to the 4-H Club and the FFA for investing in our young people- they’re the future of TX agriculture. #TX13 https://t.co/oYmlbMFbRG","date":"Thu Jan 06 18:23:22 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s always great to see my friend Mike Hendren when I’m in @CityofWF. Tune in to @NewsTalk1290 tomorrow morning to hear our discussion on the border crisis, Biden’s cognitive decline, and more! #TX13 https://t.co/DmWwy7IgmN","date":"Wed Jan 05 22:16:44 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congratulations to the Randall County 4-H livestock quiz bowl team on their WIN at nationals. What a brilliant group of young people! Winning nationals their first time attending is quite the accomplishment. Keep up the great work!","date":"Wed Jan 05 02:41:51 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"One year ago today, I was sworn into Congress. I will ALWAYS protect the conservative values we hold dear here in #TX13. This is just the beginning. Finish the fight! https://t.co/g6PJgBjSbO","date":"Tue Jan 04 02:27:59 +0000 2022","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Senator Manchin standing up to the Liberal Democrats on the Build Back BROKE bill is a great gift for the American people! At least this time Biden's failures will actually benefit Americans for a change.","date":"Fri Dec 31 00:05:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden is INEFFECTIVE and INCAPABLE of being the strong, decisive leader the American people need. His legacy will not only be defined by crisis, but also his inability to solve problems without making things worse. Biden's Year of Crisis in review: https://t.co/nqbHquTQRV","date":"Wed Dec 29 17:11:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Great news that this year’s National Defense Authorization Act was signed into law. This ensures #TX13 will remain a key part of our national defense for decades to come. This NDAA supports our military, @PantexPlant, @SheppardAFB and the workforce across the Panhandle!","date":"Tue Dec 28 18:18:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am proud to share that the @AmarilloPD has been awarded a $500,000 grant from the DOJ to develop a technologically advanced Real Time Crime Center. This project will help keep our community safe! #BackTheBlue","date":"Tue Dec 28 01:59:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"From my family to yours, Merry Christmas! May this day be filled with love, joy, and happiness for all! “Thanks be to God for His indescribable gift.” 2 Corinthians 9:15","date":"Sat Dec 25 16:57:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As we gather with loved ones for Christmas Eve traditions, let us remember the reason for this holiday season: the birth of our Lord and Savior Jesus Christ. God bless!","date":"Fri Dec 24 17:29:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Most Americans are tired of Joe Biden's failed policies. As your Representative in Congress, I want to know what YOU think so I'm conducting my own poll in #TX13. Take this ONE QUESTION survey: https://t.co/TS6wo0w2Z0","date":"Thu Dec 23 20:05:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Another LOSS for Joe Biden! I sent a letter to @PantexPlant leadership DEMANDING they halt the illegal vaccine mandate for workers in Amarillo and the next day they did. I'll ALWAYS stand firm against Biden's ploy to control you! Read my full letter: https://t.co/XgWx3GV3i5","date":"Wed Dec 22 22:42:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As the Chinese Communist Party continues its War on Democracy, the United States remains committed to deepening ties with Taiwan and combatting China's aggression on the global stage!","date":"Mon Dec 20 22:31:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As Americans participate in Wreaths Across America Day, we REMEMBER those who gave their lives to defend our freedom, HONOR the service of all our servicemembers and veterans, and TEACH our children to appreciate the sacrifices that built the greatest country on Earth. God bless!","date":"Sat Dec 18 22:42:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Inflation is a TAX on American families! People are feeling the pinch in their everyday lives- heating their homes, gas, groceries, etc. Biden's agenda is hurting the working class most and Democrats have failed to offer ANY solutions. They're totally incompetent!","date":"Fri Dec 17 18:30:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas MUST be prepared for another polar vortex! My new bill, the POLAR Response Act, will make sure our BRAVE law enforcement officers have the resources needed to protect citizens, mitigate fallout, and get communities back on their feet.\n\nLearn more⬇️\nhttps://t.co/ihf1LPtcK5","date":"Thu Dec 16 17:00:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden wanted to give our HEROES a dishonorable discharge from the military if they opposed his ILLEGAL vaccine mandate, but the @HouseGOP stood up to him and didn't let it happen! Servicemembers shouldn't be punished for having an opinion on a controversial new vaccine. #NDAA","date":"Thu Dec 16 02:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It doesn't matter how Biden tries to spin it, the economy is in shambles because of his FAILED policies! The U.S. economy added 210,000 jobs in November, missing the expected 573,000 new jobs. Biden is a good-for-nothing President!","date":"Wed Dec 15 21:59:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've joined @RepJeffDuncan &amp; 160 of our colleagues in combating ILLEGAL vaccine mandates for health care workers. It's WRONG that Biden sees no issue with forcing people to choose between a jab or their job. We can't afford to lose our health care workers!\nhttps://t.co/wMOdWqE11s","date":"Wed Dec 15 02:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I served in the Navy for 29 years, so it makes me SICK to see Biden try to use our military for his woke experiments. I was PROUD to block several of his \"woke\" priorities from being included in this years' #NDAA. What do you think of my work? Let me know! https://t.co/P5HpMpBaVu","date":"Tue Dec 14 20:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congratulations to Stratford’s football team for punching their ticket to the State Championship for the first time since 2008! A tough group of guys who will continue to make the Panhandle proud I am sure. Keep up the hard work and good luck at state! \nhttps://t.co/DHCJ2hGjx0","date":"Tue Dec 14 15:00:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Under Biden, our adversaries have NO respect for America. China and Russia are making military advances on other countries and Iran is jerking us around over the Iran Nuclear Deal because they know Biden is WEAK! But hey, at least we don't have any more mean tweets...","date":"Tue Dec 14 01:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congress' message to the Chinese Communist Party MUST be clear: there WILL be consequences for the CCP if they threaten Taiwan’s independence! \n \nLearn more about my new bill, which stresses the importance of our military's interoperability with Taiwan! ⬇️https://t.co/PMv2hwHbNi","date":"Mon Dec 13 21:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Over 62 MILLION lives have been lost since the horrible Roe v. Wade decision. We MUST protect the sanctity of human life! Are you pro-life? Let me know! Take this one question survey NOW⬇️ https://t.co/VKAWYbnZoi","date":"Mon Dec 13 17:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've worked to push back on #BidensBorderCrisis since the onset! This week, I joined @RepBice in introducing the SAFE Border Act to reimburse families who've experienced property damage/theft by illegals at the border. We need to be there for them since Biden doesn't care!","date":"Sun Dec 12 17:00:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a doctor who grew up in rural Texas, I understand the importance &amp; challenges of rural healthcare. It was great to meet with @TAHCH to discuss vaccine mandates' threat to the healthcare workforce and ways Congress can ensure equal treatment for home care &amp; hospice providers! https://t.co/Dvzgz31vJ9","date":"Sat Dec 11 17:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"CORRUPT teachers union bosses made a huge mistake calling parents \"domestic terrorists\" for voicing their concerns. Several state school boards have already parted ways with the National Association, and Texas needs to follow- I joined @RepChipRoy's letter DEMANDING they do!","date":"Fri Dec 10 20:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Liberals claiming the media is out to get Biden is laughable. President Trump could glance to the left and the FAKE NEWS media would attack him. Biden is receiving bad press because he has caused, and won't fix, several HUGE crises. Border, economy, energy, crime...to name a few.","date":"Thu Dec 09 20:50:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden owes our BRAVE border patrol officers, and the American people, SO much more. He has FAILED to \"protect and serve.\" He only serves his own interests — recruiting new Democrat voters at the expense of our tax dollars and safety. Wake up! \n\n#BidenBorderCrisis","date":"Thu Dec 09 14:27:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Bill de Blasio's last act as Mayor of NYC is to seal his legacy as an authoritarian FAILURE! People wouldn't trust him to be NYC dog catcher these days, he has NO business making health decisions for people — no politician should.\nhttps://t.co/NQ0z4gm3hV","date":"Wed Dec 08 22:12:12 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Last night, I voted for the 61st annual #NDAA. This IMPORTANT legislation takes care of @SheppardAFB, @PantexPlant, the men and women of our GREAT military, and the #TX13 workforce. @HASCRepublicans will always put America first!\n\nSee my full statement! ⬇️\nhttps://t.co/sKrGpbhk31","date":"Wed Dec 08 18:21:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Deportations are down 90% under Joe Biden's FAILED immigration \"plan.\" To be clear, that plan has entailed the following all along:\n \n- Allow illegal immigration to soar\n- Give illegals amnesty and FREE everything\n- Secure new Democrat voters\n \nTHIS is what Democrats stand for!","date":"Wed Dec 08 15:07:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I just voted for the final #NDAA. Democrats thought they could push through horrible policies, but tonight we stopped them! I will NEVER give an inch on our #2A rights, and I will NEVER vote to force our daughters to go to war. \n \n@HASCRepublicans https://t.co/MwecXrrqyC","date":"Wed Dec 08 02:57:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Tonight I spoke on the House Floor in favor of the #NDAA, which includes:\n\n✅A pay raise for servicemembers\n✅Funding for #TX13 defense interests\n✅A ban on dishonorable discharges for those who refuse the ILLEGAL vaccine mandate\n\nThis bill is a WIN for all who love our military! https://t.co/LjZK5IeSZY","date":"Wed Dec 08 01:47:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I promised to fight back on two HORRIBLE provisions in the #NDAA, and I'm proud to share that I WON! I led the effort to block red flag laws and a mandatory draft for our daughters from being included in the final bill. I will NEVER back down to the Radical Left! @HASCRepublicans","date":"Tue Dec 07 17:20:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"80 years ago today, America's resolve was tested at #PearlHarbor. We lost 2,403 heroes, but America's spirit didn't waver. We'll ALWAYS remember the bravery and sacrifice of those who gave their lives, and of those who answered the call to avenge the attack and fight for freedom. https://t.co/ODtlVMLhBl","date":"Tue Dec 07 16:10:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Trump was a CHAMPION for our allies! Four years ago today, he formally recognized Jerusalem as Israel's Capital. Even though he received unfair criticism from the Radical Left, it has proven to be one of the best decisions of his presidency. THANK YOU, President Trump!","date":"Mon Dec 06 23:09:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congrats to the team at @PantexPlant for completing the first production unit for the B61-12 Life Extension Program! This will modernize our nuclear weapons stockpile and our air delivered nuclear deterrent capability. @HASCRepublicans will ALWAYS protect the nuclear triad! #TX13","date":"Fri Dec 03 22:38:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It would be easier to fly to Mexico and walk across the southern border. Biden's fear mongering over the Omicron variant is based on political science- NOT actual science! If he were truly concerned, he'd put an end to his self-made border CRISIS.\nhttps://t.co/V9HUSDBf6T","date":"Thu Dec 02 21:58:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Life begins at conception! That’s not a religious opinion, it’s a scientific FACT. As a physician, I’m disgusted that political activists like Sonia Sotomayor have no regard for innocent, human life. Abortion is MURDER!","date":"Wed Dec 01 21:03:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've joined @RepPatFallon and our @RepublicanStudy colleagues in a letter to Biden explaining why we, and the American people, don't want Biden to cower to Iran. We shouldn't cede any of our leverage, and we DEFINITELY shouldn't give them our tax dollars! https://t.co/neW1D1AGFx","date":"Wed Dec 01 00:20:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"\"We will not back off from annihilation of Israel, even one millimeter,\" said Iran's military spokesperson over the weekend. How does Biden respond? By resuming talks with Iran to rejoin the HORRIBLE Iran Nuclear Deal. Why does Biden cozy up to people who HATE us and our allies?","date":"Wed Dec 01 00:20:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to see many of my friends in the #TX13 ag community yesterday! Thank you, @TexasWheat, for having me at your board meeting. The future is bright for Texas wheat growers, especially here in the #1 Ag district in Texas! https://t.co/QebfYBC0Iq","date":"Tue Nov 30 15:04:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Stay up to date on what’s happening in Congress. Sign up for my e-newsletter, Ronny’s Roundup, TODAY! Please also send this to your friends and family in #TX13 and encourage them to subscribe as well. https://t.co/u324eRZlYk","date":"Mon Nov 29 21:43:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As the Festival of Lights begins this evening, my family and I wish everyone celebrating joy and happiness this holiday season. #HappyHanukkah","date":"Mon Nov 29 01:09:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The only reason Dr. O'Connor won't give Biden a cognitive test is because he knows what it'll show and he is hiding the truth! COGNITIVE TEST NOW!  https://t.co/lMfw8n7QVj","date":"Sat Nov 27 00:59:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats were RELENTLESS in calling on President Trump to take a cognitive test. I personally administered the test, and the precedent was SET.","date":"Sat Nov 27 00:59:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Wishing you all a wonderful Thanksgiving and sending my thanks to those who can’t be at home with their families today because they're serving our country in the Military, caring for the ill in hospitals, and so much more. From my family to yours, #HappyThanksgiving2021. https://t.co/pkRZdGwl4k","date":"Thu Nov 25 21:42:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm thankful to be an American and for the opportunity to represent the people of #TX13 in Congress!","date":"Thu Nov 25 21:42:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden’s authoritarian vaccine mandate has been temporarily BLOCKED in federal court. I firmly believe it’s unconstitutional and will ultimately be thrown out! What do you think about vaccine mandates? Take this ONE QUESTION survey! ⬇️https://t.co/guszH2zkcP","date":"Wed Nov 24 21:21:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I want to know what issues are most important to YOU so I can best represent you in Congress. Take this quick survey NOW!⬇️\nhttps://t.co/zI9LUBgOzu","date":"Mon Nov 22 03:29:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"❌Taxpayer-funded abortion \n❌An assault on the energy industry \n❌Entitlement programs for illegals\n❌Doubling the size of the IRS\n\nThe list goes on and on with this SOCIALIST garbage. Horrible legislation, horrible for the American people!","date":"Fri Nov 19 02:59:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden’s #BuildBackBroke bill is the most RADICAL legislation in American history! Tonight, I will vote AGAINST:\n\n❌150+ new government programs that’ll never go away \n❌Payouts to the liberal media, union bosses, teachers unions, Green New Deal lunatics, etc.","date":"Fri Nov 19 02:59:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are getting ready to spend TRILLIONS on the #BuildBackBroke bill that includes taxpayer-funded entitlement programs for illegals. I don’t believe we should reward people for breaking the law! What do you think? Take this ONE QUESTION survey: https://t.co/4xIo8gsYr1","date":"Thu Nov 18 19:20:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Why do Democrats refuse to acknowledge that Border security is NATIONAL SECURITY?\n \nThe latest on #BidensBorderCrisis:\n❌164,303 illegals apprehended in Oct.\n \n❌17,126 illegals released into OUR communities in the past month\n \n❌1.6 MILLION+ apprehensions since Biden took office","date":"Wed Nov 17 22:44:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Attorney General Garland testified to Congress that the DOJ was NOT targeting parents for speaking out against CRT. It turns out he LIED!\n \nDid the AG commit perjury or is he incompetent? Either way, he needs to RESIGN! Thank goodness he's not on the Supreme Court right now.","date":"Wed Nov 17 15:49:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to meet the Chancellor of Texas Woman’s University this morning! @TXWomans is doing IMPORTANT research on PTSD in veterans, and I am proud to support their work. Thank you for stopping by! https://t.co/lfIM7govp9","date":"Tue Nov 16 22:18:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I have made it my mission to ensure that promises made to our American HEROES are promises kept, and transparency is a key part of that. We still have a long road ahead of us to improve the VA, but my NEW legislation is an important start.\n\nLearn more ⬇️https://t.co/E7NZje0UNR","date":"Tue Nov 16 16:33:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Americans are SICK and TIRED of Joe Biden. His poll numbers are tanking by the day! As your Representative in Congress, I want to know what YOU think so I'm conducting my own poll in #TX13. Take this ONE QUESTION survey! https://t.co/IsqmKEKcXE","date":"Mon Nov 15 23:22:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Consumer prices hit a 30 year high in October. Prices have risen EVERY month of Joe Biden’s failed presidency, and it’s only going to get worse with his failed economic “strategy” (tax, spend, regulate). \n\nSay it with me: INFLATION = TAXATION","date":"Sat Nov 13 16:46:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be at the first round of the Working Ranch Cowboys Association’s 2021 World Championship competition in Amarillo last night! They came ready to compete and put on a GREAT rodeo. https://t.co/dhlX4Nq2d9","date":"Fri Nov 12 21:09:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was glad to attend the Texas Panhandle War Memorial Center’s Veterans Day ceremony with some great PATRIOTS from the Amarillo community today. May we never forget the sacrifice our veterans made to keep us safe and secure our futures in the BEST country in the world! https://t.co/rorPkpGVva","date":"Thu Nov 11 23:39:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"To those who made it out to my veterans roundtable in Amarillo this morning- THANK YOU! I’ll never stop working to address the needs of our HEROES in Congress.\n\n#HappyVeteransDay to my fellow veterans in #TX13 and beyond! https://t.co/wRRdWuUuXL","date":"Thu Nov 11 19:24:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Great to be at @SheppardAFB today to celebrate its 80th birthday and the 40th anniversary of ENJJPT! The future is BRIGHT for Sheppard with so many opportunities to grow its mission. Thank you Brig. Gen. Drew for having me on this special occasion! Combat capability starts here! https://t.co/zmB3EcDQhL","date":"Thu Nov 11 01:30:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As Veterans Day approaches, I was honored to host a roundtable for local veterans in Wichita Falls today. \n\nI’m committed to ensuring our veterans get the quality of care and service they deserve. To the veterans of #TX13, THANK YOU for trusting me to be your voice in Congress! https://t.co/ElNTvE8IhC","date":"Wed Nov 10 22:57:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Happy 246th birthday to the @USMC! I’m proud to have served alongside many GREAT Marines in Iraq. SEMPER FI to my brothers in arms!","date":"Wed Nov 10 20:11:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Buttigieg is stealing Christmas and guess what his top priority is? Stopping racist highways. Get a grip. \n\nhttps://t.co/Bari81wdXy","date":"Wed Nov 10 14:26:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Inflation is taxation on hard-working American families no matter how Democrats try to spin it. NEWS FLASH, spending trillions on socialist wish list will only make things worse.\n\nhttps://t.co/I5GV8eoZgZ","date":"Tue Nov 09 23:38:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's self-made crises are CRUSHING the American people, but he's protecting ILLEGALS. Why would anyone approve of giving $450K to people who broke the law!? I'm co-sponsoring @RepMcClintock's bill that would BLOCK this disgusting use of YOUR taxpayer dollars!","date":"Mon Nov 08 01:01:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm PROUD to co-sponsor @RepKevinBrady's Equal Treatment of Public Servants Act! This IMPORTANT bill would replace the unfair Windfall Elimination Provision, giving police officers, firefighters, and teachers a Social Security benefit that's reflective of their work history.","date":"Sat Nov 06 16:02:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As China rapidly expands its nuclear arsenal, the U.S. Military cannot afford to have its best and brightest on the sidelines. Biden's unconstitutional vaccine mandate will have SERIOUS consequences for America's national security!\n\nMORE on my letter to Secretary Austin ⬇️","date":"Fri Nov 05 18:28:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are rushing to pass a HUGE tax and spending bill WITHOUT knowing the full financial impact it will have AND without reading the 2,100+ page bill. This is the swamp at work!\n\nI am proud to join @JayObernolte in calling on @SpeakerPelosi to STOP this vote! #NoScoreNoVote","date":"Fri Nov 05 15:12:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden has endorsed House Democrats' plan to provide work permits for ILLEGAL immigrants in the #BuildBackBroke bill. That means someone who broke the law could get a job opportunity over YOU, a taxpaying American citizen. This is the most RADICAL legislation in American history!","date":"Thu Nov 04 22:30:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"There are over 10 MILLION job openings in America, yet the RADICAL Democrats want to continue this labor shortage by eliminating welfare job requirements for able-bodied workers. Why is this administration so incompetent? Able-bodied people need to work!","date":"Wed Nov 03 20:33:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats have included a Made in America TAX in the radical #BuildBackBroke bill. It'll increase the corporate tax rate and cost more than 107,000 jobs. President Trump championed pro-American policies, and Biden hates it. We’ve gone from America First to America Last!","date":"Tue Nov 02 19:49:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today, I joined my colleagues &amp; DC first responders to stand up against Biden’s vaccine mandates! \n\nFiring people for not following orders from the government is putting lives in danger. No jab should NOT EQUAL no job! \n\nVaccine mandates need to be put to end! ENOUGH IS ENOUGH! https://t.co/W2mNAx8g4m","date":"Mon Nov 01 18:21:37 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Stay up to date on what’s happening in Congress! Sign up for my e-newsletter, Ronny’s Roundup, TODAY! Please also send this to your friends and family in #TX13 and encourage them to subscribe as well. https://t.co/izLr3iR54j","date":"Mon Nov 01 00:50:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The average household is spending an extra $175/mo. on food, fuel, &amp; housing due to Biden's Inflation Crisis! Meanwhile, Democrats are going to make things worse with a HUGE tax &amp; spending bill. Take this ONE QUESTION survey to let me know what you think!\nhttps://t.co/qiQpNM0w35","date":"Sat Oct 30 22:49:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are in disarray over their #BuildBackBroke agenda! Everyone's discussing what's in the MASSIVE bill, but I'll remind you what's NOT: the Hyde Amendment. For 50 years this policy prevented taxpayer-funded abortions, but RADICAL Democrats are getting rid of it. SHAME!","date":"Fri Oct 29 19:31:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats want to hire 85,000 new bureaucrats for the IRS to SPY on the average American's bank account. They say they're targeting the wealthy, but they're really going after the \"little guys\" because most people can't afford fancy lawyers to fight back against PREDATORY audits!","date":"Thu Oct 28 14:43:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This Administration is at WAR with the energy industry, and Joe Biden pretends like he has no idea why gas prices have reached a 7-year high! How are rising gas prices impacting you? Let me know by taking this ONE QUESTION survey! https://t.co/g6NVjRUTs3","date":"Wed Oct 27 14:36:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are pushing a \"Heat Your Home Tax\" in their #BuildBackBroke bill that could cost YOU an extra $242 to stay warm next year AND could kill as many as 90,000 jobs. Let's call this bill what it is: a SOCIALIST SCAM!","date":"Tue Oct 26 20:57:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden’s illegal vaccine mandate is about control, NOT science! He encourages COVID-positive and unvaccinated illegals to FLOOD into our country, but he wants to fire American citizens from their job for not following his orders. He's America LAST!\nhttps://t.co/nOE5HNIKrZ","date":"Tue Oct 26 13:46:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden left billions in assets for the Taliban in Afghanistan, but wants to know the details on how you spend $600. ABSURD! I've joined @RepTomEmmer in sending a letter to Secretary Yellen DEMANDING this Administration DROP its proposal to SPY on Americans’ bank accounts. MORE ⬇️","date":"Mon Oct 25 16:30:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thanks to the Commander, @FlyNavy, and Vice Adm. Kenneth Whitesell for hosting me and my @HASCRepublicans colleagues last week. It was great to discuss how our forces are ready to respond to a conflict in the Indo-Pacific. Naval aviators are the best pilots out there!","date":"Sun Oct 24 20:33:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"There's NO reason to delay the reinstatement of President Trump's SUCCESSFUL Remain-in-Mexico policy! Biden is slow rolling it to give his \"future voters\" time to get in. This week, I supported @RepAndyBiggsAZ and @RepRosendale's discharge petition to make this policy law- NOW!","date":"Sat Oct 23 21:45:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RIDICULOUS! Biden's #BuildBackBroke agenda includes amnesty for up to 10 MILLION illegal immigrants, but doesn't include a dime for border wall construction, technology, or more Border Patrol agents. He's doing everything he can to keep the CRISIS at our southern border going!","date":"Fri Oct 22 18:53:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden and Garland are so out of touch! Instead of addressing REAL crises, they're bending to CORRUPT teachers unions (and Garland's son-in-law) to go after concerned parents for speaking out against the RACIST CRT. They're even calling parents \"domestic terrorists.\" TERRIFYING! https://t.co/AphVX4GS6e","date":"Fri Oct 22 13:44:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm PROUDLY cosponsoring @RepDrewFerguson's bill to STOP the IRS from spying on your bank accounts! On the House Floor today, Nancy Pelosi and her RADICAL Caucus blocked us from even voting on it. Why are Democrats fighting so hard to violate your privacy!? INSANE!","date":"Thu Oct 21 23:49:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The non-partisan @USCBOcostest confirmed Americans will be forced into government-run healthcare under Democrats' HUGE tax and spending bill! Socialized medicine is a HORRIBLE idea!!\nhttps://t.co/B1ixE7zeeU","date":"Wed Oct 20 21:44:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Sheppard has proven indispensable to America’s national defense, and I'm confident that'll continue for years to come!\n\nLearn more ⬇️\nhttps://t.co/7UXYzPxvpJ","date":"Wed Oct 20 19:29:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"NEW: @JohnCornyn, @SenTedCruz and I introduced a resolution honoring @SheppardAFB's 80th Anniversary and the 40th Anniversary of the Euro-NATO Joint Jet Pilot Training Program.","date":"Wed Oct 20 19:29:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DISGUSTING! Thomas Jefferson is a Founding Father and former President of this GREAT country. Why does the left want to ERASE American history? Their WOKE agenda knows no bounds. If we don’t speak up on nonsense like this, there’s no telling what’s next! https://t.co/iLo22l8fHl","date":"Wed Oct 20 00:48:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden is running this country into the GROUND! His \"Build Back Better\" agenda has incentivized people not to work, punished people with ILLEGAL vaccine mandates, and caused inflation to skyrocket. He inspires NO confidence in the American workforce or economy!","date":"Sat Oct 16 17:55:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@TexasPeanuts and @AgriLife recently unveiled a state-of-the-art peanut sheller in Vernon, which will have a HUGE impact on peanut production and quality in Texas. I know I speak for everyone in #TX13 when I say congratulations on this important accomplishment! https://t.co/l52dMuKrnZ","date":"Fri Oct 15 21:23:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's ILLEGAL vaccine mandate is going to crush an already failing economy! The cure CANNOT be worse than the disease! Today, I introduced the FREEDOM Act to oppose his mandate and show the American people how it'll impact the workforce and waste taxpayer dollars. Learn more ⬇️","date":"Fri Oct 15 14:25:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thanks Rear Adm. Timothy Weber, Capt. Kim Davis, and the entire team at @NMC_SD for a great visit!\n\nAs a Navy doctor, I know the importance of ensuring servicemembers get the best healthcare possible. @HASCrepublicans and I are committed to delivering for every servicemember! https://t.co/Nb4WDAfjoN","date":"Thu Oct 14 23:32:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Gas prices are up 42% from last year because of Biden's WAR on American energy! We've gone from energy independence to dependence on our adversaries in less than a year. My colleagues &amp; I are DEMANDING a return to pro-growth, pro-AMERICAN energy policies! \nhttps://t.co/M8ORPPKJWh","date":"Thu Oct 14 20:45:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 is home to many BRAVE heroes who have served our country in the U.S. military, and I want to make sure their stories are documented at the @LibraryCongress for generations to come. \n\nLearn more about the Veterans History Project at https://t.co/NI4O02Rcu2! https://t.co/6jOrlj0YFq","date":"Thu Oct 14 15:54:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Happy 246th birthday to the @USNavy! \n\nI am proud of my service in the Navy, so it was an honor to spend the day with some great Sailors at @NMC_SD! https://t.co/Sd90Gf0OqV","date":"Thu Oct 14 00:16:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you to my friends at the @WichitaFallsPD for giving me a tour of the Public Safety Training Center yesterday! I was also glad to see our officers receive new bulletproof vests, made possible by local nonprofit organizations. This community is truly special! #BackTheBlue https://t.co/w2V17mvP8s","date":"Wed Oct 13 21:10:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"OUTRAGEOUS! Pelosi is doubling down on a proposal that would allow the IRS to SPY on your bank accounts. This would be a serious invasion of privacy, and it's especially problematic given the IRS' history of targeting conservatives. We MUST fight back on this! https://t.co/WD48YRcTIk","date":"Wed Oct 13 15:27:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I couldn't be more proud to represent the top-rated ag district in Texas! On this #NationalFarmersDay, we say THANK YOU to the farmers of #TX13 who work so hard to feed and clothe the American people. I will ALWAYS have your backs in Congress!","date":"Wed Oct 13 00:56:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be in Canyon for West Texas’ WIN over San Angelo last night. Thank you to @WTAMU for having me! GO BUFFS! https://t.co/trgvlFreWh","date":"Sun Oct 10 17:55:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden’s solution for a failing economy? Fire hardworking people from their job for not following his ILLEGAL vaccine mandate. WORST President of my lifetime!","date":"Fri Oct 08 19:00:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DYK: All nuclear weapons are assembled and disassembled right here in #TX13! Thank you to Amarillo’s @PantexPlant for hosting me today. Their work keeps this country safe and I’m proud to defend their vital national security interests in Congress.","date":"Thu Oct 07 22:54:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"No wonder Attorney General Garland is sending the FBI after concerned parents who don't want their kids to be indoctrinated with woke garbage, he's probably advancing the family business! He's CORRUPT and abusing his power! https://t.co/6RsYHHZk20","date":"Thu Oct 07 00:40:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to see the Commander of Air Education and Training Command, Lt. Gen. Webb, at @JBSA_Official today! We had a great discussion about priorities for @SheppardAFB and AETC. The Air Force is lucky to have leaders like Lt. Gen. Webb! https://t.co/trz3vAqDlS","date":"Wed Oct 06 22:39:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today I toured @BrookeArmyMed with my good friend and fellow Texan, @RepTonyGonzales.\n\nAs the DoD's only level 1 trauma center, BAMC is one of the greatest assets DoD has. Our military's readiness depends on the HEROES who work here! Thank you for having me! https://t.co/nsF2YvVs27","date":"Wed Oct 06 19:18:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"NEW: @SenTuberville, @RepFilemonVela &amp; I introduced the FARM Act to counter foreign interference in the ag industry &amp; its supply chains.\n\nThis is a huge issue for #TX13, but it's also vital for our country. Food security IS national security! \n\nMORE ⬇️\nhttps://t.co/WFpuRe7hhI","date":"Tue Oct 05 16:14:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Is President Biden going to do ANYTHING about this? China knows they have a window of opportunity because Biden is too SCARED to confront China. This never would've happened under President Trump because China knew there would be serious repercussions. https://t.co/7GnaLV7aWP","date":"Mon Oct 04 21:19:06 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden said he wouldn’t mandate vaccines. He LIED!  Now he’s weaponizing the @USDOL to force people to get the vaccine or be FIRED from their job. I’ve signed on to @RepTenney’s bill that would put an END to this unconstitutional government overreach! https://t.co/vkdsgH7QMZ","date":"Sun Oct 03 22:07:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Inflation is skyrocketing, meanwhile Democrats are pushing the LARGEST tax and spend agenda in American history. Let me know what you think about their RADICAL agenda! Take this one question survey NOW ⬇️ https://t.co/KNfPS8x3KK","date":"Sat Oct 02 17:00:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m proud to join @RepJeffDuncan on this! Healthcare workers are the HEROES of this pandemic, and now Democrats want to demonize them and crush their livelihoods all because they won’t follow orders from politicians in Washington. This Administration should be ASHAMED!","date":"Fri Oct 01 21:48:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden has cut the U.S. Military out of the process to determine which Chinese Communist MILITARY companies the U.S. will sanction. It makes NO sense! Today I introduced legislation to ensure DoD remains a part of the conversation.\nhttps://t.co/u0l2WSwF5t","date":"Thu Sep 30 20:33:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m rooting for the Republicans in tonight’s Congressional Baseball Game for Charity! Proud to represent the @SodPoodles too! https://t.co/qGowyghmFm","date":"Wed Sep 29 23:30:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: As Afghanistan fell to the Taliban, Mr. Milley was focused on CRT, \"white rage,\" and other woke GARBAGE. The American people don't have any confidence left in him, and neither do I. He's a complete FAILURE and should RESIGN! https://t.co/IOVJ19E3q2","date":"Wed Sep 29 18:38:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"See my full statement: I have been and will continue to be 100% pro-2A, without ANY exceptions, and I will NOT support passage of red flag laws. Period. \nhttps://t.co/wuN95wVa8U","date":"Tue Sep 28 15:52:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Growing up in West Texas, I learned common sense from my parents. Only in Washington can politicians get away with saying \"let's not talk about numbers and dollars\" when referring to the LARGEST tax and spending bill in American history. Pelosi is RECKLESS and out of touch! https://t.co/NcAki0Fulq","date":"Mon Sep 27 23:32:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am adamantly OPPOSED to vaccine mandates! Your health decisions are between you and your doctor, NOT between you and Joe Biden. Let me know what you think about authoritarian vaccine mandates! Take this one question survey NOW: https://t.co/3NBauxHQan","date":"Sun Sep 26 18:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As much as Democrats and the media would love to move on from Afghanistan, Americans are STILL trapped and Joe Biden is doing NOTHING to get them out. He has left American citizens to fend for themselves against the Taliban, Al-Qaeda, and ISIS-K. SHAMEFUL!","date":"Sat Sep 25 14:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The same Democrats who claim to be champions for human rights just voted to legalize abortion up until a full-term baby is BORN. They’re also silent on the human rights atrocities being committed against women in Afghanistan because of Joe Biden. Total HYPOCRITES!","date":"Fri Sep 24 17:05:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: I believe our relationship with Israel is non-negotiable! I'm urging my colleagues to vote in favor of my amendment to the NDAA which makes clear that Israel is a CRITICAL defense partner! https://t.co/RIo88p2Y5x","date":"Thu Sep 23 14:51:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Language I authored to secure disaster recovery funding for farmers PASSED the House last night! I am proud to have led this important WIN for our farmers, but know that I will not stop here. I will ALWAYS champion Texas’ ag priorities in Congress! MORE ⬇️\nhttps://t.co/I2VSgxZhHU","date":"Thu Sep 23 01:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a father and a doctor, it sickens me that @PittTweet used the body parts of aborted babies who were possibly BORN ALIVE for research!\n\nI'm proud to join my colleagues in DEMANDING a full investigation. The sanctity of human life must be protected!\n\nhttps://t.co/AqndVAjUsH","date":"Wed Sep 22 20:22:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was sad to learn of Deputy Chief Richard \"R.W.\" Smith's passing. He selflessy served the Wichita Falls community for over 38 years and I know that the legacy he left will NEVER be forgotten.\n\nMy prayers are with his family, friends, and @WichitaFallsPD colleagues.","date":"Wed Sep 22 15:31:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Pelosi CAVED to the anti-Semites in her caucus and stripped funding for Israel's Iron Dome, which has saved countless lives from TERRORIST attacks! We can't find money for the Iron Dome, but we can give money to the Taliban?\n\nI will ALWAYS stand with Israel!","date":"Tue Sep 21 18:25:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"GREAT NEWS! Language that I authored to reauthorize and extend the CHIP IN Act PASSED the House! For too long, VA hospitals in rural areas haven't been prioritized for modernization projects.","date":"Tue Sep 21 15:26:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My language will change that by allowing the VA to accept donations from non-federal entities for major construction projects! Learn more about this HUGE win for veterans in #TX13. ⬇️\nhttps://t.co/TYBKs7YHXy","date":"Tue Sep 21 15:26:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If it’s true that General Milley undermined his Commander-in-Chief and colluded with one of our greatest adversaries, he doesn’t just deserve to be fired — he should be in PRISON! We need the facts NOW! Congress should launch an investigation IMMEDIATELY! \nhttps://t.co/VDkVf1vGvr","date":"Mon Sep 20 23:50:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The people of Howardwick are true PATRIOTS! They believe in the same things I do- hard work and fighting back against liberal NONSENSE! It was great to visit with them for their Taco Town Hall. Thank you for having me! https://t.co/FVB7IR61xd","date":"Mon Sep 20 00:43:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I had a great time with my boys in Canadian on Tuesday. Thank you to Jason Abraham for taking us out to the aerial range! https://t.co/z9KSHQh91t","date":"Sat Sep 18 18:52:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"There’s NOTHING like Friday Night Lights in Texas! Great to be in Pampa tonight for their game against Randall. Thank you for having me as an honorary official! #TX13 https://t.co/gnwxXqoloM","date":"Sat Sep 18 01:55:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden and his DISASTER of an administration are owned by the Chinese Communist Party! How SAD that selling out to Communists is more important to Blinken and Biden than standing up for the pro-democracy citizens of Hong Kong.","date":"Fri Sep 17 19:43:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I started off #ConstitutionDay2021 with the students at @CCDawgs. The Biden Administration has chosen to ignore the Constitution at every turn, so it's on US to defend the 234-year-old document that helped build the BEST country on earth! Thank you for having me! https://t.co/2dcQL3VmjR","date":"Fri Sep 17 16:10:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s easy to see what makes Gainesville so special- the people. It was great to visit with local leaders for lunch at Smokehouse BBQ then for a tour of the Police and Fire departments with the chiefs today! https://t.co/L6gjlxfnxu","date":"Fri Sep 17 01:05:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#BidensBorderCrisis is STILL getting worse.\n\n📌43,941 illegals released into the U.S. in Aug.\n\n📌208,887 border apprehensions in Aug., 317% INCREASE from last year\n\n📌Over 1.2 MILLION illegals apprehended since Feb. 1\n\nHow much worse does it have to get before he DOES SOMETHING!?","date":"Thu Sep 16 20:18:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden &amp; the State Department ABANDONED Mariam and her 3 children in Afghanistan, but thankfully my team was able to facilitate their escape with a brave team of veterans on the ground. \n\nThey’re back home in Amarillo, &amp; Mariam is ready to share her story with all of you. WATCH ⬇️ https://t.co/KwJBPvDZ1V","date":"Thu Sep 16 16:34:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If this is true, it’s TREASON! I’m calling for a Congressional inquiry and investigation IMMEDIATELY!\n\nhttps://t.co/KwIlUYaGHm","date":"Wed Sep 15 01:53:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I won’t sit quietly while Biden tries to build his socialist agenda on the backs of farmers and ranchers in #TX13! They would be CRUSHED by the Democrats’ RADICAL death tax proposal, forcing many to leave their family’s life work behind. Not on my watch!","date":"Tue Sep 14 20:29:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I had a great evening with @TexasFarmBureau members from all across the Panhandle last night. No matter what happens in Washington, I’ll ALWAYS have their backs! https://t.co/XcxrKEtzaR","date":"Tue Sep 14 15:03:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: Today I questioned @SecBlinken on the complete incompetence he has displayed throughout the crisis in Afghanistan. American citizens are trapped behind enemy lines and all he wants to do is pat himself on the back for a job HORRIBLY done! He needs to RESIGN! https://t.co/wkKQWqubhX","date":"Tue Sep 14 02:55:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We’ll #NeverForget those who lost their lives on September 11, 2001. America’s resolve was tested in an unprecedented way, but the bravery shown by first responders and selfless civilians that day is emblematic of the spirit of America. A spirit that will NEVER be broken. 🇺🇸 https://t.co/pfnO3l8pJM","date":"Sat Sep 11 13:51:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a physician, I would NEVER advise a patient to trust politicians in Washington over medical advice from a doctor who knows them and their medical history. Rest assured, I have and will continue to fight back on Biden’s UNCONSTITUTIONAL vaccine mandates!","date":"Sat Sep 11 00:26:06 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden’s authoritarian announcement to impose illegal vaccine mandates on businesses is chilling. The decision to get vaccinated should be between you and your doctor, not illegally mandated by President Biden. This is OUTRAGEOUS!","date":"Fri Sep 10 01:52:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As Conservatives, we MUST push back on the liberal takeover of America! Biden nominated gun-grabbing liberal David Chipman to lead the @ATFHQ, but his nomination was just withdrawn because WE fought back. Our #2A rights aren't up for debate, they're enshrined in the Constitution!","date":"Thu Sep 09 18:50:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The interim Taliban government includes former GITMO detainees and a terrorist wanted by the FBI. Biden gave up every strategic advantage the U.S. had in Afghanistan, and now he's forced to rely on people who want to wipe America off the map to get our people home. NOT GOOD! https://t.co/73nPuxQG5w","date":"Wed Sep 08 23:17:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It took a private operation facilitated by my office and BRAVE veterans on the ground to get my constituents out of Afghanistan. The State Department FAILED to help these Americans. I'm DEMANDING an explanation from @SecBlinken when he testifies before @HouseForeignGOP next week! https://t.co/U7X16b7Qf5","date":"Wed Sep 08 13:45:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What a coward! Come sit before my committee and explain what you were thinking when you got 13 brave Americans killed and left hundreds to fend for themselves against the Taliban and ISIS.","date":"Tue Sep 07 20:07:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This article makes me want to PUKE! The State Dept didn’t do a damn thing for these people for 12 days except almost get them killed repeatedly. I know, because my office and the team on the ground led by Cory Mills &amp; @RepMullin facilitated their escape every step of the way.","date":"Mon Sep 06 17:53:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"After 2 weeks &amp; multiple life threatening attempts, I am overjoyed to share that 4 U.S. citizens from #TX13 were part of the first successful ground evacuation since the U.S. left Kabul. Thank you to Cory Mills &amp; the other patriots on his team for saving these BRAVE Americans! https://t.co/1Tv9KRUgcE","date":"Mon Sep 06 14:18:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The people of #TX13 will ALWAYS stand with America’s heroes! https://t.co/U0y4vJ126i","date":"Sun Sep 05 16:58:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The day that 13 service members lost their lives in Afghanistan, I was in Nocona for a town hall at the VFW and a hospital tour. I got back to DC to address the crisis, but I’ll never forget experiencing that heartbreak with my constituents.","date":"Sun Sep 05 16:57:37 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Taliban is refusing to let Americans leave Afghanistan via private flights until their government is formed. \n\nMark my words: These TERRORISTS will demand Biden recognize them in order to get our citizens back. We should’ve NEVER been in this situation to begin with! https://t.co/MqZ6qMaDJa","date":"Sat Sep 04 20:12:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My DC, Amarillo, &amp; Wichita Falls offices put a yellow ribbon up in honor of our fellow citizens who are being held HOSTAGE in Afghanistan because Biden left them behind.\n\nWe are still working on getting our constituents home, but this isn’t over yet. Don’t let Biden forget them! https://t.co/ivLo8p3hiS","date":"Fri Sep 03 23:03:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'll be placing a yellow ribbon on my office door to honor the American HOSTAGES still trapped behind enemy lines in Afghanistan &amp; I hope you'll join me. I know I speak for millions of Americans when I say we will NOT forget! We MUST get them home! How does Biden sleep at night?","date":"Fri Sep 03 19:00:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"For starters, Taliban TERRORISTS wouldn't be parading around with U.S. military equipment and American citizens wouldn't be trapped in Afghanistan with no help from the federal government.","date":"Fri Sep 03 15:24:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I recently learned that @SheppardAFB needed a new child development center, so I immediately began working with the Air Force on this. Today, I'm proud to share that I've secured $20M in authorized funding for the new center in the NDAA. I'll NEVER stop fighting for #TX13!","date":"Thu Sep 02 21:58:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I support women in our voluntary military. However, last night I voted NO on a Democrat amendment to require all women to register for the draft. The Texans I represent feel the same way I do. We will NEVER be ok with forcing our daughters and granddaughters to die in war!!","date":"Thu Sep 02 17:55:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: My amendment to STOP Biden from transporting American money or any other item of value to the Taliban PASSED &amp; is included in the NDAA.\n\nBiden has been coordinating with Taliban TERRORISTS already &amp; I'm NOT going to sit around to see how bad it'll get! @HASCRepublicans https://t.co/HbnZCgX0xB","date":"Thu Sep 02 16:03:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"NEW: The National Defense Authorization Act just passed @HASCRepublicans 57-2!","date":"Thu Sep 02 07:02:13 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"GREAT news! My amendment to support the workforce at Pantex in Amarillo passed in our NDAA markup today. This will ensure Amarillo remains a critical part of the U.S. nuclear security enterprise for generations to come. #TX13 @HASCRepublicans","date":"Wed Sep 01 22:54:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I don't want to hear anything from either one of them besides: \"I RESIGN!\"","date":"Wed Sep 01 17:49:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"These are the people Biden armed with $85 billion worth of taxpayer-funded military equipment and he wants to continue giving our money to them. \n\nhttps://t.co/8nkssBlm3U","date":"Wed Sep 01 17:15:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My colleagues and I are asking a very simple question of Joe Biden: What is your plan to get Americans out of Afghanistan?\n\n#TX13 constituents are STILL trapped, including a woman and three young children. I’m demanding ANSWERS! https://t.co/HEIP4kuHm9","date":"Wed Sep 01 01:31:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: Taliban TERRORISTS survey their new U.S. weapons and show off piles of American money. \n\nJoe Biden left it for them and it MAKES MY BLOOD BOIL! https://t.co/zCt7as82q4","date":"Tue Aug 31 20:16:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The State Department should be ASHAMED! My team is STILL working around the clock to try and help constituents get out of Afghanistan because the State Department had no problem leaving them behind. They’re useless! https://t.co/WepbJGXpkh","date":"Tue Aug 31 13:00:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden not only left our citizens behind, he left our highly trained service dogs behind too! SICK! https://t.co/u1t6bMTJJ0","date":"Tue Aug 31 03:28:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The U.S. may have ended its presence in Afghanistan tonight, but I’m afraid the War on Terror is far from over because of Biden’s botched withdrawal. Thank you, @GOPLeader, for gathering veterans of our conference to discuss a way forward. Our leader is here, where is Pelosi? https://t.co/d1g5WmNzLS","date":"Mon Aug 30 23:29:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"God bless our neighbors in Louisiana. We are praying everyone is safe. Standing by to do what we can to help with recovery efforts!","date":"Mon Aug 30 20:50:22 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden said Al Qaeda isn’t in Afghanistan. He is wrong, per usual. Make no mistake, Biden’s decision to embolden Al Qaeda in Afghanistan will have serious national security implications for years to come.","date":"Mon Aug 30 17:59:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m here at the Capitol because there’s a crisis going on. WHERE is Nancy Pelosi? Americans are still TRAPPED in Afghanistan, including #TX13 constituents. The State Department isn’t helping them get out and the Taliban has threatened them. SERIOUS work needs to get done! Now! https://t.co/fSWTMtiijL","date":"Mon Aug 30 15:46:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Apparently our Commander-in-Chief has better things to do than honor the 13 service members who died on his watch? I’m DISGUSTED! God bless these heroes and their loved ones. They deserved better. https://t.co/Ciuymtby3N","date":"Sun Aug 29 20:20:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We will never forget those who made the ultimate sacrifice on that fateful day. Please keep the families, friends, and fellow service members of our fallen HEROES in your prayers.\nhttps://t.co/AvYHLRPUvw","date":"Sun Aug 29 00:37:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden has failed miserably as Commander-in-Chief, and he got service members killed in the process. He MUST be held accountable. @RepTenney and I are demanding that impeachment proceedings begin!","date":"Fri Aug 27 23:57:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Outrageous! Meanwhile, I have constituents who are STILL trapped. The U.S. should NOT leave Afghanistan until ALL Americans have made it home.","date":"Fri Aug 27 20:41:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Praying for our troops, American citizens who are trapped, and the innocent Afghans who were affected by today’s attack in Kabul. God bless!","date":"Thu Aug 26 15:21:13 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Pelosi should be ASHAMED that she brought the House back to DC to lay the groundwork for her $3.5 TRILLION socialist wish list rather than to address Biden's hostage situation in Afghanistan! By her definition, \"that's a good day in Congress.\" SICK! https://t.co/w7WoeIuFQU","date":"Wed Aug 25 21:06:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If you needed proof that mask mandates aren’t about science look no further than Oregon’s ridiculous OUTDOOR mask mandate. It’s just about CONTROL for Democrats! https://t.co/RSzkVUprqo","date":"Wed Aug 25 16:55:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden thanked Democrats for voting in support of H.R. 4 – Federal Control of Elections, but that vote hasn't happened in the House yet.\n\nI've called on Biden to take a cognitive test for a long time, but at this point it is OBVIOUS he isn't all there. RESIGN!","date":"Tue Aug 24 21:41:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The crisis in Afghanistan is only just beginning. Joe Biden got us into this mess and he isn’t cognitively capable of getting us out of it. He MUST resign! https://t.co/yZE6gTXsdC","date":"Tue Aug 24 15:33:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden isn’t fit to be our Commander-in-Chief. RESIGN NOW! https://t.co/sShgpdNT0O","date":"Tue Aug 24 13:08:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I got the vaccine and I continue to encourage people to speak with their doctor about whether the vaccine is right for them.\n\nYour health decisions are between you and your doctor NOT between you and Joe Biden! PERSONAL CHOICE! https://t.co/nHUY13Ynni","date":"Tue Aug 24 02:11:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"How does Biden sleep at night knowing he let this happen? It makes me SICK!","date":"Mon Aug 23 21:30:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Meanwhile, one of America's most wanted terrorists was seen carrying a U.S. weapon in Kabul, the Taliban held a parade to show off U.S. military equipment, and they've released propaganda photos wearing OUR uniforms.","date":"Mon Aug 23 21:30:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Pentagon doesn't know exactly how much U.S. military equipment is in Taliban hands and they have no policy solutions to address this problem going forward. https://t.co/KBZwkqGQD0","date":"Mon Aug 23 21:30:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: #TX13 constituents, including a woman &amp; 3 small children, experienced this at a check point outside of the Kabul airport Wednesday.\n\nThey’re AMERICAN CITIZENS with passports. They’ve gone back each day &amp; waited, but haven’t been let into the airport. They’re STILL trapped! https://t.co/X2fgfe1Dke","date":"Fri Aug 20 18:18:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Can somebody please tell Biden and the Democrats that getting Americans home safely from Afghanistan is infrastructure, part of the Green New Deal, a key component of Critical Race Theory, or vital to defund the police. \n\nMaybe then they will DO SOMETHING!","date":"Fri Aug 20 16:27:22 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Heartbreaking. The Taliban has seized U.S. weapons &amp; equipment for TERRORIST activities.\n\nMANY served in the War on Terror, including myself, to prevent something like this. Some gave their lives. The fact that Biden let this happen is a slap in the face! https://t.co/TYxFLew2cY","date":"Fri Aug 20 00:44:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Who knew a 1.5 minute interview clip could be so egregious...\n\n1. Biden doesn't know what day of the week it is, per usual.\n\n2. Biden thinks he has gained control of the situation, FALSE!\n\n3. Biden refuses to take responsibility for his FAILURES.\nhttps://t.co/Gd0jHH8q5W","date":"Wed Aug 18 21:41:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am proud to be joining my colleagues in DEMANDING answers from the DOJ as to why this case was dropped!\nhttps://t.co/of3TAjMIGu","date":"Wed Aug 18 00:41:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Admin dropped a lawsuit against the University of Vermont Medical Center for FORCING a nurse to perform an abortion despite her beliefs.\n\nBiden continues to prove he is not a President for ALL and will abandon any American who does not agree with his anti-life agenda!","date":"Wed Aug 18 00:41:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be with my friends of the @AQHA this weekend to honor the 2020 and 2021 Hall of Fame classes. \n\nCongratulations to my friends, Johnny Trotter and Dr. Glenn Blodgett, on their induction! #TX13 https://t.co/7KNAnqlan5","date":"Tue Aug 17 01:29:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Common sense to most members of the Military, but apparently over the heads of the amateurs in the West Wing. #Afghanistan","date":"Mon Aug 16 18:05:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a member of @HASCRepublicans and @HouseForeignGOP, I’ve been advocating for MONTHS to leave a small contingency at #Bagram to serve as a quick reactionary and counterterrorism force to PREVENT this exact situation.","date":"Mon Aug 16 18:05:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"CONGRATS, BIDEN! Your legacy will be the savage abuse &amp; slaughter of innocent Afghan women &amp; children. Some of which will be accomplished with U.S. weapons &amp; equipment YOU left them.\n\nWhat’s unfolding is a result of your  failed, “woke” leadership. You’re an EMBARRASSMENT!","date":"Sun Aug 15 22:15:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Remember when Obama's Secretary of Defense said Biden has been “wrong on nearly every foreign policy and national security issue over the past four decades.\" It turns out he was spot on.\n\n https://t.co/g4yrf3Ppdy","date":"Sun Aug 15 18:44:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In public @SecMayorkas praises Biden’s open border agenda, but behind closed doors he knows it's unsustainable.\n\n@CBP saw a RECORD 212,000 illegal border crossings in July. Why isn't the Administration taking action? Because it was their plan all along!\nhttps://t.co/F4cP6yspJ7","date":"Sat Aug 14 21:13:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Calling all #TX13 middle/high school students who are interested in applying to a U.S. Service Academy! \n\nOn Aug. 28 I am co-hosting a Service Academy Day with several of my colleagues. Come meet with Academy reps to learn more about the schools &amp; application process!\n\nMORE ⬇ https://t.co/xpfSR4VIQ9","date":"Fri Aug 13 15:28:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If you're an American citizen you have to prove you don't have COVID to come home to the U.S., but if you're an illegal immigrant that doesn't apply.\n\nMy colleagues and I are DEMANDING answers. What are you doing to stop the HYPOCRISY and protect public health, @SecMayorkas!?","date":"Thu Aug 12 17:32:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We’re already seeing horrific consequences from Joe Biden’s RECKLESS approach to the Afghanistan withdrawal, and it’ll only get worse.\n\nHis legacy will be defined by the oppression and slaughter of INNOCENT Afghan women and girls.  Disgusting! \nhttps://t.co/5XquVWQNpk","date":"Wed Aug 11 20:52:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Veterans who live in rural areas have long been left behind by the VA, but NO MORE!\n\nI'm proud to be leading 80 of my colleagues in a bipartisan effort to get Secretary McDonough to prioritize improving care for rural veterans. Our heroes deserve the BEST!","date":"Wed Aug 11 17:53:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Learn more ⬇️\nhttps://t.co/dOoMDXH2kp","date":"Wed Aug 11 17:53:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Let us never forget the MANY senior citizens Andrew Cuomo sent to die in New York nursing homes, and then he covered it up.\n\nTheir families never got to say goodbye. \n\nTheir families never got answers.\n\nThis is NOT over!","date":"Tue Aug 10 20:18:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Meet Biden's ATF nominee David Chipman:\n\n• Wants to shred your constitutional right to bear arms\n• Has starred in Chinese Communist Party propaganda and lied about it\n\nThis is DEFINITELY NOT someone who needs to be at the helm of ANY government agency!\nhttps://t.co/8aK6TUOBHS","date":"Mon Aug 09 21:06:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Move-in week finally came for @TTUVetMed! It’s exciting to see this program officially take off after visiting the construction site in February. \n\nCongratulations to everyone who made it happen!\nhttps://t.co/iwZEDqTbgf","date":"Sun Aug 08 21:56:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be in Hereford this week for the Spicer Gripp Memorial Youth Foundation’s kick off event. \n\nThe scholarships they offer have and will continue to change the lives of many young people in our area who’ve chosen a career field in agriculture at @WTAMU! https://t.co/x1tymYlegz","date":"Sat Aug 07 17:16:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Despite growing evidence that COVID was leaked from a Wuhan lab and covered up by China, the mainstream media STILL doesn't want to talk about it. \n\nCOVID has killed millions and devastated the global economy. What do they not want us to know?\nhttps://t.co/DkX3CvFjrd","date":"Fri Aug 06 17:44:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The 17th Annual West Texas Legislative Summit was a HUGE success! Thank you to @RepPfluger for hosting us in San Angelo and for inviting me to join a panel on ag.\n\nI'm so proud to be a Texan and to serve alongside CHAMPIONS for Texas' priorities in Congress! #TX13 https://t.co/rtG0wYPxTD","date":"Thu Aug 05 20:09:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Well, what do you know... AOC joins the long list of Democrats who don't follow their own RIDICULOUS mask standards except for when it makes for good theater. They do this because they know it's not about science, it's about CONTROL!","date":"Thu Aug 05 14:43:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden has FAILED us! He criticizes Texans because we won’t support his stupid mask mandate while his administration dumps thousands of COVID-positive illegals into our state. \n\n#BidensBorderCrisis is OUT OF CONTROL!","date":"Wed Aug 04 20:56:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration is HIDING information about the COVID crisis among illegals at the border because they don't want us to know the truth:\n\nThey’re using COVID to justify communist control over our lives while encouraging COVID-positive migrants to come here illegally.","date":"Tue Aug 03 16:49:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We in the @GOPDoctors Caucus are demanding ANSWERS! ⬇️\nhttps://t.co/deXrwyDRON","date":"Tue Aug 03 16:49:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats need to get their head out of the sand and DO SOMETHING about #BidensBorderCrisis!\n\nThe humanitarian and public safety threats at the border are getting worse by the day and Democrats who control the House, Senate AND Oval aren’t even talking about it. OUTRAGEOUS!","date":"Mon Aug 02 16:51:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Joe Biden has politicized the CDC, NIH and FDA beyond recognition. It's time for a CHECK UP! \n\nI've co-sponsored @RepBobGood's legislation that will examine exactly what's going on here. They've continuously let us down and need to be held ACCOUNTABLE! \nhttps://t.co/Qboy7Rt28l","date":"Mon Aug 02 00:26:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I encourage the veterans and first responders in #TX13 to call the War Memorial Center at 806-350-8387 for more information and to reserve your spot before September 1!","date":"Sat Jul 31 20:01:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: The Texas Panhandle War Memorial Center is hosting their third Center for Brain Health/Brain Performance Institute Seminar on September 21 and 22!","date":"Sat Jul 31 20:01:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats went from \"follow the science\" to \"follow Pelosi\" REAL quick. More people have been MURDERED in DC than have died from COVID in the last few weeks, but the only thing the LAZY DC Mayor has done is institute a ridiculous mask mandate. \n\nPEOPLE ARE DYING, MURIEL! https://t.co/eLjYojOhjq","date":"Fri Jul 30 19:02:12 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Dr. Monahan, the House Attending Physician, has proven he won't make decisions based on objective data or solid clinical science. \n\nInstead he is joining the ranks of Dr. Fauci as yet another unelected politician with M.D. behind their name who functions as a puppet for Pelosi.","date":"Fri Jul 30 15:48:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Apparently the science changes between the House and Senate chambers. I’m on my way to the Senate floor with a group of my colleagues to join @SenMikeLee as he gives a speech on the ABSURDITY of the House mask mandate. https://t.co/YWbH4KvUwa","date":"Thu Jul 29 19:56:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"HUGE NEWS — My amendment just passed in the House! This is a BIG win for the many conservatives who have been unfairly targeted by the IRS!\n\nThank you, @taxreformer, for leading a coalition letter in support of my amendment. Check it out → https://t.co/abNCK6NE1z","date":"Thu Jul 29 17:53:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: Democrats back Iran, the world's leading state sponsor of terrorism.\n\nI introduced an amendment that would've made sure Biden couldn't work with a regime that's planning attacks on American soil and developing nuclear weapons, but Democrats voted it down. \n\nI wonder why? https://t.co/benyCgQ8vm","date":"Thu Jul 29 14:41:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Remember the Lois Lerner scandal? Unelected bureaucrats at the IRS have a disturbing history of using their \"power\" to target conservatives. NO MORE!\n\nPeople should NOT be silenced because of their political beliefs. My amendment will make sure it NEVER happens again at the IRS! https://t.co/NOt0V6yymB","date":"Wed Jul 28 16:15:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am committed to being a part of the solution so we can make sure our farmers and ranchers emerge from these setbacks stronger than ever before.\n\nLearn more → https://t.co/txwDmx7XCe","date":"Wed Jul 28 01:02:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: Language from my bipartisan RESTORE Act has been included in a larger @HouseAgGOP disaster relief bill!\n\nThe ag community has been through a lot in the last year due to market turmoil caused by COVID-19 and disastrous weather events.","date":"Wed Jul 28 01:02:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"First it was “get the vaccine so we can get back to normal.”\n\nNow, it’s “get the vaccine and put your mask back on.”\n\nWhen asked why, the Biden Admin essentially says “because we said so.”\n\nRidiculous! Next they’ll push for more lockdowns. Don’t buy into their fear mongering!","date":"Tue Jul 27 21:49:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WOW! Over 50,000 illegal immigrants have been released into the U.S. without a court date, and those are only the ones we know about.\n\n#BidensBorderCrisis is OUT OF CONTROL, meanwhile Biden and Harris are ignoring it and the media just lets them get away with it. Disgusting!","date":"Tue Jul 27 19:02:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"But if you’re an illegal immigrant the Biden Administration will welcome you with open arms at our southern border despite the fact that COVID cases among illegals are up 900%. Total hypocrites!\n\n#BidenBorderCrisis \nhttps://t.co/MQJfZf5kjK","date":"Mon Jul 26 18:39:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrat \"leaders\" are so proud of themselves for being woke by defunding the police that they don't seem to care that their constituents are less safe as a result.\n\nCrime is on the rise in these cities and Congress needs to ACT for the safety of the American people!","date":"Sun Jul 25 20:16:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm leading an amendment that would END federal funding for cities that have foolishly defunded their local police.\n\nI would hope the possibility of losing federal resources would motivate city officials to give our BRAVE law enforcement officers the support they DESERVE!","date":"Sun Jul 25 20:16:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Cuomo killed them, Biden buried them!\nhttps://t.co/p0vYw2aA6N","date":"Sat Jul 24 16:54:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are quick to push arbitrary COVID rules on Americans while pushing an open border agenda that includes placing COVID-infected illegal immigrants all over this country. They’re total hypocrites! \n\n#BidensBorderCrisis https://t.co/W8j26LfbAr","date":"Fri Jul 23 21:26:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I introduced an amendment that would END entitlement funding for illegal aliens. American taxpayers should NOT be forced to foot the bill for people who are living in this country illegally!\n \nDo you want to financially support illegal aliens? Let me know: https://t.co/z2LFxSxh3p","date":"Thu Jul 22 23:10:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Trump achieved the impossible, #OperationWarpSpeed delivered several vaccines in record time.\n\nPresident Trump, @SteveScalise &amp; I got the vaccine because it made sense for us. Everyone should speak with their doctor about their own risk-benefit factors! PERSONAL CHOICE! https://t.co/tNjbYyPUdh","date":"Thu Jul 22 18:53:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"@JakeSherman Yes, per the video.","date":"Thu Jul 22 14:55:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden wants to send officials door to door to check people's vaccine status and the media eats it up. Meanwhile, the media takes the TX Democrats at their word on being vaccinated even though they're responsible for a superspreader PR stunt that reached the VP's office. Crazy!","date":"Thu Jul 22 14:47:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"6 months of the Biden/Harris illegal immigration agenda:\n\n❌Encounters up 450% in June compared to June 2020\n❌FOUR straight months of 170K+ apprehensions\n❌CBP seized more fentanyl so far in 2021 than ALL of 2020\n❌COVID cases among illegal immigrants up 900% in the RGV https://t.co/WtwuTA33Ix","date":"Wed Jul 21 23:00:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Learn more about the RESTORE Act, my bipartisan legislation that will help cotton growers in particular recover from disasters → https://t.co/6wb0OOfA2m","date":"Wed Jul 21 20:13:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As the SECOND biggest cotton district in the U.S., #TX13 plays a huge role in clothing our nation. \n\nIt was great to meet with the Plains Cotton Growers yesterday to discuss ways Congress can help this vital industry overcome market turmoil caused by COVID and natural disasters. https://t.co/m3QN0J8Koo","date":"Wed Jul 21 20:13:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas Democrats’ DC vacation has been a disaster! They wanted their 5 minutes of fame but all they’ve done is embarrass themselves and neglect their constituents. \n\nWhen their quarantine is up they need to GET BACK TO WORK! Only politicians can get away with not doing their JOB! https://t.co/laq9EiQ2Uy","date":"Wed Jul 21 15:02:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've long said that #BidensBorderCrisis is a serious public health threat, and it's getting WORSE. \n\nCOVID cases are surging at the border, yet nothing is being done to stop the record influx of illegal immigrants. WHERE is the leadership?!","date":"Tue Jul 20 23:18:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This is a HUGE win for common sense. The American people spoke up and the government had no choice but to listen.\n\nThe American people will ALWAYS know what's best for their children better than the federal government ever will!","date":"Tue Jul 20 17:49:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats will push for renewed lockdowns and mask mandates while letting #BidensBorderCrisis spiral out of control. \n\nOnly about 20% of illegals arriving at our southern border are vaccinated yet Biden wants to continue his open borders agenda. Hypocrite!","date":"Tue Jul 20 14:19:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"No kidding! Because President Trump spoke up on the Wuhan lab leak theory early on, the WHO and Democrats shut down the conversation instead of calling for an HONEST investigation.\n\nThe American people are tired of the games. We deserve ANSWERS!\nhttps://t.co/N4o6Pc7VMf","date":"Mon Jul 19 21:01:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Athletes who disrespect our GREAT country should NOT have the honor of representing Team USA! \n\n@USOPC_News MUST enforce Article 50, which prohibits political demonstrations at the Olympics.\n\nI sent a letter to USOPC leaders saying just that!\nhttps://t.co/LVA6rJE8ay","date":"Mon Jul 19 17:36:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The dangerous drugs pouring across our southern border aren’t just staying in border states.\n\nThey’re coming to a community near you because Joe Biden and Kamala Harris REFUSE to protect the American people from the cartels. SHAMEFUL!\n\n#BidensBorderCrisis","date":"Mon Jul 19 13:54:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WOW! Black Lives Matter and AOC are blaming Cuba's problems on America instead of the FAILURES of communism. \n\nOf course they are! They still want America to live under communist rule.\n\nhttps://t.co/S0sz92thlI","date":"Sun Jul 18 16:43:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be in Wichita Falls last night for the 40th Anniversary of the Texas Ranch Roundup! This community event showcases the hard work of TRUE cowboys and life on the ranch. A great time was had by all! https://t.co/rgZAjGWV8p","date":"Sat Jul 17 21:02:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Welcome to @SheppardAFB, Brigadier General Lyle Drew! We are excited to have you here in #TX13. I look forward to working with you!\n\nThank you to Brigadier General Kenyon Bell for his service at Sheppard. I wish you well in your new role!","date":"Sat Jul 17 15:01:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The law enforcement community has my full support as they deal with this unspeakable tragedy. \n\n#BackTheBlue\nhttps://t.co/JxnVnJuzeW","date":"Fri Jul 16 23:32:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Praying for the family, friends, and fellow officers of Sgt. Josh Bartlett who lost his life in the line of duty yesterday, and I’m wishing the 3 other officers injured a speedy recovery.","date":"Fri Jul 16 23:32:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"According to the White House, you should be banned from ALL social media accounts if you share “misinformation.”\n\nRemember when conservatives were censored for discussing the COVID lab leak theory? \n\nRemember when the @nypost was censored for a bombshell report on Hunter Biden?","date":"Fri Jul 16 19:46:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"BOTH of these stories turned out to be valid but had everyone discussing these topics online lost access to ALL of their social media accounts, the world would’ve never known. \n\nCensorship is WRONG!","date":"Fri Jul 16 19:46:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"For 40 years the bipartisan Hyde Amendment has prevented taxpayer funded abortions, saving countless lives. Democrats are now working overtime to make sure it's stripped away.  \n\nTHAT is today's Democrat Caucus.\n\n#HydeSavesLives https://t.co/pgJBNsHGVF","date":"Thu Jul 15 21:46:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden on foreign policy: Mess with America and we'll give you whatever you want! \n\nWhat a JOKE! The Iranian regime is planning attacks on American soil, yet Biden is still doing whatever he can to get us back into the DISASTROUS Iran Nuclear Deal.\nhttps://t.co/zGETpq09va","date":"Thu Jul 15 00:01:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"With the formal opening of @UAEinIsrael, today marks a historic day for Middle East relations.\n\nThanks to President Trump's #AbrahamAccords, Israel is working together with Arab countries for the first time. What a legacy he left!\nhttps://t.co/SQ21FKTzlE","date":"Wed Jul 14 20:02:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In response to my efforts, I'm proud to share that the Office of Management &amp; Budget has agreed to back off of a TERRIBLE proposal that would've stripped @CityofWF of its MSA status and, in turn, its eligibility for certain federal funding.","date":"Wed Jul 14 17:03:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I will not sit back while Washington bureaucrats look for ways to deny #TX13 resources! Learn more about my efforts to STOP the Biden Administration from hurting our local communities ➞ https://t.co/np4FCRkch9","date":"Wed Jul 14 17:03:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Learn more ⬇️ https://t.co/VmGCRLWxBH","date":"Tue Jul 13 18:34:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"NEW: I introduced legislation in Congress today that will help VA facilities in #TX13 fund new construction projects.\n\nModernizing aging VA infrastructure will directly improve the quality of care offered to our veterans and public-private partnerships are the way to get it done!","date":"Tue Jul 13 18:34:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Prices are rising at the “fastest pace in nearly 13 years.” Meanwhile, the Biden Administration and Democrats in Congress plan to ram through trillions in reckless, unilateral spending this year.\n\nInflation will only get worse, CRUSHING the middle class!\nhttps://t.co/oYx7BkBaIt","date":"Tue Jul 13 13:56:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas Democrats couldn’t be more out of touch. \n\nThey’re fleeing their responsibilities as legislators on private planes and they’re also maskless even though every other American still has to wear a mask on airplanes.\n\nTotal hypocrites! Work FOR the people, not against them!","date":"Tue Jul 13 01:16:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"According to the liberal hacks at The New York Times, calling for FREEDOM is \"anti-government.\" They aren't even trying to hide their support for communism. Who is surprised? I'm not!","date":"Mon Jul 12 19:03:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I couldn't agree more, TEXAS is a GREAT musical and I'm proud to say it's home to #TX13!\n\nNo politically correct nonsense — just an accurate portrayal of history. Everyone should see it!\nhttps://t.co/Knezk0O59e","date":"Sat Jul 10 22:23:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It's absolutely NOT the government's business to know who has been vaccinated.\n\nDemocrats want to control every aspect of our lives and it's not right. The American people don't need the federal government tracking them!","date":"Fri Jul 09 15:03:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The illegal drugs being smuggled in at our southern border are coming to a neighborhood near you, courtesy of Joe Biden and Kamala Harris!\n\n#BidenBorderCrisis https://t.co/fhsEGLXC80","date":"Wed Jul 07 22:22:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In combat I witnessed firsthand how speed &amp; range of MEDEVAC aircraft are key to saving a service member’s life.\n\nI was glad to hear the @ArmyChiefStaff agree that the military needs the necessary funding to ensure our aircraft have the speed &amp; range to accomplish their mission. https://t.co/FEDpPAkbW6","date":"Tue Jul 06 15:38:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Family-owned farms and ranches are the backbone of the ag community in #TX13.\n\nBiden’s supercharged death tax proposal is an attack on family-run businesses and will make it impossible for them to continue on from generation to generation!\nhttps://t.co/U60zMTczzv","date":"Mon Jul 05 21:34:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Happy Independence Day, America. \n\nWe are blessed to live in the GREATEST country in the world! \n\nWishing you all a safe and fun #FourthofJuly! https://t.co/GMuwoh6yBL","date":"Sun Jul 04 16:11:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I started off the holiday weekend at the Canyon Lions Club pancake breakfast and 4th of July parade. \n\n#TX13 is filled with patriots who love this country as much as I do! 🇺🇸 https://t.co/UnTs7TktPu","date":"Sat Jul 03 20:42:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Americans wants to know that their President is in control and fit for office, but they don't have that confidence in Joe Biden.\n\nCOGNITIVE TEST NOW! https://t.co/s4MznYvP2k","date":"Fri Jul 02 14:15:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In March I opposed the so-called \"COVID relief\" bill for many reasons, one of which was aid for farmers being based on race and not how they were impacted by the pandemic. \n\nA federal judge has now blocked this RACIST policy in court.\n\nThis is a WIN for common sense!","date":"Thu Jul 01 17:58:06 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Tune into @seanhannity's town hall with President Trump and Governor Abbott TONIGHT at 9PM ET on Fox News.\n\nYou won't want to miss this! \n\n#BidenBorderCrisis https://t.co/MC7wEPpNSK","date":"Wed Jun 30 23:04:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We just wrapped up a border security briefing with President Trump, Governor Abbott, law enforcement, and border officials. \n\nWe’re now touring the border. More to come!\n\n#BidenBorderCrisis https://t.co/prORs8h5mZ","date":"Wed Jun 30 18:37:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"All U.S. nuclear warheads are assembled in #TX13, so it was great to hear from the Chief of Naval Operations that our nuclear programs are on track.\n\nI'll continue to work with @HASCRepublicans to make sure that @NNSANews has the funding necessary to keep our country safe! https://t.co/zM5l22JwOH","date":"Tue Jun 29 20:15:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: I recently introduced the bipartisan Servicemember Safety &amp; Security Improvement Act with @RepCuellar. \n\n@JohnCornyn + @SenatorSinema introduced the companion bill in the Senate.","date":"Sun Jun 27 20:51:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We're committed to working on a bipartisan basis to protect our country's heroes!\n\nLearn more → https://t.co/QIT4qoFvCn","date":"Sun Jun 27 20:51:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Illegal immigrants are pouring across the border in record numbers and Biden's ONLY move has been to end nearly every successful Trump-era immigration policy.  \n\nNow, he's likely going to end Title 42. \n\nWhose side is he on? It's NOT the American people's.\nhttps://t.co/SjOyhR6nYj","date":"Sat Jun 26 19:14:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"WATCH: My thoughts on the Democrats' latest ASSAULT on American energy https://t.co/mAZTkqGXef","date":"Fri Jun 25 23:50:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"You know what they say, follow the leader.\n\nIf President Trump announcing his trip to the border was all it took to get Kamala Harris down there I guess he should've announced it sooner! 😂","date":"Fri Jun 25 15:08:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Kamala’s photo-op in El Paso won’t do a thing to fix the crisis that this Administration created. \n\nWe need REAL leadership! \n\n#BidenBorderCrisis https://t.co/nyQ1z7vFZz","date":"Fri Jun 25 01:02:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 92 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Fri Jun 25 00:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Growing up in West Texas my parents taught me a saying — when someone shows you who they are, believe them.\n\nDemocrats' push for voter fraud was not about protecting YOUR vote, it was about cementing their grip on power.\n\n https://t.co/wGxtuziXW0","date":"Thu Jun 24 14:21:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 91 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu Jun 24 00:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Once again, something isn’t right here. The American people deserve answers.\n\nLet’s get that cognitive test done NOW!","date":"Wed Jun 23 22:01:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a father and a doctor, I am disgusted by the Biden Administration’s fight AGAINST human life.\n\nAt 15-weeks, babies can move their arms and legs.\n\nIf you support abortions, certainly at 15-weeks, you support murder. Plain and simple!","date":"Wed Jun 23 15:36:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 90 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Wed Jun 23 00:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats' push for voter fraud has hit a roadblock — 80% of Americans SUPPORT voter ID laws.\n\nDYK: The Democrats' premier voter fraud legislation, H.R. 1 / S. 1, throws voter ID out the window.\n\nI proudly voted NO on that nonsense.","date":"Tue Jun 22 22:44:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 89 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue Jun 22 00:00:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden wants to CUT defense spending rather than stick to growth called for in the NDS, forcing DoD to make difficult budget cuts.\n\nI was glad to hear from the Air Force that #TX13 is a priority!\n\nI will be working to ensure that our service members have the resources they need! https://t.co/t6ZCc8YXBZ","date":"Mon Jun 21 17:23:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 88 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon Jun 21 00:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'll never have a more important title than dad. I'm grateful to have learned what kind of husband and father I wanted to be from the best one out there! \n\n#HappyFathersDay2021 https://t.co/wTb9kLeuvx","date":"Sun Jun 20 18:44:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This past week, I asked @USAmbUN if this administration plans on holding China accountable for deceiving the American people. \n\nThe WHO said there was no way this virus was man made, we know now that is NOT true. \n\nThe American people deserve to know the truth! https://t.co/Dy1AS1XcUs","date":"Sat Jun 19 21:06:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 86 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sat Jun 19 01:21:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"RT if you agree➡️President Biden needs to take a cognitive test IMMEDIATELY!\n\nhttps://t.co/4rGmS8kUkd","date":"Fri Jun 18 16:58:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Given the precedent set and President Biden’s CLEAR mental struggles, I believe it’s past time he take a cognitive test.\n\nI sent a letter to him saying just that! ⬇️\n\nhttps://t.co/6RCKj7pFYd","date":"Thu Jun 17 20:42:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"When I was Physician to President Trump, the media relentlessly pushed a narrative that he needed a cognitive test. \n\nI administered the test and he excelled!","date":"Thu Jun 17 20:42:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We will not spend one dime of taxpayer money to teach our kids to hate their country and each other. \n\nBan Critical Race Theory and woke socialism in our schools — NOW!","date":"Wed Jun 16 22:22:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 83 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Wed Jun 16 01:54:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 82 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue Jun 15 01:39:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DYK: Constituents from #TX13 can purchase a flag to be flown over the Capitol through my office. \n\nMORE ➡️ https://t.co/m4YjEY1c39","date":"Mon Jun 14 23:30:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Old Glory has long been a beacon of hope and freedom for the world. \n\nWe'll NEVER forget the sacrifices made by America's service members and veterans to preserve the greatness that our flag represents! \n\n#FlagDay2021","date":"Mon Jun 14 23:30:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"One day it’s unnecessary, the next day she’s thinking about it, and then she says she'll go but doesn't give a date. She can’t keep her story straight!","date":"Mon Jun 14 21:20:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What an insult to the countless Americans who are forced to live with the consequences of the Biden Administration’s self-made border crisis. She’s scared to face them!\n\nhttps://t.co/dfVoOLVtkL","date":"Mon Jun 14 21:20:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 81 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon Jun 14 02:28:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m old enough to remember when Democrats promised that raising the minimum wage to $15/hr. wouldn’t result in higher prices for consumers.\n\nIt looks like that idea only works out in their socialist dreams – NOT in real life.\nhttps://t.co/HYOyCS8lzi","date":"Sun Jun 13 17:08:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 80 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sun Jun 13 01:48:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congratulations, @MSUTexas, on joining the @TTUSystem! This partnership is a huge milestone for MSU and will only strengthen opportunities for its students, faculty, and staff.\n \nIt is great to see Texas Tech recognizing what a STRONG institution MSU is! \nhttps://t.co/SKhujsRQqG","date":"Sat Jun 12 18:27:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 79 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sat Jun 12 00:35:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Rural America won't be left behind on our watch! https://t.co/TOZxu61eV6","date":"Fri Jun 11 20:47:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@RepArrington put on a GREAT West TX Rural Summit in Lubbock yesterday.\n \nWe were joined by fellow Texans &amp; the House Ag Committee's Ranking Member, @CongressmanGT, for discussions on the most pressing issues facing rural America like ag policy, broadband, healthcare, &amp; oil/gas. https://t.co/6LBXG60VRr","date":"Fri Jun 11 20:47:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"A few Democrats are now acknowledging what Republicans have said all along — Ilhan Omar is a race-baiting anti-Semite. \n\nShe HATES America and thinks we're just like Hamas and Taliban terrorists. \n\nShe does NOT belong on the House Foreign Affairs Committee!","date":"Thu Jun 10 21:56:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 77 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu Jun 10 02:21:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"A New York Times Editorial Board member was \"disturbed\" to see American flags flying this past weekend...\n\nLiberals aren't even trying to hide how much they hate America these days.\n\nRT if you agree ➡️ I will ALWAYS be proud to fly the American flag! 🇺🇸","date":"Wed Jun 09 22:25:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"North Face got caught virtue signaling – what a JOKE!\n\nThey refused to make jackets for an oil &amp; gas company even though most of their products are made with petroleum (oil). \n\nThey're total hypocrites! Props to these guys for calling them out. #ThankYouNorthFace \n\nWATCH ⬇️","date":"Wed Jun 09 15:21:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 76 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Wed Jun 09 01:31:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 75 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue Jun 08 01:31:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Also, it doesn't take a rocket scientist to figure out that one of the biggest incentives for illegal immigration is the Biden Administration's promise to provide migrants with free everything.\n\nWhy aren't they doing anything to stop THAT cause?","date":"Tue Jun 08 00:21:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Kamala Harris' “solution” to #BidensBorderCrisis is to pour MILLIONS of our tax dollars into Guatemala.\n\nWe should be using our resources to secure the border and keep illegals out instead!","date":"Tue Jun 08 00:21:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 74 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon Jun 07 01:36:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"77 years ago today, the world changed forever. \n\nHow blessed we are to live in a country where brave, young service members are willing to sacrifice so much in order to protect everything we stand for in this country. \n\nFascism will never beat America’s resolve.  #DDay https://t.co/mwGqhFgl2F","date":"Sun Jun 06 17:10:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 72 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Fri Jun 04 23:12:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Panhandle is at the heart of Texas’ ag industry and this program will make sure #TX13’s ag success continues! https://t.co/ZiZJ0D959X","date":"Thu Jun 03 17:39:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This morning we celebrated the grand opening of @WTAMU’s new Veterinary Education Research Outreach (VERO) building. \n\nGreat things are in store for the students who’ll complete part of their veterinary education here.","date":"Thu Jun 03 17:39:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 70 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu Jun 03 02:32:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TeamJackson had a great meeting w/ state Rep. John Smithee today. \n\nHe offered an update on what’s happening in the state legislature, advice to our young team members, &amp; fielded questions. \n\nThank you for your time &amp; for sharing your perspective on critical issues facing Texas! https://t.co/Z2hMp67vJd","date":"Wed Jun 02 20:28:13 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 69 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Wed Jun 02 01:24:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My team &amp; I kicked off #NationalDairyMonth with a tour of Cnossen Dairy in Hereford. \n\nThe technology &amp; strategy behind their operation is impressive &amp; their work is critical for milk production in Texas.\n\nThank you to the Cnossen family for hosting us &amp; for keeping us healthy! https://t.co/QqIOtl76Le","date":"Tue Jun 01 22:52:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm proud to be a part of this community, &amp; to have spent today with great patriots at the TX Panhandle War Memorial &amp; Llano Cemetery in Amarillo.\n \nGod bless this great country &amp; the fallen heroes we honor this #MemorialDay2021.\n\nMay we never forget that freedom is NOT free. https://t.co/8T3LSR646A","date":"Mon May 31 19:49:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 67 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon May 31 01:25:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Big tech platforms &amp; the liberal media went to great lengths to support Democrats by canceling conservatives who discussed the theory that COVID leaked from a lab in Wuhan.\n\nNow the Democrats are all of a sudden on board to \"investigate.\"\n\nWe won't let them forget what they did! https://t.co/J0HlJM2QUq","date":"Sun May 30 21:40:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 66 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sat May 29 23:43:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Great news – the @AQHA is staying in Amarillo!\n\nThe Quarter Horse Association is an important, longstanding fixture in #TX13.\n\nThey've been in Amarillo for 75 years, let's make it 75 more! 👏\nhttps://t.co/XvXhWzHkzm","date":"Sat May 29 19:34:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congratulations, @AmarilloCollege, on being named @AspenHigherEd's 2021 Rising Star! \n\nThe fantastic students, faculty, and staff of Amarillo College represent the best of #TX13. Keep up the great work! \nhttps://t.co/G4uQ9mRzGe","date":"Fri May 28 14:53:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 64 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu May 27 23:01:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@WTSoftball is playing in the NCAA DII Softball Championship TONIGHT.\n\nCongratulations to the Lady Buffs! We are all rooting you on in #TX13. \n\nGO BUFFS!\nhttps://t.co/3RnQnIosSW","date":"Thu May 27 21:28:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 63 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu May 27 01:06:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Last week, I testified before @HouseAgGOP about the bipartisan RESTORE Act I introduced with @RepCuellar.\n\nThis bill would help the ag community recover from:\n\n📌 Natural disasters, like the recent winter storm in TX\n\n📌 Droughts, especially helpful for cotton growers https://t.co/L93soGKThO","date":"Wed May 26 22:15:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 62 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Wed May 26 00:54:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I've had enough of cancel culture &amp; its intent to destroy anyone who disagrees with Dems' radical, woke agenda. \n\nDems are now coming after service members' military awards from 131 years ago. \n\nMy new legislation would STOP this from happening!\n\nMORE⬇️https://t.co/0MYvCMwZeu","date":"Tue May 25 16:45:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 61 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue May 25 01:12:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This was a good call by Governor Abbott!\n\nFederal unemployment bonuses have incentivized people to stay out of the workforce for too long.\n\nTexas is open for business and we're rapidly recovering from the effects of COVID — it's time to get back to work!\nhttps://t.co/e2Tnkd7BYo","date":"Mon May 24 18:52:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 60 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon May 24 00:50:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I, however, will ALWAYS:\n\n✅Side with democracy over terrorism\n✅Stand firm in my support for our allies\n✅Push back against the Dems' dangerous nonsense https://t.co/RHHafLEHlP","date":"Sun May 23 20:08:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats have spent the last two weeks infighting about whether to support Hamas terrorists or an ally, Israel. \n\nYou would think it’s a no brainer for them, but sadly it's not. Hamas won!","date":"Sun May 23 20:08:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 59 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sat May 22 23:59:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Need another example of radical Dems' takeover?\n\nBiden is trying to poison our children's minds by forcing Critical Race Theory into the classroom.\n\nHis Dept. of Education wants to prioritize grant money for schools that teach this garbage, basically punishing schools that don't.","date":"Sat May 22 15:37:37 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I signed on to @RepChipRoy &amp; @RepDanBishop's letter to the Department of Education DEMANDING they stop this ridiculous proposal.\n\nAmerica is NOT a racist country!\n\nIf we don't fight back on this, there's no telling what's next.\n\nhttps://t.co/MveqRqFErr","date":"Sat May 22 15:37:37 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 58 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sat May 22 00:21:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Common sense wins...for once.\n\nIn a unanimous decision, SCOTUS ruled that the government can't take your guns from your home without a warrant.\n\nThe fight to protect your #2A rights won't end here. I will always have your backs!\nhttps://t.co/VEO30S8xqk","date":"Fri May 21 15:46:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 57 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Fri May 21 02:16:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Bringing reliable broadband to rural areas in #TX13 is one of my top priorities.\n\nFarmers need it to run their operations.\n\nPatients need it for telehealth.\n\nStudents need it for their education.\n\n@RepKatCammack's GO Act will make it happen. This bill has my full support!","date":"Thu May 20 20:55:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 56 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu May 20 02:05:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"2014: Congress unanimously passed a Dem-led resolution condemning Hamas attacks on Israel (300 rockets).\n\n2021: Hamas has launched 4 THOUSAND rockets into Israel in 10 days,\nyet it’s NOT clear to me that Dems would support a similar resolution today.\n\nThis is a SAD shift! https://t.co/oAOF5CCZVy","date":"Wed May 19 23:41:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden called Texans \"Neanderthals\" for lifting arbitrary COVID mandates.\n\nTwo months later it is clear that personal responsibility trumped government control.\n\nWe do NOT need Biden to tell us how to live!\nhttps://t.co/I1IVpdWath","date":"Wed May 19 15:15:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 55 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue May 18 23:14:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#BidensBorderCrisis isn’t slowing down – illegal immigration numbers hit a 21-year high in April with over 178,000 encounters.\n\nThe Democrats’ \"strategy\" has been to slowly stop talking about it.\n\nThe liberal media will let them get away with it, but I won't!","date":"Tue May 18 20:17:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 54 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Tue May 18 00:10:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My constituents sent me to Congress to work on serious issues, not nonsense like \"Transnational White Identity Terrorism.\" \n\nI'm calling on Dem leaders of @HouseForeign &amp; the Middle East subcommittee to schedule a hearing on REAL issues — like Israelis being targeted by Hamas.","date":"Mon May 17 20:21:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden's Energy Secretary: Pipelines are the best way to transport fuel\n\nHmm, it's almost like Biden killed thousands of good paying jobs for purely political reasons when he cancelled the #KeystoneXL pipeline.\n\nThe American people will NOT forget!\nhttps://t.co/4ywktu1JTi","date":"Mon May 17 17:12:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 53 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Mon May 17 00:19:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Since 2007, a federal program (PSLF) has provided student loan forgiveness to doctors who complete 10 years of service to a non-profit (typically rural) hospital.\n\nNearly every state in the country benefits from the program, except for Texas due to a regulatory loophole.","date":"Sun May 16 19:44:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thousands of doctors have opted to practice elsewhere as a result, leaving TX w/ a doctor shortage.\n\nRural healthcare is a critical issue for #TX13!\n\nThat's why I'm co-sponsoring the Stopping Doctor Shortages Act — to close the loophole &amp; bring more doctors to rural areas in TX.","date":"Sun May 16 19:44:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 52 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Sun May 16 00:06:13 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"And for the record, Americans shouldn't sit around waiting for the government to give instructions on how to live our lives.","date":"Sat May 15 17:14:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Who knew that all it would take for the CDC to state the obvious was Biden being hit with border, gas, inflation, &amp; Middle East crises in the same week?\n\nThe timing of the CDC's announcement was NOT a coincidence.\n\nThey were covering for Biden politically!\nhttps://t.co/4HnrspBf5a","date":"Sat May 15 17:14:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 51 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Fri May 14 23:43:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It makes me SICK to see the media and elites make Israel out to be the bad guy.\n\nHow would you expect America to respond if a border country were bombarding us with rockets for the sole purpose of killing innocent people?\n\nIsrael has the right to defend itself!","date":"Fri May 14 20:29:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"During #NationalPoliceWeek we pay tribute to the brave law enforcement officers who put their lives on the line daily to keep us safe.\n\nThank you for protecting our families, friends, and communities – even in the face of adversity.\n\nI will ALWAYS #BackTheBlue! https://t.co/UMEvANiuK6","date":"Fri May 14 14:43:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today the CDC told us what we already knew: it's perfectly safe for vaccinated people to live a normal life.\n\nThe only thing that stands in the way of our freedoms now are Democrat politicians who want to tell the American people how to live their lives! https://t.co/EdSppiTGak","date":"Fri May 14 02:08:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DAY 50 — COP OUT KAMALA IS A NO SHOW AT THE BORDER \n\n#BidenBorderCrisis","date":"Thu May 13 23:01:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Businesses are having a hard time finding workers because they're being paid more to stay at home.\n\nIt's time for America to get back to work! \n\nIt's time to put an END to unemployment bonuses!\nhttps://t.co/hs9NVlAfHq","date":"Thu May 13 17:29:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This is Joe Biden's America! In less than 4 months, he has led this country to increased:\n\n⬆️Gas prices\n⬆️Grocery prices\n⬆️Illegal immigration numbers\n⬆️Crime in the U.S.\n⬆️Violence in the Middle East\n\nHeck of a job, @POTUS.\nhttps://t.co/RAlhT9VamQ","date":"Thu May 13 00:09:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Like President Trump, I believe the U.S. should remain focused on standing up to the Chinese Communist Party. \n\nThat includes a strong relationship w/ Taiwan as they're a vital partner for us in the region. \n\nI'm supporting this legislation to reaffirm our commitment to Taiwan.⬇️","date":"Wed May 12 19:42:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Innocent Israelis are being killed by rocket fire from Hamas for a second day in a row.\n\nThis is what a total lack of leadership from the U.S. Administration looks like.\n\nRT if you agree ➡️ America MUST stand strong in its commitment to Israel.","date":"Tue May 11 21:39:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Israel IS America's greatest ally, and I will always have their backs in Congress!\n\nPlease join me in praying for the victims of today's attacks.\n\nOh, and while we are on the topic: Jerusalem IS the eternal, undivided capital of Israel. #JerusalemDay","date":"Mon May 10 21:35:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Israel has the right to defend its citizens from violent rioters &amp; terrorist attacks — PEROID.\n\nToday's attacks remind me of two things:\n\n-U.S. aid to Israel is critical to OUR National Security.\n\n-The U.S. must stand strong against Iranian aggression, like its support of Hamas.","date":"Mon May 10 21:35:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#HappyMothersDay to all the great moms out there!\n\nMy mom taught me the value of faith, family, and hard work. I'll always be grateful for her positive influence in my life! https://t.co/hnHSaxHmkh","date":"Sun May 09 15:02:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS wants to pay for his SOCIALIST wish list on the backs of family farmers, ranchers, &amp; small business owners. It's insulting to these hardworking taxpayers!\n\nI signed onto @RepAdrianSmith &amp; @RepFischbach's letter opposing this outrageous idea! ⬇️ https://t.co/rNINhhzROv","date":"Sat May 08 20:05:12 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"If a private company can effectively silence a former leader of the free world then anything is possible.\n\nFacebook's decision to continue the ban on President Trump's Facebook and Instagram accounts should worry EVERY American.\n\n#BigTech has got to go!","date":"Fri May 07 20:51:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today is #MilitarySpouseAppreciationDay &amp; I may be biased, but I have the best one out there! 😉\n \nAmerica’s military spouses are the backbone of military communities. Without them, servicemembers can't do their jobs. Today &amp; everyday we thank them for their support &amp; sacrifices! https://t.co/IuzjtyE9HG","date":"Fri May 07 15:02:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On this #NationalDayOfPrayer we, as Americans, reflect on all that we have overcome in the last year and pray for the progress that still needs to happen. \n\nWe pray for our friends, family, and neighbors. We pray for the future. We pray for America. \n\nGod bless! https://t.co/1DValHUNGQ","date":"Fri May 07 00:16:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DYK: The Panhandle &amp; Plains regions of #TX13 are home to the highest density of cattle in the country.\n\nI was glad to meet with members of the @TXCattleFeeders in Amarillo yesterday.\n\nThese guys work hard day in and day out to make sure that we have quality beef on our tables! https://t.co/NyNwH68bPq","date":"Thu May 06 16:51:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Iran released a video depicting an attack on the U.S. Capitol and Iranian soldiers invading Jerusalem.\n\nAll this as Biden is set to roll back sanctions from the Trump admin's maximum pressure campaign against Iran.\n\nSponsors of terrorism have ZERO respect for Biden's admin.","date":"Wed May 05 17:55:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On this #TeacherAppreciationDay I'd like to congratulate Richard LaMascus of Hereford High School on his nomination for the @NationalHistory Patricia Behring Teacher of the Year award.\n\nThank you for all you do to positively impact the lives of your students, Mr. LaMascus!","date":"Tue May 04 21:12:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Numbers don't lie! \n\nPresident Biden’s plan to increase taxes will cost 1 MILLION Americans their jobs.\n\nHis America Last agenda is costing people their livelihoods and purposely increasing their dependency on government! When will it end? https://t.co/Zm5eSNd3H0","date":"Mon May 03 15:26:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Biden called on the Senate to pass H.R. 1 in his joint address to Congress this past week. \n\nHe wants you–hardworking taxpayers–to pay for political campaigns without your consent. Ridiculous! \n\nI for one do NOT support spending taxpayer money on things like attack ads. https://t.co/ckLyjdIxdM","date":"Sun May 02 15:46:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Apparently, President Biden plans to abolish ICE in a few days.\n\nThat is his solution to the CRISIS at the border?\n\nThis is the President that the media wants us to believe is moderate, unifying, and bipartisan? \n\nYou can't make these things up!","date":"Sat May 01 17:59:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Biden’s first 100 days in office have been defined by:\n\n❌ Broken promises\n❌ Failed solutions\n❌ Empty rhetoric\n\nWhat happened to being a President for ALL Americans?","date":"Fri Apr 30 20:43:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Biden's joint address to Congress was a prime example of his favorite tactic — bait-and-switch. \n\nHe doesn’t care about unifying this country. If he did, he wouldn't be pushing his SOCIALIST agenda through with NO bipartisan support! https://t.co/WwEfawZYpR","date":"Thu Apr 29 19:17:06 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas is OPEN for business &amp; it's time for Secretary Tom Vilsack to follow this proven approach by re-opening our FSA offices!\n\nI sent a letter to the Secretary saying just that 🠗\nhttps://t.co/9i3U8J503v","date":"Wed Apr 28 21:12:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Farm Service Agency (FSA) facilities are operating at a DC-mandated limited capacity, which prevents Texas’ farmers &amp; ranchers from accessing critical resources from the @USDA.\n \nBureaucracy should NEVER come before serving the American people!","date":"Wed Apr 28 21:12:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden picked his extremist environmental base and the Chinese Communist Party over hardworking Americans. \n\nLast week's announcement about RADICAL emissions mandates on our energy sector is just another step in his process of DESTROYING American jobs and energy independence.","date":"Wed Apr 28 15:03:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Trump refused to let Americans be taken advantage of by the Paris Climate Agreement. \n\nIn President Biden's effort to undermine everything that President Trump accomplished, he decided to re-enter the agreement.","date":"Wed Apr 28 15:03:53 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The WHO has been a puppet for the Chinese Communist Party for too long!\n\nTaiwan had a strong COVID-19 response &amp; provided the U.S. w/ PPE &amp; medical expertise early on. \n \nTaiwan has been a leader in global health &amp; the WHO needs to #LetTaiwanHelp instead of caving to the CCP!","date":"Tue Apr 27 16:45:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: I co-introduced legislation this week to protect @SheppardAFB from foreign espionage campaigns &amp; alternative energy projects that could impact military training routes. \n\nLearn more about the Protecting Military Installations and Ranges Act 🠗\nhttps://t.co/6FjDSCWT0N","date":"Mon Apr 26 13:22:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Outstanding! BOTH the girls and boys wrestling teams from @RandallRaiderHS brought home state championships this week. \n\nCongratulations on a great season!","date":"Sun Apr 25 16:02:13 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Dems’ motivations for DC statehood are disingenuous &amp; strictly political — they just want to control every aspect of your life from now on.\n\n❌ The 23rd Amendment would need to be repealed.\n\n❌ The Founding Fathers didn't want the seat of the federal govt. to be within a state. https://t.co/I0TPe8963u","date":"Thu Apr 22 17:16:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Yet again, Democrats show the American people that they’re more concerned with protecting illegals than citizens.","date":"Thu Apr 22 00:10:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"They’ve made their top priority clear — and it’s not the American people.","date":"Thu Apr 22 00:10:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Pelosi and her band of radical leftists BLOCKED legislation today that would've required illegals in Border Patrol custody to obtain a negative COVID test before being allowed to board a domestic flight in the U.S.","date":"Thu Apr 22 00:10:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"After three months, @POTUS finally acknowledged that what's happening at the border is a \"crisis.”\n\nA couple of days later, the White House walked it back saying Biden’s comment didn't represent the Administration's official position.","date":"Wed Apr 21 19:39:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Apparently, the President of the United States doesn't speak on behalf of the White House under this Administration? Good to know 🙄","date":"Wed Apr 21 19:39:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What my Texas colleagues and I saw at the border was pure CHAOS!\n\nPresident Biden’s reckless approach to immigration is lining the pockets of criminals, endangering the lives of Americans, and perpetuating a public health crisis. https://t.co/hFitkL0ZWN","date":"Tue Apr 20 22:06:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This crisis is getting worse by the day, yet President Biden and VP Harris continue to ignore it. Sad!\n\n#BidensBorderCrisis","date":"Tue Apr 20 22:06:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This kind of DANGEROUS rhetoric is unbelievably irresponsible!\n\nIt is unacceptable! She is going to get someone killed.","date":"Mon Apr 19 23:02:57 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"\"Auntie\" Maxine Waters went to Minneapolis to encourage protesters to get more confrontational with police.\n\nFollowing her comments, there was a drive-by shooting targeting National Guardsmen and police.","date":"Mon Apr 19 23:02:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The \"tolerant\" left is at it again. \n\n@RepBurgessOwens is a GREAT American and Congressman yet the liberal @sltrib compared him to the KKK because he called out the Biden Administration for the man-made humanitarian crisis they've created at the border.\n\nSICKENING!","date":"Mon Apr 19 20:22:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"No one is buying MLB's \"woke\" nonsense!\n\nGA’s election laws provide better access and more security to protect voters than all blue states.\n\nPeople in this country just want MLB to play ball. We need a commissioner with a backbone!\n\nhttps://t.co/AUwCIKc5nq","date":"Sun Apr 18 19:16:49 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Illegal immigrants at the Carrizo Springs facility told me that their families won't be able to pay the cartels for bringing them &amp; acknowledged they will have to “pay off” their debt by “working” for cartels in America. \n\nThis cycle of crime and violence cannot be ignored!","date":"Sat Apr 17 19:04:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The only beneficiaries of #BidensBorderCrisis are the criminal cartels! \n\nThat is the under-told story of this crisis – cartels exploit vulnerable families by charging them to bring their children into America illegally, putting the children in grave danger.","date":"Sat Apr 17 19:03:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Now, Democrats are getting even more radical with a reparations bill. \n\n❌NO ONE alive is responsible for the original sin of slavery\n\n❌This WILL further divide our country\n\n❌Studies show it could cost $10-12 TRILLION, money we don't have\n\n❌Where does it end? Hint: It won’t!","date":"Fri Apr 16 20:19:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"FYI — Democrats are already doing reparations.\n\nExample: In the last \"COVID relief\" bill, financial relief for farmers was based on skin color instead of the proportion of impact from the pandemic.","date":"Fri Apr 16 20:19:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As a member of the @HASCRepublicans Military Personnel Subcommittee, I'm committed to supporting military families.\n\nThat's why I've introduced bipartisan legislation to support servicemembers in the tragic event of a child's death.\n\nLearn more ↓\nhttps://t.co/9VgoM22974","date":"Thu Apr 15 20:27:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm observing “Purple Up! For Military Kids Day\" with U.S. military communities around the globe today!\n\nLike all military kids, my kids overcame challenges and made sacrifices to support my career in the Navy. I love &amp; appreciate them more than they'll ever know!\n\n#PurpleUp https://t.co/Lec9E0bP4T","date":"Thu Apr 15 20:27:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Biden in 1983: Court packing is a \"bonehead idea.\"\n\nBiden in 2005: Court packing is a \"power grab.\"\n\nI couldn't agree more, @POTUS! In that 2005 speech you praised D's for standing up to FDR on court packing, a member of their own party.\n\nWhy aren't you doing the same now?","date":"Thu Apr 15 15:42:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It is SICK and DISGUSTING that we now live in a country that requires legislation to prevent a child born alive from being murdered in the name of being “pro-choice.” \n\nInfanticide is murder! Those supporting this will someday be judged for their actions.\n\n#EndInfanticide https://t.co/YDgNQscL3k","date":"Wed Apr 14 21:37:02 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today, I was proud to sign @RepKatCammack's discharge petition to bring the Born-Alive Abortion Survivors Protection Act up for a vote on the House Floor.","date":"Wed Apr 14 21:37:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@RepKevinBrady has been a champion for Texans and all Americans throughout his career in Congress.\n\nHis leadership as Chair of @WaysandMeansGOP paved the way for tax reform, USMCA's passage, &amp; historic legislation that helped retirees. \n\nThank you for your service, Congressman!","date":"Wed Apr 14 17:24:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS has used the Department of Defense for his \"woke\" agenda since taking office and now he is looking to take it a step further.\n\nBiden is proposing a cut to DoD's overall budget while spending BILLIONS on green and social initiatives.","date":"Tue Apr 13 21:53:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In fact, Biden ranked his climate agenda ahead of fulfilling America's commitment to military families and countering biological threats.\n \nThis is NOT what the non-partisan DoD should be focusing on. Democrats have their priorities all wrong!","date":"Tue Apr 13 21:53:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I have seen firsthand how hard @TexasFarmBureau members work to feed our nation and provide for their families.\n\nI know I am in good company as a new member of the TFB, and I look forward to being a part of this organization's continued growth and success! https://t.co/y6RV4sRMBy","date":"Tue Apr 13 02:55:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My staff will be hosting office hours in Bridgeport (Wise Co.) &amp; Gainesville (Cooke Co.) this week!\n\nConstituents of #TX13 are encouraged to stop by if help is needed with a federal agency or to learn more about the services my office can provide.\n\nMORE ↓ https://t.co/mIr3yPv1vP","date":"Sun Apr 11 18:22:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats are getting ready to spend TRILLIONS of dollars on a so-called infrastructure bill that is a disguise for their Green New Deal agenda.\n\nTheir plan to push through another partisan wish list on the backs of hardworking taxpayers is disgraceful! https://t.co/eeYeYoqNpT","date":"Sat Apr 10 16:31:21 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Great move by @GovAbbott! \n\nRequiring Americans to present a vaccine passport in order to participate in normal life would be an overreach of federal power &amp; would compromise privacy, something my constituents in #TX13 and I will NOT stand for!\nhttps://t.co/87lGdo96Ys","date":"Fri Apr 09 21:33:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It was great to be out on the farm in Pampa today!\n\nI always enjoy talking with Texas’ farmers and ranchers about what’s working and what’s not so I can best advocate for them in Congress. \n\nI couldn’t be more proud to represent the top-rated agriculture district in Texas! #TX13 https://t.co/KYzJ8Aph6q","date":"Fri Apr 09 02:59:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This is where it starts! @POTUS promised to come after your guns and #2A rights, and now he is doing it.\n\nOnly a matter of time before the Biden “government” is knocking on your door demanding your guns.\n\nThis should concern EVERY law abiding American!\n\nhttps://t.co/Tqw3UuzoRA","date":"Thu Apr 08 15:09:35 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Congratulations on the launch of the 2+2 DVM program and thank you to System/University leaders for today's tour! https://t.co/QeDpnLThSF","date":"Wed Apr 07 23:14:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"A long-standing partnership between @TAMU main campus and @WTAMU has led to the creation of a new top-notch veterinary program that begins right here in Canyon at West Texas A&amp;M! https://t.co/rKRAGRb26H","date":"Wed Apr 07 23:14:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As terrorists exploit @POTUS' open border policies, the Biden Admin will tell you nothing is wrong.\n\nThey went so far as to delete a press release announcing the apprehension of suspected terrorists at our southern border.\n\nSo much for transparency! \nhttps://t.co/xkucVtXNzw","date":"Wed Apr 07 00:39:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"As the #BidenBorderCrisis worsens, President Biden and \"border czar\" VP Harris continue to ignore it.\n\nHow much worse are they going to let things get before reversing their FAILED immigration plan? https://t.co/yqXsvHPVgb","date":"Tue Apr 06 21:24:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@SheppardAFB is a very special part of #TX13, so it was great to be back yesterday to celebrate the completion of the new main gate. \n\nCongratulations to everyone involved in this special project, from the military to the state and to the local @CityofWF community! https://t.co/NR0NHPGz3o","date":"Sat Apr 03 19:46:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Please pray for the victims of today’s attack at the U.S. Capitol. \n\nThe U.S. @CapitolPolice force has been through so much this year. We are grateful for their sacrifice and service today and every day.\n\nI can confirm that I am back in #TX13.\n\nMay God bless this great nation.","date":"Fri Apr 02 22:37:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Civilian federal employees already have the option to keep their pre-approved leave, so I firmly believe the bravest among us deserve the same option!\n\nI will work with R's and D's alike to bring this commonsense policy to fruition in the FY22 National Defense Authorization Act.","date":"Fri Apr 02 01:15:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DYK: If a servicemember is on pre-approved family leave and their child passes away, they automatically lose that leave.\n\nI'm proud to announce that I've introduced bipartisan legislation with @JohnCornyn, @RepGolden, and @SenDuckworth to change this.","date":"Fri Apr 02 01:15:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"GREAT news! Amarillo had the lowest unemployment rate in Texas last month.\n\nTexans are resilient, and I am proud to see how far we've come after a very trying year! \n\nhttps://t.co/lx04xLNED3","date":"Thu Apr 01 15:18:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you @RepArrington + @RepBrianBabin for coordinating a TX delegation trip to the border.\n\nPresident Biden wants the American people to think this isn't a crisis, but we've now seen it with our own eyes.\n\nIt's a free-for-all at our southern border!\n\n#BidenBorderCrisis https://t.co/sJulOItJ9h","date":"Wed Mar 31 22:51:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"5,700 illegal immigrants are being housed in a facility that has a max capacity of 250. \n\nI saw a man-made humanitarian crisis — fueled by reckless policymaking &amp; rhetoric from the Biden Administration.\n\n#BidenBorderCrisis https://t.co/Lw2vCO8P1g","date":"Mon Mar 29 19:24:51 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Children are packed in on top of each other.\n\nThe facility is over capacity &amp; Border Patrol officials are struggling to keep up with the influx of illegal immigrants. \n\nI would describe what I saw as a COVID-19 incubator. https://t.co/d4yOxfb46n","date":"Mon Mar 29 19:24:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s now March 29. \n\nI visited a border processing facility in McAllen, TX earlier today, and I can safely tell the American people that the Biden Administration has FAILED at this “effort.”\n\nHere’s what I saw ⬇️ https://t.co/8ClT8xXIw3","date":"Mon Mar 29 19:24:34 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Jen Psaki on February 23:\n\n“So this is our effort to ensure that kids are treated — are not close — in close proximity and that we are abiding by the health and safety standards that the government has been set out.”","date":"Mon Mar 29 19:24:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"📍McAllen, TX\n\nI just got done touring a border processing facility at our southern border.\n\nWhat I saw was a full-blown humanitarian crisis. Pictures to come! \n\n#BidenBorderCrisis https://t.co/WzpV5aIsUj","date":"Mon Mar 29 15:13:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My legislation will send a strong message to the Chinese Communist Party: America is the world’s only global superpower &amp; we refuse to rely on authoritarian dictatorships like the one in Beijing.\n\nRead more on the legislation I introduced yesterday ⬇️\n\nhttps://t.co/hsrMSPVbKi","date":"Sat Mar 27 21:05:30 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"China’s grip on America’s pharmaceutical supply chain must be countered &amp; I am proud to be taking action on this issue as a Member of Congress.","date":"Sat Mar 27 21:05:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you to @RepHerrell for hosting @RepPeteStauber, @RepTenney, and me for an informative tour of a #NM02 oilfield and a roundtable with industry leaders. https://t.co/Yjm51GYHyh","date":"Thu Mar 25 19:59:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Oil and gas are critical to #TX13 and to America’s energy independence. \n\n@POTUS has declared an all out assault on reliable American energy, but I will always fight to protect this vital industry!","date":"Thu Mar 25 19:59:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am proud to support Congressman Gooden’s and Senator Blackburn’s commonsense proposal — the End Child Trafficking Now Act — that would solidify this pilot DNA testing program, ensuring criminal aliens are not able to exploit trafficked children for their criminal agenda.","date":"Thu Mar 25 00:20:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Democrats have long resisted the notion that criminal aliens traffic children to help them cross the border, but facts are facts: a pilot DNA testing program found that 1 in 5 claims of kinship were fraudulent.","date":"Thu Mar 25 00:20:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Every day is agriculture day in #TX13!\n\n✅ Top-rated ag district in the state of Texas, &amp; the 6th overall ag district in the U.S. \n✅ #TX13 accounts for 35% of Texas’ agriculture sales, with the market value of ag products sold totaling $8.8B.  \n\n#NationalAgricultureDay https://t.co/gvjvnE7R1O","date":"Tue Mar 23 20:06:27 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This article is a must read!\n\nThe Biden Administration hasn’t given a straightforward answer on why they’ve cut off media access at the border. \n\nToday we saw why. Their hypocrisy is on full display. \n\n#BidenBorderCrisis\n\nhttps://t.co/CipDBJe24G","date":"Mon Mar 22 22:34:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texans shouldn’t have to deal with the dangerous consequences of Biden’s failed leadership while he pretends the crisis doesn’t exist.\n\nOur borders must be secured!\n\nLaw and order must be restored!","date":"Mon Mar 22 01:39:37 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS’ rhetoric and terrible policies  caused a crisis at our southern border.\n\nNow they’re considering releasing illegal immigrants into Texas without issuing a court date.\n\nhttps://t.co/Ri9JnaCZDt","date":"Mon Mar 22 01:39:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 STUDENTS — The annual Congressional Art Competition is underway!\n\nSubmit original artwork to my Amarillo/Wichita Falls office by Friday, April 23.\n\nThe winner of our district's competition will have their work displayed in the U.S. Capitol!\n\nMORE ↓ https://t.co/tKgIYPChbW","date":"Sat Mar 20 18:45:32 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"DYK: More chicken is consumed in the U.S than anywhere else in the world.\n\nThank you to the chicken producers who make it possible to put high quality protein on our families' tables!\n\n#NationalPoultryDay / @chickencouncil","date":"Fri Mar 19 21:05:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Colin Kahl famously said that Iran would use our taxpayer money to buy \"butter, not guns,\" when in fact Iran used our money to buy missiles &amp; bombs &amp; to support terrorist groups like Hamas, Hezbollah, and Al-Qaeda.\n\nThe only policy shop he's qualified to run is in Tehran.","date":"Fri Mar 19 18:28:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Dems had a chance to support farmers w/ a vote for \"right to cure\" laws tonight.\n\nNO Dems had our farmers' backs on that vote. \n\nThen they went ahead &amp; passed an amnesty bill disguised as farm workforce aid.\n\nIt's clear where their priorities lie &amp; it's not w/ American farmers.","date":"Thu Mar 18 23:50:55 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#BidenBorderCrisis update:\n\nWhile illegal immigrants surge our southern border because they heard @POTUS would welcome them with open arms, House Democrats are having us vote on two mass amnesty bills today. \n\nWhat could go wrong... 🤔","date":"Thu Mar 18 21:52:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Since taking office, @POTUS has repeatedly put Americans in harm's way with the stroke of a pen.\n\nHe needs to halt his FAILED immigration plan and use his pen to PROTECT the American people this time. \n\nDenying the crisis exists won't solve anything! #BidenBorderCrisis","date":"Thu Mar 18 14:30:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"So much for transparency...🤔\n\nWhat is the Biden Administration hiding?\n\nhttps://t.co/ULMenEryAH","date":"Wed Mar 17 23:05:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Yet the Democrats will have you believe Republicans are racist for saying open borders = crime.\n\nGive me a break. Border security IS national security! \n\n#BidenBorderCrisis\n\nhttps://t.co/BIE0T45C3A","date":"Tue Mar 16 20:59:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"📍Wichita Falls, TX\n\nIt was great to catch up with @TexomasHomepage and @NewsTalk1290’s Mike Hendren yesterday about my visit to Wichita Falls + the latest in Washington.\n\nThank you for having me! https://t.co/EuiJfUVMxg","date":"Tue Mar 16 19:13:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Biden's FAILED approach to immigration must be challenged in a court of law.\n\nThis nonsense MUST stop!","date":"Tue Mar 16 14:35:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Title 42 was implemented by President Trump to prevent illegal immigrants from bringing COVID-19 into our country, but Biden blocked the rule to score cheap political points.\n\nNow, #BidensBorderCrisis is worsening at an alarming rate &amp; Texans' health/safety is being threatened.","date":"Tue Mar 16 14:35:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Encouraging illegal immigration during a global pandemic has proven to be a recipe for disaster, as Republicans said it would be all along. \n\nI'm calling on @KenPaxtonTX to file a lawsuit against the Biden Administration for failing to enforce Title 42.\n\nhttps://t.co/TR81DemVB0","date":"Tue Mar 16 14:35:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I stopped by the @CityofWF Fire Department Station #8 to thank our community’s BRAVE firefighters this morning. \n\nFirst responders are the best among us. I am grateful for their sacrifice and service to the people of Wichita Falls! #TX13 https://t.co/if6XG8KBoA","date":"Tue Mar 16 00:40:29 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I had a great time at the range in Amarillo this weekend! \n\nThe Democrats’ gun control agenda has nothing to do with gun safety and everything to do with taking your guns away.\n\nI’ll always stand up to big government for your #2A rights in Congress!\n\n#ComeAndTakeIt https://t.co/xejiVW1Pmz","date":"Mon Mar 15 19:21:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Praise God that no injuries were reported from yesterday's tornadoes in Palo Duro Canyon State Park &amp; the town of Happy!\n\nTexans are resilient and strong — the fine people of #TX13 will come together as we always do &amp; recover from the damage left behind. #TexasStrong","date":"Sun Mar 14 23:01:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas' COVID-19 vaccine rollout has reached a new milestone!\n \nVaccine eligibility has expanded to Texans aged 50 and older starting tomorrow.\n \nKeep up the great work, @TexasDSHS!","date":"Sun Mar 14 17:22:15 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Texline boy’s basketball team brought home the 1A State Championship trophy yesterday!\n \nThis team has so much to be proud of. Congratulations on a GREAT season!\n \nhttps://t.co/PlvJlHliek","date":"Sun Mar 14 02:47:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"ICYMI: @RepCuellar and I introduced bipartisan legislation aimed at helping the Texas ag community recover from the recent winter storm.\n\nThe RESTORE Act will go a long way to support our farmers during this tumultuous time!\n\nMORE ⬇️\nhttps://t.co/PWtPVnWmqJ","date":"Fri Mar 12 18:51:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The radical left is coming for your #2ndAmendment rights!\n\nI just voted NO on Pelosi's gun-grabbing H.R. 8 legislation, which targets law-abiding gun owners. https://t.co/gRcBRURCN9","date":"Thu Mar 11 15:57:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today I joined my Texas colleagues for a press conference on the #BidenBorderCrisis.\n\nSlapping an \"OPEN\" sign on the border during a global pandemic is NOT the answer.\n\nDems want you to stay home &amp; be scared of COVID while allowing illegal aliens to spread it in our communities. https://t.co/GxOB5BcXBa","date":"Wed Mar 10 21:36:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Proud to be an original co-sponsor of the bipartisan Ports-to-Plains Highway Act of 2021, which paves the way for I-27’s extension through the Texas Panhandle.\n\nThank you for your leadership on this effort, @RepArrington + @RepCuellar!","date":"Tue Mar 09 19:56:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Expanding and modernizing I-27 will promote growth by connecting rural areas to the federal Interstate Highway system and strengthen avenues for trade which is particularly advantageous for #TX13's agriculture industry!","date":"Tue Mar 09 19:56:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS won't acknowledge the crisis at our southern border because he doesn't want to admit it's a consequence of his #AmericaLast agenda.\n\nBiden's reckless policies are making our country less safe &amp; placing a heavy burden on taxpayers, especially in border states like Texas. https://t.co/LvWZFJEPqj","date":"Tue Mar 09 15:09:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas is doing what @POTUS won't…protecting the American people.","date":"Mon Mar 08 22:43:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My office is working hard to connect with constituents all across the 41 counties in TX-13!\n\nSign up for my e-newsletter \"Ronny's Roundup\" to stay in the loop on what's happening in Congress, and encourage your friends and family to do the same!\n\nhttps://t.co/izLr3iR54j","date":"Mon Mar 08 00:19:50 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Grateful to my constituents who came out on such short notice yesterday!\n\nWe talked about what has been going on in Washington + legislation coming up for a vote in Congress.\n\nI’ll never stop using my voice to advocate for the people of #TX13 in Washington! https://t.co/YVLpPXbxSg","date":"Sun Mar 07 16:36:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s GREAT to be back in TX-13!\n\nYesterday I gave a legislative update to members of the Amarillo Association of Realtors. Thank you for having me! https://t.co/Wv4JZtxHF8","date":"Fri Mar 05 21:30:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Powerful speech from my freshman colleague, @RepKatCammack.\n \nI voted NO on Democrats’ anti-policing bill last night. It will make communities less safe by impeding the ability of good officers to do their jobs effectively. \n \nI will always #BackTheBlue!","date":"Fri Mar 05 01:26:23 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I voted against @SpeakerPelosi’s top legislative priority – H.R. 1, the “For the Politicians Act.”\n \nGuess what her priorities entail:\n❌Using taxpayer money to fund political campaigns \n❌Throwing out voter ID laws\n❌Legalizing ballot harvesting","date":"Thu Mar 04 18:16:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I'm a proud co-sponsor of the GOP alternative, the Save Democracy Act, led by @RepublicanStudy Chairman @RepJimBanks. \n\nThis bill would actually restore faith in our electoral system! \nhttps://t.co/gDRKXXznQz","date":"Thu Mar 04 18:16:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Texas is OPEN for business, a fitting announcement for Texas Independence Day!\n\nWe don't need the federal government to tell us what's best for Texans.","date":"Tue Mar 02 22:00:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I didn't support the \"COVID relief\" bill because it won't provide targeted relief, but spends BILLIONS on longtime Dem pet projects. \n\n-$112M: Pelosi's underground railway\n-$1.5M: Schumer's bridge to Canada\n-$350B: Blue state bailouts\n-$50M: Planned Parenthood slush fund https://t.co/jrM8pLq7SN","date":"Mon Mar 01 23:49:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"J&amp;J's single-shot COVID vaccine is being shipped around the country today. Another example of the HUGE success of Operation Warp Speed!\n\nTHREE vaccines are now on the market in record time. American innovation and ingenuity can never be discounted!\nhttps://t.co/XVfzEMuXuK","date":"Mon Mar 01 19:37:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What Democrats won't tell you about the \"COVID relief\" bill:\n \n❌91% of spending is NOT related to COVID\n❌It's filled with liberal wish list items that wouldn't pass if not disguised as \"COVID relief\"\n❌There's still $1 TRILLION of previous COVID funding that hasn't been spent","date":"Sun Feb 28 17:41:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I don't support wasteful government spending and I DEFINITELY don't support the Democrat's ploy to pass their pro-abortion agenda in the name of \"COVID relief.\"\n \nI am PROUDLY pro-life! \n \nDYK: I've co-sponsored 23 pro-life bills in the #117thCongress &amp; I'm just getting started! https://t.co/7SHElAAnHt","date":"Sat Feb 27 17:24:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Only 9% of the spending in the \"COVID relief\" bill is tied to COVID.\n\nThat's not COVID relief. That's Pelosi's Payoff to Progressives. \n\nI voted NO because this sham of a \"relief\" bill is insulting to hardworking taxpayers! #PelosiPayoff https://t.co/JMFnWqWLq8","date":"Sat Feb 27 07:12:47 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I co-sponsored @CongressmanGT's amendment that would've brought aid to rural communities, but Pelosi won't even let us vote on it. \n \nPelosi's Payoff for Progressives is good for her special interests, but neglects the people who actually need meaningful, targeted relief.","date":"Fri Feb 26 20:41:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Speaker Pelosi is doing everything she can to silence the Republican Minority in the House.\n\nShe won't even allow amendments to the \"COVID relief\" bill.","date":"Fri Feb 26 20:41:44 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What changed?\n\nAnother drop in the hypocrisy bucket.","date":"Fri Feb 26 14:04:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The last 5 COVID bills were passed with bipartisan support.\n\n$1 TRILLION of previously approved COVID funding still hasn't been spent.\n\nThere's no reason we can't make this round of relief meaningful and targeted. Instead, it looks like Dems are choosing wasteful pork &amp; politics. https://t.co/Mp13bi31zM","date":"Thu Feb 25 14:24:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Farmers &amp; ranchers are eligible for @USDA physical loss loans following the unprecedented winter weather conditions we've faced in Texas.\n\nThese loans will be managed &amp; distributed by your local Farm Service Agency office. \n\nMORE ⬇️\nhttps://t.co/8FYsBdYMCu","date":"Wed Feb 24 20:44:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"✔️Today the U.S. produces the same amount of beef with 33 percent fewer cattle compared to 1977.\n\n✔️Greenhouse gas emissions from cattle account for only 2 percent of America’s emissions, which is significantly less than other parts of the world.","date":"Wed Feb 24 15:50:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Bill Gates’ attack on the beef industry is based on exaggerated claims and faulty science. American beef producers have made great environmental progress over the years and have shown a commitment to continuous improvement.","date":"Wed Feb 24 15:50:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I stand PROUDLY with Texas’ ranchers and totally reject elites who fail to recognize the importance of beef in our diets, and the industry’s impact on our economy.\n\nhttps://t.co/an7p73hDDb","date":"Wed Feb 24 15:50:59 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"TEXANS — Report damages from the recent winter conditions to the state using this survey. \n\nSurvey results will be presented to FEMA &amp; the Biden Admin, increasing the chance of additional counties being approved for federal assistance.\n\nhttps://t.co/hkuxloH4Io","date":"Tue Feb 23 20:03:26 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The nonpartisan @USCBO says 1.4M jobs will be ELIMINATED if the minimum wage is raised to $15/hr.\n\nWhy are Dems intent on killing American jobs during a pandemic?\n\nDem Senators Sinema &amp; Manchin know it's nuts, too. They've said they don't want the measure in a COVID relief bill! https://t.co/3QHY2j9g9q","date":"Tue Feb 23 14:59:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Four counties in #TX13 are currently approved for assistance under Biden's Major Disaster Declaration: Cooke, Montague, Wichita, &amp; Wise.\n\nI fear this will fall short of what's needed. I joined my TX colleagues in calling on @POTUS to approve assistance for ALL 254 counties in TX.","date":"Mon Feb 22 21:42:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Well, how about the $100 million for an underground rail project in Silicon Valley for starters...\n\nhttps://t.co/HF298fo6sx","date":"Mon Feb 22 18:12:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS pandered to his environmental base when he aimlessly rejoined, which only benefits the Chinese Communist Party and those on the left who want to destroy American energy jobs.\n\nBiden’s #AmericaLast agenda is good for liberal politics, but not the American people.","date":"Sun Feb 21 21:30:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS' decision to formally re-enter the Paris Climate Agreement shows his priority is undermining President Trump’s work instead of looking out for American interests. \n\nThis is clear since he did not renegotiate terms before re-entering the agreement.","date":"Sun Feb 21 21:30:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It lacks accountability measures &amp; puts a lopsided financial burden on the American people.\n\nA Paris court found France guilty of failing to meet its own Paris Climate Agreement commitments this month. \n\nIn fact, most countries involved are not meeting their climate goals.","date":"Sun Feb 21 21:30:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Clearly, @ERCOT_ISO fell short on its promises. \n\nThat's why I DEMANDED answers from ERCOT on Texas’ power grid failures and lack of preparedness so we can ensure this never happens again.\n\nTexans are resilient. We will get through this together! https://t.co/b8ilDMZ0YZ","date":"Sat Feb 20 17:49:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you for showing me how the new facility is coming along! The future is bright for @TTUVetMed. https://t.co/4IP6NhD6Wt","date":"Fri Feb 19 22:15:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This will have a huge long-term impact on #TX13's economy, opening the door for new industry partnerships and research opportunities.","date":"Fri Feb 19 22:15:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@TexasTech will soon become the center of excellence for rural veterinary medicine through their new @TTUVetMed program in Amarillo. There is no better place for this than here in the heart of our nation’s livestock industry.","date":"Fri Feb 19 22:15:01 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today I introduced my first piece of legislation as a Member of Congress — the Opposing Business with Chinese Military Companies Act.\n\nI, along with my @RepublicanStudy colleagues, will be strong in standing up to the Chinese Communist Party!\n\nMORE⬇️https://t.co/AyKeUzg8JV","date":"Thu Feb 18 21:02:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The power outages we've seen in Texas are unacceptable —bottom line. \n\nI've joined my Texas colleagues in demanding answers that Texans DESERVE from @ERCOT_ISO. \n\nRead our full letter here: https://t.co/dZXAav54RU","date":"Thu Feb 18 17:06:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"My Amarillo and Wichita Falls offices will be closed due to the ongoing winter weather conditions and power outages. \n\nYou can still reach us by phone or email. \n\nAmarillo: (806) 641-5600\nWichita Falls: (940) 285-8000\n\nhttps://t.co/WNW8B9MsFu","date":"Wed Feb 17 12:07:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Stay safe and stay warm, Texas!\n\nCall 2-1-1 or use this online tool to find the warming shelter closest to you: https://t.co/6i9PF8rXd6","date":"Tue Feb 16 23:48:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#TX13 — My office is tracking info coming from @ERCOT_ISO, @PUCTX, @TDEM, and Gov. Abbott related to the winter storms and resulting power outages.\n\nI urge Texans to stay home, conserve energy, and utilize only trusted information sources. \n\nRESOURCES ⬇️\nhttps://t.co/pRPVfhxkNY","date":"Tue Feb 16 22:02:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Admin has steamrolled commonsense policies simply because they were tied to President Trump.\n\nClearly, Dems are unserious about working across the aisle. \n\nDisingenuous attempts to legislate are bad for effective policymaking and, in turn, for the American people.","date":"Tue Feb 16 15:04:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today we honor the service of 46 American Presidents who've led the greatest country on Earth.\n\nHappy #PresidentsDay! 🇺🇸 https://t.co/bThefadqJl","date":"Mon Feb 15 20:19:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS seems to have forgotten his campaign promise to \"follow the science.\"\n\nScience says children can safely return to school, yet he is siding with corrupt teachers unions.\n\nDemocrats are bankrolled by the teachers unions, but our nation's schoolchildren should come first!","date":"Fri Feb 12 15:35:28 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"What is @POTUS avoiding?\n\nI urge President Biden to ignore the radical left in his party and make a strong show of support for our partnership with Israel by calling @IsraeliPM Netanyahu.","date":"Thu Feb 11 21:02:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS should stop politicizing the border crisis. Emboldening illegal immigrants has already led to an uptick in illegal border crossings, and it will get worse.\n \nIt's not \"xenophobic\" to protect the American people from outside threats, particularly as the pandemic rages on.","date":"Thu Feb 11 16:28:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"This impeachment trial is nothing more than political theater put on by Democrats who want to vent about their hatred for Donald Trump and the 75 million Americans who voted for him.\n \nWhat a waste of time and taxpayer dollars! https://t.co/vRqe6Xna8p","date":"Wed Feb 10 21:42:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"It’s devastating to keep children home from school, especially when science supports their safe return.\n\nI signed on to the @gopdoccaucus' letter to the Biden Admin detailing the harms of virtual learning. It's long past time we get children back to school!","date":"Wed Feb 10 18:53:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@FSSAmarillo + @IJM play a major role in combatting violence against women/children.\n\nThank you to these #TX13 constituents for briefing me on their important work today.\n\nWe MUST put an end to heinous acts of violence like human trafficking! https://t.co/lZpNUAAOPj","date":"Wed Feb 10 16:23:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m excited to announce that my subcommittee assignments are SET! The #117thCongress is in full swing.\n\n@HASCRepublicans: \n✅Tactical Air &amp; Land\n✅Military Personnel \n\n@HouseForeignGOP:\n✅Middle East, North Africa &amp; Global Counterterrorism\n✅Africa &amp; Global Health","date":"Wed Feb 10 03:27:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I am saddened to learn of @RepRonWright's passing. \n\nHe served #TX06 with distinction, and the Texas Delegation was better for his service.\n\nMy deepest sympathies go out to his family, friends, and constituents. I will keep them in my prayers!","date":"Mon Feb 08 16:08:19 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today we celebrate the life and legacy of a GREAT American — President Ronald Reagan. \n\nStill today, we as conservatives embrace the values of the Reagan Revolution — freedom and patriotism. \n\nGod Bless America 🇺🇸 https://t.co/3iXnECBA5X","date":"Sat Feb 06 19:55:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"NEW: @RepKevinBrady has named me Co-Chair of the Texas Agriculture Task Force. \n\nI represent the #1 agriculture district in Texas, so I know just how important agriculture priorities are to our state and local economies. Let's get to work!\n\nhttps://t.co/ual4fHVaYM","date":"Fri Feb 05 21:41:33 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Classy, @jaketapper... 🙄\n\nThese lies and recycled attacks won’t stop me from serving the fine people of #TX13 who elected me to represent them.\n\nI must be doing something right if Pelosi’s propaganda network is coming after me!\n\nYou will NOT cancel or intimidate me!","date":"Fri Feb 05 16:42:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"America is united in condemning the military coup that took place in Burma over the weekend.\n\nPolitical leaders have been detained by the military &amp; communication channels have been cut off.\n\nAccountability is crucial as we work to promote and defend democracy around the world.","date":"Thu Feb 04 15:26:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"China and the WHO were complicit in covering up COVID-19 while it spread across the world.\n\nThe U.S. should hold them accountable! That's why I'm co-sponsoring @RepStefanik's resolution supporting a full international investigation into China’s handling of the COVID-19 pandemic.","date":"Wed Feb 03 15:49:25 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":".@POTUS on immigration: illegal immigrants, political correctness, &amp; an opportunity to take a jab at President Trump are more important than the American people.\n\nWe've heard this Admin's message loud and clear. Now, it's time they hear ours:\n\nPLEASE stop putting Americans last!","date":"Tue Feb 02 23:05:36 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration authorized giving the COVID-19 vaccine to 9/11 masterminds ahead of America's elderly and frontline healthcare heroes.\n\nToday I signed on to @RepStefanik's legislation opposing any plan to prioritize GTMO detainees over the American people. #AmericaFirst","date":"Mon Feb 01 20:58:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I will be there for our #TX13 farmers and ranchers in any way that I can in Congress.\n\nIn me, the agriculture industry will always have a trusted friend and vocal ally. \n\nMore on my visit with local farmers in Vernon this past week ⬇️ https://t.co/JvhXgPOltT","date":"Sun Jan 31 01:00:00 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"@POTUS on abortion:\n\n❌Taxpayers are funding abortions abroad\n❌Planned Parenthood stands to get abortion funding\n❌Abortions became more widely available\n\nI've already signed on to 20 pro-life bills in Congress, but I won't stop there. I'll always stand up for LIFE.","date":"Sat Jan 30 18:29:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"The Biden Administration has cut off funding for the Coronavirus Food Assistance Program with NO explanation.\n\nThis funding is vital to the farmers and ranchers in #TX13.\n\n@POTUS needs to answer for this and get those payments back up and running — NOW! https://t.co/QW4z5f6EyC","date":"Sat Jan 30 01:12:04 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"62M+ lives have been lost since Roe v. Wade.\n\n@POTUS was historically pro-life until he needed to appease the radical left, but this isn't about what's popular — it’s about doing what's RIGHT. \n\nWe can never give up on the most vulnerable among us.\n\nThis is #WhyWeMarch.","date":"Fri Jan 29 22:42:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Yesterday I had my first visit to @SheppardAFB as Congressman for #TX13.\n\nI will be an outspoken advocate for our Airmen on the House Armed Services Committee.\n\nI look forward to being a part of Sheppard's continued growth and success! https://t.co/6xl7Gb5mY1","date":"Thu Jan 28 18:09:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Let me be clear – abortion is murder, and the federal government should not support it let alone PAY for it.\n\nI will not support any bill that eliminates or weakens the Hyde Amendment. #SaveHyde","date":"Thu Jan 28 14:59:16 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"YES!\n\nThat's why I signed on to @RepRalphNorman's legislation calling for an amendment to the U.S. Constitution that would impose term limits on Members of Congress.\n\n#TX13 @NewsChannel10","date":"Thu Jan 28 00:36:42 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"President Biden seems intent on destroying America’s energy independence and further hurting families still dealing with the impacts of COVID-19. \n\nHis war on energy may be good for liberal politics, but in Texas we know it is a threat to our livelihood &amp; national security.","date":"Wed Jan 27 20:18:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"AMARILLO — It’s great to be back!\n\nI sat down with @JackieKingston1 this afternoon to discuss what has been going on in Washington, COVID-19, and my goals for Congress.\n\nThanks for having me, @KAMRLocal4News. https://t.co/UjCVXOzCRS","date":"Mon Jan 25 22:49:24 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Moore County Hospital’s CEO Jeff Turner gave me a tour of their new patient care facility last week.\n\nI will be a strong ally for rural healthcare providers in Congress!\n\nLearn more about what the new facility means for the hospital and the Dumas community below ⬇ https://t.co/vk4xZaGjiJ","date":"Sun Jan 24 00:31:56 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On this #SanctityOfHumanLifeDay we reaffirm our commitment to speak for those who can't speak for themselves. \n\nAs President Reagan once said, \"We cannot diminish the value of one category of human life — the unborn — without diminishing the value of all human life.\" #ProLife https://t.co/lrmSexvAJl","date":"Fri Jan 22 20:36:18 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thousands of National Guardsmen came here to protect us.\n\nInstead of treating them with decency they were forced to sleep in parking lots at the U.S. Capitol complex. \n\nDisgraceful! Our troops deserve better.","date":"Fri Jan 22 13:05:03 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m excited to be a part of @SteveScalise’s Whip Team!\n\nMORE ⬇️\n\nhttps://t.co/8wrPEFP5uo","date":"Thu Jan 21 15:42:40 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"6/6\n\nWe must focus on unity, overcoming COVID-19, and rebuilding our national economy first and foremost. \n\nReturning to failed policies of the past will not get us there.","date":"Thu Jan 21 00:30:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"5/6\n\nWe are even rejoining the World Health Organization though they were complicit in helping China cover up COVID-19 as it began to spread across the world.","date":"Thu Jan 21 00:29:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"4/6\n\nJust like that, America is returning to open border policies and undermining our own national interests by rejoining the Paris Climate Accord and blocking the Keystone XL Pipeline project.","date":"Thu Jan 21 00:29:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"3/6\n\nWith that said, I am deeply disappointed by some of President Biden’s first executive orders that were signed this evening.","date":"Thu Jan 21 00:28:45 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"2/6\n\nI have great respect for the Office of the President, and I will always seek common ground for the betterment of our great country. \n\nLikewise, I will always stand firm in my conservative values and advocate for policies that are pro-growth, pro-worker, and pro-American.","date":"Thu Jan 21 00:28:08 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"1/6\n\nToday has been a unique day in American history, and I am grateful to have had a front row seat.\n\nI attended President Trump’s sendoff at Joint Base Andrews followed by President Biden’s inauguration at the Capitol.","date":"Thu Jan 21 00:27:41 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"THREAD: My thoughts on today’s peaceful transition of power + President Biden’s first executive orders ⬇️","date":"Thu Jan 21 00:27:14 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Did you know the @SBAgov has updated guidance on funding options available to businesses, nonprofits, and faith-based orgs recovering from the economic impact of COVID-19?\n \n#TX13 — Let my office know if you have any questions!\n \nLearn more ⬇️","date":"Tue Jan 19 16:55:52 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"While Democrats push bad energy policies like the Green New Deal, I am proud to co-sponsor the Saving America’s Energy Future Act.\n\n@RepPfluger's bill will go a long way to help maintain America’s energy independence &amp; Texas’ position as the nation’s leading oil and gas producer.","date":"Sun Jan 17 17:17:11 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"#Texas recently received additional federal funding for COVID-19 testing and vaccination efforts.\n \nTesting: $1,535,405,092 \nVaccination: $227,056,156\n \nWe've got a ways to go to defeat COVID-19, but American resiliency and ingenuity will get us there!","date":"Sat Jan 16 16:03:54 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Thank you for your leadership on the Save Democracy Act, @RepJimBanks/@RepublicanStudy.\n\nElection integrity is a serious issue that MUST be addressed in the 117th Congress!","date":"Fri Jan 15 20:58:31 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"We should prioritize restoring communities devastated by lockdowns, America’s vaccine rollout, and a bipartisan investigation into the U.S. Capitol attack over a divisive impeachment process.","date":"Wed Jan 13 16:00:10 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m headed to the House Floor to vote NO on Speaker Pelosi’s 25th Amendment resolution. \n\nInflaming the divisions of the American people is not the way to move forward from all our country has been through this past year.","date":"Wed Jan 13 00:41:58 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I will not support any measure to remove President Trump from office. \n \nIt is time to focus on a peaceful transition of power and come together to solve the unprecedented challenges we face as a country.","date":"Tue Jan 12 19:52:39 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Today I stopped by the Amarillo Police Department to visit with some of our community's finest.\n \nThese officers sacrifice a great deal to protect us and our community.\n \nI cannot thank them enough for all they do! #BackTheBlue https://t.co/U8WLLxjQyH","date":"Tue Jan 12 02:10:46 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Please join me in praying for the friends, families, and fellow officers of Howard Liebengood and Brian Sicknick.\n \nThese U.S. Capitol Police officers are American heroes who leave behind a legacy of service and sacrifice that will never be forgotten. \n\nhttps://t.co/hP6I8PnR5X","date":"Mon Jan 11 22:04:12 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"On the heels of calling for unity Pelosi is talking about impeachment, and Big Tech is censoring conservative voices. \n\nThese are scary times in our country, but I won't stand for it. This is the United States of America, not communist China!\n\nFollow me on Parler (@RepJackson)! https://t.co/5xYogpbAfa","date":"Sat Jan 09 16:35:09 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"One Team, One Fight. \n\nI joined Fox &amp; Friends this A.M. to share my perspective on what happened at the Capitol on Wednesday, and where I think we go from here.\n\nI couldn't be more proud to serve alongside @RepTonyGonzales, @RepPatFallon, @RepTNehls, and @RepMullin in Congress. https://t.co/bGQJAk04ws","date":"Fri Jan 08 16:57:17 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I was proud to stand alongside some of my colleagues yesterday when things got tough. Mob rule will never win, no matter their agenda.\n\nThe Constitution protects our right to peacefully protest injustices, but violence has no place in our civic discourse.","date":"Thu Jan 07 21:50:43 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"God bless our Capitol Police. Violence is NOT the answer!","date":"Wed Jan 06 20:12:05 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"In my first op-ed as a Member of Congress I wrote to my constituents about why I’m objecting to certifying Electoral College votes tomorrow. \n\nCheck it out ⬇️\nhttps://t.co/1Oq6bwnOC4","date":"Wed Jan 06 00:44:20 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Mother, father, man, woman.\n\nApparently these words are so bad we're not allowed to say them on the House Floor. What a JOKE!\n\nI voted NO on Pelosi’s bid for Speaker &amp; her ridiculous House Rules. These radical socialists are completely out of touch with the American people!","date":"Tue Jan 05 18:23:38 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"To the hardworking men and women of Texas’ 13th Congressional District, I cannot thank you enough for trusting me to be your voice in Washington. \n\nI will fight every day to uphold the conservative Texas values we hold dear. #TX13 https://t.co/8tNgh30xGh","date":"Sun Jan 03 23:39:07 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"I’m proud to be a part of this outstanding freshman class! I look forward to working with my new colleagues as we take on the pressing issues facing our country.  #117thCongress #TX13","date":"Sun Jan 03 20:32:48 +0000 2021","user_id":"1341903465610686464"},{"handle":"RepRonnyJackson","text":"Only a few more hours until I’m officially sworn in to the #117thCongress. I’m ready to get to work for the people of #TX13! https://t.co/8wjelYWf54","date":"Sun Jan 03 18:14:41 +0000 2021","user_id":"1341903465610686464"}]