[{"handle":"RepSteveChabot","text":"This week, I toured the site of the future #OTRMuseum. Once opened, the museum will focus on the unique stories of the various families who created and lived in the historic Over-the-Rhine neighborhood over the years. Thank you for having me! https://t.co/zRG0lDTJIW","date":"Thu Jun 16 20:52:10 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great to be able to provide the students of @FJHSOH a tour of the U.S. Capitol. We discussed the history behind Statuary Hall, the rotunda and various paintings. Thank you for joining me! https://t.co/iVhvtCebvC","date":"Wed Jun 15 16:34:58 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Flag Day! Today marks the 245th birthday of the American Flag, which was adopted on June 14 1777. https://t.co/mLLR729sGo","date":"Wed Jun 15 02:28:32 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Ranking Member of the Asia-Pacific Subcommittee which has jurisdiction over #Afghanistan, I joined my @HouseForeignGOP colleagues in issuing this statement on tomorrow’s briefing:","date":"Tue Jun 14 23:56:13 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Biden Administration did little to address the root cause of migration at our southern border at this year’s #SummitAmericas trip. The Administration’s bungled approach to this summit underscores its lack of vision for our hemisphere.\n\nhttps://t.co/TIyCSlq25n","date":"Tue Jun 14 21:00:50 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I had the opportunity to meet with the Green Township Police Department. Thank you to Captain Hill and all the Green Township officers for everything you do to keep our community safe. https://t.co/RKa5Ssvmde","date":"Mon Jun 13 22:54:44 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Not only was he wrong that the problem was “temporary,” his administration’s policies have made it far worse since he made that misguided pronouncement. https://t.co/YOu2Frqcu9","date":"Fri Jun 10 16:19:29 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s been 11 months since President Biden said #inflation was only “temporary.” At that time, the inflation rate was 5.4%. In May, it hit 8.6% — the highest in over 40 years.","date":"Fri Jun 10 16:19:28 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As co-chair of the Israel Allies Caucus, I had the opportunity to speak at the @IsraelAllies Foundation Jerusalem Day event. It is important that we fight for an indivisible Jerusalem and help combat antisemitism. Thank you for having me! https://t.co/AhzsocAFmK","date":"Thu Jun 09 18:56:17 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I really enjoyed speaking today at the @CincyChamber DC Fly-In along with @RepBradWenstrup. We had a great discussion regarding infrastructure, workforce development and other issues impacting local businesses. Thank you for having us! https://t.co/C5U6nbqm0d","date":"Wed Jun 08 20:21:38 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"When Joe Biden entered the White House, a gallon of gas was $2.46.  Now, it's $5.15 a gallon in Cleves. The only thing \"incredible\" about Biden's disastrous “transition\" away from gas is how \"incredibly\" expensive and \"incredibly\" painful it is for American families. https://t.co/24AMvwTKGu","date":"Tue Jun 07 14:47:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"78 years ago today, the D-Day invasion was launched. More than 160,000 Allied troops landed on the heavily-fortified beaches of Normandy to fight Nazi Germany for the future of democracy and freedom across the globe. We must never forget the sacrifices they made! https://t.co/pMYwqOIGON","date":"Mon Jun 06 20:00:08 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the school year comes to an end, I read House Mouse and presented a flag flown over the U.S. Capitol to 75 fifth and sixth graders from Pennyroyal Elementary. Thank you to @FCSWildcats Supt. Mike Sander, Principal Jeremy Ward, and all the amazing teachers for having me! https://t.co/0fDXvw29W2","date":"Fri Jun 03 18:52:24 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to tour Warren County’s state-of-the-art jail facility and visit with the jail’s staff. Thank you to Sheriff Larry Sims for coordinating the visit and Chief Deputy Barry Riley for the informative tour and thoughtful discussion. https://t.co/VRavBVdeRv","date":"Thu Jun 02 22:30:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I attended the dedication of South Lebanon’s new veteran’s memorial. This impressive memorial would not have been possible without the leadership of Mayor Smith, Members of Council, and dozens of community stakeholders. Thank you for having me! https://t.co/2A1kzFRfwD","date":"Wed Jun 01 20:55:17 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor visiting with members of the Ohio Military Order of the Purple Heart during their annual convention in Springboro. We discussed veterans’ issues and foreign policy, among other things. Thank you for your service to our country! https://t.co/wrT2LLOdYn","date":"Tue May 31 18:44:28 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, we honor those who made the ultimate sacrifice for our nation and our freedom. God bless our veterans, their families and loved ones!  And God bless America! https://t.co/3Ixi5TRnTO","date":"Mon May 30 16:06:13 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As National Police Week came to an end, I had the opportunity to meet with the dedicated officers of the Springboro Police Department. Thank you for the thoughtful discussion, and thanks for all you do to keep our community safe! https://t.co/Xm2wfrHeWe","date":"Fri May 27 18:41:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/zqQfTBbRo7","date":"Wed May 25 20:48:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I had the honor of meeting with an outstanding group of Veterans at the Cincinnati/Northern Kentucky Airport on their way to DC for an #HonorFlight. Our nation is indebted to you for your service and sacrifice. Thank you, and God bless all of you! https://t.co/qbSWKaLTzt","date":"Tue May 24 19:28:40 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"But there are major problems with IPEF. First, the Administration has been working on the IPEF for months now, but today’s announcement said that members would start “discussions toward future negotiations.” In other words, at this point we are just talking about talking.","date":"Tue May 24 00:16:44 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Also, that #Taiwan wasn’t invited is unconscionable. Taiwan is a high-standards economy &amp; one of our top trading partners. Its inclusion in what amounts to an economic club would have greatly benefited each of the IPEF’s pillars. Leaving Taiwan out is a needless bow to the #CCP.","date":"Tue May 24 00:16:44 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The biggest problem with the IPEF is that the Administration failed to include market access provisions, which is what the region really wants, and which would have given us something to offer in exchange for advancing the interests of American workers and businesses.","date":"Tue May 24 00:16:44 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Indo-Pacific has 60% of global population and will be the top driver of the world’s economic growth for decades to come. It’s absolutely critical that the United States shows economic leadership in a region on which our economic future will increasingly depend.","date":"Tue May 24 00:16:43 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Therefore, it’s good to see that in addition to the United States, the IPEF will include Australia, Brunei, India, Indonesia, Japan, Republic of Korea, Malaysia, New Zealand, the Philippines, Singapore, Thailand, and Vietnam, which collectively make up 40% of global GDP.","date":"Tue May 24 00:16:43 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"China is setting the trade rules in the Indo-Pacific to the detriment of American consumers and businesses. The President’s announcement today of the Indo-Pacific Economic Framework is a welcome step to get us back in the game, but the framework leaves much to be desired.","date":"Tue May 24 00:16:42 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor to welcome over sixty new American citizens from over 30 countries last week. May their strength and determination to become U.S. citizens persevere as they pursue the American Dream. God bless you, your families, and this great nation. https://t.co/jAJ40buUhg","date":"Mon May 23 20:32:03 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to meet everyone at King’s Honda. After a quick tour, we discussed the supply chain crisis, workforce shortages and tax relief. Thank you for your time! https://t.co/dgjAEKXELj","date":"Fri May 20 19:25:58 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To commemorate #NationalPoliceWeek , I spoke on the House Floor urging my colleagues to support the brave men and women who serve in law enforcement. Specifically, we must make sure they receive the care and benefits they so desperately need and deserve. Watch my remarks below ⬇️","date":"Thu May 19 20:10:53 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/62bjXiDHMt","date":"Thu May 19 20:10:53 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor to speak at the opening of the Darnesha: A Glimpse into Hindu Civilization exhibit in Mason. This informative exhibit helps to dispel misconceptions about, and promote understanding of, Hindu culture. Thank you so much for having me! https://t.co/g0In1fGLfe","date":"Wed May 18 22:11:57 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great seeing the students from Bridgetown Middle School at the start of their DC trip. Last week, I helped prepare them for the trip by discussing my work in Congress. While there, I also presented the school with a flag flown over the U.S. Capitol. Have a great visit! https://t.co/uAKKhKuCG2","date":"Tue May 17 21:03:19 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As co-chair of the Norway Caucus, I would like to congratulate the Norwegian people on their Constitution Day! The US and Norway have been NATO Allies for more than 70 years, and we stand together to defend democratic values and human rights.  #Nasjonaldagen https://t.co/ieHJDsVvfy","date":"Tue May 17 19:46:52 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great speaking at the Warren County Historical Society’s 82nd Anniversary Founder’s Day celebration. While there, I presented its Executive Director, Michael Coyan, with an American Flag flown over the U.S. Capitol. Thanks for all you do to preserve the county’s history. https://t.co/MdZKBhv7Xn","date":"Fri May 13 19:09:05 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, and every day, we honor those who risk their lives to protect our communities and keep us safe. This morning at the @NLEOMF, I presented a wreath in honor of fallen @CincyPD officer Sonny Kim, who was killed in the line of duty nearly seven years ago. #NationalPoliceWeek https://t.co/75s4S4Tysf","date":"Thu May 12 19:34:47 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Somehow, the depravity of the Chinese Communist Party continues to hit new lows. Arresting a Cardinal shows just what Hong Kong has become. \nhttps://t.co/q8Z5DrBkM6","date":"Thu May 12 17:46:27 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"When they tragically sacrifice their lives protecting their fellow citizens, like retired Capt. David Dorn, they should receive the same benefits they would have if they’d died on active duty. I offered an amendment to provide those benefits at today's @JudiciaryGOP markup.","date":"Wed May 11 22:19:28 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we commemorate #NationalPoliceWeek, we should recognize that retired police officers often continue to serve their communities in a public or private security capacity.\n\nhttps://t.co/aF4I1IwrXR","date":"Wed May 11 22:19:27 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting the first-grade classes at Carson Elementary. We read House Mouse and discussed my work in Congress. While there, I also presented them with a flag flown over the U.S. Capitol. Thank you for having me! https://t.co/fDwyHkGujs","date":"Tue May 10 18:18:46 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I visited Cedar Oaks Wellness Center, which is dedicated to treating individuals suffering from addiction. Thanks to the CEO, Ted Paarlberg, for introducing me to your passionate team, and highlighting the inspirational stories, struggles and successes of your clients. https://t.co/nUzQSEiad3","date":"Mon May 09 19:01:03 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"From left to right: my late mom Doris, Donna’s late mom Hilda, my wife Donna, and our daughter Erica (mother to our grandchildren Reed and Keira). An outstanding group of women for whom I am truly thankful. https://t.co/Y8hqL9Vun3","date":"Sun May 08 15:08:21 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Mother’s Day to all the moms out there!  We all obviously owe more to our mothers than words could ever express. Here are four of my favorite moms.","date":"Sun May 08 15:08:16 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Small businesses play a vital role in stimulating our economy, creating jobs and driving innovation. As we celebrate National #SmallBusinessWeek, it’s a great time to recognize the contributions that small businesses have on our community by shopping small and shopping local. https://t.co/CrEKpXNmAc","date":"Fri May 06 21:37:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Top Hamilton County runner-up: Tanvi Mayya, Sycamore High School, for “Sunglass ‘Beach’ Hut”\n\nTop Warren County runner-up: Nithya Gatla, Springboro High School, for “Elephant” https://t.co/IirewxHZVd","date":"Wed May 04 20:23:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This year’s winners:\n\n1st: Joshua Huff, Elder High School, for “Ice Cream Shop at Night” \n\n2nd: Avelardo Avalos, Winton Woods High School, for “Flowers of Death” https://t.co/YZVWE8JtFH","date":"Wed May 04 20:23:18 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I always enjoy meeting with young artists at the annual Congressional Art Competition. The First District is blessed with many talented students. Thank you so much for your submissions.","date":"Wed May 04 20:23:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Sending out a special thank you to our educators past &amp; present during #TeacherAppreciationWeek. Thank you for your unwavering support &amp; passion for your students. Here’s a photo from my teaching days at St. Joseph School in the West End. https://t.co/VGbUc6ohAy","date":"Mon May 02 20:54:14 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Don’t forget to vote for your favorite artwork in the Congressional Art Competition! Voting closes Monday May 2 at 3pm. \n\nhttps://t.co/4B1En44ynq","date":"Sun May 01 14:53:01 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to attend the Warren County Imagination Library’s 2nd Anniversary Celebration hosted by @CountrysideYMCA. This impressive program provides books, free of charge, to eligible children with the goal of boosting youth literacy. https://t.co/AdhvHjPxIR https://t.co/tpQVNI89S8","date":"Fri Apr 29 20:05:40 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“Let’s face it, we’re all really border states now.”\n\nWatch my questions for Secretary Mayorkas at today’s @JudiciaryGOP hearing.\n\n https://t.co/piIyaJJMGD","date":"Thu Apr 28 20:50:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, we pause to remember the atrocities of the Holocaust. #NeverForget https://t.co/zHsk83B9nU","date":"Thu Apr 28 20:08:19 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s time to vote for this year’s Congressional Art Competition Winner! Follow the link to vote for the work of art that will represent Ohio’s First Congressional District on Capitol Hill: https://t.co/rvjsA7hLtF https://t.co/WHdGtZdg0b","date":"Thu Apr 28 16:58:05 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As #WorldAutismMonth comes to a close, it’s important to focus on how we can help spread understanding and increase awareness for the 1 in 44 children and 1 in 45 adults living with autism in our communities and across the country. https://t.co/37YiH69CaS","date":"Thu Apr 28 00:28:15 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday, I toured Safe on Main in Warren County — an organization dedicated to helping victims of domestic violence, sexual assault, &amp; human trafficking. Thank you for inviting me to visit your impressive facility and witness firsthand the incredible services you’re providing. https://t.co/4EB37ZYXIl","date":"Tue Apr 26 20:02:55 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I joined members of the Ohio General Assembly at the Ohio Statehouse to announce the creation of the Taiwan Friendship Caucus. In these uncertain times, it is critical that we strengthen our alliances with democratic nations around the world. https://t.co/D0A59QB9zM","date":"Mon Apr 25 20:39:13 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting with the students &amp; teachers at @GO_RealLife Diamond campus in Green Township. We discussed how each class helps them achieve their educational goals. Thanks to Dean of Instructions Angie Collins, Supt. Harry Snyder &amp; Board Chair Bill Ferguson for the tour. https://t.co/xzfveV5ghn","date":"Fri Apr 22 19:31:56 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had the opportunity to drop by the @WarrenCoCommish’s State of the County Address. Thank you to the Area Progress Council for organizing this wonderful event and to the commissioners for your continuing leadership! https://t.co/bSpgyQ49Ip","date":"Thu Apr 21 19:37:18 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great speaking to the second-grade classes at @IHPrimary to promote childhood literacy. We read House Mouse and discussed my role in Congress. Afterwards, I presented them with a flag flown over the U.S. Capitol. Thank you to for having me! https://t.co/rk6fQ4ZSTg","date":"Wed Apr 20 20:20:58 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor meeting Gary Roberts &amp; his family and friends to present Gary with his late father’s, James Roberts, military service medals. James served heroically in the U.S. Army during WWII, earning the Bronze Star. Thank you for your time and for the incredible stories. https://t.co/g7zAP1B7Gu","date":"Mon Apr 18 21:35:24 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"May you and your family have a blessed Easter Sunday. https://t.co/rZ4GVpDT4F","date":"Sun Apr 17 13:30:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this week, I visited Donovan Elementary in Lebanon to meet with a great group of fourth grade students. We read House Mouse and discussed my work in Congress. I also presented them a flag flown over the U.S. Capitol. Thank you to @LebanonSchools for having me! https://t.co/iIZ4oulnL0","date":"Thu Apr 14 20:58:22 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Here are a few steps President Biden can take right away to address the skyrocketing #inflation we’re facing: https://t.co/EX4E25UsFX","date":"Wed Apr 13 20:19:36 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As #inflation hits a 41-year high at 8.5%, it’s time for President Biden to finally take the issue seriously. Americans are paying more across the board, and his policies are making the situation worse, not better. \n\n⛽️ +48%\n🍴 +11%\n💡 +10% \n\nhttps://t.co/QPZJ5dEVKG","date":"Wed Apr 13 20:19:35 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Real #OpeningDay, Cincinnati! As always, the @Reds have a great day planned - from Barry Larkin leading the Findlay Market parade, to Joe Burrow throwing the first pitch to Zac Taylor. Go Reds! https://t.co/PD0IOQJZKL","date":"Tue Apr 12 18:23:17 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor meeting with fire chiefs from the First District and throughout Ohio. Thank you for your hard work and dedication, and for everything you do to keep our communities safe! https://t.co/L98hTXsIJq","date":"Mon Apr 11 20:21:41 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I joined my @HouseForeignGOP colleagues to urge the Biden Administration to not rush into a dangerous Iran nuclear deal. The more power we give to Iran &amp; Russia, the more we endanger ourselves and our allies. https://t.co/yNiZfbIP50","date":"Thu Apr 07 18:15:36 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, @HouseForeignGOP debated several bipartisan bills relative to Russia’s invasion of Ukraine. We must use all tools at our disposal to respond to Putin’s brutal assault. Watch my remarks on @RepMcCaul’s bill to hold Russia accountable.","date":"Wed Apr 06 19:50:04 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Unfortunately, the majority did not address many of my concerns with Russia. Among these are how Russia will benefit from the disastrous Iran nuclear deal that the Biden Administration is negotiating, which is why I offered a proposal on this very subject: https://t.co/0PskualTZb","date":"Wed Apr 06 19:50:04 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this week, I joined @USIP President Lise Grande and Asia-Pacific Subcommittee Chairman @RepBera for a #BipartisanUSIP discussion on the implications of Russia’s invasion of Ukraine for the Indo-Pacific region. Watch here:","date":"Wed Apr 06 16:48:02 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the Ranking Member of the Asia Subcommittee, I support @RepAndyBarr’s AXIS Act which would shine a spotlight on the #PRC and the support they have given to Russia’s invasion of Ukraine. Watch my remarks: https://t.co/tSWZgTWWNf","date":"Tue Apr 05 23:37:31 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great running into former NFL great Don Hasselbeck at Nick &amp; Tony’s over the weekend. Don and I played together at La Salle before he went on to play for the Raiders, Patriots, Vikings and Giants. By the way, Don stands at 6’7” — a great height for football. https://t.co/s4AB0NFl5O","date":"Tue Apr 05 21:40:48 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor to present a flag flown over the U.S. Capitol to Charlie Winburn. He has served on Cincinnati City Council, as Hamilton County Treasurer and currently on the Ohio Civil Rights Commission. Thank you, Charlie, for your incredible service to our community. https://t.co/ItrUydKaqt","date":"Mon Apr 04 19:02:44 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I joined my fellow Taiwan Caucus Co-Chairs @RepSires, @MarioDB, and @GerryConnolly in leading a bipartisan letter signed by 200 Members to @CommerceGov and @USTradeRep urging them to include #Taiwan in the Indo-Pacific Economic Framework #IPEF. Read our letter here: https://t.co/P2nfmDVwu7","date":"Thu Mar 31 20:15:41 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Cybercrimes like phishing, extortion and identify theft collectively cost American businesses over $4 billion. They're becoming more frequent and having larger impacts on everyone. Watch my statement and questions at the @JudiciaryGOP Hearing.\n\nhttps://t.co/5iFINMIHrr","date":"Wed Mar 30 19:53:49 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I spoke on the floor today to honor the life of @repdonyoung, who recently passed away. He was always a tremendous advocate for Alaska, and his larger-than-life presence will be greatly missed. https://t.co/ghRNRKXk1H","date":"Tue Mar 29 22:07:41 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Due to the physical demands of the job, police officers often retire early leaving them with a lengthy gap in Medicare coverage. That is why I introduced the HELPS Retirees Improvement Act w/ @RepSpanberger so they can enjoy a hassle-free retirement. \n\nhttps://t.co/cedJh0BAp1","date":"Mon Mar 28 22:03:22 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our deployed service members sacrifice so much for this great nation all while missing the tastes of home. I’m honored to join the @the_USO as a Force Behind the Forces assembling care packages for our troops. Thank you for defending our freedom. https://t.co/sISXytWvha","date":"Fri Mar 25 19:46:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I had the opportunity to tour the recently opened @warpedwingmason in @imaginemason. Thank you to Nick Bowman, John Haggerty and your terrific team for your hospitality and the thoughtful discussion on a variety of issues important to small businesses in our community. https://t.co/2bbUo7cMbu","date":"Thu Mar 24 18:07:37 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congratulations to @700wlw on this incredible milestone! Here’s to another 100 years of excellence!","date":"Wed Mar 23 20:20:19 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting the students &amp; teachers at @LovelandTigers MS. We discussed my work in Congress, the situation in Ukraine &amp; high gas prices. I also enjoyed listening in on Mr. Huening’s 7th-grade band class. Thanks to Supt. Mike Broadwater &amp; AP Amanda Robinson for the tour. https://t.co/Dch0sZOFUT","date":"Wed Mar 23 19:15:31 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read my joint statement with @RepAndyLevin re: the State Dept.’s determination that the atrocities committed by the Burmese military against the Rohingya people amount to genocide. \n\nhttps://t.co/VPx0MDWOOq","date":"Tue Mar 22 22:52:46 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you’re ever in need of assistance with a federal agency such as IRS, Social Security, VA, USPS – please don’t hesitate to reach out. You can contact me at (513) 684-2723 or visit: \n\nhttps://t.co/iKIzVdguti","date":"Mon Mar 21 20:53:11 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As MS Awareness Week comes to a close, we must continue to shine a light on those living with multiple sclerosis. Thank you to the @mssociety for meeting with me to discuss MS research and rising prescription drug prices. #MyMSMoment \nhttps://t.co/JU04sksLfh","date":"Fri Mar 18 18:40:29 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Hun Sen hasn’t stopped his 2017 crackdown on political opponents. In light of today’s convictions, Congress must pass the bipartisan Cambodia Democracy Act which I introduced with @RepLowenthal. \n\nhttps://t.co/VuiBwqdINa","date":"Fri Mar 18 01:05:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"March is #ColorectalCancer Awareness Month. In between votes, I visited the United in Blue installation on the National Mall. These flags pay tribute to the brave colorectal cancer survivors and caregivers. We must work to @FightCRC. https://t.co/S6E0wSBVQh","date":"Thu Mar 17 18:41:26 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Just returned from Ukrainian President Zelenskyy’s address to Congress. The United States and the world need to step up their assistance to the brave Ukrainians who are valiantly resisting Putin’s murderous onslaught. https://t.co/PSSfxNndLT","date":"Wed Mar 16 13:50:49 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement responding to Commerce Secretary Riamondo’s comments on tech transfers to China’s military. https://t.co/YR58Ok4w48","date":"Tue Mar 15 23:10:57 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my statement regarding the ‘Defund the Police’ movement at the @JudiciaryGOP Subcommittee Hearing.\n\nhttps://t.co/LY4OSgwIUF","date":"Tue Mar 15 18:51:41 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my interview with @ASP on China’s response to Putin’s illegal invasion of Ukraine.\n\nhttps://t.co/6bmcH9Senz","date":"Sat Mar 12 00:23:02 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Listen to my interview with @700wlw’s Dan Carroll about the situation in Ukraine and the need to increase domestic energy production to counter rising gas prices.\n\nhttps://t.co/eWUGyXNIhR","date":"Thu Mar 10 21:24:40 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to @SolvayGroup, @AmChemMatters and @OhioChemistry for providing such an informational tour of your facility in Cincinnati. Your work is vital to Ohioans and people all across this great nation. #ChemistryMatters","date":"Wed Mar 09 22:42:10 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor to present a flag flown over the U.S. Capitol to Cincinnati Police Chief Eliot Isaac. Chief Isaac is retiring after 33 years of service. To my left is interim Police Chief, Teresa Theetge. Thank you both for your service. Happy retirement, Chief Isaac! https://t.co/TU3ERBOzPm","date":"Tue Mar 08 21:26:57 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Friday, I met with Elder High School Principal, Kurt Ruffing, and their Director of Admissions, Brian Hiles. We discussed problems they’re having with the postal service regarding admissions letters. I appreciate the update on this important matter. https://t.co/JkhvkOrs1R","date":"Mon Mar 07 20:21:31 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my interview with @marellasp of @Local12 regarding the situation in Ukraine. https://t.co/GZzSMW2yST","date":"Fri Mar 04 21:06:35 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It's time to increase domestic production, Mr. President.","date":"Fri Mar 04 19:25:03 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@RepKenBuck, @USRepLong, @RepDLamborn, @michaelcburgess, @RepMoolenaar, @RepTimBurchett, @RepAnnWagner, @RepMaryMiller, @RepLoudermilk, @RepLaMalfa, @RepCloudTX, @RepCawthorn, @replouiegohmert, @RepMcKinley, @RepDanBishop, @TXRandy14","date":"Thu Mar 03 22:02:57 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to my fellow colleagues for joining me on this letter to the Biden Administration, demanding immediate action.","date":"Thu Mar 03 22:02:56 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The impacts of Putin’s unprovoked and unjustified assault on Ukraine will be felt at home. We must put in place sensible energy policies, so that America can achieve energy independence. https://t.co/9rKedNPBEf","date":"Thu Mar 03 22:02:56 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my House Floor Speech on the situation in Ukraine. https://t.co/SyfBElTEFC","date":"Thu Mar 03 15:06:46 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement on tonight’s #SOTU https://t.co/5GE35xCYgR","date":"Wed Mar 02 03:48:33 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To the people of #Ukraine and #Kyiv, we stand with you! Mayor @Vitaliy_Klychko and President @ZelenskyyUa we support you. Your strength has inspired the world. Stay strong! https://t.co/GX0RzUKOBb","date":"Tue Mar 01 23:02:22 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I don’t always agree with @jaketapper but this is spot on.","date":"Tue Mar 01 15:22:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“The Ukrainian people have demonstrated incredible bravery in the face of overwhelming military superiority.” Listen to my interview with Mike Allen of @700wlw about the situation in Ukraine.\n\nhttps://t.co/heQSRYscon","date":"Mon Feb 28 22:04:24 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“There has been weakness projected by this administration, and weakness invites aggression.” Yesterday, I spoke with @FoxNews to discuss the situation in #Ukraine. \n\nhttps://t.co/ofzcabsyKg","date":"Fri Feb 25 17:54:38 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Listen to my interview with Dan Carroll on @700wlw about the situation in Ukraine.\n\nhttps://t.co/7E6K1J37gy","date":"Thu Feb 24 20:45:10 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the opportunity to tour Lebanon F.D.’s newest facility, Station 41. This state-of-the-art facility will serve Lebanon citizens well. Thank you to Battalion Chief Derek Harper &amp; your fellow first responders for the briefing &amp; your tireless service to our community. https://t.co/esN3NCcS2G","date":"Wed Feb 23 22:41:36 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement on today’s #Ukraine. invasion. https://t.co/ugyR3zCyG4","date":"Wed Feb 23 01:51:13 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’m deeply saddened to learn of the passing of Robert D. Lindner Sr., a great Cincinnatian from a great Cincinnati family.  As a veteran, an entrepreneur and a philanthropist, Robert Lindner contributed so much to our community and our country.  He will be greatly missed.","date":"Thu Feb 17 21:50:01 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/vpKCkGIvnj","date":"Thu Feb 17 21:50:01 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting with Harrison Mayor Bill Neyer. We discussed Harrison’s growth &amp; economic development, as well as future needs for the community. Thanks for your time! https://t.co/d7dsaHyGEE","date":"Thu Feb 17 20:42:07 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The past few years have taken a toll on local businesses. Recently, I had the opportunity to meet with small business owners in Harrison to discuss supply chain issues, inflation, and workforce development. Thank you for a great discussion! https://t.co/A8Z6pcixkq","date":"Wed Feb 16 23:19:37 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the Co-Chair of both the Taiwan and India Caucuses, I applaud this news. The rules-based order in the Indo-Pacific is only strengthened when democratic partners seek to deepen their ties.","date":"Tue Feb 15 21:48:02 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Six months ago, #Afghanistan fell to the Taliban. The Biden Administration’s disastrous withdrawal has weakened America’s position on the world stage and emboldened our adversaries. Read the @HouseForeignGOP joint statement below. \n\nhttps://t.co/tuA4w6RErE","date":"Tue Feb 15 19:22:55 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Although they didn’t win, our @Bengals fought hard and made us all proud. Thanks for a great season and so many unforgettable moments. We’ll get them next year! https://t.co/WGWVSRr29g","date":"Mon Feb 14 19:20:23 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Good game @RepKarenBass! Congrats to the @RamsNFL, but the @Bengals will be back soon.  Maybe a rematch in Arizona next year?","date":"Mon Feb 14 18:56:19 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s Game Day! Time for the @Bengals to #RuleItAll ￼at the #SuperBowl ￼! Who Dey!! https://t.co/hpHXI8MEQP","date":"Sun Feb 13 21:12:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"You’re on @RepKarenBass! I’ll bet you a couple Cincinnati favs - @Skyline_Chili &amp; @graeters ice cream that the @Bengals will #RuleItAll.","date":"Sat Feb 12 20:42:52 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Who Dey!! Gotta love the @Bengals fever at @Visitationcincy. Gearing up to #RuleItAll on #SuperBowl Sunday.","date":"Fri Feb 11 19:22:58 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The #PRC must understand that the Patriot missile system is the definition of a purely defensive system. Any retaliation for this sale is a clear indication that Beijing’s intentions are not peaceful, and we should treat it as such. \n\nhttps://t.co/4uLP6wSjbH","date":"Thu Feb 10 21:57:09 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Who Dey! Greater Cincinnati is in the grips of Bengal Fever as we celebrate the @Bengals third trip to the #SuperBowl. Today on the House Floor, I honored Cheviot’s commitment to Bengal pride. Watch my remarks below ⬇️: https://t.co/IDeakWrtXI","date":"Wed Feb 09 21:20:15 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In a world with so much suffering, somehow, the depravity of the Chinese Communist Party never fails in hitting new lows. Now they are torturing #Uyghur children! \n\nhttps://t.co/gt1dEkQiai","date":"Wed Feb 09 19:57:11 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our brave men and women in blue put their lives on the line every time they put on their uniforms. Their daily acts of heroism, bravery, and courage keep our communities safe. Watch my remarks on the House Floor honoring local police officers ⬇️: \n\nhttps://t.co/AlW9hg3pby","date":"Tue Feb 08 23:08:35 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Each year, I have the privilege of nominating young men and women to our U.S. Military Academies. It’s always an honor to nominate outstanding students, like those who attended last week’s academy reception. Thank you for your service and dedication to our nation. https://t.co/5cBrj1JnaZ","date":"Tue Feb 08 00:01:32 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, on what would have been his 111th birthday, we celebrate Ronald Reagan Day. President Reagan was a man of distinction who strengthened our nation and championed our democracy. In celebration, I’d like to share a photo from President Reagan’s visit to Cincinnati in 1988. https://t.co/AdW8NNt8OM","date":"Sun Feb 06 15:05:46 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Couldn’t have said it better myself, @RepMcCaul. It’s such a shame that she would say this after standing up for Tiananmen Square protesters 30 years ago. Today, Dems are so afraid of really standing up to the CCP, it’s hard to watch. The American people deserve better.","date":"Sat Feb 05 14:13:30 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On #WorldCancerDay, we pray for those who are battling this unforgiving disease, remember those we have lost, and raise awareness which will hopefully bring us closer to finding a cure. https://t.co/2O04kjxitF","date":"Fri Feb 04 23:54:32 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Democrats just passed their weak ‘China’ bill that doesn’t take the threat posed by the #CCP seriously, doesn’t use our most potent foreign policy tools, and dumps billions into the UN’s climate slush fund. Watch my full statement opposing the bill: https://t.co/MByzWAwixJ","date":"Fri Feb 04 22:23:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the House considers the so-called #China  competition bill, it’s important to note what wasn’t debated.  Democrats refused to allow debate on the Asia Subcmte GOP amd’t as an alternative to Dem policy. \n\n@RepKenBuck, @RepTimBurchett, @RepMarkGreen, @RepAndyBarr &amp; @RepYoungKim https://t.co/Sk5l45Asdc","date":"Thu Feb 03 22:40:23 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"There is a winter weather warning across #OH01. Stay safe and warm and avoid going out if you can. For more information visit: https://t.co/T4xDfKkec9 https://t.co/YBsVwQUYXv","date":"Thu Feb 03 20:50:34 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I spoke on the House Floor to honor former Congressman Clarence Brown, who passed away on Jan. 26. Congressman Brown served Ohio's 7th District with distinction for 17 years. Please keep his family, including @RealClancyBrown and @hainesforohio, in your prayers. https://t.co/IZgsAIeHSp","date":"Thu Feb 03 19:46:53 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I joined Israel Allies Caucus co-chair @RepDLamborn in issuing the following statement re: Amnesty Int’l’s bogus report on #Israel:\n\nhttps://t.co/kUGBPLURzc","date":"Thu Feb 03 00:26:07 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Biden Administration’s statement supporting Speaker Pelosi’s so-called #China bill doesn’t even mention the word “China.” This just underscores the fact that Washington Democrats are more worried about upsetting the #CCP than standing up for American interests. https://t.co/hc4F0Vt0ZI","date":"Wed Feb 02 21:06:00 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As part of the legislative process, the House Rules Committee holds a hearing to prepare a bill for Floor debate and consider amendments. Watch my testimony before the @RulesReps on why the Democrats’ controversial China bill is so weak:\n\nhttps://t.co/Uo5lD4mAti","date":"Wed Feb 02 18:40:42 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, Speaker Pelosi is ramming through the House a weak, partisan bill that claims to counter #China, but in fact does no such thing. See my full statement here: https://t.co/QBW28tY0PO","date":"Wed Feb 02 00:16:11 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As lead Republican on the @HouseForeignGOP Asia-Pacific subcommittee, I would like to wish a #HappyLunarNewYear to all who celebrate! #YearOfTheTiger https://t.co/mJ4fNVSo4T","date":"Tue Feb 01 14:29:59 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Who Dey!!!  One more to go!!!  @Bengals #RuleTheSuperBowl https://t.co/RZI3WUTAmI","date":"Sun Jan 30 23:29:42 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s Game Day. Time for the @Bengals to #RuleTheAFC!  Who Dey!!!  \n\n#RuleThePlayoffs #RuleTheJungle https://t.co/GwtbBgEolC","date":"Sun Jan 30 15:03:16 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The brave men and women aboard Apollo 1 and the Challenger and Columbia space shuttles gave their lives to advance space exploration and discovery. May we pause to remember the sacrifices of these brave Americans and their families. #NASARemembers","date":"Fri Jan 28 19:54:17 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“For the dead and the living, we must bear witness.” – Elie Wiesel. \n\nToday we pause to remember the atrocities that so many faced during the Holocaust. May the stories &amp; strength of the victims and survivors live on through us.  #WeRemember https://t.co/rmBGp0CD0A","date":"Thu Jan 27 15:31:51 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the House Caucus on India and Indian Americans, I want to wish a happy #RepublicDay  to the citizens of #India! They gained independence from the British in 1947. 3 years later, the Indian Constitution came into effect. India now has the world's largest democracy. https://t.co/2VuBNnNlHo","date":"Wed Jan 26 17:43:52 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Next, to continue moving forward with domestic semiconductor manufacturing, we should fully fund the CHIPS Act. You can read the letter I joined with several Ohio members regarding this critical investment below. https://t.co/LdyJIE4oHk","date":"Tue Jan 25 21:45:26 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Semiconductors are integral to our economy, &amp; we must put the U.S. at the forefront of research, development, &amp; production. @intel will help lead the way by bringing additional support to Ohio.","date":"Tue Jan 25 21:45:25 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to those from Ohio’s First District who braved the cold to #MarchForLife last week. It was great meeting with students, parents and teachers from @Royalmont as well as members of @smoyparish. Thank you again for your efforts to enact pro-life, pro-family policies. https://t.co/x53q51Rm73","date":"Mon Jan 24 20:01:25 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Who Dey! Almost time for the @Bengals to continue to #RuleThePlayoffs by bringing home another win and plenty of game balls #ForTheCity. https://t.co/y8qk9dje9B","date":"Sat Jan 22 17:57:33 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I spoke at the #MarchforLife breakfast to recognize all those who stand together to promote the rights of the most vulnerable among us — the unborn. Thank you for your continued efforts to enact pro-life, pro-family policies. https://t.co/cCBmByGFXd","date":"Fri Jan 21 19:04:12 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“It is my sincere hope that the Court rights a grievous past wrong &amp; give rights to the most vulnerable among us – the unborn.” Watch my remarks on the House Floor about the #MarchForLife. https://t.co/qdn5mMUMr0","date":"Fri Jan 21 17:20:42 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Weakness Abroad:\nThe botched withdraw from Afghanistan decimated our credibility from Iran to China. Exhibit A: Russia is set to invade Ukraine &amp; yesterday the President said he can’t even get NATO to support sanctions if Putin decides to bite off another chunk of his neighbor.","date":"Thu Jan 20 22:51:34 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Biden’s Border Crisis:\nBorder security is national security. A weakened border has led to a surge in illegal immigration, as 1.7M people were apprehended at our southern border last year. Worse, drug cartels are flooding the U.S. w/ unthinkable amounts of fentanyl &amp; deadly drugs.","date":"Thu Jan 20 22:18:06 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Economic Crisis:\nInflation is taxation. 2021 was the worst year for #inflation since 1981. At 7%, the inflation rate continues to rise, as Americans are making less &amp; paying more for everything. Making things worse, the #supplychaincrisis keeps shelves empty &amp; demand even higher.","date":"Thu Jan 20 21:45:07 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Instead of working to keep inflation at bay, the Biden Administration &amp; their cohorts continue to push for more out-of-control government spending, which will only drive inflation to even higher levels.","date":"Thu Jan 20 21:45:07 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my opening statement at the Asia Pacific Subcommittee hearing on Digital Trade. I look forward to working with Chairman @RepBera on this critical priority. \nhttps://t.co/7kY5WM9Izy","date":"Thu Jan 20 20:16:32 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Congressional #Cambodia Caucus, I remain deeply troubled by the prosecution of Cambodian opposition leader #KemSokha on trumped up charges. @RepLowenthal &amp; I sent a letter to @SecBlinken urging the State Dept. to press the issue with the Cambodian government: https://t.co/KZvyMIjjDP","date":"Thu Jan 20 00:09:23 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I presented a flag flown over the U.S. Capitol to Paul Beck, who retired after serving as Miami Township Trustee for 40 years. Paul has been recognized several times for his advocacy on the township’s behalf. He will be missed. Happy retirement, Paul! https://t.co/rSj4iK6QnK","date":"Wed Jan 19 21:02:38 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we honor the life and legacy of Dr. Martin Luther King Jr. today, may we reflect on his words of hope, optimism and unity. #MLKDay https://t.co/M13dSITORr","date":"Mon Jan 17 15:37:33 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Ready to #RuleTheJungle ￼with a @Bengals victory over the Raiders in today’s playoffs. https://t.co/4DS4SSJCo4","date":"Sat Jan 15 15:48:38 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I joined @HouseForeignGOP Lead Republican @RepMcCaul in calling on the Biden Administration to tighten sanctions as #Iran gets closer to a bomb. The mullahs spent last year building their capabilities &amp; playing for time. Negotiations were always bound to be a dead-end. https://t.co/eiYVorvLdY","date":"Fri Jan 14 23:12:51 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I had the pleasure of meeting with Mars Hill Academy High School students on their annual worldview summit trip to Washington, DC. May the rest of your trip be both fun and informative. https://t.co/qUfPfXv9Ie","date":"Thu Jan 13 22:18:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I saw a Bald Eagle flying outside my office window in Washington! As you may know, there is a Bald Eagle nest in the Arboretum, which is a short distance from the Capitol as the eagle flies. You can view the nest cam @naeaglecam.","date":"Thu Jan 13 00:04:07 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/eqeV0qyEJg","date":"Wed Jan 12 21:35:34 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“Mutually-beneficial commercial ties are a necessary component of any comprehensive partnership.”\n \nI released the following statement with my @HouseForeign colleague and India Caucus Co-Chair, @BradSherman, regarding #India's decision to allow imports of U.S. pork:","date":"Wed Jan 12 21:35:34 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today is Human Trafficking Awareness Day. If you see something, say something - 1 (888) 373-7888. To learn more about the warning signs and how to help save someone's life, please visit the site below. https://t.co/uVgsWDomrC","date":"Tue Jan 11 23:25:06 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I met with @LTembassyUS Ambassador to the US, Audra Plepytė, to discuss US support for our #NATO ally #Lithuania against the increasing economic coercion &amp; diplomatic pressure from the #PRC relative to Taiwan. Such bullying tactics are totally unacceptable. https://t.co/sUy35Tg20T","date":"Mon Jan 10 23:11:29 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I met with @imaginemason’s new Mayor Barbara Spaeth, and City Manager Eric Hansen. We discussed Mason’s continued growth &amp; economic development, as well as the many amenities available to its residents. We also discussed critical national issues. My thanks to you both. https://t.co/ufRGs4pC4g","date":"Fri Jan 07 23:00:20 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I met with Lebanon’s new Mayor Mark Messer. We discussed his vision for the community including current &amp; upcoming infrastructure projects, his commitment to family &amp; public service, as well as an array of national issues. Thanks for your time! https://t.co/V11Y21uy7O","date":"Wed Jan 05 22:22:37 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"End of year 2021: Inflation was at the highest level in 40 years.\n \n⛽️ Gas Prices: ⬆️ 35%\n🔥Gas Utilities: ⬆️ 30%\n🍔 Food Prices: ⬆️ 6.1%\n \nFamilies are hurting. To help them make ends meet, we must reduce wasteful spending and get inflation under control.","date":"Mon Jan 03 23:13:05 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing you a happy and prosperous New Year! https://t.co/9v0b481hGC","date":"Sat Jan 01 15:18:45 +0000 2022","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Can’t think of a better way to ring in the New Year than with @GoBearcatsFB victory over Alabama at the @CFBPlayoff. Go Bearcats! https://t.co/3D8vUnn1lh","date":"Fri Dec 31 17:20:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Really enjoyed meeting with @WestPoint_USMA Cadet Ian Meier, a graduate of @stxinfo. It’s always an honor to nominate outstanding students, like Ian, to our U.S. Military Academies. Thank you for your service and dedication to our nation. https://t.co/JbuNXTJyEd","date":"Wed Dec 29 21:54:44 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks to @WarrenCountyOH’s CEO Phil Smith and Director of Sports Enterprises Ben Huffman for showing me around the completed Warren County Sports Park. The facility is truly impressive and will be a tremendous asset for the county. https://t.co/rhcQOSkOUZ","date":"Tue Dec 28 23:14:26 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting with Turtlecreek Township Trustee Jonathan Sams &amp; the township’s first responders. Thank you all for your service &amp; commitment to the safety &amp; well-being of our community. Special thanks to Asst. Fire Chief Brian Elleman for the tour of the new fire station. https://t.co/1JnaQApOAB","date":"Mon Dec 27 22:42:28 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Donna and I would like to wish you and your family a Merry Christmas! https://t.co/hOAwIfv9Ik","date":"Sat Dec 25 14:01:09 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting the new critical care building at @CincyChildrens. This expansion provides world-class treatment to help children in need of intensive, emergency &amp; cardiac care. https://t.co/mm84tQOMjg","date":"Wed Dec 22 21:42:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#China’s sanctions against US religious freedom officials @USCIRF is an insult to believers, no matter your faith. A new low in the CCP’s #UyghurGenocide. \n\nhttps://t.co/tkUtHLhHUm","date":"Wed Dec 22 01:08:08 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting with Chief Jeffrey Mitchell of the @LebanonPolice Department. We discussed their acquisition of body cameras and the importance of mental health treatments. Thank you to Chief Mitchell and all LPD officers for everything you do to keep our community safe. https://t.co/8TjUQgoOdk","date":"Tue Dec 21 19:59:13 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a result of the 2020 Census, the Village of Carlisle officially became a city on October 21, 2021. To commemorate this special occasion, I presented City Council with a flag flown over the U.S. Capitol. Congratulations to everyone in Carlisle. https://t.co/tkegZ8YFqm","date":"Mon Dec 20 22:55:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"China and its puppets in Hong Kong must abide by their promises in the Sino-British Joint Declaration. I stand with the people of Hong Kong in their demand to #ReleaseMyCandidate and hold real elections in the city.","date":"Sat Dec 18 00:47:09 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting today with @FCSWildcats' Superintendent of Schools, Dr. Mike Sander. We discussed Franklin’s efforts to improve education for its students, the bus driver shortage, and several national issues. Thank you for your time and commitment to our community. https://t.co/sMnp5HsM7o","date":"Fri Dec 17 22:10:15 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I sat down with @ASP to discuss democracy in #HongKong under China’s rule. Watch my remarks below⬇️\n https://t.co/uGAg57nosb","date":"Wed Dec 15 20:42:46 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I had the honor of presenting a flag flown over the U.S. Capitol in recognition of Jim Niehaus, who retired after serving as Crosby Township Trustee for 16 years. No one has more pride for their hometown than Jim has for Crosby Township. Happy retirement, Jim! https://t.co/A8HGgNy8ad","date":"Tue Dec 14 21:45:26 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I visited the @LifeatTCH &amp; Heidt Center of Excellence. I met w/ COO Pam McKie and discussed the wide range of services they provide children in our community, including those on the autism spectrum. Thank you to Pam, Dr. Lichtenstein &amp; staff for the tour. https://t.co/klMkOUNe4K","date":"Mon Dec 13 22:02:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I spoke with Tulika Prasad, Advocacy Ambassador for @autismspeaks. We discussed her work in the autism community, federal funding for autism research, and developing new ways for businesses to hire people with disabilities. Great speaking with you. https://t.co/yqviz1GDdA","date":"Fri Dec 10 20:25:19 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The #Ortega regime’s decision to cut diplomatic ties with #Taiwan is deeply regrettable. Nicaraguans need to know what’s in this for Ortega. Is he selling them out to Beijing to strengthen his hand against legitimate demands for reform? https://t.co/MO1ZJX8ATb","date":"Fri Dec 10 03:39:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Cyberattacks are becoming more frequent &amp; having a greater impact on our economy. We need to use every tool at our disposal to help protect Americans &amp; small businesses from cybercrimes. Watch my remarks ⬇️\nhttps://t.co/4KuGbMJsXM","date":"Thu Dec 09 23:35:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the India Caucus, I offer my condolences to the families of the victims of the tragic helicopter crash in #TamilNadu #India. Thirteen individuals were killed, including Chief of Defense Staff Gen. Bipin Rawat. Praying for the families during this difficult time.","date":"Thu Dec 09 01:13:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/Wrk1rdd7uM","date":"Thu Dec 09 01:13:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Competitive pricing helps lower costs on the average consumer. As the Biden Administration continues to ram through their failed energy policies, everyday American families are paying the price. Reinstating a ban on exporting #crudeoil will only make matters worse. https://t.co/h96xb4n6Zx","date":"Wed Dec 08 21:19:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, we honor the brave American patriots we lost during the horrific attack on Pearl Harbor. Eighty years later, it is a day that still lives in infamy. God bless everyone who has defended our nation for their valor and sacrifice! And God bless America! https://t.co/lkUtBvu9ek","date":"Tue Dec 07 16:13:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congrats to @GoBearcatsFB on your historic @CFBPlayoff bid.  The entire city is proud of your incredible accomplishments thus far.  Can’t think of a better way to ring in the New Year than a victory over Alabama in the Cotton Bowl. Go Bearcats!","date":"Mon Dec 06 21:34:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Antisemitism comes in many forms. Too often, it starts with words and ends in violence. As a member of the House Task Force for Combating Antisemitism, I urge everyone to #ShineALight on antisemitism and fight it in all forms.","date":"Mon Dec 06 20:10:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My late mom is in the center, and my late dad (next to her) and Bob Dole were both WW II vets, both serving in the Army in Europe during the war.","date":"Sun Dec 05 18:43:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Saddened to learn that a true American hero, Bob Dole, has passed away. This photo was taken in Senate Majority Leader Bob Dole’s office when my parents visited Washington DC during my first term in Congress in 1995. https://t.co/021jQ3cIQF","date":"Sun Dec 05 18:43:53 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Since 1964, Congress has held the Christmas Tree Lighting Ceremony on the West Front Lawn of the Capitol. I thought I’d share a quick picture that I took of the tree in front of the Capitol last night. Merry Christmas to you &amp; your family. https://t.co/6c6D9VDqBD","date":"Thu Dec 02 21:59:15 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I met with Dr. Lakshmi Sammarco and toured the new Hamilton County Coroner Office and Crime Laboratory. With more space and updated equipment, this facility will help our doctors and law enforcement agencies better serve our communities. https://t.co/RDLoVJiR58","date":"Wed Dec 01 22:08:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting with the 7th &amp; 8th graders of @teresaavilacin. We discussed their recent trip to Washington, D.C., and my work in Congress. I presented them with a flag flown over the U.S. Capitol and donated books for their library. https://t.co/rDESAeGsW9","date":"Tue Nov 30 21:27:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I met with two of our #OH01 @WestPoint_USMA Cadets, Alex Amaya of @MasonSchools and Sam Greenberg of @LovelandTigers, who are back home on leave. Thanks for the updates on your academy experience and for your dedication to serving our nation. https://t.co/QIjgUBVylv","date":"Mon Nov 29 19:21:14 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A Happy Thanksgiving to you and your family. May your day be filled with love and laughter. https://t.co/FkptQCnGlT","date":"Thu Nov 25 15:00:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a result of the 2020 Census, the Village of South Lebanon officially became a city on October 21, 2021. In celebration, I surprised them with a flag flown over the U.S. Capitol commemorating this special occasion. It was great seeing all of you! https://t.co/dyB8cxlDPO","date":"Wed Nov 24 20:00:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I met with Dennis a few years ago, back in 2018, when I presented him with his WWII medals at St. Gertrude Church. It was an honor to spend some time with him and deliver this small token of our gratitude and appreciation for his service. https://t.co/xuu6pMQtqb","date":"Tue Nov 23 21:10:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I stopped by the home of veteran Dennis Schone to deliver a flag flown over the Capitol in honor of his 100th birthday. Dennis served as a Staff Sargent in the Philippines during WWII. Happy Birthday Dennis! https://t.co/A66iiLSWoJ","date":"Tue Nov 23 21:10:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I had the honor of welcoming our newest American citizens at a naturalization ceremony. I applaud their dedication &amp; determination to make the US their home &amp; pursue the many opportunities that our nation has to offer. God bless you, your families, &amp; this great nation. https://t.co/rg1MFGsd7k","date":"Mon Nov 22 21:41:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I joined @RepJohnCurtis &amp; @GerryConnolly to urge the Biden Admin to work to close the gaps left by #Taiwan’s exclusion from @INTERPOL_HQ. International law enforcement works best when all countries are involved.\n\nhttps://t.co/aAbuBgkfSx","date":"Fri Nov 19 22:33:44 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@WCPO's @JohnMatarese has some helpful tips on how to circumnavigate Biden’s #TurkeyTax.","date":"Thu Nov 18 21:03:49 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my comments at yesterday's @JudiciaryGOP markup regarding the FBI whistleblower revelations. \nhttps://t.co/nwLtsaCldk","date":"Thu Nov 18 19:20:09 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI 🚨\n\n@IngrahamAngle with a solid take on the FBI whistleblower revelations. https://t.co/7UIAiiaCFZ","date":"Thu Nov 18 00:01:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Turns out the AG might not have been entirely forthcoming in response to my questions. @JudiciaryGOP https://t.co/TflL57nWVd","date":"Wed Nov 17 22:34:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Welcome home, Danny! As Co-Chair of the Congressional Freedom of the Press Caucus, I’m very glad to see your ordeal at the hands of Burma’s military junta is over. #BringDannyHome https://t.co/8gMenNjz6a","date":"Wed Nov 17 17:45:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A victim of sexual harassment in the workplace should have every tool at their disposal to achieve justice. Watch my remarks/Q&amp;A at today’s @JudiciaryGOP hearing.\n\nhttps://t.co/FIG6Sabd0U","date":"Wed Nov 17 00:17:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This Thanksgiving’s #TurkeyTax will be the uninvited guest that you didn’t want. Due to the supply chain issues &amp; rising inflation, hardworking families may lose a little weight this year…in their wallets.\n\n🦃Turkey ⬆️ 27%\n🎃Pie ⬆️ 17%\n🍎Apples ⬆️ 8%\n🔥 heating bill ⬆️ 54% https://t.co/p39m1XOZhC","date":"Mon Nov 15 20:16:45 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, we honor all those who have served our country in the armed forces. We must never forget the sacrifices they have made for our nation. God bless all of you and your families!  And God bless America!  #VeteransDay https://t.co/TxpQgP7nKK","date":"Thu Nov 11 14:47:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting with South Lebanon Mayor James Smith and several members of city council recently to discuss a wide array of issues, ranging from local community developments to several bills being considered in Washington. Thank you all for your time. https://t.co/mXmnkaM7ZS","date":"Wed Nov 10 22:21:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As part of the tour, I also visited the Peters Cartridge Factory Apartments located right next to the brewery. A special thank you to Ashlie Adams and Ken Schon for hosting the tour and briefing me on the issues facing both small businesses. https://t.co/uXE1n9ca4r","date":"Tue Nov 09 22:31:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to tour @CartridgeBeer  w/ cofounder &amp; COO Kyle Hackbarth. Once the site of the Peters Cartridge Company, a gunpowder and ammunition factory for the military during WWI &amp; WWII, it’s now a local brewery &amp; restaurant. https://t.co/qwFopej5dK","date":"Tue Nov 09 22:31:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I attended the @IWH4women’s luncheon to commemorate the signing of the Geneva Consensus Declaration — which affirms that unborn children have a basic right to life &amp; that tax dollars shouldn’t fund abortions. https://t.co/VVb35Bopy7","date":"Mon Nov 08 22:38:09 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’m going teal for my mom, who passed away due to Alzheimer’s complications in 2019. Alzheimers affects more than 5.8 million Americans. While research on the effects of Alzheimers has progressed, we still have much to learn. No one should deal with this alone. #WhyIGoTeal https://t.co/UGlz0YKV2T","date":"Sat Nov 06 16:54:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Life is precious, and we must do all that we can to protect it. Watch my remarks and Q&amp;A at today’s @JudiciaryGOP hearing.\n\n https://t.co/NxuM46P64A","date":"Fri Nov 05 01:16:56 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you @RepGarbarino for your leadership on this critical issue.","date":"Tue Nov 02 23:33:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As co-chair of the Nigeria Caucus, I offer my condolences to the families of the victims of the tragic building collapse in #Lagos #Nigeria. Praying for a safe rescue for those who are still trapped inside. https://t.co/FQJDK3Oluj","date":"Tue Nov 02 17:44:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"More⬇️on this legislation I cosponsored.\nhttps://t.co/8sueAnGeMI","date":"Mon Nov 01 20:53:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"After the sacrifices they’ve made for us, our veterans need to know that there will always be support for them when they need it most. The SERVICE Act will create veteran’s response teams trained specifically to help veterans in need of assistance.","date":"Mon Nov 01 20:53:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To help promote #CrimePreventionMonth @McGruffatNCPC was on the Hill this week. As a member of the Law Enforcement Caucus, it’s important that we help “take a bite out of crime” and work with our local law enforcement officers to keep our communities safe. https://t.co/PxmmP8yY7e","date":"Thu Oct 28 17:31:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I met with Thomas Martin, Andy Fuller, and Diana Barhorst from @nephosec. We discussed the importance of small businesses being able to protect themselves against cyber attacks. https://t.co/rgcY73V93x","date":"Wed Oct 27 17:52:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great visiting South Lebanon to see firsthand the robust economic development in this ever-growing community. Thank you to the team at General Electric Credit Union for showing me around your newest branch location &amp; for the informative discussion. https://t.co/9XxA2coCaf","date":"Tue Oct 26 19:40:05 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The shipping crisis is becoming increasingly more dire. Cargo ships sitting idly off the coast are creating a #supplychain domino effect that will lead to untold economic ramifications. House Republicans are demanding President Biden prioritize this critical issue. https://t.co/eU8rVYJJkr","date":"Mon Oct 25 20:05:14 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the House Caucus on India and Indian Americans, I want to congratulate #India on reaching the impressive milestone of administering a billion doses of #COVID19 vaccine! https://t.co/zQgYeQpTQN","date":"Sat Oct 23 01:45:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Department of Justice should not be trampling on the rights of American parents who just want the best possible education for their children. @JudiciaryGOP https://t.co/d98DUo6vis","date":"Fri Oct 22 20:26:22 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Biden Administration must make clear to the global community that any renewal of diplomatic relations with Syria must be contingent on Assad and his regime stopping their needless, brutal war against the Syrian people and agreeing to a political solution to the conflict.","date":"Fri Oct 22 17:22:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"First, there was the debacle in Afghanistan. And now by taking a hands-off approach to Syria, the Biden Administration is only strengthening Assad’s position in the Arab world. https://t.co/DV5KNCj6vc","date":"Fri Oct 22 17:22:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Numerous international organizations and human rights groups have condemned Assad’s use of violence and terror, which range from indiscriminate bombing of civilian infrastructure, deliberate use of siege tactics, mass torture, and deployment of chemical weapons.","date":"Fri Oct 22 17:22:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Sadly, it appears that President Biden is shifting from the Obama Administration’s disastrous “Lead from Behind” approach to foreign policy, to an even worse “Not Leading At All” scheme.","date":"Fri Oct 22 17:22:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Never in a million years, did we dream that one day we’d see the Justice Department, treat American parents as domestic terrorists. @JudiciaryGOP https://t.co/22YOq7uWP9","date":"Fri Oct 22 00:29:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"🚨 ICYMI🚨\n\nWatch my statement &amp; questions for AG Garland at today's @JudiciaryGOP hearing. More ⬇️\nhttps://t.co/nD4CNkp2wR","date":"Thu Oct 21 19:08:09 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Always a privilege to meet with #HonorFlight veterans from Cincinnati as they visit our nation’s capital. We owe our veterans a tremendous debt of gratitude for the sacrifices they’ve made for our nation. Thank you for your service. https://t.co/2UKqlgY8j9","date":"Wed Oct 20 18:11:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great speaking today to the Warren County Chamber Alliance during their 6th Annual Washington, D.C. Fly-In. We had a great discussion regarding infrastructure, the budget and other issues impacting local businesses as we continue to recover from the pandemic. #WCFlyin https://t.co/kalG4R9gnt","date":"Tue Oct 19 20:34:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Very saddened to learn of former Secretary of State Colin Powell’s passing. He dedicated his life to this country, and helped us overcome numerous challenges throughout his distinguished career. My condolences to the Powell family during this difficult time. https://t.co/ptUjCn06Rf","date":"Mon Oct 18 17:41:22 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The President is wrong to look to OPEC+ to increase oil &amp; LNG production. American energy producers are more than capable of meeting demand here at home. We should NOT be relying on our adversaries to meet our energy needs. https://t.co/zTHWa237eX","date":"Sat Oct 16 16:20:56 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Look at your gas bill lately? Thanks to President Biden’s agenda to eliminate American-produced natural gas, energy bills are skyrocketing as we head into winter. We should be looking for ways to alleviate financial pressures on consumers, NOT add to them.","date":"Sat Oct 16 16:20:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Congressional Taiwan Caucus, my thoughts and prayers go out to the families of the victims of the tragic fire in #Kaohsiung #Taiwan. \nhttps://t.co/QLbwdHKSQd","date":"Fri Oct 15 21:28:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Now, more than ever, we need to pass the balanced budget amendment I introduced again this year.  More:  https://t.co/hccDAxCrU9","date":"Thu Oct 14 21:13:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our nation is at a critical turning point, and we cannot afford to spend another $3.5T, which will only make matters worse. Rather than spending more money we don’t have, Congress should take steps to get wasteful government spending under control before it’s too late.","date":"Thu Oct 14 21:13:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The current #inflation rate sits at 5.4%, &amp; the CPI is the highest it’s been in 13 years. Further, we are facing major #supplychain problems that are causing product shortages, longer delivery times, &amp; even higher prices. https://t.co/Iuwd3MfJWQ","date":"Thu Oct 14 21:13:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Congressional Freedom of the Press Caucus and of the U.S.-Philippine Friendship Caucus, I want to extend my congratulations to @mariaressa on winning the 2021 Nobel Peace Prize for her work to advance freedom of expression.","date":"Wed Oct 13 19:19:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, we honored our community’s fallen firefighters at the Greater Cincinnati Firefighter Memorial. I presented a flag flown over the US Capitol in recognition of the selfless sacrifice &amp; bravery demonstrated by the heroic men &amp; women who risk their lives to keep us safe. https://t.co/jUvnBbSIhb","date":"Wed Oct 13 17:30:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy 110th National Day to everyone in #Taiwan. See my joint statement w/ @RepBera, @RepGregoryMeeks &amp; @RepMcCaul celebrating this momentous occasion. https://t.co/g6nk56FlHz","date":"Sun Oct 10 14:35:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I met with #SouthKorea’s People Power Party. We discussed the importance of a strong alliance between our nations, especially as we face shared challenges from China and North Korea. https://t.co/jBFCYNyTg2","date":"Fri Oct 08 17:15:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As more and more people turn to online shopping, we must ensure that adequate standards are in place to protect consumers from harmful counterfeit products. Watch my remarks on the #ShopSafeAct: https://t.co/qTRblT4kns","date":"Thu Oct 07 17:30:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The cost of #prescriptiondrugs continues to skyrocket. Congress must work in a bipartisan manner to lower the cost of prescription drugs so that no family goes without lifesaving medication. Watch my remarks: https://t.co/fBpsLQrg8J","date":"Wed Oct 06 16:46:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @HouseForeignGOP held a hearing on the bungled withdrawal from #Afghanistan. Watch the Q&amp;A below: https://t.co/L5wjBSkFsT","date":"Tue Oct 05 22:37:05 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my opening statement at today’s @HouseForeignGOP hearing evaluating the #Afghanistan withdrawal. https://t.co/4j9y5m1s0A","date":"Tue Oct 05 20:50:49 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great catching up with members of the Ohio Farm Bureau last week. Ohio’s farm community is critical to our local economy, and it’s important that we support them as we all recover from the pandemic. https://t.co/YDXgKA712k","date":"Tue Oct 05 18:05:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great to discuss the history of the Congressional Taiwan Caucus, and the future of the critically important bilateral relationship between the U.S. and Taiwan with @stacyhw_dc. Read more: https://t.co/Zxc6wy9iTD","date":"Mon Oct 04 20:14:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Met with Australian Prime Minister @ScottMorrisonMP last week. 70 years after the #ANZUS treaty, we discussed the importance of US-Australia relations, as well as our other alliances across the globe. These relationships are crucial as we forge ahead w/ the #AUKUS security pact. https://t.co/ih4bXkZTPl","date":"Fri Oct 01 18:15:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Abraham Accords are a landmark agreement for peace in the Middle East. Watch my remarks in support of the accords and normalization between #Israel and the Arab world at today’s @HouseForeignGOP markup here: https://t.co/C5wdt96i7e","date":"Thu Sep 30 23:18:20 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Proud to support @RepYoungKim's Uyghur Policy Act at today’s @HouseForeignGOP markup. Watch my remarks on the #Uyghur #Genocide and hostage diplomacy here: \nhttps://t.co/dbdQExdltu","date":"Thu Sep 30 21:39:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was an honor to present a flag flown over the U.S. Capitol in recognition of Ronda Mullins, who retired from the USPS after 25 years. Ronda &amp; her team have helped our office numerous times to resolve USPS casework matters for First District residents. Happy retirement, Ronda! https://t.co/AlS3cEqAfV","date":"Thu Sep 30 16:00:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, the House passed legislation @RepLowenthal and I introduced, the #Cambodia Democracy Act, which stands with the Cambodian people in their fight against the Hun Sen regime for a free and fair democracy. More ⬇️https://t.co/cfu0aVeD6b","date":"Wed Sep 29 14:48:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this month, I spoke to several local members of the National Federation of Independent Business (NFIB). We had a great discussion about the issues they face and the strain being placed on many small businesses as we recover from the pandemic. https://t.co/unltGPRIpa","date":"Mon Sep 27 20:46:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"China has created a “maritime militia” of fishing boats that they use to enforce their territorial claims against countries like the #Philippines. This week, the House agreed to an amendment offered by @RepElaineLuria  and I which will help counter this threat.","date":"Fri Sep 24 19:06:45 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Chinese Communist Party is committing horrible atrocities against the #Uyghurs in #Xinjiang. Pleased that the House adopted @HouseForeignGOP Lead Republican @RepMcCaul's amendment, which I was proud to cosponsor, to call these crimes what they are...#genocide.","date":"Fri Sep 24 16:53:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Cyber security is national security. That’s why I cosponsored @RepGarbarino’s amendment to help small businesses combat cyber threats through a cyber counseling certification program. This is a critical step in our national effort to prepare for &amp; prevent these types of attacks.","date":"Fri Sep 24 13:55:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a Co-Chair of the Taiwan Caucus, I applaud House adoption of two critical Taiwan-related amendments that I cosponsored - @RepBera’s amendment to strengthen #Taiwan’s asymmetric defenses, and @RepAndyBarr’s amendment to help combat the #PRC influence operation in Taiwan.","date":"Thu Sep 23 20:08:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The second involved the Global Health Security Act, which @GerryConnolly and I introduced to strengthen U.S. and global pandemic preparedness. Watch my speech on the amendments here: https://t.co/73xOvgDypm","date":"Thu Sep 23 17:33:24 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, the House adopted two important amendments that I’ve been pushing for a while. The first involved the Gray Zone Assessment Act, a proposal I wrote to help develop an effective response against #Russia and #China's cyberattacks &amp; other aggressive acts.","date":"Thu Sep 23 17:33:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Looking forward to this hearing next week. Congress needs to act to ensure transparency and a level playing field for Ohio student athletes.","date":"Thu Sep 23 14:52:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I met with @GermanAmbUSA. We discussed the situation in Afghanistan, the US economy, COVID-19, and the resumption of travel between the US &amp; Europe. https://t.co/GegTLVcMMe","date":"Wed Sep 22 18:33:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the privilege of meeting several Korean and Vietnam War veterans from Ohio &amp; Kentucky visiting our nation’s capital for an #HonorFlight. We owe these brave Americans a debt we can never possibly repay. Thank you to all of our veterans for your service to our nation. https://t.co/SME6q7OhZK","date":"Tue Sep 21 22:58:17 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI 🚨\n\nOn Saturday, I discussed Biden's #Afghanistan disaster and the $3.5T #welfarestructure bill with @Tom_Basile of @newsmax.More ⬇️ https://t.co/ALQJg0XmOm","date":"Mon Sep 20 19:56:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was saddened to learn of the passing of Russ Cook, an Air Force veteran, avid pilot, and resident of Springboro. At the invitation of his wife Marge, I was honored to attend his Celebration of Life service and present a flag flown over the U.S. Capitol in his memory https://t.co/383ZqGQ7Kb","date":"Fri Sep 17 19:39:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Sunday, I joined @SteveWilsonOH and @LippsforOhio at the groundbreaking of the new @FCSWildcats high school. My thanks to Superintendent of Schools, Dr. Michael Sander, and his team for their dedication and the talented band for their part in making the ceremony a success. https://t.co/uhMkzCnsCM","date":"Thu Sep 16 17:16:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week is National #SmallBusinessWeek, a time to recognize the critical contributions smaller firms make to our economy. Small businesses drive innovation and account for nearly 2/3 of all new jobs created across the country. I encourage everyone to shop small and shop local. https://t.co/onIo9rKbpt","date":"Wed Sep 15 21:36:26 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I spoke with NPR's @MorningEdition about my thoughts on @SecBlinken's testimony. More ⬇️https://t.co/DQQVbyeSCr","date":"Tue Sep 14 19:12:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @SecBlinken testified before the Foreign Affairs Committee. You can watch my questions about the botched withdrawal from #Afghanistan⬇️. https://t.co/RWm1sBbOKk","date":"Mon Sep 13 21:49:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/O3O0Xda2yO","date":"Sat Sep 11 19:22:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"And we must never forget that the terrorists who hate us do so, because we are the greatest nation in the world, and we value and respect the freedom and personal liberty of every human being — no matter their race, religion, or nationality.","date":"Sat Sep 11 19:22:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"That’s what’s made us exceptional throughout our history, and remembering that fact could bring us back together and make sure we continue to lead the world far into the future.\n\n God bless each of you, and God Bless America!","date":"Sat Sep 11 19:22:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"And we’d never forget the thousands of brave men and women who would fight the War on Terror to keep us safe.\n\nTheir sacrifice must serve as a reminder of the challenge we continue to face. Just as we did twenty years ago, we must renew our vow to never forget.","date":"Sat Sep 11 19:22:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For a while, we all came together.  Americans of every political leaning cheered our first responders, saluted our brave men and women in the military, flew our flag, and praised President Bush’s decisive response.  \n\nWe weren’t Republicans or Democrats, we were Americans.","date":"Sat Sep 11 19:22:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"But, most importantly, we all vowed to never forget.  We’d never forget the nearly 3,000 people who died on September 11th.  We’d never forget the heroic sacrifices of the police and firefighters who rushed into harm’s way to save those endangered by the attacks.","date":"Sat Sep 11 19:22:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"20 years ago today, we suffered the worst foreign attack ever on American soil.\n\nWhen the 1st plane hit the World Trade Center’s North Tower at 8:46 AM, we were all stunned by what had happened.\n\nIn just a little over an hour, our world had changed.","date":"Sat Sep 11 19:22:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Everyday, far too many people struggle with thoughts of suicide. They need to know that there is hope, and they are not alone. #WorldSuicidePreventionDay\n\nFor assistance call: \nVeterans: 1-800-273-8255 or text 838255\n\nSuicide Prevention Hotline: 1-800-273-8255","date":"Fri Sep 10 21:52:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I was presented with the ABC Eagle Award for my support of free enterprise in the construction industry. Thank you to Jim Morris and everyone at @OhioValleyABC for this honor. https://t.co/7ImLgQgPDy","date":"Fri Sep 10 16:38:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As lead Republican on this bipartisan legislation, my goal is to guarantee that health insurance companies continue to provide coverage for telehealth visits just as they do for in-person physician visits. More ⬇️ https://t.co/to2Ryz96TI","date":"Thu Sep 09 16:30:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This is disgusting. President Biden’s botched withdrawal may allow an enemy we’ve fought for the last 20 years – the Taliban – to hand over a U.S. military base to our top competitor in the next 20 years — #China. https://t.co/hZpQpLxsFO","date":"Wed Sep 08 21:18:27 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I had the opportunity to brief local small business leaders about what Congress is doing to help small business owners recover from the pandemic. Thank you @PubPrivStrat for hosting this event. https://t.co/lIsKIUs0AZ","date":"Wed Sep 08 16:30:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I met with the team at #northsidedistilling. We discussed how tariffs are negatively affecting their industry, their plans to grow into a new facility &amp; create more jobs, the effectiveness of PPP loans, and the negative impact of inflation. https://t.co/RvKm8WUcWC","date":"Tue Sep 07 21:41:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congratulations to Grace Norman, Southwest Ohio native, for earning a silver medal in the Para Triathlon Women’s Individual at the Paralympics in Tokyo. We are all so proud of you for this impressive accomplishment. https://t.co/98Gwpjqb2J","date":"Fri Sep 03 21:41:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s critically important that we support the brave and women who sacrificed so much supporting us.","date":"Fri Sep 03 19:23:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Ran into four of Cincinnati’s bravest at Kroger on Ferguson. As always, thank you for all that you do to keep our communities safe. https://t.co/1pR23Wi2RK","date":"Thu Sep 02 20:41:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Spoke with @WCPO’s @TanyaORourke about the valuable service our brave men &amp; women in uniform provided for our nation throughout their time in #Afghanistan. https://t.co/DcuImHeBr4","date":"Thu Sep 02 17:00:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement on the withdrawal of the last U.S. troops from #Afghanistan https://t.co/VhSenq0og1","date":"Wed Sep 01 22:57:15 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My mother-in-law, Hilda Brennan, passed away peacefully Thursday at the age of 101. She was a wonderful lady and will be missed. https://t.co/6hWbrwMJsz","date":"Sun Aug 29 22:46:22 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“It’s the worst foreign affairs disaster that we’ve seen in American history.”\n\nSpoke with @WLWT’s John London with about my concerns with #Afghanistan. More ⬇️ https://t.co/ThMYaXJOUQ","date":"Sat Aug 28 18:56:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier today, I spoke with @JohnFBachman with @newsmax on the latest on #Afghanistan, our #bordercrisis, &amp; the #SCOTUS eviction moratorium decision. https://t.co/q3AB7x0WMm","date":"Fri Aug 27 21:26:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Spoke with @TanyaORourke of @WCPO about the situation in #Afghanistan and the warning signs that were ignored. More ⬇️ https://t.co/enHNcUARa6","date":"Fri Aug 27 16:53:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am horrified by the terrorist bombing in Kabul at #HKIA. My sympathies are with the victims of this senseless attack, and their families and loved ones.","date":"Thu Aug 26 16:19:12 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I joined @RepMcCaul, a bipartisan group of Members, &amp; the cast of @USofAlCBS to demand @POTUS continue evacuations from #Afghanistan until all Americans &amp; our Afghan partners are safely out of the country. https://t.co/pBR9BvtD1j","date":"Wed Aug 25 17:36:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I spoke w/ @CBSEveningNews about the debacle in #Afghanistan and its impact on our relationships with our allies across the globe. More ⬇️ https://t.co/WAI1KBiPUO","date":"Tue Aug 24 21:00:53 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I met with President &amp; CEO of @messerwearebldg Tim Steigerwald. We discussed Messer Construction’s job growth plan for the region, his work with @CincyChildrens, and the importance of replacing the Brent Spence Bridge. https://t.co/qZQUjZL4e6","date":"Mon Aug 23 21:39:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Rep. @DanCrenshawTX is right:","date":"Fri Aug 20 14:52:24 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier today, I spoke with @FoxNews’ @kelseykoberg regarding the Administration’s bungled withdrawal from #Afghanistan and its impact on American credibility. More ⬇️ https://t.co/sqblNeg23C","date":"Thu Aug 19 21:59:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Spoke to @BBCNews’s Newsnight this week about the situation in #Afghanistan. You can watch my comments below. https://t.co/gQ2l52WRep","date":"Thu Aug 19 13:13:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The safety of our American citizens, journalists, and Afghan allies is not up for debate. We must ensure their safe return!","date":"Wed Aug 18 19:15:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"🚨ICYMI🚨\n\nLead Republican @RepMcCaul and I were joined by all 22 of our Republican colleagues on @HouseForeignGOP in calling on the Biden Administration to ensure that US forces remain on the ground in #Afghanistan until all Americans are evacuated. \n\nhttps://t.co/jVs66zGL3j","date":"Wed Aug 18 18:06:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great to talk to @npratc’s @ailsachang about President Biden’s speech regarding his debacle in Afghanistan. Listen below: https://t.co/potGiqfPAJ","date":"Mon Aug 16 22:31:45 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement on President Biden’s #Afghanistan debacle: https://t.co/s9qcqdhgSK","date":"Mon Aug 16 19:08:27 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"🚨ICYMI🚨\n\nRecently, I spoke with Mike Allen of @700wlw. We discussed the #InfrastructureBill and the importance of having a balanced budget in Congress. To hear more, click the link below: https://t.co/h4dH3a9aIj","date":"Fri Aug 13 19:43:34 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congratulations to all @wwcsdistrict students, parents, &amp; teachers on these outstanding new facilities. https://t.co/1c4hioxtgf","date":"Thu Aug 12 22:46:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tuesday, I had the honor of participating in the ribbon cutting for the new Winton Woods South Campus, which will serve students from 1st-6th grade. In May, I toured the North Campus, housing 7th-12th grade.","date":"Thu Aug 12 22:46:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"At 5.4%, our #inflation rates continue to rise at the fastest pace in almost 13 years. On top of that, the Senate approved a $3.5 trillion spending resolution, which will only drive inflation higher.","date":"Wed Aug 11 22:11:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With the national debt already approaching $29 trillion, we cannot afford to continue down this path. Congress must balance the budget, or we will go bankrupt. https://t.co/2m84p4ol9k","date":"Wed Aug 11 22:11:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I condemn the ongoing siege of #Daraa by the brutal Assad regime which has claimed 90 lives and practically stopped food &amp; medicine from reaching 50,000 civilians. President Biden must work to end this vicious assault immediately. #Syria #FreedomforDaraa","date":"Tue Aug 10 21:49:26 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I met with @KingAbdullahII who leads Jordan, a stalwart &amp; critical ally in the Middle East. During our meeting, I shared a photo of myself with his father, King Hussein, whom I’d met early in my career in Congress, before he passed away in 1999. https://t.co/3V5SezvNkN","date":"Mon Aug 09 21:31:55 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A new report from @HouseForeignGOP contains the strongest evidence yet that #COVID leaked from a Wuhan lab by mid-September 2019 - a leak China knew about &amp; covered up. The whole world deserves to know what #China knew &amp; when.","date":"Fri Aug 06 18:28:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congratulations to Duke Ragan, Cincinnati native and Western Hills High School grad, for earning a silver medal in the boxing featherweight division at the Olympics in Tokyo. Everyone in Cincinnati is proud of Duke’s incredible accomplishment. https://t.co/2wDF8fOnWq","date":"Thu Aug 05 20:53:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Taiwan Caucus, I applaud House adoption of an amendment I offered with @RepTiffany  to the State Dept. funding bill that would prevent State from buying/making/displaying maps that show #Taiwan as part of #China. https://t.co/yA5gFjcidF","date":"Wed Aug 04 18:04:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The people of #Cuba continue to fight against a Communist regime that has kept them oppressed for 60 years. \n\nWe must denounce socialism &amp; stand w/ the Cuban people. I joined @RepMariaSalazar &amp; other Members of Congress in showing our support. #SOSCuba https://t.co/eF6Bq3lyEM","date":"Tue Aug 03 20:02:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To help bring economic opportunities to Ohio, I joined @SenSherrodBrown &amp; the Ohio delegation on a letter to Administrator Steve Dickson of the @FAANews urging him to make Ohio a test bed for developing new technologies for the National Airspace System. https://t.co/3QAXkzZpXz","date":"Mon Aug 02 21:23:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great news from @RepGarbarino. With the uptick in #ransomeware attacks, it is imperative that we step up our efforts to protect small businesses from cyberattacks.","date":"Thu Jul 29 19:41:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @HouseForeignGOP passed the #Cambodia Democracy Act, legislation I introduced with @RepLowenthal to stand with the Cambodian people against the Hun Sen regime’s ongoing crackdown on democracy and the political opposition. Watch my remarks: https://t.co/coFaOOcKS8","date":"Wed Jul 28 23:20:27 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To learn more: https://t.co/2Y2fx13L56","date":"Wed Jul 28 23:20:27 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the honor of virtually touring @FreseniusKC located in Forest Park. As a member of the Rare Disease Caucus, I understand the importance these dialysis facilities have on our local communities. They provide the necessary care that so many Ohioans need. https://t.co/7AZb7BTo8J","date":"Wed Jul 28 21:20:50 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Americans, including many in the First District, are facing unacceptable delays in renewing their passports. That’s why I joined @RepFitzgerald and 40 of my colleagues to seek answers from the State Dept. on how they plan to address the backlog causing the delay. https://t.co/IrJ80UyG89","date":"Fri Jul 23 18:56:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI \n\nFollowing @POTUS’s town hall at Mount St. Joseph, I spoke with @McKeeWCPO about my thoughts. Watch my remarks: https://t.co/YXVqPhAXv4","date":"Thu Jul 22 23:12:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"“Today, it’s more important than ever that we protect innocent unborn life.” Watch my remarks on the House Floor about making the Hyde Amendment permanent. #HydeSavesLives https://t.co/bTTtTMPDAO","date":"Thu Jul 22 18:47:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I met with @DHLAmericas CEO Mike Parra. We discussed DHL’s activities during the pandemic and their continued efforts to bring more job opportunities to Ohio. https://t.co/oXYLG6nu7Z","date":"Thu Jul 22 16:28:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Ranking Member on the Asia-Pacific Subcommittee, @RepBera and I held a joint subcommittee hearing w/ the Subcommittee on Europe, Energy, the Environment and Cyber on U.S. cooperation with Europe on China and the broader Indo-Pacific. Watch my questions: https://t.co/68g1npvf6C","date":"Wed Jul 21 15:53:05 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the #Kazakhstan Caucus, I met with the Special Representative of the President of Kazakhstan, Erzhan Kazykhan (center), Minister of Justice Beketayev (left), and Amb. Ashikbayev (right). We discussed strengthening bilateral trade and their work to combat #COVID19. https://t.co/nsfiYHKNqk","date":"Tue Jul 20 20:42:49 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With the uptick in #ransomware attacks it’s imperative that we help protect our #smallbusinesses so they can prepare &amp; prevent cyberattacks.","date":"Tue Jul 20 13:55:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As evidenced by the flurry of recent #ransomware attacks, we must step up our cybersecurity efforts and hold those who perpetrate such crimes accountable. This includes the #CCP. #China https://t.co/ZyyjB5b4UG","date":"Mon Jul 19 20:24:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy 100th birthday to Sen. John Glenn - native Ohioan, space pioneer and American hero. Although he’s no longer with us, I thought I’d share a photo with him at the White House when Sharon Draper (from Walnut Hills HS) was named National Teacher of the Year in 1997. https://t.co/XVAjonSVI4","date":"Sun Jul 18 16:06:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Committee Democrats rejected nearly all key Republican amendments to strengthen the bill, including a package I offered to support Taiwan by giving their government the respect they deserve, and combatting the #PRC’s malign influence there. Learn more: https://t.co/aG2XRzr7Eb","date":"Sat Jul 17 19:19:34 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, the House Foreign Affairs Committee passed the EAGLE Act, the House Democrat’s partisan China bill. As the Asia-Pacific Subcommittee’s top Republican, I opposed the bill, because it doesn’t effectively rise to the challenge posed by the #CCP’s bid for global dominance.","date":"Sat Jul 17 19:19:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I joined @RepBradWenstrup, @WarrenDavidson and several state legislators at an event sponsored by Cincinnati and Dayton Right to Life to discuss the importance of the Hyde Amendment and the Mexico City Policy in protecting the unborn. @daylife72 #HydeSavesLives https://t.co/Id7PjUs1vv","date":"Fri Jul 16 19:33:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, House Democrats are trying to undermine that basic principle by eliminating the Hyde amendment, which has saved 2.4 million lives since 1976. We must stand up for the most vulnerable among us and protect the Hyde Amendment. #HydeSavesLives https://t.co/L4AX9SKQv3","date":"Thu Jul 15 20:44:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For over 40 years, no matter their views on abortion, Republicans &amp; Democrats agreed that taxpayer dollars shouldn’t be used to pay for abortions. This reflects the belief shared by most Americans that no one should be forced to pay for a procedure that violates their conscience.","date":"Thu Jul 15 20:44:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I offered one of the amendments that passed which would counter the PRC’s economic warfare, their practice of leveraging economic ties to keep countries silent on human rights, #Taiwan, and the origins of #COVID.  Watch for more details: https://t.co/jjHyEj5Qia","date":"Thu Jul 15 02:50:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tomorrow, @HouseForeignGOP will vote on more amendments to the EAGLE Act, the House Democrats’ China bill. So far, my Democratic colleagues have agreed to a few Republican amendments which will improve the bill, but the legislation still needs significant changes.","date":"Thu Jul 15 02:50:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I gave a legislative update to the Lebanon Kiwanis Club at @TheGoldenLamb. Thank you to Kiwanis club president, Adam Mathews, and your members for the thoughtful discussion, and all the volunteer work you do to help our community. https://t.co/BMIsZro9bx","date":"Wed Jul 14 22:15:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Amendment votes are paused until Thursday, but the votes so far are setting up a stark contrast between the Republican vision for bold action and the Democrats’ hesitance to use our strongest tools to address this generation’s greatest challenge, the threat posed by the #CCP.","date":"Tue Jul 13 23:35:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @HouseForeignGOP begins postponed amendment votes on the Democrats’ China bill - the EAGLE Act. ICYMI, you can watch my remarks from the beginning of the debate describing why we need a tougher response to China than what this bill offers: https://t.co/l73ubotD4w","date":"Tue Jul 13 18:42:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The nationwide protests in #Cuba against the Communist regime’s repression and mismanagement are truly historic. I stand with all brave Cubans who are demanding freedom from the socialist dictatorship. #SOSCuba #PatriaYVida Read more: https://t.co/1o5wRSAJRc","date":"Mon Jul 12 21:33:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Deeply saddened to learn of Judge Norbert Nadel’s passing. Judge Nadel was an outstanding jurist and an even better person. His quick wit and thoughtful deliberations will be sorely missed. Donna and I send our thoughts and prayers to Judge Nadel’s family and loved ones.","date":"Sun Jul 11 03:01:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congratulations to the people of Mongolia on the 100th Anniversary of Mongolia’s independence. The U.S. will continue to be a strong friend and third neighbor in the years ahead! @MGLEmbassy_USA https://t.co/RZr0zTsJRE","date":"Sat Jul 10 02:26:34 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@MGLEmbassy_USA, congratulations to the people of Mongolia on the 100th Anniversary of Mongolia’s independence. The U.S. will continue to be a strong friend and third neighbor in the years ahead! https://t.co/NgPxwSNq83","date":"Sat Jul 10 02:22:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing a very happy 86th birthday to His Holiness the @DalaiLama! Your example is an inspiration to us all. https://t.co/K2mh1Fq0kW","date":"Wed Jul 07 00:40:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the Co-Chair of the U.S.-Philippine Friendship Caucus and the Ranking Member of the Asia and the Pacific Subcommittee, my heart goes out to the people of the Philippines as they mourn the soldiers killed in the tragic transport plane crash on Sunday. https://t.co/eJboPhtb68","date":"Tue Jul 06 19:52:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Fourth of July to you and your family and loved ones. And God bless America! https://t.co/DllTk0Hzan","date":"Sun Jul 04 17:45:13 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Every year since just as Adams had hoped, Americans have celebrated our independence with parades and picnics, concerts and cookouts, festivals and fireworks.  This year, those celebrations seem especially important and poignant.","date":"Sun Jul 04 17:45:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"... with Pomp and Parade ... Games, Sports, Guns, Bells, Bonfires and Illuminations from one End of this Continent to the other from this Time forward forever more.”","date":"Sun Jul 04 17:45:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"245 years ago, our Founding Fathers declared independence from tyranny and oppression.  After the Declaration of Independence was signed, John Adams wrote to his wife Abigail he hoped the day would “be celebrated, by succeeding Generations, as the great anniversary Festival ...","date":"Sun Jul 04 17:45:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s also why I’ve introduced legislation that will help preserve college athletics as we’ve known them by creating a national approach to #NIL compensation.  You can read more about my legislation here: https://t.co/sQKpQiMFzB","date":"Fri Jul 02 17:42:23 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congress must act on #NIL compensation in order to provide the clarity, transparency &amp; level playing field needed going forward. That’s why I joined @RepAGonzalez and four other Members on a letter urging that @EnergyCommerce hold a #NIL hearing in the near future. https://t.co/r5fIQkHIhE","date":"Fri Jul 02 17:42:22 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With Wednesday’s decision from the NCAA to suspend its amateurism rules and allow college athletes to follow state laws regarding name, image and likeness compensation, it’s more clear than ever that a national approach to #NIL compensation will ultimately be necessary.","date":"Fri Jul 02 17:42:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The party also deploys its legions online to silence criticism. When American companies spoke up about #Xinjiang, they were removed from online marketplaces, and brands that spoke up faced online harassment – all orchestrated by the propaganda wing of the PRC party-state.","date":"Thu Jul 01 22:20:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you are the #AppleDaily and express independent thoughts, you get cancelled. If you are Dr. Li Wenliang and want to speak about COVID, you get cancelled.  If you are a #Uyghur, you get cancelled.  And so on and so forth.","date":"Thu Jul 01 22:20:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In other words, they’ve set up the biggest cancel culture in the world, one in which you virtually (and sometimes literally) disappear if you step out of line.","date":"Thu Jul 01 22:20:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The #CCP has an extensive #censorship network that seeks to stamp out criticism of the party and its actions.","date":"Thu Jul 01 22:20:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My sixth amendment to the #China bill expresses our support for freedom of expression for everyone across the globe.","date":"Thu Jul 01 22:20:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Consequently, there is no need for the #CCP to communicate its activities to the people, which means it’s accountable to no one but itself.","date":"Thu Jul 01 22:14:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We see openness as a virtue, because in democratic societies, we derive our strength directly from the people, and they have a right to know what their representatives are doing. Chairman Xi and his cronies derive their strength through division, oppression and manipulation.","date":"Thu Jul 01 22:14:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My amendment highlights the fact that in China, there is no freedom of the press. We saw this poignantly in #HongKong last week with the shutdown of #AppleDaily, the last pro-democracy newspaper in the city. And that’s just one example of the PRC’s efforts to censor the press.","date":"Thu Jul 01 22:14:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My fifth amendment to the #China bill expresses support for #PressFreedom in China and around the globe. As Co-Chair of the Freedom of the Press Caucus, I know that a free and independent press is necessary to help citizens hold their government leaders accountable.","date":"Thu Jul 01 22:14:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My fourth amendment to the #China bill would drive cooperation with the British and Australians on export controls, which are critical to countering the PRC.","date":"Thu Jul 01 22:10:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My fourth, fifth and sixth amendments to the #China bill were adopted by the Foreign Affairs Committee as part of a package of amendments.","date":"Thu Jul 01 22:08:45 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today the #CCP turns 100. From the cultural revolution, to the Tiananmen Square massacre, the oppression of #HongKong, #Tibet, #Xinjiang &amp; the Falun Gong, and the #COVID19 coverup, their rule is an unbroken chain of atrocities. Justice cannot tolerate 100 more years of such evil.","date":"Thu Jul 01 17:21:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our allies and partners need to know that the United States will lead the effort to answer the PRC’s aggressive actions around the globe, and will support and defend them if they’re willing to stand up to Beijing.","date":"Thu Jul 01 05:23:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My third amendment to the #China bill would require the President to develop a whole-of-government strategy to counter the PRC’s master plan to emerge as the world’s dominant economic power, and build a global economy centered on Beijing.","date":"Thu Jul 01 05:23:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Just offered my second amendment to the #China bill, which would remove a reference to executive agreements (Three Joint Communiques) in the bill, preserving congressional silence on these agreements &amp; ensuring the Taiwan Relations Act remains the guiding law on #Taiwan policy.","date":"Thu Jul 01 04:27:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The amendment also includes several additional provisions to help bolster #Taiwan’s defense and improve relations and trade between our two nations.","date":"Thu Jul 01 03:47:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"These provisions include language to pay the proper respect to #Taiwan as a sovereign nation, and to reaffirm our opposition to any use of force by the PRC against Taiwan.","date":"Thu Jul 01 03:46:59 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Just offered my first amendment to the #China bill, to re-insert pro-Taiwan language that had been approved by the Senate, but was left out of the House bill.","date":"Thu Jul 01 03:46:59 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, the Foreign Affairs Comm. is considering the Democrats’ bill on China - the EAGLE Act. Because the bill fails to meet its primary objective (standing up to the PRC), I can’t support it as currently written. But, I’m offering several amendments to improve the final product.","date":"Wed Jun 30 20:09:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As India Caucus Co-Chair, I welcome House passage of H.Res. 402, which @BradSherman &amp; I introduced to express solidarity with #India during its devastating COVID-19 second wave. India has been hard hit, and we must continue to stand with them. Read more: https://t.co/oW3joERIt4","date":"Tue Jun 29 23:56:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, the markup lasted 19 hours, starting at 10 AM on Wednesday and wrapping up a little after 5 AM this morning.  Here’s a quick photo Ranking Member @Jim_Jordan and I took in between debate on amendments at around 2:30 this morning, which was during the markup’s 16th hour https://t.co/uGwUz6Zt35","date":"Thu Jun 24 22:19:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Just wrapped up Day 2 of the marathon Judiciary Committee markup of legislation to regulate, and in some cases break up, America's largest tech companies.","date":"Thu Jun 24 22:19:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I think we need to be careful that we aren't restricting the ability of American companies to compete with China.  Instead, our focus should be more on protecting American companies and consumers from the harmful activities emanating from the Communist Chinese government.","date":"Thu Jun 24 22:19:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today #AppleDaily, Hong Kong’s last pro-democracy newspaper, printed its final edition after aggressive gov’t harassment. As Co-Chair of the Freedom of the Press Caucus, I’m appalled by China’s attacks on the press &amp; the people of Hong Kong. #freehongkong\nhttps://t.co/1rBo45WgnN","date":"Thu Jun 24 18:59:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With the Supreme Court ruling yesterday that the NCAA can’t regulate extra academic benefits for college athletes, it’s clear that only congressional action on name, image and likeness compensation will provide the clarity, transparency &amp; level playing field needed going forward.","date":"Tue Jun 22 16:23:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’ve introduced legislation that will help preserve college athletics as we’ve known them by creating a national approach to #NIL compensation.  You can read more about my legislation here: https://t.co/sQKpQiMFzB","date":"Tue Jun 22 16:23:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"After joining @RepAndyBarr on a letter last month urging the Administration to send vaccines to Taiwan, I welcome the delivery of 2.5 million doses this weekend: https://t.co/ZOLSLlXcrD","date":"Mon Jun 21 21:15:44 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great to discuss shared Indo-Pacific concerns with senior German diplomats, State Secretary @MiguelBergerAA and @GERonAsia Director-General for Asia and the Pacific Petra Sigmund. A unified approach with our allies is critical to facing the region’s challenges, especially China. https://t.co/TOeT3sKcci","date":"Fri Jun 18 20:43:28 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Really enjoyed meeting the eighth grade class from Harrison Junior School when they traveled to Washington for their annual class trip.  They had originally been scheduled to visit our nation’s capital in November, but had to postpone the trip due to the pandemic. https://t.co/JtwM7n2d3E","date":"Wed Jun 16 22:45:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Flag Day.  244 years ago today in 1777, the Second Continental Congress adopted our nation’s first flag, which consisted of 13 stars and 13 stripes to represent the original 13 colonies. God bless you and your families, and God bless America! https://t.co/cokvnQKLxp","date":"Tue Jun 15 00:26:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Great article that illustrates why a national approach to name, image and likeness compensation for college athletes will ultimately be necessary, in order to provide transparency and a level playing field.\nhttps://t.co/y33kWpOF6D","date":"Fri Jun 11 16:36:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Really enjoyed my recent meeting with Winton Woods High School Principal Eric Martin.  He gave me a tour of their new North Campus in Forest Park, which will serve students from 7th to 12th grades with a focus on project-based learning. https://t.co/vwvGKkTB0f","date":"Thu Jun 10 23:05:28 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I welcome the news that the U.S. will donate 500m COVID vaccines to countries around the globe. As India Caucus Co-Chair, I urge the Admin to ensure that, in addition to those already promised last week, India gets any additional doses it needs: https://t.co/a9YaEOGQcM","date":"Wed Jun 09 20:37:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had the pleasure of visiting Coffee Caravan in Lebanon. The business is dedicated to empowering adults with disabilities by providing them with meaningful skills and employment. We had a great discussion about how they’ve adjusted during this difficult time. https://t.co/3G6xHeX9yB","date":"Tue Jun 08 21:08:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today marks the 77th Anniversary of the D-Day invasion -- one of the most important days in our nation's history. We owe a tremendous debt of gratitude to the greatest generation for the sacrifices they made, both at home and abroad, to keep us free and protect us from tyranny. https://t.co/NmJqAnG5Nd","date":"Sun Jun 06 18:03:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today marks the 32nd Anniversary of the  #TiananmenSquare Massacre. We must not forget the innocent victims or countless other victims of the same Chinese Communist Party repression, including those in #HongKong and Xinjiang today. Their aspiration for a free China must live on.","date":"Fri Jun 04 19:00:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: As Ohio and other states decide how best to compensate college athletes for their NIL, I introduced a bill that creates a fair national standard. Check out the press release on the bill here: https://t.co/sQKpQiMFzB","date":"Fri Jun 04 16:51:30 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, and every day, we honor the men and women who paid the ultimate sacrifice for our freedom. May we never forget our fallen heroes and may God bless their families and loved ones. #MemorialDay2021 #NeverForget https://t.co/rvD16ty5q1","date":"Mon May 31 12:48:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Had a great conversation yesterday with @ShereeWLWT about our efforts to help give ALS patients access to cutting edge drugs and treatments. You can watch her report on this critical issue today at 6 and 11 pm #EndALS https://t.co/1fvgct6YkE","date":"Thu May 27 18:32:31 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you multiply seventeen by four, you get 68. I’m 68 years old, so as a proud member of the cicada babies and as a lifelong Cincinnatian, when my sister-in-law sent this @Enquirer cartoon to me, I thought I’d share it with others who would appreciate it. https://t.co/q3jD0gXQdu","date":"Fri May 21 20:46:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The cicadas come around once every seventeen years.","date":"Fri May 21 20:46:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Please keep his loved ones in your prayers during this difficult time, as we remember his life of service to country and community. \n\nhttps://t.co/AXZgG1RoSD","date":"Fri May 21 17:52:45 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"He was a fixture in his community, including at J.F. Burns Elementary School, where he was honored at their Veterans Day parade.","date":"Fri May 21 17:52:44 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Sgt. Halcomb’s heroic service in Europe during WWII, from Normandy to the Battle of the Bulge, contributed to its liberation from the grip of Nazi Germany and will never be forgotten.","date":"Fri May 21 17:52:44 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was saddened to learn of the passing of Army Staff Sgt. Howard Halcomb. In June 2019, I had the distinct honor of first meeting Sgt. Halcomb at a town hall meeting and presenting him with a flag for his 100th birthday. https://t.co/PDe96JJsj0","date":"Fri May 21 17:52:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to speak to the Lebanon Rotary Club at @CountrysideYMCA. Thank you to club president, Linda Oda, for inviting me, and to everyone who attended for the thoughtful conversation and for all the work you do in our community. https://t.co/TUldVcPJdK","date":"Thu May 20 19:03:15 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today @HouseForeignGOP reaffirmed our bond with India by passing H.Res. 402 which Rep. @BradSherman &amp; I introduced to call attention to the COVID-19 wave sweeping the country. As Co-Chairs of the India Caucus we strongly believe the U.S. must stand by India in this hour of need.","date":"Wed May 19 20:18:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed how the rising cost of lumber and other building materials are impacting housing affordability, and what can be done to help address this situation. As always, I appreciate your time and suggestions. https://t.co/x9kNNg6fNP","date":"Wed May 19 13:04:27 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks to Dan Dressman and the @cincybuilders for meeting with me last week. https://t.co/sxrl6UsQJJ","date":"Wed May 19 13:04:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to the Greater Cincinnati Northern Kentucky Apartment Association (@GCNKAA) for taking time to discuss how the #COVID19 pandemic has impacted your operations, as well as the challenges facing both tenants and landlords as we re-open the economy. https://t.co/1NMcftGIYF","date":"Tue May 18 16:17:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Congressional India Caucus, I appreciated the Consul General’s assessment of the #COVID19 crisis impacting India, and I look forward to continuing to work together to address our common goals.","date":"Mon May 17 20:21:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, @RepBradWenstrup and I met with Randhir Jaiswal, Consul General of India from New York (@IndiainNewYork), to discuss the importance of a strong United States-India relationship. https://t.co/EPwQB0qjKm","date":"Mon May 17 20:21:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a longtime supporter of #Israel, I’m appalled by the violence we’ve seen this week against Israel, especially the rocket barrages from Hamas terrorists aimed at civilians. To be clear, Israel has every right to defend itself against these barbaric attacks.","date":"Fri May 14 20:31:55 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we commemorate National Police Week, it’s important to show our appreciation for the men and women in law enforcement who risk their lives every day to protect our communities. Thank you for your dedication and the sacrifices you make to keep the rest of us safe. https://t.co/Ia6lQdYeLf","date":"Fri May 14 17:22:19 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Dr. Lofgren, and your team, for this informative discussion and your continued efforts on the successful vaccine rollout. https://t.co/6jfsmFOmtx","date":"Fri May 14 14:33:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, @RepBradWenstrup and I visited @uc_health’s vaccine clinic at the UC Gardner Neuroscience Institute. There, we met with their healthcare officials and patients. We also received a comprehensive briefing on the plans to expand the UC Medical Center Emergency Department. https://t.co/5wtKANoTMA","date":"Fri May 14 14:33:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday Climate Envoy John Kerry testified before the House Foreign Affairs Committee.  You can watch our interchange here: https://t.co/ScVMy5hZM8","date":"Thu May 13 22:22:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last month, I presented Sharon with an American flag that was flown over the U.S. Capitol in honor of her dedication to our community. Thank you, Sharon. https://t.co/ubIKXnndgS","date":"Mon May 10 14:29:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"After sixteen years as the Cincinnati Job Corps Center’s Business &amp; Community Liaison, Sharon Thompson is retiring. She has worked in workforce development for over twenty years, and helped countless people improve their lives over the course of her career.","date":"Mon May 10 14:29:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Mother’s Day!  Four generations, from right to left: my daughter Erica, my wife Donna, and my 101 year old mother-in-law Hilda holding my granddaughter Keira. https://t.co/59A4kXJPKy","date":"Sun May 09 12:45:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today marks the 76th Anniversary of V-E Day. If you are looking for a way to celebrate this holiday, the @DeptofDefense created a comprehensive guide to the history of V-E Day that you can access here: https://t.co/vPRJ7vVYpW https://t.co/CJd5FY8Hgl","date":"Sat May 08 15:20:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I also greatly appreciate Paula Brehm-Heeger (the Eva Jane Romaine Coombe Director of the Library), Brett Bonfield (Chief Operating Officer), and Katie Greifenkamp (Regional Manager) for taking the time to discuss everything CHPL is doing to meet our community’s growing needs. https://t.co/yMyvuInmgG","date":"Thu May 06 18:24:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, Sondra Presley (Price Hill Branch Manager) for leading the tour. https://t.co/y8CHFm9PBl","date":"Thu May 06 18:24:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I visited the newly-renovated Price Hill branch to see the changes and improvements that have been implemented to provide more space and additional resources to meet the needs of students and other library visitors. https://t.co/Xh0X5Agjax","date":"Thu May 06 18:24:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Cincinnati and Hamilton County Public Library (CHPL) is one of our community’s greatest assets. https://t.co/0z7mpxCeEo","date":"Thu May 06 18:23:59 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"McCaul, Wilson, Chabot Urge Blinken to Ensure IAEA Has Access to Iran’s Nuclear Sites\" https://t.co/L6xKz5J7jo","date":"Wed May 05 18:40:30 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It is time to vote for this year's Congressional Art Competition Winner! Follow this link to vote for the work of art that will represent Ohio's First Congressional District on Capitol Hill: https://t.co/BxH2BwvJFS https://t.co/2ae3qOws7L","date":"Tue May 04 20:07:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the Freedom of the Press Caucus, I will continue to use my post on @HouseForeignGOP to highlight attempts to silence journalists and champion their right to do their jobs. https://t.co/mPBNUiKZxh","date":"Mon May 03 22:04:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today on World Press Freedom Day, and every day, we must protect journalists’ ability to report the truth around the globe.","date":"Mon May 03 22:04:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Greg Luncan, Pharmacy Manager, Thomas Miller, Pharmacy Market Manager, and Robert Mills, Sam’s Club Manager, for walking me through their staff training process and discussing the different types of vaccines that they administer. https://t.co/b19hkVWSeS","date":"Fri Apr 30 20:33:55 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI, Sam's Club is diligently working to increase access to the #COVID19 vaccine. Today, I visited one of the Sam’s Club superstores in the First District to get an update on their #COVID19 vaccine rollout. https://t.co/feQxFQwxTJ","date":"Fri Apr 30 20:33:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I visited with a group of 8th grade students at St. Antoninus School to discuss their recent visit to Washington D.C. We talked about their favorite monuments, how our laws are made, and my role as their representative. https://t.co/TZyQ4tcwQZ","date":"Thu Apr 29 19:19:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Wed Apr 28 16:13:19 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 17:36:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 17:27:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 17:24:20 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 16:02:49 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Taiwan's history of medical successes could benefit other nations across the globe. That is just one of the many reasons that the @WHO should #LetTaiwanHelp 🇹🇼🇺🇸.","date":"Tue Apr 27 15:52:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Rather than allow the Chinese Communist Party to continue to dictate who the @WHO invites to its yearly meeting, we should welcome Taiwan's expertise and #LetTaiwanHelp 🇹🇼🇺🇸 https://t.co/q7gjK0iwPB","date":"Tue Apr 27 15:42:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:36:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:33:17 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:32:19 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:29:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:28:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:27:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:27:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:23:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:23:32 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:23:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:22:08 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:21:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:21:08 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:20:47 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:20:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:19:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:19:05 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:18:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:17:28 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:17:17 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:16:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@WHO: It's time to put public health over politics. \n\n#LetTaiwanHelp","date":"Tue Apr 27 15:16:22 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸 https://t.co/cE3HDoGbN7","date":"Tue Apr 27 15:06:56 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 15:06:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:59:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:59:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:58:53 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:39:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:38:55 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:26:12 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:25:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp 🇹🇼🇺🇸","date":"Tue Apr 27 14:23:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With the annual World Health Assembly approaching, WATCH my full message supporting the inclusion of #Taiwan this year by the @WHO here: https://t.co/gXIH8J5DAX","date":"Tue Apr 27 13:53:46 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#LetTaiwanHelp \n\nAs one of the founders and Co-Chairs of the Congressional Taiwan Caucus, I have been a longtime advocate for Taiwan's participation in the World Health Organization (WHO).","date":"Tue Apr 27 13:53:34 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"VACCINATION NEWS: Paul Brown Stadium will serve as a mass #COVID19 vaccination site and distribute 5,000 Pfizer vaccines THIS Sunday between 8 AM and 6 PM! Read more here: https://t.co/vauQDYboxL","date":"Sat Apr 24 17:04:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday, the House PASSED the Tropical Forest and Coral Reef Conservation Act of 2021. This bill combats deforestation, pollution, and overfishing that endanger tropical forests and coral reef ecosystems. \n\nRead more about the legislation here: https://t.co/BcQKIosm1U","date":"Thu Apr 22 21:05:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday, I delivered remarks on the @HouseFloor in support of The Tropical Forest and Coral Reef Conservation Act of 2021, bipartisan legislation I sponsored with Rep. @BradSherman to protect these critical ecosystems around the globe.","date":"Thu Apr 22 16:09:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"WATCH the full speech on the Tropical Forest and Coral Reef Conservation Act of 2021 here: https://t.co/rKGpBU2mvq","date":"Thu Apr 22 16:09:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My mother-in-law, Hilda Brennan, turns 101 today! She’s seen here through the glass (due to the COVID pandemic) last year on her 100th. She’s a graduate of Cincinnati’s Hughes High School, Class of 1938. \n\nHappy birthday, Hilda! https://t.co/FQvtFkAcWi","date":"Wed Apr 21 13:02:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They did so in addition to their day-to-day responsibilities to ensure that children in our District have access to a space to grow and thrive.  \n\nThank you all for your dedication to our community. https://t.co/NZvF22edk5","date":"Fri Apr 16 15:17:59 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Sheakley Boys &amp; Girls Club made sure that the kids in our community had access to a space to conduct their virtual schoolwork as a response to the pandemic. https://t.co/pDSGI7epkq","date":"Fri Apr 16 15:17:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I visited the Sheakley Boys &amp; Girls Club (@BGCGC) in West Price Hill and caught up with Bill Bresser, Chief Executive Officer; Austin Schiff, VP of Revenue Development and Brian Dotson, the facilities Interim Director. https://t.co/5FCLdRaOb4","date":"Fri Apr 16 15:17:55 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I urged my colleagues to support H.R. 1490, legislation that I introduced with @RepAngieCraig. This bipartisan bill streamlines the 504 loan closing and oversight process, and enhances the program for small manufacturers.","date":"Thu Apr 15 13:51:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my full speech on H.R. 1490 here: https://t.co/1907gqPI5I","date":"Thu Apr 15 13:51:43 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ATTENTION ALL CINCINNATI AREA VETERANS: Beginning today, the Cincinnati VA Medical Center will offer #COVID19 vaccines to Veterans, Spouses, and Caregivers as detailed by the SAVE LIVES Act! Read more here: https://t.co/g4dQkzHtal","date":"Thu Apr 08 18:52:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On #WorldHealthDay2021, I urge my colleagues to support the #GlobalHealthSecurityAct🌎.\n\nRep. @GerryConnolly &amp; I wrote the legislation to strengthen global health security by preparing the US &amp; the world to address🆕diseases like #COVID19 before they become pandemics. https://t.co/8ogEk101nr","date":"Thu Apr 08 00:03:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read about the #GlobalHealthSecurityAct🌎 here:\nhttps://t.co/yDaHDVD3Ku","date":"Thu Apr 08 00:03:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, and every day, we remember the atrocities of the Holocaust. #NeverForget https://t.co/zGk4zzfCNM","date":"Wed Apr 07 20:42:28 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As India Caucus Co-Chairs, @BradSherman and I applaud the important role India is taking in regional security. https://t.co/pJNdmsMwAZ","date":"Tue Apr 06 13:31:36 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday the US Navy joined Indian, Japanese and Australian (Quad) military units for critical exercises with the French Navy to improve our ability to work together to secure a free and open Indo-Pacific.","date":"Tue Apr 06 13:31:36 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Cincinnati Zoo is one of our community’s greatest treasures, and I look forward to continuing to work together to make it even better. https://t.co/5tfGaeNw1u","date":"Mon Apr 05 15:40:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, Thane Maynard, CEO of the @CincinnatiZoo, for the update on how the Zoo is using its #PPP funds.  I also greatly appreciate being awarded the first annual James McLaughlin Champion of the Zoo and Distinguished Public Servant Award for 2021. https://t.co/eL88o7RiMr","date":"Mon Apr 05 15:40:19 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I hope you and your family have a blessed Easter Sunday. #HeisRisen https://t.co/PBUiDhGztD","date":"Sun Apr 04 13:00:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was saddened to learn of the passing of U.S. Capitol Police Officer Billy Evans, after today’s attack at the Capitol.","date":"Sat Apr 03 00:32:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We owe so much gratitude to the selfless dedication of the Capitol Police, so please keep Officer Evans’ family and all of his colleagues in your thoughts and prayers as we continue to commemorate Holy Week.","date":"Sat Apr 03 00:32:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: \"Online driver's license renewal among changes in Ohio transportation bill signed by Gov. Mike DeWine\" https://t.co/dRy4lLfyl9","date":"Thu Apr 01 18:11:24 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Friday, I met virtually with Chris Johnson, President &amp; CEO of @CountrysideYMCA. We discussed their experience with the #PPP, their #COVID19 vaccination partnership, and the exciting outlook ahead for the organization and its members. Thank you for the update. https://t.co/ZkSg0CyWYb","date":"Wed Mar 31 12:56:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"May we never forget their sacrifice. #VietnamWarVeteransDay https://t.co/pouiSTQdxp","date":"Mon Mar 29 13:00:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we enter Holy Week, I hope that everyone continues to have a reflective Lenten Season. https://t.co/QkxOXxtPAJ","date":"Sun Mar 28 14:00:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing a blessed Passover to all who observe. https://t.co/TcisjCiCHu","date":"Sat Mar 27 23:30:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I encourage my colleagues to stand with us to support these critical priorities by taking the necessary preventative steps today. https://t.co/T3RbFSuloM","date":"Fri Mar 26 20:51:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Through this legislation, we identified the need for Congress to take leadership on global pandemic preparedness and to make certain that we as a nation are not caught off guard by an emerging infectious disease.","date":"Fri Mar 26 20:51:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Global Health Security Act ensures that the U.S. Government, and the world, are ready for new diseases like the coronavirus, before they become pandemics. For two years, it has been an honor to work alongside Rep. @GerryConnolly on the Global Health Security Act.","date":"Fri Mar 26 20:51:10 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: \"Chabot, Connolly Global Health Security Act Passes Committee\" https://t.co/T3RbFSLWNm","date":"Fri Mar 26 20:46:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As #India Caucus co-chair and Lead Republican on the Asia-Pacific Subcommittee of @HouseForeignGOP, I strongly support warming US-India ties, which I raised at last week’s Subcommittee hearing: https://t.co/YBwn63w7Lb","date":"Wed Mar 24 20:28:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today the Asia, the Pacific, Central Asia and Nonproliferation Subcommittee of the House Foreign Affairs Committee conducted its first hearing of the 117th Congress. \n\nHere are my opening remarks as Ranking Member: https://t.co/KiUctxDxfh","date":"Fri Mar 19 20:41:59 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Rep. @boblatta &amp; I introduced The FIGHT Fentanyl Act to permanently provide @DEAHQ the ability to fight production &amp; distribution of fentanyl analogs, to help keep these dangerous drugs off the streets AND reduce overdose deaths.\n\nREAD MORE HERE:  https://t.co/rAQNqEKoMO","date":"Thu Mar 18 20:15:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With our daughter Erica before heading off to the parade back in 2000.  Happy St. Patrick’s Day everyone! https://t.co/5oxIKJ85P6","date":"Wed Mar 17 13:25:58 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: @GovMikeDeWine today announced eligibility for COVID-19 vaccinations will expand this week to those over 40, and highlighted the mass vaccination site opening soon at @XavierU’s Cintas Center. https://t.co/px3AZieSWR","date":"Tue Mar 16 19:47:57 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we wrap up MS Awareness Week, I want to take a moment to reflect on my brother Ron's 18-year journey with MS. He was diagnosed with MS in 2000 and sadly passed away in 2018.  His absence is felt by everyone who had the good fortune to know him. https://t.co/gfY3n3XSEK","date":"Fri Mar 12 15:58:49 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, @SecBlinken testified before the House Foreign Affairs Committee.  You can view the questions I asked him here: https://t.co/LlAOeYkXyB","date":"Thu Mar 11 17:39:48 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Without these critical tools, far too many could fall prey to global human trafficking networks.  Now, we must build on these successes and make the world a safer place for everyone, no matter where they may live.","date":"Mon Mar 08 21:52:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, we’ve had success on legislation to make sure that women and girls have access to education and the vital resources that society provides to recognize the value of every individual.","date":"Mon Mar 08 21:52:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the top Republican on the Foreign Affairs Subcommittee on Asia and the Pacific, one of my top priorities is ensuring that the State Department promotes policies that protect and advance the lives of women and girls around the world.","date":"Mon Mar 08 21:52:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy International Women's Day!  \n\nWhile we celebrate the achievements and the contributions that women have made, and continue to make, to the world we share, we should also commit to the struggle to protect vulnerable women and girls across the globe.","date":"Mon Mar 08 21:52:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It is always nice to visit with @AutismSpeaks Advocate, Tulika Prasad. Tulika, I am glad that your son Vedant was able to briefly join the discussion about how the pandemic is impacting the autism community. #autismspeaks https://t.co/2Rvoz7OqGJ","date":"Fri Mar 05 16:06:25 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently met with representatives from Cincinnati Right to Life. Thank you, (pictured clockwise from top left) Bob Enouen, Meg DeBlase, Jack Hart, and Mary Clark for taking the time to discuss crucial legislation to protect and defend the most vulnerable among us. https://t.co/NbjMWwTJIh","date":"Wed Mar 03 16:48:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NATO ally Turkey is on the front lines in NW Syria defending innocent civilians from the cruel Assad regime &amp; its backers. As Turkey mourns the first anniversary of the deaths of 33 soldiers in Idlib, my heart is with the Turkish people &amp; the families of the fallen.","date":"Tue Mar 02 22:54:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"First, the Chinese Communist Party tried to hack Operation Warp Speed. Now they are hacking vaccine companies in a fellow democracy, India. Despicable: https://t.co/Wab6dW0QwA","date":"Tue Mar 02 20:30:03 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Looking for a way to virtually celebrate #Ohio's Birthday?\n\nThe @librarycongress has compiled:\n\nRecorded VETERAN history: https://t.co/WSr78uyCAR\n\nA repository of classroom materials for TEACHERS: https://t.co/KXX4kmUTjb \n\n&amp; A PLAYLIST of Ohio recordings: https://t.co/PUTL4cdNkS https://t.co/YpnayyNzyl","date":"Mon Mar 01 19:56:04 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On March 1,1803, Ohio was the 17th state admitted to the Union! #HappyBirthdayOhio #OTD \n\nhttps://t.co/mHZzg5VYFb","date":"Mon Mar 01 19:51:33 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The bill would prohibit the U.S. government from recognizing Russia’s bogus claims of sovereignty over Crimea. You can find more information about the bill here: https://t.co/CiWCezkywb","date":"Fri Feb 26 15:41:36 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today is the 7th Anniversary of the Russian invasion of Crimea. The United States and the world must never recognize Vladimir Putin’s reckless Crimean land grab.  That is why I reintroduced H.R. 922, the Crimea Annexation Non-recognition Act, with @GerryConnolly.","date":"Fri Feb 26 15:41:35 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today is Brunei's 37th National Day! As the lead Republican on the @houseforeigngop's Asia Subcommittee, I wish you a festive, prosperous National Day and continued friendship between our countries.","date":"Mon Feb 22 21:32:05 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/P0EDx8RayV","date":"Mon Feb 22 15:09:15 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we continue to observe #BlackHistoryMonth, consider visiting the National Underground Railroad Freedom Center's website for online exhibits and resources! https://t.co/EK7D10oWZh","date":"Mon Feb 22 14:56:02 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing all who observe #AshWednesday, a peaceful and reflective day as we begin the Lenten Season. https://t.co/1I4P8OKWXn","date":"Wed Feb 17 19:46:29 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I had the opportunity to deliver needed food items to the Little Miami Food Pantry located in Morrow. https://t.co/vD2HCI9oA5","date":"Tue Feb 16 19:52:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Paul Long and his team for their dedication and service to our community. You can learn more about the pantry and their hours of operation here: https://t.co/sIop96Amp2","date":"Tue Feb 16 19:52:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the lead Republican on the @houseforeigngop Asia Subcommittee, I want to wish a Happy Lunar New Year to all who celebrate! #YearoftheOx #LunarNewYear2021🎆 https://t.co/NdyPwt2aMK","date":"Fri Feb 12 15:04:11 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We also discussed the Brent Spence Bridge, Western Hills Viaduct, and other important priorities, as we continue moving forward in the new Congress.","date":"Thu Feb 11 19:17:53 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I had the opportunity to speak with @CincyChamber President, Jill Meyer, as well as their Government Affairs Team. We discussed the success of the Paycheck Protection Program, New Market Tax Credits and the impact of these initiatives on our community. https://t.co/d9DxGx2PGb","date":"Thu Feb 11 19:17:53 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS RELEASE: Chabot Named Ranking Member of the House Foreign Affairs Asia Subcommittee https://t.co/gTv0GM5w9P","date":"Wed Feb 10 17:35:06 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am terribly saddened to learn of Congressman Ron Wright’s passing.  Ron represented Texas with dignity and class, and he was a champion for the rights of the unborn. Donna and I send our deepest condolences to Ron’s wife Susan, his children and all of his loved ones.","date":"Mon Feb 08 18:21:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As National Catholic Schools Week comes to a close, I want to highlight my support for H. Res. 66,  a resolution that recognizes the many contributions that our Catholic Schools make in our communities.","date":"Fri Feb 05 22:51:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a @LaSallePride graduate, I know the benefits of a Catholic education firsthand. https://t.co/yM3raxj6vH","date":"Fri Feb 05 22:51:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"You can learn more about VA’s vaccination program here: https://t.co/I2SQIbpSaT","date":"Fri Feb 05 20:05:37 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the opportunity to speak with @CincinnatiVamc Director, Jane Johnson. We discussed their COVID-19 vaccination program and the pandemic’s impact on Veterans and their staff. A heartfelt thank you to your entire team for your work on behalf of our nation’s veterans. https://t.co/aXnRTztnSl","date":"Fri Feb 05 20:05:36 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the House Caucus on India and Indian Americans, I am appalled by the vandalism of the #Gandhi statue in Davis, CA. Gandhi’s legacy of nonviolence was an inspiration for MLK and most of our fellow citizens, to this day. Such behavior has no place in America.","date":"Fri Feb 05 16:18:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Due to its ties to the Chinese military, Huawei poses a threat to both our national security and American consumers.","date":"Wed Feb 03 16:15:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As such, it’s critical the Biden Administration protect our telecommunications infrastructure by confirming that Huawei will remain on the Commerce Department’s Entity List.\n\nhttps://t.co/L9Uc5Pn6lu","date":"Wed Feb 03 16:15:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As thousands of Americans join today’s virtual March for Life, our commitment to protecting innocent, unborn life has never been stronger.","date":"Fri Jan 29 19:31:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"House Republicans are united in our efforts to prevent attempts to weaken, strip or undermine the Hyde Amendment - federal law that prevents tax dollars being used to pay for abortions. #SaveHyde","date":"Fri Jan 29 19:31:07 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Some good news as we continue to battle #COVID19. @ProcterGamble has developed an at-home test for the virus: https://t.co/oKc8wInwa8","date":"Thu Jan 28 19:14:24 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you are looking for a resource to reflect and learn more about the Holocaust from a museum located in our District, please go to the @cincyhhc's website, which has multiple tools: https://t.co/6MXIg6MRLq https://t.co/pq5zM9kxFb","date":"Wed Jan 27 18:40:52 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today we pause for #HolocaustRemembranceDay and renew our pledge to never forget the atrocities that occurred during the Holocaust.","date":"Wed Jan 27 18:40:51 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Co-Chair of the House Caucus on India and Indian Americans, I wish everyone a festive India #RepublicDay!","date":"Tue Jan 26 21:04:42 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"No one has dedicated more to improving our nation, our state and our community than Rob Portman, and I look forward to continuing to work with him as he begins the next chapter of his life and career.","date":"Mon Jan 25 22:15:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Locally, Senator Portman has been instrumental in efforts to rebuild and modernize our community, helping to obtain federal funding for the Banks and Smale Riverfront Park, Ft. Washington Way, and our ongoing push to replace the Brent Spence Bridge.","date":"Mon Jan 25 22:15:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Over the years, Senator Portman and I have worked side-by-side on critical legislation to combat the opioid epidemic, reform our outdated criminal justice system, and protect and preserve our tropical rain forests.","date":"Mon Jan 25 22:15:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’ve known @senrobportman for a long time, and he’s as dedicated a public servant as you could ever hope to find.","date":"Mon Jan 25 22:15:38 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The pictures below are from the reception that @RepBradWenstrup and I host annually for everyone from Cincinnati in DC for the March. \n\nYou can view more pictures at the following link: https://t.co/s3HeWEOqnE https://t.co/lq80QTYckl","date":"Fri Jan 22 19:17:41 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This year due to #COVID19, the March will be held virtually on January 29.  While we cannot gather together in Washington this year, I thought I would share photos from previous marches.","date":"Fri Jan 22 19:17:40 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On January 22, 1973, the Supreme Court handed down the Roe v. Wade decision. In response, thousands of people who believe in the sanctity of innocent unborn life, make the trip to Washington every year to participate in the March for Life.","date":"Fri Jan 22 19:17:39 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The second is with (pictured left to right) Reps. @RepJoeWilson (R-South Carolina), @RepCuellar (D-Texas) and @RepGusBilirakis (R-Florida). https://t.co/NrQrOjtTW1","date":"Wed Jan 20 22:16:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Here are a couple of photos from President Biden’s inauguration earlier today.  The first picture is with (pictured left to right) Reps. @BobLatta (R-Ohio) and @Robert_Aderholt (R-Alabama). https://t.co/QOcmgZ13IA","date":"Wed Jan 20 22:16:16 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"President Biden largely struck the right tone in his inaugural address, such as the importance of uniting the nation and working together to solve the problems we face.","date":"Wed Jan 20 18:51:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If we are to achieve these goals, the President’s actions will need to mirror his aspirational words.","date":"Wed Jan 20 18:51:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Among the issues that should be tackled in a bipartisan manner are expediting the distribution of COVID-19 vaccines to the American people and repairing our nation’s crumbling infrastructure.","date":"Wed Jan 20 18:51:21 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today we remember and reflect on the life and legacy of Dr. Martin Luther King Jr. #HappyMLKDay https://t.co/0nngJ0ob23","date":"Mon Jan 18 14:00:01 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My floor speech from this afternoon: https://t.co/H3Jtc8e83C","date":"Wed Jan 13 20:06:54 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The disturbing violence being reported must stop immediately, and anyone participating in such violent acts must be held accountable.  \n\nRespecting those with whom we disagree is not a matter of politics; it’s a fundamental principle upon which this nation was founded.","date":"Wed Jan 06 21:07:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"But, we do not, under any circumstances, have the right to violently storm government buildings and threaten the safety of our police officers and our fellow citizens.","date":"Wed Jan 06 21:07:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"What is occurring right now at the Capitol is completely unacceptable.  In America, we have the right to peacefully assemble and protest.","date":"Wed Jan 06 21:07:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"And it is critical that we, as a nation, find a way to put our differences aside, and focus on those basic beliefs that unite us as Americans.","date":"Wed Jan 06 21:07:18 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing you a Happy and Healthy New Year! https://t.co/V18B9ITwKN","date":"Fri Jan 01 13:25:00 +0000 2021","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Donna and I would like to wish everyone a very Merry Christmas. https://t.co/hffApwDuMk","date":"Fri Dec 25 14:00:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Ranking Member Chabot: It’s Time for Congress to Pass Small Business Relief\" https://t.co/SpqvL7kDGs","date":"Tue Dec 22 15:13:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Don’t miss @GovMikeDeWine's #COVID19 press conference TODAY at 2pm.\n\nWatch it here: https://t.co/KDHeS6ytJE #InThisTogetherOhio https://t.co/9KKzHi6Pa4","date":"Thu Dec 17 18:37:36 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#InThisTogetherOhio \n\n@GovMikeDeWine's #COVID19 press conference is today at 3:00 pm. Tune in for updates and more information here: https://t.co/KDHeS6ytJE","date":"Mon Dec 14 19:19:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A blessed and Happy Hanukkah to all who celebrate. https://t.co/u053yxo6ch","date":"Thu Dec 10 23:20:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I spoke at the @HouseGOP leadership press conference on behalf of my bill to extend the Paycheck Protection Program. \n\nAfter visiting 70+ small businesses in Ohio’s First Congressional District, I’ve seen firsthand the impact of the program.","date":"Thu Dec 10 18:09:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It’s time for Congress to get to work and pass a COVID package that contains strong small business relief measures. \n\nWatch my portion of the press conference at the link below: \nhttps://t.co/NtD0NiMiBm","date":"Thu Dec 10 18:09:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in to @GovMikeDeWine's #COVID19 press conference at 𝟐:𝟎𝟎 𝐩𝐦 𝐭𝐨𝐝𝐚𝐲 on the https://t.co/KDHeS6ytJE.","date":"Thu Dec 10 17:33:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently met with members of the @AJCglobal Cincinnati Chapter board to discuss disturbing trends regarding antisemitism in the United States. We must work together to counter antisemitism and it’s impact on the Jewish community. https://t.co/MSu1nUTlbo","date":"Wed Dec 09 18:15:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They were truly the \"Greatest Generation,\" and we owe them more than we can ever possibly repay. #PearlHarbor #GreatestGeneration https://t.co/9wuQO0HBOF","date":"Mon Dec 07 22:17:53 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Seventy-nine years ago today, more than 2,400 Americans lost their lives in the attack on Pearl Harbor. As President Roosevelt wisely predicted, December 7, 1941 was a date that “lived in infamy.\"","date":"Mon Dec 07 22:17:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"But December 7th has become more than a day to remember and mourn those who died that day in Hawaii. It has also become a day to honor the spirit and resiliency of the American people who triumphed over tragedy and helped defend freedom across the globe.","date":"Mon Dec 07 22:17:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#InThisTogetherOhio \n\n@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information here: https://t.co/KDHeS6ytJE","date":"Mon Dec 07 18:09:33 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Mon Dec 07 18:08:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This photo was taken about 30 years ago when I had the pleasure of meeting him at a benefit at Ms. Mims’ Marva Collins School in Roselawn. https://t.co/AW3LWh1TGl","date":"Sat Dec 05 17:50:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was saddened to learn earlier this week that renowned economics professor and columnist Walter Williams passed away at the age of 84.  I was a big fan.","date":"Sat Dec 05 17:50:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you want a #COVID19 test in Ohio, @OHdeptofhealth is making it easier for you to get a test. Please visit the following website to find the closest testing center near you: https://t.co/Sm5NqCNjpi","date":"Fri Dec 04 21:10:03 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@GovMikeDeWine will have his next #COVID19 update today at 2 pm. Watch it here: https://t.co/KDHeS6ytJE","date":"Fri Dec 04 17:06:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday afternoon, I spoke on the House floor in support of my bill to reopen the Paycheck Protection Program. From mom and pop shops to local manufacturers and everything in between, our nation’s small businesses strengthen our communities and our economy.","date":"Fri Dec 04 15:23:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Sadly, too many of them are still hurting. PPP loans have supported over 50 million jobs so far—that’s 50 million people in Cincinnati and across America who were able to pay their bills and support their families.","date":"Fri Dec 04 15:23:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Further delay by Congress jeopardizes small businesses and their employees, who cannot wait until the political logjam has cleared. I urge my colleagues, on both sides of the aisle and in both chambers, to come together and pass a common sense relief package.","date":"Fri Dec 04 15:23:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Paycheck Protection Program has bipartisan backing, and supported millions of #SmallBiz jobs.\n\nThere is over $130 billion in remaining PPP funds. \n\nI have introduced legislation that would reopen the program and ensure aid reaches the small businesses that need it most.","date":"Thu Dec 03 18:56:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, HR 8265, would reopen the Paycheck Protection Program and send relief to mom and pop shops.","date":"Thu Dec 03 17:16:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’ve visited over 70 small businesses in my district, many of whom received help through PPP loans. Unfortunately, many small businesses across our nation and our community are still struggling.","date":"Thu Dec 03 17:16:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"UPDATE: \n#InThisTogetherOhio\n\nTune in to @GovMikeDeWine's #COVID19 press conference at 3:00 pm today on the https://t.co/KDHeS6ytJE.","date":"Mon Nov 30 19:19:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#InThisTogetherOhio\n\nTune in to @GovMikeDeWine's #COVID19 press conference at 2:00 pm today on the https://t.co/KDHeS6ytJE.","date":"Mon Nov 30 18:33:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wrapping up my highlights for Family Literacy Month, I would like to give a shoutout to @cincylibrary for their work to increase access to families during this uncertain time. Read about their latest technology initiatives and their Storytime here: https://t.co/MCJmgZtLo8","date":"Mon Nov 30 16:29:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, join me in supporting our nation’s small businesses and entrepreneurs for Small Business Saturday!\n \nWe can safely #ShopSmall by grabbing a meal to go, purchasing a gift card, or recommending your favorite small businesses to friends and family.","date":"Sat Nov 28 14:05:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I hope you and your family have a Happy Thanksgiving. https://t.co/E2zRlavLA1","date":"Thu Nov 26 16:32:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today @ 2pm: Watch @GovMikeDeWine’s #COVID19 update here ➡️https://t.co/KDHeS6ytJE \n\n#InThisTogetherOhio","date":"Tue Nov 24 16:14:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read more about the initiative to make reading accessible for all here: https://t.co/gLTFFhDmeF","date":"Mon Nov 23 17:07:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For Family Literacy Month, I would also like to highlight Fran DeWine's work with @DollyParton's Imagination Library, a thoughtful book gifting program that gifts free books to children from birth to age five in participating communities.","date":"Mon Nov 23 17:07:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I don't know about you, but I was moved by this commercial. Together, we can slow the spread. #InThisTogetherOhio: https://t.co/02vhE3ZAi1","date":"Fri Nov 20 17:39:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Thu Nov 19 18:25:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our legislation extends the \"Tropical Forest and Coral Reef Conservation Act of 2018\" through fiscal year 2025. This legislation is a companion to S. 4428, sponsored by Senators @senrobportman (R-Ohio) and @SenatorTomUdall (D-N.M.).","date":"Thu Nov 19 15:50:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read the press release here: https://t.co/af3LKREbVx \n\nWatch the floor speech here: https://t.co/RHcMRTvRlj","date":"Thu Nov 19 15:50:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I spoke on the House Floor about the bipartisan legislation that I introduced with Congressman @BradSherman (D-Calif.), a fellow senior Member of the House Committee on Foreign Affairs.","date":"Thu Nov 19 15:50:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#InThisTogetherOhio\n\n@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE.","date":"Tue Nov 17 18:59:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Tue Nov 17 18:37:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@Pampers, a @ProcterGamble company, is being a #ForceforGood and bringing books and educational resources to local community groups and hospital NICUs across the U.S., including right here in Cincinnati at Christ Hospital. \n\nClick here to learn more: https://t.co/pSlFf0whKS","date":"Tue Nov 17 15:28:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"November is Family Literacy Month, so I'd like to highlight a few programs supporting literacy efforts in our community. \n\nStarting with #PampersBrightBeginnings Reading Initiative.","date":"Tue Nov 17 15:28:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Help slow the spread: \n\n✅Practice Social Distancing\n✅Wash your hands \n✅Wear a mask \n\n#InThisTogetherOhio","date":"Fri Nov 13 20:12:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in today for @GovMikeDeWine's #COVID19 press conference here: https://t.co/KDHeS6ytJE","date":"Thu Nov 12 18:22:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@GovMikeDeWine is scheduled to hold a statewide address today at 5:30 pm. Watch it here: https://t.co/3ERaNMrcn3","date":"Wed Nov 11 22:03:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"God bless each man and woman we honor today, as well as their families and loved ones! And God bless America!","date":"Wed Nov 11 14:57:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I also thought I would share a picture of my dad who served in France, England, and Germany during World War II. https://t.co/XZQwgK4liy","date":"Wed Nov 11 14:57:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Since it is Veterans Day, I thought I'd share photos of my two grandfathers, both of whom served during WWI. My dad's dad is seen here (on the left side in the black and white photo) in his air warden uniform during World War II. My mom's dad is the one with the rifle. https://t.co/lnBJ2Tbcj9","date":"Wed Nov 11 14:57:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Veterans Day to all of the men and women who have served, and are serving, in our nation's armed services. We, as a nation, owe you tremendous gratitude for your willingness to serve and protect the ideals we hold so dear.","date":"Wed Nov 11 14:57:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you for your service and sacrifice.","date":"Tue Nov 10 15:02:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today at 2:00 pm EST tune into @GovMikeDeWine's #COVID19 press conference. As our numbers continue to rise, remember that we are all #InThisTogetherOhio #MaskUp. https://t.co/mhmw9anB9i","date":"Mon Nov 09 18:58:38 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":".@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Thu Nov 05 18:08:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a small thank you for their continued service to our country, I dropped off lunch from Kelly's Meats &amp; Deli to the Warren County Veterans Services office (VSO). Its dedicated VSO’s provide an array of services to veterans at no cost. https://t.co/8PT9t2oKfv","date":"Mon Nov 02 15:55:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"You can learn more about their work and hours of operation here: https://t.co/99M6CB7Rmq https://t.co/6MH2rcODCB","date":"Mon Nov 02 15:55:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I had the privilege of delivering lunch from Kelly's Meats &amp; Deli to 11 state troopers of the @OSHP. Thank you Lieutenant O’Bryon, Sergeant Hayes, and your entire team for keeping us safe on and off the road during this difficult time. https://t.co/ihcT24zyK3","date":"Sun Nov 01 21:16:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Lindsay McLaughlin, who operates the home, told me about how she transformed her business due to the pandemic and was able to use #PPP funding to save jobs and create new ones. Thank you Lindsay for the productive discussion. https://t.co/tUq2rwGX2A","date":"Sat Oct 31 20:48:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I visited Optimized Senior Living, a family-owned, and operated assisted living home for senior citizens. https://t.co/T1DZ4h42fR","date":"Sat Oct 31 20:48:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Michael, founder and President of Anactics Consulting and an adjunct professor at @uofcincy, received #PPP funding which has helped him with business expenses during the #COVID19 pandemic. Thank you both for your time and feedback. https://t.co/o0Ie2Y4Uuv","date":"Sat Oct 31 14:45:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I had the opportunity to meet with Marianne O'Neil and her husband Michael Cook. Marianne is the proud owner of the specialty art and jewelry store, Soul Sidekick Studio, in Lebanon. https://t.co/hUcszQs4YU","date":"Sat Oct 31 14:45:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I had the privilege of delivering meals from Skip's Bagel Deli to the Symmes Township Safety Service Center. The Center is home to both law enforcement and fire personnel who serve the township and local community. https://t.co/B8DI1IiqXA","date":"Fri Oct 30 20:24:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Lieutenant Mike Tarr and Fire Chief Ott Huber for the update and for all you do to keep us safe. https://t.co/Iu5enpXvb7","date":"Fri Oct 30 20:24:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I met with Skip Thole at his small business, Skip's Bagel Deli, in Symmes Township. Skip and I discussed how #PPP funding helped him retain his employees during the COVID-19 pandemic. Thank you for your time and assessment of the program. https://t.co/kEP7PiMsiZ","date":"Fri Oct 30 14:18:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you Assistant Principal Jessica Ralston for the briefing and to all of the teachers, administrators, and staff of @SycamoreSchools for all you do to safely educate our students. https://t.co/98qhsgXaWd","date":"Thu Oct 29 20:53:17 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had the pleasure of donating nonperishable food items such as fruit snacks, cheese crackers, and pretzels to Symmes Elementary School. The hand drawn thank you notes from the kids were a real treat. https://t.co/ncjpUNOAiD","date":"Thu Oct 29 20:53:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Wednesday, I visited Joe Smith, the owner of @TheChickenJoint in Symmes Township, to get his feedback on #PPP. The program helped Joe maintain his dedicated staff of 140 and keep his business operating to serve its clientele during this challenging time. https://t.co/G5b1P1gb5g","date":"Thu Oct 29 18:53:21 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, Symmes Township Board of Trustee President Jodie Leis for joining me. https://t.co/7w1tXH17JM","date":"Thu Oct 29 18:53:21 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Remember, we are #InThisTogetherOhio: https://t.co/ibFdS0ojHs","date":"Thu Oct 29 14:19:53 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I also stopped at Fire Station 105 down the road in Miamitown, as I thought they might enjoy some @SUBWAY sandwiches as well. Thank you Chief Scott Schorsch and your fellow firefighters for all that you do to keep us safe. https://t.co/31JzTyNeul","date":"Tue Oct 27 21:09:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently dropped by Fire House 95, in Hooven, to deliver lunch from @SUBWAY to 3 firefighters and the Assistant Chief Mike Siefke as a small thank you for their service to our community. #InThisTogetherOhio https://t.co/j6N51PWvsl","date":"Tue Oct 27 21:05:31 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed the impact of the #COVID19 pandemic on small businesses and how the #PPP funding helped them carry on as an essential business. Thank you for your time and for sharing your experience with me. https://t.co/LnvFjWZkes","date":"Tue Oct 27 20:30:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday, I met with Jim Neyer and Ken Neyer Jr., the President and Vice President of Neyer Plumbing, located in Whitewater Township. https://t.co/jWz9y4tfsy","date":"Tue Oct 27 20:30:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I was in Whitewater Twp. to donate essential items to Whitewater Crossing Church. Thank you, for all that you do for our community. https://t.co/yWhUbgeL89","date":"Tue Oct 27 19:15:08 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":".@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Tue Oct 27 17:38:48 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Finally, I visited with Melissa Hart and Jenny Chilcutt, the owners the Gymnastics Training Center of Ohio to get their feedback on the #PPP as well as to learn of their work innovating and rethinking their classes to safely serve the young athletes they train. https://t.co/HrYqhUllcM","date":"Mon Oct 26 23:47:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Additionally, we delivered @frpisanellos to the all-volunteer men and women of the Carlisle Fire Department. Thank you for your dedication during these difficult times. https://t.co/v6584Wx88x","date":"Mon Oct 26 20:08:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a small token of our gratitude, Mayor Winkler and I dropped off lunch from @frpisanellos to the outstanding officers of the Carlisle Police Department. Thank you to Chief Rogers and your fellow officers for all you do to protect and serve. https://t.co/z3OqZrB0rJ","date":"Mon Oct 26 19:39:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Next, I sat down with Carlisle Mayor Randy Winkler to get an update on current events in his community, the impact of the COVID-19 pandemic, and to discuss my legislative and constituent service work in Congress. Thank you for the thoughtful discussion. https://t.co/S3S4wETHFu","date":"Mon Oct 26 18:14:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I had the opportunity to deliver needed food, personal care, and household items to the Franklin Area Community Services Pantry. https://t.co/9E3Mq3bkHX","date":"Mon Oct 26 17:26:57 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Marty Baker and all of your volunteers for the briefing and your commitment to serving our local community. You can learn more about the pantry, the work they do, and their hours of operation here: https://t.co/bwnU4xxuKY https://t.co/NmJMP08vMY","date":"Mon Oct 26 17:26:57 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Donated essential items to Tri-County S.O.U.L. Ministries (@SNC_life_), last week. Tri-County S.O.U.L. Ministries is a lifeline for many in Springdale. https://t.co/XpNRH47h6S","date":"Sun Oct 25 13:32:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To recognize the exceptional work of the Springdale Police Department, I dropped off lunch from @GoldStarChili. Thank you for keeping us safe! https://t.co/Rop5R2CIuF","date":"Sat Oct 24 13:20:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I would like to give a shout out to the owners, Christine Sansom and Dwayne Sansom and Executive Director of the Springdale Chamber of Commerce, Julie Matheny for discussing the impact that #PPP funding had on your small business. Thank you for your work. https://t.co/So7UaEHI9t","date":"Fri Oct 23 19:36:17 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I stopped by @HomeWell_Cares an assisted living small business located in Springdale. https://t.co/mWKbIoEyaa","date":"Fri Oct 23 19:36:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":".@GovMikeDeWine will discuss CARES Act Funding TODAY at 2:00 pm. Tune in on the https://t.co/KDHeS6ytJE","date":"Fri Oct 23 16:54:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you for taking time to discuss how #PPP funding helped continue your efforts to ensure that our seniors have dignity and well-being through your various services. https://t.co/h2AoQ0acry","date":"Fri Oct 23 14:54:54 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently went to Springdale and visited with the Council on Aging President and CEO, Suzanne Burke and Government Relations Manager, Polly Doran.","date":"Fri Oct 23 14:54:54 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Add this page to your bookmarks for the latest updates on #COVID19 #InThisTogetherOhio:\n https://t.co/0R3mwmLBC4","date":"Thu Oct 22 21:02:47 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":".@GovMikeDeWine's #COVID19 press conference is today at 2:00 pm. Tune in for updates and more information on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Thu Oct 22 13:28:55 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently dropped off some Super 3-Ways from @goldstarchili to the Springdale Fire Department. Thank you for all of your work today and every day. https://t.co/VyAM4bjA2U","date":"Wed Oct 21 15:49:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in to @GovMikeDeWine's #COVID19 press conference at 2:00 pm today on the https://t.co/KDHeS6ytJE.","date":"Tue Oct 20 17:23:57 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you for taking the time to discuss economic development and the day to day impact of #COVID19 on Springdale's community. https://t.co/1quYWgRSf8","date":"Tue Oct 20 13:36:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I was able to sit down with the Mayor of Springdale, Doyle Webster; the City Administrator, John Jones and Assistant City Administrator, Brian Uhl.","date":"Tue Oct 20 13:36:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My wife, Donna, and I know from first-hand experience, it doesn’t get better than being grandparents.  \n\nCongratulations, Chris and Diane.","date":"Sat Oct 17 15:45:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday night, I had the privilege of presenting a flag flown over the US Capitol on July 4, 2020, to Crosby Twp. Trustee Chris Dole.  Trustee Dole is retiring after 20 years of service to the Township. https://t.co/OftpiPZCaN","date":"Sat Oct 17 15:45:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Please join me in thanking him for his dedicated service.  I would also like to congratulate him and his wife, Diane, as they welcome their first grandchild.","date":"Sat Oct 17 15:45:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I appreciate your dedicated service to the people of Mason.  A special thank you to Mason Mayor Kathy Grossmann, who also took the time to join us.   Thank you all very much. https://t.co/DWYvl9hnDO","date":"Fri Oct 16 21:23:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a small thank you during these difficult times, I dropped off lunch from Servatii Pastry Shop &amp; Deli to the fine officers of the @imaginemason Police Department and firefighters of the @imaginemason‘s Station 51 and Station 52.","date":"Fri Oct 16 21:23:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For any of our transitioning service members and Veterans: \n\nThe @DeptVetAffairs redesigned the VA Benefits and Services Participant Guide. You can access this comprehensive guide here: https://t.co/KLtH9NNP0N","date":"Fri Oct 16 19:06:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Next, I met with Chris and Nicole Arnold, the owners of Lavish Salon &amp; Spa, in Lebanon. The #PPP program helped them retain 6 employees and adapt their business to serve their customers safely. Thank you for the thoughtful discussion. https://t.co/4uELOfgxtt","date":"Fri Oct 16 18:00:50 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"PPP allowed @LCScrusaderz to continue educating and serving their student body of over 500 young people. Thank you for your time and your feedback. https://t.co/THTiaflJiI","date":"Thu Oct 15 18:48:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Monday, I enjoyed visiting Lebanon Christian to learn how the #PPP program helped them retain their 75 teachers and staff during the COVID-19 pandemic.","date":"Thu Oct 15 18:48:21 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the weather turns, we must remember to stick to the game plan of washing our hands, wearing masks and keeping up with social distancing. We can do this. #InThisTogetherOhio https://t.co/OK0dJwDFUj","date":"Thu Oct 15 14:13:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I will continue advocating for a second round of PPP for eligible new and second-time applicants.  My bill, H.R. 8265, reopens PPP and sets aside funding for mom and pop businesses with ten employees or fewer. https://t.co/nlqN9LpkLl","date":"Wed Oct 14 17:43:56 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I stopped by Gilkey Windows in Sharonville and met with the company's President, Mike Gilkey, and their COO, Agustin Quirch.  We discussed PPP and how it helped their business during the pandemic. https://t.co/RXdCdBy4d3","date":"Wed Oct 14 17:43:55 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As a thank you for all of their hard work during this challenging time, I delivered @GoldStarChili to the Glendale Fire Department and Police last week. #InThisTogetherOhio https://t.co/sy6LwPXcZQ","date":"Wed Oct 14 14:04:50 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the honor of addressing the @USChamber Small Business Council at their virtual breakfast.","date":"Tue Oct 13 19:06:30 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed H.R. 8265, my bill that would reopen the Paycheck Protection Program, and my efforts to get it to a vote through the discharge petition led by Rep. @HerreraBeutler \n\n#FightForSmallBiz","date":"Tue Oct 13 19:06:30 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Be sure to tune in to @GovMikeDeWine's #COVID19 press conference on the https://t.co/KDHeS6ytJE at 2 p.m. for updates and information.","date":"Tue Oct 13 17:50:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Throughout this pandemic, I have visited many police departments to thank them for their service.  Last week, I delivered Gold Star Chili to the Sharonville Police Department. https://t.co/yPsKJtc7Tq","date":"Tue Oct 13 16:49:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to the men and women of the Sharonville Fire Department.  We appreciate all you do for our community, especially during these challenging times. https://t.co/TSBy0m5Sou","date":"Tue Oct 13 15:23:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I strongly urge my colleagues to restart this program and implement my suggested changes to ensure that the smallest businesses (those with ten or fewer employees) and minority-owned businesses get the help they need.","date":"Fri Oct 09 19:09:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"These workers and their families are in jeopardy through no fault of their own.\n\nSmall businesses need our help.\n \nRight now, there is over $130 billion dedicated to #PPP.  All it would take is congressional action to get this funding into the hands of small businesses.","date":"Fri Oct 09 19:09:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, H.R. 8265, would reopen #PPP for eligible new and second-time applicants, set aside $10 billion for community lenders, and $25 billion for businesses with ten or fewer employees.","date":"Fri Oct 09 19:09:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A recent @NFIB survey indicated that 49% of small business owners would need more financial support in the next year &amp; that 22% of borrowers anticipate layoffs in the next 6 months. This is unacceptable.","date":"Fri Oct 09 19:09:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"According to SBA data, the First Congressional District was one of the top recipients of #PPP funding in Ohio, supporting ~250,000 jobs, more than any other Ohio district.","date":"Fri Oct 09 19:09:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Despite the glitches in the program’s rollout, #PPP has successfully helped millions of #SmallBiz across the nation.","date":"Fri Oct 09 19:09:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As the Ranking Member of the House Small Business Committee, I worked with my colleagues on both sides of the aisle to craft the Paycheck Protection Program in response to #COVID.","date":"Fri Oct 09 19:09:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#PPP was designed to get aid to our nation’s small businesses quickly so that they could keep their workers on payroll during the pandemic.\n \nThe @SBAgov worked quickly, and in the first 14 days of the program, they processed over 14 years’ worth of loans.","date":"Fri Oct 09 19:09:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEW: @AEI released a preliminary working paper yesterday on the Paycheck Protection Program.\n\nThe researchers found that 87% of loans were less than $150,000, a good indicator that the program truly reached small businesses.\n\nClick below for more info:\nhttps://t.co/WRXqwd4yRt","date":"Tue Oct 06 20:40:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: https://t.co/kDzFim1NTA","date":"Tue Oct 06 19:29:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, H.R. 8265, would get them the help they need by setting aside $10 billion for community lenders and $25 billion for businesses with ten or fewer employees.","date":"Tue Oct 06 19:29:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Unfortunately, some mom and pop shops, especially in minority or underserved areas, had trouble accessing the Paycheck Protection Program.\n\nThese small businesses faced structural challenges before COVID-19, and many lacked the necessary relationships with traditional lenders.","date":"Tue Oct 06 19:29:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"That is why I am fighting to restart #PPP and ensure that these small businesses are not left behind.","date":"Tue Oct 06 19:29:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today @ 2pm: Watch @GovMikeDeWine’s #COVID19 update here ➡️ https://t.co/KDHeS6ytJE #InThisTogetherOhio","date":"Tue Oct 06 17:34:03 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to the men and women of the Evendale Police Department for all you do.  We appreciate your service and sacrifice. https://t.co/PHPcT5nRIB","date":"Tue Oct 06 15:16:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was glad to have the opportunity to drop by the Evendale Fire Department in September.  Thank you for all you do to serve our community. https://t.co/SXHADJbyLg","date":"Tue Oct 06 13:24:29 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This fourth-generation family-owned and operated rebar manufacturing, fabrication, and industrial recycling &amp; retail facility received #PPP funding. https://t.co/KFErkJiZK8","date":"Mon Oct 05 21:20:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this summer, I dropped by Byer Steel in Carthage. My team and I met with their CEO, Shayne Byer, and the President, Jonas Allen.","date":"Mon Oct 05 21:20:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"H.R. 8265, which would deliver assistance to small businesses in the form of a second round of PPP loans, simplify forgiveness processes, and expand covered expenses.\n\n#FightForSmallBiz https://t.co/ocS3x2ZcMz","date":"Mon Oct 05 19:06:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to Councilwoman Betsy Sundermann for taking time out of her busy schedule to join me for lunch last month at the iconic @CampWashChili, another great Cincinnati establishment that received #PPP funding to help keep its doors open.","date":"Mon Oct 05 19:06:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I also met Maria Papakirk, who runs the restaurant, one of Cincinnati’s oldest (and finest) chili parlors.  \n\nA few weeks ago, I introduced legislation that would reopen the Paycheck Protection Program for eligible new and second-time applicants.","date":"Mon Oct 05 19:06:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch my statement in support of the bill here: https://t.co/WyTwQPXFmL","date":"Fri Oct 02 19:11:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Represent America Abroad Act seeks to fix a long-running problem at the State Department of low minority representation at the middle and upper echelons of the Foreign Service.  The bill passed out of the House Foreign Affairs Committee yesterday.","date":"Fri Oct 02 19:11:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I advocated for the Represent America Abroad Act's passage, legislation introduced by my good friend, Democratic Congressmember Karen Bass.","date":"Fri Oct 02 19:11:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We may not see eye to eye on a range of issues, but @RepKarenBass and I often work together in a bipartisan manner to advance good legislation like this bill.","date":"Fri Oct 02 19:11:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: I released a statement on the promising news in the September @NFIB jobs report. \n\nFor small businesses that still need help, my bill, H.R. 8265, would reopen the Paycheck Protection Program for eligible new and second-time applicants. https://t.co/j0dlp6E5hl","date":"Fri Oct 02 17:29:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In my opening statement, I highlighted Lacie Sims, owner of Village Family Restaurant in Waynesville, whom I visited over the summer. Lacie used a PPP loan to support her 25 workers and their families. \n\nTo watch my opening remarks, click below:\nhttps://t.co/9fIsEVIAMJ","date":"Thu Oct 01 19:48:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, the House Small Business Committee held a hearing on the impact of COVID-19 on our nation’s food supply chain. \n\nWe heard testimony from several witnesses representing parts of that supply chain, including brewery operators, seafood processors, and farmers.","date":"Thu Oct 01 19:48:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They discussed the challenges they have faced during the coronavirus pandemic and the business models they have implemented, such as direct-to-consumer sales and home delivery, to keep delivering food across America.","date":"Thu Oct 01 19:48:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Food System Small Businesses Share\nChallenges, Pivots in Response to COVID-19\" https://t.co/rwlFyub6MP","date":"Wed Sep 30 22:27:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They were able to utilize #PPP funding to prevent any layoffs and eventually continue to operate and especially innovate, with the help of their 50+ employees. #InThisTogetherOhio https://t.co/DXKZnfQFMx","date":"Wed Sep 30 20:08:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In August, I dropped by the @ManorHouseOhio to meet with Janet &amp; Dave Nelson to discuss how the pandemic has impacted their industry and their business. https://t.co/CZvaT3xSVK","date":"Wed Sep 30 20:08:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I was pleased to meet with Mayor Lisa Mear of the Village of Addyston.  Although Addyston is one of the smallest municipalities in the First Congressional District, #COVID19 has impacted its residents and economy just as significantly.","date":"Wed Sep 30 17:09:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to the Mayor for the informative discussion about COVID and the many projects you hope to accomplish.  #InThisTogetherOhio https://t.co/V6KyzTJFr8","date":"Wed Sep 30 17:09:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you all for your care for our community. #InThisTogetherOhio https://t.co/y23XPXZWNz","date":"Tue Sep 29 19:56:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I spoke with Joan Callahan, the St. George Food Pantry Director, and Janet Cavanaugh about the work they do in the Clifton Heights area to help those in need during this difficult time.  Then I donated essential items to the pantry. https://t.co/8i6jzUxzBa","date":"Tue Sep 29 19:56:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Tune in to @GovMikeDeWine’s #COVID19 press conference today at 2 pm on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Tue Sep 29 17:39:17 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A program unveiled by @WarrenCoCommish will use nearly $1.1 million awarded to the County through the CARES Act to provide grants to small businesses, non-profits, and childcare facilities.","date":"Tue Sep 29 16:39:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read more here to learn about the application process and deadlines: https://t.co/xpkzIMcPBH","date":"Tue Sep 29 16:39:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks to funding from the #CARESAct, small businesses in Warren County now have access to additional funds to keep them afloat during this uncertain time.","date":"Tue Sep 29 16:39:31 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Wishing a meaningful fast for all who observe Yom Kippur. https://t.co/djrOyX1amC","date":"Mon Sep 28 21:54:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Women Impacting Public Policy (@WIPPWeDecide) for your support of my bill, H.R. 8265, and the discharge petition led by @RepHerreraBeutler. \n\nI will continue to #FightForSmallBiz","date":"Mon Sep 28 20:45:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I have enjoyed meeting some of your outstanding students and teachers over the years. (These photos were taken prior to the COVID-19 pandemic and the need for social distancing and masks.) https://t.co/MfXBdCMAkt","date":"Mon Sep 28 19:44:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This year, our Congressional District is honored to have two distinguished schools recognized! Congratulations Harrison's Crosby Elementary School and Cincinnati's C.O. Harrison Elementary School.","date":"Mon Sep 28 19:44:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Since 1982, The National Blue Ribbon Schools Program has recognized academic excellence in our great American Schools through the Blue Ribbon Award.","date":"Mon Sep 28 19:44:42 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am honored to fight for small businesses. \n\nH.R. 8265 would deliver assistance in the form of a second round of PPP loans, simplified forgiveness processes, and expanded covered expenses. \n\n#FightForSmallBiz","date":"Mon Sep 28 19:34:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to the Small Business &amp; Entrepreneurship Council (@SBECouncil) for their support of Rep. @HerreraBeutler’s discharge petition and my legislation, H.R. 8265.","date":"Mon Sep 28 19:34:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am working hard to ensure small businesses, including those in @Franchising411, get the assistance they urgently need to survive and recover. \n\n#FightForSmallBiz","date":"Mon Sep 28 18:02:50 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to the International Franchise Association and 45+ organizations for signing a letter in support of Rep. @HerreraBeutler’s discharge petition and my legislation, H.R. 8265.","date":"Mon Sep 28 18:02:50 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"From bed and breakfasts to small inns, small lodging businesses play a key role in our nation’s travel industry.\n\nI thank @AHLA for their support of my bill, H.R. 8265, which would reopen the Paycheck Protection Program to help even more small businesses.","date":"Sun Sep 27 17:10:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Travel and lodging companies have been hit hard by shutdowns and travel restrictions. \n \nI thank @USTravel for supporting my bill restarting the Paycheck Protection Program, H.R. 8265, and appreciate their work on behalf of small travel businesses.","date":"Sat Sep 26 13:43:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"After talking to hundreds of small businesses in Ohio and across the country, H.R. 8265 includes simplified PPP loan forgiveness processes for loans under $2 million.","date":"Fri Sep 25 20:53:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We must cut through the red tape to ease the rebuilding process for millions of small businesses. #FightForSmallBiz","date":"Fri Sep 25 20:53:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, H.R. 8265, recognizes this need, and includes personal protective equipment as one of the covered expenses of the Paycheck Protection Program.  #FightForSmallBiz","date":"Fri Sep 25 20:12:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As they reopen after public health lockdowns, many small businesses have concerns about worker and customer safety.","date":"Fri Sep 25 20:12:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, H.R. 8265, ensures $25 billion in remaining PPP funds will reach these very small businesses with 10 or fewer employees.","date":"Fri Sep 25 18:01:59 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#FightForSmallBiz America’s mom and pop shops are what drive our Main Streets.  They are innovators and job creators.  Our communities simply wouldn’t be the same without them.","date":"Fri Sep 25 18:01:59 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Rep. @HerreraBeutler and I are spearheading an effort to ensure they get the help they need.\n\nIf enough Members sign her discharge petition, it will force the House to consider my bill, which restarts the Paycheck Protection Program for first- and second-time applicants.","date":"Fri Sep 25 17:15:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I have visited sixty small businesses across Ohio’s First Congressional District.  One thing consistently sticks with me: the resilience &amp; ingenuity of the men and women who work at these businesses.\n\nWithout more assistance, many of their jobs are in jeopardy. #FightForSmallBiz","date":"Fri Sep 25 17:15:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, H.R. 8265, would restart the Paycheck Protection Program and ensure that small businesses have the best opportunity to recover and rebuild.\n \nI thank @NFIB for their support of my bill and appreciate all they do as the voice of small business.\n#FightForSmallBiz","date":"Fri Sep 25 16:13:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our nation’s small business owners purposely pick the hard path.  They put their hearts into running their business and providing for themselves and their employees.\n\nToo many are still struggling due to COVID-19.","date":"Fri Sep 25 16:13:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If 218 Representatives sign-on, we will force a vote on my bill, H.R. 8265, which would provide much-needed support once again to America’s small businesses and their employees through the Paycheck Protection Program. #FightForSmallBiz.","date":"Fri Sep 25 13:04:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, the discharge petition led by Rep. @HerreraBeutler opened for signatures.","date":"Fri Sep 25 13:04:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If 218 Representatives sign-on, we will force a vote on my bill, H.R. 8265, which would provide much-needed support once again to America’s small businesses and their employees through the Paycheck Protection Program.","date":"Fri Sep 25 13:01:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, as a member of the Bipartisan Congressional Opioid Taskforce, I participated in a discussion regarding the safe disposal of opioids.","date":"Thu Sep 24 17:44:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In light of the ongoing opioid epidemic, we must do all we can to make sure that drug prescriptions are used and disposed of in a safe and responsible manner. https://t.co/3FXBQjkv0U","date":"Thu Sep 24 17:44:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Small businesses are in jeopardy through no fault of their own.  We must work quickly to provide a path forward for them.\n\nI will continue to offer targeted, common-sense solutions to provide the help that they desperately need.\n\nhttps://t.co/V37HWHy20q","date":"Thu Sep 24 16:14:29 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"America’s small businesses continue to be challenged by COVID-19. \n \nYesterday, I spoke on the House floor on behalf of my bill, H.R. 8265, that would reopen the Paycheck Protection Program and deliver support to our nation’s small business owners and their employees.","date":"Thu Sep 24 16:14:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It allows small businesses to apply for a second PPP loan if they can demonstrate a revenue reduction.\n\nI also ensured that $25 billion is allotted specifically for mom and pop shops—those with 10 or fewer employees.","date":"Thu Sep 24 16:14:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If a simple majority of my colleagues sign a discharge petition, spearheaded by Rep. @HerreraBeutler, the House can vote to provide this much-needed support for small businesses.","date":"Wed Sep 23 16:02:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"That common sense approach is needed now, more than ever, as many of these mom and pop shops are still reeling from COVID-19.  \n\nLast week, I introduced a bill, H.R. 8265, that would allow small businesses to apply for a second PPP loan and make the program more flexible.","date":"Wed Sep 23 16:02:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On the Small Business Committee, we routinely cross the aisle and work in a bipartisan manner to help our nation’s small businesses.","date":"Wed Sep 23 16:02:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: “Chabot-Connolly Global Health Security Act Passes House” https://t.co/rXiwIyBkSs","date":"Wed Sep 23 15:18:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The bipartisan Global Health Security Act will help address diseases where they emerge before they become a global pandemic. \n\nHealth security is national security since diseases similar to #COVID19 are just one plane ride away from America.","date":"Tue Sep 22 20:09:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The House passed the bipartisan Global Health Security Act, farsighted legislation Rep. @GerryConnolly and I introduced in April 2019 to help prevent diseases like the coronavirus from becoming pandemics. \n\nWatch my speech on the House Floor here: https://t.co/JO5yHs4n58","date":"Tue Sep 22 20:08:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In the absence of agreement on a comprehensive bill, we can use what’s known as a discharge petition, introduced by Rep. @HerreraBeutler, to gather enough support to force a vote and deliver help to small businesses in Cincinnati and across our nation.","date":"Tue Sep 22 17:54:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Small businesses from Cincinnati to Lebanon have used the Paycheck Protection Program to stay afloat during the initial months of the pandemic.  \n \nHowever, many are still operating at a loss and are uncertain about their future.","date":"Tue Sep 22 17:54:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"That’s why I introduced H.R. 8265 last Wednesday, which would allow these small businesses to apply for a second PPP loan &amp; increase flexibility in the program. \n \nThe Paycheck Protection Program has bipartisan backing &amp; has already supported nearly 2 million jobs in Ohio alone.","date":"Tue Sep 22 17:54:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week the SBA will recognize small businesses that have been successful in navigating COVID and sharing best practices.  For more information, click here: https://t.co/I2BSK7UJlJ","date":"Tue Sep 22 15:58:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For more than 50 years, the @SBAgov has designated a week to honor America’s job creators, our country’s 30 million Small Businesses.","date":"Tue Sep 22 15:58:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Ranking Member of the House Small Business Committee, I recognize how COVID has impacted small businesses and how hard they are working to recover.","date":"Tue Sep 22 15:58:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"https://t.co/U83LLoBawb","date":"Sun Sep 20 21:42:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: “House Republicans push to reopen Paycheck Protection Program amid coronavirus relief gridlock” https://t.co/XI91JIhLpy","date":"Fri Sep 18 20:28:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read more here: https://t.co/YYljGz09nm","date":"Fri Sep 18 19:47:51 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Wednesday, I introduced legislation that would extend the Paycheck Protection Program and allow small businesses with fewer than 300 employees to apply for a second loan through the rescue fund. The bill also allots $25 billion for mom and pop shops across the country.","date":"Fri Sep 18 19:47:51 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: “House Republicans push to reopen Paycheck Protection Program amid coronavirus relief gridlock” https://t.co/YYljGz09nm","date":"Fri Sep 18 18:28:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"House Republicans will try to force vote to restart small business loan program\" https://t.co/jKpZLHExhF","date":"Thu Sep 17 15:07:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I introduced legislation that would reopen the @SBAgov Paycheck Protection Program and allow small businesses that have suffered revenue declines to apply for a second loan.","date":"Thu Sep 17 15:06:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"While many small businesses are thriving, others still need help. \n\nMy bill would ensure relief reaches the small business owners and employees who need it most.","date":"Thu Sep 17 15:06:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#PPP loans have already helped 50 million Americans support themselves and their loved ones through these challenging times.","date":"Thu Sep 17 15:06:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: https://t.co/UmXIfcyBSe","date":"Wed Sep 16 23:54:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to Matt Hittinger, Executive Director of the Independent Electrical Contractors in Winton Hills, for allowing me to visit earlier this summer to discuss COVID's impact on your businesses and the economy.","date":"Wed Sep 16 19:00:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The work of the #IEC (Independent Electrical Contractors) is central to our state's efforts to #rebuild. https://t.co/jXjQHxwSFO","date":"Wed Sep 16 19:00:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, the House Judiciary Committee marked up bipartisan legislation that I co-cosponsored to help protect incarcerated pregnant women and their unborn children.  Watch my full remarks here: https://t.co/xNpFTpWEXV","date":"Wed Sep 16 13:54:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today’s signing of the #AbrahamAccords by Israel, the UAE, and Bahrain is a truly significant step toward peace and stability in the Middle East. All Americans can be proud of the part our country played in securing this breakthrough.","date":"Tue Sep 15 20:18:54 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in to watch @GovMikeDeWine’s #COVID19 press briefing today at 2 pm on the https://t.co/KDHeS6ytJE. #InThisTogetherOhio","date":"Tue Sep 15 17:43:54 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"These bipartisan bills, which passed the House, help ensure that @SBAgov programs can continue to support America’s innovators, entrepreneurs, and small business owners.   \nhttps://t.co/trN6j4UxjO","date":"Tue Sep 15 16:05:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday I flew back to Washington to manage several pieces of legislation on the House floor.","date":"Tue Sep 15 16:05:36 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This Saturday, September 19th, there will be #free pop-up COVID testing at Roll Hill School. Read more here: https://t.co/Sm5NqCNjpi #InThisTogether https://t.co/ymqvyGNKkQ","date":"Tue Sep 15 14:37:31 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"While #PPP and EIDL have helped millions of small businesses and their employees, many are still uncertain about their future. \n\nCongress must work together in a bipartisan, bicameral manner to get more help to our Main Street businesses and communities.","date":"Mon Sep 14 20:24:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many of America’s entrepreneurs and mom and pop businesses are still in need of assistance. \n\nI urge my colleagues to come together with Secretary @stevenmnuchin1 to get additional, bipartisan support to our nation’s small businesses.","date":"Mon Sep 14 19:07:07 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I agree with Treasury Secretary @stevenmnuchin1 – \nCongress can still find areas of agreement, especially around help for our nation's small businesses.\nhttps://t.co/qrILbtlaqY","date":"Mon Sep 14 17:59:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"At last week’s @HSBCgop Subcommittee hearing, I talked with witnesses about what our rural small businesses need to recover. \n\nWatch the full hearing here: https://t.co/s0NZwieJoL","date":"Mon Sep 14 13:34:55 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Our nation’s rural small businesses have faced unique challenges, from the Great Recession to the coronavirus pandemic.  \n\nLimited access to broadband, high child care costs, and workforce shortages are just a few issues faced by our rural entrepreneurs and communities.","date":"Mon Sep 14 13:34:54 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently met with @HabitatCincy President &amp; CEO, Ed Lee, and the Mayor of Lincoln Heights, Ruby Kinsey-Mumphrey. We toured a worksite on Jackson Street in the Village of Lincoln Heights &amp; discussed how #PPP funding helped keep their operations afloat. #InThisTogetherOhio https://t.co/60sy3TeEJL","date":"Sat Sep 12 18:19:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week I stopped by Greater New Hope Missionary Baptist Church, a food distribution center in Avondale, to drop off a few donations.  Many thanks to Mr. and Mrs. Chenault and the staff for their service, especially during these challenging times.  #InThisTogetherOhio https://t.co/RNbTS0vrYS","date":"Sat Sep 12 13:29:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to all of the churches and community groups, making sure that families have the food and supplies they need during these challenging times.  #InThisTogetherOhio https://t.co/C8yhiJ6nJh","date":"Fri Sep 11 20:18:42 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I visited Zion Temple First Pentecostal Church in Avondale to drop off a few donations for their monthly community dinner.  Although Ohio’s COVID numbers appear to be moving in the right direction, there is still need. https://t.co/QvelEOTdIX","date":"Fri Sep 11 20:18:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We had a productive discussion with yesterday’s witnesses, including Michael Hiles, founder and CEO of 10XTS in Cincinnati. \n\nThank you, Michael, for taking the time to share your expertise with the Committee.  \n\nTo watch the full hearing, click here: https://t.co/O3AZ5f7fuv","date":"Fri Sep 11 18:01:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"During Wednesday’s Small Business Committee hearing, we discussed financial technology, also known as “fintech.”","date":"Fri Sep 11 18:01:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Over the past few years, fintech &amp; online lenders have offered small businesses another option to access capital beyond family, traditional lenders, &amp; government programs.","date":"Fri Sep 11 18:01:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Never Forget https://t.co/nuzV9HpZXK","date":"Fri Sep 11 12:34:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Reminder: Today at 2 PM @GovMikeDeWine will conduct his #COVID19 briefing. #InThisTogetherOhio \n\nWatch here: https://t.co/KDHeS6ytJE","date":"Thu Sep 10 17:42:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Please note parents of children who qualify do not need to apply to receive these benefits. P-EBT benefits will be loaded onto existing Ohio Direction cards or a pre-loaded card mailed in the coming weeks.","date":"Thu Sep 10 13:49:10 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, @GovMikeDeWine, for your efforts to make sure that children across the state have access to nutritious meals during this difficult time.  Follow this link for more information: https://t.co/CN1Y0OB7Z2","date":"Thu Sep 10 13:49:10 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As we shift to remote learning, many children in our region and across the state are at risk of not having access to the free or reduced lunch benefits they would typically have in school before the global pandemic hit.","date":"Thu Sep 10 13:49:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This program is made possible by the Federal Families First Coronavirus Act, legislation which I voted for in Congress https://t.co/BAmeKEl1zF.","date":"Thu Sep 10 13:49:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday @GovMikeDeWine announced that thousands of Ohio school children who qualify for free or reduced-price meals would receive additional money to purchase nutritious foods through the Pandemic Benefit Transfer program (P-EBT).","date":"Thu Sep 10 13:49:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Stripping journalists for their accreditation is yet another blow against press freedom by the dictator of #Belarus who has, in recent weeks, shut down internet access, blocked news websites, and harassed, arrested, &amp; deported journalists.\n\nRead more here: https://t.co/ANbqi1iDo6","date":"Wed Sep 09 19:08:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: Statement from Freedom of the Press Caucus Co-Chairs Condemning Press Restrictions in Belarus Amid Post-Election Protests https://t.co/ANbqi1iDo6","date":"Wed Sep 09 19:05:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks for also allowing me to see what will soon be an air hub for Amazon Prime. https://t.co/b2r90k3ySy","date":"Wed Sep 09 13:19:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was pleased to have the chance to meet with Candace S. McGraw, CEO of the Cincinnati/Northern Kentucky Airport (CVG), about COVID19’s impact on CVG.  Thanks to the #CARESAct, airports like CVG were able to save a considerable number of jobs and stay afloat. https://t.co/f9tLSWh3DV","date":"Wed Sep 09 13:19:48 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you @cooperlearns for all that you and your great team of teachers and administrators are doing to keep our kids safe.\n\n#InThisTogetherOhio https://t.co/i4E7ihju11","date":"Tue Sep 08 19:40:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to @MasonSchools Superintendent Jonathan Cooper for taking time out of your busy schedule to meet with me earlier this summer.  We know the major impact of COVID on our school system, teachers, students, and parents. https://t.co/i6AznBKQl8","date":"Tue Sep 08 19:40:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in TODAY at 2 pm to watch @GovMikeDeWine's #COVID19 press briefing on https://t.co/KDHeS6ytJE.","date":"Tue Sep 08 17:38:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"At his peak season, it helped him keep about 170 employees on board. Thank you Ken, Mike Stater @warrencosbdc , @imaginemason Mayor Grossmann, and Trustee @lellehedding for the great conversation! #InThisTogetherOhio https://t.co/CPBlUra2Rg","date":"Tue Sep 08 13:49:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently visited Natorp's Nursery Outlet &amp; Landscaping, in Mason to meet with Ken Natorp to learn how the pandemic has impacted his company as well as get his feedback on the #PPP.","date":"Tue Sep 08 13:49:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Happy Labor Day everybody! #endofsummer #celebrateworkforce #maskupOhio https://t.co/TYWLti7JrS","date":"Tue Sep 08 01:46:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I stopped by Lebanon Fire Station 42 with some @LaRosasPizza to thank our firefighters for their ongoing service during this difficult time. Thank you for all you do each and every day. #InThisTogetherOhio https://t.co/ZSjvu9vzOE","date":"Sat Sep 05 18:00:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to Jim Miceli and the Western Hills Community Service Club in Green Township for allowing me to join you for a recent meeting.  Great discussion on COVID and the critical work of rebuilding our nation’s economy. https://t.co/3IMjPfCGR7","date":"Sat Sep 05 14:00:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI our economy added 1.4 million jobs and the unemployment rate declined to 8.4 percent. Read more here: https://t.co/HhtSI90oaB","date":"Fri Sep 04 17:45:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My statement on the August 2020 Jobs Report: https://t.co/if1kjAWvL9","date":"Fri Sep 04 17:11:26 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Coffee Peddlar received #PPP funding. The Heist Co. received support through #EIDL, another program authorized in the #CARES Act to aid small businesses during #COVID. https://t.co/UVvOXf7IHD","date":"Fri Sep 04 17:00:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Ohio's First Congressional District has received more #PPP funding than any other congressional district in the state of Ohio.  I recently met with Pat Frey and Gerilyn Jobe, owners of the Coffee Peddlar and the Heist Co., in Harrison. https://t.co/CAKlWM1VAT","date":"Fri Sep 04 17:00:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As season ticket holders, when our children were young, our family spent many hours enjoying all that Kings Island has to offer.  I couldn’t be more proud of what you mean to @WarrenCoOhio and the state of Ohio.  \n#OhiosLargestPlayground #KingsIsland https://t.co/P1Astzo8gw","date":"Fri Sep 04 14:31:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, @KingsIslandPR Vice President and General Manager Mike Koontz, for hosting me and @imaginemason Mayor Grossmann for a briefing on how @KingsIslandPR safely reopened to the public as well as to discuss how the COVID-19 pandemic has impacted this Warren County icon. https://t.co/LWnF582SqV","date":"Fri Sep 04 14:31:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"While there, I was given a tour of the Department’s new Fire Station and got a chance to thank these wonderful first responders for all they do, especially during these trying times.  #InThisTogetherOhio https://t.co/kQrYqEGtg0","date":"Thu Sep 03 21:27:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Before leaving town, I stopped by the Wayne Township Fire Department to drop off lunch from Bentino's Pizza. https://t.co/XDkMUDby2e","date":"Thu Sep 03 21:27:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"There’s never a bad time to see Chief Gary Copeland. Still, I thought it would be nice to drop off lunch to him, and his fellow officers at the Waynesville Police Department as a small thank you for their dedicated public service during this challenging time.  #InThisTogetherOhio https://t.co/ipDwU4fTlh","date":"Thu Sep 03 19:42:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tune in today @ 2 pm for @GovMikeDeWine's #COVID19 press conference➡️https://t.co/KDHeS6ytJE","date":"Thu Sep 03 17:12:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"With the help of #PPP, they, too, were able to keep their business and 13 loyal employees operating to serve its over 1,200 customers, both large and small, in the vending industry. Thank you for the briefing, tour, and feedback. https://t.co/gmNHOHw5UY","date":"Thu Sep 03 13:30:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"While in Waynesville, I dropped by Area Wide Inc. to meet with Doug Parsons and his business partner Phil Baker. https://t.co/mzNyMFRESG","date":"Thu Sep 03 13:30:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed how he was also able to utilize the #PPP to keep his nine employees on staff. Rick, thanks so much for your hospitality.  I appreciated our discussion and your feedback on the program. https://t.co/ilZRA6Lce3","date":"Wed Sep 02 21:15:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Across the street, I sat down with Rick Lepley, who, along with his daughter Lauren, owns and operates Village Salvage. https://t.co/qUnKWBaYP8","date":"Wed Sep 02 21:15:15 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Michelle Baker, owner of Forget Me Not, a lovely boutique in Waynesville, informed me how the #PPP has helped her keep her employee on staff during this difficult time.  Thank you for taking a few minutes to speak with me, Michelle. https://t.co/36gmmqk25b","date":"Wed Sep 02 17:32:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Lacie Sims, the owner of Village Family Restaurant, spoke with me about how she utilized the #PPP program to keep her 25 workers employed so she could continue to serve the community. She has adapted her business to accommodate pickup, delivery, and indoor dining. https://t.co/QV8uzJuxs3","date":"Wed Sep 02 14:03:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to spend some time in Waynesville to meet with small business owners impacted by the COVID-19 pandemic. https://t.co/PxXp9b4Of3","date":"Wed Sep 02 14:03:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In 2016, @SenRubioPress and I introduced, and the Senate and House, respectively, passed SConRes 38 and HConRes 88, affirming these guarantees. https://t.co/XCaJuiuRhV","date":"Tue Sep 01 20:54:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was thrilled to see @StateDept memos on President Reagan’s “Six Assurances” released yesterday, sending a clear message that America stands with #Taiwan against China’s bullying.","date":"Tue Sep 01 20:54:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to Jeff Hummeldorf, Jane Browe, Sam Mangold-Lenett, William Seidholz, and Diane Powers for allowing me to visit your impressive operation.  \n \n#InThisTogetherOhio https://t.co/ug0nHBxx0v","date":"Tue Sep 01 19:12:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The company received #PPP funding to keep their doors open, and have just recently launched a line of PPE to assist in our country's ongoing battle with COVID. https://t.co/BCaTnYVyOi","date":"Tue Sep 01 19:12:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Casco Manufacturing Solutions is located in Camp Washington. This certified women-owned small business manufactures a variety of products, including medical mattresses and upholstered products. https://t.co/fr5CWSrCk9","date":"Tue Sep 01 19:12:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"TODAY at 2PM: Don’t miss @GovMikeDeWine’s update on Ohio’s response to #COVID19. Watch LIVE: https://t.co/KDHeS6ytJE #InThisTogetherOhio","date":"Tue Sep 01 16:48:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: As the Ranking Member of the House Small Business Committee, I have spoken to hundreds of small businesses in Ohio &amp; across the country.  Yesterday I joined @RepMikeTurner for a roundtable w/ Dayton area small businesses to discuss the #PPP program. https://t.co/W2V7rL2OeP","date":"Tue Sep 01 14:59:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this summer, the U.S. Chamber of Commerce recognized @RepMikeTurner &amp; me with the Spirit of Enterprise Award of 2020. We both received our awards yesterday. Many thanks to the @USChamber for all you do to support policies that will help create jobs &amp; rebuild our economy. https://t.co/RjoGAYdpwY","date":"Tue Sep 01 13:46:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My bill, the MICRO Business Success Act would expand access to capital and technical assistance for small businesses with ten employees or fewer, helping over 8,000 mom and pop shops in Ohio’s First Congressional District alone. https://t.co/2AakhxGl4Z","date":"Mon Aug 31 21:41:32 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We must also enact #PPP reforms that focus on small businesses with ten or fewer employees.","date":"Mon Aug 31 21:41:31 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In fact, a few weeks ago, I introduced legislation (H.R. 8087) that would give small businesses the ability to receive a second round of #PPP.  The PPP program enjoys bipartisan support and has helped millions of small businesses survive COVID.","date":"Mon Aug 31 19:52:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congress must pass another COVID relief package to provide additional relief to small businesses.","date":"Mon Aug 31 19:25:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you @RepMikeTurner, for inviting me to participate in today’s Small Business Roundtable.  I enjoyed our discussion with the @DaytonChamber and the many Dayton-area small businesses that were present.","date":"Mon Aug 31 19:25:26 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They were one of the many businesses in Ohio's First Congressional district to receive #PPP funding. https://t.co/fFweV9boHA","date":"Mon Aug 31 13:53:48 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I had the opportunity to pay a visit to the McKenna family, the owners of @FMMAFCO in Harrison. This family-owned and operated company supplies construction tools and equipment to the power, pulp and paper, petrochemical, metals and mining, &amp; bridge building industries. https://t.co/aJ2RAZry7k","date":"Mon Aug 31 13:53:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Eligible small businesses in Hamilton County have a second chance to apply for a @theHCDC grant of up to $10,000.  These grants can be used for expenses such as mortgage costs, rent or lease costs, utilities, payroll, and personal protective equipment.","date":"Sat Aug 29 19:56:38 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"From #PPP to funding for programs like this one, the #CARESAct continues to positively impact small businesses in our community.  For more information, click below.\nhttps://t.co/zVvxjGxAAK","date":"Sat Aug 29 19:56:38 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The application closes on September 4th at 12:00 pm, so be sure to check out the Hamilton County website for more information on eligibility and to apply.\nhttps://t.co/zVvxjGxAAK","date":"Sat Aug 29 17:01:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks to funding from the #CARESAct, small businesses in Hamilton County now have a second chance to apply for a grant of up to $10,000 through @theHCDC.  Grant funds can be used for expenses such as mortgage costs, rent, utilities, payroll, and PPE.","date":"Sat Aug 29 17:01:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks to funding from the #CARESAct, small businesses in @HamiltonCountyOhio now have a second chance to apply for a grant of up to $10,000 through @theHCDC.  Grant funds can be used for expenses such as mortgage costs, rent, utilities, payroll, and PPE.","date":"Sat Aug 29 14:00:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The application closes on September 4th at 12:00 pm, so be sure to check out the Hamilton County website for more information on eligibility and to apply.\nhttps://t.co/zVvxjGxAAK","date":"Sat Aug 29 14:00:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many thanks to @SBAgov for their hard work on this event.  I hope participants gained a better understanding of the resources and assistance available to them as a result of the #CARES Act.","date":"Fri Aug 28 17:10:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We also talked about the other resources available to small businesses in our community, especially those that are minority-owned or located in underserved areas.","date":"Fri Aug 28 17:10:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the pleasure of participating in a virtual small business roundtable with panelists from numerous organizations, including @SBA_Columbus, @CityofCincy, and @theHCDC.  Thank you to everyone who participated.","date":"Fri Aug 28 17:10:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed legislation that I recently introduced, the MICRO Business Success Act, which would allocate #PPP money specifically to mom and pop shops with ten or fewer employees.","date":"Fri Aug 28 17:10:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read the Taiwan Caucus Co-Chairs’ statement on my website: https://t.co/K9xe33fDam","date":"Fri Aug 28 16:02:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I’ve always championed an FTA with #Taiwan, the 7th largest importer of our ag exports. Today’s decision by President Tsai @iingwen to ease restrictions on American pork and beef imports is a big step forward and a huge win for American farmers.","date":"Fri Aug 28 16:02:22 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I was pleased to learn that #PPP helped keep the company’s doors open. Many thanks to Joe and @AbramsforOhio for taking the time to speak with me. \n#JTMFoodGroup\n#InThisTogetherOhio","date":"Thu Aug 27 21:04:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently stopped by @JTMFoodGroup, located in Harrison, to discuss how the company is managing during COVID. While there, I met with Joe Maas, a co-owner and President of the company, and State Rep. Cindy Abrams. https://t.co/MgYz1b1nIO","date":"Thu Aug 27 21:04:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@AbramsforOhio and I also recently stopped by @CrownPlastics, a manufacturing facility that makes advanced thermoplastics in Harrison. We met with the President/CEO, Gary Ellerhorst, and discussed how #PPP helped the company during COVID 19. https://t.co/o4Ny4awbNZ","date":"Thu Aug 27 19:11:04 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Fun Fact: In the 2014 Winter Olympics, Jamie Anderson won an Olympic gold medal in the inaugural snowboard slopestyle event in Sochi, using Crown Plastics products.","date":"Thu Aug 27 19:11:04 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"TODAY @ 2pm: @GovMikeDeWine will give an update on #COVID19 and Ohio schools. Watch live here: https://t.co/KDHeS6ytJE \n\n#InThisTogetherOhio","date":"Thu Aug 27 17:03:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@AbramsforOhio and I grabbed lunch and met with Brenda Leonard, a co-owner of the restaurant and the staff.  Thanks for the hospitality and great food. #InThisTogetherOhio","date":"Thu Aug 27 16:13:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"@MarketStreetGrille, located in Harrison, is another excellent small business that was able to keep its doors open with the help of #PPP. https://t.co/tPU4W627q5","date":"Thu Aug 27 16:13:48 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you, Mayor Grossmann and @SBA_Columbus, for engaging in this important dialogue. #InThisTogetherOhio","date":"Wed Aug 26 20:43:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had the pleasure of meeting with the staff of @LadlesSoups in @imaginemason to hear how the business utilized #PPP to cover payroll during the pandemic and to learn about the safety protocols they have put in place to serve the public safely. https://t.co/Y8Tn3YSjik","date":"Wed Aug 26 20:43:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thankfully #PPP allowed the company and its 165 employees to continue to meet the needs of its clients, particularly in the aviation industry. #InThisTogetherOhio","date":"Wed Aug 26 18:05:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently paid a visit to @rhinestahl, in Mason, Ohio, where its CFO Anthony Turner and I discussed how the pandemic impacted their business as a global supplier of complex tooling equipment. https://t.co/P74RA2ykN2","date":"Wed Aug 26 18:05:23 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I applaud these individuals for their service and dedication at this challenging time. Thank you for speaking with me and for everything you do, each and every day. #InThisTogetherOhio","date":"Wed Aug 26 15:09:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I had the special privilege of delivering lunch from @ServatiiPastry to @CincyChildrens healthcare professionals in @imaginemason. https://t.co/AoMmgfGiy0","date":"Wed Aug 26 15:09:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: More #COVID19 testing in Cincinnati, TODAY from noon to 6pm.  #InThisTogetherOhio https://t.co/hsSF57kbFw","date":"Wed Aug 26 14:09:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"There is still time to get outside and enjoy all that the county has to offer.  \n\nClick here to check the status of your favorite attraction: https://t.co/B9BlnspCMk  \n\n#InThisTogetherOhio \n#OhioHasIt \n#OhiosLargestPlayground","date":"Tue Aug 25 21:37:38 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I met with Phil Smith, the President and Chief Executive Officer of the Warren County Convention &amp; Visitors Bureau, to discuss COVID, and how they are innovating, adapting, and reopening.  Thank you to everyone @WarrenCountyOH for your hard work. https://t.co/7WgsWJ150s","date":"Tue Aug 25 21:37:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Warren County’s number one industry is tourism. Some call it “Ohio’s largest playground.”  There is no doubt that COVID-19 had a significant impact on tourism, delaying the opening of many of the county’s famed tourist attractions.","date":"Tue Aug 25 21:37:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To bring accountability for the barbaric crimes against the Rohingya, I worked with @HouseForeign Chairman @RepEliotEngel, @SenatorCardin, and @SenToddYoung on legislation to impose sanctions on the Burmese military.","date":"Tue Aug 25 19:04:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Over a million Rohingya remain in refugee camps in Bangladesh, while those left in Burma are facing further atrocities. Neither time nor fatigue should dull our search for accountability.  We must find a lasting solution.","date":"Tue Aug 25 19:04:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today marks the third anniversary of the beginning of the Burmese military’s genocidal campaign against the #Rohingya. When the House passed H. Res 1091 [115], which I authored, we became the only US Government entity to date to call these attacks what they were: a genocide.","date":"Tue Aug 25 19:04:17 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Don’t miss @GovMikeDeWine’s briefing on Ohio’s response to #COVID19, TODAY at 2pm. Watch it here: https://t.co/KDHeS6ytJE  #InThisTogetherOhio","date":"Tue Aug 25 16:38:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"UPDATE: #COVID19 testing in Cincinnati, TODAY until 1PM.  #InThisTogetherOhio https://t.co/RBIWIQNB7B","date":"Tue Aug 25 14:19:31 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I have been proud to advocate for small businesses during my 20-plus years on the House Small Business Committee and as its current Ranking Member. I thank @NFIB for this award and all of their hard work on behalf of America’s small business owners. https://t.co/o6mdSJUQ2D","date":"Mon Aug 24 17:59:37 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I had the honor of receiving the @NFIB Guardian of Small Business Award at a virtual meeting with Ohio members of NFIB. Our nation’s entrepreneurs create jobs, drive our economy, and foster innovation.","date":"Mon Aug 24 17:59:35 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"On Tuesday, I dropped off lunch from Roma's Pizza and Pasta to Clearcreek Township's Fire Department to thank them for their dedicated service to our community. #InThisTogetherOhio https://t.co/cGIqKp8XKZ","date":"Sun Aug 23 13:35:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, I spoke on the House floor about common sense solutions to help small business owners and their workers, including:\n\n• Extending the successful #PaycheckProtectionProgram until Dec. 31\n• Allowing #SmallBiz who suffered revenue losses to apply for a 2nd PPP loan","date":"Sat Aug 22 18:39:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently, I met with Chris Smith from Lighthouse Power Partners to talk about how #PPP has helped keep the lights on. Thank you all for the informative discussion. #InThisTogetherOhio https://t.co/kHlhMRBSe5","date":"Sat Aug 22 17:31:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I just spoke on the House floor in support of America’s small businesses and entrepreneurs. https://t.co/lBe7sqLlbe","date":"Sat Aug 22 17:11:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I delivered lunch from Roma's Pizza and Pasta (a local favorite!) to the fine men and women of the @cityofboroOH Police Department as a small thank you for their work to keep our community safe during this difficult time. #InThisTogetherOhio https://t.co/8J1UmvbHyK","date":"Sat Aug 22 14:27:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"It was great meeting with Randy, Dave, and the team at Watkins Heating &amp; Cooling, which has been in business for more than 26 years. We discussed how #PPP funding helped them operate and keep HVAC systems running during the #COVID19 pandemic. Thank you for your feedback! https://t.co/jqpJmsGK43","date":"Fri Aug 21 16:19:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I had the opportunity to visit Heroes Pizza House and meet with its incredible owners, Melissa &amp; Mike Buehler, who discussed how the #PPP program has helped them during this difficult time. https://t.co/nxuuDEfSao","date":"Fri Aug 21 13:53:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I would like to thank Sarah Simpson, the local branch manager at @PeoplesBank, for her hard work to get their #PPP loan approved along with numerous others. #InThisTogetherOhio","date":"Fri Aug 21 13:53:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Tulika and I usually meet several times a year in my Cincinnati office, along with her 11-year-old son Vedant Singh, who also made a brief cameo appearance at yesterday's virtual meeting.","date":"Thu Aug 20 20:54:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Like many parents of special needs children, Tulika is working each day tirelessly to keep her son safe and engaged during this time of considerable uncertainty.  \n\nThank you, Tulika, for your willingness to educate me on the issues impacting the autism community.  #autismspeaks https://t.co/BEpZpyoLGw","date":"Thu Aug 20 20:54:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Morgan's tenacity inspires my team, and it was great to add her story to yesterday's discussion as Stacy and her family make plans to move Morgan back to campus.","date":"Thu Aug 20 20:54:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"My Chief has an interesting perspective on this issue because her daughter, Morgan, has Autism. Morgan recently finished her sophomore year at George Mason University's Mason LIFE program, where she was learning to live independently, before #COVID19.","date":"Thu Aug 20 20:54:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, my Chief of Staff and I met with Tulika Prasad, and Harnoor Mann, who are great advocates for @autismspeaks to discuss the impact of #COVID19 on the Autism community.","date":"Thu Aug 20 20:54:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"They were participating in a class offered by the @warrencosbdc, designed to help companies create strategies to protect themselves from ongoing severe cyber threats and better prepare for future attacks. \n\nThank you, Mike Stater, for inviting me to participate! https://t.co/r1awHBFHVb","date":"Thu Aug 20 19:41:03 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had the opportunity to speak with a group of small business owners in @cityofboroOH about federal efforts to protect businesses against cybersecurity threats. https://t.co/XPICaGWoqo","date":"Thu Aug 20 19:41:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Don’t miss @GovMikeDeWine’s latest update on the #COVID19 response in Ohio. LIVE at 2PM: https://t.co/KDHeS6ytJE","date":"Thu Aug 20 17:16:14 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you Bari Thornberry, Helen Bisdorf, and Connie Wells for the informative discussion on #COVID19 and the MS community, including the importance of access to emergency preparedness resources and Telehealth services. #MultipleSclerosis https://t.co/pnjp9nv2Wz","date":"Wed Aug 19 21:25:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @RepMikeTurner and I had a virtual meeting with representatives of the Ohio Valley Chapter of the @MSociety.  Pictured on the top right is my Chief of Staff Stacy Barton, who was diagnosed with MS in 2005.  At the time, Stacy was serving as Rep. Turner’s Chief of Staff. https://t.co/Sr0xP0nbnR","date":"Wed Aug 19 21:25:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As many of you know, my brother Ron was diagnosed with MS and lived with the debilitating disease for almost two decades.","date":"Wed Aug 19 21:25:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed how #PPP funding made it possible for PWC to continue to repair HVAC units, plumbing leaks, and general home repairs during the quarantine.  #InThisTogetherOhio https://t.co/8rATVgflBH","date":"Wed Aug 19 14:50:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently toured People Working Cooperatively’s Whole Home Innovation Center in Bond Hill and met with Jock Pitts, President of PWC; Nina Creech, Senior VP of Whole Home Innovation Center and Ron Henlein, Director of Corporate and Community Partnerships. https://t.co/g00PJOqJ1u","date":"Wed Aug 19 14:50:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"People Working Cooperatively is a non-profit that has been making home improvement projects and services accessible for elderly and disabled homeowners in the Tri-State area for many years.","date":"Wed Aug 19 14:50:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"TODAY at 2pm: @GovMikeDeWine will give an update on #COVID19 in Ohio and high school sports this fall season. WATCH HERE: https://t.co/KDHeS6ytJE","date":"Tue Aug 18 15:45:53 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#Delivery I had the pleasure of delivering @LaRosasPizza to the wonderful team of first responders at the Hamilton Township Fire Department. Thank you for all you do to keep our community safe. https://t.co/mMg33a3hmc","date":"Tue Aug 18 13:44:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#PopupTesting: This week's  @OHNationalGuard#COVID19 pop-up testing sites #free #InThisTogetherOhio: https://t.co/KZpz5CqeEi","date":"Mon Aug 17 21:07:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"AFTERNOON READ: \"Veterans pave way forward through STEM and small businesses\" https://t.co/S9R0aGe2zR","date":"Mon Aug 17 17:40:26 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"CEO/President Chris Johnson briefed me on the extensive efforts they have made to keep the YMCA’s doors open and their members safe.  Click here to learn more about the great work of this YMCA: https://t.co/cAT9kxNtxg https://t.co/WyPLJoxwIV","date":"Sun Aug 16 21:54:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this week, I toured @CountrysideYMCA to learn about how #PPP funding is helping them advance their mission of supporting health in the local community in response to #COVID19. https://t.co/CIApkcE6i4","date":"Sun Aug 16 21:54:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: In June, I met with Troy Parker, president and CEO of Cincinnati-based Innovative Labor and Cleaning Services, Inc. and listened to his feedback on the #PPP funding guidelines.","date":"Sat Aug 15 13:18:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Troy, your story changed the #PPP guidelines and helped make them more inclusive. Read an update on our work here: https://t.co/45v2EPeCgL","date":"Sat Aug 15 13:18:24 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Social Security turns 85 today. Proud to support this program and our seniors who rely on it. Click here for more information about Social Security and tools that are available to you: https://t.co/Yft6lK2Cqw","date":"Sat Aug 15 00:16:33 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#Delivery Yesterday I stopped by @HamiltonTwpPD to drop off @LaRosasPizza to @ChiefShughes, @BrentCenters and the township’s law enforcement officers. Thank you for your dedicated service during this pandemic. #InThisTogetherOhio https://t.co/8DjoLKHSxI","date":"Fri Aug 14 18:20:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#InThisTogetherOhio https://t.co/MVWSP02aKF","date":"Fri Aug 14 13:04:10 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As former Chairman of the @HouseForeignGOP Middle East Subcommittee, I’m pleased to see the news that Israel and the United Arab Emirates will be normalizing diplomatic relations. Big step for all sides and for peace &amp; stability in the region.","date":"Thu Aug 13 18:20:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Tune in to @GovMikeDeWine’s update on Ohio’s #COVID19 response, TODAY @ 2PM. Watch live: https://t.co/418FRSYirW","date":"Thu Aug 13 17:05:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently stopped by the Cincinnati Fire Department Station 24, in West Price Hill to drop off @LaRosasPizza to our first responders.  Thank you for all that you do to keep our community safe, especially during these tough times. #inthistogetherohio #firefighters https://t.co/DcHGkbfolT","date":"Thu Aug 13 14:04:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We distributed bread, milk, fruits and other food items. Thank you all for being committed to our community during this difficult time. https://t.co/xSGu0kBxay","date":"Wed Aug 12 15:34:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, my staff and I spent some time volunteering for the @CincyCAA for one of their Mobile Food Pantries at The Welcome Project in Camp Washington. https://t.co/94UgttQy5s","date":"Wed Aug 12 15:33:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"TODAY @ 2pm: @GovMikeDeWine will give an update on #COVID19 and Ohio schools. Watch live here: https://t.co/KDHeS6Q4Bc","date":"Tue Aug 11 16:16:25 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I met the owner Dan Elsaesser, Dan’s wife, Trang, and their two children. Thank you for your feedback on #PPP funding and for filling me in on how #COVID19 has impacted The Farm and buffets in general. https://t.co/ZzhUc5sj6o","date":"Tue Aug 11 14:24:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"A few days ago, I went to The Farm, a buffet, banquet hall, and West Side landmark located in Delhi Township. https://t.co/O06ryA7Iv2","date":"Tue Aug 11 14:24:48 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Chabot, Sherman Introduce Legislation to Extend Tropical Forest Conservation Act\" https://t.co/LLNlXCIwFo","date":"Mon Aug 10 20:29:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Executive Director, Sarah Weiss, provided the tour, and we discussed how #PPP funding helped the museum’s doors to reopen last month.  If you are interested in visiting in person or virtually, please click here https://t.co/6MXIg6MRLq https://t.co/2Cp6PQkrhP","date":"Mon Aug 10 12:45:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Founded by Holocaust survivors and their families, its mission is to ensure that the memories and lessons of the Holocaust inspire our actions today. https://t.co/l02BRB3Zl5","date":"Mon Aug 10 12:45:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently visited @cincyhhc, the Holocaust &amp; Humanity Center, located in the historic Union Terminal, the site where many survivors arrived in Cincinnati to rebuild their lives. https://t.co/pIiz0rifTu","date":"Mon Aug 10 12:45:40 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I recently had breakfast with Colerain Township Trustee, Raj Rajagopal, at Sweet Heart Cafe. Thank you to Judy Daleiden, the owner of the cafe, for taking the time to talk to us about the #PPP funding you received. https://t.co/qGTG9NNt9y","date":"Sat Aug 08 18:00:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today is the last day for small businesses to apply for the Paycheck Protection Program. \n\nFrom veterinary hospitals to family restaurants, PPP loans have been a lifeline for millions of businesses around the country.  To apply, contact a participating bank or credit union.","date":"Sat Aug 08 13:00:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Chabot Leads Letter To Treasury, IRS Urging Action on Delayed Stimulus Payments\" https://t.co/M2oo6A1rff","date":"Fri Aug 07 23:30:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The National Flag Company is a family-owned small business that manufactures flags and banners in the West End. They have been in business for 151 years! https://t.co/fsAfvNrVHk","date":"Fri Aug 07 19:33:07 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this week, I met with The National Flag Company President, Art Schaller to discuss #PPP funding and how their #COVID19 business model compares to the 1918 Flu.  (Side note, I found a Crosley Field flag for 1953, which is the year I was born). https://t.co/Z0K3pyGZ44","date":"Fri Aug 07 19:33:07 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Paycheck Protection Program has supported over 200,000 small business jobs in Ohio’s First District and over 50 million across America. \n \nThe last day to apply is tomorrow. Contact a participating bank or credit union to apply. \nhttps://t.co/ezFpNxKRw7","date":"Fri Aug 07 14:49:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Since learning about the crimes against the #Rohingya, I worked to pass bipartisan legislation with @HouseForeign Chairman @RepEliotEngel expressing the House’s position that the atrocities were genocide and to hold the perpetrators accountable through sanctions.","date":"Thu Aug 06 18:12:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week I visited the Total Quality Childcare Center in Colerain Township, a small business that reopened on June 1st. \n\nI also met with the owner, Ryna Rajagopal to discuss how #PPP funding helped keep the doors open. https://t.co/swnDjShaGW","date":"Thu Aug 06 17:53:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this week, I participated in a @HouseForeign Asia Subcommittee hearing on the ongoing plight of the #Rohingya.","date":"Thu Aug 06 13:38:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Three years ago, the Rohingya were targets of genocidal attacks perpetrated by Burmese military committed. \n\nToday, a million Rohingya remain in refugee camps, with many suffering further atrocities. Watch my remarks: https://t.co/RZoRaPnobS","date":"Thu Aug 06 13:38:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: “Chabot Statement on HHS Secretary Azar's Upcoming Visit to Taiwan” https://t.co/DUmj6lKqcG","date":"Wed Aug 05 22:22:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thank you to everyone who participated in last night’s Tele-townhall meeting. We had a great dialogue about #COVID19, protecting seniors and a host of other issues. https://t.co/6t5gohZATA","date":"Wed Aug 05 21:25:36 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week I discussed #PPP, federal small business relief, and underserved businesses at “American Resilience: The Future of Small Business,” with @SCClemons @TheHillEvents #TheHillSmallBiz. \n\nClick here to watch: https://t.co/3AbV6lTd3y","date":"Wed Aug 05 14:34:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Watch @GovMikeDeWine’s #COVID19 update @ 2pm on https://t.co/KDHeS6ytJE.","date":"Tue Aug 04 17:54:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This morning, I joined a Zoom call with Ohio-based representatives of JP Morgan @Chase and various banking professionals from across our state.  Thank you all for the discussion on #PPP funding and how we can continue to help Ohio small businesses recover.","date":"Mon Aug 03 22:19:55 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"If you or someone you know needs to get tested for #COVID19, there are pop-up sites in our area.  Read more here: https://t.co/Sm5NqCNjpi https://t.co/eJV7ljnTt5","date":"Mon Aug 03 15:45:41 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The COVID-19 pandemic has underscored the importance of technology in today’s interconnected world.\n \nMy latest bill, the MICRO Business Success Act, would boost technical assistance and other resources for our smallest businesses through the @ASBDC and @SBAgov Microloan Program. https://t.co/twpAyqGmmg","date":"Sun Aug 02 17:05:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The @SBAgov 504 Loan Program and Microloan Program have successfully helped small businesses create and retain jobs for decades.\n \nMy new bill, the MICRO Business Success Act, would help businesses with 10 employees or fewer access capital using these programs. https://t.co/5NoqFxejdt","date":"Sat Aug 01 15:07:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: Shaheen, Chabot call for action on another round of PPP loans. Read more here: https://t.co/jIPiwAkF0h","date":"Fri Jul 31 16:23:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The #PaycheckProtectionProgram has helped millions of small businesses across the country keep workers on the payroll. \n \nMy bill, the MICRO Business Success Act, would ensure the smallest businesses can access PPP funding. https://t.co/PYqVLLoqJm","date":"Fri Jul 31 13:45:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: I introduced the MICRO Business Success Act last week. \n \nThis bill would expand access to capital and technical assistance for small businesses with 10 employees or fewer, helping over 8,000 mom and pop shops in Ohio’s First Congressional District alone. https://t.co/etmtV2Ln4m","date":"Thu Jul 30 14:00:02 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The MICRO Business Success Act, which I introduced last week, would help these businesses access much-needed capital and technical assistance.","date":"Wed Jul 29 20:33:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Businesses with under 10 workers employ:\n•24,000 people in the First District\n•Over 389,000 in Ohio\n•Nearly 12.6 million across the nation","date":"Wed Jul 29 20:33:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Really China, hacking the Vatican? That’s a low even for the Chinese Communist Party: https://t.co/JBvHExMCES","date":"Wed Jul 29 16:34:51 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Proud to join @senrobportman &amp; every Member of Ohio’s congressional delegation in a letter to @FEMA and @DeptofDefense urging support for @GovMikeDeWine’s request to extend full federal funding for the Ohio National Guard’s #COVID19 response mission. https://t.co/e1PoTAVme5","date":"Tue Jul 28 19:30:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"TODAY at 2 PM: @GovMikeDeWine will give his #COVID19 update. Watch here: https://t.co/KDHeS6ytJE","date":"Tue Jul 28 17:45:18 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congressman Lewis was an icon and it was a privilege to serve with him over the years. You can watch my floor speech in honor of the late Congressman John Lewis here: https://t.co/ZPu8hnJhFR","date":"Mon Jul 27 13:54:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This week, I participated in a virtual town hall with the Alzheimer’s Association of Greater Cincinnati. I’m looking forward to continuing to work with you all on Alzheimer’s and dementia-related legislation. https://t.co/6y9ba7Eicd","date":"Sun Jul 26 17:38:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently stopped by the Turtlecreek Township Fire Department to drop off lunch from Kelly's Meats &amp; Deli as a small thank you for their ongoing efforts to keep our community safe. https://t.co/meqTTdf7o5","date":"Sun Jul 26 14:27:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I met with Denise Devery, owner of DANCEKIDS, a dance studio in Lebanon. We discussed how the studio is reorganizing their space to provide a safe environment for children to learn &amp; continue their training. We also talked about how #PPP funding is making that possible. https://t.co/aVKB9fv0Xr","date":"Sat Jul 25 18:00:01 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We discussed the positive impact that the #PPP had on his business and his incredible team during the ongoing #COVID19 pandemic.\n\n(I couldn’t resist purchasing these patriotic boots. They’ll be great for parades!) https://t.co/Nw05WQ8f2b","date":"Sat Jul 25 13:34:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Recently met with Dan Tormey, owner of Liberty Western, a truly unique business in Lebanon that specializes in western apparel, boots, accessories, and horse supplies. https://t.co/JZXrvenjWr","date":"Sat Jul 25 13:34:11 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"These conversations with small businesses have helped us to find ways to improve and streamline the #PPP program, so that we can help as many small businesses as possible during this crisis.","date":"Sat Jul 25 01:03:47 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I introduced the MICRO Business Success Act of 2020. This legislation will make additional resources available to businesses with 10 or fewer employees that have been hit hard by coronavirus-related shutdowns. \n\nMore here: https://t.co/rJgtbkadCQ","date":"Sat Jul 25 01:03:47 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Over the past few months, I’ve met with 30+ small businesses in the First District and talked with dozens more in my capacity as Ranking Member of the Small Business Committee @HSBCgop. I want to thank the small businesses for their feedback.","date":"Sat Jul 25 01:03:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"To help the smallest businesses survive the pandemic, yesterday I introduced a bill that would ensure that at least $20 billion of remaining #PPP money goes to businesses with 10 or fewer workers.\n\nRead about the legislation here: https://t.co/rJgtbkadCQ","date":"Fri Jul 24 21:16:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: A great story this week from @local12 on the incredible impact the Paycheck Protection Program has had on local businesses. Watch here: https://t.co/sOV2eLgflt","date":"Fri Jul 24 20:25:21 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I want to sincerely thank you all for everything that you do for our community and for not only providing shelter for our at-risk families but for providing the tools needed to achieve housing stability. https://t.co/asL33NWNIp","date":"Fri Jul 24 17:36:10 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Last week, I donated bedding materials (pillows, pillowcases &amp; sheets) to Bethany House. https://t.co/2K7xAqzWFD","date":"Fri Jul 24 17:36:09 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I would like to give a shout out to Bethany House, in South Fairmount, for staying open and accepting homeless and at-risk families during the #COVID19 pandemic. They received #PPP funding, which helped them keep their doors open.","date":"Fri Jul 24 17:36:05 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Earlier this month, I donated supplies to @finallyrose in Paddock Hills. Rosemary’s Babies Co. is a critical resource for many young parents and teens in the Greater Cincinnati Area. \n \nTo learn more, visit: https://t.co/bHWgtAt8Ez https://t.co/zL2eUuy1lX","date":"Fri Jul 24 14:47:44 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"-Helps to ensure that @ASBDC focus on providing training and mentorship to very small businesses.\n \n-Increases flexibility for the SBA Microloan Program.\n\n-Raises the aggregate loan limit for the SBA Microloan Program to $10M.","date":"Thu Jul 23 18:00:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Please click below for more information on the MICRO Business Success Act: https://t.co/rJgtbkadCQ","date":"Thu Jul 23 18:00:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The MICRO Business Success Act:\n-Allots $20B of remaining PPP funds for small businesses with 10 employees or fewer.\n\n-Encourages expansion of the smallest businesses through the @SBAgov 504/CDC Loan Program.","date":"Thu Jul 23 18:00:46 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Over the past few months, I’ve met with 30+ small businesses in the First District and talked with dozens more in my capacity as Ranking Member of @HSBCgop. \n \nWhile PPP funding has helped millions, our smallest firms – those with 10 employees or fewer – are still hurting.","date":"Thu Jul 23 18:00:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"That’s why I introduced the MICRO Business Success Act today. \n\nThis legislation contains targeted, meaningful changes that help to ensure these very small businesses are not left behind.","date":"Thu Jul 23 18:00:45 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"When it comes to reopening schools, I think it’s most important that the school boards, at the local level, are able to make the calls. They’re closest to the families and to the children. \n\nRead more here: https://t.co/ti24XFn0GJ","date":"Thu Jul 23 15:57:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"According to SBA calculations, more jobs were saved in our district than anywhere else in Ohio. Over 17,000 businesses in Hamilton and Warren counties received PPP loans, and those loans saved over 250,000 jobs. \n\nRead more here: https://t.co/sZaFC0xt5U","date":"Wed Jul 22 21:15:47 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"REMINDER: Tune into @GovMikeDeWine’s #COVID19 press conference at 2 p.m. TODAY. Watch here: https://t.co/Tct7jAfe6b","date":"Wed Jul 22 17:55:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The Accounting for Internally Displaced Persons in Former USSR Countries Amendment requires the @StateDept to report on internal displacement &amp; killings of citizens in the illegally occupied territories of Ukraine, Georgia, Azerbaijan, and Moldova.","date":"Wed Jul 22 17:34:29 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Finally, I offered the 𝐀𝐜𝐜𝐨𝐮𝐧𝐭𝐢𝐧𝐠 𝐟𝐨𝐫 𝐈𝐧𝐭𝐞𝐫𝐧𝐚𝐥𝐥𝐲 𝐃𝐢𝐬𝐩𝐥𝐚𝐜𝐞𝐝 𝐏𝐞𝐫𝐬𝐨𝐧𝐬 𝐢𝐧 𝐅𝐨𝐫𝐦𝐞𝐫 𝐔𝐒𝐒𝐑 𝐂𝐨𝐮𝐧𝐭𝐫𝐢𝐞𝐬 amendment with Democratic Congressman @RepCohen.","date":"Wed Jul 22 17:34:29 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Read: “US House of Representatives passes NDAA amendment slamming Chinese aggression against India”\nhttps://t.co/aXbhF0Yzby","date":"Wed Jul 22 17:32:58 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: I joined other members of the Congressional Caucus on India and Indian Americans to express our condolences to Ambassador Sandhu for the killing of Indian troops by China’s People’s Liberation Army and express our condemnation of China’s actions.","date":"Wed Jul 22 17:23:42 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"This amendment was one of the bipartisan amendments I offered to the now House-passed #NDAA (National Defense Authorization Act).","date":"Wed Jul 22 17:20:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"China’s aggression against #India is an affront to the Indian people and to international law.","date":"Wed Jul 22 17:20:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am very pleased that the House added the bipartisan amendment I introduced along with Democratic Congressman @RepBera expressing deep concern over Chinese aggression in the Galwan Valley and #China’s territorial ambitions.","date":"Wed Jul 22 17:20:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"𝐓𝐡𝐞 𝐀𝐦𝐞𝐧𝐝𝐦𝐞𝐧𝐭:\nInstructs the President to develop a government-wide strategy to impose significant consequences on China for its brazen cyber-theft of untold sums worth of intellectual property and the personal information of millions of Americans.","date":"Wed Jul 22 17:16:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"The third amendment I offered was the 𝐂𝐡𝐢𝐧𝐚 𝐂𝐲𝐛𝐞𝐫 𝐒𝐭𝐫𝐚𝐭𝐞𝐠𝐲 amendment.","date":"Wed Jul 22 17:16:52 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Thanks @RepMarciaFudge &amp; @RepMikeTurner for working on the bipartisan 𝐍𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐂𝐞𝐧𝐭𝐞𝐫 𝐟𝐨𝐫 𝐇𝐚𝐫𝐝𝐰𝐚𝐫𝐞 𝐚𝐧𝐝 𝐄𝐦𝐛𝐞𝐝𝐝𝐞𝐝 𝐒𝐲𝐬𝐭𝐞𝐦𝐬 𝐒𝐞𝐜𝐮𝐫𝐢𝐭𝐲 𝐚𝐧𝐝 𝐓𝐫𝐮𝐬𝐭 (𝐂𝐇𝐄𝐒𝐓) &amp; 𝐂𝐲𝐛𝐞𝐫 𝐒𝐞𝐜𝐮𝐫𝐢𝐭𝐲 𝐁𝐞𝐬𝐭 𝐏𝐫𝐚𝐜𝐭𝐢𝐜𝐞𝐬 amendment.","date":"Wed Jul 22 16:55:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"𝐓𝐡𝐢𝐬 𝐀𝐦𝐞𝐧𝐝𝐦𝐞𝐧𝐭:\n\nBolsters cyber security efforts nationwide. \n\nWould provide $3M for CHEST, a cyber security consortium led by @uofcincy in partnership w/ several universities &amp; in conjunction with the @DeptofDefense. \n\nhttps://t.co/vde1zp664Q","date":"Wed Jul 22 16:55:13 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: Please read my op-ed with @GerryConnolly about the importance of preparedness before another pandemic strikes: “Disease knows no borders: Responding to coronavirus” https://t.co/uSfwEGuGWA","date":"Wed Jul 22 16:06:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I offered the 𝐆𝐥𝐨𝐛𝐚𝐥 𝐇𝐞𝐚𝐥𝐭𝐡 𝐒𝐞𝐜𝐮𝐫𝐢𝐭𝐲 𝐀𝐜𝐭 along with Democratic Congressman @GerryConnolly.\n\nThis bipartisan amendment to the House-passed #NDAA provides crucial direction in combatting the current #COVID19 pandemic and future similar outbreaks.","date":"Wed Jul 22 16:05:39 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"House-passed #NDAA includes 5 of my amendments: \n1️⃣ Global Health Security Act\n2️⃣ CHEST &amp; Cyber Security Best Practices\n3️⃣ China Cyber Strategy\n4️⃣ Supporting India Against China’s Territorial Aggression\n5️⃣ Accounting for Internally Displaced Persons in Former USSR Countries","date":"Wed Jul 22 16:00:57 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"NEWS: Five amendments to the 2021 National Defense Authorization Act (NDAA) that I authored passed the House on Monday evening. \n\nRead more here: https://t.co/qpYx88RJXt","date":"Tue Jul 21 20:00:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I attended the Springdale City Council meeting &amp; presented a flag flown over the U.S. Capitol to President of Council, Tom Vanover. The flag honored Tom’s late father, Sgt. Cecil Vanover a @USMC Korean War Veteran &amp; survivor of the Chosin Reservoir Campaign. https://t.co/BNXB5mBabb","date":"Tue Jul 21 16:17:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: “Mnuchin Calls for Forgiving PPP Loans to Smallest Businesses” https://t.co/xShfwWKsdL","date":"Tue Jul 21 15:02:19 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"#ICYMI: \"Next Steps For Federal Small Business Relief\" https://t.co/PtjHELIS9J","date":"Mon Jul 20 15:33:12 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I am saddened to hear of the passing of Civil Rights icon Congressman John Lewis and I extend my condolences to his family, friends and staff.","date":"Sat Jul 18 12:51:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Congressman Lewis was a force for change, and I pray that we always remember his heroism. https://t.co/gvc3orJcGD","date":"Sat Jul 18 12:51:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Many times over the years, Congressman Lewis would ask me how Fred Shuttlesworth was doing. The two were both Civil Rights icons, and Rev. Shuttlesworth had worked side by side with Dr. Martin Luther King, moving to Cincinnati where he lived until 2007 (he passed away in 2011).","date":"Sat Jul 18 12:51:20 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Because some of them don’t have strong relationships with lending institutions, it’s often difficult for them to access capital. I will work to ensure these small businesses are not left behind.","date":"Fri Jul 17 20:43:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"These businesses are very small, typically with 10 or fewer employees. They also may be in minority or economically disadvantaged areas.","date":"Fri Jul 17 20:43:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"As Congress examines ways to further support small businesses, we must not forget mom-and-pop businesses.","date":"Fri Jul 17 20:43:49 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"So far, Congress and the Administration have been able to bolster over 50 million small business jobs.\n\nI have no doubt that we will continue to work together to support our smallest and most vulnerable firms.\n\nClick below to watch the full hearing:\nhttps://t.co/0Uy7M19WaD","date":"Fri Jul 17 20:32:07 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"We had an informative conversation about program implementation and areas of success and improvement.\n\nImportantly, we also discussed what additional support small businesses may need going forward.","date":"Fri Jul 17 20:32:07 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Today, @SBAJovita and @stevenmnuchin1 appeared before the Small Business Committee to discuss #PPP and other federal small business relief efforts.","date":"Fri Jul 17 20:32:06 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Here are my remarks from this morning’s House Committee on Small Business “Oversight of the Small Business Administration and Department of Treasury Pandemic Programs” hearing: https://t.co/XUCi7QxUwN","date":"Fri Jul 17 20:28:42 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"𝐇𝐀𝐏𝐏𝐄𝐍𝐈𝐍𝐆 𝐍𝐎𝐖: House Small Business Committee Oversight of @SBAgov and @USTreasury hearing. \n\nWATCH HERE: https://t.co/DNHnzApj1r","date":"Fri Jul 17 14:35:56 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"WATCH @stevenmnuchin1 and @SBAJovita testify in front of @HSBCgop on the status of small businesses impacted by #COVID19 #PPP #EIDL here: https://t.co/DNHnzApj1r","date":"Fri Jul 17 14:26:59 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"📅𝗢𝗡 𝗧𝗛𝗘 𝗦𝗖𝗛𝗘𝗗𝗨𝗟𝗘 𝗙𝗢𝗥 𝗧𝗢𝗗𝗔𝗬:\n\n𝗛𝗼𝘂𝘀𝗲 𝗦𝗺𝗮𝗹𝗹 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀 𝗛𝗲𝗮𝗿𝗶𝗻𝗴: “Oversight of the Small Business Administration and Department of Treasury Pandemic Programs”\n\n𝗧𝗶𝗺𝗲: 10:30 AM EST\n\n𝗪𝗶𝘁𝗻𝗲𝘀𝘀𝗲𝘀: @stevenmnuchin1 and @SBAJovita","date":"Fri Jul 17 13:55:56 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Witnesses Discuss Modernization, Reducing Barriers as Elements of Small Business Recovery\" https://t.co/fysUbzdLrd","date":"Thu Jul 16 17:07:30 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In particular, I thank @pblackshaw, of Cincinnati, for taking the time to appear before the Committee. I was impressed by Pete’s forward-thinking ideas on small business recovery and entrepreneurship. \n\nTo watch the full hearing, click below: \nhttps://t.co/qQv9WTPaL5","date":"Thu Jul 16 13:47:43 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"At yesterday’s Small Business Committee hearing, we heard from witnesses who talked about past problems and solutions, issues related to COVID-19, and looking toward the future as small businesses recover.","date":"Thu Jul 16 13:47:34 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"There’s no doubt that small businesses have been hit hard by government-mandated shutdowns due to COVID-19. Long-lasting damage to these businesses could pose real danger to communities around our nation.","date":"Thu Jul 16 13:47:33 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"At 5:30 pm, @GovMikeDeWine will address the State of Ohio on COVID-19, the increase in positive cases, and the spread of the virus in Ohio. \n\nYou can watch the address here: https://t.co/r1sgJlEitT .","date":"Wed Jul 15 20:35:00 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"For benefit debts, Veterans should contact the VA Debt Management Center at 1-800-827-0648. \n\nFor health care debts, Veterans should contact the Health Resource Center at 1-866-400-1238 or https://t.co/ulXnlLfwaA for payments.","date":"Wed Jul 15 18:24:28 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"𝐀𝐭𝐭𝐞𝐧𝐭𝐢𝐨𝐧 𝐕𝐞𝐭𝐞𝐫𝐚𝐧𝐬: @DeptVetAffairs recently announced that it will extend debt relief to Veterans impacted by #COVID19 to the end of 2020 by suspending certain debt collection actions.","date":"Wed Jul 15 18:24:27 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"In Case You Missed It: Governor Mike DeWine has set up several pop-up sites where you can get a free COVID test. \n\nClick here for times and locations: https://t.co/jmRTub3efP https://t.co/Y4TxboWWPH","date":"Wed Jul 15 17:07:16 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"I also had a virtual meeting with members of the Ohio Association of Convention and Visitor Bureaus. Thank you for discussing the importance of your industry to Cincinnati, the region, and the entire state of Ohio.","date":"Tue Jul 14 20:53:51 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"Yesterday, I had a virtual meeting w/ the @BrewersAssoc. Thank you for taking time to talk about the Craft Beverage Modernization &amp; Tax Reform Act (CBMTRA), a bill I have supported in the past. Also, it was great to hear about the ways that #PPP funding has helped you stay open.","date":"Tue Jul 14 14:48:04 +0000 2020","user_id":"237750442"},{"handle":"RepSteveChabot","text":"ICYMI: \"Over 200,000 Jobs in Ohio’s First District Saved by the Paycheck Protection Program\" https://t.co/6Kb71jtzmB","date":"Tue Jul 14 13:10:21 +0000 2020","user_id":"237750442"}]