[{"handle":"RepSmucker","text":"Democrats know that they can’t say the economy is working for the American people. https://t.co/6RHV7yGJVS","date":"Wed Jun 15 22:13:48 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden administration is intentionally making American energy production more difficult and driving up gas prices. Watch my interview on @Varneyco https://t.co/N1ZwdfCdJD","date":"Wed Jun 15 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no doubt the American Rescue Plan contributed to the 40-year high inflation we’re experiencing. We have hard times ahead as a direct result of the policies of this administration. Listen to my thoughts: https://t.co/V4s4iXL0KC","date":"Tue Jun 14 22:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Flag Day, a day to commemorate and honor the symbol of our nation and the freedoms which we enjoy. The flag in this photo was flying in honor of the 20th anniversary of the attacks of September 11, 2001 at a community event in Hanover. https://t.co/p3bEupOtji","date":"Tue Jun 14 20:18:09 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"With 40-year high inflation and gas prices above $5 per gallon, Americans are justifiably concerned about the financial future of our country. https://t.co/meb7RtG5AP","date":"Mon Jun 13 22:31:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Real wages are down 3 percent from last year as Bidenflation gives working Americans a pay cut.","date":"Sun Jun 12 21:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Contact my office if you’re having trouble with a federal agency, we may be able to help! https://t.co/xJbI88Ms25","date":"Sun Jun 12 19:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The next edition of my e-newsletter is being delivered later today, be sure to sign up to receive it! https://t.co/Bi079Zuk9t","date":"Sun Jun 12 14:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"While American families struggle with record high gas prices, the Biden admin suggests you buy an electric vehicle. Yet, EVs pay nothing towards the maintenance of the roads they drive on. Read my op-ed in @thehill about why we need the USER Fee Act. https://t.co/DackpmLtp3","date":"Sat Jun 11 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss my trip to the southern border and the questions I posed to Treasury Sec. Yellen during a meeting of the House Ways &amp; Means Committee. Listen in! https://t.co/VaI2Ze6Xjw","date":"Sat Jun 11 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to members of the Pennsylvania Farm Bureau for visiting me in Washington this week to discuss how we can continue to ensure a bright future for Pennsylvania’s agriculture industry! https://t.co/ETvRc7KHsK","date":"Sat Jun 11 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget= trillion-dollar deficits every year for a decade. Reckless levels of spending.","date":"Sat Jun 11 14:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation remains at 40-year highs. Biden’s spending is to blame. There’s nothing temporary about Bidenflation. https://t.co/mJCFw5zPy4","date":"Fri Jun 10 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation continues to rage, crushing families’ budgets. Prices soared 8.6% from May of last year. That’s the highest since 1981.","date":"Fri Jun 10 12:41:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden and Yellen are out of touch with average Americans struggling to pay for $5 a gallon gas. Instead they want to raise taxes and tell you switch to renewables. How about we increase domestic energy production instead? https://t.co/GyUy7UWfTk","date":"Thu Jun 09 23:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Things Democrats DIDN’T want you to notice this week: \n$1.6 TRILLION in future spending. \n \nNo hearings. No votes. \n \nInstead of the Budget Committee following regular order, Dems secretly granted themselves the authority to spend $1.6 trillion next year.\nReckless. #swampmath https://t.co/2iUXQ2okXx","date":"Thu Jun 09 19:32:33 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"83 percent of people recently surveyed by the Wall Street Journal say the economy isn’t doing well. It’s Bidenflation and it’s making it harder for Americans to pay for groceries, gas, and everything in between. https://t.co/zvVfIp7FtR","date":"Wed Jun 08 23:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Want to see Swamp Math? Watch my questions to Treasury Sec. Yellen. The Biden Administration Is NOT reducing deficits. https://t.co/5k7v9xqIIQ","date":"Wed Jun 08 17:50:23 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Our southern border is not secure. The Biden admin continues to fail the American people by not securing it. Their policies have created the humanitarian &amp; national security crisis we all are witnessing. Read my thoughts about my recent visit to the border https://t.co/iWiUfiiz1e","date":"Tue Jun 07 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas prices have doubled under Biden. It will cost families $5,000 to fill up this year, up 78 percent from last year. https://t.co/pSxClRS43l","date":"Tue Jun 07 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciate the efforts of @USTradeRep @AmbassadorTai to hold Canada accountable to the agreements they made in the USMCA in regard to dairy. Farmers in my district and across the country are watching.","date":"Tue Jun 07 00:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss my appearance CBS21’s Face the State to discuss my trip to the southern border? Tune in here! https://t.co/RlfQJoamUm","date":"Mon Jun 06 22:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"As we mark the 78th Anniversary of D-Day, may we pause to give thanks to all who served selflessly in the Armed Forces to preserve and protect our freedoms. https://t.co/MFZ7rtjI3b","date":"Mon Jun 06 20:22:15 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to this year’s winner of the Congressional Art Competition, Caroline Drumm from Solanco High School! https://t.co/BpVAkeDJrM","date":"Sun Jun 05 18:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking for help with a federal agency? Contact my office for assistance! https://t.co/xJbI88uRax","date":"Sun Jun 05 14:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join @CBS21NEWS Face the State this week to discuss my trip to the southern border. Tune in tomorrow at 8:30am to watch!","date":"Sat Jun 04 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no doubt it’s Bidenflation. It’s taxing every American. https://t.co/cHuCVxG1mU","date":"Sat Jun 04 18:05:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Rather than securing our border by building the wall, which the Border Patrol agents I spoke with said would help them do their jobs, Biden would rather waste millions in taxpayer dollars by letting it rust. https://t.co/BnDt0hnW0K","date":"Thu Jun 02 21:55:34 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"At the border wall today, I thanked CBP members for their service to our nation. We need policies coming from Washington to support them and their efforts to secure our border. https://t.co/zdslVckwW5","date":"Wed Jun 01 20:12:25 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m in McAllen, Texas with my @HouseGOP colleagues to hear directly from the Border Patrol about the crisis at our southern border. Stay-tuned for more updates. https://t.co/e7qOx0M4Bo","date":"Wed Jun 01 15:06:36 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss my latest e-newsletter? Read it here and sign up to receive the next one! https://t.co/AOwSEXWVI1","date":"Wed Jun 01 00:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation was never temporary. It continues to crush American families’ budgets. It’s a tax on everyone. https://t.co/DLy2NQT6ks","date":"Tue May 31 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Memorial Day is a time to remember and honor the men and women who made the ultimate sacrifice in service to their nation as member of the United States Armed Forces. Their sacrifices have allowed us all to live in a nation with freedoms and liberties which we enjoy. https://t.co/TIGSoh06eU","date":"Mon May 30 12:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The latest edition of my e-newsletter will be delivered to inboxes today, be sure to sign up to receive it for the latest news out of Washington and the district! https://t.co/Bi079Zuk9t","date":"Sun May 29 14:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Canada continues to fail to live up to its end of the United States – Mexico – and Canada (USMCA) Trade Agreement to the detriment of our local dairy farmers. Ways &amp; Means Trade Subcommittee Republican members discussed the Biden admin’s failure to fully enforce the USMCA. https://t.co/VpdnK54uG0","date":"Sat May 28 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Traveling for the holiday weekend? Thanks to the Biden administration’s policies, gas prices are 50% higher than they were a year ago. https://t.co/JhT6KPLvKb","date":"Sat May 28 13:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"CBO’s baseline analysis confirms that Democrats’ trillions of dollars in spending caused our record high inflation. Under Biden’s plan, unprecedented levels of deficit spending will soon cause the national debt to engulf our GDP. Listen to my discussion with the CBO Dir. Swagel: https://t.co/Vc97shLoZY","date":"Fri May 27 21:35:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This year’s winner of the 11th District Congressional Art Competition is Caroline Drumm from Solanco School District. Her artwork, titled “Fresh Organic Beets” is pastel on paper &amp; it is incredible! Congratulations Caroline &amp; thanks to all of this year’s artists for participating https://t.co/ABIB7tlhjc","date":"Fri May 27 19:11:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Student artists across #PA11 are amazing! Check out this year’s submissions for the Congressional Art Competition. Stay tuned later this week for the announcement of our winner! https://t.co/jyP6EuHLfe","date":"Tue May 24 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is costing American families thousands of dollars this year. It’s no wonder why they are concerned. https://t.co/qpa6lyp3rM","date":"Tue May 24 19:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"New record high gas prices every day for the last two weeks. Biden wants to raise taxes on energy companies to stymie investment, rather than work to increase domestic energy production. He has it all wrong. We need to unleash American energy production. https://t.co/dxhoiLTKNS","date":"Tue May 24 17:23:17 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Saddened to learn of the passing of Mount Joy World War II veteran Harold Billow, the last known survivor of the Malmedy Massacre. It was an honor to get to know Harold in recent years and learn of his selfless service to our nation. My condolences are with the Billow family. https://t.co/v4bRlRZLDa","date":"Mon May 23 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was an honor to discuss the importance of workforce development and apprenticeship programs last week at a meeting of the National Association of Women in Construction. Thanks for the invitation to join you, best wishes on continued success! https://t.co/E3DWUQL4Em","date":"Mon May 23 18:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Need help with the Social Security Administration, IRS, or VA? Contact my office, we can help! https://t.co/xJbI88uRax","date":"Sun May 22 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Fraud on this scale is a national nightmare for taxpayers. Congress should be holding oversight hearings on how potentially $163 billion in taxpayer funds were stolen. https://t.co/Yte0kTRr5M","date":"Sun May 22 16:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is rising faster than wages. It’s a pay cut.","date":"Sun May 22 14:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Families can expect to spend $5,000 this year on gas, nearly double the amount spent last year. https://t.co/lBq8a3keXk","date":"Sat May 21 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC to discuss House Democrats’ sham gas price legislation and National Police Week. Listen in! https://t.co/daGdZ59MFN","date":"Sat May 21 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today we honor and give thanks for all who are serving in the United States Armed Forces! https://t.co/mDLaW7kqd1","date":"Sat May 21 16:48:26 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to @WGAL for honoring Lititz-area veteran Mr. William Balabanow who joined fellow veteran Merchant Mariners in receiving the Congressional Gold Medal to honor their service in World War II. https://t.co/3aT1BWOtcA","date":"Sat May 21 16:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my latest op-ed in the Washington Times about the long-term impact of Biden’s bloated budget: https://t.co/IkGGmzi7oG https://t.co/C321d4puss","date":"Sat May 21 14:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to this year’s graduates from the Central Pennsylvania Chapter of Independent Electrical Contractors apprenticeship program! It was an honor to speak at your graduation ceremony. Best wishes on your continued success! https://t.co/y8t9d7s449","date":"Fri May 20 22:30:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The U.S. Merchant Mariners helped secure our nation’s victory in World War II. It was an honor to join Lititz veteran Mr. William Balabanow at yesterday’s Congressional Gold Medal ceremony honoring the service and sacrifice of the Merchant Mariners. https://t.co/DY06NEqWoD","date":"Thu May 19 20:31:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today’s vote is nothing more than the latest lame attempt by Democrats to deflect responsibility and shift blame for the high prices at the pump which are crushing Americans’ budgets. My statement— https://t.co/TRJRB2kqcs","date":"Thu May 19 17:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas prices across the country continue to rise. Prices in Lancaster &amp; York counties hit another all-time high today. \nhttps://t.co/7NR2mtMETk","date":"Wed May 18 21:22:52 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Our ballooning national debt and skyrocketing inflation undermine our national security. Read my latest op-ed in the @WashTimesOpEd https://t.co/IkGGmzi7oG","date":"Wed May 18 15:17:26 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Check out the latest edition of my e-newsletter and be sure to sign-up to receive the next one! https://t.co/k6OGijkpfw","date":"Tue May 17 00:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is crushing the middle-class. Americans are right to be concerned. https://t.co/qpa6lyGEQm","date":"Mon May 16 21:18:53 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Having an issue with the IRS, Social Security Administration, or the VA? Contact my office, we can help. https://t.co/xJbI88Ms25","date":"Sun May 15 19:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Is the inflation rate you are experiencing higher than the national average? Mine is. Check out this inflation rate calculator. Inflation is a tax on all Americans.  https://t.co/vAetX9l2q4","date":"Sun May 15 17:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Don’t miss the latest edition of my e-newsletter, which will be sent to inboxes later today! Sign-up here! https://t.co/Bi079ZLVy3","date":"Sun May 15 13:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with members of the Lancaster County Association of Realtors to discuss federal policies and the local housing market. https://t.co/F6dyMt8YkG","date":"Sat May 14 21:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s bloated budget continues trillion-dollar deficits for a decade and increases the national debt by an additional $15 trillion. We must get our nation’s fiscal house in order.","date":"Sat May 14 17:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is crushing American families. \nhttps://t.co/c1t2g560vi","date":"Sat May 14 13:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Lancaster and York counties are home to some amazing manufacturers, it’s great to see so many from our community be represented on this list! https://t.co/U9y7RrY47K","date":"Fri May 13 23:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to Canadian Members of Parliament @CandiceBergenMP and @MPRandyHoback for meeting with me to discuss ways the US and Canada can strengthen our relationship through trade, security and energy policy. 🇺🇸🇨🇦 https://t.co/TwVTtHfcYG","date":"Fri May 13 18:46:13 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s economy: real earned wages are down 2.6 percent since last year. https://t.co/6jAxqD7ERS","date":"Fri May 13 13:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas prices reached another high today in #PA11. Biden’s administration ought to be working to increase available supply of domestic energy, not restricting it. https://t.co/1TZAbVHfPK","date":"Fri May 13 00:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3 - National Police Week is observed from May 11 – May 17, 2022. May we always give thanks and honor law enforcement officers who serve and protect our communities.","date":"Thu May 12 20:00:42 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3 - I laid a wreath in honor of @LititzPolice Chief Douglas A. Shertzer, Sr. who was killed in the line of duty on May 11, 2004 during an on-duty motorcycle crash. Chief Shertzer served the Lititz Borough Police Department for 23 years. https://t.co/5yEtEeOKY9","date":"Thu May 12 20:00:40 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3 - Today I joined @GOPLeader and other @HouseGOP colleagues in biking to the National Law Enforcement Memorial &amp; Museum to pay tribute to law enforcement officers who were killed in the line of duty. https://t.co/gEdTw9dVmQ","date":"Thu May 12 20:00:38 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Under President Biden: \nGas Prices:⬆️\nInflation:⬆️\nReal Wages:⬇️\nGDP Growth:⬇️","date":"Thu May 12 00:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Core inflation, excluding food and energy, rose higher than economists’ predictions for April. Shelter costs rose at the fastest rate since 1991. Bidenflation is bad news.","date":"Wed May 11 21:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today marks the beginning of National Police Week. This week and every week, may we give thanks and honor those who selflessly serve and protect our communities. https://t.co/iDSF91q6Ap","date":"Wed May 11 19:14:16 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation remains near 40-year highs and continues to crush Americans’ budgets as prices skyrocketed 8.3 percent from April of last year.","date":"Wed May 11 13:17:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: While Americans are struggling with record high gas prices, Biden’s budget proposes $45 billion in new taxes on energy companies to stifle new investment.","date":"Tue May 10 21:13:11 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"More bad news for Americans’ budgets. Record high gas prices nationally and in York &amp; Lancaster counties which outpace the national average. Americans deserve affordable energy, but Biden’s policies aren’t delivering it. https://t.co/A1JrqmijQf","date":"Tue May 10 14:46:11 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no doubt Bidenflation has had a “big negative impact” on my constituents’ finances. https://t.co/NMQ0obblNW","date":"Mon May 09 21:07:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Do you have an issue with a federal agency or department? Contact my office for assistance. https://t.co/xJbI88Ms25","date":"Sun May 08 18:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Wishing all #PA11 moms a very happy Mother’s Day! https://t.co/Dk9wueGSaA","date":"Sun May 08 12:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to Guy McIntosh, Executive Director of the Lancaster Symphony Orchestra for stopping by to share all the great things coming up for the orchestra and how they navigated the challenges of the pandemic. https://t.co/n2gvhEStyU","date":"Sat May 07 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Seniors everywhere are paying more because of Bidenflation, which is causing folks to put off or leave their retirements early. https://t.co/grOgSRWyue","date":"Sat May 07 14:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Rising interest rates increase the cost of borrowing for the federal government. Read this report from House Budget Committee Republican Leader @RepJasonSmith about how much we could be paying in interest on our national debt.","date":"Fri May 06 20:25:53 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There are many career pathways to success. It was great to speak with local high school students participating in the Lancaster Chamber of Commerce’s Young Men Discovering Paths Mentorship program. https://t.co/YILyZ460M1","date":"Fri May 06 17:10:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit Highway Equipment and Supplies in Brownstown this week to learn more about their operations and how workforce and supply chain issues are impacting their business. https://t.co/3SIavwHhgR","date":"Fri May 06 13:35:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Earlier this week, I spoke to civics students at Cocalico High School in Denver to talk about how Congress operates and answered students’ questions about issues they are passionate about. Thanks for a great visit!  @CocalicoSD https://t.co/B7yKDmRU3E","date":"Thu May 05 21:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"A week later—gas prices are still above $4 a gallon for Lancaster ($4.42) &amp; York ($4.41) counties.","date":"Thu May 05 18:16:44 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"As we observe National Day of Prayer, may we all pray for our nation and one another. May God continue to richly bless the United States of America. https://t.co/VSwxCX17YR","date":"Thu May 05 14:58:44 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is crushing workers. https://t.co/V5F0RzNbDA","date":"Wed May 04 23:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It’s National #SmallBusinessWeek! Our thanks go out to the over 13,000 small businesses who call #PA11 home. Thanks for pursuing your passion and enriching our community! https://t.co/xnCdT4ZRMo","date":"Wed May 04 20:22:33 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Did you miss the last edition of my e-newsletter? Read it here and sign up to receive the next one! https://t.co/1XE9pXf3HD","date":"Tue May 03 23:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I enjoyed visiting Ultra Electronics in Lancaster County this week to learn about their operations, tour their facilities and take questions from their employees. https://t.co/DYV3eH4968","date":"Tue May 03 20:57:50 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2-I joined over 200 of my colleagues on an amicus brief in the Dobbs case because I believe SCOTUS, as our brief states, should “affirm the constitutional authority of the federal and state governments to safeguard the lives and health of their citizens, born and not yet born.”","date":"Tue May 03 19:46:49 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2-I fully support the request by Chief Justice Roberts to investigate this unprecedented and dangerous leak of the court’s deliberation. In Congress I will continue to support pro-life policies.","date":"Tue May 03 19:46:49 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you having an issue with a federal department or agency? Contact my office, we may be able to help. https://t.co/xJbI88Ms25","date":"Sun May 01 18:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The next edition of my e-newsletter will be sent out later today! Be sure to subscribe now to receive the latest news from our district and Washington! https://t.co/Bi079Zuk9t","date":"Sun May 01 14:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden will raise taxes on low- and middle-income earners  by letting the TCJA tax cuts expire. Unacceptable.","date":"Sat Apr 30 19:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is a pay cut.","date":"Sat Apr 30 17:25:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Under Biden’s budget, by 2032, we’ll be spending more on interest payments for the national debt than we’re spending on Medicare this year.","date":"Fri Apr 29 21:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"America needs secure borders. https://t.co/VM4t0t0OaE","date":"Fri Apr 29 17:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"$4 a gallon for gas will cost families hundreds of dollars more this year. American families need affordable energy, and Biden’s anti-energy policies won’t deliver it. https://t.co/4DkrDUcUJr","date":"Wed Apr 27 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It’s Bidenflation. https://t.co/pcdLgKSOLT","date":"Fri Apr 29 13:00:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Instead of working to unleash American-made energy, Biden wants to impose $45 billion in new punitive taxes to stifle new investment. Why?","date":"Thu Apr 28 23:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"In March, the nearly 7,000 crossings per day was the highest amount in 20 years. https://t.co/4kWAd05G8w","date":"Thu Apr 28 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"$15 trillion dollars in new debt from Biden’s bloated budget. It will further burden future generations of Americans.","date":"Thu Apr 28 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Energy policy impacts our national security, economy, and our foreign relations. Our massive national also debt poses a national security risk. Under Biden’s budget China will own nearly $2 trillion of the US debt a decade from now. Listen to my comments: https://t.co/JtNe73HT0N","date":"Thu Apr 28 18:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"🚨 Today’s negative GDP growth figures are alarming. Under Biden, inflation is up, and growth is down. 🚨 https://t.co/a1YpXLWdJ3","date":"Thu Apr 28 17:38:13 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Holocaust Remembrance Day. We must never forget the atrocities of the Holocaust. The United States Holocaust Memorial Museum, chartered by an act of Congress, held an observance ceremony this week, which you can watch here https://t.co/UQusnpaPHk","date":"Thu Apr 28 15:49:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Real average hourly earnings are down 2.7 percent because Bidenflation is at 40-year highs.","date":"Thu Apr 28 13:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"$4 a gallon for gas will cost families hundreds of dollars more this year. American families need affordable energy, and Biden’s anti-energy policies won’t deliver it. https://t.co/4DkrDUcUJr","date":"Wed Apr 27 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Let’s unleash American energy dominance now. https://t.co/dTVrlGFZ34","date":"Wed Apr 27 19:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget runs trillion-dollar deficits for a decade. Irresponsible.","date":"Wed Apr 27 17:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation will cost the average American family an extra $5,200 this year. https://t.co/BmVqpwRKfB","date":"Wed Apr 27 15:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation is at a 40-year high. It has increased every month since Biden has taken office.","date":"Wed Apr 27 15:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden wants to spend $73,000,000,000,000 over the next decade. America must get its fiscal house in order.","date":"Tue Apr 26 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Increasing domestic energy production must be a national security priority.","date":"Tue Apr 26 21:37:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is National Pretzel Day! #PA11 is the Snack Food Capital of the World and home to the first commercial pretzel bakery. Which PA-11 made pretzel is your favorite? https://t.co/kRrEDnolip","date":"Tue Apr 26 20:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation is a tax on seniors and the middle-class. https://t.co/soMTF43RFf","date":"Tue Apr 26 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was an honor to join The Rt. Honorable George Eustice, the United Kingdom’s Secretary of State for Environment, Food and Rural Affairs, for a tour of Four Seasons Produce &amp; discuss ways to strengthen the US-UK trade relationship and create opportunities for local producers. https://t.co/ttyJiZnvNq","date":"Tue Apr 26 18:42:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Last call for high school artists! The deadline to submit your artwork for consideration for this year’s Congressional Art Competition is Wednesday April 27. Learn more here and call my office with any questions. https://t.co/AXhR0buL36","date":"Sun Apr 24 15:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss how Biden’s budget attempts to eliminate a key pro-life policy. Listen in! https://t.co/fKVgzD9MPq","date":"Sat Apr 23 18:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"With Biden’s 40-year high inflation American workers’ real wages are going down. It’s a pay cut.","date":"Sat Apr 23 14:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Under Biden’s budget proposal, by 2032, we’ll be paying over $1 trillion a year just in interest on the national debt. That’s more than we’re currently spending on our national defense.","date":"Fri Apr 22 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3 - This photo of the scenery surrounding Columbia-Wrightsville Bridge connecting Lancaster and York counties is on file with the Library of Congress. https://t.co/kXfK0SOZ9w","date":"Fri Apr 22 20:32:15 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3 - Did you know the Captain John Smith Chesapeake National Historic Trail runs along the Susquehanna River? Learn more about this trail operated by the National Park Service here: https://t.co/iXuo3FF3Fk","date":"Fri Apr 22 20:32:15 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3 - It’s National Park Week. I was proud to fight for legislation to designate our region as the Susquehanna National Heritage Area to celebrate our unique history and natural beauty.","date":"Fri Apr 22 20:32:14 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The last thing America needs right now is Biden’s massive tax hikes and his plan to build back bankrupt. https://t.co/HSofXShIc3","date":"Fri Apr 22 00:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget runs trillion dollar deficits for a decade resulting in $15 trillion in new debt.","date":"Thu Apr 21 22:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation https://t.co/XD2UMBlB77","date":"Thu Apr 21 19:55:21 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is taxing families’ budgets. Biden’s 40-year high inflation will cost families an additional $5,200 this year. https://t.co/TebSem9cGj","date":"Wed Apr 20 22:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget does away with the Hyde Amendment, which prevents taxpayer dollars being used to fund abortions. Unacceptable. I will continue to fight for pro-life policies like the Hyde Amendment. https://t.co/z7TLfdfRYk","date":"Wed Apr 20 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s border crisis continues to worsen. March’s 221,303 encounters were the highest in 20 years. Nearly 300 people crossed the border every hour throughout the entire month! Democrats are unwilling to face reality and address the crisis at the southern border.","date":"Wed Apr 20 18:52:14 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Gov. Wolf’s proposal to use ARPA dollars to pay people to stay home will further fuel inflation. PA has nearly the highest unemployment rate of any state in the country. Let’s get folks back to work! My thoughts from my interview on @Varneyco https://t.co/zTNtXVRtTt","date":"Tue Apr 19 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"No matter how his administration tries to spin it, Biden’s inflation continues. Now economists are agreeing with Republicans, saying “it’s only set to get worse.” https://t.co/7zM8yWxB6R","date":"Tue Apr 19 18:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking forward to joining @Varneyco this morning at 10:15am, tune in! 📺","date":"Mon Apr 18 13:44:36 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Wishing everyone a blessed Easter! https://t.co/WtO5BNYRk4","date":"Sun Apr 17 12:16:56 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss how inflation is impacting local small businesses and families. Listen in! https://t.co/mitEt6I2Hf","date":"Sat Apr 16 22:20:24 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Chag Sameach to our friends celebrating Passover! https://t.co/i6zZIjVDtL","date":"Sat Apr 16 00:37:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m so thankful for all who serve our nation in the armed forces. Earlier this week, I enjoyed meeting Michael a Vietnam Veteran from York County and presenting him with a commemorative Vietnam Veteran Lapel Pin. Thank you for your service Michael! https://t.co/VguLKnXqfA","date":"Thu Apr 14 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget recklessly runs trillion dollar plus deficits every year for the next decade. Biden racks up $15 trillion in new national debt!","date":"Thu Apr 14 20:10:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The latest @NFIB report shows that small business owners across the country are concerned about 40-year high inflation. https://t.co/8moXjtRIQw","date":"Thu Apr 14 13:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday I enjoyed visiting 8th Grade students at Eastern York Middle School to talk about Congress, the legislative process, and take their questions. Thanks for a great visit! @EasternYorkSD https://t.co/15DZK5bZIy","date":"Wed Apr 13 21:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"In Biden’s economy inflation is UP and real hourly earnings are DOWN 2.7 percent from a year ago.","date":"Wed Apr 13 19:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join Sen. Toomey in Lancaster on Monday to hear from local manufacturers about how inflation and staffing issues are impacting them. https://t.co/gOti6gM5LT","date":"Wed Apr 13 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bideninflation hits a new high. The highest since 1981. Food at home is up 10 percent over last year. Gas up 48 percent from a year ago. The middle-class continues to lose in Biden’s economy.","date":"Tue Apr 12 12:42:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Under President Biden: \nInflation is UP to 40-year highs. \nPrice of gas is UP to $4+ per gallon. \nNational debt would be UP nearly $15,000,000,000,000 under his proposed budget.","date":"Tue Apr 12 00:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The Wolf administration’s plan to force unionization of health professionals puts Medicaid patients at risk. I urged HHS Secretary Becerra to protect Pennsylvanians' access to care. Watch our discussion from last week: https://t.co/JYQxqrOHBG","date":"Mon Apr 11 23:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I enjoyed visiting Windy Hill Senior Center in Spring Grove last week with State Rep. Seth Grove to talk about how President Biden’s policies are contributing to inflation and negatively impacting seniors’ budgets. https://t.co/vSsq6ri0Gf","date":"Mon Apr 11 22:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Attention local high school artists in #PA11 the deadline to submit artwork for the Congressional Art Competition is April 27, 2022. Visit my website to learn more about the competition! https://t.co/AXhR0bMmrG","date":"Sun Apr 10 19:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"If you’re having difficulty with a federal department or agency, contact my office. We may be able to provide assistance. Learn more by visiting my website. https://t.co/xJbI88Ms25","date":"Sun Apr 10 14:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden introduced a new generation of Americans to high levels of inflation—the highest in 40 years! His reckless spending policies proposed in his budget will only make it worse.","date":"Sat Apr 09 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss Biden’s proposed budget and a recent meeting of the Ways and Means Committee. Listen in! https://t.co/ppP54MGUPq","date":"Sat Apr 09 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The IRS’s filing deadline of April 18, 2022 is soon approaching! Visit my website to find helpful links and information from the IRS about filing your taxes! https://t.co/8J9sl7WdnN","date":"Fri Apr 08 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I enjoyed speaking with members of the Spring Grove Chamber of Commerce in York County this morning to discuss Biden’s bloated budget, 40-year high inflation and more. https://t.co/zMTRY96LSM","date":"Fri Apr 08 16:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to see students from Garden Spot High School in Washington today. Thanks for visiting! https://t.co/Xmo8rQYSTn","date":"Thu Apr 07 18:11:36 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Instead of unleashing American energy independence and encouraging domestic production, Biden’s budget imposes $45 billion in taxes on American energy. He’s got it all wrong.","date":"Thu Apr 07 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Increasing domestic energy production must be a national security priority. https://t.co/s8i7DUMgU6","date":"Wed Apr 06 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: Biden’s budget runs trillion-dollar deficits for a decade and adds $15 trillion to our national debt.","date":"Wed Apr 06 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This afternoon beginning at 2pm the House Budget Committee will meet. I’ll be asking Biden’s HHS Secretary Becerra about Biden’s bloated budget, tune in here! https://t.co/m2Y5gjgvUv","date":"Wed Apr 06 17:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation will cost families thousands of dollars this year. Under Biden, the cost of groceries and gas is way up. https://t.co/TebSem9cGj","date":"Wed Apr 06 12:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: Biden’s budget is going to explode our national debt and run annual deficits of at least $1 trillion. Read my thoughts on Biden’s budget here in The Hill. https://t.co/ZaHmDmg1wf","date":"Mon Apr 04 23:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss the latest edition of my e-newsletter? Read it here! https://t.co/MBtn60o3nw","date":"Mon Apr 04 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? The latest edition will be sent to inboxes later today, be sure to sign up to receive the latest news from Washington and the district! https://t.co/Bi079Zuk9t","date":"Sun Apr 03 14:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio this week to discuss my bipartisan legislation to support survivors of domestic abuse and National Vietnam War Veterans Day which the country observed on Tuesday March 29. https://t.co/qE0MU1BH4a","date":"Sat Apr 02 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join @cspan’s Washington Journal on Friday to talk about Biden’s reckless budget, energy policy, and to take questions from viewers. If you missed the show, watch it here! https://t.co/e0Sv42uFg4","date":"Sat Apr 02 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Dairy farmers in #PA11 need this administration to fight for them to hold Canada accountable under the USMCA. Watch my comments and questions from a Ways &amp; Means Committee hearing held earlier this week. https://t.co/uKnrMTJKDf","date":"Sat Apr 02 14:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation remains high, squeezing families’ budgets across the country. https://t.co/EVKas6a1VE","date":"Fri Apr 01 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Americans should be concerned about Biden’s dangerous levels of spending, debt, &amp; what it means for the future financial health of our nation. Read my thoughts on Biden’s FY23 budget here in an op-ed published in @thehill https://t.co/ZaHmDmxCnN","date":"Fri Apr 01 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"May our thoughts and prayers be with the Lebanon City Police Department and the families of those who mourn. Tragically, one officer was killed in the line of duty and two were injured.","date":"Fri Apr 01 13:23:11 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget proposes $4 TRILLION in NEW TAXES! His budget assumes the failed Build Back Bankrupt agenda magically became law which would impose $1.5 TRILLION in taxes, on top of the $2.5 trillion proposed tax hikes in the budget.","date":"Thu Mar 31 14:00:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud that bipartisan legislation I introduced with @RepLucyMcBath &amp; @RepGwenMoore to support survivors of domestic abuse was advanced by the House last evening as a part of the Securing a Strong Retirement Act. Learn more about our bill here: https://t.co/aMsK6PLYUS","date":"Wed Mar 30 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s attempt to reverse the Hyde Amendment continues. I will always stand up and support pro-life policies like the Hyde Amendment.","date":"Wed Mar 30 20:18:49 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is National Vietnam War Veterans Day, we honor and give thanks for those who served our nation in the armed services. I’d also like to thank York County resident Harold Redding, a Vietnam veteran who led the effort to have our nation honor Vietnam veterans today. https://t.co/KnECgQEe1V","date":"Tue Mar 29 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Don’t let the headlines fool you, Biden’s budget continues massive $1 trillion plus deficits for each year of the next decade.","date":"Tue Mar 29 15:24:49 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"As a member of the House Budget Committee, I’ll be questioning OMB Dir. Young about Biden’s inflation-fueling budget which will add $15 trillion to our national debt. Tune in here: https://t.co/CdmicaUj5n","date":"Tue Mar 29 13:59:53 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no doubt President Biden’s 40-year high inflation is impacting families across the country. Read what Susan shared with me about how inflation is impacting her family. https://t.co/vjyPuMUnzc","date":"Mon Mar 28 21:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget proposes $15 trillion in new debt. Unbelievable.","date":"Mon Mar 28 19:27:38 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Did you know March is National Kidney Month? Learn more about the innovative research being done at @NIDDKgov to change the way we understand, treat, and prevent kidney disease. https://t.co/wPkkGTde6U","date":"Sun Mar 27 19:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"If you’re having an issue with a federal department or agency, don’t hesitate to contact my office. We may be able to help. Learn more https://t.co/xJbI88uRax","date":"Sun Mar 27 14:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join WDAC to discuss legislation I’m supporting to hold Russia accountable and how farmers make a positive impact on our community. Listen in! https://t.co/VFvumChbIR","date":"Sat Mar 26 18:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with Douglas and Jay, two members of the Conoy Township Board of Supervisors in Lancaster County. I appreciated our discussion on issues impacting the township and our economy. https://t.co/pc0K7PjhWX","date":"Sat Mar 26 15:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is National Medal of Honor Day, a day to recognize the individuals who received the Medal of Honor for their exceptional acts of valor in service to our nation. May we all give thanks for those that serve and have served in the United States Armed Forces. https://t.co/78myPGZYhq","date":"Fri Mar 25 13:21:10 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"As a member of the Congressional Task Force on Alzheimer’s Disease, I have long supported research to develop innovative drugs to address this disease. CMS’s decision to restrict access to FDA-approved Alzheimer’s drugs may mean we NEVER find a cure. My statement: https://t.co/x5hK6wmSv7","date":"Wed Mar 23 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Many thanks to our farmers today as we observe National Agriculture Day! Did you know #PA11 is the top agricultural producing congressional district in Pennsylvania? https://t.co/nJK6XF4783","date":"Tue Mar 22 19:13:56 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking forward to joining the Evening Edit tonight at 6:15 on @FoxBusiness, tune in!","date":"Mon Mar 21 21:40:18 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"If you’re experiencing a problem with a federal agency, please contact my office. We may be able to help. https://t.co/xJbI88uRax","date":"Sun Mar 20 17:20:17 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to share my reaction to President Zelensky’s address to Congress earlier this week and share information about the 2022 Congressional Art Competition! Listen in! https://t.co/H8bBVY3JAR","date":"Sat Mar 19 18:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3-Cindy and I send our deepest condolences and prayers to Anne and the entire family.","date":"Sat Mar 19 12:20:08 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3-So sad this morning to hear of Don Young’s sudden passing. He was a giant in the House, an institution on his own, who always fought for his beloved Alaska.","date":"Sat Mar 19 12:20:08 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3-Don was a great friend from the first time I walked onto the House floor and unknowingly sat in “his” seat, and it is an honor to have served with him. His presence and booming voice on the House floor will be missed by all.","date":"Sat Mar 19 12:20:08 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no doubt that inflation is a direct result of Biden and congressional Democrats’ reckless spending. Biden’s inflation is crushing the middle-class and seniors.","date":"Fri Mar 18 20:11:26 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - I was proud to join an overwhelming bipartisan vote in favor of legislation to impose additional economic pain on Russia through suspending their favored trade status. @WaysandMeansGOP members were instrumental in advancing this legislation.","date":"Thu Mar 17 22:47:45 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - Putin must be stopped. We must continue to support Ukraine.","date":"Thu Mar 17 22:47:45 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"🍀Happy Saint Patrick's Day!🍀 https://t.co/0EEwTtMJbL","date":"Thu Mar 17 19:07:34 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"4/4 – Inflation is the fault of Biden and Congressional Democrats and a direct result of their reckless spending.","date":"Wed Mar 16 21:29:20 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/4 - I’ve heard stories from 1,000+ constituents about how inflation is impacting their lives. I’m thinking of Connie from New Holland, who at 70 is having to take on a part-time job to make ends meet because of the elevated costs caused by inflation.","date":"Wed Mar 16 21:29:19 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/4 - I’m thinking of Tanya of Lancaster who was impacted by the high energy costs of heating her home this winter. I’m thinking of Sherry from Columbia who told me inflation restricts “what she eats and where she goes” and that inflation impacts her buying power.","date":"Wed Mar 16 21:29:19 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/4 - Inflation is impacting the lives of folks all across Lancaster &amp; York counties and all across the country. These issues need to be front and center for my colleagues on the Budget Committee. My comments from today’s hearing⬇️https://t.co/UnaDxTTs4Y","date":"Wed Mar 16 21:29:19 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"When future generations look back on this moment, will they be able to say that America stood for freedom and democracy? https://t.co/ATlnHeTshg","date":"Wed Mar 16 14:22:21 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget was due to Congress on Feb. 7. He is 36 days late.","date":"Tue Mar 15 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"4/4 – and @ManheimCentral @pennmanor\n@PequeaValley\n@SolancoSchlDist\n@WarwickPR","date":"Tue Mar 15 19:47:12 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/4 – Interested teachers and students can learn more about the competition and submission process by visiting my website: https://t.co/AXhR0bMmrG","date":"Tue Mar 15 19:47:12 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/4 – I’m looking forward to seeing entries from @DallastownSD\n@EasternYorkSD\n@HanoverPublic\n@rlschools\n@SESDRAMS\n@SouthWesternSD\n@SYCSD\n@SGSchoolNews\n@CocalicoSD\n@CBSDCrimsonTide\n@CVBuckskins\n@ELANCOSD\n@etownPAschools\n@GoMounts\n@hempfield\n@LSPioneers\n@SDoLancaster","date":"Tue Mar 15 19:47:12 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/4 - The 2022 Congressional Art Competition, a nationwide high school arts competition, is officially on! I’m looking forward to seeing this year’s outstanding student entries. Let’s take a look back at last year’s entries, beginning with the 2021 winner, below: https://t.co/Bd22wFiV1K","date":"Tue Mar 15 19:47:11 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"American energy independence must be a national security priority. https://t.co/R0oYoXbvCu","date":"Mon Mar 14 22:56:56 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s just over a month until the IRS’s tax filing deadline of April 18, 2022. Need help finding information from the IRS? Visit my website: https://t.co/8J9sl7WdnN","date":"Sun Mar 13 14:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to members of the Pennsylvania Assisted Living Association for stopping by my Washington, DC office this week to discuss policies impacting assisted living facilities and personal care homes. https://t.co/u4GKrjmEbl","date":"Sat Mar 12 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC to discuss the ban on the importation of Russian oil and the aid to Ukraine that Congress recently approved. Listen in! https://t.co/ykLSLjrOD8","date":"Sat Mar 12 19:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Once again, Biden is late to the table. Congress had a bipartisan deal last Tuesday to end Russia’s favored trade status.  Biden told Pelosi to torpedo it so he could take the credit. The White House should work WITH Congress to further isolate Russia. https://t.co/yoOOGBh0Kh","date":"Sat Mar 12 15:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation continues to wipe out wage increases. Earnings fell .8 percent last month and are down nearly 3 percent since last year. https://t.co/PJdeUpbF0T","date":"Fri Mar 11 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Last year Biden and congressional Democrats passed $2 trillion worth of reckless spending to fuel the inflation inferno that Americans are struggling with today.","date":"Fri Mar 11 21:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The only place that the Biden administration has to look for the cause of 40-year high inflation is in the mirror. When will they admit their trillions in reckless spending is crushing middle-class Americans?","date":"Fri Mar 11 20:41:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s $2 trillion “stimulus” bill led to increased inflation. You don’t have to take my word for it, that’s according to the Federal Reserve Bank of San Francisco. https://t.co/UTx9ugc5Uw","date":"Fri Mar 11 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Even former Clinton administration Treasury Secretary Larry Summers knew Biden’s incredulous spending would lead to high inflation. Read this from @HouseBudgetGOP Leader @RepJasonSmith https://t.co/1zh60BexEG","date":"Fri Mar 11 17:22:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"If you receive a suspicious call, text, or email that mentions Social Security report it to https://t.co/ps7vBxeM9q. Report other government impostor scams to https://t.co/v2frsriiEp #SlamTheScam #NCPW2022 https://t.co/3wAM59Tvv5","date":"Thu Mar 10 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Last evening I voted to: \n✔️ Support Ukraine &amp; Stop Putin\n✔️ Oppose Bloated Domestic Spending \n\nRead my full statement here: https://t.co/YGz6wxxKAt","date":"Thu Mar 10 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today’s inflation numbers are a disaster for the middle-class and seniors in Lancaster &amp; York counties and across the country. Biden’s inflation will absolutely crush families’ budgets. This is Biden’s inflation crisis.  https://t.co/WPemF3X6XA","date":"Thu Mar 10 13:51:10 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with apple growers from across Pennsylvania, including Ryan from the family-owned and operated Hess Brother's Fruit Company in Lancaster, to discuss trade and labor policies. Thanks for visiting! https://t.co/NsF9XliTt3","date":"Wed Mar 09 22:15:25 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The only place Biden isn’t looking for oil is in our own backyard, instead he is begging Iran and Venezuela.","date":"Tue Mar 08 19:35:54 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The Russian oil ban was better late than never, now let’s unleash American energy production. My full statement ⬇️ https://t.co/n3uEPDJexy","date":"Tue Mar 08 18:15:49 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter here and sign up to receive the next one! https://t.co/LeDjnIAC5w","date":"Tue Mar 08 00:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Unleash American energy. 🇺🇸⛽️","date":"Mon Mar 07 19:46:44 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? The latest edition will be sent later today, sign up to receive the latest news from Washington and around the district! https://t.co/Bi079ZLVy3","date":"Sun Mar 06 15:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss President Biden’s State of the Union Address and how America must support Ukraine against authoritarian thug Vladimir Putin. https://t.co/IvROfbcpm6","date":"Sat Mar 05 19:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"We must stop buying Russian oil, which provides funds for Putin to carry out his despicable aggression against Ukraine. https://t.co/HLHz7Z8T1S","date":"Sat Mar 05 15:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas prices reached all-time highs in #PA11 today according to AAA. “When the president came into the White House and issued a moratorium on new drilling, the nation was set on a different course and now has less energy security…” https://t.co/NNTzsi2ZAH","date":"Fri Mar 04 18:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"In his SOTU speech Biden said he would take steps to “blunt gas prices.” In #PA11 gas prices are nearing all-time highs. Mr. President, you must reverse your anti-energy policies now! American energy independence is a national security issue. https://t.co/MzgaemEWlZ","date":"Thu Mar 03 20:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This morning I joined @fox43 to share my thoughts on the State of the Union, watch below! https://t.co/PimcPNAaPD","date":"Wed Mar 02 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my full statement on President Biden’s State of the Union speech ⬇️https://t.co/nsYLw5nhII","date":"Wed Mar 02 21:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to President Biden’s policies America faces an inflation crisis, an energy crisis, a crisis on our southern border and a global security crisis. #SOTUinCrisis","date":"Wed Mar 02 03:49:34 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden paid lip service to inflation tonight, but the truth is families around the country are struggling under his 40-year high inflation.","date":"Wed Mar 02 03:28:47 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Energy independence must be a national security priority. We should produce here, not purchase millions of dollars a day from Russia.","date":"Wed Mar 02 03:14:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’ve been saying this for months. #BuildBackBankrupt","date":"Wed Mar 02 02:58:27 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Things Biden missed when talking about the Tax Cuts &amp; Jobs Act. It increased median household income by $5k. Produced lowest unemployment rate in 50 years and lowest recorded poverty rate. It got our economy moving again and generated record tax revenues to close the deficit.","date":"Wed Mar 02 02:58:05 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Mr. President I hope this next round of COVID tests don’t come from China. What happened to buy American?","date":"Wed Mar 02 02:51:15 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is taking a toll on the American middle-class and seniors. #SOTUinCrisis https://t.co/SAsskvyrpX","date":"Tue Mar 01 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The world is watching. China is thinking about its next steps in Taiwan. America must lead by supporting Ukraine. Authoritarian thugs like Putin will only respond to strength. Ukraine is showing the world how strong they are. America must stand in support of Ukraine &amp; freedom.","date":"Tue Mar 01 23:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"No matter how you enjoy them—glazed, powdered, or plain—Happy Fasnacht Day! https://t.co/g9V0ZVM8Go","date":"Tue Mar 01 20:48:47 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to assist you with any issues or difficulties you may be experiencing with a federal agency or department. Visit my website to learn more.  https://t.co/xJbI88Ms25","date":"Sun Feb 27 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: this year’s tax filing deadline is April 18, 2022. Be sure to visit my website for helpful links and information about filing taxes this year. https://t.co/8J9sl8dOfl","date":"Sun Feb 27 15:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The brave actions of Zelensky and the Ukrainian people show they are unafraid to stand up and fight for their homeland against all odds. We must lead the world in supporting them and always stand for freedom. Putin is a war criminal and a thug who must be stopped.","date":"Sat Feb 26 19:29:19 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"February is Career &amp; Technical Education Month. I’m the proud sponsor of the USA Workforce Tax Credit to spur investment in critical workforce development and apprenticeship programs to help ensure that workers are ready for the jobs available today. https://t.co/9Qdj5ZF932","date":"Sat Feb 26 17:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The Russian invasion and unprovoked attacks on Ukraine at Putin’s direction are unacceptable and depraved. The Biden administration, our NATO, and international allies must stand together to support Ukraine against this needless aggression.","date":"Thu Feb 24 16:09:08 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"On February 23, 1945, this iconic photo of the flag raising on Iwo Jima was taken. https://t.co/fpAlJTP3ay","date":"Wed Feb 23 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Birthday to our nation’s first president, George Washington! https://t.co/qu9UBGopAu","date":"Tue Feb 22 22:42:53 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Attention #PA11 students! Next week, my office will be hosting a Service Academy Night Event to provide interested students with information about the application process to attend a military academy. Visit my website to learn more about the event! https://t.co/0jdDjvYWnJ","date":"Sun Feb 20 15:00:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to assist you with any problems or issues you may be experiencing with federal agencies or departments. Visit my website to learn more! https://t.co/xJbI88uRax","date":"Sat Feb 19 20:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC to talk about my bipartisan and commonsense MUSIC Act, which will support jobs across the country. Listen in! https://t.co/Okvc3QUrM8","date":"Sat Feb 19 19:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I join my colleagues in mourning the loss of our friend Rep. Jim Hagedorn. May his memory serve as an inspiration for public service. Please join Cindy and me in keeping his loved ones in our prayers.","date":"Fri Feb 18 19:42:12 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Our $30 trillion national debt will significantly impact future generations of Americans. Congress must take steps today to get our fiscal house in order and put a stop to Democrats’ reckless spending. https://t.co/o1TTciggnA","date":"Fri Feb 18 17:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"While Americans face 40-year high inflation and the federal debt eclipses $30 trillion, Democrats are calling for a blank check to borrow and spend trillions more by eliminating the debt ceiling. How unbelievably tone deaf. https://t.co/ga5R3AW5Z9","date":"Wed Feb 16 23:15:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden administration continues to cost taxpayers more. This time it’s to give handouts to their political donors through his executive order. Biden required anti-competitive project labor agreements on infrastructure, locking out most of America’s workforce. My thoughts ⬇️ https://t.co/ELlPTilVhQ","date":"Wed Feb 16 17:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Check out the latest edition of my e-newsletter and be sure to sign up to receive the next edition! https://t.co/PXFFjbmYad","date":"Tue Feb 15 01:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Prepare to pay more to celebrate Valentine’s Day thanks to President Biden’s 40-year high inflation. https://t.co/Nt07Yo3cND","date":"Mon Feb 14 20:38:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Later today, the next edition of my e-newsletter will be sent to inboxes across the 11th District. Be sure to sign up now to receive the latest news from Washington and our district! https://t.co/Bi079Zuk9t","date":"Sun Feb 13 15:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss my vote against the so-called “America COMPETES Act” and my upcoming Academy Night event for students interested in learning more about attending our nation’s military academies. Listen in! https://t.co/VwO9ZyT3AB","date":"Sat Feb 12 19:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today in 1809 Abraham Lincoln was born. Learn more about our nation’s sixteenth president and the history behind Presidents Day from the Library of Congress: https://t.co/JVHMvlzY1R.","date":"Sat Feb 12 15:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Think inflation isn’t having an impact? Think again. “The average U.S. household is spending an additional $276 a month because of inflation that is rising at its fastest rate in 40 years, a new economic analysis showed.” https://t.co/A8rPOe2aEH","date":"Sat Feb 12 01:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"#PA11 is home to an amazing live events industry, which was significantly impacted by COVID-19. I’m thankful to partner with @RepTroyCarter to introduce the bipartisan MUSIC Act to support good-paying jobs across the nation. https://t.co/OnKMFiBavF","date":"Fri Feb 11 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"As a member of the Bipartisan Congressional Task Force on Alzheimer’s Disease, I joined 70+ of my colleagues in asking the Biden admin to reverse course on their plan to restrict coverage of potential treatments for those impacted by the disease. Read more https://t.co/qqWbtRppHG","date":"Fri Feb 11 20:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is taxation and it's crushing the middle-class. https://t.co/tyOHPchA0K","date":"Thu Feb 10 14:02:42 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The IRS has nearly 5.6 million unprocessed paper tax returns from last tax year. My office hears from hundreds of frustrated taxpayers every month. The IRS’s tech issues and lack of customer (taxpayer) service must be fixed. My thoughts from yesterday’s W&amp;M Oversight hearing ⬇️ https://t.co/AHAIBnlKon","date":"Wed Feb 09 18:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday was the legal deadline for Pres. Biden to submit his FY23 budget to Congress, but it’s clear he doesn’t care. Will Biden’s eventual budget acknowledge the impact of his 40-year high inflation or address the $30 trillion in debt? https://t.co/rJXxVw6yz8","date":"Tue Feb 08 20:33:26 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3 -@pennmanor @PequeaValley @SolancoSchlDist @WarwickPR","date":"Mon Feb 07 16:09:47 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3 - Hope to see you there! @DallastownSD @EasternYorkSD @HanoverPublic @rlschools @SESDRAMS @SouthWesternSD @SYCSD @SGSchoolNews\n@CocalicoSD @CBSDCrimsonTide @CVBuckskins @ELANCOSD @etownPAschools @GoMounts @hempfield @LSPioneers @SDoLancaster @ManheimCentral","date":"Mon Feb 07 16:09:47 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3 - Attention #PA11 Students! Later this month, my office will be hosting an Academy Night Event to provide interested students with information about the application process to attend a military academy. Visit my website to learn more about the event! https://t.co/pC4wTAJicY","date":"Mon Feb 07 16:09:46 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Having an issue or problem with a federal department or agency? Visit my website, my office may be able to assist you! https://t.co/xJbI88uRax","date":"Sun Feb 06 17:08:35 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join WDAC this weekend to discuss my support of pro-life legislation and why it’s important for Congress to address our nation’s $30 trillion debt. Listen in! https://t.co/MFYEQX5Fta","date":"Sat Feb 05 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"9/11 - This bill was not considered in committee, bypassing regular order. This legislation also has not received a score from the Congressional Budget Office.","date":"Fri Feb 04 20:41:24 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"8/11 - Keeping in line with House Democrats’ routine, this legislation includes massive giveaways to labor unions. It also would constrain America’s workforce pipeline by eliminating innovative industry-recognized apprenticeship programs.","date":"Fri Feb 04 20:41:24 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"10/11 - At a time when our national debt eclipsed $30 trillion, our spending and potential deficits must be closely scrutinized.","date":"Fri Feb 04 20:41:24 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"11/11 - I couldn’t in good conscience support this legislation, America deserves better.","date":"Fri Feb 04 20:41:24 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"5/11 - On policy, it’s a grab bag of President Biden’s Green New Deal, “Build Back Bankrupt” initiatives, and policies totally unrelated to our nation’s global competitiveness.","date":"Fri Feb 04 20:41:23 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"7/11 - Legislation to assist with coral reef conservation, a laudable goal, should be considered on its own merits separate from this bill.","date":"Fri Feb 04 20:41:23 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"6/11 - What does coral reef conservation have in common with semiconductor manufacturing? Nothing, but in Speaker Pelosi’s House these shenanigans are commonplace.","date":"Fri Feb 04 20:41:23 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"4/11 - What House Democrats have with the America COMPETES Act is a rushed, unfocused, and purely partisan hack piece of legislation.","date":"Fri Feb 04 20:41:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"3/11 - House Dems gutted a bill instead of using the amendment process to make targeted improvements. They are trying to hide as much of their unpopular agenda as they can in this bill under the guise of helping our nation compete in the global marketplace with nations like China","date":"Fri Feb 04 20:41:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/11 - The Senate produced a rare bipartisan bill to help protect and bolster our nation’s technological research and semiconductor manufacturing capacity which is critical to our long-term national security, but that’s not what we considered today.","date":"Fri Feb 04 20:41:22 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/11 - The so-called America COMPETES Act won’t help our nation win. I voted no.","date":"Fri Feb 04 20:41:21 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no question the COVID-19 pandemic has negatively impacted mental health. I’m concerned about the long-term impacts school closures and mask mandates are having on our children’s development. Listen to my comments and questions from yesterday’s Ways &amp; Means hearing. https://t.co/zIy8MEvtv2","date":"Thu Feb 03 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Our national debt now tops $30 trillion ($30,000,000,000,000) an unfathomable amount. The debt puts an unbelievable burden on future generations of Americans. Congress cannot wait! We must take action now to get America’s fiscal house in order. https://t.co/gU6cxLcCml","date":"Wed Feb 02 20:09:09 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today marks National Freedom Day, which honors President Lincoln’s signing of a Joint Resolution of Congress 157 years ago. This joint resolution would later become the 13th Amendment to the United States Constitution to abolish slavery. https://t.co/fLpjJYfEaW","date":"Tue Feb 01 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Best wishes to those celebrating the Lunar New Year! #LunarNewYear 🐯 #YearOfTheTiger","date":"Tue Feb 01 20:02:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss the latest edition of my e-newsletter? Read it here and be sure to sign up to receive the next one! https://t.co/khGe0jUYf4","date":"Tue Feb 01 00:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The latest edition of my e-newsletter will be delivered to inboxes later today. Are you signed up to receive the latest news? Sign-up now! https://t.co/Bi079Zuk9t","date":"Sun Jan 30 14:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The filing season for 2021 taxes started on Monday. Be sure to visit my website for helpful links and information about filing taxes this year. https://t.co/8J9sl7WdnN","date":"Sat Jan 29 20:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This is Biden’s inflation crisis. “A gauge the Federal Reserve prefers to measure inflation rose 4.9% from a year ago, the biggest gain going back to September 1983...” https://t.co/Wa5JlI2fFG","date":"Fri Jan 28 20:29:23 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - I’d like to thank Lancaster County Rabbi Jack Paskoff of Congregation Shaarai Shomayim for joining me. You can watch the ceremony here: https://t.co/sQNeUoz6fW","date":"Thu Jan 27 19:49:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - Today is International Holocaust Remembrance Day. We remember and will never forget the atrocities of the Holocaust. We must continue to combat antisemitism and hate. This morning, I joined others around the globe in viewing the United Nations Holocaust Memorial Ceremony.","date":"Thu Jan 27 19:49:37 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Real hourly wages have dropped 2.4 percent in the last year thanks to Biden’s 40-year high inflation. https://t.co/6ozUSSCafb","date":"Wed Jan 26 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m looking forward to fighting for #PA11’s farmers and manufacturers as a member of the Trade Subcommittee of the House @WaysandMeansGOP  https://t.co/1kxOKs1U7r","date":"Wed Jan 26 19:47:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks for a great visit! It’s clear to see the passion and excitement that Mrs. Raff shares with her students. Congratulations again to Mrs. Raff on being named 2022 PA Teacher of the Year and thanks for allowing me to visit the “Spy Lab!”","date":"Tue Jan 25 21:54:38 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is taking big bites out of American families’ monthly grocery budgets. https://t.co/VItQ4cJEOb","date":"Mon Jan 24 23:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to assist you if you are experiencing issues with a federal agency or department, visit my website to learn more! https://t.co/xJbI88Ms25","date":"Sun Jan 23 20:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This year’s tax season will begin on Monday, visit my website for helpful links and information about filing taxes. https://t.co/8J9sl7WdnN","date":"Sun Jan 23 15:50:20 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I will always be a voice for the unborn and will continue to fight for pro-life policies in Congress. https://t.co/LqjGiH1G3E","date":"Fri Jan 21 15:33:21 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"One year with Biden in office and the country is facing countless crises. There’s no amount of excuses the Biden administration can make to shrug off their policy failures. Read my thoughts on President Biden’s first year in office. https://t.co/U4KhSwUzZ3","date":"Thu Jan 20 21:52:47 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m proud to have earned an A+ rating on @SBAList’s pro-life scorecard. I will always vote to protect the rights of the unborn and will continue to fight for pro-life policies like the Hyde Amendment to prevent taxpayer dollars from being used to pay for abortions. https://t.co/hSwXW21Tns","date":"Wed Jan 19 20:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss the latest edition of my e-newsletter? Read it here and be sure to sign up to receive the next one! https://t.co/shj1gIU0oS","date":"Wed Jan 19 01:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is a tax hike, pure and simple. It is crushing budgets in Lancaster and York counties. https://t.co/FMRJZ71Kb5","date":"Tue Jan 18 23:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Today we honor and reflect on the works and legacy of Dr. Martin Luther King Jr. https://t.co/iVvTTOd3bg","date":"Mon Jan 17 19:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to subscribe to receive my e-newsletter for the latest news about what’s happening in our district and in Washington! https://t.co/Bi079Zuk9t","date":"Sun Jan 16 15:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Need help with a federal agency? Contact my office for assistance. https://t.co/xJbI88uRax","date":"Sat Jan 15 15:00:03 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Real average hourly earnings are down 2.4 percent compared to last year. With Biden’s inflation 40-year high inflation, workers are making less and paying more. https://t.co/lz5ywsIhmc","date":"Fri Jan 14 18:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"With 40-year high inflation and jobs reports missing expectations, it’s not hard to see why a majority of Americans disapprove of President Biden’s handling of the economy. https://t.co/uCQNgK8bGN","date":"Thu Jan 13 22:30:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Glad to see that the Supreme Court has ruled against President Biden’s misguided and authoritarian vaccine mandate on businesses.","date":"Thu Jan 13 20:13:18 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is taxing Americans’ budgets. Prices are up 7 percent from last year.  https://t.co/pJ5ew3VZDN","date":"Wed Jan 12 15:10:57 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m thankful for the work of law enforcement &amp; community organizations who are working to end human trafficking. Remember, it can happen to anyone in any community. Today on National Human Trafficking Awareness Day, learn more from @DHSBlueCampaign https://t.co/2LfLWeTIOr","date":"Tue Jan 11 22:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to sign up for my e-newsletter for the latest news about what’s happening in the district and in Congress! https://t.co/Bi079Zuk9t","date":"Sun Jan 09 14:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The 106th PA Farm Show begins today! Did you know that #PA11 is the No. 1 agricultural producing district out of PA’s 18 congressional districts? Lancaster and southern York counties produce nearly $1.7 billion in products sold according to USDA data.  https://t.co/cYGAgkQz0s","date":"Sat Jan 08 16:00:01 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Jobs growth under President Biden continues to miss expectations. 199,000 jobs were filled; 400,000 were expected.","date":"Fri Jan 07 16:53:21 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my reflections as we mark the anniversary of the events of January 6, 2021. https://t.co/ziGiYZOQaP","date":"Thu Jan 06 18:45:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"This is good news for dairy farmers locally and across the nation. When we make deals, our trading partners must be willing to hold up their end of the bargain. https://t.co/SUDrd5ceRS","date":"Wed Jan 05 20:52:27 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s 40-year high inflation is crushing the middle class. “Some 84% of those surveyed said the prices they see for everyday goods are higher than they were a year ago...” https://t.co/CvKgUqFtev","date":"Tue Jan 04 23:00:02 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"It’s an honor to serve #PA11 in Congress. In the last year, my office has assisted 2,120 constituents with federal casework. Since 2017, my office has helped return over $6,581,000 to constituents. https://t.co/gLdbWeysNK","date":"Mon Jan 03 20:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"Wishing you all a happy, healthy, and prosperous 2022! https://t.co/zdnhAXLJpr","date":"Sat Jan 01 05:00:00 +0000 2022","user_id":"41417564"},{"handle":"RepSmucker","text":"The DEA seized nearly 8 tons of fentanyl this year, which the DEA says is enough “to kill every American.” Every effort must be taken to stop this deadly drug from entering our nation illegally. https://t.co/mdUbd7f12a","date":"Wed Dec 29 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas and home heating prices have skyrocketed under Biden. His policies are harming American energy production and Americans’ wallets. https://t.co/NLLW6jpFRy","date":"Tue Dec 28 22:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"11 million jobs are available across the nation. 40-year high inflation. This is Biden’s economic crisis. https://t.co/WLIDu5cdyl","date":"Mon Dec 27 23:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"From my family to yours, Merry Christmas! https://t.co/XZv1W0Wl1j","date":"Sat Dec 25 12:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our community is an amazing place to work, live, and raise a family. I’ve heard firsthand the amazing experiences of our neighbors and carry those stories to Washington. Check out my travels and hundreds of visits with “Here’s Lloyd.” https://t.co/w3cOXTy3V2","date":"Fri Dec 24 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciated the opportunity to visit Empire Beauty School in Lancaster, to learn about their organization and speak with students in their cosmetology program. Thanks for a great visit! https://t.co/flm6X04kq9","date":"Mon Dec 20 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy 2nd Birthday @SpaceForceDoD!","date":"Mon Dec 20 21:10:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I had great time touring the facility at Water Street Mission. I appreciated learning more about the services they offer and the great work they are doing to support our community. https://t.co/FPb2GpVzA4","date":"Sun Dec 19 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Having an issue with a federal agency? Contact my office, we may be able to help! https://t.co/xJbI88uRax","date":"Sun Dec 19 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was an honor to join the Red Rose Chapter of the Blue Star Mothers of America and community members for a Wreaths Across America event in Lancaster. May we always give thanks for those who selflessly served our nation. https://t.co/UMjxdHvX3m","date":"Sat Dec 18 19:55:36 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss Democrats’ continued reckless spending, listen in! https://t.co/l597qUnSWT","date":"Sat Dec 18 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to the receive the Champion of the Merit Shop Award from @ABCKeystone in recognition of my legislative efforts to support and promote our free enterprise system. https://t.co/P4Cc8QX0fR","date":"Fri Dec 17 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m a proud member of the Bipartisan Congressional Task Force on Alzheimer's Disease. It was great to meet with local advocates today to hear their stories and discuss legislation before Congress. https://t.co/mGkT9b7bU9","date":"Fri Dec 17 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I enjoyed speaking with and taking questions from students at Garden Spot High School earlier this morning. It was great to discuss issues facing our community and nation with engaged students. https://t.co/c9MaditkzF","date":"Thu Dec 16 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I had a great visit to Direct Wire in Denver earlier this week. I appreciated learning about their wire and cable manufacturing business which has been in operation for nearly 50 years. https://t.co/wAnI3qJve9","date":"Wed Dec 15 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Bill of Rights Day, which commemorates the ratification of the first 10 amendments to our Constitution which guarantee rights and liberties which we enjoy. Today marks the 230th anniversary. https://t.co/9N7Z2MGKWt","date":"Wed Dec 15 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Another middle of the night vote by Congressional Democrats. I’m opposed to their reckless spending.\n\n$1.9 Trillion Progressive Wish List\n\n+$1.2 Trillion “Infrastructure” \n\n+$4.9 Trillion “Build Back Bankrupt”\n\n= $8 Trillion of your tax dollars squandered \nhttps://t.co/anB9hmZJAv","date":"Wed Dec 15 14:46:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I enjoyed visiting Good Samaritan Services in Ephrata yesterday. I learned more about how they are assisting people experiencing homelessness by addressing the individual’s needs. #PA11Tours https://t.co/3N8ZYAIC0o","date":"Tue Dec 14 23:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s inflation, the highest in 40 years, has caused real wages to decrease 8 out of the last 10 months. https://t.co/T2dm6RIh1s","date":"Tue Dec 14 21:08:53 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss the latest edition of my e-newsletter? Read it here!   https://t.co/ahonmYNnjz","date":"Tue Dec 14 16:37:44 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy 385th Birthday to \n@USNationalGuard! Thanks for being “Always Ready, Always There.” A grateful nation gives thanks those who have and continue to serve!","date":"Mon Dec 13 19:24:09 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"CBO reported that #BuildBackBankrupt would add $3 trillion to the national debt, because we know that once a government program is created, it never goes away.","date":"Mon Dec 13 17:37:29 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you subscribed to receive my e-newsletter? Be sure to sign up to receive the next edition of the latest news from around the district and Washington! https://t.co/Bi079ZLVy3","date":"Sun Dec 12 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy 234th Birthday Pennsylvania! On December 12, 1787, Pennsylvania ratified the United States Constitution, becoming the second state to join our union. The Library of Congress has great resources about Pennsylvania. Visit their website to learn more! https://t.co/oldRfcireP https://t.co/ZZSsCPM1Rb","date":"Sun Dec 12 15:21:07 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Under Biden, Americans are making less and paying more. Real wages for American workers are down 8 out of 10 full months Biden has been in office. Inflation is at a 40-year high. https://t.co/gGt4wvWy4I","date":"Sat Dec 11 23:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss another blank check being given to Biden to continue his reckless spending and legislation I’m supporting to help educate students about the dangers of communism. https://t.co/UMf4eFlR4d","date":"Sat Dec 11 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to Elizabeth Raff of @pennmanor School District for being named 2022 Pennsylvania Teacher of the Year! Thank you for all you do to educate and inspire students! https://t.co/8XzLmUbs3Q","date":"Fri Dec 10 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Joe Biden’s economic crisis continues: inflation is at the highest levels in nearly 40 years and it’s crushing the middle class. https://t.co/fUhE9mENuY","date":"Fri Dec 10 17:28:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"11 million jobs are available across the country. Rather than pursuing pro-growth policies to help Americans back to work, Biden wants to increase government dependence. https://t.co/gI8bEbeY34","date":"Thu Dec 09 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to join @RepMariaSalazar in supporting the Crucial Communism Teaching Act. It’s critical that our students are taught the about the dangers of communism and totalitarianism. https://t.co/tRxELbKLoU","date":"Wed Dec 08 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined a strong bipartisan majority last evening in supporting the 2022 NDAA, which provides a pay increase to our troops and additional investment in ensuring our nation’s military remains unrivaled in strength and capability. We owe our soldiers nothing less.","date":"Wed Dec 08 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrats are giving another blank check to Biden so he can continue his reckless spending. Congress shouldn’t govern by “fill-in-the-blank.” https://t.co/rFQJR7UBKU","date":"Wed Dec 08 03:09:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s unconstitutional vaccine mandate for federal contractors has been blocked. https://t.co/cWn8ZpCuSZ","date":"Tue Dec 07 19:00:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Joint Committee on Taxation confirms an average of 87 million middle-class Americans’ financial information would be scooped up under Democrats’ plan to weaponize the IRS.","date":"Tue Dec 07 17:47:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today marks the 80th anniversary of the attack on Pearl Harbor. May we pause to honor and remember those we lost that day and those who served our nation in the armed forces. https://t.co/SbUBptGvyU","date":"Tue Dec 07 16:36:07 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join RJ Harris on WHP580 this morning to talk about Democrats’ multi-trillion-dollar tax-and-spend legislation and Biden’s vaccine mandate which is a massive government overreach. If you weren’t able to tune in, listen below! \nhttps://t.co/jF7VAaaPXT","date":"Mon Dec 06 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to @pennmanor Teacher Elizabeth Raff on being named 2022 Pennsylvania Teacher of the Year! Thank you for all you do to educate students in our community!","date":"Mon Dec 06 20:58:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Saddened to learn of the passing of Bob Dole, who spent a lifetime in service to the nation as a public servant and veteran.","date":"Sun Dec 05 18:35:49 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Having trouble with a federal agency? Reach out to my office, we may be able to help. https://t.co/xJbI88uRax","date":"Sun Dec 05 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet Timbrel earlier this week. I appreciated hearing her story &amp; learning how she is giving back through her store in downtown Lancaster, Lush Bazaar. Local policymakers need to be sure small businesses, which are the cornerstone of our community, are supported. https://t.co/rjkd8BxACl","date":"Sat Dec 04 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to discuss my views on the Dobbs case and what I’ve heard from small businesses who are struggling to find employees to fill available jobs. https://t.co/1VNl2fUgUK","date":"Sat Dec 04 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Chag Sameach to everyone celebrating Hanukkah! It was great to join the ceremony this evening in downtown Lancaster. https://t.co/9Gshxzk1di","date":"Sat Dec 04 00:47:30 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Disappointing job growth and thirty-year high inflation forcing Americans to pay more. This is Joe Biden’s economic crisis. https://t.co/tFGy4utbrK","date":"Fri Dec 03 16:17:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congress has to be clear-eyed about the threat that China poses and how America’s trade policy is part of a holistic response to that threat. Listen to my comments from yesterday's Ways &amp; Means Trade Subcommittee hearing. https://t.co/l8SSlXQvRb","date":"Fri Dec 03 15:12:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congress needs to get its fiscal house in order. https://t.co/Jacv3NXrUC","date":"Thu Dec 02 22:56:36 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I will always be a voice for the unborn in Congress. It was great to meet with pro-life constituents who traveled to Washington today. https://t.co/jBJl2KCFHH","date":"Wed Dec 01 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It looks like the menorah in Downtown Lancaster was damaged by love &amp; not by hate! It’s typical of the LNP to assume the worst of our community, but I know Lancaster &amp; I know we’re stronger when we come together &amp; I will always work to unite us. https://t.co/hTlGQX5Rzy","date":"Wed Dec 01 17:06:11 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"How out of touch. What a disrespectful way to speak to families who are paying 50% more for gas than they did last year because of Biden’s policies. The average EV costs $50,000+ &amp; nearly 80% of folks claiming the EV tax credit make over $100k year. https://t.co/17HuZ3QNqD","date":"Tue Nov 30 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciated the behind-the-scenes tour at APR Supply, a third-generation wholesale distributor of plumbing, HVAC, and hydronics materials. I enjoyed speaking with the team members and learning about their innovative inventory management technology! #PA11Tours https://t.co/R1Bh0OPybN","date":"Tue Nov 30 19:11:17 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today I had a great visit to Rhoads Energy, a family-run company, at their Mount Joy facility. I enjoyed learning more about the issues and challenges they and the propane industry are currently facing. Congratulations on 100+ years in business!  #PA11Tours https://t.co/STtLpqAhqU","date":"Mon Nov 29 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"To those in our community who are celebrating Hanukkah, which begins this evening, Chag Sameach! https://t.co/YXEPRdi5bY","date":"Sun Nov 28 20:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to the team at Penn Mar Human Services in New Freedom for sharing the great work they’re doing to support people with intellectual and developmental disabilities. https://t.co/Of1JJ6wQlA","date":"Sun Nov 28 20:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join municipal leaders to tour small businesses, which helped make Lititz, PA, one of the coolest small towns in the country! Don’t forget to support your favorite small businesses today on Small Business Saturday! https://t.co/1elkozqaxE","date":"Sat Nov 27 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Small businesses help our community thrive. There are nearly 13,000 small businesses in #PA11, be sure to support your favorite small business today! https://t.co/sEgxiOl2aF","date":"Sat Nov 27 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit OSS Hospital in York to learn more about federal policies impacting orthopedic care. https://t.co/Euab8KNVwb","date":"Fri Nov 26 20:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Hello from the Snack Food Capital of the World! I enjoyed receiving a behind-the-scenes look at the amazing operation at Snyder’s of Hanover with @RepKateKlunk. https://t.co/wwwy5mQHH0","date":"Fri Nov 26 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"From my family to yours, best wishes for a great Thanksgiving! https://t.co/8O2Vo6Kim4","date":"Thu Nov 25 14:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to members of the Southern York County Business Association who spoke about the challenges facing their small businesses under the Biden administration with @RepKateKlunk and myself this week. I remain committed to advancing pro-growth policies to support small businesses. https://t.co/1PhlAb3LEH","date":"Wed Nov 24 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Not even the Dollar Tree is immune to Biden’s 30-year high inflation! https://t.co/IppN1tfTRu","date":"Wed Nov 24 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to the @SGSchoolNews girls’ volleyball team for winning the state championship last weekend! Be proud of your accomplishment! https://t.co/SsWADZMesq","date":"Wed Nov 24 00:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden &amp; Pelosi’s multi-trillion tax-and-spend plan hurts small businesses across the country. It was great to share the concerns I’ve heard from small businesses with @cbs21news @MikeGorsegner today in Hanover. Be sure to tune into CBS21 tonight! https://t.co/WnWw7YdbtP","date":"Tue Nov 23 21:30:05 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden releasing oil from the reserve isn’t about addressing high gas costs, it’s about trying to fix his plummeting approval ratings. They’re releasing only 50 million barrels; we average 18 million barrels PER DAY. It’s barely a drop in the bucket. https://t.co/moxhUXrwCk","date":"Tue Nov 23 18:09:13 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s #ThanksgivingTax is taking a bite out of American families’ budgets this year. https://t.co/D73k5KoCE1","date":"Mon Nov 22 22:05:34 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Having problems with the Social Security Administration, IRS, or Veterans Affairs? Contact my office, we may be able to assist you. https://t.co/xJbI88uRax","date":"Sun Nov 21 23:22:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"When there are over 10 million jobs available Congressional Democrats are limiting education options of students trying to live their American Dream, simply because Congressional Democrats don’t like the schools they’ve chosen. Disgraceful.","date":"Sun Nov 21 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss the disastrous “build back bankrupt” legislation, listen in! https://t.co/lUAgeLomkK","date":"Sat Nov 20 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Hidden away in Biden &amp; Pelosi’s monstrosity of a bill – allowing taxpayer dollars to be spent on abortions, doing away with the Hyde Amendment. They won’t talk about it because they know it’s wrong. Congress cannot allow this to stand. It is unconscionable. https://t.co/YVwgF6YFXW","date":"Sat Nov 20 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden &amp; Pelosi are raising taxes on small businesses so they can dole out nearly $300 billion in tax breaks to millionaires. Let that sink in. https://t.co/YEiN7OSfi9","date":"Fri Nov 19 21:09:58 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I voted against Biden &amp; Pelosi’s disastrous tax-and-spend legislation and will continue to oppose this massive increase in the size and scope of the federal government. https://t.co/RAWos4H8wl","date":"Fri Nov 19 14:54:09 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Joe Biden’s reckless spending will guarantee his goes down in history as the most expensive presidency and piles all of the debt on the backs of hardworking Americans.","date":"Thu Nov 18 22:53:53 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden &amp; Pelosi want to bankrupt small businesses- $400+ billion in tax hikes in their plan. Learn more: https://t.co/af7yxdjEIM https://t.co/5QW3iK7NIE","date":"Thu Nov 18 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Second most expensive piece of Biden &amp; Pelosi’s legislation = tax cuts for the wealthy. The bill “includes a $285 billion tax cut that would almost exclusively benefit high-income households over the next five years.” https://t.co/mFUjcjke3W","date":"Thu Nov 18 19:55:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Individual Freedom &amp; Free Enterprise vs. Big Brother Government Control. That’s the choice we have before us today on the House floor. I will always stand with the American people. https://t.co/QnT7N0bMJw","date":"Thu Nov 18 17:34:10 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I stood with my colleagues this evening in support of @RepFredKeller’s Congressional Review Act legislation to block Pres. Biden’s misguided, unnecessary and frankly unconstitutional vaccine mandate. https://t.co/zqp0UUhArs","date":"Thu Nov 18 02:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to support @RepFredKeller's Congressional Review Act legislation to stop the Biden administration’s misguided and authoritarian vaccine mandate. https://t.co/VWQMxm7kxk","date":"Wed Nov 17 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Wait a minute, when the Biden administration said their bill would cost “$0” that wasn’t true? Shocking. https://t.co/1TMFCzPJ4g","date":"Wed Nov 17 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"When will the Biden administration be straight with the taxpayers about their massive inflation? https://t.co/4GQaeR745I","date":"Wed Nov 17 18:20:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to President Biden, you will pay more at the gas station, at the grocery store, and now for seniors’ Medicare bills. #Bidenflation https://t.co/XAkjh97QWy","date":"Tue Nov 16 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is hurting working and middle-class Americans the most. What’s the Biden administration’s plan? Raise taxes, spend more money, and cause inflation to go even higher. https://t.co/QUBJjFLs3c","date":"Tue Nov 16 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Check out the latest edition of my e-newsletter and be sure to sign-up to receive the next one! https://t.co/VZP6AxpHzB","date":"Tue Nov 16 00:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I’ve been saying it for months: “Most millionaires could get tax cut under House Dems' tax plan” https://t.co/ZYJ4ciPrlX","date":"Mon Nov 15 23:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"5/8 - Lowest recorded poverty rate. “The 2019 poverty rate of 10.5 percent is the lowest rate observed since estimates were initially published in 1959.”  https://t.co/IgqoE3STBu","date":"Mon Nov 15 19:33:28 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"7/8 - Their news team even covered how one local business increased wages, distributed bonuses and planned to invest more in the community because of the TCJA: https://t.co/xxDV3IpSzQ","date":"Mon Nov 15 19:33:28 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"8/8 - Meanwhile, they ignore that the infrastructure deal will add hundreds of billions to our debt AND ended pandemic help to small businesses. The LNP Editorial Board won’t let the facts get in the way of their shilling Biden and Pelosi’s agenda.","date":"Mon Nov 15 19:33:28 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"4/8 - Lowest unemployment rate in 50 years. https://t.co/MwbaREvOXo","date":"Mon Nov 15 19:33:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/8 - A $5,000 increase in median household income from 2017-2019 before the pandemic. https://t.co/OKqvQBKEKy","date":"Mon Nov 15 19:33:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/8 - The LNP Editorial Board, @SuzCassidyLNP, @TomMurse, is drunk on Democrat Kool-Aid. Only these out-of-touch ivory tower elites continue to deny that #TCJA was a game-changer for the American economy. Let’s look at some facts:","date":"Mon Nov 15 19:33:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/8 - I support more of YOUR money in YOUR pocket, and fewer tax dollars wasted by the government.","date":"Mon Nov 15 19:33:26 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s spending is causing inflation…how does more spending stop it? It doesn’t. This administration needs to be straight with the American taxpayers. https://t.co/KcQiSRBp8C","date":"Mon Nov 15 17:07:35 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciated learning from the volunteers and staff who are working to make a difference and support our community through their work at the Lancaster Food Hub. https://t.co/BbBhrO2RAh","date":"Mon Nov 15 15:30:16 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"York County is home to many heroes who served our nation in the armed forces. I appreciated the opportunity to meet so many outstanding veterans during the York County Veterans Affairs breakfast. Their service strengthened our nation &amp; continues to strengthen our communities. https://t.co/4dggRnBkLG","date":"Sat Nov 13 20:44:52 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss my efforts to fight back against President Biden’s misguided vaccine mandate and the latest on unchecked spending in Washington. https://t.co/P90g9qRQMi","date":"Sat Nov 13 19:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Fighting fires isn’t easy work. Those who volunteer to serve as firefighters do so selflessly. It was great to meet with members of Garden Spot Fire Rescue to learn about challenges facing the firefighting community. Thanks to these members for all they do! https://t.co/dsy0Ssahrd","date":"Sat Nov 13 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was hard not to be moved by such an impressive patriotic display at the Masonic Village in Elizabethtown yesterday. Thank you to those who organized an outstanding ceremony to honor those who wore the uniform in service to our nation and flag. https://t.co/j9wK97BJM5","date":"Fri Nov 12 20:50:49 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s no denying it. Biden’s 30-year high inflation is forcing American families to stretch every dollar in their budget as far as it will go.  https://t.co/QHV2ou6CdI","date":"Fri Nov 12 15:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"America is the greatest country in the history of the world. We owe unending gratitude and honor to those who served. It was great to hear that message today during a Veterans Day Ceremony in Millersville. https://t.co/gPRs4MowKe","date":"Thu Nov 11 20:18:42 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today we honor and thank all those who served in the United States Armed Forces. Thank you for preserving and protecting the freedoms which we enjoy. https://t.co/o3Ke1ATHFZ","date":"Thu Nov 11 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy 246th Birthday to the United States Marines! https://t.co/IKWNWtiABD","date":"Wed Nov 10 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pennsylvania needs AG Shapiro to stand up and fight against President Biden’s authoritarian and misguided vaccine mandate. Learn more https://t.co/yLXfu3PLip","date":"Wed Nov 10 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s #ThanksgivingTax will make it more difficult to put food on the table as prices soar. https://t.co/SknPQbOzKZ","date":"Tue Nov 09 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"NEW APPLICATION DEADLINE – For York County residents impacted by the remnants of Hurricane Ida earlier this year, the new deadline to apply for assistance is December 10, 2021. Visit the FEMA website for more information: https://t.co/eTvafznMfF","date":"Tue Nov 09 01:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"REMINDER: Biden &amp; Pelosi’s “Build Back Bankrupt” plan includes ENORMOUS TAX GIVEAWAYS for the wealthy coastal elites in New York and California. https://t.co/mFKlx1CThN","date":"Mon Nov 08 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My office can assistant constituents with many issues they may be experiencing will federal agencies. Visit my website to learn more and contact my office if we may be of assistance! https://t.co/xJbI88uRax","date":"Sun Nov 07 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Good news from the courts this weekend as Biden’s authoritarian vaccine mandate temporarily stopped https://t.co/JIXexdxVkK","date":"Sun Nov 07 16:52:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to discuss how Congress is working to improve the lives of veterans as our nation prepares to observe Veterans Day next week. https://t.co/0ZYclBHFcL","date":"Sat Nov 06 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It doesn’t matter what clever name Biden and Pelosi give their legislation. It’s all just lipstick on the pig that is their massive tax and spending spree. That means more fuel on the fire of inflation and an ever-gluttonous federal bureaucracy.","date":"Sat Nov 06 04:41:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today was the most expensive day in House history.","date":"Sat Nov 06 03:46:09 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my @HouseGOP colleagues in calling for no vote on this massive tax and spending legislation until the CBO has issued a score. The American people deserve to know the cost. https://t.co/6EQURBmixX","date":"Fri Nov 05 16:06:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI-I joined Varney &amp; Co. yesterday to discuss Democrats’ ludicrous giveaway to coastal elites and the wealthy by increasing the SALT deduction. https://t.co/MPkru7v1Ai","date":"Fri Nov 05 13:50:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Hold onto your wallets, America. Biden and Pelosi’s massive trillion dollar tax and spend bill is scheduled for a vote today. Today will be the most expensive day in House history.","date":"Fri Nov 05 12:32:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to Les Houck for fifty years of dedicated servant leadership to his community, including 48 years as a township supervisor in Salisbury Township in eastern Lancaster County. https://t.co/taN8Rz3ti1","date":"Thu Nov 04 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking forward to joining @GOPLeader this afternoon to discuss Biden’s Made in America tax which will hurt American workers and companies. Tune in below at 4! https://t.co/XXtUuY2HOC","date":"Thu Nov 04 19:37:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I'll be joining @Varneyco on Fox Business at 9:15, be sure to tune in!","date":"Thu Nov 04 13:02:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrats’ solution to sinking of the Titanic? Bringing more water on board. \n\nhttps://t.co/nfqw3lbFjp","date":"Wed Nov 03 12:38:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"According to those surveyed in a recent F&amp;M poll, only 32% of respondents believe Biden is doing an “excellent” or “good” job. With GDP and jobs reports missing expectations, worsening inflation, and the ongoing crisis at our southern border, it’s not hard to see why.","date":"Tue Nov 02 13:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter below and be sure to sign-up to receive the next one! https://t.co/3li0liCyMy","date":"Tue Nov 02 00:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to provide members of the Lancaster County Association of Township Supervisors with an update on what’s happening in Washington. As a former township supervisor, thanks for all you do to build strong communities in #PA11. https://t.co/io75tU1wdl","date":"Mon Nov 01 22:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to join your friends and neighbors in signing up to receive my periodic e-newsletter, for the latest information about what’s happening in Washington and across our district! https://t.co/Bi079ZLVy3","date":"Sun Oct 31 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation is still running rampant and is made worse because of Biden’s reckless spending. https://t.co/rI3BFURUdd","date":"Fri Oct 29 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Being targeted by Biden’s and congressional Democrats’ plans to have the IRS snoop on your bank account is easier than you think, learn more from @WaysandMeansGOP :  https://t.co/2NHzkYHVf1","date":"Thu Oct 28 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies are continued bad news for the American economy, which missed GDP growth expectations for the third quarter in a row.\nhttps://t.co/YWR2AZtNjS","date":"Thu Oct 28 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you to all first responders in #PA11 and across the nation for their selfless service in keeping our communities safe. #NationalFirstRespondersDay https://t.co/o5WvF6uNxw","date":"Thu Oct 28 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Gobble Gobble! Biden’s inflation will be taking a bite out Americans’ budgets this Thanksgiving. 🦃 https://t.co/bUAooxh23J","date":"Thu Oct 28 14:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"October is Breast Cancer Awareness Month. Breast cancer is the second most common cancer in women. I am proud to be a part of a bipartisan group who requested robust funding to support ongoing breast cancer research programs. https://t.co/7MZFXoUbQU","date":"Wed Oct 27 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is National Day of the Deployed, a day to recognize and give thanks for those selflessly serving abroad in the United States Armed Forces and recognizing the sacrifices of their families. https://t.co/F3m4kBTEDn","date":"Tue Oct 26 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s Big Brother IRS wants to monitor Americans’ bank accounts. Read “$28/Day” from @GOPLeader: https://t.co/NVq22iKA8C","date":"Tue Oct 26 00:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It is unacceptable that these people were left behind. EVERY effort must be made to ensure those who want to leave are able to leave safely. https://t.co/bYVHQT2Vzu","date":"Mon Oct 25 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My offices are available to assist you with issues you may be experiencing with federal departments or agencies. Learn more at my website: https://t.co/xJbI88Ms25","date":"Sun Oct 24 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC this week to talk about the Ways and Means Republicans’ efforts to stop Biden administration’s plans to turn the IRS into “Big Brother.\" https://t.co/x2lS1Wdxzt","date":"Sat Oct 23 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s reckless spending is causing inflation which is taxing Americans’ budgets. https://t.co/DI26iDLWKF","date":"Fri Oct 22 22:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"In true form, the Biden administration's dangerous IRS surveillance proposal is a massive government overreach. I am proud to stand with Rep. Ferguson and my @WaysandMeansGOP colleagues to protect Americans' privacy. https://t.co/YH2fieYVpI","date":"Thu Oct 21 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks for fighting against this massive government overreach @RepTomEmmer","date":"Thu Oct 21 19:38:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This coming Saturday, October 23, is National Drug Take Back Day. Visit the DEA’s website to learn more about the need to dispose of unused or expired prescriptions to ensure they do not fall into the wrong hands. https://t.co/r7pMn05tOK","date":"Thu Oct 21 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our nation’s broken immigration system is a disgrace, with absolutely traumatic consequences recently in Philadelphia. How can someone whose visa was terminated and later convicted of crimes be free to commit such a heinous and vile act?  https://t.co/EDOJtKhOBN","date":"Thu Oct 21 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"As an American, it gives me great pride when I reflect on the selfless service of our veterans. I enjoyed meeting with Robert yesterday and presenting him with a commemorative Vietnam Veteran Lapel Pin. Thank you for your service, Robert! https://t.co/x1dvaXVYSx","date":"Tue Oct 19 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"What a shocker! Biden’s out-of-control spending leads to inflation. Just imagine what trillions more will do to inflation. Inflation is a tax on all Americans. https://t.co/4LuysklqHv","date":"Tue Oct 19 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Did you miss my e-newsletter from this weekend? Read it here and be sure to sign-up to receive the next edition! https://t.co/im90TBye79","date":"Tue Oct 19 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"No matter how many times they say it, it isn’t true. Their plan will cost trillions and the middle-class will pay more.","date":"Mon Oct 18 21:26:53 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you subscribed? Be sure to sign up to receive my e-newsletter to have the latest news from Washington and our district sent to your inbox. https://t.co/Bi079ZLVy3","date":"Sun Oct 17 15:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to the hardworking staff at Pennsy Supply’s Thomasville Quarry for hosting a “behind the scenes” and underground tour of their operations in York County for myself and members of my team. https://t.co/B5o7r744q9","date":"Sat Oct 16 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to join my @WaysandMeansGOP colleagues in supporting legislation to stop President Biden’s plans to weaponize the IRS through surveillance of individuals’ bank accounts. Biden’s plan is a massive government overreach and intrusion of privacy. https://t.co/suvli45qh5","date":"Sat Oct 16 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: Bidenflation is crushing American families. https://t.co/b97owlcOMF","date":"Fri Oct 15 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"PA-11 is home to some of the highest quality soil in the nation. Yesterday marked National Farmer Day. Let’s thank the farmers and producers who serve as stewards of our land and help to get food on our tables. https://t.co/ptE37g1IfM","date":"Wed Oct 13 13:04:20 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is World Mental Health Day, reminding us to take care of our mental health. Important phone numbers: \n\nNational Suicide Prevention Lifeline: 1-800-273-TALK (8255) \n\nSAMHSA’s National Helpline: 1-800-662-HELP (4357) \n\nVets Crisis Line: 1-800-273-TALK (8255) Press 1 https://t.co/jw87GWo9zk","date":"Sun Oct 10 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Having an issue with a federal agency or department? My office may be able to help, learn more: https://t.co/xJbI88Ms25","date":"Sat Oct 09 14:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“I feel ecstatic.” Congratulations to Andrew and the 20 other newest patriotic American citizens who participated in yesterday’s naturalization ceremony in York County. Thanks to York County Prothonotary Allison Blew for inviting my office to participate. https://t.co/wSXuikVKZv","date":"Fri Oct 08 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The jobs report once again misses expectations, this time by over 300,000 jobs. Biden’s tax and spend proposals are bad for our economy.  https://t.co/cCyLDv36WV","date":"Fri Oct 08 17:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Attention Lancaster County businesses impacted by the recent storms from the remnants of Tropical Depression Ida, you may be eligible for assistance from the Small Business Administration. Learn more here: https://t.co/kAYkPPUxbJ","date":"Thu Oct 07 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"House Democrats earned a lot of Pinocchio’s discussing the impact of the Tax Cuts &amp; Jobs Act. The facts are TCJA created low unemployment, lowest recorded poverty levels, &amp; increased median household income by $5k. Listen to my comments at a recent @WaysandMeansGOP meeting https://t.co/hINL79c534","date":"Thu Oct 07 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation forces the average family \"to spend an extra $175 a month on food, fuel and housing according to Mark Zandi, chief economist at Moody’s Analytics.\" https://t.co/7aCArcEGlM","date":"Thu Oct 07 19:35:45 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Gas prices are the highest they’ve been in seven years; Biden’s inflation is squeezing working-class Americans’ budgets. https://t.co/g5fbsPhKBg","date":"Wed Oct 06 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my latest e-newsletter to learn about how I’m fighting against President Biden and Speaker Pelosi’s reckless spending spree. https://t.co/jtKegog7mz","date":"Tue Oct 05 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The President is delusional. His bankrupt America plan costs $5.5T and no amount of malarkey math will change that.","date":"Tue Oct 05 20:50:22 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to all teachers across our community and across the nation who work hard educating students! https://t.co/lr71yAVYX7","date":"Tue Oct 05 18:07:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to subscribe to my e-newsletter for the latest happenings in Washington and in the district! https://t.co/Bi079ZLVy3","date":"Sun Oct 03 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Northern Lancaster County Regional Police Chief David Steffen was selected to serve as President of the Pennsylvania Chiefs of Police Association. Congratulations on your new role and thank you for serving and protecting our community! @RegionalPD86 @PAChiefs https://t.co/BrRlZ3BsZE","date":"Sat Oct 02 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio this week to discuss the Biden administration’s plans to weaponize the IRS and Speaker Pelosi’s extreme pro-abortion legislation which would roll-back pro-life protections in states across the nation. https://t.co/z5TeoiR52N","date":"Sat Oct 02 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Manufacturing Day! Manufacturing is a strong part of PA-11’s economy and employs nearly 60,000 individuals. From agricultural equipment to snack foods, our congressional district makes it all! https://t.co/AmPlUlGEaP","date":"Fri Oct 01 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s inflation is middle-class taxation. https://t.co/y85RV9TCk8","date":"Fri Oct 01 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to Elizabethtown Borough Mayor Chuck Mummert on being named “Mayor of the Year”! Thanks for all you do to make the borough a great place! https://t.co/BfAXOKmizn","date":"Thu Sep 30 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Sen. Manchin is showing his true colors now: trading in a booming economy created by TCJA for a bigger bloated federal government. $3.5T or $1.5T, it’s all wasting YOUR tax dollars. https://t.co/33PALnk59I (1/2)","date":"Thu Sep 30 18:24:16 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"TCJA led to low unemployment, the lowest recorded poverty rate, and a $5,000 increase in median household income until the pandemic took hold. We MUST protect taxpayers and TCJA, not the Dems and their delusion. (2/2)","date":"Thu Sep 30 18:24:16 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my @WaysandMeansGOP Oversight Subcommittee members for a hearing today to discuss the Biden administration’s proposals to weaponize the IRS and how conservative and Christian faith-based organizations have been impacted. https://t.co/NT9Zga7BCw","date":"Thu Sep 30 00:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with members of the National Agriculture Council of Mexico to discuss the USMCA and additional trade opportunities between the United States and Mexico. https://t.co/8hq17ewMkH","date":"Wed Sep 29 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Dems are silent on ways to manage and shrink the nation’s debt. Instead, they want to spend their way to a “prosperous” economy…really just a bloated government. More debt and less individual freedom; I oppose this Democrat radical socialist agenda. https://t.co/7i1a5VIkSu","date":"Wed Sep 29 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be aware of the danger of counterfeit prescription drugs, learn more from @DEAHQ","date":"Tue Sep 28 13:02:43 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Those “numbers and dollars” the Speaker doesn’t want to talk about? Trillions of dollars in tax hikes. Trillions of dollars in inflation-inducing and debt-ballooning spending.","date":"Mon Sep 27 20:26:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Miss the show on Sunday? Watch my interview with CBS21’s Face the State here - https://t.co/YmDEcydC2O","date":"Mon Sep 27 19:05:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden is pushing devastating changes to stepped-up basis which would tax family-farms and small businesses out of existence. 99% of PA-11 farms are family-owned and are at risk under Biden’s proposal. Learn more from my comments from last evening’s mark-up. https://t.co/82US8XpDGr","date":"Sun Sep 26 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - During House Budget Committee debate a Dem colleague said: “My Republican colleagues have created a new name for the CEOs and the wealthy: job creators.” I was a CEO and I’ve created 100s of family-sustaining jobs. This bloated budget that we’re debating creates 0!","date":"Sat Sep 25 23:53:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - The private sector creates jobs not big government!","date":"Sat Sep 25 23:53:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrats, do you know how the economy works? American success comes from the people. Not big government - IT DOESN’T WORK! https://t.co/UdAZIzwscf","date":"Sat Sep 25 22:18:42 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio this week to discuss our nation’s out of control federal debt and the crisis at our southern border. https://t.co/3AnGwgSkWp","date":"Sat Sep 25 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I voted against Democrats’ extreme pro-abortion legislation which would unravel state level pro-life protections across the nation, including the commonsense protections that the PA General Assembly adopted in the wake of the horrors of murderer Kermit Gosnell. https://t.co/XnBMS7Hik3","date":"Sat Sep 25 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Every Congress is faced with hard choices, and this Congress is no different. Will we allow the government to dictate every facet of American life, or will we renew our trust in the American people? \nI know which side I’m on; I will always side with the American people. https://t.co/SjTAtyEArR","date":"Thu Sep 23 19:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden is directly responsible for the humanitarian and security crisis at our southern border. Apprehensions in August were at a 21-year high. https://t.co/b71dTcSfkV","date":"Wed Sep 22 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It is wrong that Democrat leadership caved to extremists in their own caucus to strip critical support for our ally Israel. @HouseGOP will always stand with Israel.","date":"Wed Sep 22 16:25:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I voted against Speaker Pelosi’s attempt to add trillions to our national debt and increase inflationary pressures through unchecked spending. Any discussions regarding the debt limit must include meaningful policies to rein in reckless spending.","date":"Wed Sep 22 00:44:39 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The opportunity for individuals to live their American Dream is at stake because of President Biden’s reckless tax and spend agenda. Read more about comments from the recent Ways &amp; Means mark-up. https://t.co/o4WDWXlz2U","date":"Tue Sep 21 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Check out the latest edition of my e-newsletter! https://t.co/Oo65GUNtzb","date":"Mon Sep 20 14:29:07 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you subscribed to my e-newsletter? Be sure to subscribe today to get the latest news about the happenings in Washington, DC and across the Eleventh District! https://t.co/Bi079ZLVy3","date":"Sun Sep 19 15:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Best wishes to the United States Air Force which today is celebrating its 74th year of service to our nation. To all who have served over those years or are currently serving, thank you! https://t.co/5nCJKHZL5r","date":"Sat Sep 18 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I joined WDAC Radio to talk about the House Democrats plans to increase taxes on middle-class Americans and small businesses. https://t.co/IqHZGCSuMG","date":"Sat Sep 18 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"BioTechnique is a unique medical manufacturer based in York, PA. I enjoyed visiting their facilities and learning more about their industry. https://t.co/28dkkH46YH","date":"Sat Sep 18 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Constitution Day, marking the 234th anniversary of the signing of our United States Constitution establishing a government of “We the People of the United States.” https://t.co/TnCTjIntkC","date":"Fri Sep 17 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today marks POW/MIA Recognition Day, honoring those who were held captive during their service and those who have yet to return home. May we always remember and honor these heroes. https://t.co/jzsNJJHpTG","date":"Fri Sep 17 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday was the one-year anniversary of the signing of the Abraham Accords in Washington, truly historic agreements normalizing diplomatic relations between our close ally Israel and other nations in the Middle East.","date":"Thu Sep 16 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The crossroads we are at is simple: bigger government controlling your life, or saving your individual freedom and the American Dream.","date":"Thu Sep 16 17:30:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s border crisis continues to spiral out of control. August was the second consecutive month with over 200,000 encountered crossings. https://t.co/dYlLu06pZO","date":"Thu Sep 16 15:27:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Why are my Democrat Ways and Means Committee colleagues so determined to raise taxes on small businesses? Nearly 13,000 small businesses employ over 150,000 individuals in PA-11. https://t.co/TJ4ZlrrFiB","date":"Thu Sep 16 13:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"House Dems put the cart before the horse. They want YOU dependent on the federal government &amp; believe big government is the answer. The truth is, it is the free enterprise system that has created opportunities for individuals to live their American Dreams, not the government. https://t.co/Ku6rLKS6n7","date":"Wed Sep 15 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Wishing our friends and neighbors observing Yom Kippur an easy and meaningful fast. https://t.co/mdwxjZHlQ4","date":"Wed Sep 15 21:11:11 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"House Democrats are giving their union friends an above-the-line tax deduction, while raising taxes on the middle-class and small businesses across the country. Think about that.","date":"Wed Sep 15 19:52:16 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My House Democrat colleagues continue to share falsehoods about their disastrous tax-and-spend agenda. Here are the facts about how middle-class Americans will be impacted: https://t.co/Delw4RuNKj","date":"Wed Sep 15 14:28:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Attention York County residents and businesses impacted by Hurricane Ida, you may be eligible for assistance from FEMA or the SBA. Learn more about what programs you may be eligible for here: https://t.co/UYPjcVXsiH","date":"Wed Sep 15 01:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3 - House Dems talk about making the wealthy pay their “fair share” while subsidizing the purchase of electric vehicles, which are overwhelmingly purchased by those making over $100,000 a year. Electric vehicles pay nothing to support highway maintenance.","date":"Wed Sep 15 00:08:20 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3 – Learn more about my USER Fee Act - https://t.co/2ASy4FFIzE","date":"Wed Sep 15 00:08:20 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3 - Why don’t House Democrats put their money where their mouth is and support my USER Fee Act to make electric vehicles contribute to the maintenance of the roads they drive on? https://t.co/x2zwqRyXU1","date":"Wed Sep 15 00:08:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"House Democrats say they are trying to “responsibly” fund their socialist wish list. Tax hikes on small businesses and the middle-class is hardly responsible: it is reckless. https://t.co/ofu1XThjkg","date":"Tue Sep 14 20:35:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If Budget Chairman @RepJohnYarmuth would have held a markup on the budget resolution he would know that money doesn’t grow on trees.","date":"Mon Sep 13 19:54:38 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit Voith Hydro’s manufacturing facility in York, one of the largest hydropower turbine equipment manufacturing facilities in the world. https://t.co/p3uzHosFPD","date":"Mon Sep 13 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Need help with a federal agency? My office may be able to provide assistance for issues with federal agencies. https://t.co/xJbI88uRax","date":"Sun Sep 12 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to share my thoughts on the 20 year anniversary of the attacks of September 11, 2001 and the Ways &amp; Means committee consideration of the $3.5 trillion budget reconciliation legislation. https://t.co/bWwL4PT7nU","date":"Sat Sep 11 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Hanover community gathered last evening to mark the 20 year anniversary of the attacks on September 11, 2001. May we never forget those we lost and the bravery of those who worked to save others. https://t.co/ZkTq6n2e57","date":"Sat Sep 11 11:13:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Gov. Tom Wolf’s fatal decision let COVID-19 spread through Pennsylvania nursing homes like wildfire resulting in too many tragic deaths. It is shameful that my amendment to ensure accurate data reporting was voted down.","date":"Fri Sep 10 21:37:22 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Add this to the growing list of times where Biden has misled the public.","date":"Fri Sep 10 21:15:13 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Come tell that to the farmers of my district—99 percent of farms here are family-owned and operated. This plan would crush our family farms.","date":"Fri Sep 10 19:58:23 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"House Democrats want YOU to be more dependent on the federal government. My colleague @BillPascrell (D-NJ) said “if that’s socialistic, count me in.” Their bill is another step in the direction of Democrat’s preferred outcome, socialism. https://t.co/yFgeUTTrsd","date":"Fri Sep 10 17:43:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I strongly oppose Biden’s authoritarian vaccine mandate on Americans, and believe it is a massive government overreach.","date":"Thu Sep 09 20:43:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"@RepGwenMoore said today the dignity of work is “like hearing nails on a chalkboard.” It’s no wonder @WaysMeansCmte Dems\nvoted down my commonsense amendment to tie paid-leave to employment. This is the latest Democrat attack in their war on work. https://t.co/wWfmBE7vNR","date":"Thu Sep 09 19:59:25 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden Administration is so delusional about the economic crisis of inflation that they are resorting to baseless attacks on American companies.","date":"Thu Sep 09 19:58:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This $3.5 trillion cradle-to-grave spending bill is not about revitalizing the greatest economy in our nation’s history, it is about setting a course for socialism, and consolidating power in Washington. The American Dream is at stake. My opening comments from today’s mark-up. https://t.co/lpr7wJ8VcT","date":"Thu Sep 09 17:30:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"To all our Jewish friends and neighbors in #PA11 celebrating Rosh Hashanah, Shanah Tovah! https://t.co/7CLJMqWfx2","date":"Tue Sep 07 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have you read the latest edition of my e-newsletter?\nhttps://t.co/2dGMSmpCfr","date":"Tue Sep 07 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Wishing everyone a relaxing Labor Day! https://t.co/ddzSsE56Bc","date":"Mon Sep 06 13:08:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC to discuss the impact of the remnants of Hurricane Ida on our community and the significance of Labor Day. https://t.co/QsUIpazal0","date":"Sat Sep 04 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 – For Lancaster County residents impacted by the recent storms. You can report property damage to the Lancaster County Emergency Management Agency through their website: https://t.co/QOA2D8v0zx","date":"Fri Sep 03 20:35:08 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - Attention York County residents impacted by recent storms. Please report property damage to York County Emergency Management via their form found at https://t.co/Dr6XhV9OpD. 211 service is also able to assist with damage reporting and direction to county services.","date":"Fri Sep 03 20:35:08 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The August jobs report was quite disappointing, missing expectations of jobs created last month by nearly 500,000. https://t.co/exZzRTY6H5","date":"Fri Sep 03 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden has failed and left Americans in Afghanistan. Biden ought to resign. This failure cost American lives &amp; will be felt for years if the Taliban &amp; other terrorist organizations continue to metastasize in the region. Read my full statement. https://t.co/fP0UguPhj1","date":"Fri Sep 03 14:30:10 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"A Biden official estimates a “majority” of Afghan allies who applied for special immigrant visas were left behind, along with over a hundred Americans. Unacceptable. \nhttps://t.co/TCCtp57Nvl","date":"Thu Sep 02 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Small biz across #PA11 are having a hard time finding employees to fill jobs. The last thing they need is Pres. Biden’s proposed tax hikes and increased red tape, both of which make it harder to keep their doors open.  https://t.co/BMYujZJLHG","date":"Thu Sep 02 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - Biden lied and left hundreds of Americans behind in Afghanistan, along with countless Afghan allies. This is unconscionable. https://t.co/4NZGVuum0w","date":"Tue Aug 31 16:03:11 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - Biden said nearly two weeks ago: “if there's American citizens left, we're gonna stay to get them all out.” https://t.co/vqpGBTTMNf","date":"Tue Aug 31 16:03:10 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The American people deserve to know how and why the Biden administration armed the Taliban with potentially tens of billions of dollars in taxpayer-funded military equipment through their disastrously mismanaged withdrawal. This is disgraceful. https://t.co/GXdzukUuDG","date":"Mon Aug 30 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"May God give comfort to the families who grieve the loss of these 13 heroes who selflessly served our nation in the armed forces. https://t.co/52L7S23eUt","date":"Mon Aug 30 17:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"@RepStefanik Congratulations!","date":"Mon Aug 30 16:28:16 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Unbelievable absence of leadership from this administration.","date":"Sun Aug 29 21:14:35 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"As we learn the details of the service members killed and injured by a suicide bomber in Kabul, the American people deserve to hear from President Biden on how he will adjust his withdrawal plans to protect the Americans and allies still in Afghanistan.","date":"Thu Aug 26 19:47:53 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"We must continue to pray for the safety of our service members, citizens, and Afghan allies.","date":"Thu Aug 26 15:00:08 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday, I joined members of the @RepublicanStudy in speaking out against the reckless budget presented by Pres. Biden, Speaker Pelosi, and Sen. Sanders which will #BuildBackBankrupt and add $17 trillion to our debt. https://t.co/bdbJi8zfXV","date":"Wed Aug 25 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet at Bank of Bird-in-Hand earlier this week, for a roundtable discussion with members of the Pennsylvania Association of Community Bankers to discuss federal legislative and regulatory issues impacting our local banks. https://t.co/qM5P1xB0Uh","date":"Wed Aug 25 18:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This $3.5 trillion socialist budget is an insult to the taxpayers, makes a mockery of Congress, and will recklessly plunge our nation further into debt. Read my statement: https://t.co/QlTa39l4K6","date":"Tue Aug 24 21:50:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to the Lancaster Airport for receiving nearly $4 million in grant funding, which will help them continue to provide excellent service to our community. https://t.co/rcUmgJEd9P https://t.co/rRmfrrQqOp","date":"Mon Aug 23 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s inflation continues to hit working-class Americans' wallets. https://t.co/QN9v8zYgJX","date":"Mon Aug 23 13:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to help with any issues you may be experiencing with federal agencies. Learn more. https://t.co/xJbI88uRax","date":"Sun Aug 22 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There are a record 10 million jobs available and more jobs available than those who are looking for work. Congress should pass pro-growth policies to help get folks back into the workforce, not Pres. Biden’s policies to increase government dependence. https://t.co/e38CPb6H5g","date":"Sat Aug 21 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The atrocities we are seeing in Afghanistan could have been avoided. Read my statement. https://t.co/6QPZjmEP7N","date":"Fri Aug 20 15:04:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - For more information on military academy nominations visit - https://t.co/0jdDjvHlwb","date":"Wed Aug 18 19:18:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - Congratulations to Hempfield graduate, Joe Mannion, pictured here receiving his Class of 2022 ring with the Superintendent of the U.S. Merchant Marine Academy. It was an honor to nominate him to this service academy. Keep up the great work! https://t.co/bNbPPNzHoW","date":"Wed Aug 18 19:18:46 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"To any veteran, there is always support available at the Veterans Crisis Line. Call 1-800-273-8255 and Press 1 or text 838255. More information is available here: https://t.co/NiQv400Jmt","date":"Tue Aug 17 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I want to congratulate and thank the dedicated staff of the Lebanon VA Medical Center, who were named the top VA Medical Center for patient experience during the past year. Thank you for taking such exceptional care of veterans in #PA11 @VALebanon","date":"Tue Aug 17 18:45:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Heartbroken about Paul Mitchell’s passing. He was a dear friend and a great man. He served in Congress with integrity, fiercely advocating for his constituents for all the right reasons. Cindy and I extend our deepest sympathies to Sherry and the family.","date":"Tue Aug 17 01:49:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my statement on the situation in Afghanistan. https://t.co/TB72ZTQoOY","date":"Mon Aug 16 18:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Hanover is a special place. I appreciated joining Mayor SueAnn Whitman, members of Borough Council and representatives of the Hanover Public School District for a roundtable discussion on issues facing our community. https://t.co/4xRnmXn8G5","date":"Fri Aug 13 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciated joining the Kutztown &amp; Shippensburg University Small Business Development Centers and #PA11 small business owners to hear their experiences throughout the COVID-19 pandemic. I was humbled to be named a PASDBC Legislative Champion for my efforts to support small biz. https://t.co/IiiNv8Ekvh","date":"Thu Aug 12 14:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Hanover is a vibrant community. It was great to visit and learn more about great small businesses that make Hanover such a special place. https://t.co/UQw3558fj4","date":"Wed Aug 11 18:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There’s a great community spirit at the Markets at Hanover which features 40 locally owned vendors. Thanks for the tour! https://t.co/0jCWVZ9w8a","date":"Tue Aug 10 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join State Rep. Kate Klunk to provide a Washington update for members of the Hanover Chamber of Commerce. https://t.co/o7ZVcQ7wqR","date":"Mon Aug 09 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"We must always give thanks to and recognize the sacrifice of those who selflessly served in the armed forces, especially recipients of the Purple Heart. https://t.co/SJ7FRPdzI9","date":"Sat Aug 07 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC to discuss what I’ve learned from speaking with and visiting #PA11 small businesses and the latest eviction moratorium from the Biden administration. https://t.co/NPUGLArWMj","date":"Sat Aug 07 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"York County has a strong manufacturing industry and history. It was great to see some of that history at Donsco, a family-run foundry in Wrightsville, which was founded in 1906 and now employs 350 individuals. https://t.co/Ls0bcY6iFC","date":"Fri Aug 06 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy birthday and thanks for 231 years of defending our nation @USCG!","date":"Wed Aug 04 18:29:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit H&amp;H Castings in Hellam Township, a full service aluminum foundry which has roots in east York dating back to its founding in 1965! https://t.co/jkcY0Sw8RU","date":"Tue Aug 03 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to join @RepKevinBrady and my @WaysandMeansGOP colleagues in asking President Biden to get to work negotiating trade promotion authority, to help create American jobs through new robust trade agreements with global partners. https://t.co/9P5QAV2Hmq","date":"Tue Aug 03 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter for updates from Washington! https://t.co/cQLPpR2rk8","date":"Mon Aug 02 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is bad news for working class Americans. https://t.co/Q3lTU0ZKGb","date":"Mon Aug 02 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to sign up for my e-newsletter for the latest news on what is happening in the district and Washington, DC!  https://t.co/Bi079ZLVy3","date":"Sun Aug 01 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss what Congress should do to address rampant unemployment fraud and my continued efforts to defend the unborn. https://t.co/U5jQKuj3tX","date":"Sat Jul 31 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden wants to build back bankrupt. https://t.co/FdlvGPe89O","date":"Fri Jul 30 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I was proud to join @GOPLeader and over 140 of my colleagues in standing up for freedom for the Cuban people and an end to the brutal communist regime. https://t.co/u2VrMgnrpf","date":"Fri Jul 30 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I will continue to fight against President Biden and Speaker Pelosi’s uncontrollable appetite for higher spending and taxes. Read more about my votes against bloated and reckless spending bills. https://t.co/qz8SdK1ITg","date":"Thu Jul 29 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations Hali on your second Bronze Medal! Our community and nation are proud of your achievements! 🥉🥉🏊‍♀️🇺🇸 https://t.co/PmtE0NevmP","date":"Thu Jul 29 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our nation must get back on the path to fiscal responsibility. Any discussions regarding the debt limit must include meaningful policies to rein in reckless spending. https://t.co/4PiByj3Rit","date":"Wed Jul 28 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2- Biden’s spending is dramatically increasing inflation, our deficit and the national debt.","date":"Wed Jul 28 20:15:49 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2- Pres. Biden’s tax &amp; spend agenda is an insult to the American taxpayer. There is over $1 trillion in COVID funding yet to be spent, but Biden wants to hike YOUR TAXES to raise TRILLIONS MORE &amp; spend it on growing his socialist federal bureaucracy. https://t.co/aYgp2z1MC0","date":"Wed Jul 28 20:15:49 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Unemployment fraud is a national nightmare. Congress must pass @RepKevinBrady's Combatting COVID Unemployment Fraud Act to combat this unprecedented theft of taxpayer dollars.  @WaysandMeansGOP \nhttps://t.co/MDkX2O0rkI","date":"Wed Jul 28 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Life is a precious gift, and we must do all that we can do ensure that we will defend the unborn. Congress must keep the Hyde Amendment and pass H.R. 18 the No Taxpayer Funding for Abortion Act. #HydeSavesLives https://t.co/vGcaJPP2VH","date":"Tue Jul 27 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenflation is taxation on working-class Americans. https://t.co/UWQJ1m7EhR","date":"Tue Jul 27 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There have been over 900k encountered crossings at the southern border in 2021, but President Biden has still wasted over $2 billion by suspending construction of a wall along our southern border. Biden is failing to address the crisis of his own making.  https://t.co/gR7icB9As3","date":"Mon Jul 26 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to Olympian &amp; #PA-11 native Hali Flickinger for earning a Bronze Medal in the 400-meter individual medley this weekend in Tokyo!  🥉 🏊‍♀️ 🇺🇸https://t.co/MAIYZbhTqP","date":"Mon Jul 26 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Need help with a federal agency? Contact my office. We may be able to help! https://t.co/xJbI88Ms25","date":"Sun Jul 25 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“Thirty-four percent of those caught crossing the border illegally in June had tried to enter the United States at least once before in the past year, officials said.” When is the Biden administration going to get control of our southern border? https://t.co/ZWwevWCl9j","date":"Sat Jul 24 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"In his 26 years, Anthony Cazillo made a big impact in the lives he touched and in the community in which he lived as a local elected official in Lancaster County. My prayers are with those who grieve the passing of such an outstanding young man. https://t.co/OjNCpnEinq","date":"Fri Jul 23 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget will drive America $17 trillion more in debt, with spending levels that will continue to fuel inflation. https://t.co/wK6XmQGc5J","date":"Fri Jul 23 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"99 percent of farms in #PA11 are family-owned. The Biden administration’s proposed tax changes like ending “stepped-up basis” would tax family farms out of existence. https://t.co/ekCHL8rbqC","date":"Fri Jul 23 14:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Best wishes and good luck to our #PA11 residents who are competing in the Olympics! \n- Casey Kaufhold – Archery \n- Hali Flickinger – Swimming \n-John Stefanowicz – Wrestling","date":"Thu Jul 22 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to @UtzSnacks on your 100-year anniversary. The company still proudly calls Hanover, PA, home and employs 1,800 individuals in PA. They produced 50 pounds of chips per hour in 1921 but now produces 5.5 million pounds of great snacks a week! https://t.co/O2sMsLtCPb","date":"Thu Jul 22 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Groceries are more expensive because of Biden’s middle-class inflation tax. https://t.co/iYCS3X36o9","date":"Thu Jul 22 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congress needs to help get Americans back to work. My Improving Access to Child Care Act will do that by providing states a dedicated funding stream to support child care programs by reforming a current but ineffective federal program. Learn more:  https://t.co/wZqf2wDjSD","date":"Wed Jul 21 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to work with @RepCarbajal on the reintroduction of the bipartisan Home For The Brave Act, which will ensure disabled veterans are able to access affordable housing programs. Learn more⬇️https://t.co/YLhPNb83yy","date":"Tue Jul 20 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The middle-class is feeling the pinch of Biden’s rising inflation tax. https://t.co/nJ4edtSqjK","date":"Tue Jul 20 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter! https://t.co/Ojj1HAxkZC","date":"Tue Jul 20 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Border crossings last month reached a 21-year high. When is the Biden administration going to admit their policies are causing this crisis and get control of the border? https://t.co/yllTpj1FZw","date":"Mon Jul 19 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you subscribed to my e-newsletter? Be sure to sign up to keep up-to-date on the latest happenings in Washington and around the district! https://t.co/Bi079Zuk9t","date":"Sun Jul 18 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week on WDAC, I discussed the thirteen year high inflation rate and three #PA11 residents who are representing the USA in the upcoming Olympics. Listen in! https://t.co/TF1Ox67Tfl","date":"Sat Jul 17 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join the community in celebrating the @lshspioneers @Softball_LS team’s state championship win last evening! Congratulations again on your outstanding achievement! https://t.co/WfLTASRkN5","date":"Fri Jul 16 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s tax hikes will spare no one. Studies show middle class American families and small businesses will bear the brunt of Biden’s disastrous tax proposals. https://t.co/gVzkXG03To","date":"Thu Jul 15 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Since 1976, Congress has agreed tax dollars should not fund abortions. We must keep this important pro-life protection in place. #HydeSavesLives https://t.co/wngH8wAqjU","date":"Thu Jul 15 19:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s disastrous tax and spend policies will continue to drive up inflation, making home ownership less and less affordable. Listen to my comments below ⬇️ https://t.co/IKEaAghs7x","date":"Thu Jul 15 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2- More on my USA Workforce Tax Credit Act here: https://t.co/9Qdj5ZWKrC","date":"Wed Jul 14 19:16:21 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - You see it in Lancaster, York &amp; across the country. Small biz can’t find employees. We need pro-worker policies like my USA Workforce Tax Credit &amp; to end Biden’s insulting handouts. The American people want opportunity, not a social welfare state. https://t.co/zUJcgH63qG","date":"Wed Jul 14 19:16:20 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation is up to a 13 year high and that means your money isn’t going as far as it used to. This is President Biden’s economy! https://t.co/u42MncMz8z","date":"Wed Jul 14 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit the newly renovated Columbia Market House with Lancaster County Commissioners @CommissionerJP &amp; @CommissionerRD, as well as Columbia Borough Council President Heather Zink, Police Chief Jack Brommer and Borough Manager Mark Stivers. https://t.co/JrZIEgdbhx","date":"Tue Jul 13 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"A key inflation measure is up 5.4%--the highest rate in 13 years. Biden’s inflation is a tax on the working class. https://t.co/evyEMr7UwO","date":"Tue Jul 13 15:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Economists say Biden's middle-class inflation tax here to stay. https://t.co/Xs0Ah64Xdy","date":"Mon Jul 12 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"America must stand with those seeking freedom and an end to this brutal Communist regime. https://t.co/u31hd6iXj9","date":"Mon Jul 12 16:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have an issue with a federal department of agency? Contact my office, we may be able to help! https://t.co/xJbI88Ms25","date":"Sun Jul 11 18:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss my USA Workforce Tax Credit Act and my efforts to protect the unborn by saving the Hyde Amendment. https://t.co/c7MBieBjoS","date":"Sat Jul 10 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: My USA Workforce Tax Credit Act will spur investment in apprenticeship and career &amp; technical education programs. 9.2 million jobs are available nationwide so we must help Americans upskill, re-skill, and be ready for in-demand, high paying jobs. https://t.co/9Qdj5ZF932","date":"Fri Jul 09 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s inflation tax continues to squeeze hard-working Americans. https://t.co/VgD4DQgX6G","date":"Fri Jul 09 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit third-generation trailer manufacturer @MHEbyInc in Blue Ball to learn about the impact of labor shortages, trade and infrastructure policy have on their business. https://t.co/yaWf02sxAV","date":"Thu Jul 08 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies are dictated by the radical left's tax and spend agenda. Middle-class tax hikes are wrong. https://t.co/iZzqyFlpK4","date":"Thu Jul 08 18:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"With a record 9.2 million jobs available, Congress should pass my USA Workforce Tax Credit Act to help build a stronger workforce by encouraging investment in apprenticeship programs and career and technical programs. Learn more ⬇\nhttps://t.co/9Qdj5ZWKrC","date":"Wed Jul 07 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"A record 9.2 million jobs remain available because the Biden administration continues to making hiring difficult by threatening tax hikes and other harmful policies. \nhttps://t.co/W5McFfS4So","date":"Wed Jul 07 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to join so many of my colleagues in standing up for the right to life and protect the unborn. #SaveHyde https://t.co/wf7EM6LQnh","date":"Tue Jul 06 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter. https://t.co/Xr3yZODlap","date":"Tue Jul 06 14:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"God Bless America 🇺🇸 https://t.co/NdfA6vpNN0","date":"Sun Jul 04 13:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss an infrastructure spending proposal and July 4th. https://t.co/oDXwAlzRoh","date":"Sat Jul 03 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Learn more about my legislation to make electric car owners pay their fair share. https://t.co/L1e44WdDZH","date":"Fri Jul 02 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Disappointing jobs reports, falling wages, and rising inflation: this President Biden’s economy. https://t.co/s7IxSsXMEN","date":"Thu Jul 01 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Speaker Pelosi’s “My Way or the Highway” legislation is laden with unpaid Green New Deal priorities. This deficit-financed bill will only worsen inflation and doesn’t prioritize the long-term health of our nation’s infrastructure. https://t.co/gw271jJjk3","date":"Thu Jul 01 19:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is the first anniversary of the USMCA going into effect. The farmers and manufacturers of #PA11 will continue to benefit from USMCA for years to come. My remarks from last year ⬇ https://t.co/6MeyttORMv","date":"Thu Jul 01 17:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The cost of higher education has skyrocketed. House Republicans support policies that will increase positive student outcomes and control costs. Listen to my comments below https://t.co/U7BUbstn2d","date":"Wed Jun 30 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"At a time when American farmers need our assistance &amp; appreciation, Pres. Biden wants to tax family-farms out of existence. This would devastate #PA11’s strong agricultural community &amp; heritage. Read this recap of yesterday’s @WaysandMeansGOP meeting.  \nhttps://t.co/hE6zNW0hWR","date":"Wed Jun 30 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"99% of farms in #PA11 family-owned and operated, many are multi-generational but the Biden administration wants to tax them out of existence when the business moves from one generation to the next. Watch my comments ⬇️ https://t.co/6QS0OCYPxB","date":"Tue Jun 29 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I was proud to honor the @LSPioneers High School Softball team for their PIAA 5A Championship on the House floor. On behalf of #PA11 congratulations on your victory! https://t.co/V2uobIwPaE","date":"Tue Jun 29 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"158 years ago today, the Columbia-Wrightsville Bridge across the Susquehanna River was set aflame, preventing the Confederate Army’s invasion of Lancaster County. Learn more \n⬇️\nhttps://t.co/mzzWAJeBUf","date":"Mon Jun 28 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have you read the latest edition of my e-newsletter?\nhttps://t.co/gZq8IkC4Ia","date":"Mon Jun 28 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"June is Alzheimer’s and Brain Awareness Month. As a proud member of the bipartisan Congressional Task Force on Alzheimer’s disease I am proud to fight for legislation to help cure and prevent Alzheimer’s. https://t.co/Y96t7BDfx7","date":"Sun Jun 27 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our district is home to many confectioners. We are proud of the delicious candy that is produced right here in #PA11. During National Candy Month, enjoy a sweet treat! https://t.co/YdXIJDEzFd","date":"Sun Jun 27 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss my new legislation, the USER FEE Act. https://t.co/ZINpoEJryC","date":"Sat Jun 26 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? Sign up to stay connected with my activities. https://t.co/Bi079ZLVy3","date":"Sat Jun 26 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: Electric car owners do not contribute to the Highway Trust Fund, so I introduced a bill to fix this inequity and responsibly fund road maintenance. All car owners should pay for the roads they drive on. https://t.co/2ASy4FFIzE","date":"Fri Jun 25 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies are hurting the middle-class, plain and simple. Inflation is the highest it has been in 13 years. https://t.co/m3Q0mIQrPS","date":"Fri Jun 25 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The VP announced she will finally visit the border. Will it be a photo-op or will the administration realize the error of their ways and reverse course to end their open border policies? Watch my comments from the House Budget Committee. https://t.co/uud9EZlguM","date":"Thu Jun 24 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today at a House Budget Committee hearing I asked @SecFudge if the Biden admin is concerned with the alarming rate of inflation driving up the cost of homes and how they will work to rein in duplicative and inefficient programs. https://t.co/qQwQ7HUtGV","date":"Wed Jun 23 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Joe Biden lied – he plans to repeal the Hyde Amendment and use tax dollars for abortion. It’s shameful. I will fight for the unborn! https://t.co/SOcvccQgwc","date":"Wed Jun 23 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Proud to support this important trade legislation led by @RepKevinBrady, @VernBuchanan, and my colleagues on @WaysandMeansGOP.","date":"Wed Jun 23 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Number of illegal crossings reported by CBP:\n\nMarch- 173,337\nApril- 178,854\nMay- 180,034 \n\nDays it took @VP to announce a visit: 91 https://t.co/PU3dk4dR9K","date":"Wed Jun 23 18:43:58 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Remember when they said the $$$$ was for COVID relief? Maybe next time don’t defund the police.🤷‍♂️\n\nhttps://t.co/Zatdhpbl83","date":"Wed Jun 23 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Electric vehicles currently pay nothing towards road maintenance. My bill would ask them to help maintain the roads they drive on. Learn more about the USER Fee Act ⬇️ https://t.co/2ASy4FFIzE","date":"Wed Jun 23 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"🐄 June is #NationalDairyMonth! It’s an honor to fight for policies supporting #PA11’s farmers in Congress. 🐄 https://t.co/TB0DsSnQU5","date":"Tue Jun 22 17:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with Patrick, a Boy Scout from Lancaster, as he works towards achieving the rank of Eagle Scout. Best of luck in your continued efforts! https://t.co/w6nK9a9zNm","date":"Mon Jun 21 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"We must always stand up for life and fight for the unborn. Mr. President, a 15-week-old is a precious life!","date":"Mon Jun 21 19:53:24 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s plan to #buildbackbankrupt is negatively affecting all Americans.","date":"Mon Jun 21 16:06:55 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC to discuss what I learned from a recent meeting with local agriculture leaders and to honor everyone celebrating Father’s Day. https://t.co/S2WH5zzmtN","date":"Sun Jun 20 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Being a dad to three great children is the best job I’ve ever had, to all the fellow fathers in #PA11 I want to wish you a happy Father’s Day. https://t.co/ICzRGFsDe9","date":"Sun Jun 20 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week I supported legislation to make Juneteenth, which commemorates the end of slavery in the United States, a federal holiday. https://t.co/EZTyroz1cR","date":"Sat Jun 19 13:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden talks about budgets demonstrating values. Apparently, President Biden doesn’t value securing our southern border to stop the humanitarian and national security crisis of his own making. https://t.co/ynUvsb9fcq","date":"Fri Jun 18 16:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden budget will raise taxes on middle-income families – even though they refuse to admit it. I asked @SecYellen about Biden’s plan to raise taxes on the middle-class and build back bankrupt. https://t.co/Yh97IcnhKt","date":"Thu Jun 17 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Best wishes for a full and speedy recovery @GovRidge.","date":"Wed Jun 16 21:02:39 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined 140 members in standing up for our Second Amendment rights.","date":"Wed Jun 16 19:53:21 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Biden’s budget proposal = middle-class tax hikes, more inflation, more debt and less money in your pocket. Watch my floor remarks ⬇️ https://t.co/ycr36mEt48","date":"Wed Jun 16 18:30:05 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On Monday, I met with members of the Lancaster County Farm Bureau and Lancaster Farmland Trust to discuss trade and other important issues impacting our agricultural industry. https://t.co/WUD4aROuD6","date":"Tue Jun 15 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday, I toured @WellSpan’s York County Community Vaccination Site with York County President Commissioner Julie Wheeler. This site alone has administered 30,000 doses of vaccine. Thank you for your leadership and continued efforts. https://t.co/y3thTcD77F","date":"Tue Jun 15 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies are causing inflation and resulting in a middle-class tax hike. https://t.co/ygDOrQ3ukv","date":"Tue Jun 15 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"#Bidenflation=middle-class tax hike","date":"Tue Jun 15 16:41:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter. https://t.co/JkMryp4P15","date":"Mon Jun 14 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our country is in crisis: “With increased costs and a labor crisis created by Democrat policies that pay Americans more money to stay home than work, small businesses have emerged from the pandemic facing new existential threats.” Read more from @GOPLeader https://t.co/YSiHZE4xJX","date":"Mon Jun 14 17:34:37 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you to the dedicated men and women of @USArmy for defending our nation since 1775. We are all grateful for your service. Thank you and Happy birthday! #ArmyBDay https://t.co/3ri80Ibl7O","date":"Mon Jun 14 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On June 14th we come together as a country to honor the flag that is an international symbol for freedom and democracy. The red, white, and blue unites all Americans! God Bless America and Happy Flag Day! https://t.co/YLhGaaRJ0R","date":"Mon Jun 14 14:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The @NFIB released its’ May Small Business Optimism index and nearly half of small businesses are struggling to fill jobs. President Biden’s policies are directly harming our community’s small businesses. https://t.co/e3aAyvPEuE","date":"Sun Jun 13 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? Be sure to stay up to date on my activities to serve you. https://t.co/Bi079Zuk9t","date":"Sun Jun 13 13:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Illegal border crossings continue to increase under the failed leadership of the Biden-Harris Administration. They have done nothing to solve this humanitarian and national security crisis. https://t.co/NXPpGxWCGT","date":"Sat Jun 12 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss President Biden’s foreign trip and his bloated budget. https://t.co/3VVLC73hsa","date":"Sat Jun 12 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Half of pandemic unemployment payments - approximately $400 billion – were likely fraudulent. Why did Ways &amp; Means Democrats block @WaysandMeansGOP efforts to include fraud protection measures to prevent this from happening? This is an absolute disgrace.","date":"Fri Jun 11 21:00:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to attend the ribbon cutting of the new training and development center, the Pulisic Stomping Grounds, at the PA Classics Soccer Park in Lancaster. Thank you to south central #PA native @cpulisic_10 for making this happen! https://t.co/ECsIZe17EO","date":"Fri Jun 11 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I asked the @IRSnews about the criminal penalties for the egregious and politically motivated leak of stolen taxpayer information and what they intend to do about it. Leaking taxpayer information is a crime. This cannot continue to happen time and time again. My questions ⬇️ https://t.co/X5PbDBuAtS","date":"Fri Jun 11 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Inflation continues to grow - prices are up 5% from this time 1 year ago - but Pres. Biden is focused on middle-class tax hikes and plunging our nation further into debt with his reckless spending. https://t.co/oP3VeAltzH","date":"Thu Jun 10 14:24:12 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to the four @sg_nasa_sl for making it into the top 100 teams in the USA. We are proud &amp; good luck at the TARC Nationals! I visited with the @SGSchoolNews Rocketry team in 2019 to learn about the great work they are doing applying STEM lessons to rocketry! 🚀 https://t.co/wMWcTMUyiv","date":"Thu Jun 10 13:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today, I asked Acting OMB Director Young if she’s concerned about current inflation which is the fastest growing in four decades. Biden’s reckless tax-borrow-and-spend budget is wrong for America. https://t.co/HxC2rjCyKZ","date":"Wed Jun 09 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"When will the Biden administration take the growing debt seriously? Biden’s bloated budget will add $17 trillion to our national debt over the next decade. #BuildBackBankrupt https://t.co/0PuY0vV4SQ","date":"Wed Jun 09 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today, I’m joining @housebudgetGOP colleagues to get to the bottom of President Biden's disaster of a budget proposal. Under his plan, America would see the worst economic growth of any decade since the Great Depression. American families deserve better than this.","date":"Wed Jun 09 13:28:50 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The United States of America is not a terrorist organization. Period. Hamas and the Taliban are terrorist organizations who have murdered thousands. The difference couldn’t be any clearer. Will @SpeakerPelosi and @HouseDemocrats condemn this?","date":"Tue Jun 08 22:17:46 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There are 9.3 million job openings across the country and Pres. Biden is still paying people to stay home. Biden’s economic policies are killing small businesses who can’t find workers and killing our economic recovery from the pandemic. https://t.co/AxiAG5VZmk","date":"Tue Jun 08 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“No quick fix?” It has been 76 days since @VP was appointed to regain control of the southern border. It is time for action, not equivocation. @VP needs to visit the border now! #BidenBorderCrisis\nhttps://t.co/d5xdl9pGjq","date":"Tue Jun 08 14:51:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter. https://t.co/lEnc9npO5w","date":"Mon Jun 07 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss how my office can assist you. https://t.co/THr447hPDW","date":"Sun Jun 06 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? https://t.co/Bi079ZLVy3","date":"Sat Jun 05 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies have led to yet another lackluster jobs report.  We need pro-growth policies to get Americans back to work, not Biden’s plan of growing dependence on a rapidly expanding federal government.\nhttps://t.co/LxpjnPeooF","date":"Fri Jun 04 21:07:22 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"9/9- I joined the Red Lion Business Association at Terrapin Station to meet with community members and business owners. #AroundPA11 https://t.co/o4v06Ujos5","date":"Fri Jun 04 19:05:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"8/9- Retro Splat! owner Austin spoke with me about how he adapted to the pandemic by adding online ordering. We also discussed how the improvements to downtown Red Lion have helped businesses in the area. #AroundPA11 https://t.co/w5UMOmw33N","date":"Fri Jun 04 19:05:53 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"7/9- I visited Groff North America, a producer of hemp products, at their newly renovated facility. #AroundPA11 https://t.co/OQn0dvWW0q","date":"Fri Jun 04 19:05:50 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"6/9- Sugar Rose Bake Shop has been making homemade baked goods and they have been working hard to grow the business. #AroundPA11 https://t.co/y5SthMuc0R","date":"Fri Jun 04 19:05:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"5/9- I met with Red Lion Borough Council President Tony Musso at his restaurant, Musso’s Pizza, to talk about the challenges restaurants have faced and how resilient Red Lion was throughout the COVID-19 pandemic. #AroundPA11 https://t.co/nCIuZyXKM7","date":"Fri Jun 04 19:05:44 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"4/9- Lion Pharmacy has helped distribute the COVID-19 vaccine to members of the #PA11 community. #AroundPA11 https://t.co/VQyyUuXJq4","date":"Fri Jun 04 19:05:42 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/9- I visited Candi Duda Stained Glass in Red Lion. #AroundPA11 https://t.co/69SsW0yUXB","date":"Fri Jun 04 19:05:39 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/9- I visited with the owners of Stable Hollow Construction in Manheim to see firsthand how they are handling labor shortages and the effects that expanded unemployment benefits are having on their business. #AroundPA11 https://t.co/lngrrQbEMJ","date":"Fri Jun 04 19:05:36 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/9- Our small businesses and community organizations had to deal with new challenges throughout 2020. This week I had the great opportunity to visit with and speak with folks across #PA11.","date":"Fri Jun 04 19:05:34 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I recently spoke on the House floor to honor community leader, veteran, &amp; vocal advocate, Frank Fryburg who passed away last month. We wish those who are grieving comfort &amp; give thanks for the opportunity to know Frank who positively impacted so many people during his 94 years. https://t.co/nb1fYetaHg","date":"Thu Jun 03 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I visited Compassus in Lancaster to learn more about the impact of federal policy on palliative, hospice and long-term care has on our communities. https://t.co/c53aoe2uDC","date":"Wed Jun 02 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to visit the Brickerville House Family Restaurant to learn how their business was impacted by the COVID-19 pandemic and how they adapted to Gov. Wolf’s challenging mandates. https://t.co/KSryttujJN","date":"Wed Jun 02 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my @HouseGOP colleagues in calling on Speaker Pelosi to allow the House to investigate the origins of COVID-19.","date":"Wed Jun 02 13:53:37 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: I joined @FoxBusiness on Friday to discuss President Biden’s massive, reckless $6 trillion budget and how he’s going to raise taxes on middle-class Americans. https://t.co/rIMvsuqNXe","date":"Tue Jun 01 15:56:47 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join the York County Veterans Outreach’s Memorial Day Car Show! https://t.co/4Odh3kDgmY","date":"Mon May 31 18:24:14 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"While we gather this weekend, let us give thanks for those who gave it all in service to our nation, preserving the freedoms and opportunities that we are blessed to enjoy. https://t.co/74lvpgt68k","date":"Mon May 31 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Vietnam Veterans of America Chapter 1008 held a moving ceremony in Lancaster today, honoring those who made the ultimate sacrifice as members of the United States Armed Forces. https://t.co/TIQyZwT2II","date":"Sun May 30 18:08:50 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you are having an issue with a federal agency my office is here to assist. https://t.co/xJbI88uRax","date":"Sun May 30 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I spoke with WDAC Radio to discuss the need to stop unemployment fraud and to remember and honor those who made the ultimate sacrifice defending our nation. https://t.co/N2abzmyyS2","date":"Sat May 29 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was an honor to join Lancaster AmVets Post 19 in placing flags on the headstones of veterans in honor of Memorial Day. https://t.co/ApREvmQGg0","date":"Sat May 29 15:12:45 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"As you travel for the long weekend be sure to thank President Biden for the growing inflation. Check out the rise in gas prices from AAA. https://t.co/o83QVN3IOP","date":"Fri May 28 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking forward to joining @FoxBusiness Tonight at 5:00p.m. be sure to tune in! 📺","date":"Fri May 28 20:43:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congressional Democrats want endless spending &amp; to have Washington control childcare. Republicans want parents in the driver’s seat by ensuring dollars are being directed towards creating self-sustaining childcare programs. My comments from yesterday’s Ways and Means hearing ⬇ https://t.co/Vp3bavBbD6","date":"Fri May 28 14:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden is putting Russians first and Americans second. https://t.co/TF3ZvsvDhX","date":"Thu May 27 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Bidenomics is costing all Americans.","date":"Thu May 27 16:50:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It is important to make sure we all take care of our mental health. \n \nImportant Phone Numbers: \nNational Suicide Prevention Lifeline: 1-800-273-TALK (8255)\n\nSAMHSA’s National Helpline: \n1-800-662-HELP (4357)\n\nVeterans Crisis Line: 1-800-273-TALK (8255), Press 1 https://t.co/2Ns5uY3JUV","date":"Wed May 26 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It’s long past due for President Biden to answer for his disorder at the border. #WhereIsHarris?","date":"Wed May 26 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you to @ManheimTownship students for honoring those who made the ultimate sacrifice in service to our nation. We will always remember and honor those on Memorial Day.","date":"Wed May 26 16:39:36 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The USMCA is a big win for #PA11 dairy farmers by opening new markets—but only if Canada upholds their part of the agreement. I applaud @USTradeRep @AmbassadorTai for taking steps to support our dairy farmers by holding Canada to account. https://t.co/W03fs29V95","date":"Tue May 25 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"When will the Biden Administration take the humanitarian and national security crisis at our southern border seriously? https://t.co/Co1TGqFq03","date":"Tue May 25 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Those traveling for Memorial Day will pay the highest gas prices since 2014 thanks to President Biden’s disastrous policies. #Demflation https://t.co/LlTNR7UPc5","date":"Tue May 25 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s economic policies are causing inflation. We must reverse his reckless spending and tax agenda, our middle class does not deserve to feel the financial squeeze of Bidenomics. https://t.co/x38OvfrxqR","date":"Mon May 24 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you need help with a federal agency my office can assist. https://t.co/xJbI88Ms25","date":"Sun May 23 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? https://t.co/Bi079Zuk9t","date":"Sat May 22 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This has been a challenging year for the Class of 2021. Congratulations on your graduation. You should all be proud of your accomplishments. https://t.co/kR1KoUqED3","date":"Fri May 21 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I will always stand with our ally Israel and its right to defend itself. I hope that the recently agreed to ceasefire will be lasting. 🇺🇸🇮🇱","date":"Fri May 21 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden helps Vladimir Putin’s pipeline but cancels American pipelines like the Keystone XL. https://t.co/7uKz709v8c","date":"Thu May 20 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrats love to lecture about “following the science” but let the teachers' union write the rules on school reopening. https://t.co/Yat99Op3V5","date":"Thu May 20 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On #NationalEMSWeek we honor and celebrate the brave EMS workers that are often first on the scene to provide care. Thank you for your service! https://t.co/qWgEAD1icz","date":"Thu May 20 16:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Why don’t Dems understand how Pres Biden’s tax proposals will hurt middle-class families? We know what works—#TCJA increased median household income by $5,000, spurred investment &amp; job creation in my district &amp; across the nation. My comments from today’s Ways &amp; Means hearing ⬇ https://t.co/SJ46IMfiBW","date":"Wed May 19 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The winner of the 2021 Art Competition is Ryan from Elizabethtown High School. Ryan’s piece is a Digital Art titled “Veterans Memorial Bridge (Columbia-Wrightsville Bridge).” I am excited to see his piece displayed in the United State Capitol Complex. https://t.co/l0fgqYc8Xi","date":"Wed May 19 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden needs to do more to help support our brave CBP officers. They are fighting drug and human traffickers and the Biden administration does not take the humanitarian crisis seriously. Where is @VP? https://t.co/iElpN0fl3j","date":"Wed May 19 19:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to join @SteveScalise &amp; @RepKevinBrady to discuss the benefits of #TCJA. I’ll bet on the American people over big government any day. https://t.co/2FEP090INd","date":"Wed May 19 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I was proud to co-sponsor Rep. Van Drew’s resolution condemning Hamas for its attacks on Israel. The United States will always stand with our ally Israel.","date":"Wed May 19 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s failure to secure the border has resulted in funds originally allocated for the emergency stockpile to be redirected to deal with the unaccompanied children crossing the border. https://t.co/BP9JWCDTCz","date":"Tue May 18 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Prices are rising on gas and other goods. President Biden cannot continue his economic policies that will increase inflation.","date":"Tue May 18 16:47:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden wants to spend trillions more this year, even as the deficit is nearly $2 trillion. Washington needs to get its fiscal house in order and stop Biden’s wish list spending spree before we saddle future generations with even more debt. https://t.co/YQKHzeZIdp","date":"Mon May 17 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"We must always support and #BacktheBlue.","date":"Mon May 17 18:54:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: today is the filing deadline for your 2020 federal taxes. https://t.co/ppUzecJHwk","date":"Mon May 17 17:34:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter. https://t.co/m6R7r4jKba","date":"Mon May 17 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Do you need help with a federal agency? My office is here to assist constituents with federal casework issues. https://t.co/xJbI88uRax","date":"Sun May 16 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure you are signed up to receive my e-newsletter. https://t.co/Bi079ZLVy3","date":"Sun May 16 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today, I celebrated the 75th anniversary of the New Holland VFW. This VFW post was named in honor of Charles Ludwig who died fighting in WWII. On Armed Forces Day we must honor all those in uniform. https://t.co/IT7YhaSZzJ","date":"Sat May 15 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss National Police Week and the need to help people get back to work. https://t.co/JNJuBlakQ2","date":"Sat May 15 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Armed Forces Day. While each day all Americans should honor those who wear the uniform to defend our freedoms we thank each service member a little extra today. \n\nThank you, for defending our freedoms and protecting the United States of America. https://t.co/QHkaPlZ7zS","date":"Sat May 15 14:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder: Monday, May 17th is the filing deadline for your 2020 federal taxes. https://t.co/bEuj8H4Ir7","date":"Fri May 14 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I appreciated the opportunity to speak with @USTradeRep @AmbassadorTai regarding how we are ensuring Canada’s dairy markets are open according to the guidelines of the #USMCA and my serious concerns regarding intellectual property waivers for the COVID-19 vaccine. https://t.co/ZAOF2qvfti","date":"Fri May 14 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Three years ago the United States opened our embassy in Jerusalem. \nNow more than ever we must stand with our ally Israel as they defend their nation from Hamas.🇺🇸🇮🇱","date":"Fri May 14 16:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Masks still required on the House Floor!? What kind of alternate universe is @SpeakerPelosi living in?https://t.co/FMmVGmxfVR","date":"Fri May 14 14:49:09 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On National #CharterSchoolsWeek, we thank the work of charter schools in our community and around the country for giving parents a choice in their child’s education.","date":"Fri May 14 13:46:46 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Operation Warp Speed harnessed the full force of the federal government and private business to help us reach this milestone. Thank you to the scientists and doctors who worked to help restore our way of life.","date":"Thu May 13 22:01:44 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Rep. Nunes is absolutely right: waivers to COVID-19 vaccine intellectual property will not immediately increase vaccine supply or put shots in arms. Biden is creating a dangerous precedent that will only benefit China. https://t.co/CMrCY9ofPR","date":"Thu May 13 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3- I want to thank all of the police officers in #PA11 and across the nation for their selfless service protecting our communities each day.","date":"Thu May 13 16:21:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3- Officer Tome served with the Northern York County Regional Police Department (NYCRPD) and was killed in the line of duty in 2008. \nLast October, I participated in a dedication ceremony for the NYCRPD who named their Spring Grove substation in Officer Tome’s honor. https://t.co/SUlWsD4JTI","date":"Thu May 13 16:21:33 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3- On #NationalPoliceWeek, I joined @GOPLeader for the Back the Blue Bike Tour with other GOP members and @CapitolPolice. We must never forget the sacrifice of those who have fallen while protecting our communities. I laid a wreath to honor #PA11 hero Officer David Tome. https://t.co/woibZ1a8xn","date":"Thu May 13 16:21:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our nation has 8.1 million jobs available but the Democrats would rather pay Americans more to stay home. We need pro-growth policies, not ones that build greater government dependence. \nhttps://t.co/sw8Jmm8DZq","date":"Wed May 12 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Helping to support foster children has been a priority of mine since coming to Congress. During today’s Ways and Means hearing, I asked how Congress can better support foster children, their educations, and careers. Listen to my comments below ⬇ https://t.co/FZjyEIfdvm","date":"Wed May 12 19:16:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden presidency = growing inflation, higher gas prices, border crisis, tax hikes and more. And we are only 4 months in! https://t.co/2TsY1eX00w","date":"Wed May 12 17:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden has done absolutely nothing to stop the humanitarian and national security crisis at our southern border. The @VP is absent and the crisis the administration created continues to grow.","date":"Wed May 12 15:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The terrible jobs report last week showed an unemployment rate INCREASED to 6.1%, missing expectations by nearly 1 million jobs. It is time to stop paying Americans more to stay at home, we need to get our nation working again. https://t.co/o1GTcnPyvR","date":"Tue May 11 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On #NationalPoliceWeek I am thankful for the brave men and women in blue that work every day to protect our communities. I also want to thank the brave @CapitolPolice who protect the U.S. Capitol. https://t.co/GA5pCgFDEQ","date":"Tue May 11 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our strong ally Israel has every right to defend itself from Hamas. America stands with Israel. https://t.co/lDUAg1peIs","date":"Tue May 11 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Speaker Pelosi and Pres. Biden sent your taxpayer money to “bailout” liberal states. Turns out Pelosi’s California didn't need the money to begin with—they have a $75 billion surplus. Why would we still send them $26 billion? This is simply irresponsible. https://t.co/6KxHpPzesT","date":"Tue May 11 15:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my E-newsletter. https://t.co/W3rrphBLVt","date":"Mon May 10 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Birthday Lancaster! Lancaster County was founded 292 years ago, I am honored each day to represent Lancaster in Congress. https://t.co/pr6twVl26u","date":"Mon May 10 16:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have you watched my Virtual Tour of the United States Capitol? https://t.co/vfrUe5z7el","date":"Sun May 09 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Mother’s Day to all the moms across Lancaster and southern York counties! https://t.co/bCDxcL16DG","date":"Sun May 09 13:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week, I joined WDAC Radio to discuss my latest legislation to support survivors of domestic abuse. Listen in! https://t.co/AMRem9BVdJ","date":"Sat May 08 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is the 76th Anniversary of V-E Day, marking our victory in the European theater of World War II. To those who served, thank you for fighting to preserve our freedoms. https://t.co/WoSZfMxAER","date":"Sat May 08 13:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined many of my PA colleagues in asking for needed funding to address the scourge of the spotted lanternfly, which could cause over $300 million in annual impact to PA’s economy. We have to put an end to this bug. https://t.co/oo6gtdgbG6","date":"Fri May 07 23:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"To all the spouses of service members in the United States Armed Forces, thank you for your sacrifices. https://t.co/GHHl5QDWnl","date":"Fri May 07 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to all of the nurses across #PA11 who have worked so hard to keep all of us healthy, we greatly appreciate all of your efforts! https://t.co/xxQJP8cxtG","date":"Fri May 07 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Many local employers simply cannot find people to fill available jobs. It turns out, when you pay people more to stay at home, they do not want to work. President Biden’s policies and proposed tax hikes are not the pro-growth solutions we need. https://t.co/9Y5j03gWas","date":"Fri May 07 16:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"High school art students from across #PA11 have submitted truly exceptional entries to the 2021 Congressional Art Competition. Check out this year’s entries below! https://t.co/J4Ge5Jyc2f","date":"Thu May 06 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today on National Day of Prayer may we all join in praying for our nation, for good health, and for one another. May God continue to bless the United States of America. https://t.co/ZsOECgeADD","date":"Thu May 06 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my full statement regarding the Ways and Means Committee advancement of the Securing a Strong Retirement Act of 2021, which included the provisions of my SAFER Act to support survivors of domestic abuse.\nhttps://t.co/sHzT2fqzdh","date":"Wed May 05 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am thankful that @WaysandMeansGOP advanced my bipartisan legislation to support survivors of domestic abuse by allowing them to utilize retirement funds on a penalty-free basis to remove themselves from an abusive situation and find safety. Watch my remarks below. https://t.co/mITDvGX0Wp","date":"Wed May 05 21:11:29 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It’s Teacher Appreciation Week! Thank you to all of the incredible teachers in #PA11 and across the nation who have worked to continue providing our students with an excellent education! https://t.co/Bv9dpQS1Rx","date":"Wed May 05 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"4/5 - To schedule an appointment at the Lancaster County Community Vaccination Center at Park City visit https://t.co/OXQEqdcteS, call 717-588-1020 or walk-in.","date":"Wed May 05 14:54:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/5 - I greatly appreciate the effort of all the public and private community partners to make COVID-19 vaccines, a #ShotOfHope, available to members to our community. Thank you to the hardworking staff.","date":"Wed May 05 14:54:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"5/5 – York County residents can find additional information on vaccine distribution at https://t.co/hU1TXZfLTi","date":"Wed May 05 14:54:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/5 - The work being done here is helping our community, state, and nation move forward. If you have questions about the vaccine, please talk to your physician or health care provider.","date":"Wed May 05 14:54:51 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/5 -Yesterday I visited the Lancaster County Community Vaccination Center with @LGHealth Chief Clinical Officer Dr. Michael Ripchinski. https://t.co/fRw0Lmdsg7","date":"Wed May 05 14:54:50 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m thankful to work with Reps. McBath and Moore to introduce legislation to support survivors of domestic abuse. Learn more about our legislation ⬇⬇⬇ https://t.co/PEPBvISmjY","date":"Tue May 04 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Firefighter Appreciation Day. Thanks to all the selfless firefighters in #PA11 and across the nation who protect our communities every day. https://t.co/VKXeo6Aoto","date":"Tue May 04 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI- Last week I talked with @Owens_abc27 about Pres. Biden’s speech. Biden wants to incentivize reliance on the government by massively expanding the size and scope of the federal bureaucracy. Make no mistake, Biden will raise taxes on everyone. https://t.co/VZvHxe7lUD","date":"Mon May 03 23:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Attention restaurateurs! The Small Business Administration’s Restaurant Revitalization Fund opened today to support eligible businesses impacted by COVID-19. Learn more here: https://t.co/uNI0sMt6iK","date":"Mon May 03 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my E-Newsletter. https://t.co/mWY5SvQ2jj","date":"Mon May 03 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you need help with a federal agency my office can help you. Visit my website to learn how my casework team can help cut through Washington’s red tape. https://t.co/xJbI88Ms25","date":"Sun May 02 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss President Biden’s joint session of Congress and to provide an update on Real ID. https://t.co/fVfpRo7aNt","date":"Sat May 01 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"All adults aged 16 and over are eligible to receive a COVID-19 vaccine. Click below for more information about vaccine availability. ⬇️\nhttps://t.co/iglL7BXG3f","date":"Sat May 01 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my email updates? To stay connected on my actions around #PA11 and Washington be sure to sign up! https://t.co/Bi079ZLVy3","date":"Fri Apr 30 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined @CBS21NEWS to give my reactions to President Biden’s joint session of Congress. Democrats want to make the American people dependent on big government. The American people, not Washington, should be in charge of their own lives.\nhttps://t.co/CcB9vDse4D","date":"Fri Apr 30 16:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@MonicaCrowley is right- “Democrats don’t simply wish to “soak the rich.” They also are targeting the middle class and job creators who are driving the recovery.” Don’t let the Democrats fool you, they are coming for your paycheck too. https://t.co/lxlEzGoDy4","date":"Thu Apr 29 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s actions to undermine border security and the construction of the wall have led to a humanitarian crisis at our border. Watch my remarks during today’s @HousebudgetGop hearing. https://t.co/3JpRgggpay","date":"Thu Apr 29 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my statement on President Biden’s address to Congress. https://t.co/47mcHgZl2U","date":"Thu Apr 29 17:13:58 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Nearly 100 days into President Biden’s administration and he has no plan to address the humanitarian and national security crisis at our southern border. https://t.co/C3GhOKC55b","date":"Wed Apr 28 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden has chosen to advance his progressive agenda unilaterally by issuing executive orders to eviscerate pro-life policies, eliminate jobs and destroy American energy in his first 100 days. https://t.co/urKipRdXax","date":"Wed Apr 28 16:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI- Showing constituents around Capitol Hill is one of my favorite activities. Watch below for a virtual tour of the U.S. Capitol Building. \nhttps://t.co/vfrUe5hvPL","date":"Tue Apr 27 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s policies will simply hurt our economy. “It’s the dumbest way to raise taxes for many reasons, not least because it will cost the government revenue.” More from @WSJopinion-\nhttps://t.co/XrH9R5C6W5","date":"Tue Apr 27 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The first 100 days of President Biden’s presidency has been marked by out of control spending, bitter partisanship and a total lack of unity. https://t.co/w8glPjNVey","date":"Tue Apr 27 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Taiwan has a strong track record of assisting other nations with global health challenges. Taiwan should be participating in the upcoming World Health Assembly. It’s time to #LetTaiwanHelp","date":"Tue Apr 27 15:04:44 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"🥨 In 2019 I enjoyed visiting Revonah Pretzel in Hanover. Today on #NationalPretzelDay be sure to enjoy a pretzel made from any one of #PA11’s great snack foods companies! 🥨 https://t.co/mvScXaa1Xi","date":"Mon Apr 26 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"All adults aged 16 and over are eligible to receive a COVID-19 vaccine. Click below for more information about vaccine availability. https://t.co/iglL7BXG3f","date":"Sun Apr 25 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"One of my favorite activities is giving constituents a tour of the historic Capitol. While the pandemic has limited public tours, I want to share this building’s beautiful history with you. Watch my Virtual Capitol Tour. https://t.co/VNW5yJGN7k","date":"Sun Apr 25 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my email updates? https://t.co/Bi079ZLVy3","date":"Sun Apr 25 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week, I joined WDAC Radio to discuss my vote against the Democrats’ DC-statehood power grab and discuss @RepStefanik’s Wage Equity Act. https://t.co/9cNbNKPwvk","date":"Sat Apr 24 18:01:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It was great to meet with Ambassador Bi-Khim Hsiao earlier this week to discuss how Congress can strengthen the relationship between Taiwan and the U.S. https://t.co/qmO0HUQOHn","date":"Sat Apr 24 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my @WaysandMeansGOP colleagues in sending a letter to @USTradeRep\nurging the resumption of negotiations to support American workers and our made-in-America clean energy products globally competitive. Read more here ⬇️\n https://t.co/RtEeTD4gCV","date":"Sat Apr 24 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2- .@YourVoiceAtIRS is spot on: the IRS’s backlog of 30 million returns requiring manual processing has caused concern and significant delays affecting #PA11 residents and taxpayers across the country. https://t.co/DQulaWEZSj","date":"Fri Apr 23 20:45:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2- The IRS should be providing taxpayers with as much detail as possible about what to expect with their tax returns.","date":"Fri Apr 23 20:45:04 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Green New Deal could cost as much as $93 trillion in a decade. These socialist policies would bankrupt the nation, costing each household an estimated $60,000+. https://t.co/qilF2tDXjp","date":"Fri Apr 23 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"For over 100 years the @USArmyReserve has been defending our nation. Thank you for your dedicated service. 🇺🇸 https://t.co/joQzvtKUgq","date":"Fri Apr 23 17:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“The catastrophe now unfolding at our border is a direct result of progressive policies and pronouncements emanating from Democrats in Washington.” @Mike_Pence could not have said it any better.","date":"Thu Apr 22 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On #EarthDay I want to celebrate our local natural beauty of the Susquehanna National Heritage Area. I was proud to champion legislation to make this a National Heritage Area to preserve and celebrate the beauty of the Susquehanna Valley. https://t.co/iEIB6le11q","date":"Thu Apr 22 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"7/7-I take my marching orders from the constituents of the 11th District who can see through the flim flam and bias printed daily in the LNP.","date":"Thu Apr 22 16:49:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"6/7-I’ll continue to work in a bipartisan fashion, like I did on the CARES Act, which supported businesses across the district, including the parent company of LNP, Steinman Communications who received $4,250,200 from the Paycheck Protection Program.","date":"Thu Apr 22 16:49:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"4/7- It is unsurprising that the LNP Editorial Board finds themselves wholly unable to criticize the Biden Administration for it’s remarkable failures at the southern border.","date":"Thu Apr 22 16:49:55 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/7- It’s simply disgusting that they would refer to seeing firsthand the out-of-control humanitarian and national security crisis at our southern border as a “showboating trip.” I did what President Biden should do: personally experience the problem to better understand it.","date":"Thu Apr 22 16:49:55 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"5/7- I’m thankful, however, the Editorial Board notes I’m more well-positioned to advocate on behalf of the residents of Pennsylvania’s 11th district as a member of the House Ways &amp; Means Committee.","date":"Thu Apr 22 16:49:55 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/7- I won’t take my cues from these out-of-touch uninformed liberal elitists. They continue to repeat the same lies as if that will make them come true. I represent the values of the people of Pennsylvania’s 11th Congressional District.","date":"Thu Apr 22 16:49:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/7- It shouldn’t be a surprise that the hack @LancasterOnline Editorial Board, led by Opinion Editor @SuzCassidyLNP, who marches lockstep with and routinely endorses Speaker Pelosi’s socialist wish list legislation, is out to attack me again.","date":"Thu Apr 22 16:49:54 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“The Biden administration claims that it wants the U.S. to be more competitive, yet its tax increases would do the opposite.” @Senrobportman is absolutely correct, President Biden’s policies will weaken our competitiveness. https://t.co/YZUg3gYIjE","date":"Wed Apr 21 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thanks to all the community partners in Lancaster and York counties working together on COVID-19 vaccination efforts. Remember, everyone aged 16 years or older are eligible to receive a COVID-19 vaccine. For more information visit ⬇️\nhttps://t.co/iglL7CfhrP","date":"Wed Apr 21 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@POTUS finally called the situation at the border what it is: a crisis. His admin then backtracked on that statement. It’s okay to call it what it is, Mr. President. If the admin has doubts about the crisis at the border, here’s a suggestion: go see it! https://t.co/JIIo8DaOeJ","date":"Wed Apr 21 13:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Rep. Waters continues her track record of making dangerous, ignorant comments. Speaker Pelosi MUST condemn, not accept, them.","date":"Tue Apr 20 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"In 1983 Joe Biden called expanding the Supreme Court a “bonehead idea.” Now he has a commission to explore expanding it. Which one is it Mr. President? The court should stay at 9. #ProtecttheCourt https://t.co/pijcOzEUf8","date":"Tue Apr 20 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congratulations to @NASA and all involved on the @NASAPersevere team!","date":"Mon Apr 19 17:29:40 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my E-newsletter.  https://t.co/HAj3litjDN","date":"Mon Apr 19 13:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Do you need help with a federal agency? My office is here to assist. https://t.co/xJbI88Ms25","date":"Sun Apr 18 16:00:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I co-sponsored @RepStefanik’s Wage Equity Act. The bill would encourage employers to evaluate their pay practices, to empower women in the workplace &amp; ensure that pay differences between members of the opposite sex are due to legitimate, business-related concerns.","date":"Sat Apr 17 14:00:31 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden’s budget ignores today’s humanitarian and national security crisis at our southern border and doesn’t provide adequate resources to the Dept. of Homeland Security. Illegal border crossings are at a 15 year high!","date":"Fri Apr 16 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am proud to support this bipartisan legislation to invest in short line, regional and passenger rail. Learn more below ⬇️\nhttps://t.co/QhpN8Tyatt","date":"Fri Apr 16 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"In Pres. Biden’s recent “budget” there are 146 mentions of “climate” and just 3 mentions of “border security.” When are Pres. Biden and VP Harris going to take this border crisis seriously? https://t.co/wtheWM18xz","date":"Thu Apr 15 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/3- Democrats are being shortsighted. Democrats want to pack on liberals now but when they aren’t in charge, will they try to cut SCOTUS seats?","date":"Thu Apr 15 18:00:30 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/3- The radicals should listen to @POTUS when he called packing the court “a bonehead idea.” This legislation is ludicrous.  https://t.co/ToPnIiVKZ8","date":"Thu Apr 15 18:00:29 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/3- The Supreme Court has had nine justices since 1869, but Congressional Democrats will stop at nothing from trying to pack the court to enact their radical agenda pushed by liberal activists.","date":"Thu Apr 15 18:00:28 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you @RepKevinBrady for your service and continued leadership advocating for pro-growth policies to strengthen the American economy. I look forward to continuing to work with you through the 117th Congress.","date":"Wed Apr 14 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am proud to stand up for life and sign the Born-Alive Abortion Survivors Protection Act discharge petition led by @SteveScalise, @RepAnnWagner, @RepKatCammack, to bring the bill to the floor for a vote. I will always fight for the unborn. https://t.co/zPR929L1we","date":"Wed Apr 14 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden should listen to @GOPLeader.","date":"Wed Apr 14 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"For 73 years @USAFReserve has been #ReserveReady to defend our nation. Happy Birthday and thank you for your service! https://t.co/6EGvDmv59B","date":"Wed Apr 14 19:05:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is President Thomas Jefferson’s birthday. Learn more about our great founding father and author of the Declaration of Independence. https://t.co/JrASy3nufR https://t.co/XxMdzcvsLA","date":"Tue Apr 13 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"All #PA adults age 16 and older are now eligible for a COVID-19 vaccine. Visit your county’s page for information. \n\nYork residents: https://t.co/hU1TXYYauI \n\nLancaster residents: https://t.co/vHuurobvFt","date":"Tue Apr 13 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today we honor @CapitolPolice Officer William Evans who lost his life in the line of duty. Each day the USCP protects Members, staff and visitors and we are all grateful for their dedicated service. We will always remember Officer Evans for his brave service. https://t.co/yeBH7XjuiO","date":"Tue Apr 13 15:35:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I hope IRS Commissioner Rettig will tell @SenFinance Senators that he plans to delay the Q1 est. tax payments to 5/17. https://t.co/lYrKfp7rhJ","date":"Tue Apr 13 13:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 .@VP Harris has been busy traveling everywhere but the border. It is clear how unseriously their administration is taking this crisis. https://t.co/Pxa4FZ5mQJ","date":"Mon Apr 12 17:58:29 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2- It is long past the time for Vice President Harris, who was appointed to fix the border crisis, to go to the border and see the failures of her administration’s policies. https://t.co/BpjWbHPGs0","date":"Mon Apr 12 17:58:28 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the latest edition of my e-newsletter. https://t.co/ge1S2jaBFf","date":"Mon Apr 12 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you are having trouble with a federal agency my office can help you. https://t.co/xJbI88uRax","date":"Sun Apr 11 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Watch my interview with @BarbaraBarrWGAL \n@WGAL about my recent trip to the southern border. https://t.co/rklLSRTbVd","date":"Sun Apr 11 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? Be sure to subscribe to stay up to date on my activities. https://t.co/Bi079Zuk9t","date":"Sun Apr 11 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"REMINDER—The federal tax filing for income tax has been moved to May 17th. https://t.co/gRAIm7NwII","date":"Sat Apr 10 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined 184 of my colleagues in a bipartisan letter to the NPRC to clear the backlog of nearly 480,000 record requests from veterans. We are thankful for our veterans’ service to our nation. We all have had to adapt to the pandemic but, this processing backlog is unacceptable. https://t.co/5Xf8CQ7xbu","date":"Sat Apr 10 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read my statement on my recent visit to the southern border. https://t.co/MwXFOibpXx","date":"Fri Apr 09 23:00:40 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The 2021 Congressional Art Competition is a great opportunity for high school students to show their talent. Learn more on my website. https://t.co/AXhR0buL36","date":"Fri Apr 09 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: I introduced legislation to extend the Q1 est. tax payment deadline to 5/17, aligning it with the new individual filing date. https://t.co/lYrKfp7rhJ","date":"Fri Apr 09 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I call on @VP Harris and @POTUS Biden to visit the border they should be here to see first-hand the impact of their policies. https://t.co/FTdtuH47P3","date":"Thu Apr 08 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I introduced legislation to extend the Q1 est. tax payment deadline to 5/17, aligning it with the new individual filing date. A global pandemic is not the time for a punitive approach to small businesses which are the backbone of our communities. https://t.co/PE48DmSnbt","date":"Thu Apr 08 21:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am down at the southern border with colleagues from the Republican Study Committee to see the crisis first-hand.","date":"Thu Apr 08 15:55:46 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Craft brewers have a $5.5 billion economic impact in #PA!","date":"Wed Apr 07 20:36:24 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On National Beer Day I want to recognize all the great breweries right here in #PA11. Celebrate responsibly!\n\nLast year I was proud to support the Craft Beverage Modernization and Tax Reform Act to help small and independent brewers continue to thrive.","date":"Wed Apr 07 20:36:23 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On #WorldHealthDay I want to thank all of the doctors, nurses, and all on the frontlines who have been working had to keep us safe over this past year. Thank you! https://t.co/IzIw28fJCU","date":"Wed Apr 07 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is Holocaust Remembrance Day. We will never forget the atrocities of the Holocaust and we will always remember those who were killed. https://t.co/EaJ8iJZrbX","date":"Wed Apr 07 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden and Congressional Dems have wasted no time pushing their progressive wish list. #BuildBackBankrupt","date":"Tue Apr 06 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday I introduced the Improving Adoption Outcomes &amp; Affordability Act with @RepDonBacon &amp; @RepBlakeMoore. Learn more ⬇️\nhttps://t.co/cLrG37dpfN","date":"Tue Apr 06 16:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today on Gold Star Spouses Day, we honor the husbands and wives of members of the Armed Forces who have passed away. https://t.co/qMcYZbtEWf","date":"Mon Apr 05 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I want to wish everyone a very blessed Easter. https://t.co/FLwhROiUN2","date":"Sun Apr 04 13:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to give thanks to local veterans in honor of National Vietnam War Veterans Day which was earlier this week. https://t.co/6E5hLt4cDa","date":"Sat Apr 03 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am thinking of the Capitol Police officers injured today. We thank them each day for their dedication to keeping us safe.","date":"Fri Apr 02 17:54:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"April is Autism Awareness Month and today is World #AutismAwarenessDay.\nShare this post to turn timelines blue in recognition! https://t.co/XYbaU2mBDJ","date":"Fri Apr 02 14:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Read the full letter ⬇️\nhttps://t.co/UtzYlQWC8x","date":"Thu Apr 01 15:46:43 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I was joined by 59 of my colleagues in sending a letter to IRS Commissioner Rettig urging him to extend the Q1 est. tax payment deadline to 5/17, aligning it with the new individual filing date. #SmallBiz needs this commonsense extension. https://t.co/pvk6B1wzYM","date":"Thu Apr 01 15:46:42 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my PA GOP colleagues in urging DHS Sec. Mayorkas to combat drug trafficking at our southern border. DHS needs to get the border secured so drugs stop infiltrating our communities. https://t.co/aLPXdgq9Wh","date":"Wed Mar 31 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"In less than 100 days Pres. Biden has spent $1.9 trillion dollars and now he wants to spend another $2 trillion. Biden’s real plan is to #BuildBackBankrupt!","date":"Wed Mar 31 16:16:32 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden’s dismissal of the ongoing border crisis as “normal” is simply false. “The new figures indicate government resources will be strained far longer than under usual seasonal migration patterns.” From @axios https://t.co/SIsOVb0KNF","date":"Tue Mar 30 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you to my colleague Rep. Dr. Joyce and doctors all across #PA and the nation for working hard to keep everyone healthy.","date":"Tue Mar 30 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Without the strong economy created by the @WaysAndMeansGOP Tax Cuts and Jobs Act our economy would not have been able to sustain the pressures of COVID-19. We need more pro-growth policies, not tax hikes that will hurt our competitiveness. #TCJA","date":"Tue Mar 30 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have you read the latest edition of my e-newsletter? https://t.co/6A1lrUprtb","date":"Mon Mar 29 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2 - Thank you to Eleventh District resident Sgt. Harold Redding, who advocated tirelessly to make sure the sacrifices of those who served and those who never returned home are always remembered.","date":"Mon Mar 29 15:49:26 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2 - On Vietnam War Veterans Day, we must never forget and honor our Vietnam veterans for their service in defending our country. Thank you, and we honor your service. https://t.co/QrZ9vuiYOB","date":"Mon Mar 29 15:49:26 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"York County has a website dedicated to providing vaccine information for York. https://t.co/hU1TXYYauI","date":"Sun Mar 28 19:05:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Lancaster County has a website dedicated to providing vaccine information for Lancaster. https://t.co/vHuurot743","date":"Sun Mar 28 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss my new legislation and the failure of the Wolf administration to protect those in nursing homes from COVID-19. https://t.co/D6NHmmFlIy","date":"Sun Mar 28 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"To the Jewish community members in our district, I wish you a very happy Passover, Chag Sameach! https://t.co/pKlvC2H1KQ","date":"Sat Mar 27 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my e-newsletter? Be sure to sign up to stay up to date on my activities. https://t.co/Bi079Zuk9t","date":"Sat Mar 27 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"March is recognized as Women’s History Month. This year I want to honor the new women that have been elected to serve in the U.S. House of Representatives in the 117th Congress. https://t.co/6DMaFIP4xm","date":"Fri Mar 26 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I am proud that legislation I introduced to help improve adoption outcomes for children entering the foster care system as a result of parents or guardians struggling to provide a safe home due to substance abuse was advanced by the House. https://t.co/shaCTdgbTC","date":"Thu Mar 25 20:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Days ago VP Harris was laughing about the border crisis and now she is the Biden Administration’s point person to solve it?? She should visit the border immediately and hopefully she realizes how serious the situation is.","date":"Thu Mar 25 18:26:09 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I introduced the Debt Solution and Accountability Act because it is past time for Washington to get its fiscal house in order. Learn more about my legislation. https://t.co/mnsNV9K1Lk","date":"Thu Mar 25 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is #NationalMedalofHonorDay. Recipients of the Medal of Honor have demonstrated exceptional acts of valor. Thank you for your service and dedication to our grateful nation. https://t.co/SENuy81Raf","date":"Thu Mar 25 14:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Dr. Levine should not be confirmed by the U.S. Senate. She should be held accountable for her actions that led to thousands of COVID-19 deaths. Appointing her to a position @HHSGov is irresponsible. https://t.co/kJbx5qe9mW","date":"Wed Mar 24 17:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden and his congressional allies keep moving the goalposts on their proposed tax hikes. Maybe they should join the real world and realize their tax hikes will hurt American families.  https://t.co/nDPZ4DcCLq","date":"Tue Mar 23 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On #NationalAgricultureDay we thank our farmers &amp; producers in #PA11 &amp; across America who provide us safe, domestic food. Thank you! https://t.co/C8KB2gbpp9","date":"Tue Mar 23 16:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It is clear that the Biden administration does not take the crisis seriously. This is no laughing matter @VP. #BidenBorderCrisis.","date":"Tue Mar 23 14:40:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This response is terrible. Dr. Rachel Levine should be held accountable for her actions that led to thousands of COVID-19 deaths. Dr. Levine should not be confirmed by the Senate.","date":"Mon Mar 22 18:17:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden must address the crisis at the border now! #BidenBorderCrisis https://t.co/jNGbFyv76O","date":"Mon Mar 22 17:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pennsylvanians deserve answers not silence from Gov. Wolf and his administration. https://t.co/uD8edbDZh0","date":"Mon Mar 22 13:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: I along with @SenToomey sent a letter to the PA Dept. of Health to answer for their failures to protect residents in long-term care facilities and nursing homes. https://t.co/h5juyrPP23","date":"Sun Mar 21 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today is World Down Syndrome Day! Learn more about why today is chosen as World Down Syndrome Day here from @NDSS. https://t.co/MwtA1MXara","date":"Sun Mar 21 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss legislation I introduced to improve adoption outcomes and the #BidenBorderCrisis. https://t.co/a4Omv86nrK","date":"Sun Mar 21 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to assist with issues with Federal agencies. Visit my website if you need help. https://t.co/xJbI88Ms25","date":"Sun Mar 21 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up for my e-newsletter? Be sure to sign up on my website. https://t.co/Bi079Zuk9t","date":"Sat Mar 20 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Lancaster County has a dedicated page to help you answer questions about vaccine availability in Lancaster. https://t.co/vHuurot743","date":"Sat Mar 20 14:05:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@yorkcountypa has a dedicated page to help you answer questions about vaccine availability in York.  https://t.co/hU1TXYYauI","date":"Sat Mar 20 14:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you @cspan for letting the American people view their government in action.","date":"Fri Mar 19 15:45:45 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"During today’s @WaysMeansCmte Oversight Subcommittee hearing, I questioned the IRS Commissioner on filing deadlines for estimated tax payments which impact small businesses, how the IRS plans to implement the Child Tax Credit, and how he can improve #PA11 casework response time. https://t.co/OrGpf39Oi9","date":"Thu Mar 18 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@SpeakerPelosi’s hypocrisy knows no end. She’s leading House Dems in an attempt to overturn the will of the constituents of #IA02.","date":"Thu Mar 18 21:09:38 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Dr. Levine is getting rewarded by Pres. Biden for her negligent behavior, while Pennsylvanians still do not have answers. This week I joined a letter with @WaysandMeansGOP colleagues asking Dr. Levine to answer for her mistakes. https://t.co/GtPzNAH9v9","date":"Thu Mar 18 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/2- The #PaycheckProtectionProgram has kept thousands of employees on payroll, providing for their families. I am thankful the House advanced legislation to extend the PPP deadline, to help businesses &amp; banks cope with the Biden Admin’s shifting rules. https://t.co/fGJNLVnq4p","date":"Wed Mar 17 21:04:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2- This shouldn’t have taken so long. We should’ve voted on this months ago, but for Democrats the $1.9 trillion Pelosi Payout was more important.","date":"Wed Mar 17 21:04:56 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Saint Patrick’s Day! https://t.co/Dt6w1iuHNH","date":"Wed Mar 17 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined @SenToomey and members of the PAGOP House Delegation in calling on the PA Dept. of Health to answer for their mistakes which led to deaths in long-term care facilities and nursing homes. \nhttps://t.co/h5juys7pTB","date":"Wed Mar 17 14:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden administration can no longer ignore the border crisis their actions have exacerbated. https://t.co/KfJz4nnA9H","date":"Tue Mar 16 15:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrat’s staggering $1.9 trillion spending bill will have consequences: raising Americans' taxes. Printing money to fund a liberal wish list in the middle of a pandemic is irresponsible at best.\nhttps://t.co/BOAS6P3Y4f","date":"Tue Mar 16 13:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden entered the Oval Office and immediately created a crisis at the U.S. Southern border. If it is not a crisis then why did DHS dispatch FEMA? https://t.co/3vcX4BmG3c","date":"Mon Mar 15 20:15:34 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to read the latest edition of my E-newsletter. https://t.co/B1SfJr8sWo","date":"Mon Mar 15 16:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Think about that $43,000 spent every second, with hundreds of billions of dollars that won’t even be spent this year. This $1,900,000,000,000 Pelosi payoff is irresponsible. https://t.co/JkI8gLaRBN","date":"Sun Mar 14 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my E-newsletter? Be sure to sign up to learn about my activities in #PA11 and Washington. https://t.co/Bi079ZLVy3","date":"Sun Mar 14 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC Radio to discuss H.R. 1 and the Congressional Art Competition. Listen below ⬇️ https://t.co/ysh3o6IZVC","date":"Sat Mar 13 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I’ve introduced legislation to improve adoption outcomes for children impacted by the opioid epidemic. There was a staggering 20% increase in fatal drug overdoses last year, which may result in more children entering the child welfare system. https://t.co/H6zwdgo36r","date":"Sat Mar 13 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“Last month alone, 100,000 migrants were encountered attempting to illegally cross our southern border.” President Biden needs to address this crisis immediately. Read more from @GOPLeader https://t.co/9DYVfJQTmr","date":"Sat Mar 13 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I’m proud to be an original cosponsor of @RepKatCammack's REINS Act, to assert Congress’ role in the legislative regulatory process, by requiring major rules to be approved by Congress. #MakeItREINS https://t.co/ncPVajpIYk","date":"Thu Mar 11 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My defense of our Second Amendment will not waver.⬇️\nhttps://t.co/itk9TOrFpf","date":"Thu Mar 11 18:03:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This $1.9 trillion bill is not relief, stimulus or a rescue. It’s a progressive wish list which I opposed. \n\nMy full statement⬇️\nhttps://t.co/iLqRsTFKXo","date":"Wed Mar 10 22:16:58 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This bill is not about COVID-19 relief. It’s about enacting Speaker Pelosi’s progressive wish list. Listen to my remarks ⬇️ https://t.co/kO20AlGA5N","date":"Wed Mar 10 17:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The PRO Act is a radical, backwards-looking bill that will diminish the rights of workers and employers alike while harming the economy and providing a political gift to labor union special interests. The American worker needs help, not forced unionizing. https://t.co/kb4nGhauId","date":"Wed Mar 10 00:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This is not “COVID relief.” It’s a partisan “bailout” for progressives. With only 9% going to COVID public health spending, this is no way to crush the pandemic. https://t.co/ZlcwEYeMCv","date":"Tue Mar 09 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Looking for additional information on vaccine availability in #PA11? Check out these sites: \n\nLancaster ⬇️\nhttps://t.co/vHuurobvFt  \n\nYork ⬇️\nhttps://t.co/qdXRGloMst","date":"Tue Mar 09 16:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Targeted relief for COVID-19 is needed, not Speaker Pelosi and President Biden’s liberal wish list. Only 9% of $1.9 trillion is spent on public health programs fighting COVID-19. https://t.co/YaGAcDwsDK","date":"Mon Mar 08 23:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Yesterday, #PA celebrated Charter Day! For 340 years #PA has contributed to the world and the birth of our nation. Learn more from @PHMC. https://t.co/BlaRWCaL0b","date":"Mon Mar 08 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you having trouble with a federal agency? My office can assist constituents in cutting through Washington’s red-tape. https://t.co/xJbI88Ms25","date":"Sun Mar 07 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Speaker Pelosi and House Democrats have once again pushed through their liberal agenda when most Americans were asleep. This is wrong and no way to move our nation forward. https://t.co/UFVLTcAVZe","date":"Sun Mar 07 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"President Biden’s $1.9 Trillion Bailout will trigger $17.2 billion in automatic cuts to Medicare over the next decade. These cuts will hurt Pennsylvania’s seniors.","date":"Sat Mar 06 16:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden already wants to spend $1.9 trillion on bailouts. Where does his spending spree stop? We don’t know because he hasn’t sent a budget to Congress. I joined my @housebudgetgop colleagues in asking when Biden will send his budget to Congress.  https://t.co/IbEB9czOSd","date":"Fri Mar 05 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"There are 4.1 million long-term (27 weeks or more) unemployed Americans. Yet, @HouseDemocrats on the Ways and Means Committee blocked my amendment to incentivize the hiring of long-term unemployed individuals. We must get our country back to work.","date":"Fri Mar 05 19:27:05 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"One of the greatest honors of being a Member of Congress is nominating talented students to our great military academies. https://t.co/fkbW2CJOni","date":"Fri Mar 05 15:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Gov. Wolf has been silent on this issue since his Administration issued the deadly guidance. Lives cannot be swept under the rug. All of us in #PA deserve answers. https://t.co/VoTBlB5oRK","date":"Thu Mar 04 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you @SteveScalise for the delicious King Cake! https://t.co/xLPaVVDZYI","date":"Thu Mar 04 21:50:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I voted no on #HR1 read my statement⬇️\nhttps://t.co/tUXWhEKGlm","date":"Thu Mar 04 04:08:14 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"#HR1 dictates “one-size-fits-all” election mandates from Washington, oversteps the boundaries of our Constitution and spends taxpayer dollars on attack ads. This bill isn’t “For the People,” it’s “For the Politicians.” https://t.co/vK8yZZNCsj","date":"Wed Mar 03 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Vice President @Mike_Pence is right, “HR 1 would turn a blind eye to very real problems at the state level, exacerbate existing vulnerabilities, and further undermine the American people’s confidence in the principle of 'one person, one vote.'” \nhttps://t.co/ejFKuVs8MW","date":"Wed Mar 03 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Thank you to the brave members of the Navy Reserve for protecting our shores for the past 106 years! https://t.co/syVoOesfSb","date":"Wed Mar 03 17:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@GopLeader breaks down the problems with Pelosi and House Dem’s #HR1. When will they start working for the American people and not themselves?","date":"Wed Mar 03 15:04:18 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Reminder – Pelosi and Biden’s $1.9 trillion payoff only puts 9% towards public health spending. H/T to @PatrickMcHenry for sharing this great graph. https://t.co/kZXpUPZtfo","date":"Tue Mar 02 22:57:49 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The best stimulus check is a paycheck, but W&amp;M Dems blocked my amendment that would encourage business owners to hire the long-term unemployed. Instead of helping Americans get back to work and earn a paycheck, Pres. Biden prefers to pay Americans to stay at home. https://t.co/uKnEEPI8oj","date":"Fri Feb 12 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"“Do as I say, not as I do.” When it comes to our kids &amp; education, we must put our collective foot down! https://t.co/NXaro9Pa9J","date":"Tue Mar 02 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Listen to my testimony in the Rules Committee yesterday about my Voter Confidence Act, an important first step forward to rebuilding trust in our elections. My reasonable proposal was not made in order by hyper-partisan Democrats on the committee. https://t.co/UloYG5uPR1","date":"Tue Mar 02 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Speaker Pelosi wants to spend your taxpayer dollars on her campaign by dangerously nationalizing elections. Pelosi says H.R. 1 is “For the People” but it’s only for HER people. https://t.co/KkJQ268ucP","date":"Tue Mar 02 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This weekend I joined @CBS21NEWS Face the State to discuss the highly partisan actions taken by Speaker Pelosi and House Democrats last week. Watch my interview ⬇️ ⬇️ https://t.co/z8iIIfLDbF","date":"Mon Mar 01 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to read the latest edition of my E-newsletter. https://t.co/Tlky7ywwiv","date":"Mon Mar 01 17:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The 2021 Congressional Art Competition is here! If you are a high school student in #PA11 visit my website to learn how you can participate. https://t.co/AXhR0bMmrG","date":"Sun Feb 28 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The @JNJNews vaccine has received Emergency Use Authorization from the @US_FDA. It is the third approved vaccine in our arsenal to combat COVID-19. Without the leadership of the scientific community and Operation Warp Speed this would not be possible. https://t.co/soFlBcio8A","date":"Sun Feb 28 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up to receive my E-newsletter? Be sure to sign up to receive updates on my activities around our district and in Washington. https://t.co/Bi079Zuk9t","date":"Sun Feb 28 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"February is Career and Technical Education (CTE) month. CTE creates great pathways for Americans to live and achieve their American dream. https://t.co/rLwncbtvBt","date":"Sat Feb 27 23:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Tune in tomorrow at 8:30am to watch my interview with @RyanEldredgeTV on @CBS21NEWS Face the State. https://t.co/aKNuhA8pw1","date":"Sat Feb 27 21:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It has been a busy week here in Washington. Please watch below for my comments on Pelosi’s partisan $1.9 trillion spending wish list. https://t.co/pbfqZ2tjJF","date":"Sat Feb 27 17:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Congress could do much better than this bloated, greedy, and hyper-partisan $1.9 trillion spending wish list. I voted no. Read my full statement ⬇️\nhttps://t.co/NrIGeQv5tt","date":"Sat Feb 27 07:06:45 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I couldn’t agree more with @RepJasonSmith &amp; @RepJamesComer “While rewarding policies at the local level that destroy jobs and harm working-class Americans, the Democrat plan would dispense its own share of economic pain from Washington.” Read more ⬇️\nhttps://t.co/nZG17uriYt","date":"Thu Feb 25 22:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden start cutting here:\n\n- $350 Billion State Bailouts\n\n- $86 Billion Private Pension Bailouts\n\n- the 1.4 million job-killing minimum wage hike\n\n- Unnecessary Economic Impact Payments to those who were NEVER financially impacted by COVID-19 https://t.co/xfoLANddqU","date":"Thu Feb 25 19:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"It is safe for students to return to the classroom. President Biden and Democrats need to put STUDENTS not the teacher unions first. America's students deserve better.","date":"Thu Feb 25 17:22:34 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Last night I joined my colleagues on the steps of the Capitol for a moment of silence to honor those we have lost to COVID-19. We will continue to fight this virus and keep those we lost in our prayers. https://t.co/HzXSXrWKOg","date":"Thu Feb 25 00:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden Administration has to get serious about the continual threat of China. The U.S. must be strong against Xi’s efforts. Thankful for the work of @GOPLeader and my PA colleagues who served on @HouseGOP China Task Force @Greschenthaler &amp; @RepJohnJoyce https://t.co/yzXHi4Rchl","date":"Wed Feb 24 21:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"So much for COVID-19 relief:\n\nLess than 9% of Biden’s $2 trillion partisan wish list is spent on public health. \n \nLess than 9% of Biden’s $2 trillion partisan wish list is spent on public health.\n \nLess than 9% of Biden’s $2 trillion partisan wish list is spent on public health. https://t.co/pPVwsLnQ26","date":"Wed Feb 24 19:10:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The science is clear. It is time to reopen our schools. Democrats should not let the teacher unions dictate policies that harm our kids. America’s children deserve better. Read more from @RepKayGranger\nand @virginiafoxx https://t.co/05TjIAIyGV","date":"Tue Feb 23 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Just like NY, PA officials took measures that were in direct contradiction with existing federal guidance. Watch below for my comments during the House Budget Committee hearing yesterday. Wolf, Shapiro and Levine must be held accountable; PA deserves transparency. https://t.co/HeiR1IVyGN","date":"Tue Feb 23 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Dems tell Americans their bill will provide immediate relief and fix COVID-19. In reality, their $1.9 trillion package is not targeted to COVID-19. It’s filled with a liberal agenda and funds that will not go to support Americans this year. Enough! https://t.co/UDwXyNmcDI","date":"Tue Feb 23 17:45:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Birthday to President George Washington an important Founding Father who displayed exceptional leadership and resolve to achieve our independence and serve as our nation’s first president. https://t.co/3bBhFZgeLe","date":"Mon Feb 22 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden &amp; congressional Democrats say there is an urgent need, but excluding stimulus payments, nearly half of the funds in their plan wouldn’t even be spent this fiscal year. Additional COVID-19 relief should be targeted and temporary. https://t.co/9xbuyOfeG5","date":"Mon Feb 22 19:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Great conversation about Rep. Joseph Rainey between @SenatorTimScott and @GOPLeader.","date":"Mon Feb 22 17:36:45 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Be sure to stay connected with me on all of my social media platforms. https://t.co/j0bjoPVoAJ","date":"Sun Feb 21 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"My office is here to help you with Federal agencies. If you are having a problem please contact my office. https://t.co/xJbI88Ms25","date":"Sun Feb 21 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you have not received your Economic Impact Payment, you could be eligible for the Recovery Rebate Credit from the IRS. Learn more: https://t.co/pXzPsWEvE8","date":"Sat Feb 20 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"As we continue to battle COVID-19 and start to vaccinate more Americans, I want to once again thank our brave frontline workers. Their commitment to keeping our nation safe has not stopped.","date":"Sat Feb 20 15:00:02 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined my fellow @WaysandMeansGOP Oversight Subcommittee Members in calling on the IRS to process the backlog of 11 million 2019 tax returns. This problem needs to be addressed as Americans begin filing their 2020 taxes. https://t.co/VJEWcBALm9","date":"Sat Feb 20 00:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"This week during a Ways and Means Oversight Subcommittee hearing I spoke about the impact COVID-19 has had on volunteer tax assistance programs helping individuals in filing their taxes. Listen in ⬇️ https://t.co/xgbwMepyLg","date":"Fri Feb 19 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"February is American Heart Month, it is important to always check in on your health! Learn more about heart health here from the CDC: https://t.co/Cb0dEjW2VS https://t.co/flWIzAyCnC","date":"Fri Feb 19 20:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The American people know there is dignity in earning a paycheck. President Biden and congressional Democrats would be wise to join @HouseGOP in fighting for pro-growth policies that will create economic opportunity, not stifle it. https://t.co/BXvY1b7PHM","date":"Fri Feb 19 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Great job by @NASA! American space innovation is on full display. God Bless America🇺🇸","date":"Thu Feb 18 21:35:15 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today @NASAPersevere lands on Mars. Be sure to tune in for the live coverage beginning at 2:15pm and for the landing at roughly 3:55pm. https://t.co/VvssBnZYpE","date":"Thu Feb 18 19:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The Biden Administration is taking away opportunities for people to better themselves and be competitive in the workforce when it is most needed. Eliminating industry recognized apprenticeships is a terrible decision that will hurt American workers.  https://t.co/Alk2ZpmAqy","date":"Thu Feb 18 18:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Democrats are pushing to federalize our elections which is unconstitutional. We must first focus on reestablishing voter’s faith in the integrity of elections by passing the Voter Confidence Act. Learn more: https://t.co/chyxh1XP0I","date":"Thu Feb 18 16:45:24 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Pres. Biden’s push to raise the minimum wage will hurt our economy and small businesses. Small businesses are already struggling and Americans need to keep their jobs not lose them. Congressional Dems need to stop masking their liberal agenda in the name of COVID relief. https://t.co/ycATAwlSAP","date":"Wed Feb 17 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"We must help the long-term unemployed get back to work so THEY can provide for their families. Democrats paying Americans to stay home is no way to get our economy moving. https://t.co/tyXUHO1BeH","date":"Wed Feb 17 18:26:27 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Seniors, their families &amp; Americans deserve answers. I joined my PA GOP Congressional colleagues in asking AG Shapiro what he is doing to ensure the public has been provided accurate data about the tragedies caused by Gov. Wolf’s and Sec. Levine’s malfeasance. https://t.co/yM6ce3ceHv","date":"Wed Feb 17 02:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Happy Fastnacht Day! Be sure to purchase your Fastnachts from your favorite local small business! https://t.co/CrHlfP3Gv4","date":"Wed Feb 17 00:15:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The best stimulus check is a paycheck, but W&amp;M Dems blocked my amendment that would encourage business owners to hire the long-term unemployed. Instead of helping Americans get back to work and earn a paycheck, Pres. Biden prefers to pay Americans to stay at home. https://t.co/uKnEEPI8oj","date":"Fri Feb 12 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Have you read the latest edition of my E-newsletter? \nhttps://t.co/DuTdw5D6tW","date":"Mon Feb 15 22:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"On Presidents’ Day we recognize, honor and celebrate our Founding Fathers like George Washington. https://t.co/W0ejGebpMq","date":"Mon Feb 15 15:00:01 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"I joined WDAC to discuss the VA Billing Accountability Act and President Biden’s refusal to answer how his COVID package will create jobs. https://t.co/lqdaLPZBgh","date":"Sun Feb 14 21:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"ICYMI: I introduced the Voter Confidence Act so that all Americans have faith in our electoral process. https://t.co/chyxh1GdC8","date":"Sun Feb 14 15:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"If you or a family member has not received your second economic impact payment visit the IRS’s website for information on how to find your payment and to answer your questions. https://t.co/BYPiQvQ3v8","date":"Sat Feb 13 22:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Each February we take time to honor and recognize Black History Month. Learn more about the history behind Black History Month and more from the National Park Service’s educational resources. https://t.co/WQJaTZqKEd","date":"Sat Feb 13 18:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Are you signed up for my E-newsletter? Sign up to receive updates from my activities in Washington and around our District. https://t.co/Bi079Zuk9t","date":"Sat Feb 13 15:00:03 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"5/5 - For months, I have been calling for investigations and transparency into this matter. I urge my colleagues on both sides of the aisle to join in my call for a thorough investigation and accountability.","date":"Fri Feb 12 21:43:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"3/5 - This is a horrific scandal where malfeasance by leaders in PA, NY and others is responsible for thousands of deaths. They must be held accountable.","date":"Fri Feb 12 21:43:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"4/5 - Biden’s nomination of former PA Sec. of Health Levine to serve at HHS is insulting to those who lost loved ones at senior living facilities – she moved her own mother OUT of a senior living facility after requiring them to admit COVID-19 patients.","date":"Fri Feb 12 21:43:19 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/5- We have now learned Gov. Cuomo has manipulated and covered up the NY death counts - lying to the American people. And today Cuomo met with Pres. Biden at the White House.","date":"Fri Feb 12 21:43:18 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"1/5- We know PA Gov. Wolf and Sec. Levine forced senior living facilities to accept COVID-19 positive patients going against guidance from @CMSGov. These actions led to thousands of deaths.","date":"Fri Feb 12 21:43:18 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Today we celebrate the birthday of our nation’s 16th President, Abraham Lincoln. “Government of the people, by the people, for the people shall not perish from the Earth.” https://t.co/Bz38I4Q1xd","date":"Fri Feb 12 20:00:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"The best stimulus check is a paycheck, but W&amp;M Dems blocked my amendment that would encourage business owners to hire the long-term unemployed. Instead of helping Americans get back to work and earn a paycheck, Pres. Biden prefers to pay Americans to stay at home. https://t.co/uKnEEPI8oj","date":"Fri Feb 12 18:30:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"Our veterans deserve the best from the Dept. of Veterans Affairs. I re-introduced the VA Accountability Act to protect our veterans from surprise medical bills.  https://t.co/85ym5yQ8cw","date":"Fri Feb 12 16:30:37 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":".@RepTomReed’s amendment to hold governors accountable for tragic COVID-related nursing home deaths was blocked by Dems. Why are they protecting state officials for their mismanagement of COVID-19 in nursing homes? #PA families deserve answers not excuses. My remarks ⬇️ https://t.co/Oa18z0HjZv","date":"Thu Feb 11 21:50:00 +0000 2021","user_id":"41417564"},{"handle":"RepSmucker","text":"2/2- I look forward to continuing to work with @RepRichardNeal &amp; @RepKevinBrady to provide additional targeted relief to these critical community supports.","date":"Thu Feb 11 18:00:35 +0000 2021","user_id":"41417564"}]