[{"handle":"RepShontelBrown","text":"Access to clean water is a fundamental human right.\n\nThat's why I joined 167 Congressional Democrats to defend clean water as the Supreme Court considers gutting the protections of the Clean Water Act.","date":"Fri Jun 17 16:09:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Next Thursday, I will be hosting my fourth telephone town hall to update you on my work in Congress and answer your questions.\n\nRegister to attend at https://t.co/ezUeQKPWZ3. https://t.co/HHNjAhE9By","date":"Thu Jun 16 20:41:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Higher prices are straining families’ budgets in Cleveland and across the nation.\n\nToday, I voted for the Lower Food and Fuel Costs Act.\n \nThe bill would help to lower prices at the pump and in the grocery aisle for working families.","date":"Thu Jun 16 18:52:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"From targeting gas price gouging to making ethanol blends more available, the House is working hard to ease pain at the pump. https://t.co/5yU1E9wXIX","date":"Thu Jun 16 18:26:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We need solutions to help working families, from an extension of the Child Tax Credit to universal paid family leave.\n\nThat's exactly why I attached an amendment to a bill passed by the House yesterday to collect data on labor trends among working parents. https://t.co/vfYza3QiKe","date":"Thu Jun 16 13:31:26 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I'd like to thank #OH11 constituent Donna Price for sharing her story with @WaysMeansCmte. \n\nA nurse, a mother of 3, and a caregiver for her disabled mother, Ms. Price said we need affordable childcare and paid family and medical leave.\n\nI agree, Ms. Price, and I have your back.","date":"Thu Jun 16 13:05:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"American flags purchased with taxpayer dollars should be made right here in America. \n\nThat's why I joined @RepCheri, @RepTimRyan &amp; @RepKinzinger in introducing the All-American Flag Act.","date":"Wed Jun 15 20:49:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"❤️","date":"Wed Jun 15 20:47:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Exciting news! I just had my first amendment pass the House.\n\nThe measure would collect new data on how many parents have returned to the workforce, highlighting the need for effective childcare policies.","date":"Wed Jun 15 19:58:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Unemployment is near historic lows, yet women with children have returned to work at slower rates.\n\nMy amendment to a bill on the floor today would require the Fed to report on labor trends among working families.\n\nThis data would show the need for effective childcare policies. https://t.co/exMmSe7Ucj","date":"Wed Jun 15 17:53:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you, Mayor @JustinMBibb. \n\nSchools are sanctuaries of learning—not war zones.\n\nMore guns will not make schools safer. It will only put more students and teachers at risk.","date":"Wed Jun 15 15:38:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"More than 4,000 Dreamers call Ohio home.\n \nThey make our state and our nation stronger.\n\nThey are American in every way except one: on paper.\n \nOn DACA's 10th anniversary, it’s time for the Senate to provide permanent protection to Dreamers by passing the Dream &amp; Promise Act.","date":"Wed Jun 15 15:35:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Yesterday, a new permitless carry law went into effect in Ohio. \n\nAnd the Governor signed a bill to allow barely trained teachers to carry guns in school.\n\nNo commonsense gun safety measures, but this. \n\nNonsense.","date":"Tue Jun 14 22:13:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House just passed a bill to provide security for Supreme Court Justices and their families.\n\nGreat—we should do that in response to the rising risks posed to the Court.\n\nBut where is that same sense of urgency when shoppers are slaughtered or when kids are killed at school?","date":"Tue Jun 14 21:39:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Our police officers and first responders often face traumatic situations that can leave them with invisible wounds.\n\nIn fact, around 15% of all officers suffer from PTSD.\n\nProud to introduce a bipartisan bill with @RepDaveJoyce  to better support officers struggling with PTSD.","date":"Tue Jun 14 21:00:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Accurate data collection is critical to addressing the challenges specific communities face.\n \nYet for far too long, the LGBTQI+ community has been left out of federal data collection.\n \nToday, @OversightDems passed the LGBTQI+ Data Inclusion Act to finally close this data gap.","date":"Tue Jun 14 20:02:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am excited to see @USDA strengthen its partnership with the 1890 land-grant HBCUs. \n\nThese institutions, including Ohio's very own @CentralState87, help expand access to education for millions of students of color and first-generation college students.","date":"Tue Jun 14 19:41:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, we celebrate our nation’s flag, our symbol of the fundamental promises of our democracy: freedom, justice and equality for all Americans.\n\n#Flag Day","date":"Tue Jun 14 17:29:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Heartbreaking. My prayers are with you, your family, and all who knew and loved Gwen, @RepCasten.","date":"Tue Jun 14 01:27:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Great news! Today, @POTUS signed a bill into law to study the creation of a National Museum of Asian Pacific American History and Culture.\n\nI can think of no better way to recognize the many contributions of the #AAPI community to our country.","date":"Mon Jun 13 21:55:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The #EqualPayAct was signed into law 59 years ago today. Despite progress since it’s passage, women still make $0.83 for every dollar earned by men. I will continue to push for passage of the #PaycheckFairnessAct so that we can finally have equal pay for equal effort.","date":"Fri Jun 10 18:22:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"No child should face what Miah and her classmates faced.\n\nAnd no child should have to be so brave as to recount the darkest day of their lives before Congress.\n\nEnough.\nhttps://t.co/2R6eeLxErZ","date":"Thu Jun 09 15:49:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Gun violence is preventable—not inevitable. \n\nThe House just passed a red flag bill that would help temporarily remove firearms from individuals who demonstrate a risk to themselves or others.","date":"Thu Jun 09 15:33:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am excited to announce #OH11's very own Paing Family Asian Grocery has been awarded grant funding through @USDA' Healthy Food Financing Initiative.\n\nThis funding will ensure the Paing Family Grocery can continue to provide fresh, healthy foods in South Akron.","date":"Thu Jun 09 14:29:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Awards like this that support local retailers in underserved communities are exactly why I called for robust funding for HFFI next year along with @RepDwightEvans.\n\nhttps://t.co/R56Au2Xm1A","date":"Thu Jun 09 14:29:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"And the bill includes language supporting the removal of the Cuyahoga River's harmful Gorge Dam.\n\nIt's removal would make the Cuyahoga a free-flowing river for the first time in more than a century, improve water quality, and create new recreational opportunities on the river.","date":"Thu Jun 09 00:27:55 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The bill increases federal cost sharing for the Brandon Road Lock and Dam, a key project that will prevent the spread of invasive species to the Great Lakes.","date":"Thu Jun 09 00:27:55 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House just passed critical federal water legislation.\n\nThe bill includes two key provisions I secured along with @RepTimRyan that will help protect the Great Lakes and Cuyahoga River for generations to come. \n\n🧵","date":"Thu Jun 09 00:27:55 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#BREAKING: The House just passed a gun safety package with 6 key measures:\n\n👉Minimum age of 21 to buy semi-auto weapons\n👉Penalties for straw purchases\n👉Background checks for ghost guns\n👉New safe storage requirements\n👉Ban on bump stocks\n👉Outlaw high-capacity magazines","date":"Wed Jun 08 23:23:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Gun violence is personal for me.\n \nI lost three young Black men from my youth ministry to guns.\n \nTo honor them and the countless lives cut short, it is time for something more than just thoughts and prayers. #EndGunViolence","date":"Wed Jun 08 21:53:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"SNAP is a proven effective anti-poverty program. \n\nAs @HouseAgDems prepares for the next Farm Bill, we must find was to modernize and strengthen the program. https://t.co/hd82sXHenq","date":"Wed Jun 08 21:50:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Hearing the families of the victims and survivors of the Buffalo and Uvalde shootings recount the darkest days of their lives today made plain that it is time for Congress to act.\n\nEnough. https://t.co/YfGbzxFxVU","date":"Wed Jun 08 20:47:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My Northeast Ohio district is no stranger to the pain of the gun epidemic. This year alone, there have been 62 gun deaths in #OH11, including six children under the age of 18. One life lost to gun violence is too many. #EndGunViolence","date":"Wed Jun 08 19:58:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am a gun owner. I am licensed to carry. \n\nAnd I believe we need common-sense gun safety measures.\n\nThis isn't about taking away Second Amendment rights—it is about responsible gun ownership.","date":"Wed Jun 08 18:31:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"There have been more mass shootings than days so far in 2022\n\nToday, I’m joining @OversightDems to hear first-hand from victims’ family members and a survivor of Uvalde, TX and Buffalo, NY. \n\nTune in here: https://t.co/LRs6YjKN1u","date":"Wed Jun 08 14:31:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Raising the age for buying semi-automatic weapons to 21.\n\nBanning high-capacity magazines and bump stocks.\n\nCracking down on gun trafficking and straw purchases.\n\nClosing the ghost gun loophole.\n\nStrengthening safe storage requirements. \n\nALL on the House floor today.","date":"Wed Jun 08 13:33:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Tomorrow, @OversightDems will hear from victims and survivors from Buffalo and Uvalde.\n\nThis hearing will show Americans the tragic toll gun violence is taking on our communities—and why we must pass commonsense gun safety legislation. https://t.co/CzxlPtOrc9","date":"Tue Jun 07 17:53:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I shouldn't have to worry about whether my nieces and nephews will make it home from school\n\nWhether my parents or friends will make it home from the grocery store\n\nWhether parishioners in my community will make it home from worshiping their god at church\n\nEnough is enough.","date":"Tue Jun 07 15:28:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@POTUS proposed and Congress funded ARPA-H, a new science agency to drive breakthroughs in cancer, Alzheimer’s &amp; more. \n\nWith world-class hospitals and higher education institutions, Cleveland is an ideal home for the agency.\n\nRead my letter w/ @SenSherrodBrown &amp; @senrobportman👇 https://t.co/YaKUNIiptK","date":"Mon Jun 06 19:56:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Over 200 mass shootings in the US this year alone. \n\nEnough is enough.\n\nThis week, the House will consider bills to institute red flag laws, raise the purchase age for semi-automatic rifles, strengthen safe-storage requirements, and ban bump stocks and high capacity magazines.","date":"Mon Jun 06 16:32:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Gun Violence Awareness Day—a time to remember the countless lives cut tragically short by guns, from Buffalo and Uvalde to the daily atrocities that occur across America.\n\nIt's long past time to make our schools, our supermarkets, our hospitals, and our communities safer.","date":"Fri Jun 03 18:18:05 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":".@POTUS is right: we should ban assault weapons. \n\nIf we can't do that, let's strengthen background checks. \n\nOr raise the gun purchasing age to 21. \n\nOr enact safe storage laws. \n\nOr pass red flag laws. \n\nBut we must finally do something.","date":"Fri Jun 03 13:40:09 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ford is investing $1.5 billion to assemble new EVs in Northeast Ohio. The investment will support 1,800 new jobs. \n\nI've said it before, and I'll say it again: Northeast Ohio stands ready to lead the American manufacturing comeback.","date":"Thu Jun 02 19:36:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I stopped by @ClevelandClinic’s Main Campus Farmers market with Dr. Bleich, of @USDANutrition.\n\nAlmost all of the vendors accept SNAP benefits, helping to expand access to locally-grown, healthy foods. https://t.co/vUfBRLQetH","date":"Wed Jun 01 17:10:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On Pride Month, we celebrate the resilience, triumph, and joy of the LGBTQ community.\n\nAnd this year, amid a rising tide of anti-LGBTQ laws, we must continue our fight for equality and for protections that ensure every person can be their true self.","date":"Wed Jun 01 14:31:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Great to be at @clevelandclinic’s Langston Hughes Community Health and Education Center this morning for a round table on how we can work together to address hunger in our Cleveland community. https://t.co/wsg0qTmgtY","date":"Wed Jun 01 13:53:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to welcome Dr. Sara Bleich, the Director of Nutrition Security and Health Equity at @USDANutrition, to Cleveland today.\n\nAt the @CleFoodBank, we discussed how Congress and the Administration can work to better support our food banks. https://t.co/HyQL2v25M6","date":"Tue May 31 19:29:20 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Spending the afternoon learning more about the great work @CleFoodBank is doing to feed our friends and neighbors in Northeast Ohio.\n\nThrough a new partnership with @DoorDash, the food bank is delivering fresh produce and shelf-stable food directly to local seniors. https://t.co/BWK5AGYyNI","date":"Tue May 31 18:58:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On this day 101 years ago, a violent white mob attacked Black residents in Tulsa's Greenwood district and burned their homes and businesses.\n\nUnderstanding the full truth about our past—including this dark chapter—is critical to addressing injustices that persist today.","date":"Tue May 31 15:14:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, we offer our immense gratitude to the men and women who made the ultimate sacrifice while fighting to secure our freedoms. \n\nWe owe them all and their families much more than we can ever repay.","date":"Mon May 30 13:23:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"About to join @symonemsnbc. \n\nTune in now!","date":"Sat May 28 20:24:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"New funding from the Bipartisan Infrastructure Law is headed to Ohio to clean up orphaned oil and gas wells in @CVNPNPS.\n\nThis will not only create new jobs but also protect the health of our Cleveland community.\n\nhttps://t.co/l2rkJu5gwZ","date":"Fri May 27 17:12:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Days after I was sworn into Congress, I signed on to a bill to ban assault weapons.\n\nWhy?\n\nBecause no American needs an AR-15 or a high capacity magazine.","date":"Thu May 26 16:29:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I strive to focus on the positive and what we can get done, together.\n\nBut in this moment, let's not mince words.\n\nIt is Republicans who are blocking commonsense gun reform.\n\nStalling a Domestic Terror bill.\n\nSeeking to overturn Roe.\n\nAnd obstructing voting rights legislation.","date":"Thu May 26 15:45:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, two years after the murder of George Floyd, @POTUS is delivering on the promise of meaningful police reform.\n\nThis historic order takes key steps that will improve the safety of our communities and restore trust between police and the people they were sworn to protect.","date":"Wed May 25 22:38:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"True in December. True today.","date":"Wed May 25 19:08:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I agree, @POTUS.\n\nIt's long past time to reinstitute the ban on assault weapons.","date":"Wed May 25 16:12:53 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Two years ago, the world watched in horror as George Floyd was murdered at the hands of police.\n\nIt served as a graphic reminder that discrimination and bias still hold a knee to the neck of justice and equality.\n\n🧵","date":"Wed May 25 15:17:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House has twice passed the George Floyd Justice in Policing Act.\n\nThe bill would ban chokeholds, stop no-knock warrants, reform qualified immunity, combat racial profiling &amp; establish a police misconduct registry.\n\nIt's never too late to turn this moment of agony into action.","date":"Wed May 25 15:17:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@MCLane216 I cosponsor @RepCicilline's Ban Assault Weapons bill (H.R. 1808).\n\nThe House passed the the Bipartisan Background Checks Act (H.R.8) &amp; the Enhanced Background Checks Act (H.R. 1446) on March 11, 2021.","date":"Wed May 25 13:04:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Let me get this right: force women to give birth, but ignore infant &amp; maternal mortality.\n\nDictate a woman's health decisions, but it's not the government's job to ensure prenatal care, child care, preschool, or paid leave.\n\n\"Sanctity of Life,\" but block action on gun violence.","date":"Fri Dec 03 18:41:12 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"10 innocent Americans last week in Buffalo. \n\n19 children and 2 adults yesterday in Texas. \n\nMore than 17,000 gun deaths so far in 2022, many of which hardly make the news.\n\nAs @TheAmandaGorman said: \"do[ing] nothing isn’t just insanity—it’s inhumanity.\"","date":"Wed May 25 12:55:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@ERosson1982 The Charleston Loophole is a flaw in the background check system that allows gun purchases to move forward after three business days, even if a background check has not been completed. \n\nYou can read more about @WhipClyburn's bill to close it here: https://t.co/G6LI5OgKXO.","date":"Wed May 25 12:46:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Don't tell me we can't do something—anything—to prevent these senseless killings. \n\nBan assault weapons. Institute universal background checks. Close the Charleston Loophole. \n\nI refuse to accept the status quo as normal.","date":"Wed May 25 12:41:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am horrified and heart broken by the shooting at Robb Elementary School in Texas.\n\nI am also angry. Angry that 14 children—14 innocent children—and their teacher lost their lives to gun violence that we have the power to do something about.\n\nEnough is enough.","date":"Tue May 24 21:50:12 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"A good and faithful public servant, Bill Denihan devoted his life to improving the lives of all people in our Cleveland community.\n\nHis legacy will live on through the countless lives he touched.\n\nSending my condolences to his wife, Mary, and his family.\nhttps://t.co/M9ygvMaWNn","date":"Tue May 24 13:13:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you, @POTUS, for working around-the-clock to address the infant formula shortage.\n\nWe need to move heaven &amp; earth to get formula back on shelves.\n\nThat's why I am glad the House passed $28 million in emergency funding to address the formula shortage last week.","date":"Mon May 23 20:32:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"High-speed internet, for free.\n\nCourtesy of the Bipartisan Infrastructure Law &amp; @POTUS. \n\nhttps://t.co/zTN2dnvrzr https://t.co/ZymRHTRpYu","date":"Fri May 20 14:55:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"50% of baby formula is purchased using WIC.\n\nAnd 89% percent of WIC participants purchase formula from Abbott, whose closed plant sparked the shortage.\n\nThe House passed a bill yesterday to support low-income families who rely on WIC by improving their access to formula products.","date":"Thu May 19 20:31:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Together with the Infrastructure Law, the COMPETES Act will ensure more goods are made in America and get them to market faster. https://t.co/iCTeOAEDRh","date":"Thu May 19 19:46:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Frustrated by rising gas prices?\n\nSo am I. \n\nToday, the House passed new legislation that would establish the first ever federal law against price gouging by oil and gas companies.","date":"Thu May 19 18:20:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"From the bomb threats targeting HBCUs earlier this year to this weekend’s racist shooting in Buffalo, domestic terrorism is on the rise nationwide. \n\nLast night, the House passed legislation to strengthen the federal government's response to hate-fueled violent extremism.","date":"Thu May 19 12:34:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am extremely concerned that families are struggling to find baby formula.\n\nThis a crisis that Congress can and must address.\n\nToday, I will vote for 2 bills to provide emergency funding to ease the shortage and improve WIC participants' access to formula.","date":"Wed May 18 20:03:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you, @Richmond46, for your service and your tireless work on behalf of the American people.","date":"Wed May 18 19:42:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Yesterday, Greek Prime Minister Kyriakos Mitsotakis celebrated 200 years of partnership between Greece and the U.S. in a joint meeting of Congress. \n\nHis words served as a powerful reminder of why we must strengthen and protect democracy in the face of global threats. https://t.co/2wywJLmYgO","date":"Wed May 18 17:37:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"For 25 years, the @NewDemCoalition has worked to deliver key wins—from the ACA to the Bipartisan Infrastructure Law. \n\nAs a member, I'm proud of the work the New Dems do to cut through gridlock in Washington and deliver real results for the American people.","date":"Wed May 18 17:15:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We used to celebrate infrastructure week.\n\nNow we are celebrating the beginning of an infrastructure decade.\n\nJust 6 months after it was signed into law by @POTUS, the Bipartisan Infrastructure Law has delivered $3B to Ohio to repair roads, bridges, railways and water systems.","date":"Wed May 18 15:27:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Workers need new skills to compete in the modern economy. That’s why I voted for legislation today that will help workers gain the skills they need to access better-paying jobs in high-demand occupations. \n\n#InvestinginWorkers https://t.co/4lmyKmxiWn","date":"Tue May 17 23:16:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Great to sit down with @UAW representatives from Northeast Ohio today.\n\nWe talked about why Congress must pass the #PROAct to protect and strengthen workers’ right to organize. https://t.co/L9ifOhtw0E","date":"Tue May 17 17:01:15 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@kimtfiu I had the same reaction!","date":"Tue May 17 15:50:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to Nina Harvey, of Bedford Heights High School, for winning this year’s grand prize in the 2022 #OH11 Art Competition!\n\nHer impressive charcoal drawing titled, “Seventeen,\" will be on display in the Capitol for visitors across the country to see. https://t.co/8rx5SkXmPt","date":"Tue May 17 15:40:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Roe vs. Wade is about more than just reproductive health care. \n\nIt is also about our rights and our freedoms.","date":"Tue May 17 14:42:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today marks the 68th anniversary of the Supreme Court's Brown v. Board of Education decision.\n\nThe decision ended legal segregation in education, yet public schools remain separate and unequal for many students.\n\nIt is long past time to fulfill the promise of equity in education. https://t.co/BRgEPNQ5Oi","date":"Tue May 17 13:13:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cutting costs and preventing profiteering–this is how we get prices under control and put money back in people's pockets. https://t.co/gzaPiHOLVc","date":"Mon May 16 21:50:19 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Great news, @RepMarcyKaptur! \n\nI look forward to working with you on the Ag Committee to support Ohio's farmers in rural and urban communities and ensure no American goes hungry.","date":"Mon May 16 15:06:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am horrified by the shooting in Buffalo—and disgusted by its apparent motivation.\n\nHatred, racism and bloodshed are all on the rise. \n\nBut let’s be clear: they have no place in our great nation.\n\nMy prayers are with the victims, their families, and the entire Buffalo community.","date":"Sun May 15 14:42:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Community Services Block Grant program has a clear goal: Reduce poverty, regardless of cause or condition. \n\nToday, I voted to deliver more resources to the local organizations in our community who are delivering on this goal.","date":"Fri May 13 19:49:52 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#ProtectRoe https://t.co/vhiPiRNjUk","date":"Fri May 13 17:27:26 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to Evelyn Zhang of Beachwood High School for being recognized as a 2022 U.S. Presidential Scholar!","date":"Fri May 13 14:32:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am so grateful for our teachers who prepare the next generation for success and who have carried our students forward despite the difficult last 2 years. https://t.co/uBjuEUltuP","date":"Fri May 13 13:54:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@SteveLuttner $1 million of this funding will go to @NOACA_MPO to clean up sites across Northeast Ohio, including in Cleveland.","date":"Thu May 12 21:36:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Roe vs. Wade has been the law of the land for 50 years. \n\nWe must keep it that way.","date":"Thu May 12 21:29:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Ohio will receive $6 million this year to restore polluted and contaminated sites, many of which are located in Black neighborhoods.\n\nhttps://t.co/BuWnbuMfoR","date":"Thu May 12 21:25:58 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"A heartbreaking milestone: 1 million American lives lost to COVID-19.\n\nMothers and fathers, siblings and friends, neighbors and colleagues—more than a statistic, each death marks a soul who was deeply loved and will be forever missed.\n\nToday, we remember all those we have lost.","date":"Thu May 12 17:37:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"For more information and to apply, visit: https://t.co/zTN2dndQaR.","date":"Thu May 12 13:53:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Access to high-quality internet is not a privilege in today’s day and age—it is a necessity and a right.\n\nThanks to the Affordable Connectivity Program and @POTUS' new partnership with internet providers, millions of Americans can gain internet access for no cost. https://t.co/RwN6WKRLKF","date":"Thu May 12 13:53:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today’s failed vote in the Senate is upsetting to say the least.\n\nBut I won’t give up on the fight to ensure a woman’s health decisions are hers—and hers alone. https://t.co/qPgzkZEGUS","date":"Wed May 11 20:48:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Close the Meal Gap, introduced by @RepAdams, would raise the baseline benefit for all SNAP households and increase access to the program. \n\nMeanwhile, @RepBarbaraLee' Improving Access to Nutrition Act would eliminate SNAP’s arbitrary three-month time limit.","date":"Wed May 11 15:39:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Far too many Ohioans are still struggling to make ends meet at the same time food prices are on the rise.\n\nNow is not the time to cut back emergency food assistance.\n\nThat is why I support 2 bills here in Congress to boost and expand SNAP benefits.\n\n🧵\nhttps://t.co/ArB1RCUJQI","date":"Wed May 11 15:39:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"America continues to stand with the people of Ukraine.\n\nLast night, the House passed a bill to provide an additional $40 billion in security, humanitarian, and economic assistance for our brother and sisters fighting for Democracy in Ukraine.","date":"Wed May 11 13:04:33 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Every worker in America should have the right to organize for livable wages, decent benefits and better working conditions—and that includes right here in Congress. \n\nI just supported a resolution that recognizes Congressional workers’ right to organize.","date":"Wed May 11 01:11:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"https://t.co/UHFuvWCLGQ","date":"Tue May 10 23:23:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to Dr. Lisa Cook on her confirmation to become the first Black woman to serve on the Federal Reserve board!","date":"Tue May 10 23:21:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Just got back for another busy week in Washington, and my office looks a little different! https://t.co/aSVMhyDrTL","date":"Tue May 10 19:53:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Decisions about a woman's body are deeply personal. \n\nThey should not be controlled by politicians. https://t.co/QefnbMEKes","date":"Tue May 10 18:48:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Every person—no matter where they live, how much money they make, or what they look like—has the right to make their own decisions about their health, life, and future.","date":"Mon May 09 22:04:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to @NASAglenn Director @MarlaperezD  on her retirement after nearly four decades of service at Cleveland's Glenn Research Center. \n\nThank you for all you have done to advance @NASA's mission and Ohio’s leadership in aeronautics.","date":"Mon May 09 19:09:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Bipartisan Infrastructure Law created a new program to provide $30/month internet discounts to eligible Americans.\n\nNow, @POTUS has secured commitments from 20 internet providers to offer $30 plans, making internet effectively free for millions.\n\nhttps://t.co/zTN2dndQaR","date":"Mon May 09 18:07:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Hypocrisy (noun):","date":"Mon May 09 15:14:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Each year on the second Sunday of May, we take time to honor the love, strength, wisdom and sacrifice of our mothers.\n\nTo my mom, Rikki, and to all Mothers, Happy Mother’s Day!","date":"Sun May 08 12:45:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"From engineering and business to public service and journalism, all professions depend on our teachers. \n\nThis #TeacherAppreciationWeek, I'm thinking of the teachers who made a difference in my life—and all the teachers inspiring and educating students each and every day.","date":"Fri May 06 15:24:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"🎉 Congratulations @KJP46!","date":"Thu May 05 21:59:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was a pleasure to tour @therealDavisAM this afternoon with @SecretaryPete.\n\nWith a focus on STEM and unique offerings like a fabrication lab and flight simulator, the school prepares students for careers in the aviation and maritime industries. https://t.co/j0GeOgOd7e","date":"Thu May 05 21:36:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I couldn’t agree more, @SecretaryPete.\n\nThe Bipartisan Infrastructure Law will expand access to public transit here in Cleveland, and the Transportation Innovation Center will ensure we have the workers to make that vision a reality.","date":"Thu May 05 18:52:26 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Great to welcome @SecretaryPete to Northeast Ohio today.\n\nFirst stop: @TriCedu’s Transportation Innovation Center, where they are offering critical workforce training opportunities across rail, bus, and freight in partnership with @GCRTA. https://t.co/DbgcC4nb4L","date":"Thu May 05 18:19:52 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ohio's nearly 1 million small businesses are the foundation our economy, employing nearly half of all workers statewide. \n\nIn Washington, I’m working to ensure they have the resources they need to recover, rehire, and regrow. \n\n#SmallBusinessWeek","date":"Thu May 05 09:38:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Election Day is here in Ohio!\n\nPolls are now open until 7:30 p.m.\n\nFind your polling location here: https://t.co/6T9nF2i40R","date":"Tue May 03 13:43:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Overturning Roe would destroy decades of settled law and be catastrophic for women, including in Ohio where the legislature is considering new abortion bans.\n\nIt’s time to protect a woman’s right to choose.\n\nThe Senate must codify Roe by passing the Women’s Health Protection Act.","date":"Tue May 03 02:33:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"As Ramadan comes to a close, I would like to wish a joyous Eid al-Fitr to the Muslim community in #OH11 and around the world. \n\nI hope this holy month has brought you peace and togetherness. \n\nEid Mubarak!","date":"Mon May 02 16:26:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"May is Asian American Pacific Islander Heritage Month. \n\nThis is a time to celebrate the AAPI community's many contributions across culture and science, arts and public service.\n\nAnd it is a time to reaffirm our commitment to stand against anti-Asian violence and hate.","date":"Sun May 01 17:01:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"For generations, Jewish Americans have played an integral role in shaping each chapter of the American story.\n\nThis Jewish American Heritage Month, we honor their contributions and celebrate our Jewish brothers and sisters who make Ohio—and our great nation—stronger.","date":"Sun May 01 16:51:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Dr. Lisa Cook's distinguished career as an economist and years of public service make her extremely qualified to serve on the @federalreserve Board.\n\nI join my @TheBlackCaucus colleagues in calling for her swift Senate confirmation.","date":"Wed Feb 16 19:06:09 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Let me get this right: force women to give birth, but ignore infant &amp; maternal mortality.\n\nDictate a woman's health decisions, but it's not the government's job to ensure prenatal care, child care, preschool, or paid leave.\n\n\"Sanctity of Life,\" but block action on gun violence.","date":"Fri Dec 03 18:41:12 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Generations ago, President Roosevelt’s lend-lease program helped our allies defend democracy in Europe.\n\nToday, the House passed a new Lend-Lease Act to speed up the delivery of arms and supplies to Ukraine.","date":"Thu Apr 28 20:35:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Safe workplaces are a right—not a privilege. \n\nThis #WorkersMemorialDay, I am honoring all who have lost their life on the job and fighting to ensure every worker has safe and decent working conditions.","date":"Thu Apr 28 16:24:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Our economic recovery remains resilient.\n\nBy reducing prescription drugs prices and child care costs and making more goods here in America, we can continue to grow our economy and cut costs for working families.\nhttps://t.co/5jlYXOWHw0","date":"Thu Apr 28 15:40:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Like those who first erected the Kol Israel Foundation Holocaust Memorial (@kol_israelcle) six decades ago, we must continue to honor the memory of the Jewish victims who endured unimaginable pain, suffering and loss during the Holocaust.","date":"Thu Apr 28 13:59:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to @RepBeatty, @RepMarcyKaptur, @RepBalderson, @RepTimRyan, @RepDaveJoyce, @RepMikeCarey, &amp; @RepAGonzalez for their support in the House, and to @SenSherrodBrown &amp; @senrobportman for introducing a companion bill in the Senate.","date":"Thu Apr 28 13:59:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I'm introducing a bill to recognize this site as a national memorial.\n\nThis will ensure future generations understand the true legacy of this dark chapter of history and serve as a reminder that we must stand against rising antisemitism today.","date":"Thu Apr 28 13:59:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On Yom HaShoah, we remember the 6 million Jewish victims whose lives were cut tragically short by the Nazi regime.\n\nWe also honor the survivors who found refuge across the U.S., including in NE Ohio where they dedicated a memorial in Bedford Heights to all who perished.\n\n🧵","date":"Thu Apr 28 13:59:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am so excited that Marisa Darden has been confirmed to become the next U.S. Attorney for the Northern District of Ohio. \n\nSmart, experienced, and dedicated to public service, she will break barriers by becoming the first Black woman to serve in the role.","date":"Wed Apr 27 23:12:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"April is Minority Health Month.\n\nDiabetes, heart disease, maternal health, lupus—many health conditions take a larger toll on minority communities.\n\nProud to support @RepRobinKelly's Health Equity and Accountability Act to ensure everyone has access to affordable, quality care.","date":"Wed Apr 27 13:02:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cutting costs for families. Combatting Putin’s price hike. Creating more goods in America. \n\nRead my latest on how we get prices under control and put money back in Ohioans’ pockets.\nhttps://t.co/5jlYXOWHw0","date":"Wed Apr 27 12:07:49 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Antisemitic incidents hit all time highs in Ohio and across America last year.\n\nThis is beyond troubling.\n\nWe can and must do more to combat antisemitism, whenever and wherever it arises.\n\nThat includes strengthening and expanding the Nonprofit Security Grant Program.","date":"Tue Apr 26 23:43:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congress has delivered $13.6B in humanitarian, military and economic support for the people of Ukraine.\n \nThis week, the House will consider the Ukraine Democracy Defense Lend-Lease Act, which would allow @POTUS to more efficiently send weapons and supplies to Ukraine.\n\n🇺🇦🇺🇦🇺🇦","date":"Tue Apr 26 22:53:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"As my colleague @BillPascrell would say, that's the #BidenBoom.","date":"Tue Apr 26 13:53:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Nearly 135,000 jobs have been created in Ohio under @POTUS. \n\nAnd the Bipartisan Infrastructure Law will put even more Ohioans to work rebuilding our roads, bridges, rails, and water systems.","date":"Tue Apr 26 13:51:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Calling all #OH11 students!\n\nThis Thursday, April 28, is the deadline to enter our 2022 Congressional Art Competition. \n\nFor more information, visit: https://t.co/SQmjfeThw9 https://t.co/ex7ahaBOKA","date":"Mon Apr 25 17:01:58 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"No student should have a target on their back, be silenced, or face harassment and abuse.\n\nProud to support @RepMarkTakano's resolution recognizing today as National Day of Silence and reaffirming our commitment to stand with the LGBTQ community against hatred and discrimination.","date":"Fri Apr 22 18:30:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Two weeks ago. Justice Ketanji Brown Jackson. At the White House.\n\nI won't forget that day any time soon. And I hope you won't either. https://t.co/dmh8ervEa6","date":"Fri Apr 22 16:33:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In 1969, the Cuyahoga River Fire jumpstarted the environmental movement.\n\nWe passed air &amp; water protections. And 10 months later, the first Earth Day was celebrated.\n\nToday, we cannot wait for another tragedy to address climate change and the other threats facing our world.","date":"Fri Apr 22 13:50:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We can and must lower costs for families facing raising prices.\n\nThe House passed legislation to cap cost-sharing for Insulin at $35/month.\n\nBut there is more we can do to put money back in people’s pockets, including raising the minimum wage and extending the Child Tax Credit.","date":"Thu Apr 21 17:20:31 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Ohio will receive $214M to reduce pollution from transportation and reduce commute times.\n\nThis funding will help to expand public transit, invest in EV charging, improve the flow of traffic, and expand pedestrian and cycle trails.","date":"Thu Apr 21 14:58:53 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to Northeast Ohio’s very own Kurt Russell for being named the 2022 National Teacher of the Year!\n\nA history teacher at Oberlin High School, Mr. Russell is dedicated to empowering students and emphasizing a diverse curriculum.\n\nhttps://t.co/YMIrSPYW6B","date":"Wed Apr 20 00:30:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was an honor to host @BrooksLaSureCMS in Cleveland today for a roundtable on maternal and infant health and lead safety with @MayorBibb, @ward6councilman, and local health leaders. https://t.co/NfFdDw78C0","date":"Tue Apr 19 21:17:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Pleased to welcome @BrooksLaSureCMS to @UHhospitals Rainbow Center for Women and Children, where we heard about their community-centered efforts to make health more accessible for local mothers and infants. https://t.co/5MxpULDLb4","date":"Tue Apr 19 16:19:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to attend @CEA_CLV’s @CLEHabitat groundbreaking on Grandview Ave alongside @SecFudge, @MayorBibb, @ward6councilman, and local leaders. \n\nThis new union-built house will change the life of one local family—and continue to revitalize the Buckeye neighborhood in the process. https://t.co/MfFlwTNVpx","date":"Mon Apr 18 21:38:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Just wrapped up a roundtable on lead safety and the Bipartisan Infrastructure Law’s historic investments in removing lead pipes in Northeast Ohio. https://t.co/nw2KLC7c83","date":"Mon Apr 18 16:13:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to be joined by @SecFudge @EPAMichaelRegan, @MayorBibb &amp; @ward6councilman in Cleveland today to discuss efforts to address lead paint and pipe exposure. \n\nFirst, we are hearing from local Cleveland families who have been impacted by this public health threat. https://t.co/gdkvPPQcV4","date":"Mon Apr 18 14:35:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today is the day! The April 18 filing deadline has arrived. \n \nDon't forget to file your 2021 taxes. \n\nVisit https://t.co/5iMtpXu5kz for more information.","date":"Mon Apr 18 13:56:20 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Easter is a wonderful time to share gratitude and spread joy.\n \nFrom my family to yours: Happy Easter! https://t.co/oQ7WLnpbwI","date":"Sun Apr 17 12:16:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"One year ago today, the House passed the Paycheck Fairness Act. \n\nOne year later, closing the gender wage gap is just as important. \n\nWomen make 83¢ for every $1 a man makes—and the gap is even wider for Black, Native and Latina women.","date":"Fri Apr 15 20:52:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Passover is a time of hope and renewal. It is a time to celebrate the strength and resilience of the Jewish community. And it is a time to remember the importance of family and community.  \n\nChag sameach to all those who celebrate in Ohio and around the world. https://t.co/UViPlPrBFp","date":"Fri Apr 15 20:35:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Historic funding is coming to Ohio in 2022 thanks to the Bipartisan Infrastructure Law.\n\n➡️$1.8 billion for roads\n➡️$97 million for bridges\n➡️$71 million for lead pipes\n➡️$259 million for transit\n\nAnd this is only the first round of the Law's five-year investments in our state.","date":"Fri Apr 15 15:05:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing a blessed Good Friday to all who celebrate. https://t.co/4tFQG7Dmuo","date":"Fri Apr 15 13:55:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I applaud the Biden-Harris Administration for its commitment to weave equity into all the federal government does. \n\nFrom education and transportation to health care and housing, it is long past time to address the disparities that have left behind underserved communities.","date":"Thu Apr 14 18:35:12 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to welcome @DepSecBronaugh to Cleveland, where we visited the Rid-All Green Partnership and discussed how we can better support urban farming. \n\nRid-All and the countless other urban farms in our region expand access to healthy food and create jobs for local residents. https://t.co/87UC2xEEC6","date":"Thu Apr 14 16:02:52 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Don't forget: Tax Day is Monday, April 18th.\n\nFile online and before the deadline to ensure you receive the tax credits and refund you deserve quickly this year. \n\nVisit https://t.co/EWUTrkrGlP to learn more.","date":"Thu Apr 14 15:02:58 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Far too many women, especially Black women, die during childbirth. \n\nThat is why I fought to declare racism as a public health crisis in Cuyahoga County.\n\nAnd it is why I support @RepAdams &amp; @RepUnderwood's #Momnibus Act, which would promote the health of Black families.","date":"Wed Apr 13 13:05:37 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Insulin has been around for 100+ years. \n\nYet its cost has tripled in recent years.\n\nThis is not right. \n\nIt's time to cap the costs of insulin.","date":"Tue Apr 12 14:17:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"🚨 ATTENTION OH-11 STAKEHOLDERS 🚨 \n\nThis Friday is the last day to submit community project funding requests.\n\nFor more information and to apply, visit: https://t.co/p200lR6AFy https://t.co/CCkwddo0aQ","date":"Mon Apr 11 19:55:23 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cleveland-native Steve Dettelbach is an excellent choice to head the ATF. \n\nA former prosecutor and respected U.S. Attorney, he has deep experience working with both law enforcement and local leaders to keep communities safe and address crime.","date":"Mon Apr 11 18:32:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ghost guns are guns—full stop. \n\nI'm thankful the Biden Administration has taken action to crack down on these deadly weapons and treat them like every other firearm.","date":"Mon Apr 11 16:41:33 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Calling all #OH11 high school students!\n\nMy office is now accepting submissions for the 2022 Congressional Art Competition. \n\nVisit my website to learn more: https://t.co/SQmjfeThw9 https://t.co/YTStjnvI3s","date":"Mon Apr 11 15:27:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Black women are 3X more likely than White women to die from pregnancy-related causes.\n\nBlack Maternal Health Week is a time to raise awareness of this public health crisis and recommit to addressing health disparities facing Black Women.","date":"Mon Apr 11 13:56:31 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I was so honored to be at the @WhiteHouse today to celebrate the historic confirmation of Supreme Court Justice Ketanji Brown Jackson. https://t.co/LkW6O2m5Sr","date":"Fri Apr 08 18:09:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"\"I'm a woman phenomenally.  Phenomenal woman,\nThat's me.”\n\n—Maya Angelou https://t.co/AIVFOVEF82","date":"Fri Apr 08 13:32:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Just this week:\n\n- @POTUS proposed ACA expansion\n- Postal Service Reform Act signed into law\n- $20.5B in BIL transit funding announced\n- Student loan payment pause extended\n- Bills to ban Russian oil imports &amp; suspend trade relations headed to @POTUS' desk\n- JUSTICE Jackson","date":"Thu Apr 07 20:38:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"JUSTICE Ketanji Brown Jackson.\n\nWhat a truly historic day for Black women and girls—and for Americans everywhere. https://t.co/B3UV983i3B","date":"Thu Apr 07 18:18:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ohio’s nearly 1 million small businesses are critical to our economy. \n\nYet many are still hurting from the pandemic.\n\nThe House just passed the Relief for Restaurants &amp; Other Hard Hit Small Businesses Act to ensure they receive the funding they need to rehire and grow.","date":"Thu Apr 07 16:05:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Black women are supreme. \n\n#confirmKBJ https://t.co/JDb81kduLZ","date":"Thu Apr 07 14:59:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"So honored to be at the White House with @POTUS today as he signed the Postal Service Reform Act into law!\n\nThe bill will ensure the @USPS delivers more reliable service to all Americans, while protecting the benefits of our dedicated postal workers. https://t.co/t9qSWbN3hi","date":"Wed Apr 06 20:51:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Cleveland and Akron will receive $65M and $12M, respectively, to upgrade local transit and address repair backlogs. \n\nThis will make it easier for riders to get to school, work, and our local hospitals, while creating good-paying jobs.","date":"Wed Apr 06 19:09:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am glad the Biden Administration has decided to extend the pause on student loan repayment until August 31, 2022.\n\nThis move will provide much-needed relief to millions of Americans, especially borrowers of color.","date":"Wed Apr 06 14:44:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Let's talk the Affordable Connectivity Program.\n\nCreated by the Bipartisan Infrastructure Law, the program provides those enrolled in SNAP, WIC, Medicaid or the National School Lunch Program with a $30 Internet bill discount &amp; $100 towards a new computer.\n\nhttps://t.co/4G72Trmyua","date":"Wed Apr 06 13:17:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This National Library Week, I would like to thank our libraries and librarians for all they do to support, inform, and connect our communities. https://t.co/U4rgm6zaAf","date":"Tue Apr 05 23:53:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was a pleasure working on this bipartisan bill with you, @RepBalderson.\n\nThe FIND Food Act is a win-win: it helps our food banks get healthy food to families in need, while reducing unnecessary food waste.","date":"Tue Apr 05 18:37:14 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This is BIG! \n\nToday, @POTUS is signing a new order to strengthen the Affordable Care Act. \n\nFixing the \"family glitch\" would lower health care costs for nearly 1 million Americans and help 200,000 uninsured people gain coverage.","date":"Tue Apr 05 18:00:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Electrifying the @USPS fleet will reduce pollution, lead to true energy independence, and create jobs—in Northeast Ohio and across the country. https://t.co/LVpC7NAX3c","date":"Tue Apr 05 17:38:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Insulin should be a life-saving—not a wallet-wrecking—drug. https://t.co/qKVM41Al2e","date":"Tue Apr 05 13:47:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Early voting begins today in Ohio!","date":"Tue Apr 05 13:34:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Russian forces have committed horrific atrocities in Bucha and across Ukraine for the entire world to see. \n\nPutin and those who carried out his orders must be held accountable for this evil and barbaric assault on innocent civilians.","date":"Mon Apr 04 18:10:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"54 years ago, our nation lost an unrivaled leader and moral advocate.\n\nI am thinking of these words from Dr. King's final speech: \"I've seen the promised land. I may not get there with you. But I want you to know tonight, that we, as a people, will get to the promised land.\" https://t.co/fgZ1ZVm4s0","date":"Mon Apr 04 17:25:31 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Judge Jackson will make an outstanding Justice.\n\nIt's time for the Senate to confirm her to the Supreme Court.","date":"Mon Apr 04 15:59:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We need to stop the senseless killings, and we need to pass commonsense gun laws. \n\nThat is why one of the first bills I supported in Congress was the Assault Weapons Ban.","date":"Mon Apr 04 13:26:52 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today is the last day to register to vote in Ohio's May primaries! \n \nCheck your voter registration: https://t.co/Ma4Y3kv8ra\n\nRegister today: https://t.co/O9XvgPSwk3\n\nSpread the word!","date":"Mon Apr 04 13:14:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing members of the Muslim community in Ohio and around the world a blessed and meaningful month of reflection and prayer. \n\nRamadan Mubarak!","date":"Sat Apr 02 01:14:49 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Glad to see @Amazon workers in New York have voted to become the first warehouse to unionize. \n\nWhen unions win, workers win—and America wins. #UnionStrong","date":"Fri Apr 01 16:53:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Decades of failed drug policies have harmed Black communities.  Even today, some serve harsh sentences for marijuana use, while others make millions off the industry.\n\nProud to vote for the MORE Act to decriminalize marijuana and right this historical wrong.","date":"Fri Apr 01 16:39:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Around 8 million jobs have been created in the first 14 months of the Biden Administration.\n\nAnd no—that's not an April Fools' joke.","date":"Fri Apr 01 14:26:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, the House will vote on legislation to decriminalize marijuana and address the racial injustices of the failed War on Drugs.\n\nIt's long past time to get this done.","date":"Fri Apr 01 13:45:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"No person should have to choose between paying rent or buying the insulin. \n\nAnd no person should be forced to skip or ration doses. \n\nProud to support Affordable Insulin Now Act to finally cap the cost of Insulin at $35/month.","date":"Thu Mar 31 22:27:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I'm glad @POTUS has authorized the release of more oil from our strategic reserves. \n\nThis will help to bring down gas prices that continue to rise due to President Putin's war in Ukraine.","date":"Thu Mar 31 18:21:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House will vote today on a bill to cap insulin at $35/month because... it's the right thing to do. \n\nAnd it's long overdue.","date":"Thu Mar 31 17:56:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Our food banks have done heroic work throughout the pandemic. \n\nBy creating these new incentives, the FIND Food Act will support our food banks as they provide healthy food to families in need.","date":"Thu Mar 31 16:50:23 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"3. And it offers a new tax credit, instead of the existing tax deduction, for food donations made by farmers.","date":"Thu Mar 31 16:50:23 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This bipartisan bill that I introduced with @chelliepingree, @RepFredKeller &amp; @RepBalderson would make it easier for farmers and suppliers to make donations to food banks and other non-profit organizations by expanding tax credits and tax deductions.","date":"Thu Mar 31 16:50:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The bill does three things: \n\n1. It allows the enhanced tax deduction for food donation to be used for donations to non-profit grocery stores and social supermarkets.","date":"Thu Mar 31 16:50:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Rising food prices are pushing more families to food banks at the same time food donations are on the decline. \n\nThat's why I am introducing the FIND Food Act today to create new incentives for farmers and food suppliers to donate food.\n\n🧵","date":"Thu Mar 31 16:50:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"2. It creates a tax deduction to cover transportation costs for donated foods, especially important in light of rising fuel costs.","date":"Thu Mar 31 16:50:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On Transgender Day of Visibility, I am celebrating the courage and resilience of trans people in Ohio—and everywhere.\n\nI see you. You belong. And our laws must reflect that. \n\n#transdayofvisibility","date":"Thu Mar 31 14:58:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am saddened and horrified by the recent surge of terrorist attacks in Israel.\n\nMy thoughts are with the families and loved ones of the victims.\n\nWe must stand with the people of Israel as we continue to fight terrorism in all its forms.","date":"Thu Mar 31 14:25:34 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"As President Biden said in his State of the Union, it’s time to bury the term \"rust belt.\" https://t.co/yhWsS2y4mN","date":"Thu Mar 31 13:49:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to @POTUS' leadership, the Administration has launched a new site that is a one-stop shop for ordering masks, finding vaccines and tests, and getting the latest COVID information.\n\nhttps://t.co/Ela5CGZkYU","date":"Wed Mar 30 13:32:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy Wednesday!\n\nThe House will vote this week on legislation to cap the cost of insulin at $35.\n\nIs anyone else excited?","date":"Wed Mar 30 13:07:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was an absolute pleasure to sit down with the @ne0liberal podcast to discuss my first few months in office and—yes, you heard that right—how Congress is actually getting things done.\n\nListen in!","date":"Wed Mar 30 13:03:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"No American should struggle to make ends meet after a lifetime of work. \n\nProud to vote for the Securing a Strong Retirement Act to make it easier for workers to save for retirement.","date":"Tue Mar 29 22:50:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I just got back from the White House, where @POTUS signed the Emmett Till Anti-Lynching Act into law.\n\nToday, we are finally—finally—righting this historic wrong. https://t.co/oiHQRVslT8","date":"Tue Mar 29 21:12:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@DidiFriendco @OversightDems Yes! You can follow her at @povertyscholar","date":"Tue Mar 29 18:14:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Black and Brown Americans are the most likely to lack health insurance—and the most likely to fall into medical debt.\n\nAt an @OversightDems hearing today, I focused on how achieving universal health coverage would help to reduce racial health disparities. https://t.co/a1YTH91psd","date":"Tue Mar 29 17:44:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations, @RepBarbaraLee, on your incredible and historic address to the @UN General Assembly marking the abolition of slavery and the transatlantic slave trade.\n\nUnderstanding the truth about our history is the only way we can heal and address injustice today.","date":"Tue Mar 29 17:29:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The best way to help families keep up with rising prices is by lowering their costs. \n\nThat means extending the Child Tax Credit, cutting drug prices, and raising the minimum wage. \n\nAnd we can do so by ensuring billionaires pay their fare share.","date":"Tue Mar 29 15:34:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Florida's shameful new #DontSayGay law will only serve to hurt children.\n\nI will always stand firmly with the LGBTQ community, including by fighting for passage of the #EqualityAct to secure long overdue protections for LGBTQ Americans.","date":"Mon Mar 28 21:28:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"If the budget is a statement of values, @POTUS has made clear the value he places on working families and vulnerable Americans.\n\nHis budget calls for action to cut the costs of health care, prescription drugs, child care, and housing.\n\nThat's called building a better America.","date":"Mon Mar 28 16:03:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Our crumbling roads are a safety hazard—plain and simple. This is just another reason why I was proud to support the Bipartisan Infrastructure Law. The bill will help to repair and replace the 20,000 miles of road in Ohio in poor condition.\nhttps://t.co/6l33wuqeSt","date":"Fri Mar 25 20:22:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Yesterday, I held a press conference with labor leaders and postal workers to champion passage of the Postal Service Reform Act. This bill will provide our Postal workers with the pay and benefits they have earned, while ensuring USPS delivers the most reliable service. https://t.co/87YkiGSr4O","date":"Fri Mar 25 17:06:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Experienced. Brilliant. Principled. Graceful in the face of outrageous attacks. \n\nThis week, America saw just how qualified Judge Jackson is for the Supreme Court. #ConfirmJudgeJackson","date":"Fri Mar 25 13:55:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I stopped by the @Starbucks in Cleveland Heights to show my support for the local workers trying to unionize.\n\nI will always stand in solidarity with workers fighting for fairer schedules, higher pay, and better benefits. #UnionStrong https://t.co/o7idQooDAM","date":"Thu Mar 24 19:10:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Raise. The. Wage. \nhttps://t.co/L1Y7pXaLFL","date":"Thu Mar 24 18:12:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What a pleasure to sit down with #OH11 constituents this morning for my new event series, Coffee with the Congresswoman.\n\nHave a question you'd like to ask me? Register for my next event here: https://t.co/OHxiudCNMP https://t.co/Bym7mWDRpc","date":"Thu Mar 24 16:47:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Looking forward to watching my sister and @TheBlackCaucus Chair @RepBeatty testify on her support for Judge Ketanji Brown Jackson’s nomination to the Supreme Court!","date":"Thu Mar 24 13:51:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"So great to join @ABCGMA3 today to discuss the Child Tax Credit, the House-passed #CROWNAct, &amp; Judge Jackson’s historic nomination to the Supreme Court.","date":"Wed Mar 23 23:21:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"President Obama signed the Affordable Care Act into law on this day 12 years ago.\n\nThe ACA expanded access to coverage for millions, lowered health care costs, and protected Americans with pre-existing conditions.\n\nToday, we must build on its success by expanding access to care.","date":"Wed Mar 23 20:49:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"A barrier-breaking stateswoman and respected scholar, Madeleine Albright blazed a trail in U.S. foreign policy that countless other women will follow for generations to come.  \n\nMy prayers are with her family and friends.","date":"Wed Mar 23 19:18:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Excited to join @ABCGMA3 today!\n\nCatch my interview at 1 PM ET. https://t.co/Ea3DRBcJnk","date":"Wed Mar 23 15:20:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Who else is ready to see Judge Jackson become Justice Jackson?","date":"Wed Mar 23 13:19:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Enough with the shameless racist attacks. \n\nLet’s be clear: it’s time to right history with an exceptionally well qualified, intelligent and accomplished Black woman of unquestionable integrity and character.","date":"Tue Mar 22 22:04:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Fifty years ago, the #EqualRightsAmendment was passed by the Senate and sent to the states for ratification.\n\nIt’s past time to enshrine gender equality into the constitution. #ERA50","date":"Tue Mar 22 16:32:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Good morning. \n\nJust a reminder that this is Judge Jackson's fourth time before the Senate Judiciary Committee. \n\nThe last 3 times she appeared—including just last year—she was confirmed with bipartisan support.","date":"Tue Mar 22 13:06:20 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On this day 57 years ago, civil rights leaders began their five-day, 54-mile march from Selma to Montgomery after being turned back on Bloody Sunday. \n\nTheir cause is our unfinished business today: to secure voting rights for all Americans.","date":"Mon Mar 21 20:10:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Source: @washingtonpost","date":"Mon Mar 21 14:55:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Eminently qualified. Highly respected. Unique lived experience. https://t.co/f8hgW0yFGo","date":"Mon Mar 21 14:21:19 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today is truly a historic day—not only for Black women and girls everywhere but for all Americans.\n\nI look forward to supporting Judge Ketanji Brown Jackson throughout her Senate confirmation process and watching her write the next chapter of history by becoming Justice Jackson.","date":"Mon Mar 21 14:07:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I’m glad to hear the Cleveland projectionists have come to a tentative agreement with Playhouse Square. \n\nCongratulations to the members of IATSE Local 160 for standing strong for the rights.","date":"Sat Mar 19 17:00:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I’m deeply saddened to learn of the passing of my colleague, Rep. Don Young.\n\nA tireless fighter for Alaska and an unparalleled public servant, he welcomed me warmly in the short time we served together.\n\nI am sending my condolences to his family, his friends, and all Alaskans.","date":"Sat Mar 19 02:29:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House passed the Dream and Promise Act to finally provide Dreamers with a pathway to citizenship one year ago today.\n\nIt's time to get this bill across the finish line because home is here.","date":"Fri Mar 18 17:20:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House just passed the CROWN Act to ban hair discrimination once and for all.\n\nI’m reminded of this great exhibit at @MoCaCleveland on the Black experience\n\nThis is Us, Sincerely. https://t.co/re6tLAzemp","date":"Fri Mar 18 14:59:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, @OversightDems held a hearing on the recent bomb threats against HBCUs. \n\nWe must hold those responsible for these attacks accountable.\n\nAnd we must uphold our promise to HBCUs and the students they serve by making long overdue investments in these engines of opportunity. https://t.co/C8B3ZZlSev","date":"Thu Mar 17 20:55:58 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House just voted to suspend normal trade relations with Russia.\n\nThis will further isolate Putin, while we continue to arm and assist the brave people of Ukraine.","date":"Thu Mar 17 19:55:15 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"At 2 million strong, women veterans make up the fastest-growing part of the veteran population.\n\nThis #WomensHistoryMonth, I'm celebrating the women who have sacrificed to keep our country safe. https://t.co/267i84dgSK","date":"Thu Mar 17 18:50:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy St. Patrick's Day! \n\n☘️☘️☘️","date":"Thu Mar 17 16:02:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing our Jewish friends and neighbors in #OH11 and around the world a happy and meaningful #Purim.\n \nChag Purim Sameach!","date":"Thu Mar 17 15:30:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It is time to end hair discrimination in America. \n\nIt is time to pass the #CROWNAct. https://t.co/CIbYTSTIaA","date":"Wed Mar 16 19:07:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The spending bill signed into law by @POTUS yesterday includes $7 million in funding for key projects across #OH11. \n\nI was proud to vote for this bill that will have a direct impact on our Northeast Ohio community. https://t.co/tg1BIIZgwH","date":"Wed Mar 16 17:18:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I am holding in my heart the memories of the 8 people killed in the Atlanta spa shootings one year ago. \n\nLast year, hate crimes against Asian Americans rose by 339%.\n\nWe must continue to stand against hate, racism and violence in all forms. #StopAsianHate","date":"Wed Mar 16 15:22:44 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"One year ago today, @SecDebHaaland was sworn in as Secretary of Interior, becoming the first Native American member to serve as a Cabinet Secretary. Thank you for the work you do to protect our natural resources and public lands—in Ohio and across America. #WomensHistoryMonth https://t.co/gyC4pnFOlc","date":"Wed Mar 16 15:09:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was an honor to listen to President @ZelenskyyUa's moving speech to Congress this morning. \n\nAmerica remains committed to the brave people of Ukraine as they fight for freedom and democracy.\n\n#SlavaUkraine","date":"Wed Mar 16 13:58:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Together with President Biden, @HouseDemocrats are delivering results for the people. https://t.co/c0y1C4NM8J","date":"Tue Mar 15 23:55:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"https://t.co/6gMw7IXWmw","date":"Tue Mar 15 19:01:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What's in the government funding bill @POTUS just signed into law?\n\nReauthorization of #VAWA \n$13 billion in aid for Ukraine\nInfrastructure Law funding\nInvestments in our Great Lakes\n$7 million for projects in #OH11\nAnd much more\n\nDelivering results. For the people.","date":"Tue Mar 15 19:01:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"“Fight for the things that you care about, but do it in a way that will lead others to join you.”\n \nHappy Birthday to the late #RuthBaderGinsburg, a trailblazer and a lifelong champion for equal rights for women.\n \n#WomensHistoryMonth https://t.co/slRhathA1f","date":"Tue Mar 15 15:48:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Record funding for high-poverty schools and students with disabilities. \n\nRecord funding for child care and the Head Start program. \n\nCongress and @POTUS are making historic investments in education and in our future.","date":"Tue Mar 15 14:47:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#EqualPayDay: the day women must work into this year to earn what men made last year.\n\nAnd it will take months for Black, Latina and Native women to catch up.\n\nAll women deserve equal pay for equal work—it's that simple.","date":"Tue Mar 15 12:58:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to announce @GCRTA has received $4 million to upgrade its bus facilities. \n\nThanks to the Bipartisan Infrastructure Law’s historic investment in public transit, we can expect more projects like this in the years to come that will create jobs and strengthen our community.","date":"Mon Mar 14 20:49:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Pell Grants unlock pathways to college for millions of low-income and first generation students each year. \n\nWe just raised the maximum Pell Grant by $400/year—the largest increase in a decade.","date":"Mon Mar 14 17:17:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"One year ago today the House passed two bills to close the Charleston loophole and require universal background checks. It’s time for the Senate to pass these bills and bring us one step closer to ending the gun violence.","date":"Fri Mar 11 21:18:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The American Rescue Plan worked. And the Child Tax Credit worked. \n\nIt lowered child poverty, reduced hunger, and helped countless families make ends meet. \n\nToday would be a good day to renew this critical lifeline.","date":"Fri Mar 11 19:21:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Good morning. \n\nJust this week, Congress sent legislation to @POTUS' desk to reauthorize VAWA, make lynching a federal hate crime, save the @USPS, send aid to Ukraine, boost Pell Grants, and launch the President's cancer initiative. \n\nResults—not rhetoric.","date":"Fri Mar 11 16:38:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today marks one year since @POTUS signed the #AmericanRescuePlan into law.\n\nIt got shots in arms and money in pockets.\n\nIt helped schools reopen safely and kept small businesses afloat.\n\nAnd it laid the foundation for the historic growth of the last year.","date":"Fri Mar 11 14:46:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On #HarrietTubmanDay, we honor the abolitionist and freedom fighter who risked her life to save others. We must ensure her legacy lives on. That is why I support the Woman on the Twenty Act that will feature her on the $20 bill. It’s the least our country can do to thank her.","date":"Thu Mar 10 19:51:34 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Last night, the House passed $13 billion in defense &amp; humanitarian assistance for Ukraine and a ban on the importation of Russian oil. \n\nAmerica stands firm with the Ukrainian people 🇺🇸 🇺🇦","date":"Thu Mar 10 14:37:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Here are five reasons I am excited about the spending bill the House just passed https://t.co/aCPCMD6DRk","date":"Thu Mar 10 04:22:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This isn't getting nearly enough attention: \n\nAfter decades of delay, legislation to designate lynching a federal hate crime is headed to the President's desk.\n\nThis is historic—even if it's long, long overdue.","date":"Wed Mar 09 19:54:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"7.4 million jobs created.\n\nFastest economic growth in decades.\n\n5.4 million new small businesses.\n\nWe are stronger this year than we were last thanks to the American Rescue Plan.\n\nAnd we will be stronger next year than we are this year thanks to the Infrastructure Law.","date":"Wed Mar 09 17:20:33 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"You've got mail, @POTUS!\n\nThe Postal Service Reform Act is now heading to President Biden's desk for his signature. \n\nThe bill addresses mail delays, supports postal workers, and ensures Americans receive their mail on time.","date":"Wed Mar 09 16:08:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It is National School Breakfast Week!\n\nSchool meals fight hunger and help students succeed in the classroom.\n\nThat's why one of the first bills I introduced is targeted at increasing access to afterschool meals.","date":"Wed Mar 09 15:46:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House passed the Protecting the Right to Organize Act one year ago today.\n\nI strongly support this bill that ensures workers can stand together to fight for higher pay, stronger benefits, and better working conditions. \n\nWhen unions win, workers win—and America wins.","date":"Wed Mar 09 15:21:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Equitable growth. More Jobs. Better Infrastructure. \n\nThat’s what I call building a better America. https://t.co/dNbhAaNC2v","date":"Wed Mar 09 01:25:28 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The string of recent bomb threats against #HBCUs were cowardly, despicable acts of terror—plain and simple.\n\nProud to cast my vote for @RepAdams resolution condemning these violent threats and reaffirming our support for #HBCUs and their students.","date":"Wed Mar 09 00:40:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This International Women’s Day, I’m thankful for two strong, inspiring women who have made a difference in my life: my mom Rikki and my mentor @SecFudge. \n\nWho are you thankful for today? https://t.co/qPn1gbTjiH","date":"Tue Mar 08 22:10:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, transit agencies in #OH11 can compete for the new $1.5B in  funding to invest in low and zero emission buses. \n\nThis is how we make public transit both equitable and sustainable.","date":"Tue Mar 08 21:57:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This International Women’s Day, we celebrate the achievements, the courage, and the resilience of all women. \n\nToday, I am reminded of these famous words from the late Maya Angelou: “I’m a woman Phenomenally. Phenomenal woman, That’s me.”  #IWD","date":"Tue Mar 08 16:23:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"President Obama reauthorized the Violence Against Women Act on this day 9 years ago.\n\nLast year, the House passed legislation to reauthorize VAWA and strengthen protections for survivors of domestic violence and abuse.\n\nIt's past time for the Senate to act on VAWA.","date":"Tue Mar 08 00:23:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This #NationalNutritionMonth—and every month—I am fighting for a future when no family in America has to wonder where their next meal will come from.","date":"Mon Mar 07 22:14:55 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On this anniversary of Bloody Sunday, we remember the courage of those who marched in Selma to secure the right to vote. The best way to honor the legacy of those brave Americans is to pass the John Lewis Voting Rights Act.  #Selma57","date":"Mon Mar 07 16:29:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"While touring orphan well sites in Cuyahoga Valley National Park this morning, young Ohioans stopped @SecDebHaaland and me. It was a pleasure to speak with two future leaders. https://t.co/z8gEV7EMlm","date":"Sat Mar 05 20:01:52 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Spending my morning with Secretary of Interior @SecDebHaaland at Cuyahoga Valley National Park, touring the orphan well sites—a Great American Outdoors Act #GAOA maintenance funding project. The Act’s $2.6 billion investment nationwide will preserve our public lands. https://t.co/cmHnZmLOuC","date":"Sat Mar 05 16:36:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Through a partnership with Tri-C, GS is paying and connecting interns with local small businesses. Interns gain valuable marketable skills and business owners grow their future workforce.   #GS10KSmallBiz https://t.co/uoKH7eEhgz","date":"Fri Mar 04 23:50:33 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I rounded out my day at my alma mater, Tri-C, with  Goldman Sachs Foundation President, Asahi Pompey, discussing  10K Small Businesses Fellows pilot program and its local workforce development impact.","date":"Fri Mar 04 23:50:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What a productive and exciting day! I am now with the Secretary of the Interior, Deb Haaland, OH Senator Sherrod Brown, and labor leaders discussing ongoing investments from President Biden’s Infrastructure Law. https://t.co/3lyltO1MQe","date":"Fri Mar 04 22:00:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am currently hosting USDA Undersecretary Xochitl Torress Small and RD OH State Director Jonathan McCracken in Cleveland! We’re discussing, with other local leaders, our continued partnership to help Ohioans achieve more equitable access to healthy foods.#USDARD https://t.co/8XWAyj8qjb","date":"Fri Mar 04 15:43:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#WomensHistoryMonth: On this day 109 years ago, thousands of women marched in Washington, D.C. – the first mass protest for a woman’s right to vote. We must protect that right for ALL Americans.  That’s why I support the John Lewis Voting Rights Advancement Act.","date":"Fri Mar 04 00:48:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It’s official! We kept our promise to take care of our veterans when they come home.  I joined my colleagues to pass the Honoring our #PACTAct  today, so potentially 3.5 million veterans exposed to burn pits and other toxins can access the care they deserve.","date":"Thu Mar 03 16:43:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#SOTU showed America the strength, experience and compassion of our President and why strong American leadership is critical at home and abroad. #POTUS.","date":"Wed Mar 02 19:33:14 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Howard University is 155 years old today! #HU155!  Support our HBCUs who have given the world many of its greatest leaders and innovators. That’s why I support no more underfunding of HBCUs through the IGNITE HBCU Excellence Act!  #IGNITE!","date":"Wed Mar 02 18:26:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We are the only nation that can be defined by one word: Possibilities.\n\n👏👏👏","date":"Wed Mar 02 03:13:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Shaneice Ball, a mother of three from Cleveland, is my guest for tonight’s #sotu .\n\nShe relied on the Child Tax Credit to pay rent and make ends meet for her family.\n\n@POTUS is right: it’s time to extend this critical lifeline for American families.","date":"Wed Mar 02 02:55:15 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I agree, @POTUS\n\nRaise. The. Wage.","date":"Wed Mar 02 02:46:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Lower prescription drug prices.\n\nCut childcare costs.\n\nExtend the child tax credit.\n\nThat’s how we lower costs for American families. #SOTU","date":"Wed Mar 02 02:42:49 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"People have talked about infrastructure for generations.\n\nLast year we actually got it done.\n\nNo more infrastructure weeks—now it’s infrastructure decade.","date":"Wed Mar 02 02:31:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"🗣","date":"Wed Mar 02 02:29:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I stand on the shoulders of the trailblazing women who came before me.\n\nI am proud to work alongside the record number of women in Congress today to secure fair pay, improve our childcare, and fight for women's equality.\n\n#WomensHistoryMonth https://t.co/7qMw1CKmCM","date":"Wed Mar 02 00:05:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"We are building a better America—and we are building it from the bottom up and the middle out. \n\nThanks, President Biden. #SOTU","date":"Tue Mar 01 23:13:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join my House colleagues in standing in bipartisan support for Ukraine. 🇺🇦 https://t.co/hw5T8z5iWf","date":"Tue Mar 01 21:08:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Emergency Food Assistance Program is critical to fighting hunger.\n\nIt moves food from farms to our food banks and on to the hungry families they serve.\n\nProud to lead a bipartisan letter with @RepJimmyPanetta &amp; @repdonyoung calling for more funding for this program. https://t.co/9zPI77fe7Q","date":"Tue Mar 01 20:44:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Despite more than 200 attempts since 1900, lynching has NEVER been designated a federal crime. \n\nThe House just moved us one step closer to addressing this shameful injustice by passing the Emmett Till #AntilynchingAct.","date":"Tue Mar 01 00:32:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Good Afternoon, @SecFudge!\n\nGreat seeing my friend and mentor at the White House today. https://t.co/nse65artmL","date":"Mon Feb 28 23:14:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to be at the @WhiteHouse today as @POTUS closed out #BlackHistoryMonth by recognizing the many contributions that African Americans have made to our great nation. https://t.co/k64v24ylx2","date":"Mon Feb 28 22:53:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Closing out Black History Month by writing the next chapter. \n\nWhat an important day for our nation.","date":"Fri Feb 25 16:38:12 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I applaud @POTUS' historic nomination of Judge Ketanji Brown Jackson.\n\nJudge Jackson's distinguished career, unparalleled integrity, and lifelong commitment to justice make her extremely well-qualified to serve on the Supreme Court. \n\nTime to make history. #SheWillRise","date":"Fri Feb 25 15:41:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This #PublicSchoolsWeek, I would like to thank the teachers, administrators, and school service workers who make a difference in the lives of our students each and every day.","date":"Thu Feb 24 18:49:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am praying for the Ukrainian people during this unjustified invasion. America and its allies will hold Russia accountable for the destruction and devastating loss of life it will bring. \n\nAmerica stands with Ukraine and with democracy.","date":"Thu Feb 24 14:28:08 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Elijah Cummings often said, “Our children are the living messages we send to a future we will never see.”\n\nWe must ensure every student in America has access to a quality public education that prepares them for a lifetime of success. \n\n#PublicSchoolsWeek","date":"Wed Feb 23 21:27:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Founded in 1915, the Karamu House in Cleveland is the oldest African American theater in the country.\n\nWhile living in Cleveland, Langston Hughes attended classes at Karamu, and he returned throughout his life to have his works premiered at the theater.\n\n#BlackHistoryMonth https://t.co/HxAqwNCSMV","date":"Wed Feb 23 18:50:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"More than 1 in 3 Black mothers say that cost is the biggest barrier to child care.  \n\nBy investing in child care and Pre-K, we can help more families access quality, affordable care. https://t.co/uPCBnnCayv","date":"Wed Feb 23 17:48:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"\"Infrastructure\" can seem abstract, but @neorsd is right: investing in infrastructure does save lives. \n\nYou can count on me for a retweet!","date":"Wed Feb 23 17:18:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I hosted mayors from across #OH11 for a roundtable meeting. \n\nWe discussed the Bipartisan Infrastructure Law, as well as other key policy priorities for Northeast Ohio. https://t.co/BnV2YsO6eh","date":"Tue Feb 22 21:55:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ahmaud Arbery should still be with us. \n\nToday's verdict will not bring him back, but it is another  important step towards accountability and justice.  \n\nMy prayers remain with Mr. Arbery's family and the lives he touched.","date":"Tue Feb 22 20:00:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Russia's escalating aggression in Eastern Ukraine is an unacceptable violation of Ukraine's sovereignty and the rule of law. \n\nI commend the Biden Administration for its swift response and continued efforts to work with our allies to hold Vladimir Putin accountable.","date":"Tue Feb 22 17:55:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"More than 3 million children fell back into poverty after the Child Tax Credit expired in December. \n\nLet's be clear: child poverty is preventable. \n\nCongress must extend the Child Tax Credit.","date":"Tue Feb 22 16:19:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This #PresidentsDay, I am grateful for @POTUS' leadership over the last year.\n \nWe’re creating jobs, rebuilding our outdated infrastructure, restoring our leadership abroad, and so much more.","date":"Mon Feb 21 18:27:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The last time the federal minimum wage was increased in 2009, Boom Boom Pow was topping the Billboard charts.\n\nIt’s well past time to raise the wage to $15/hour.","date":"Fri Feb 18 20:16:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What an honor it was to join President Biden in Ohio yesterday as he announced the Infrastructure Law's $1 billion investment in cleaning up our Great Lakes. \n\nIn Cleveland, this will mean addressing historic contamination of the Cuyahoga River and improving its water quality.","date":"Fri Feb 18 17:46:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"All-Star Weekend is officially here in our All-Star city. \n\nLet's have a great—and safe—weekend, Cleveland. \n\n#ALLSTARWEEKEND","date":"Fri Feb 18 16:36:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I usually take my coffee with cream and 2 sugars, but today I'll take it #UnionStrong. \n\nStanding in solidarity with the Starbucks workers organizing across Cleveland.\nhttps://t.co/51cyVwyXGV","date":"Fri Feb 18 14:58:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the thousands of OH-11 constituents who joined me tonight for my third townhall.\n\nWe discussed everything from the Infrastructure Law’s impact on Ohio to the future of the Child Tax Credit. https://t.co/vdBv0x8dhJ","date":"Fri Feb 18 00:13:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happening soon ⬇️","date":"Thu Feb 17 22:15:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"At 6PM this evening, I will be hosting my third telephone townhall. \n\nYou can register ahead at https://t.co/ezUeQKPWZ3 or call in at 6 PM at 833-946-1545. https://t.co/ykSsr6KNAQ","date":"Thu Feb 17 19:35:31 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you @POTUS for coming to Ohio to talk about how the Bipartisan Infrastructure Law is investing in our workers, our communities, and our future. https://t.co/gFZlwFgbK3","date":"Thu Feb 17 18:42:26 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Looking forward to welcoming @POTUS to Ohio today as he announces $1 billion in infrastructure funding to clean up our Great Lakes.\n\nLess pollution. Safer drinking water. Better roads. More jobs.\n\nThe Infrastructure Law is delivering for Ohio.\nhttps://t.co/L4EGoQxe67","date":"Thu Feb 17 15:04:49 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Bipartisan Infrastructure Law included the single largest federal investment ever in restoring our Great Lakes.\n\nThis $1 billion investment will help clean up pollution across the region, including the Cuyahoga River right here in Northeast Ohio.","date":"Thu Feb 17 14:21:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Want an update on my work in Congress so far? Or do you have a question you'd like to ask me?\n\nJoin me for my third telephone town hall tomorrow at 6 PM. Register now at https://t.co/ezUeQKPWZ3. https://t.co/Fsjk3sb0ac","date":"Wed Feb 16 20:57:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Dr. Lisa Cook's distinguished career as an economist and years of public service make her extremely qualified to serve on the @federalreserve Board.\n\nI join my @TheBlackCaucus colleagues in calling for her swift Senate confirmation.","date":"Wed Feb 16 19:06:09 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This Thursday, I will be hosting my third telephone townhall to update you on my work in Congress and answer your questions. \n\nRegister to attend at https://t.co/ezUeQKPWZ3. https://t.co/bmoDIbD6Uv","date":"Tue Feb 15 14:51:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Big news: More than 10 million people have enrolled in the new Affordable Connectivity Program, which provides internet discounts to low-income Americans. \n\nThis is the Bipartisan Infrastructure Law in action.\n\nMore information: https://t.co/VYZ0j58iMl","date":"Mon Feb 14 20:24:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Four years ago, 17 lives were cut tragically short at Marjory Stoneman Douglas High School. \n\nMy heart is with the Parkland community today, and I stand with the families and survivors continuing to push for common sense gun laws.","date":"Mon Feb 14 17:19:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Oh—and I got my new official headshot!\nhttps://t.co/cjFrVrNX9g","date":"Sat Feb 12 19:12:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In my first 100 days, I've taken to the floor to discuss the Infrastructure Law, call for Senate action on voting rights legislation, and speak on the need to extend the Child Tax Credit. \n\nhttps://t.co/dBhMeICujZ","date":"Sat Feb 12 19:08:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The people of #OH11 have been instrumental to this work across my first 100 days.\n\nI am here to make their voice heard in Washington.\n\nThat's why I've held 2 townhalls and plan to hold my next townhall next week. \nhttps://t.co/YCJOuYxdgU","date":"Sat Feb 12 19:08:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It's also why I am announcing a new event called \"Coffee with the Congresswoman.\" \n\nEach month, I will meet with a small group of constituents to hear about their top priorities. \n\nIf you are interested in attending, please sign up at https://t.co/QINGRb0KSE.","date":"Sat Feb 12 19:08:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I've cosponsored 60 bills, including legislation to:\n\n➡️ Raise the minimum wage to $15\n➡️ Ban assault weapons\n➡️ Allow Medicare to negotiate drug prices\n➡️ Protect the right of public servants to organize\n➡️ Make historic investments in HBCUs\n➡️ Improve access to birth control","date":"Sat Feb 12 19:08:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In December, I received my committee assignments to @HouseAgDems &amp; @OversightDems. \n\nSince then, I've participated in numerous hearings on everything from @USDA's emergency feeding programs to our government's response to the threats of climate change and cyber attacks.","date":"Sat Feb 12 19:08:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Since November 4, I have introduced five new bills. \n\nFor my first bill, I partnered with colleagues from across the aisle to find new pathways to enroll more of our veterans in preventive health programs. \nhttps://t.co/usyZqzXeCT","date":"Sat Feb 12 19:08:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I've also helped pass several bills that await further action in the Senate. \n\nThis includes the John R. Lewis: Freedom to Vote Act, long overdue legislation to protect the right to vote. \n\nhttps://t.co/we3YLEbM1k","date":"Sat Feb 12 18:43:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Just this week, I voted for the Postal Service Reform Act. \n\nWith worsening mail delays in Northeast Ohio and across the country, this bill would improve @USPS operations and ensure Americans receive their mail on time. \n\nhttps://t.co/tMrup6Xc7G","date":"Sat Feb 12 18:43:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I've cast nearly 150 votes across my first 100 days.\n\nThis includes bills @POTUS signed into law, such as legislation to prevent cuts to Medicare, hire more veterans as health workers, and expand in-state tuition to family members of service men and women who died in active duty.","date":"Sat Feb 12 18:43:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Law will also help replace the more than 650,000 lead pipes and service lines across Ohio, guaranteeing access to safe drinking water.  \n\nAnd it will expand access to high-speed internet to the thousands of Northeast Ohio households without it.","date":"Sat Feb 12 18:36:00 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Infrastructure Law is already delivering funding to Ohio is to repair roads, more than half of which in Cleveland have pavement in poor condition. \n\nMillions will go to RTA and Akron Metro to replace outdated vehicles, build new garages and expand services in our region.","date":"Sat Feb 12 18:35:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"When I was sworn in last November, I promised to always put the people first. \n\nHere's how I've been working to deliver results for the people across my first 100 days in office. \n\n🧵","date":"Sat Feb 12 18:35:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Less than 48 hours after being sworn in, I supported House passage of the Bipartisan Infrastructure Bill.\n\nI voted to bring jobs to Northeast Ohio, fix our crumbling roads, improve public transportation, deliver clean water to families, and expand access to high-speed internet.","date":"Sat Feb 12 18:35:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Two weeks later, I was at the White House as @POTUS signed this historic bill into law. \n\nhttps://t.co/pR1L7IqqjH","date":"Sat Feb 12 18:35:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today marks 100 days since I took office. \n\nI am proud of what we have been able to accomplish together. \n\nI look forward to building on this progress over the next 100 days—and beyond. https://t.co/PIYO3yqujd","date":"Sat Feb 12 15:51:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Ohio will receive $20 million this year to invest in EV charging infrastructure.\n\nThis funding will help to accelerate EV adoption, reduce emissions and improve air quality, all while creating good-paying jobs. https://t.co/bCAV4u4Pmh","date":"Thu Feb 10 20:55:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I promised to always put the people of #OH11 first, and that means I want to hear from you! \n\nPlease consider joining me next Thursday for my third telephone townhall. \n\nTo register, visit: https://t.co/ezUeQKPWZ3. https://t.co/b4DKDXAvCX","date":"Thu Feb 10 20:23:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My district has one of the highest rates of childhood poverty in America.\n\nThe Child Tax Credit lifted children out of poverty, lowered hunger, and helped countless families make ends meet. \n\nCongress must extend it. https://t.co/gKo0sYvopQ","date":"Wed Feb 09 17:45:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The @USPS is critical to our country.\n\nYet decades of underinvestment and restrictions have led to reduced service and ongoing mail delays. \n\nI just voted for the Postal Service Reform Act to improve @USPS and ensure Americans receive their mail and deliveries on time.","date":"Tue Feb 08 22:39:19 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The filibuster is not a law—and it's sure not in the Constitution. It’s a tradition that has been misused throughout history to deny civil and voting rights. \n\nWhat is in the Constitution? The right to vote. https://t.co/rIihKjWXre","date":"Thu Jan 13 23:50:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I just introduced my first bill in Congress.\n\nMy bipartisan MOVE Act would help enroll more veterans in preventative health fitness programs. Proud to partner w/ @RepColinAllred, @RepDaveJoyce, &amp; @RepAGonzalez to ensure veterans have access to the best health care we can provide.","date":"Fri Jan 07 13:26:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#NewProfilePic https://t.co/2NBD7WxKwh","date":"Tue Dec 14 14:17:06 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join my colleagues at the White House as @POTUS signed the largest infrastructure bill in generations into law!\n\nI came to Congress to deliver results for the people, and that’s exactly what this bill does. https://t.co/S033DFhmoZ","date":"Mon Nov 15 22:15:40 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I promised to always put the people of #OH11 first, and that means I want to hear from you! \n\nPlease consider joining me next Thursday for my third telephone townhall. \n\nTo register, visit: https://t.co/ezUeQKPWZ3. https://t.co/b4DKDXAvCX","date":"Thu Feb 10 20:23:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"https://t.co/ZLuyAsTA29","date":"Thu Feb 10 14:18:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I took to the House floor yesterday to call for an extension of the Child Tax Credit. \n\nI mentioned Shaneice, a mother of 3 from my district, who said the CTC helped her family make ends meet.\n\nI want to start a thread of what the CTC meant to you ⬇️","date":"Thu Feb 10 14:18:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, the House passed the #GlobalRespectAct to deny visas to those who commit human rights abuses against LGBTQ people. \n\nHate has no place in the United States.","date":"Wed Feb 09 21:56:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My district has one of the highest rates of childhood poverty in America.\n\nThe Child Tax Credit lifted children out of poverty, lowered hunger, and helped countless families make ends meet. \n\nCongress must extend it. https://t.co/gKo0sYvopQ","date":"Wed Feb 09 17:45:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In 1999, Stephanie Tubbs Jones became the first Black woman to represent Ohio in Congress. \n\nBut she didn't just break barriers, she used her voice and her role to fight for justice and equality and to make Cleveland a better place for every person to live and raise a family. https://t.co/2k9Cphp2F4","date":"Wed Feb 09 14:57:09 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Mayor Carl Stokes and Congressman Louis Stokes rose from federally-funded housing to the heights of power.\n\nAs the first Black mayor of a major city and a founding member of @TheBlackCaucus, the Stokes brothers championed progress on civil rights and fought for the poor. https://t.co/xqGxIioAu5","date":"Wed Feb 09 14:54:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Decades later, in 1949, Jean Murrell Capers became the first Black woman elected to Cleveland City Council. \n\nAcross her 10 years on Council and later service as municipal judge, Capers was a steadfast advocate for those who had long been left behind or forgotten in our city. https://t.co/3L1cXGgntW","date":"Wed Feb 09 14:51:35 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"More than a century ago, Thomas Fleming became the first Black man to serve on Cleveland City Council. \n\nCouncilman Fleming helped appoint Black workers to city jobs and secured passage of an ordinance preventing the Ku Klux Klan chapter from marching in Cleveland. https://t.co/h1GejgFi03","date":"Wed Feb 09 14:48:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cleveland has a rich tradition of Black leaders who fought tirelessly for the people they represented.\n\nMy career in public service rests on their shoulders and their contributions. \n\n🧵","date":"Wed Feb 09 14:48:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The House just passed the largest reform of the @USPS in decades. \n\nWhy is that so important? ⬇️\nhttps://t.co/0MepYPSwrk","date":"Tue Feb 08 22:59:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The @USPS is critical to our country.\n\nYet decades of underinvestment and restrictions have led to reduced service and ongoing mail delays. \n\nI just voted for the Postal Service Reform Act to improve @USPS and ensure Americans receive their mail and deliveries on time.","date":"Tue Feb 08 22:39:19 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"When oil companies say they are working towards the goals of the Paris Climate Agreement, they are not being straight with their investors, their shareholders, and the public. \n\nThese misleading pledges worsen pollution and public health, especially in communities of color. https://t.co/1Zce4Sa6XP","date":"Tue Feb 08 18:54:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Shirley Chisholm shattered racial and gender barriers by becoming the first Black woman elected to Congress. \n\nBefore me, it was her.\n\nBefore the record setting number of Black Women in Congress today, it was her. https://t.co/3gwGqCjbEo","date":"Tue Feb 08 17:22:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Public transit agencies in Northeast Ohio will soon get millions to replace outdated vehicles, build new garages and expand services.  \n\nThis is the Bipartisan Infrastructure Law in action. https://t.co/jnh2W62L8B","date":"Tue Feb 08 14:31:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Make no mistake: the Biden agenda is creating jobs, rebuilding our infrastructure, and delivering results for  the people. https://t.co/R8NMs64TuC","date":"Tue Feb 08 13:46:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"After the attack in Colleyville, Texas last month, I called for more funding for this critical program that ensures the safety and security of our synagogues and houses of worship. \n\n(2/2)\nhttps://t.co/4u2IrnEJbJ","date":"Mon Feb 07 13:56:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join @RepColinAllred, @RepBethVanDuyne, \n@RepMondaire, and @RepTedLieu in urging @AppropsDems to increase funding for @fema's Nonprofit Security Grant Program.\n\n(1/2)\n\nhttps://t.co/pet1UQNzNi","date":"Mon Feb 07 13:56:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Outdated infrastructure in Northeast Ohio weakens our economy, threatens the safety of families, and impacts local businesses.\n\nBut thanks to the Bipartisan Infrastructure Law, new projects will make our community a better place to live, work, and raise a family.","date":"Mon Feb 07 13:36:49 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I will always support workers and their right to organize, whether that's at the W. 6th Starbucks in Cleveland or in the halls of Congress.  \n\nI am proud to support Congressional Staff in their efforts to unionize.  #UnionStrong","date":"Fri Feb 04 21:32:10 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My office is in touch with @USPS to determine what is being done to resolve the ongoing mail delays affecting Northeast Ohio. \n\nIn the meantime, if you need assistance with your mail, please reach out to our office at 216-522-4900.","date":"Tue Feb 01 18:50:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The targeted attack on the Jewish Community in Colleyville this weekend once again made clear that antisemitism is a rising threat across this country.\n\nIncreasing funding for the Nonprofit Security Grant Program is one of the critical ways Congress can protect houses of worship.","date":"Tue Jan 18 14:45:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On Rosa Parks Day, I am thinking of these words from the fearless civil rights icon: \"You must never be fearful about what you are doing when it is right.\"\n\nHer legacy of activism and bravery lives on in our struggle to build a more just America. https://t.co/fMiUoFFIbh","date":"Fri Feb 04 18:11:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"467,000 jobs added in January. \n\nLike I was saying:","date":"Fri Feb 04 17:14:55 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to cast my vote for the America COMPETES Act. \n\nThis bill ensures technologies like semiconductors that will drive future growth are developed right here in America, while putting Ohioans to work in good-paying, domestic manufacturing jobs.","date":"Fri Feb 04 16:42:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Port of Cleveland’s tonnage increased significantly in 2021, keeping goods moving across Northeast Ohio and beyond amid a year of supply chain challenges.\n\nThanks to the Infrastructure Law, new projects will help to increase capacity at our ports and make them more resilient.","date":"Thu Feb 03 22:42:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Last year was the greatest year of job creation in our history. \n\nAnd the Bipartisan Infrastructure Law means more jobs—good-paying, union jobs that can't be outsourced—in Ohio and across our nation.","date":"Thu Feb 03 17:52:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I'm participating in an @OversightDems roundtable to hear first-hand from victims of harassment and misconduct within @Commanders and examine how we can better protect ALL workers from harassment and discrimination. https://t.co/cj5GfutOGX","date":"Thu Feb 03 15:55:09 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today marks 152 years since the 15th Amendment was ratified, granting African American men the right to vote.\n\nIt is a right that has been under attack ever since. \n\nToday, I remain committed to protecting every American’s access to the ballot box. #BHM","date":"Thu Feb 03 14:59:53 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am proud to become the newest member to support Medicare for All.\n\nThank you, @RepJayapal!","date":"Wed Feb 02 19:25:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In my first Congressional speech, I said I would fight for a day when no American goes hungry.\n\nAnd I meant it.\n\nThat is why one of my very first bills was aimed at improving student access to school meals.","date":"Wed Feb 02 18:08:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ohio has more lead pipes than all but one other state in the country. \n\nThanks to the Bipartisan Infrastructure Law, we will finally be able to ensure every person, in every zip code in our state, has access to safe drinking water.","date":"Wed Feb 02 16:20:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Let’s be clear: Israel is not an apartheid state.\n\nAny mischaracterizations otherwise attempt to delegitimize Israel, a robust democracy, and will only serve to fuel rising antisemitism.\n\nI will always advocate for a strong U.S.-Israel relationship founded on our shared values.","date":"Wed Feb 02 14:59:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Blessed to join my colleagues on the first day of #BlackHistoryMonth to celebrate the new Maya Angelou quarter!\n\n\"My mission in life is not merely to survive, but to thrive; and to do so with some passion, some compassion, some humor, and some style.\" \n— Maya Angelou https://t.co/48lqKyLkUT","date":"Wed Feb 02 14:49:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"More than 50 percent of the roads in Cleveland and Akron have pavement in poor condition. \n\nThe Infrastructure Law will help to repave roads, reduce commute times, and lower the amount of money drivers pay for car maintenance and repair.","date":"Tue Feb 01 22:14:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I was honored to join local leaders in Cleveland this weekend as @SherwinWilliams marked the start of construction of their new headquarters.\n\nThis project will not only build on the company's 155-year history in our city but also bring tremendous benefits to our communities. https://t.co/7P2oNB8lZP","date":"Tue Feb 01 20:15:23 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My office is in touch with @USPS to determine what is being done to resolve the ongoing mail delays affecting Northeast Ohio. \n\nIn the meantime, if you need assistance with your mail, please reach out to our office at 216-522-4900.","date":"Tue Feb 01 18:50:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy Lunar New Year to all celebrating in #OH11 and around the world.  \n\nMay the #YearoftheTiger bring you courage, peace, and good health.","date":"Tue Feb 01 17:21:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"During Black History Month, we remember that Black history is American history and honor the achievements and trailblazing contributions of African Americans. \n\nFor me, this month is also a time to honor those who came before me and made my service in Congress possible. \n\n#BHM","date":"Tue Feb 01 13:52:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The first Social Security check was issued 82 years ago today.\n\nThis critical program supports more than 64 million Americans and keeps countless people out of poverty. \n\nI'm proud to support Social Security 2100, a bill to strengthen social security for generations to come.","date":"Mon Jan 31 21:58:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My thoughts are with all those injured in the bridge collapse in Pittsburgh today. \n\nThis shows why the Bipartisan Infrastructure Law is so important. It makes the largest investment in generations to repair bridges, including the more than 1,000 in Ohio in poor condition.","date":"Fri Jan 28 16:12:18 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@Ardhen26 I agree. And I am hopeful that the Law’s investment in our bus and rail systems, the largest in generations, will help to improve service and expand access to public transit.","date":"Fri Jan 28 14:03:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Did you drive or take public transportation to work this week?\n\nDid you turn on your faucet to get a glass of water?\n\nDid you open up your computer for school or work?\n\nThe Bipartisan Infrastructure Law will touch the lives of every American.","date":"Fri Jan 28 13:56:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Starting Now ⬇️","date":"Thu Jan 27 22:58:07 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"STARTING SOON: At 6 PM ET, I will be hosting my second telephone townhall to discuss the historic Bipartisan Infrastructure Law.\n\nListen live by visiting https://t.co/ezUeQKPWZ3 or calling 833-946-1545. https://t.co/hS4NCnQkRa","date":"Thu Jan 27 22:34:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today marks 2 years since Virginia became the 38th and final state needed to ratify the Equal Rights Amendment. \n\nI'm proud to support @RepSpeier &amp; @RepMaloney's  new resolution recognizing ratification of the Equal Rights Amendment.\n\n#ERANow","date":"Thu Jan 27 22:17:05 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today is the day!\n\nJoin me tonight at 6 PM for my second Telephone Townhall on how the Infrastructure Law will benefit Northeast Ohio. \n\nRegister at https://t.co/ezUeQKPWZ3. https://t.co/Ye5coKFXpj","date":"Thu Jan 27 18:42:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you, @POTUS, for upholding your commitment to nominating a Black woman to serve on the Supreme Court.","date":"Thu Jan 27 18:22:59 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, on #HolocaustRemembranceDay, we remember the 6 million Jewish victims of the Holocaust and the countless lives that were changed forever by it.\n\nWith antisemitism on the rise, let us reaffirm that hatred, darkness and discrimination have no place here.\n\n#NeverForget","date":"Thu Jan 27 14:32:04 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Around half of all Cleveland children live in poverty. \n\nThe expanded Child Tax Credit helped thousands of families put food on the table, keep a roof over their heads, and pay their bills. That's why I won't stop pushing for an extension of this critical program.","date":"Wed Jan 26 20:30:39 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am grateful for Justice Breyer's years of distinguished service on the Supreme Court. \n\nIn light of his retirement, I fully support @POTUS’s commitment to nominating the first Black woman to the Supreme Court. \n\nIt's time.","date":"Wed Jan 26 18:48:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Want to know how the new Bipartisan Infrastructure Law will impact you, your family and your community?\n\nJoin me for my second telephone townhall this Thursday at 6PM ET. \n\nRegister today at https://t.co/ezUeQKPWZ3 https://t.co/wQsJVDYIRi","date":"Wed Jan 26 14:07:16 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Tax season is officially underway. \n\nIf you received Child Tax Credit advance payments or stimulus payments in 2021, be on the lookout for filing info letters from the IRS. \n\nFor more information ⬇️\nhttps://t.co/itmaPl15Bl","date":"Wed Jan 26 11:52:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"One year ago, President Biden signed an Executive Order that ensured thousands of transgender Americans could once again serve openly in the military. \n\nI thank @POTUS for his leadership, and I will always  advocate for policies that honor the dignity of transgender Americans.","date":"Wed Jan 26 01:11:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"For decades, the Clean Air Act has helped improve the health of Americans, especially those living in minority and low income communities impacted most by air pollution.\n\nI joined 190+ of my Democratic colleagues in urging #SCOTUS to protect every American's access to clean air.","date":"Tue Jan 25 20:23:11 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On this day 50 years ago, Shirley Chisholm became the first woman &amp; African American to run for president—4 years after she became the first Black Congresswoman.\n\nMy career in public service rests on her contributions.","date":"Tue Jan 25 16:57:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The 2022 tax filing season starts today! \n\nWant to speed up the process? File electronically as early as possible and opt for direct deposit. \n \nHere’s more info on how to file ⤵️\nhttps://t.co/WoyfeNBTp9","date":"Mon Jan 24 23:33:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This Thursday, join me for a telephone townhall on how the new Bipartisan Infrastructure Law will invest in repairing roads, bridges, water systems, broadband networks, and more across Northeast Ohio. \n\nRegister now at https://t.co/ezUeQKPWZ3. https://t.co/EOVosJzRos","date":"Mon Jan 24 17:29:31 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On the anniversary of the Roe decision, we cannot forget states across the country have passed laws threatening a woman's right to make her own personal health decisions.\n\nIt's time to codify the protections under Roe v. Wade.\n\nIt’s time to pass the Women's Health Protection Act.","date":"Sat Jan 22 13:33:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Have you ordered your free COVID-19 tests yet? \n\nYou can order 4 tests directly to your home by calling 800-232-0233 or visiting https://t.co/Eh7GliCU7O.","date":"Fri Jan 21 19:38:48 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Civil Rights Act was opposed by a Senate filibuster before it was signed into law in 1964.\n\nThe Voting Rights Act faced multiple obstacles before it was signed in 1965.\n\n This fight to protect the right to vote is far from over.","date":"Fri Jan 21 15:44:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I just voted for the EVEST Act to automatically enroll eligible veterans into VA healthcare services as they transition out of the military. \n\nThis will ensure veterans have immediate access to the best physical and mental health care we can provide.","date":"Thu Jan 20 16:40:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The pandemic has worsened the hunger crisis in America, particularly among Black and Latino Families. \n\nDuring today's @HouseAgDems hearing, I asked @SecVilsack what @USDA is doing to address food waste, a root cause of hunger. https://t.co/jafF0odjGk","date":"Thu Jan 20 15:58:53 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"One year ago, @POTUS &amp; @VP took office.\n\nMore than 200m Americans are fully vaccinated.\n\nA record 6.4m jobs were created.\n\nChild poverty hit the lowest rate ever.\n\nLargest Infrastructure Bill in generations signed into law.\n\nThat is what delivering for the people looks like.","date":"Thu Jan 20 14:32:56 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This is not the end of the road. Today is a new day.\n\nI will not give up on our fight to protect the right to vote.","date":"Thu Jan 20 11:20:58 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The last time the Voting Rights Act was renewed in 2006, every Senate Republican voted for it, including 16 senators still serving in Congress today. And a Republican President signed the bill into law.\n\nProtecting the right to vote wasn’t partisan then—and it shouldn’t be now.","date":"Thu Jan 20 03:40:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I promise to keep fighting for voting rights. Why? Because it’s the right thing to do and because I know that a majority of Americans agree that we must protect the right to vote.\n\nI refuse to lose my sense of hope—and I hope you won’t too.","date":"Thu Jan 20 03:40:47 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I’m disappointed that the Senate didn’t reform the filibuster tonight to protect the right to vote.\n\nYet more than disappointed, I’m frustrated. Frustrated because Senate Republicans continue to stonewall every effort to pass the John Lewis Voting Rights Act.\n\n🧵","date":"Thu Jan 20 03:40:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Here is how the Bipartisan Infrastructure Law is already delivering for Ohio:\n\n$1.8 billion to repave roads and reduce commute times\n$96.7 million to rebuild bridges\n$71 million to replace lead pipes\n\nIt won't be long before shovels are in the ground and cranes are in the sky.","date":"Wed Jan 19 17:15:17 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In 2006, the Senate voted unanimously to renew the Voting Rights Act, and President Bush signed it into law. \n\nProtecting the right to vote wasn't political then—and it shouldn't be now.","date":"Wed Jan 19 16:22:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"You can now get up to four free at-home COVID-19 tests delivered right to your front door! \n\nOrder yours now 👇\nhttps://t.co/Eh7GliCU7O","date":"Tue Jan 18 22:45:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Are you enrolled in or eligible for Medicaid, WIC or SNAP benefits? If so, you probably qualify for a discount on your internet bill under the new Affordable Connectivity Program created by the Bipartisan Infrastructure Law.\n \nSee if you’re eligible: https://t.co/VYZ0j58iMl","date":"Tue Jan 18 19:09:12 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The face of the problems may have changed, but the purpose is the same.\n\nInstead of literacy tests, we have strict ID requirements.\n\nInstead of voter intimidation, we have long lines at the polls.\n\nInstead of poll taxes, we have voter purges.\n\nWe must protect the right to vote","date":"Tue Jan 18 16:47:03 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The targeted attack on the Jewish Community in Colleyville this weekend once again made clear that antisemitism is a rising threat across this country.\n\nIncreasing funding for the Nonprofit Security Grant Program is one of the critical ways Congress can protect houses of worship.","date":"Tue Jan 18 14:45:32 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Dr. King was right: The arc of the moral universe can bend towards justice. But only if we pull it. \n\nRead my latest Op/Ed on why we cannot rest until we protect the essential right to vote.\n\nhttps://t.co/Xce80au09K","date":"Mon Jan 17 22:31:22 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This year, we must honor the life and legacy of Dr. Martin Luther King, Jr. with not just words but action. \n\nThere has never been a more important time to protect the right to vote and fight for justice for all Americans. \n\nWe cannot let this moment pass us by.","date":"Mon Jan 17 13:14:14 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy Founder's Day to the inspiring women of Alpha Kappa Alpha Sorority, Inc! Congratulations on 114 years of service.","date":"Sat Jan 15 18:09:51 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On what would have been Dr. King’s 93rd birthday, we can honor his life and legacy by protecting the right to vote, fighting injustice and inequality, and giving a hand up to those Americans who have too often been left behind. https://t.co/81DzLa7qSb","date":"Sat Jan 15 15:03:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I stand in solidarity with the workers at the W. 6th St Starbucks in Cleveland seeking to become the chain’s first union store in Ohio.\n\nUnion strong.","date":"Sat Jan 15 12:40:29 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I was proud to be joined this morning  by local officials and labor leaders to announce the new $96 million investment in Ohio’s bridges. \n\nThe bridges on Martin Luther King Dr., along with many others across the region, stand to benefit from this critical funding. https://t.co/Vw8OM1zYBR","date":"Fri Jan 14 18:01:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today is the first day in 6 months that millions of families will not receive an advanced Child Tax Credit payment.\n\nThis critical lifeline reduced child poverty and helped countless families make ends meet.\n\nCongress must extend it.","date":"Fri Jan 14 16:27:36 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"https://t.co/uEFbZdEqzf","date":"Fri Jan 14 13:37:26 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"NEWS: Thanks to the Bipartisan Infrastructure Law, Ohio will receive $96 million this year to repair crumbling bridges. \n\nFixing our bridges will lead to safer commutes to school and work and create good-paying, union jobs right here in Northeast Ohio.","date":"Fri Jan 14 13:33:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The filibuster is not a law—and it's sure not in the Constitution. It’s a tradition that has been misused throughout history to deny civil and voting rights. \n\nWhat is in the Constitution? The right to vote. https://t.co/rIihKjWXre","date":"Thu Jan 13 23:50:45 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you to @ClevelandClinic for pledging $50 million to support lead safety initiatives through @LeadSafeCLE. This, combined with the $17 million @CleCityCouncil is committing through the American Rescue Plan, will make our communities healthier and safer.","date":"Thu Jan 13 19:52:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The right to vote is sacred. I couldn't be more proud to cast my vote for the Freedom to Vote: John R. Lewis Act to protect that essential right. \n\nThe time for the Senate to act is now. https://t.co/b6IwtU6YFo","date":"Thu Jan 13 17:45:50 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing a happy Founders Day to the incredible women of @dstinc1913 as you celebrate 109 years of sisterhood, scholarship, and service!","date":"Thu Jan 13 16:57:43 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join my @TheBlackCaucus colleagues today in calling for long overdue action to protect the right to vote.\n\nWe cannot let this moment pass us by. https://t.co/GqOPvRIqEm","date":"Wed Jan 12 23:07:25 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@joseph_pericles The Guard and Reserve GI Bill Parity Act closes eligibility gaps in the Post-9/11 G.I. Bill to ensure that  National Guard and Reserve members accrue the education benefits they have earned for their increased workload.","date":"Wed Jan 12 21:19:21 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"National Guard and Reserve Members have stepped up time and time again to serve our nation, including in response to the pandemic. \n\nThe House just passed the GI Bill Parity Act to ensure these members have equal access to their GI Bill benefits.","date":"Wed Jan 12 20:54:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"President Biden is right. The eyes of history are upon us. \n\nThe filibuster has been misused throughout history to deny civil and voting rights. And it is being used to do so again today. \n\nCongress must pass the John Lewis Voting Rights Advancement Act—by any means necessary.","date":"Tue Jan 11 21:34:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to be back in the Speaker's chair presiding over the House floor! https://t.co/paeTIuY3mW","date":"Tue Jan 11 19:59:15 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I join the entire Cleveland community in mourning the loss and remembering the life of Cleveland Police Officer Shane Bartek.\n\nToday, my prayers are with his family, friends, and fellow officers.\n\nThank you for your service, Officer Bartek.","date":"Tue Jan 11 17:55:57 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to partner with @RepJahanaHayes to introduce my second bill in Congress: the Afterschool Meals Act. \n\nThe bill allows more students to be served by afterschool meal programs, closing the hunger gap many children face between lunch at school one day and breakfast the next.","date":"Tue Jan 11 15:48:27 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Tune in here ⬇️\n\n https://t.co/xXAVxVkSm1","date":"Tue Jan 11 15:04:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cybersecurity is national security.\n \nToday, I'm attending an @OversightDems hearing on strategies to develop a modern, whole-of-government approach to federal #cybersecurity. https://t.co/pP5RpqDiYv","date":"Tue Jan 11 15:04:01 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Just got back to Washington. \n\nFirst priority for 2022? Making sure the John Lewis Voting Rights Act gets to the President's desk. \n\nTime to get to work. https://t.co/TpZ5qZRcro","date":"Tue Jan 11 00:13:30 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Infrastructure Law, Ohio will receive $71 million this year to replace dangerous lead pipes.\n\nThis will go a long way towards tearing up the state’s more than 650,000 lead service lines.","date":"Mon Jan 10 19:34:34 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, Maya Angelou becomes the first Black woman to be featured on a quarter! \n\nCivil rights leader. Poet laureate. College professor. Actress. \n\nMaya Angelou's life and legacy will continue to inspire Americans for generations to come. https://t.co/k0GhQi5hs8","date":"Mon Jan 10 18:33:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Cleveland has a rich tradition of public servants who used their voices, their influence, and their roles to deliver results for the people of our city. \n\nI am honored to serve in this proud tradition along with Cleveland’s newly minted 58th Mayor, Justin Bibb. https://t.co/DJC3QUEcGb","date":"Sat Jan 08 19:49:38 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"A record 6.4 million jobs were created last year. \n\nWe are witnessing a Biden Boom. And it's only going to speed up with the Infrastructure Law.\n\nInfrastructure Investment and Jobs Act? How about the Infrastructure Investment Creates Jobs Act.","date":"Fri Jan 07 18:49:23 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Sidney Poitier was a trailblazer and a longtime civil rights activist. \n\nThrough his unparalleled talent and fierce will, he pushed our nation closer to equality and justice both on the screen and beyond it. \n\nMay he Rest In Peace.","date":"Fri Jan 07 17:22:06 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"At my first townhall last night, constituent after constituent asked about the status of voting rights legislation and the Build Back Better Act. \n\nAmericans are counting on us to get this done.\n\nI’m listening—and I won’t stop fighting for both bills.","date":"Fri Jan 07 14:23:13 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I just introduced my first bill in Congress.\n\nMy bipartisan MOVE Act would help enroll more veterans in preventative health fitness programs. Proud to partner w/ @RepColinAllred, @RepDaveJoyce, &amp; @RepAGonzalez to ensure veterans have access to the best health care we can provide.","date":"Fri Jan 07 13:26:40 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happening now ⬇️","date":"Thu Jan 06 23:03:14 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"HAPPENING TODAY: At 6 p.m., I will be hosting my very first telephone townhall. \n\nTo join: \n📞 Call 833-946-1545\n💻 Visit https://t.co/ezUeQKPWZ3 https://t.co/vf9qZiWrJU","date":"Thu Jan 06 17:54:34 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Struck by these powerful words from President Biden: \"I will stand in this breach. I will defend this nation. And I will allow no one to place a dagger at the throat of democracy.\"\n\nI stand with you, Mr. President, in defense of our democracy. Nothing is more important.","date":"Thu Jan 06 15:36:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, as we honor the brave officers who defended the temple of our democracy and the members, staff, and all working in the Capitol that day, Congress must recommit to taking action to protect the right to vote and safeguard the integrity of our Republic.\n\n3/","date":"Thu Jan 06 13:03:42 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Although I was not a Member of Congress when the violent attack on the Capitol took place on this day last year, I join my colleagues and all Americans in solemn observance of the anniversary of one of the darkest days in our history. \n\n1/","date":"Thu Jan 06 13:03:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Make no mistake: what occurred on January 6 was a direct assault on the Capitol and democracy itself. \n\nYet the threat to our democracy continues. \n\nIn 2021, 19 states passed 34 laws restricting access to the ballot box. \n\n2/","date":"Thu Jan 06 13:03:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The right to vote is an essential, democratic right. \n\nThis isn't controversial, and it certainly shouldn't be partisan.","date":"Wed Jan 05 22:02:02 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This Thursday, I will be hosting my first telephone townhall to discuss my agenda for 2022 and answer your questions. \n\nRegister to attend at https://t.co/ezUeQKPWZ3. https://t.co/jLU5iM5FAa","date":"Tue Jan 04 20:41:54 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"New year. Same mission. \n\nGet Build Back Better and voting rights legislation across the finish line. \n\nTime to get to work.","date":"Tue Jan 04 14:12:41 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congratulations to my friend Justin Bibb for being sworn in as Cleveland’s 58th mayor last night. \n\nI can’t wait to get to work with you over the coming weeks and months to deliver on the promise of a better tomorrow for the great people of Cleveland. https://t.co/LHCkBWbqU6","date":"Mon Jan 03 14:23:46 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy New Year! \n\nHere's to 2022 being a year of new beginnings, happiness and good health for you and yours!","date":"Sat Jan 01 05:05:24 +0000 2022","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In my first speech before Congress, I called for building an economy that puts working people first, fighting for a day when every person has a roof over their head and food on their plate, and protecting the right to vote. \n\nLet's make 2022 the year we do that—and more.","date":"Thu Dec 30 20:04:42 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I want to hear from you!\n\nJoin me next Thursday, January 6 at 6:00 p.m. for my first telephone townhall. \n\nRegister now by visiting https://t.co/ezUeQKPWZ3 https://t.co/zrOPNTy5mG","date":"Wed Dec 29 19:24:24 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Not*","date":"Wed Dec 29 15:20:26 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Bipartisan Infrastructure Law is already delivering for Northeast Ohio. \n\nBut 2022 is when the rubber meets the road. \n\nRead my new Op/Ed in @clevelanddotcom. \nhttps://t.co/LVgUqA6ilj","date":"Wed Dec 29 14:10:29 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am saddened to learn of the passing of Harry Reid, a lifelong public servant who fought tirelessly for those Americans who have too often been forgotten or left behind. \n\nMy deepest condolences to his wife, Landra, his family, and all who knew and loved him.","date":"Wed Dec 29 01:51:01 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Congress can walk and chew gum at the same time. \n\nIt's nor either Voting Rights or Build Back Better. \n\nIt's both/and.","date":"Tue Dec 28 20:01:59 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Here’s the truth: the expanded Child Tax Credit is working.\n\nCTC payments have kept more than 3 million children out of poverty.\n\nWe cannot let this critical program expire.","date":"Mon Dec 27 22:23:39 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Archbishop Desmond Tutu was a fierce advocate for racial justice, a voice for the voiceless and the embodiment of moral courage.\n\nHe lived a life of words and action, standing up to injustice wherever he saw it.\n\nMay he rest in peace, and may his life be an inspiration to us all. https://t.co/bh0MlYWDSN","date":"Sun Dec 26 15:02:39 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing a happy first day of Kwanzaa to everyone celebrating in #OH11 and around the country. \n\nMay we use this time to celebrate our culture and heritage and reflect on how we can strengthen our communities and our common bonds. https://t.co/IFkYh5TlTp","date":"Sun Dec 26 14:19:32 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Merry Christmas! I hope your day is filled with peace, love, and time well spent with family and loved ones.","date":"Sat Dec 25 13:25:07 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am so grateful for my colleagues who have welcomed me with open arms to @TheBlackCaucus. \n\nFrom ours to yours, Merry Christmas and Happy Holidays! https://t.co/1UY8ldnAGv","date":"Fri Dec 24 20:36:29 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This holiday season, I want to give a special shout out to the heroes staffing food banks and delivering meals, the volunteers working at shelters and churches, and the first responders and health care workers keeping our communities safe. \n\nThank you!","date":"Thu Dec 23 15:12:33 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Need to renew your health coverage or shop for a new health plan? \n\nYou can #GetCovered through January 15th by visiting https://t.co/gZaGSov7ag.","date":"Wed Dec 22 21:34:19 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Good news! The Biden Administration is extending the pause on student loan payment until May 1, 2022. \n\nI’m thankful @POTUS has provided major relief for countless Americans as we continue to recover from the pandemic.","date":"Wed Dec 22 18:36:45 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Northeast Ohio is in the midst of another spike in COVID cases. \n\nHow can we get through this together? Wear a mask. Get vaccinated—and your booster if you are eligible.  \n\nNeed to find a testing site near you?  Visit https://t.co/BKSjXs4njt","date":"Tue Dec 21 17:50:45 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I won’t stop fighting for the Build Back Better Act. \n\nFrom investing in childcare and college affordability to reducing the costs of health care and prescription drugs, the bill would cut costs for Ohio families and give them a long overdue shot at getting ahead.","date":"Tue Dec 21 14:47:21 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Ohio will get nearly $1.8 billion in funding in 2022 alone to fill potholes, rebuild roads, and create jobs across the state. \n\nThis is just the beginning of the investments this bill will deliver to our region.","date":"Mon Dec 20 18:50:57 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Access to safe, reliable drinking water is a basic human right, not a privilege. \n\nThanks to the leadership of @POTUS, Ohio will receive $242 million from the Bipartisan Infrastructure Law to upgrade water infrastructure and remove dangerous lead pipes across the state.","date":"Fri Dec 17 16:57:50 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Highway construction in the 1950s and ‘60s demolished homes and businesses and tore apart neighborhoods in Black communities nationwide.\n\nThe Bipartisan Infrastructure Law includes long overdue funding to right this historical wrong and reconnect Black neighborhoods.","date":"Thu Dec 16 21:59:09 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"To protect the right to vote\n\nTo safeguard our democracy\n\nTo honor those like John Lewis who faced down tear gas and billy clubs to secure this essential right\n\nCongress must pass voting rights legislation.","date":"Thu Dec 16 21:10:50 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Make no mistake: climate change is an existential threat to our planet and humanity—and it will hit vulnerable communities first.\n\nInaction is not an option.\n\nTogether, the Bipartisan Infrastructure Law and the Build Back Better Act make historic investments in climate action.","date":"Wed Dec 15 19:52:24 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The final round of Child Tax Credit payments go out to today. \n\nTax cuts for families.\n\nLower hunger rates.\n\nMillions of children lifted out of poverty. \n\nThis is why the Senate must act⬇️","date":"Wed Dec 15 16:42:56 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Islamophobia is on the rise in America and across the world. \n\nWe must make clear that hatred and bigotry have no place here. \n\nThat’s why I just voted for legislation led by @Ilhan and @janschakowsky to create a special envoy to monitor and combat Islamophobia.","date":"Wed Dec 15 04:32:16 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thank you, @senrobportman!\n\nI appreciate your work to get the Bipartisan Infrastructure Law across the finish line, and I look forward to continuing to work with you to deliver results for the people of Northeast Ohio.","date":"Wed Dec 15 02:49:01 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It’s going to be a late night in the Capitol, so let’s talk about why the Senate needs to pass the Build Back Better Act to extend the critical Child Tax Credit. https://t.co/PSOdI4a1iX","date":"Wed Dec 15 02:17:17 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"African American history has been—and always will be—an inseparable part of the story of America.\n\nProud to support @RepBowman's new African American History Act, which invests in @NMAAHC programs and resources that tell the truth about our past. https://t.co/aUBIVuS9iz","date":"Tue Dec 14 21:39:47 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"#NewProfilePic https://t.co/2NBD7WxKwh","date":"Tue Dec 14 14:17:06 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The last Biden Child Tax Credit payments will go out this week to 35 million families. The Build Back Better Act would keep these payments going beyond their Dec. 31 deadline. \n\nWe cannot let children and families down.","date":"Mon Dec 13 18:40:45 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Federal minimum wage has been stuck at $7.25 since 2009.\n\nNo one can cover their basic needs on $7.25/hour—and no one should ever have to try. \n\nThat's why I cosponsored the Raise the Wage Act immediately after entering Congress.","date":"Mon Dec 13 15:05:48 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It's time to codify Roe v. Wade. \n\nIt's time for the Senate to pass the Women’s Health Protection Act.","date":"Fri Dec 10 22:43:31 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Affordable, quality health coverage is available right now through the Open Enrollment period.\n\nSign up for coverage or make changes to your plan at https://t.co/gZaGSov7ag by December 15, 2021 for coverage starting in the new year. \n\nDon’t forget to #GetCovered Ohio! https://t.co/zLlZO8dmM7","date":"Fri Dec 10 14:38:28 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I stand in solidarity with the educators at Menlo Park Academy, a charter school in my district. They have a legally protected right to organize and must be able to do so free from interference.","date":"Thu Dec 09 22:13:30 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Weekly jobless claims just hit a 52-year low.\n\nJobs Up. Wages Up. But our work doesn’t end there.\n\nTogether, the Bipartisan Infrastructure Law and Build Back Better Act will create 2 million good-paying jobs, allow more people to return to work, and bring down costs for families.","date":"Thu Dec 09 14:26:24 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I’ll be joining @Morning_Joe today. Tune in at 7:30 a.m. to watch live!","date":"Thu Dec 09 11:40:45 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"People have talked for years about delivering on infrastructure. \n\nLast month, we actually got it done.\n\nI’m so glad I arrived in Congress just in time to help get this historic investment in roads, bridges, broadband, and drinking water across the finish line.","date":"Wed Dec 08 21:49:08 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"@tify330 My colleague @RepBobbyRush has long fought for the Emmett Till Antilynching Act. \n\nI was proud to cosponsor his bill right after being sworn in to Congress. \n\nThe bill is being marked up by the @HouseJudiciary Committee today 👇\nhttps://t.co/VnnmLK0ize","date":"Wed Dec 08 18:29:15 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, I joined the @NewDemCoalition along with my sister in service @RepNikema. \n\nI look forward to working with this group of solutions-oriented Democrats to advance President Biden’s vision to build back better—and more equitably—than before. https://t.co/5Asw7Sh4Rk","date":"Wed Dec 08 17:58:36 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"There is no doubt that SNAP and food distribution programs played a critical role in addressing hunger during the pandemic. \n\nI look forward to working with my colleagues on @HouseAgDems to ensure no American goes hungry. https://t.co/4csN9DVeNb","date":"Wed Dec 08 17:02:43 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It’s 2021, yet lynching is still—STILL—not a federal hate crime. \n\nI strongly support the Emmett Till #Antilynching Act, because it would make lynching a federal hate crime and begin the process of closing a shameful chapter in our nation's history.","date":"Wed Dec 08 15:25:25 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Follow along here⬇️\n\nhttps://t.co/T35kC2p905","date":"Wed Dec 08 15:10:41 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Excited to attend my first @HouseAgDems Committee hearing this morning!\n\nWe will be exploring the critical role @USDA food distribution programs have played in fighting hunger during the pandemic. https://t.co/LbhnHvWUrh","date":"Wed Dec 08 15:09:52 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I signed on to the Assault Weapons Ban just days after becoming a Member of Congress. \n\nUniversal background checks, red flag laws, assault weapons ban—common sense gun safety measures cannot wait any longer.","date":"Tue Dec 07 22:27:11 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"On this day 80 years ago, the attack on Pearl Harbor changed the course of history.  \n\nOn Pearl Harbor Remembrance Day, we honor the servicemembers who lost their lives that day and commemorate the bravery and sacrifice of those who defended our nation in the days that followed. https://t.co/fvNEJ3GKnZ","date":"Tue Dec 07 22:07:58 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I proudly wore braids at my swearing-in because I want to create space for Crowns of all types to be embraced, while eliminating the racial biases Black women face in the workplace.\n\nIt's also why I support the #CROWNAct, which puts an end to discrimination against black hair. https://t.co/IZcOlh1Yvu","date":"Mon Dec 06 23:47:25 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Let me get this right: force women to give birth, but ignore infant &amp; maternal mortality.\n\nDictate a woman's health decisions, but it's not the government's job to ensure prenatal care, child care, preschool, or paid leave.\n\n\"Sanctity of Life,\" but block action on gun violence.","date":"Fri Dec 03 18:41:12 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Thanks to the Bipartisan Infrastructure Law, Ohio will receive $242 million in 2022 alone to upgrade water infrastructure and remove lead service line pipes. \n\nSafe and reliable drinking water, in EVERY zip code.","date":"Fri Dec 03 17:30:59 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What is the best protection against COVID and the new Omicron variant? Get vaccinated—and get your booster now that everyone over 18 is eligible. \n\nI got mine this week—and so should you!","date":"Fri Dec 03 15:46:39 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I want to set the record straight on the Build Back Better Act, because there are so many things in this bill to be excited about. https://t.co/zltf5B90Os","date":"Thu Dec 02 22:06:40 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"For more information on the bill, visit: https://t.co/mdYniYwiiG","date":"Thu Dec 02 18:46:02 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Classrooms across the country have grown overcrowded, even though we know smaller class sizes help our students succeed. \n\nProud to join with @RepLucyMcBath &amp; @SenJeffMerkley  to introduce the Smaller Class Sizes for Students and Educators Act to set every child up for success.","date":"Thu Dec 02 18:46:01 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I'm attending my first House Committee hearing this morning!\n\n@OversightDems are considering several bills, including legislation to ensure all federal agencies have a climate change adaptation plan in place. https://t.co/6B4mp7boq8","date":"Thu Dec 02 15:28:49 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Rosa Parks took a seat to take a stand against segregation 66 years ago today, changing the course of history. \n\nToday, on #RosaParksDay, we honor her bravery and remember how one person can effect change. https://t.co/1RFSVywrmn","date":"Wed Dec 01 23:14:28 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Honored to preside over the House Floor for the first time as Speaker Pro Tempore! https://t.co/h9WtRz0xYv","date":"Wed Dec 01 21:55:30 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This #WorldAIDSDay, we remember those we have tragically lost to HIV/AIDS. \n\nWe must continue to stand with survivors of HIV/AIDS, who are fighting stigma and discrimination, by recommitting to ending this devastating epidemic.","date":"Wed Dec 01 19:28:01 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today, the Supreme Court will hear a case that could overturn Roe v. Wade.\n\nThough I arrived in the House after it had passed the Women’s Health Protection Act, I strongly support this bill, which ensures reproductive health decisions are made between a woman and her doctor.","date":"Wed Dec 01 14:32:06 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I am honored that @SpeakerPelosi and my colleagues on the Steering Committee have nominated me to serve on @HouseAgDems &amp; @OversightDems. \n\nThese committees provide the perfect opportunity to advance accountability and justice and use my voice to fight for working families.","date":"Wed Dec 01 01:45:47 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Excited to be back in Washington. It’s going to be busy month, from getting the Build Back Better Act across the finish line to protecting our democracy. \n\nTime to roll up our sleeves and get to work.","date":"Tue Nov 30 22:13:10 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Ohio’s infrastructure scored a C- in 2021. That is simply unacceptable. \n\nThe Bipartisan Infrastructure bill will bring billions to our state to repair crumbling roads and bridges, expand public transit, and update our airports and ports.","date":"Tue Nov 30 16:12:20 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The Build Back Better Act extends tax cuts for hardworking families and lowers their costs for education, child care, prescription drugs, health care, and housing.  \n\nIt's time to build an economy that works for all Americans, not just the wealthy few.","date":"Mon Nov 29 19:19:39 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The late Congressman John Lewis once said: \"The right to vote is precious, almost sacred.\" \n\nI came to Congress to protect that essential American right.  I'll keep pushing for the John Lewis Voting Rights Advancement Act—we cannot wait any longer.","date":"Mon Nov 29 18:10:50 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Sending warm wishes to all those in #OH11 and across the country celebrating Hanukkah. \n\nMay the Festival of Lights brighten your hearts and homes. Chag Sameach! https://t.co/r2tj5QYWIT","date":"Sun Nov 28 18:54:33 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Wishing you and your family a safe and blessed Thanksgiving. \n\nI am always thankful for my family and friends, and I am especially grateful this year for the opportunity to serve the people of #OH11 in Congress. https://t.co/uaiAGayHd8","date":"Thu Nov 25 13:02:14 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today’s verdict is a glimpse of what accountability in our justice system should look like. It is important that we remain vigilant to ensure the system works justly for all people in all cases. \n\nMy prayers remain with Ahmaud Arbery’s family and loved ones.","date":"Wed Nov 24 19:18:06 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"From being sworn in and meeting with @POTUS to voting for the Bipartisan Infrastructure Bill and Build Back Better Act, I couldn't have scripted a better first couple of weeks in office. https://t.co/wdoI43UNg4","date":"Wed Nov 24 15:38:19 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"These local veterans, who have already given so much to our country but are out delivering meals this holiday, embody the true spirit of Thanksgiving. \n\nMay we all work to ensure no one is left behind, regardless of who they are or where they come from.\nhttps://t.co/oauGO8mVQS","date":"Tue Nov 23 16:34:25 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"America is one of the few countries worldwide without universal paid family and medical leave.  \n\nThe Build Back Better Act ends this national disgrace, ensuring no person has to choose between caring for themselves or their family and their paycheck.","date":"Tue Nov 23 15:22:29 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"No person should have to choose between paying for prescription drugs or putting food on the table. \n\nThat is why the Build Back Better Act allows Medicare to negotiate lower drug prices.","date":"Mon Nov 22 19:47:41 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Seven years ago today, 12-year-old Tamir Rice was killed by a police officer.\n\nTamir should be alive today, yet his family and our community still have not seen justice.\n\nWe need greater accountability in policing.  We need the Justice in Policing Act. https://t.co/9oKrrel5pu","date":"Mon Nov 22 16:06:39 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Happy Birthday, @POTUS! \n\nThank you for your lifetime of service and continuing commitment to delivering results for the American people. I’m grateful for your leadership as we work to build this country back better.","date":"Sat Nov 20 20:31:37 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join my colleagues in the @TheBlackCaucus who were instrumental in securing House passage of the bipartisan Infrastructure bill two weeks ago and the Build Back Better Act today. https://t.co/ezDmgciKQd","date":"Fri Nov 19 16:01:25 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The #BuildBackBetter Act:\n\nInvests in childcare\nMakes college more affordable\nLowers the costs of health care and prescription drugs\nBuilds more affordable housing\n\nWhat’s more, it is fully paid for by making large corporations and wealthy Americans pay their fair share.","date":"Fri Nov 19 14:49:56 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This week, @POTUS signed the bipartisan infrastructure bill that invests in roads, bridges, public transit, and broadband.\n\nThe Build Back Better Act invests in people—families, seniors, children, students, and workers who have always been the backbone of our economy.","date":"Fri Nov 19 14:49:56 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I came to Congress to deliver results for hardworking families who have struggled to make ends meet for far too long, and that is exactly what the Build Back Better Act does. \n\nI'm proud to help pass this historic bill that gives all Americans a fair shot at getting ahead.","date":"Fri Nov 19 14:46:11 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It’s a new day, and I’m on my way back to the House floor to vote for the Build Back Better Act. \n\nLet’s get this done!","date":"Fri Nov 19 13:35:58 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Look who I bumped into in the halls of Congress between voting on bills this morning!\n\ncc: @JoeNBC https://t.co/IYhqCyRQep","date":"Fri Nov 19 01:58:59 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I came to Congress to create good-paying jobs, address poverty, and put money back in the pockets of working families.  \n\nThe Bipartisan Infrastructure bill was step 1. \n\nNow it’s time for step 2: the Build Back Better Act. \n\nLet’s get this done!","date":"Thu Nov 18 17:27:59 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"My first two weeks in Congress have been a whirlwind, but my work here is just getting started. https://t.co/054SJysvZ4","date":"Wed Nov 17 22:27:10 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Threats of violence, especially from a sitting member of Congress, are unacceptable—full stop. \n\nTherefore, the House just voted to censure Rep. Paul Gosar for his indefensible and incendiary behavior.","date":"Wed Nov 17 21:44:46 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Slavery is America's original sin, resulting in generations of disparities that continue to impact our society today. \n\nI am proud to add my name in support of #HR40, @JacksonLeeTX18's bill to establish a commission to study and recommend reparation proposals. https://t.co/c0NJhe52fU","date":"Tue Nov 16 19:38:48 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The infrastructure bill signed into law yesterday by President Biden is a historic win for our country. \n\nBut our work cannot end there. It's time to pass the Build Back Better Act to create jobs, reduce poverty, and put money back in the pockets of the American people.","date":"Tue Nov 16 18:00:53 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to give my first @TheBlackCaucus Special Order Hour speech.\n\nTogether with the Infrastructure Bill, the #BuildBackBetter Act will create millions of good-paying jobs, reduce poverty, and rebuild the backbone of our country: the middle class.\n\nhttps://t.co/oYTI5W3n8L","date":"Tue Nov 16 01:40:34 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"In addition to creating good-paying jobs, this bill will help to fill potholes, repair crumbling bridges, upgrade our public transportation systems, and expand access to high-speed internet. I am thrilled to bring home this historic win for our community.","date":"Mon Nov 15 22:43:41 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to join my colleagues at the White House as @POTUS signed the largest infrastructure bill in generations into law!\n\nI came to Congress to deliver results for the people, and that’s exactly what this bill does. https://t.co/S033DFhmoZ","date":"Mon Nov 15 22:15:40 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Excited to be here at the White House as President Biden signs the bipartisan infrastructure bill into law! https://t.co/aILY29glNc","date":"Mon Nov 15 20:25:17 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"The historic infrastructure bill is not just about delivering billions to Ohio for roads, bridges, transit, and broadband—it will also bring countless good-paying jobs to communities across our state. https://t.co/JwE11blXHm","date":"Mon Nov 15 16:27:31 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Tune in to MSNBC at 3:30p to watch my interview with @yasminv!","date":"Sat Nov 13 20:18:18 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"HBCUs expand access to education and unlock career opportunities for countless Black students each year, yet they have been underfunded for far too long. \n\nI'm proud to support the bipartisan IGNITE #HBCUExcellence Act to give these institutions the resources they deserve.","date":"Fri Nov 12 19:58:33 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I can't believe it's already been a week since I was sworn in and helped pass the largest infrastructure bill in generations. \n\nMy work is just getting started. https://t.co/49rj7LB2GA","date":"Fri Nov 12 18:54:42 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to support @RepNikema’s bill to rename Atlanta's main post office after John Lewis, who dedicated his life to confronting racism and injustice wherever he saw it.\n\nAlong with the John Lewis Voting Rights Act, this is one of the ways we continue to honor his life and legacy.","date":"Thu Nov 11 15:06:04 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Today we honor our veterans and their families, including the more than 700,000 veterans right here in Ohio.\n\nBut more than mere words, we must honor them with action. \n\nThat’s why the Build Back Better Act includes $5 billion to help the VA system better serve our veterans. https://t.co/nGAA8R5bJG","date":"Thu Nov 11 13:27:35 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I believe that public service is always about putting the people first.\n\nThe bipartisan infrastructure bill is a win for the economy, a win for jobs and—that's right—a win for the American people.","date":"Tue Nov 09 21:10:31 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"It was an honor to become the newest member of @TheBlackCaucus last week. \n\nNow, I'm ready to lock arms with my colleagues to deliver progress for Black Americans and the communities we serve. https://t.co/ppBWykdSMi","date":"Tue Nov 09 18:59:41 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"What does the bipartisan infrastructure bill mean for Ohio?\n\n➡️$9 billion to repair roads and bridges\n➡️$1.2 billion for public transit \n➡️$100 million to expand broadband access\n➡️$1.4 billion to ensure the safety of our drinking water\n➡️ Countless jobs created across our state","date":"Mon Nov 08 18:52:20 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Watch my full interview here: https://t.co/xrqimtiW7V","date":"Sun Nov 07 20:41:51 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Room: 10/10\n\nAlso 10/10?\n\nDelivering historic investment in roads, bridges, broadband and safe drinking water on my first week in office.","date":"Sun Nov 07 20:19:56 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"This bipartisan bill will help repair our crumbling roads and bridges, upgrade our public transit systems, and expand access to high-speed internet service, all while creating good-paying jobs in Northeast Ohio and across the country.","date":"Sat Nov 06 03:28:46 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"Proud to cast my vote in support of the largest infrastructure bill in decades on my second day as Congresswoman.","date":"Sat Nov 06 03:28:46 +0000 2021","user_id":"1456381091598700556"},{"handle":"RepShontelBrown","text":"I came to Congress to deliver results for the people. That means rebuilding our infrastructure, lowering health care costs, expanding access to childcare, making housing more affordable and giving working families a tax cut. \n\nI’m ready to vote yes on both bills, Mr. President.","date":"Fri Nov 05 19:51:53 +0000 2021","user_id":"1456381091598700556"}]