[{"handle":"RepTrentKelly","text":"Thankful for our farmers and ranchers! #NationalAgDay #HouseAgGop https://t.co/OOrCGwSfTT","date":"Tue Mar 22 17:27:07 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/G2jBz0eUQM","date":"Fri Mar 11 17:33:25 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with the family of Jim Hagedorn. It was an honor to serve with him on the House Agriculture Committee.","date":"Fri Feb 18 22:07:04 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of Blue Mountain College and @tweetbmc President Dr. Barbara McMillin! https://t.co/k3iXx7Oee1","date":"Wed Feb 09 17:09:08 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/o1yCoHYaF6","date":"Tue Feb 08 23:37:11 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Being able to utilize technology to make real world connections is important for students. I commend TVA for their support of this program. Congrats to Biggersville H.S., Itaw. Attendance Ctr, Mantachie Attendance Ctr, New Albany Career Tech, Tupelo M.S., and Saltillo P.S.","date":"Wed Jan 26 17:14:14 +0000 2022","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Fighting for the unborn: Reverse Roe v. Wade. https://t.co/lRdTwG6zMF https://t.co/RnUifASwlC","date":"Wed Dec 01 20:00:29 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to join @LynnFitchAG on the steps of the U.S. Supreme Court building to support legislation passed by the MS Legislature that restricts abortions after 15 weeks. Justices must allow states to have authority to restrict abortions. Unborn children must have a voice. https://t.co/tflB6BPg6b","date":"Wed Dec 01 18:36:29 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Recognizing the service of all our Heroes who have worn the Uniform. Let us all honor their service. https://t.co/slVieT0sG8","date":"Thu Nov 11 13:02:37 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is essential our men and women in SOF have the tools they need to defend America. Through my role on @HASCRepublicans, @HouseIntel, and as Ranking Member of the House Subcommittee on Intelligence and Special Operations, I will make sure their voice is heard on Capitol Hill.","date":"Mon Nov 08 22:24:14 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congressman Trent  Kelly on the Ingraham Angle Show https://t.co/QNyMR2He7P via @YouTube","date":"Sat Oct 23 21:50:38 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great night on @FoxNews @IngrahamAngle live in Oxford! https://t.co/A1x7X3aMsL","date":"Sat Oct 23 02:41:25 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with the family of General Colin Powell. He was a great leader and devoted public servant.","date":"Mon Oct 18 21:56:34 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"My full statement on the terrorist attacks in Afghanistan. https://t.co/evqOIlcE7l","date":"Thu Aug 26 21:56:55 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce that today, the bill to name the Tupelo Post Office on Main Street after Colonel Carlyle “Smitty” Harris, has passed the U.S. Senate. Colonel Harris is a war hero and a true patriot. I am honored to aid in dedicating this building to him. https://t.co/Pz4uwN8OrU","date":"Wed Jul 28 18:10:52 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those who have been impacted by severe weather and with our first responders who came to their aid. We are thankful for our utility and public works crews who have been working to restore power and remove debris throughout the night.  #MS01","date":"Mon May 03 14:05:24 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am concerned about President Biden's proposal to spend $6,000,000,000,000 on a partisan wish list. President Biden promised unity, but instead, he's pushing partisan ultraliberal policies that further divide our great Nation. #MS01","date":"Thu Apr 29 18:40:27 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been ten years since a tornado claimed the lives of these loved ones in Smithville. They will always be remembered. https://t.co/c1Yzh3IiUu","date":"Tue Apr 27 17:56:09 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to be a part of the Girl Scout Gold Award ceremony in Ripley. Congratulations! https://t.co/As9eWydKDq","date":"Sun Apr 25 20:01:56 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful to take part in the open house for the Veteran &amp; Military Services Open house on the @OleMiss campus. Our men and women in uniform and military-connected students have a great resource each here! https://t.co/TIikb1gYg3","date":"Fri Apr 23 23:54:52 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"There are critical issues facing our great Nation. I appreciated the opportunity to provide an update from Washington via Frank Corder and Y'all Politics.","date":"Tue Apr 20 20:40:37 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to @repjulialetlow, our newest @HouseAgGOP member! #MS01 https://t.co/uFeoZ3S106","date":"Tue Apr 20 15:22:47 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Macon Bentley! The @FrenchCampAca junior is the 1st place winner of the 1st District Art Competition! Macon's drawing titled \"No Fish Today\" features his younger brother, Robert, at a nearby lake. Click for competition details. https://t.co/mnCeex1HvI https://t.co/y8moyS0Muu","date":"Fri Apr 16 20:12:54 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The integrity of the Supreme Court must not be compromised. I will do everything in my power to protect the sanctity of our Nation’s highest court.","date":"Fri Apr 16 14:41:22 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I support the Born Alive Abortion Survivors Protection Act discharge petition led by @SteveScalise, @RepAnnWagner, and @RepKatCammack. Time to bring H.R. 619 to the floor for a vote. #MS01 https://t.co/kREJ1U9Cm0","date":"Wed Apr 14 21:55:53 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Birthday to @USAFReserve! We are grateful for these men and women who make our Nation proud! #FlyFlightWin #MS01 https://t.co/kKO2fgbfjb","date":"Wed Apr 14 18:14:07 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi's First District Art Competition is one week from today! The deadline to submit artwork is Monday, April 12. Details: https://t.co/ZX7hW3raUJ https://t.co/7jXSiG1Z2b","date":"Fri Apr 09 19:36:04 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce the 1st District recipients of @theaward Gold Medal! Mabry Chamblee, Daniel Laudadio, Reed Lindsey, and Tashunti Trice have made us proud. Reed about these outstanding young people in my next newsletter. https://t.co/nTpBVIf6ea https://t.co/yVwReU95aJ","date":"Thu Apr 08 20:17:20 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce the appointment of Frank Davis, Jr., to the @NavalAcademy! The @CorinthSchools senior is eager to serve as an @USNavy officer. Read all about this outstanding young man in my next newsletter. Sign up at https://t.co/nTpBVIf6ea #Midshipmen #MS01 https://t.co/j9lL3cR28i","date":"Wed Apr 07 21:08:48 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We have so many talented high school artists in the 1st District and this is a great way to feature them! Please submit your entries on or before April 12! Details...https://t.co/T7pn3mNR0I https://t.co/PVKCIWq9wB","date":"Mon Apr 05 20:54:10 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, our great Nation recognized #VietnamWarVeterans day. These men and women have earned and deserve our respect. We are grateful for their service. Read more... https://t.co/a1KGqenjoR https://t.co/GESAwPCyUS","date":"Sat Apr 03 01:00:32 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Wishing you a blessed Good Friday. https://t.co/sj0KGN62x4","date":"Fri Apr 02 20:05:37 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to honor and highlight the distinguished service of #VietnamWar Veteran Johnny Johnson from Columbus. #VietnamVeteransDay https://t.co/zUjTuBD8j9","date":"Mon Mar 29 18:43:36 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Grateful for these brave men and women who served our Nation to protect the freedoms we all enjoy. Thank a #VietnamWar Veteran today and every day. #MS01 https://t.co/5VHMQhxspA","date":"Mon Mar 29 16:36:07 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Looking forward to the competition for all high school students in the First District. The deadline to enter is April 12! This is a great opportunity to showcase your talent. Please click for details. https://t.co/hJJDLN5qKn https://t.co/DdWbU9Xum0","date":"Fri Mar 26 20:43:20 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great discussion this week with General Richard Clarke and Command Chief Master Sergeant Gregory Smith. I am proud to serve on the House Armed Services Committee, representing the best interests of our men and women in uniform and Mississippi's First District. #MS01 https://t.co/LPGMxh8mxD","date":"Thu Mar 25 21:37:50 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Biden administration promised the American people bipartisanship and unity. However, they unilaterally drafted and pushed through a bill without any Republican support.  https://t.co/iWN9gJ9qGC","date":"Fri Mar 19 19:26:39 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, the COVID-19 vaccine became available to all Mississippians. That's progress! I am proud of the great job @nationalguardMS is doing in the First District and across our great state. Read more... https://t.co/irLb5FEfmQ photo courtesy: Sgt. Jovi Prevot https://t.co/nfYrRnR7Zq","date":"Thu Mar 18 20:46:02 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On the phone with @USDA @SecVilsack with Abbey Herfurth, our legislative assistant specializing in agriculture. I discussed the critical role broadband plays in Mississippi and the positive impact it has on the ag industry. I am a proud member of @HouseAgGOP. #MS01 https://t.co/AjgGQLgHuM","date":"Thu Mar 18 19:21:16 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated the opportunity to discuss issues that are important to the American people on @supertalk today. https://t.co/uerrJbYbf7 https://t.co/Kf1tdeZr0L","date":"Wed Mar 17 18:51:43 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please keep an eye on the weather today.","date":"Wed Mar 17 14:51:20 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/N4zNvu7DyW","date":"Wed Mar 17 12:39:38 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to CPT Tony Starks, our Congressional Defense Fellow! He is assisting our defense policy team. We are grateful to have him on Team Kelly. https://t.co/fS5d44zyXQ","date":"Tue Mar 16 22:01:55 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to be selected to serve on this committee.","date":"Fri Mar 12 16:17:07 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In Mississippi, gun ownership is a tradition for scores of families, including my own. They provide protection and put food on the table as they have for generations. As your Representative, I will do everything in my power to protect our right to keep and bear arms.","date":"Thu Mar 11 22:59:03 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of our defense policy team: Legislative Director Rodney Hall and Defense Fellow Tony Starks. We discussed issues facing the special ops community on a conference call with Major General Miguel Correa, incoming U.S. Army Special Operations Command, Deputy Commanding General. https://t.co/VIEoz8UglY","date":"Wed Mar 10 20:22:35 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great conversation at our DC office with MG John Epperly, Deputy Commanding General (DCG), Army Futures Command (AFC). https://t.co/y04WnbWxr6","date":"Tue Mar 09 20:00:26 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Recognizing #NationalWomensDay and all those who have made our great Nation proud! #MS01 https://t.co/7HEuYt7kNB","date":"Mon Mar 08 20:38:18 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are proud of our men and women in uniform who have and continue to watch over us. Happy Birthday! https://t.co/uMiFJkoIqb","date":"Wed Mar 03 12:01:35 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to introduce Olivia Fahrmann, an intern in our DC office. She is assisting our team to learn more about the legislative process. We encourage all college students who have completed their sophomore year to apply. Visit https://t.co/nTpBVIf6ea for details. https://t.co/kZSLBCkCD2","date":"Tue Mar 02 22:47:03 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to serve as your Representative and to share details of my work on your behalf. To learn more - please sign up for my newsletter. Every issue also includes great stories about your fellow Mississippians! Click to get started! https://t.co/nTpBVIf6ea https://t.co/d1Zq0Bb8NF","date":"Tue Mar 02 01:00:47 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It's that time of year! The 2021 Congressional Art Competition is underway. This is a great opportunity to recognize and encourage artistic talent in Mississippi. To learn more, please click on the link. https://t.co/eUaNqXtICJ https://t.co/mxJsrqh6Lg","date":"Mon Mar 01 22:57:50 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to receive the overwhelming support of my colleagues in the U.S. House of Representatives who voted in favor of H.R. 208. Details and more in my newsletter. Click to open. https://t.co/XUSZdU5eHV https://t.co/u4HBS2QHAP","date":"Fri Feb 26 22:24:24 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our hardworking Mississippians continue to play an important role in readiness. https://t.co/K3s8FtabCw","date":"Fri Feb 26 15:55:11 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, U.S. Representatives Trent Kelly and Tim Ryan introduced the “Gold Star Altitude Act.” This bill will allow Gold Star family members to use travel benefits to fly on military aircraft when there is available space to select locations. Read more... https://t.co/uG5N4eiKjR","date":"Wed Feb 24 22:22:31 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Colonel Carlyle \"Smitty\" Harris is a true war Hero - a gentleman of all gentlemen. I am thankful for his service and proud to call him a friend. I appreciate the support of my colleagues in the House for H.R. 208. Read more.. https://t.co/WB950pTQjp","date":"Wed Feb 24 20:26:45 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to speak on the House Floor in honor of Colonel Carlyle \"Smitty\" Harris. I appreciate the support of my colleagues who voted in favor of H.R. 208. Click to watch my remarks.  https://t.co/MrttzY3bCV https://t.co/IHENf9Z1O6","date":"Wed Feb 24 00:28:30 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a new member of the @housebudgetGOP, I look forward to working with my colleagues. Read more...  https://t.co/e3UyQp49RO #MS01","date":"Thu Feb 18 21:58:42 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering and honoring all the leaders who have made America the greatest Nation in the world. https://t.co/cjYy6yufkS","date":"Mon Feb 15 18:50:37 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great day in Columbus as we gathered for the Franklin Academy Bicentennial Celebration. Thankful to be a part of this historic occasion. https://t.co/0t3B4yOw56","date":"Fri Feb 12 23:27:24 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Eligible Mississippians can receive a COVID-19 vaccine at Walmart &amp; Sam's Club. Please click the link for locations. https://t.co/ZceKqpkS9b","date":"Fri Feb 12 18:11:42 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce the appointment of @alcornschools senior Benjamin Williams to @WestPoint_USMA! He is looking forward to attending this prestigious service academy and serving as an officer in the U.S. Armed Forces. Nominations info: https://t.co/nTpBVIf6ea https://t.co/M2nUV0HxRS","date":"Thu Feb 11 21:31:13 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Fewer burdensome rules and regulations make it possible for companies to expand and create more jobs. It also helps to have a move-in ready facility! In Okolona, Paxton Sales, Inc. has announced a new operation, PFW, LLC, a sister company to Vogue Home Furnishings, LLC.  #MS01","date":"Thu Feb 11 18:37:39 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to Bo Miles, our spring intern in the Washington, D.C., office! Bo, an @OleMiss graduate, said he is eager to learn all about the legislative process. For more information about our Internships program, visit https://t.co/nTpBVIf6ea https://t.co/fHWEUtl7FM","date":"Wed Feb 10 19:37:39 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with the family of Congressman Ron Wright of Texas. His devotion to public service will always be remembered. https://t.co/Rb2sqBOkr5","date":"Mon Feb 08 18:10:27 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering President Ronald Reagan on his birthday... https://t.co/NoaPqtMmFS","date":"Sat Feb 06 12:30:19 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to be named the Ranking Member of the House Armed Services Committee Intelligence and Special Forces Subcommittee. We must arm our troops with the best intelligence and resources available. Read more... https://t.co/6NYR7McnsU","date":"Fri Feb 05 21:53:13 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to give a voice on Capitol Hill to Gold Star families. I am pleased to announce the launch of the Sergeant First Class Sean Cooley and Specialist Christopher Horton Congressional Gold Star Family Fellowship Program.  Read more... https://t.co/TWZbnMr3oR #MS01","date":"Tue Feb 02 23:07:17 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Access to rural broadband is critical to the success of North Mississippi. Are you connected? Learn more about the important role electric power coops are playing to help provide this essential service. https://t.co/UmTJmpftb6 https://t.co/rpcgrLVRod","date":"Fri Jan 29 20:57:04 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I proudly support the Hyde Amendment, a law banning taxpayer-funded abortions. An estimated 2.4 million babies' lives have been saved since Hyde was enacted. We must continue to do everything in our power to protect the lives of the unborn.  #SaveHyde  #MS01","date":"Tue Jan 26 19:14:19 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The #PaycheckProtectionProgram has helped scores of Mississippi businesses. Please visit @SBAgov for more information. #MS01 https://t.co/nFtL9T8jJI","date":"Mon Jan 25 22:59:50 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I believe all people are made in the image of God. It is our duty as a Nation to protect the lives of the unborn. #MS01 https://t.co/yFFbB4vr8c","date":"Fri Jan 22 18:29:55 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Recognizing the life and legacy of Martin Luther King, Jr. #MS01 https://t.co/UAPCw2Tzjw","date":"Mon Jan 18 16:42:15 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today’s actions in the U.S. House of Representatives are not helpful to our Nation. This is a time for healing, not division. I will vote no on impeachment. #MS01","date":"Wed Jan 13 15:53:02 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Officer Brian Sicknick was killed while protecting our nation’s Capitol when the violent mobs marched on the Capitol this week. He was protecting more than the lives of the people inside, he was defending our way of life. We are forever indebted to this great American. #MS01","date":"Fri Jan 08 17:36:05 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please keep protests peaceful and lawful. I condemn all acts of violence. #MS01","date":"Wed Jan 06 20:13:50 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to represent Mississippi's First Congressional District. From our family to yours, have a Happy New Year! #MS01 https://t.co/L3BKFVUdLo","date":"Fri Jan 01 13:01:47 +0000 2021","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In this edition of my newsletter, we take a look back at 2020, and once again feature your fellow First District residents. Read more... https://t.co/i5ikSOAxGE https://t.co/ooBuILcXB8","date":"Wed Dec 30 20:20:33 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"From our family to yours, we wish you a Merry Christmas. Please remember our men and women in uniform who are watching over us at this hour. #MS01 https://t.co/wa79wRhD3i","date":"Fri Dec 25 20:30:44 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are proud of our military families who call the First Congressional District home, including Lt Col Buck Benton, his wife, Ella, and their children. They may cheer for Texas A&amp;M, but they love Mississippi more! Their story coming soon! Subscribe at https://t.co/nTpBVIf6ea https://t.co/ja02GT5u8T","date":"Tue Dec 22 16:55:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with this great Mississippian and devoted public servant. https://t.co/O6ByVghZJa","date":"Sat Dec 19 18:14:56 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to serve Mississippi's First Congressional District. Please do not hesitate to reach out to my office and to members of our team for assistance. To see a complete list of services, please visit https://t.co/nTpBVIf6ea #MS01 https://t.co/VpLAv7eifS","date":"Wed Dec 16 22:51:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating #BillofRightsDay. On December 15, 1791, our forefathers ratified the Bill of Rights, establishing freedoms we hold dear. #MS01 https://t.co/frFA2emEKk","date":"Tue Dec 15 14:02:33 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for these brave men and women in uniform who stand at the ready to defend America! We will always celebrate and remember their commitment to our great Nation. #Patriots #Heroes #NationalGuard #MS01 https://t.co/yjg2emFsCI","date":"Sun Dec 13 13:01:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Camryn Colter, a 9th grade student at Louisville High School! Camryn is the winner of the First Congressional District's Congressional App Challenge (CAC)! Camryn's app provides information about the Census and how to complete it. https://t.co/OAFhuMzDOm","date":"Sat Dec 12 14:01:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Small business owners need our support! #PPP https://t.co/jheLfKZl3O","date":"Thu Dec 10 15:38:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi's entrepreneurs remain determined to succeed! More needs to be done to keep the momentum going.  In this edition of my newsletter, I am proud to feature your fellow Mississippians. Read more... https://t.co/YDkhfb8m4X #PPP #CFAP #MS01 https://t.co/ZzB9dcXMC8","date":"Wed Dec 09 21:18:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In recognition of our great Patriots who defended America and all those who paid the ultimate sacrifice #OnThisDay. Their service will always be remembered. #MS01 https://t.co/1fnsStLRer","date":"Mon Dec 07 19:00:35 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Access to #telehealth services is essential. I am proud to join a bipartisan group of lawmakers requesting Congressional leaders make permanent telehealth services expanded temporarily to fight the COVID-19 pandemic. https://t.co/mYFpJw9OA9","date":"Fri Dec 04 22:20:48 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Matthew and Kayla Poe operate businesses in Pontotoc County that received the help they needed to keep their employees on the payroll. Read their story in my next newsletter. Subscribe at https://t.co/nTpBVIf6ea https://t.co/phZRwx82aV","date":"Wed Dec 02 22:57:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for our hardworking Mississippians! Our business-friendly climate, combined with fewer burdensome rules and regulations, helps our businesses expand and create more jobs.","date":"Tue Dec 01 18:21:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to nominate young people who want to attend one of America's prestigious service academies. Today is an important deadline in the process. #MS01 https://t.co/30jPGrA9dE","date":"Mon Nov 30 17:32:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Small Businesses are the backbone of our economy. I am thankful for our entrepreneurs and hopeful for their future. Be sure to #ShopSmall on #SmallBusinessSaturday! https://t.co/xlzry7GOQu","date":"Sat Nov 28 13:01:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this Thanksgiving Day, I am grateful for the American spirit which will overcome any challenge - just as it always has. Our great Nation will make a comeback by restoring our way of life, rebuilding the greatest economy, and renewing the American dream. https://t.co/zBb6HNeZOZ","date":"Thu Nov 26 13:03:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our military families for their service to America. Featuring two families from @Columbus_AFB! Read more... https://t.co/XttJBxKDTD https://t.co/gbdJpphtPi","date":"Wed Nov 25 17:48:52 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"November is Military Family Appreciation Month. Our celebration of these families continues as we recognize Lt Col Jason Barlow and his wife, April. The family lives in Columbus where Lt Col Barlow serves as the Commander of the 43rd Flying Training Squadron @Columbus_AFB.","date":"Tue Nov 24 22:38:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America's Service Academies provide an excellent education for young people who wish to serve in the U.S. Armed Forces. It is an honor to nominate students from the First District. Click for details.\nhttps://t.co/4hHviDsAk2 https://t.co/zyUJbmJRpU","date":"Mon Nov 23 21:32:48 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you for the invitation to talk about issues that are important to Mississippians. #MS01","date":"Fri Nov 20 00:27:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to be selected as a conferee for the National Defense Authorization Act (NDAA) Conference Committee for Fiscal Year 2021. It is my sworn duty to make sure our Service Members have the tools they need to defend America. Read more... https://t.co/4yOPgYtqDX","date":"Thu Nov 19 00:11:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to discuss issues that are important to Mississippians on @MSyallpolitics","date":"Wed Nov 18 19:17:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our Veterans answered the call to serve! In this edition of my newsletter, you will meet a Vietnam War Veteran from Union County. Also, more details about the Gold Star Family Fellowship Program and the voice it will give to families. Read more... https://t.co/ZRjFPzUInt https://t.co/qjagXgbGay","date":"Tue Nov 17 20:49:48 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to have Adam Napier on our team, heading up the Veterans History Project, and Missy Younger, our field representative in the Golden Triangle. Questions for Adam (662) 327-0748. Need assistance? Call (662) 687-1721. https://t.co/zZ2v4oLarZ","date":"Mon Nov 16 22:37:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This program will give Gold Star family members a seat at the table, ensuring they have a stronger voice on Capitol Hill. It was an honor to introduce this legislation and to receive great support for its passage. Read more... https://t.co/9zOl2MD4ZN","date":"Fri Nov 13 18:57:43 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for America’s military families who make it possible for men and women to serve! https://t.co/fL7pAFFus6","date":"Thu Nov 12 19:19:51 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, our great Nation recognizes the men and women who have worn the Uniform. These great Patriots made the commitment to protect the freedoms we all enjoy. I am thankful for each and every Veteran who proudly answered the call to serve. https://t.co/4pwwXHz7W0","date":"Wed Nov 11 12:02:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are thankful for our brave men and women in uniform! @USMC https://t.co/ZmxzKy5irZ","date":"Tue Nov 10 12:01:48 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating Veteran small business owners who have devoted themselves in service to America and now to providing jobs! Please read my newsletter. \nhttps://t.co/ThezfIvDU6 https://t.co/v8iHCoToHp","date":"Mon Nov 09 22:32:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The great American comeback continues! https://t.co/okTaTysX8n","date":"Mon Nov 09 20:18:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to private-public partnership through #OperationWarpSpeed, we will have 100 million doses of the Pfizer vaccine ready for distribution following FDA approval!","date":"Mon Nov 09 18:03:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Confidence in our voting process is critical. Transparency is essential. I joined @SenatorWicker, @SenHydeSmith, @CongPalazzo, and @RepMichaelGuest in support of an investigation. https://t.co/N6oy8nqq3y","date":"Fri Nov 06 22:29:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Bobby Martin worked tirelessly to improve the quality of life for residents in Ripley, Tippah County, and well beyond. Our thoughts and prayers are with the family of Bobby Martin - an outstanding leader and devoted community servant. https://t.co/glM6GuC4QL","date":"Thu Nov 05 20:07:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As Ranking Member of the House Armed Services Subcommittee on Military Personnel, I appreciated the opportunity to discuss my role and the issues we address on the #MissionReadinessPodcast. #MS01","date":"Wed Nov 04 21:27:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are proud of our Veteran entrepreneurs and will continue to advocate on their behalf in Washington, DC. #MS01","date":"Tue Nov 03 17:27:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Northrop Grumman has started the build process for Australia's first MQ-4C Triton, an unmanned maritime intelligence, surveillance and reconnaissance (ISR) aircraft. It was an honor to be a part of the ceremony. I am thankful for the jobs Triton supports in MS and across America. https://t.co/MEMqEqwbxQ","date":"Fri Oct 30 18:14:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Marsha Holder is a Vietnam Veteran who served two tours. The Prentiss County resident helped to write a book about her service and that of other women in Vietnam. Her story and more in this edition of my newsletter. https://t.co/QGppNiYVEd https://t.co/HJKWIehWEj","date":"Thu Oct 29 18:12:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great meeting this morning with fellow @HouseAgGOP member @RepRickCrawford and @MSFarmBureau leadership to discuss agriculture policy. #MS01 https://t.co/oL8zwa9lYe","date":"Thu Oct 29 16:20:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Marsha Holder is a Vietnam Veteran and a member of the George Robert Mitchell VFW Post 4877 in Prentiss County. She helped to write a book about Women Vietnam Veterans. Marsha will be featured in my next newsletter! Sign up at https://t.co/nTpBVIf6ea https://t.co/cpecIlGUsI","date":"Wed Oct 28 21:20:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those who may be impacted by Hurricane Zeta.","date":"Wed Oct 28 13:54:45 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This is great news for America. I am thankful for @realDonaldTrump @SenatorWicker and @SenHydeSmith’s decision! https://t.co/cLNEeYTeX3","date":"Tue Oct 27 01:15:23 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi businesses must have the ability to operate without unnecessary and burdensome government regulations. I was thankful for the opportunity to discuss our work in Washington, D.C., with the Subcontractors &amp; Suppliers Alliance of MS. https://t.co/uoufB0Ln9u","date":"Mon Oct 26 20:59:47 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to talk with our great American Heroes at the George Robert Mitchell VFW Post in Booneville today. Thank you for the opportunity to discuss our work in Congress to help Veterans. https://t.co/6vwno9kYzW","date":"Fri Oct 23 20:50:35 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseAgGOP, I will continue to make sure the voice of our farmers and ranchers is heard on Capitol Hill. Thanks to @FarmBureau for the “Friend of Farm Bureau” award. https://t.co/bDwjTlaGhG","date":"Fri Oct 23 16:59:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It’s the sweet potato harvest! Thanks to Melissa, Joe, and Trent Edmondson for the tour of Topashaw Farms. https://t.co/SKWzmwgft8","date":"Thu Oct 22 19:14:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseGOP, it was important to meet with @MSLandBank to discuss the good work they do for the agriculture industry in Mississippi and to listen to their thoughts and concerns. https://t.co/ocpJCq9UKr","date":"Wed Oct 21 19:48:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Small businesses are the backbone of our economy. As your Representative, I will continue to do everything in my power to make sure they have the resources they need to thrive. It is an honor to be recognized as a #smallbizguardian by the @NFIB. #MS01 https://t.co/4vMQc4rDGB","date":"Wed Oct 21 19:13:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseAgGOP, I appreciate the opportunity to discuss issues that are important to the ag industry as well as outdoor enthusiasts. Thanks to Ronnie \"Cuz\" Strickland for asking me to join him on the Fist Full of Dirt podcast. Click to listen. https://t.co/PT7zgXbqU4","date":"Wed Oct 21 01:00:56 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America recognizes National Farmers Day in October. Meet Jamie Dean Atkins. He and his family operate a farm in Monroe County. Jamie Dean divides his time between the farm and college. Read more about him in my next newsletter. Subscribe at https://t.co/nTpBVIf6ea https://t.co/iWNsRqSAMk","date":"Mon Oct 19 22:08:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to discuss American government and take great questions from students at the Monroe County School District Advanced Learning Center. Thanks for the invitation! #MS01 https://t.co/yh1UhSbt9n","date":"Fri Oct 16 16:43:45 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It's harvest season in Mississippi's 1st Congressional District. Farmers are working hard to gather and assess their yields. As a member of @HouseAgGOP, it is a top priority to make sure farmers like Jamie Earp have the resources they need to feed and clothe our Nation. #MS01 https://t.co/pwk5hGsrPc","date":"Thu Oct 15 20:55:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Census Bureau Statement on 2020 Census Data Collection Ending https://t.co/Cs7rLKh5S9 via @Granicus","date":"Wed Oct 14 17:07:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Birthday @USNavy! We are thankful for the men and women who have served America and those who are watching over us at this hour. #MS01 https://t.co/9aRtD5tE8g","date":"Tue Oct 13 14:59:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great presentation LT Austin Gerald with the University of Mississippi NROTC program. https://t.co/yEPgqbsg52","date":"Sat Oct 10 17:03:52 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Cadet Noah Brandon is representing @MsStateROTC on Virtual Academy Day 2020. The Grenada native is a senior majoring in Civil and Environmental Engineering. He is currently in the @nationalguardMS! #MS01 https://t.co/0RHyms4lCk","date":"Sat Oct 10 16:41:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Lieutenant Commander Select Kevin Whalen is representing the US Coast Guard Academy this morning for Virtual Academy Day 2020. He oversees missions in MS, AK, and LA. #MS01 https://t.co/DkTA1JjZCM","date":"Sat Oct 10 16:10:33 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Virtual Academy Day 2020 includes Brittany Thornton, a native of Mississippi! She is the Supervisory Education Services Specialist assigned to the US Air Force Academy. Great to have her on our panel today. #MS01 https://t.co/u97QbUGCeF","date":"Sat Oct 10 15:53:41 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Virtual Academy Day 2020 is fifteen minutes out! Anyone who is interested in attending one of America's service academies will be able to ask questions and receive important information. Visit https://t.co/nTpBVIf6ea to join our virtual Zoom event! https://t.co/bAVt9vmtge","date":"Sat Oct 10 14:47:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Virtual Academy Day 2020 is tomorrow! It is an honor to share important information with young people who want to serve our Nation as an officer in the U.S. Armed Forces. Read more... https://t.co/GYzdFemncI  #MS01 https://t.co/sKpHhgh8SR","date":"Fri Oct 09 18:03:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/vvDxI0INEF","date":"Thu Oct 08 21:19:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for our hardworking Mississippians!","date":"Thu Oct 08 15:43:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Virtual Academy Day 2020 is coming your way on Saturday at 10:00 a.m. MAJ Steve Gilbert will be among our distinguished panelists. Be sure to join our Zoom webinar to  learn about attending one of America's prestigious Service Academies. Visit https://t.co/nTpBVIf6ea for details! https://t.co/0xiEI68X9e","date":"Tue Oct 06 21:35:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Traveled to Hernando tonight to discuss issues that are important to our First District constituents. https://t.co/Wz9oTNuu6i","date":"Tue Oct 06 01:23:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thousands of Mississippi small businesses have been assisted by the Paycheck Protection Program. It is important that we extent the PPP to help more. Please click on the link. https://t.co/37Cv7iTdnN https://t.co/PsQ0EAMcNp","date":"Mon Oct 05 16:58:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Rep. Paul Cook has distinguished himself in Congress. Wishing all the best for this devoted public servant! https://t.co/Hxij4CHYQL","date":"Sat Oct 03 19:33:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to MG John Rhodes for taking command of the 29th Infantry Division. https://t.co/R1o9sByLt9","date":"Sat Oct 03 18:57:22 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is vital that we continue to address the disturbing trend of Veteran suicides. I am proud to be an original co-sponsor of the Veterans' Sentinel Act that will help to prevent Veteran suicides. Read more.. https://t.co/fCajt59uYL","date":"Thu Oct 01 16:40:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to @supertalk @paulgalloshow for the invitation to discuss issues that are important to our great Nation. To watch an excerpt of the interview, please click on the link. https://t.co/2UsaHO1FDJ","date":"Tue Sep 29 21:45:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to @supertalk and The Paul Gallo Show for the invitation to discuss issues that are important to our great Nation. To watch an excerpt of the interview, please click on the link. https://t.co/QlE31bGXnq https://t.co/XoBjG8QHwW","date":"Tue Sep 29 16:21:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @TweetDCS_CHHS for being selected as a 2020 National Blue Ribbon School! This is a proud day for these students, families, educators, and the community. We will continue our work in Washington to ensure a bright future for these successful young people.","date":"Mon Sep 28 14:32:39 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Judge Amy Coney Barrett is an excellent decision by President Trump as a nominee to fill the vacancy on the U.S. Supreme Court. I look forward to a swift confirmation in the U.S. Senate. #MS01 https://t.co/WSkOQRAE5g","date":"Sat Sep 26 22:14:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Virtual Academy Day 2020 is coming your way in October! This is a great opportunity to learn about serving as an officer in the U.S. Military. Also - a great story about a WWII Veteran from Amory! Read more... https://t.co/UfXUwg0NxD #MS01 https://t.co/c3Fw2NXxQ5","date":"Fri Sep 25 20:11:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our workforce is second to none! This is exciting news for Corinth. #MS01","date":"Fri Sep 25 17:05:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am thankful for President Trump's commitment to protect the lives of these precious children. We must do everything in our power to give them a voice.","date":"Thu Sep 24 22:13:36 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our entrepreneurs! We are thankful for their investment in our workforce. They are the backbone of Mississippi's economy.  #SmallBusinessWeek https://t.co/keALs2jZdv","date":"Thu Sep 24 21:52:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program (PPP) has successfully helped scores of Mississippi businesses stay afloat and keep their employees on the payroll. I appreciated the opportunity to meet with @msbankers about this important program.","date":"Thu Sep 24 21:13:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi's small businesses are the backbone of our economy! #MS01","date":"Wed Sep 23 21:59:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Save the date! Virtual Academy Day is coming soon. This is a great opportunity to learn more about attending one of our Nation's prestigious service academies. You'll have the opportunity to meet their representatives! Visit https://t.co/tRsUFfWXGq to participate. #MS01 https://t.co/JkCrJysf5V","date":"Wed Sep 23 17:50:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi producers impacted by COVID-19 should register for the webinar.","date":"Wed Sep 23 17:42:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations!","date":"Tue Sep 22 15:43:44 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our law enforcement officers willingly place their lives on the line to protect our safety. We must fully fund these agencies to make sure they have the tools they need to carry out their duties. I have signed @Heritage_Action's Police Pledge. #MS01 https://t.co/TJRWgz0amV","date":"Tue Sep 22 14:52:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Glad to have Rachel Shumaker serving as an intern in our DC office! The Pontotoc native is a senior @msstate, majoring in political science and communications. If you are interested in serving as an intern, visit https://t.co/tRsUFfWXGq #MS01 https://t.co/FE1saSG5W6","date":"Tue Sep 22 13:37:51 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to Washington, Kaleb Digby! The Corinth native is serving as an intern in our office this fall. Kaleb is a member of the @nationalguardMS and has distinguished himself in service to our Nation. He is also a @OleMissRebels grad. Glad he's on board! https://t.co/mWD9FMVbEz","date":"Mon Sep 21 20:48:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Scores of Mississippi businesses have been helped by this program. #MS01","date":"Mon Sep 21 19:50:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, the Abraham Accords, a historic peace agreement, was signed by Israel, the United Arab Emirates, and Bahrain. It was an honor to attend the ceremony. Read more... https://t.co/qtiNNf5FKK https://t.co/FyMfA4q6pB","date":"Fri Sep 18 20:23:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is National POW*MIA Recognition Day. We will always remember the service and sacrifice of these great Patriots. https://t.co/ozXRnk5BqR","date":"Fri Sep 18 11:01:17 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @nationalguardMS Staff Sgt. Mitchell Scofield! You have earned and deserve this great honor. https://t.co/djqM32WfmT #MS01","date":"Thu Sep 17 14:43:37 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating #ConstitutionDay in the United States of America and the freedoms we all enjoy. #MS01 https://t.co/pdwI0P06G7","date":"Thu Sep 17 11:01:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Coming soon - Academy Day 2020! Every year, I am honored to nominate young men and women for admission to America's prestigious military academies. This event will provide an opportunity to hear from their representatives and ask questions. https://t.co/21IUwnz76b","date":"Wed Sep 16 19:09:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to attend the signing of the historic #AbrahamAccords with @RepMichaelGuest. This agreement will advance the Administration's peace initiatives in the Middle East. https://t.co/YRwV7rq750","date":"Tue Sep 15 21:59:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Under the leadership of President Trump, backed by Republican-led policies, we are committed to restoring our way of life, rebuilding America’s economy and renewing the American dream. This is our commitment to America! https://t.co/PFBUIgUeSd","date":"Tue Sep 15 16:06:39 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Historic progress is being made to advance peace in the Middle East with @realDonaldTrump in the lead! #MS01 https://t.co/HsgALCISzW","date":"Tue Sep 15 11:01:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The late William E. Tabor - a member of our greatest generation, served America during World War II. It was my honor to present his family in Louisville the Bronze Star Medal to recognize his distinguished service. https://t.co/wF60DTQbv2","date":"Mon Sep 14 13:09:00 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this day, thousands of lives were lost, leaving behind so many loved ones. We will always remember them and the Heroes who gave all to save lives.  #NeverForget https://t.co/8PI7YjpJWq","date":"Fri Sep 11 13:21:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great progress is being made in Mississippi and across America! https://t.co/gAxyBAWJFh","date":"Wed Sep 09 13:51:13 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"More great opportunities for Mississippi’s workforce!","date":"Tue Sep 08 17:35:09 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our workforce on this Labor Day! I had the opportunity to visit with members of Mississippi's workforce in August. Read more... https://t.co/JrdNqgNMZ1 https://t.co/gOpaaJKdFr","date":"Mon Sep 07 15:35:52 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi's workforce is second to none! @GeneralAtomics is growing - again! Today, the company announced a $39.5 million corporate investment that will create 125 jobs in Shannon.","date":"Thu Sep 03 19:06:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/ixtAhwhXLQ","date":"Tue Sep 01 00:21:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great day in New Albany talking with our constituents! https://t.co/bKtDKi95H6","date":"Sat Aug 29 20:54:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for @TVAnews Board for approving a $200 million Pandemic Relief Credit to help so many people - when they need it most! Please click on the link for details. https://t.co/kzOPiIYS79","date":"Thu Aug 27 16:34:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/HLfQgEm1pR","date":"Wed Aug 26 13:40:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America is the land of opportunity! With the expansion of rural broadband, we will see more opportunities across the spectrum for families, farmers and businesses. Additionally, our economy is already making a comeback as more and more Americans return to work. Keep the faith!","date":"Tue Aug 25 22:56:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Grateful to discuss issues that are important to our constituents in New Albany tonight. https://t.co/qXsrCy2Gbt","date":"Tue Aug 25 00:11:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America is the land of promise and always will be! Throughout the history of our Nation, Americans have demonstrated a determination to thrive. Under the leadership of President Donald Trump, prosperity will be restored with the greatest American comeback in history!","date":"Mon Aug 24 21:40:51 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to present Lindsay Nichols with an American Flag flown over the US Capitol in honor of her late husband and Hero, DeSoto County Sheriff’s Dept. Sgt. Kenneth Nichols. He saved his son, William, from drowning while on vacation in Florida in July. https://t.co/akaF4rZ4in","date":"Mon Aug 24 18:06:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great day @AirbusHeli_usa in Columbus with @SenatorWicker and Mississippi State Senator Chuck Younger. Celebrating 1st delivery of 16 H125 helicopters to @CBP! https://t.co/5OPU5srPXJ","date":"Wed Aug 19 22:09:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful to have been a part of the ceremony in Columbus today for @AirbusHeli_usa. This First District job creator plays an important role in our national defense!","date":"Wed Aug 19 16:45:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"NauticStar Boats is a great provider of jobs in Amory. Thank you for the informative tour this morning. https://t.co/Szm9wCmeOL","date":"Tue Aug 18 14:56:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/dDtOfrcrPP","date":"Tue Aug 18 13:09:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Working in the First District, delivering the latest information that is important to our constituents via @cfordwtva https://t.co/zuqJixOapd","date":"Thu Aug 13 21:45:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Glad to have Wyatt Barrow (Tupelo) in DC! He is serving as an intern which includes assisting our policy team. An internship is a great opportunity to learn how our constituents are represented on Capitol Hill. Click to learn more.  https://t.co/9UzP8aBnlJ https://t.co/Z6nvntKqn0","date":"Tue Aug 11 22:38:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for the First District and for our great state!","date":"Tue Aug 11 15:44:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for our business owners in Mississippi and their employees who have been helped by this program. https://t.co/Ex81iqkKhU","date":"Mon Aug 10 22:31:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to know Mr. Robert Wilson! He is a Korean War Veteran who was wounded and earned a Purple Heart. Courageous man and an American Patriot! https://t.co/Uq4vEyPpO8","date":"Fri Aug 07 19:55:13 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tremendous progress is being made! https://t.co/HMVYfIIimu","date":"Thu Aug 06 21:30:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to the Iuka Rotary Club for the invitation! Enjoyed discussing issues that are important to Mississippi and our great Nation. https://t.co/CIRHlTlNUR","date":"Wed Aug 05 18:15:37 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for these men and women and for their commitment to service. https://t.co/XjfTWCADa2","date":"Tue Aug 04 17:44:36 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/oSd8AgNxXb","date":"Mon Aug 03 19:44:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The @USDA's Farmers to Families Food Box Program has been helping people when they needed it most. A third round is coming soon. Please read my newsletter. https://t.co/od7dwA9vy2 https://t.co/ewFaC8n9hq","date":"Fri Jul 31 00:02:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for the opportunity to discuss issues that are important to our constituents in the 1st Congressional District. https://t.co/AFvwqyTiiy via @MSYallPolitics","date":"Wed Jul 29 23:48:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Six more counties have been  added to MS COVID-19 restrictions list - Winston, Calhoun, Holmes, Yalobusha, Montgomery, and Lamar.  @tatereeves said they are monitoring Lee County where cases continue to increase.","date":"Fri Jul 24 20:39:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Governor Tate Reeves has extended state unemployment benefits through Sept. 26.","date":"Fri Jul 24 20:34:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"During a @HouseAgGOP hearing today, I requested @USDA Under Sec. Greg Ibach to consider providing aid to MS sweet potato farmers who have suffered because of COVID-19. They do not have a market to sell their 2019 crop. #MS01 https://t.co/zkaSSQjrkV","date":"Tue Jul 21 22:42:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Exciting news for the First District's hardworking Mississippians! I am thankful for the investment in our great state and our workforce!","date":"Tue Jul 21 19:13:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to speak on the House floor in support of the bipartisan defense bill that provides for our men and women in uniform and their families.  https://t.co/7R8snxROYk #FY21NDAA https://t.co/wHL4RPBjuK","date":"Mon Jul 20 19:17:53 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I have returned to Washington to debate the #FY21NDAA on the House floor. It is our goal to make sure our men and women in uniform and their families are provided for and our national defense is protected. https://t.co/JSnziG522E","date":"Mon Jul 20 18:00:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The hardwood industry has suffered a blow due to COVID-19. I have signed on to Congressman Fred Keller's letter to House leadership recommending additional relief. Please click for details. https://t.co/qLsQurKQwF","date":"Mon Jul 20 16:09:47 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Save the date for Academy Day 2020! Read all about it in my newsletter. We also feature 2d Lt Jessica Frederick who  graduated from the United States Air Force Academy. Click to read more! https://t.co/d168A8LuXe #MS01 https://t.co/iu31QYz38l","date":"Fri Jul 17 20:40:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Ground has been broken for the Lee County Career &amp; Technical Education Center! #GreatThingsLCS https://t.co/PWT8FhAuit","date":"Thu Jul 16 21:48:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to 2d Lt Conner Sprout, a 2020 @WestPoint_USMA graduate from Olive Branch. Our team presented him with a US flag flown in his honor over the US Capitol! https://t.co/mG3uIXDjaz","date":"Tue Jul 14 18:53:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Second Lieutenant Jessica Frederick (left), a 2020 @AF_Academy graduate. She will make her Monroe County family proud serving as an intelligence officer in the @usairforce! Good work! https://t.co/QVTfXTFo9q","date":"Mon Jul 13 23:29:09 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Reminder! https://t.co/lgc6epTYhf","date":"Mon Jul 13 18:23:43 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/gcNlhkGUnx","date":"Thu Jul 09 21:16:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"USMCA is a win!","date":"Thu Jul 09 01:38:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dr. Paul Lawrence, Veterans Administration Under Secretary for Benefits, will take questions from Mississippi Veterans via phone. Listen in and participate by dialing 833-380-0417. It begins at 4:00 CT tomorrow.","date":"Wed Jul 08 22:24:23 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The House Armed Services Committee has passed the FY 21 National Defense Authorization Act (NDAA). It is important that our troops have the support they need to defend our Nation. Details in this week's newsletter. https://t.co/Soa4hA1HA9 https://t.co/dkR0xqZbJP","date":"Wed Jul 08 19:06:45 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"These men and women will always be remembered. I was grateful to have Willy Weddle represent our office, honoring those who lost their lives to COVID-19. https://t.co/KdpFgIWofd","date":"Wed Jul 08 16:31:17 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to 2d Lt Marc Devon Rees - 2020 @AF_Academy  graduate and new member of @SpaceForceDoD! The Alcorn County native makes the First Congressional District proud. Details in my next newsletter. Sign up now!\nhttps://t.co/LefCcIU0Rp https://t.co/5ZrZOXqoSg","date":"Tue Jul 07 22:37:53 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Fourth of July! We live in the greatest Nation on Earth. https://t.co/gwt9J1gGkX","date":"Sat Jul 04 17:24:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The National Defense Authorization Act (NDAA) for Fiscal Year 2021 has passed. To read my #FY21NDAA priorities, please click on the link. https://t.co/Vdqng71E0N https://t.co/8BvhyTf0tf","date":"Thu Jul 02 20:14:44 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations!","date":"Wed Jul 01 22:10:23 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, we are marking up the #NDAA. I am pleased the House Armed Services Committee unanimously adopted my measure to make sure troops have enough PPE as we continue to fight COVID-19. This measure bolsters and protects the readiness of our Armed Forces. https://t.co/0KsF7MsmYp","date":"Wed Jul 01 21:57:19 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great day for Mississippi and our Nation! #USMCA","date":"Wed Jul 01 13:24:35 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Coming to you in this week's newsletter - great stories of our 1st District residents, including a new U.S. Military Academy at West Point graduate from Mississippi. Also, two families helping others during COVID-19. Read more... https://t.co/XABuEac9QX https://t.co/aCuplMmoQU","date":"Tue Jun 30 19:41:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to pay tribute to a man I greatly admired - Dr. James Henry Neely. He died on June 23. The West Point native greatly inspired countless people, living a life of public service. He accomplishments will always be remembered. https://t.co/7qOV2bAXFS","date":"Tue Jun 30 00:04:46 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @BHSDevils1 graduate Ravin Chittom! His parents, Daniel and Laurie Chittom, dropped him off @AF_Academy yesterday morning! I was proud to nominate Ravin and am thankful for his commitment to serve America as an officer in the U.S. Armed Forces! https://t.co/k8pROLlARK","date":"Fri Jun 26 21:40:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"COVID-19 testing continues by @UMMCnews and @msdh. Please take precautions to protect your health. https://t.co/khxUsWOpk2","date":"Fri Jun 26 19:31:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"UM, National Guard Launch Tuition Program For Service Members https://t.co/6aHbuh08Lv Great news @OleMissRebels and @nationalguardMS!","date":"Thu Jun 25 20:45:00 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The threats levied against my friend, Congressman Bennie Thompson, and his staff, should be dealt with swiftly and justly. Congressman Thompson, his family, and staff are in my prayers during this challenging process fueled by hatred.","date":"Thu Jun 25 17:14:35 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proposed NDAA Provision Would Protect Sexual Assault Survivors at USAFA - Air Force Magazine https://t.co/tGLWGtAgUE","date":"Tue Jun 23 21:09:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, in Washington, D.C., our work continues to ensure our men and women in uniform have the training and resources they need to continue protecting our Nation. Also - celebrating Mississippi's Sweet Potato Capital! Click for details. https://t.co/4Jtcg39lf2 https://t.co/JMCix76CgL","date":"Tue Jun 23 15:29:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is essential that our men and women in uniform and their families have the support they need to thrive. Thanks to @mactxpress @RepSpeier #MS01","date":"Mon Jun 22 18:51:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Father's Day to my dad, John Kelly. He was a leader, always inspiring us to be the best we could be. https://t.co/wKEfGyXqOs","date":"Sun Jun 21 12:30:13 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@realDonaldTrump's Executive Order will help promote best practices for law enforcement across the country. #MS01 https://t.co/LnBlOW8fck","date":"Fri Jun 19 20:01:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The 2020 Census is required by the Constitution. Let’s do this, Mississippi! https://t.co/w0325h22vc","date":"Thu Jun 18 22:59:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is important that Members of Congress get back to work in Washington, D.C. We should be able to debate the issues on the House floor. Please read my newsletter. https://t.co/MitzE0bP91 https://t.co/FlO0n5dwI6","date":"Tue Jun 16 16:37:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We live in the greatest Nation in the world. I am thankful for our men and women in uniform who have always protected our freedoms. Happy Birthday @USArmy! https://t.co/6711zYTeb0","date":"Sun Jun 14 19:35:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to James Dukes, 1st place winner of the First Congressional District Art Competition! James is a @BHSDevils1 9th grade student. Find out more about the contest at https://t.co/tRsUFfWXGq https://t.co/gPSvQ6dbu5","date":"Fri Jun 12 20:23:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Mississippi Back to Business Grant Program will go live at Noon on Thursday. For information about this program, please click on the link. https://t.co/7Kt1GczWEV","date":"Wed Jun 10 19:48:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Planting season is well underway for farmers in Mississippi and across America. It is vital that we make sure they have the resources they need to feed and clothe our Nation. Please read my newsletter. https://t.co/Vh3VfHZMzM https://t.co/g3UKpscZEc","date":"Mon Jun 08 18:05:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Let us all remember their service and sacrifice... https://t.co/ukCqtzJM3e","date":"Sat Jun 06 14:59:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program Flexibility Act is law. This bipartisan legislation will help small businesses recover. https://t.co/ese4gnftj4","date":"Fri Jun 05 22:08:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Saturday, June 6, is the final day the C Spire Health app will be used as a screening tool for COVID-19 testing. After that, Mississippians can be screened and scheduled for appt-only testing by calling @UMMCTelehealth at (601) 496-7200 or by going to https://t.co/wDjceoNSy4.","date":"Thu Jun 04 20:21:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"COVID-19 drive through testing (appointment required) will be conducted on June 4 at the Becker Community Center in Amory and June 5 at the Landers Center in Southaven. You can download the C Spire app at https://t.co/yZ1eNUh8tQ or call (601) 496-7200.","date":"Wed Jun 03 16:59:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippians should have access to broadband and not be left behind simply because they live in a rural area. The Rural Broadband Acceleration Act will help remedy the need for speed. Please read my newsletter. https://t.co/9ZvORWR4KT https://t.co/EnEKnfQ9LI","date":"Mon Jun 01 20:12:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Those who have received an Economic Impact Payment (EIP) card in the mail (in lieu of a check or direct deposit) can use it without paying a fee. Please click on the link to find a free ATM near you. https://t.co/SCavLgvgoS","date":"Wed May 27 19:44:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"An exciting day for our great Nation! @NASA @SpaceX #LaunchAmerica #CrewDragon","date":"Wed May 27 19:17:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So thankful for our men and women in uniform who gave their lives to preserve the freedoms we all enjoy. Your service and sacrifice will always be remembered. https://t.co/iC8LUWVoZw","date":"Mon May 25 11:01:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The coronavirus pandemic has interfered with many traditions, including high school and college graduations. Mississippians continue to be resilient. Please read my newsletter which features the leaders of tomorrow. https://t.co/VqCo7SXQEA https://t.co/aHu0pTyOoM","date":"Sat May 23 16:35:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@USTreasury has begun delivering millions of Economic Impact Payments by prepaid debit card. For more information, please click on the link. https://t.co/eGJjOcODkZ https://t.co/b3hopNl5Jo","date":"Thu May 21 21:58:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/p1UDSHC3vt","date":"Wed May 20 19:49:59 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Todd Tilghman! #MississippiProud","date":"Wed May 20 19:20:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Important information for our farmers. To learn more, please click on the link.","date":"Wed May 20 00:32:22 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Have a question about your Economic Impact Payment? Please click to get started. https://t.co/5nWmWtEBjL","date":"Tue May 19 22:07:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Relief is coming soon.","date":"Tue May 19 18:55:22 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Treasury and the IRS are starting to send nearly 4 million Economic Impact Payments (EIPs) by prepaid debit card, instead of by paper check. To learn more, please click on the link. https://t.co/MGYPQXmGEZ","date":"Tue May 19 18:22:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program has helped scores of Mississippi businesses stay afloat during the coronavirus pandemic. Here is the next step in the process.","date":"Mon May 18 17:12:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, members of the U.S. House of Representatives returned to DC to vote on the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act. Details in this week's newsletter. https://t.co/t2JgMuJX7j","date":"Sat May 16 17:51:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Farmers and ranchers who have suffered losses due to the coronavirus pandemic will soon be able to apply for assistance through the USDA. For more information, please click on the link. https://t.co/GPcWhTISDQ","date":"Fri May 15 20:32:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"H.R. 6800 - House Speaker Nancy Pelosi's wish list bill. I discussed my concerns about this legislation on @supertalk this morning. https://t.co/OocVl0eVmG","date":"Thu May 14 20:16:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our men and women in uniform always stand at the ready! Thankful for their service.","date":"Thu May 14 18:28:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On Thursday, @USDA hosts this webinar. Click for additional information. Coronavirus Food Assistance Program (CFAP) Direct Assistance to Producers Webinar https://t.co/ZK7XaURc0m","date":"Wed May 13 19:34:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to see First District companies doing their part to help others, including @AirbusHeli_usa's operation in Columbus! 2,000 masks were donated to the Lowndes Co. Vol. Fire Departments. Pictured is Chief Wayne Doyle. https://t.co/FtTu53TSDp","date":"Wed May 13 19:14:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am so thankful for all the healthcare professionals in hospitals and healthcare systems stepping up to help others during this pandemic. Thank you for your dedication! https://t.co/G3qHmH9sLN","date":"Tue May 12 21:27:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"#ToyotaMS welcomed back their team members today to a modified work environment. Changes are in place to help protect them from #Covid_19. Please read my newsletter. https://t.co/JcBvMIpGxF #MS01 https://t.co/x8EN69fhVa","date":"Mon May 11 19:20:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Mother's Day to my mom, Barbara Mott Kelly, and to my wife, Sheila! https://t.co/c47nDBF4vj","date":"Sun May 10 17:29:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"75 years ago, the Allied Forces liberated Europe. Their service and the many sacrifices made in the name of freedom will always be remembered. https://t.co/8Tl4S5Kyqq","date":"Fri May 08 19:14:00 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Not enough can be said about the important role nurses have played in response to #Covid_19. Let us all remember their hard work and dedication on the front lines and well beyond. #MS01 https://t.co/alMh0Hz4dN","date":"Wed May 06 19:32:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The First Congressional District Art Competition is moving forward! Submit artwork by May 29. Winner to be announced June 1. Click for more info. https://t.co/Xhmac5uwgC https://t.co/jsbHY9SXDK","date":"Tue May 05 21:14:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciate Toyota Motor Manufacturing Mississippi and the steps they have taken to ensure a safer working environment for their team. #Covid_19 #MS01","date":"Tue May 05 16:36:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Food security is national security. We must support our agriculture industry during this challenging time in America. Mississippi FARM Corps will help make that possible. Please read my newsletter. https://t.co/7ofCAfVqgY https://t.co/Qno49yK2R5","date":"Sat May 02 19:26:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to discuss issues that are important to Mississippians with @AllieWcbi https://t.co/J2gVRwiGI9","date":"Fri May 01 18:46:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@NIH and @GileadSciences announces Phase Three of a clinical trial for antiviral drug remdesivir - initial data shows \"clear-cut, significant positive effect in diminishing time to recover\" - Dr. Anthony Fauci. #COVID__19","date":"Thu Apr 30 18:22:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program is helping scores of Mississippians keep their employees on the payroll. Tommy Franks, owner of Magnolia Freight Services in Saltillo, was helped. Read about him in my next newsletter. Subscribe at https://t.co/tRsUFfWXGq https://t.co/X1YycVQm3e","date":"Wed Apr 29 22:05:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to discuss opening up America again and Mississippi FARM Corps on @supertalk. #MS01","date":"Tue Apr 28 20:38:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi prepares to ease some coronavirus restrictions https://t.co/LgqXTy9Bm4","date":"Mon Apr 27 21:56:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Testing for COVID-19 is taking place today at BancorpSouth Arena 375 East Main Street, Tupelo. An appointment is necessary. Click for details. https://t.co/ioyFFMXCkl","date":"Mon Apr 27 18:51:51 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are proud to continue your good work in Mississippi! https://t.co/nbWjqSlu2x","date":"Sat Apr 25 19:30:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program has been replenished, bringing relief to more small business owners in Mississippi and across America. Discussed the program on @wtva9news and in my newsletter. https://t.co/dnW8NGFfEi. #MS01 https://t.co/4Uc9gdfoPH","date":"Sat Apr 25 18:41:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce the launch of the Farm and Ranch Mission (FARM) Corps. This program will assist farmers who need workers to plant and harvest crops while providing jobs to men and women in uniform. Click to learn more. https://t.co/duGehdKcGi https://t.co/JHS7cEA89U","date":"Fri Apr 24 19:25:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@UMMCnews and @MSDH will conduct drive-thru testing on April 24 at the Oxford Conference Center, 103 Ed Perry Boulevard, Oxford, and on April 25 at Fairview Baptist Church, 127 Airline Drive, Columbus. Download the C Spire Health app https://t.co/P1EBdxCVZP or (601) 496-7200.","date":"Thu Apr 23 19:21:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, the U.S. House of Representatives will vote on legislation to replenish the Paycheck Protection Program and provide additional relief for hospitals and for testing. I discussed our return to DC on @supertalk https://t.co/8FrjAGjHwE","date":"Thu Apr 23 18:12:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for these good folks in Iuka who are making masks for front line and essential workers - over 4,000 already donated! Keep up the great work! #MS01 https://t.co/FbLmweszAy","date":"Wed Apr 22 19:53:30 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@msdh announces more drive thru COVID-19 testing locations. https://t.co/S5vMODDkcI","date":"Sat Apr 18 19:28:17 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please be weather aware on Sunday and have a plan. #MS01","date":"Fri Apr 17 19:26:09 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Governor Tate Reeves has extended the shelter-in-place order for one more week. #MS01","date":"Fri Apr 17 14:49:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news @TVAnews!","date":"Thu Apr 16 16:47:19 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Much has been accomplished to deliver aid to the American people while providing resources to help our small business owners. To learn more about these resources, please read my newsletter.https://t.co/Fr0cSaYGo0 https://t.co/ypK2W1obd8","date":"Tue Apr 14 22:18:03 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Free @UMMCnews COVID-19 screenings will take place Tuesday, April 14 at the Chickasaw County Agri-Center in Houston. For more information, please click on the link. https://t.co/RRYb6AEhTl","date":"Mon Apr 13 19:13:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@USDA offers guidelines to assist rural communities impacted by COVID-19.","date":"Mon Apr 13 16:09:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"God bless you and your family and the United States of America. https://t.co/mtz85Fdibc","date":"Sun Apr 12 15:02:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The IRS is offering a new online tool for those who usually do not file a tax return to register for an Economic Impact Payment. https://t.co/mhb2OjXSFj","date":"Fri Apr 10 19:44:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to see Kevin Charles Furniture in New Albany sewing masks that will help those who need them. Rusty Berryhill, company president and chairman of @MSManufacturers, will be featured in my upcoming Weekly Wrap-up. Sign up here: https://t.co/JHvdMnYPft https://t.co/067FhEnQUZ","date":"Thu Apr 09 22:24:42 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Scores of small business owners are taking steps to keep their employees on the payroll through the Paycheck Protection Program. For details about this program and the latest on the Economic Impact Payments, please click on the link. https://t.co/2oMLQKwNQ0 https://t.co/P7xef4sUdZ","date":"Wed Apr 08 17:29:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please stay safe and if you have to leave home, take precautions.","date":"Tue Apr 07 19:05:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So grateful for the men and women who are on the front lines now and always. #WorldHealthDay https://t.co/11KWf6cwzY","date":"Tue Apr 07 17:42:47 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Retiring Armed Services Lawmaker Unveils Plans to Change Military Family Policies | https://t.co/Cb8BjBfX9H https://t.co/q7ABvyOGmy","date":"Mon Apr 06 21:26:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@UMMCnews and @msdh is hosting a COVID-19 testing site in Ripley today until 4 p.m. Anyone experiencing symptoms must first be screened by using the telehealth app. https://t.co/ucgrWoPP6l or call (601) 496-7200. Testing site address: 10791 B Highway 15 South.","date":"Mon Apr 06 15:52:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of @Taylor_Machine and @msstate for their response to #COVID19! The First District manufacturer has converted 280+ ventilators. Now shipped to @msdh for distribution. @msstate is modifying the remaining ventilators. A total of 550 to help @MSEMA and @UMMCNews. https://t.co/PkvVg8NLuy","date":"Sun Apr 05 02:05:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The 2020 First Congressional District Art Competition reception will not be held due to COVID-19. Instead, a winner will be announced on May 15. Artwork will be accepted until May 12. For more information, please email melinda.whited@mail.house.gov https://t.co/lCSzWOYXtx","date":"Fri Apr 03 22:22:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Paycheck Protection Program has been launched as of today. Small business owners are encouraged to apply to keep their employees and cover operating expenses. Click for more information or visit the website below. https://t.co/TyylIyU2Sp https://t.co/6rapUR0bIS","date":"Fri Apr 03 16:32:56 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/Z3DE9nculU","date":"Thu Apr 02 19:47:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is critical that we take care of our Service Members and their families. They need our support as they watch over us at home and across the world. I am proud to co-sponsor Military Family Readiness legislation.","date":"Thu Apr 02 18:58:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am co-sponsoring a resolution with @RepStefanik that will hold China accountable for COVID-19. We demand an international investigation by public health officials from the U.S. and other countries to determine the amount of harm. \nhttps://t.co/RvgrFr6F0E","date":"Wed Apr 01 18:47:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Attention: Small Business Owners! We have heard from many of you and want to make sure you have the resources to get back on your feet. Please click on the link for the latest information. https://t.co/kn2gIl8q25","date":"Tue Mar 31 23:26:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America's hospital ships have been deployed to respond to #COVID19. Two years ago this month, I discussed the critical role they play in times of war and peace. https://t.co/y7RzzQHT1h","date":"Mon Mar 30 22:12:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"These are extraordinary times, but nothing we cannot overcome. Three pieces of legislation have been signed into law to help protect American lives and livelihoods. I discussed these measures on @supertalk this morning. https://t.co/CKLgNAHq5Z","date":"Mon Mar 30 18:27:00 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please continue to be vigilant and protect your health. For the latest information on our response to the coronavirus pandemic, please click on the link. https://t.co/RmEk5wV0D2 https://t.co/lls51aVMJi","date":"Sat Mar 28 19:40:36 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I applaud @UMMCnews for their profound progress in the effort to save more lives. #MS01","date":"Fri Mar 27 20:38:22 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@TVAnews to offer $1B of credit support to local power companies, enabling them more flexibility to respond to customers during the coronavirus outbreak. https://t.co/tbM1TRkIOB","date":"Thu Mar 26 22:51:07 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@TVAnews has announced plans to provide $1 billion in credit support for local power companies. This will give them more flexibility to respond to their customer's immediate needs in the wake of COVID-19.","date":"Thu Mar 26 20:42:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our team welcomes any and all questions. Visit my website for contact information. https://t.co/tRsUFfWXGq. Click below for more answers to your questions.","date":"Wed Mar 25 20:08:41 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of our @nationalguardMS who stand at the ready!","date":"Wed Mar 25 17:51:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Mississippi Department of Employment Security website has some good information and answers to frequently asked questions for workers impacted by COVID-19. Please click on the link for details.\nhttps://t.co/kXNQP3FvTq","date":"Wed Mar 25 17:37:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those impacted by severe weather in the Tishomingo area. Please be weather-aware and stay safe.","date":"Wed Mar 25 00:33:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #NationalAgDay and an opportunity to thank all of our producers for their hard work and dedication - especially during these challenging times. As a member of @HouseAgGOP, I will continue to do everything in my power to support them. #MS01 https://t.co/IIwGw7v91K","date":"Tue Mar 24 18:08:56 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our farmers and ranchers must have the support they need to feed our nation - especially in the midst of the COVID-19 pandemic. We cannot allow them to be left behind. It is time to pass the #CARESAct","date":"Mon Mar 23 22:23:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@UMMCnews has partnered with @CSpire to address COVID-19 with a smartphone telehealth app. Those with symptoms connect with a medical professional via the app. High risk people receive a next-day appointment for drive thru testing at MS State Fairgrounds.\nhttps://t.co/YFGzrMpsyJ","date":"Mon Mar 23 21:20:09 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Have a question or need assistance from our team? They are working from home and ready to take your call. Please click on the link for contact information.  https://t.co/viivurgYAu","date":"Mon Mar 23 18:50:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"If you have any questions, please do not hesitate to give us a call - 662 841-8808.","date":"Mon Mar 23 00:52:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We live in the greatest nation on Earth, capable of meeting any challenge with a swift and decisive response. My Weekly Wrap-up contains information you will want to read. https://t.co/xsAHs5emFi https://t.co/JwZfSKkv8f","date":"Sat Mar 21 19:21:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Small business owners who have been impacted by the coronavirus can apply for assistance. Click to get the process started. https://t.co/qp5gSblSIM","date":"Sat Mar 21 18:30:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The U.S. Small Business Administration is offering low-interest federal disaster loans to Mississippi small businesses impacted by the coronavirus. Click to get started. https://t.co/beXbwjKlyl","date":"Fri Mar 20 21:47:28 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for all those who are on the front lines from healthcare professionals to law enforcement. Truck drivers are on the road, hauling produce grown by our farmers and other goods to meet the needs of Mississippians and all Americans. #InThisTogether","date":"Fri Mar 20 20:51:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"U.S. Department of State | https://t.co/pAU32s2kcA https://t.co/VmkIfbjEo3","date":"Fri Mar 20 19:24:45 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated the opportunity to discuss our work in Congress to address the coronavirus on @supertalk today. To listen to the interview, please click on the link. https://t.co/UUED6wf0zP https://t.co/LPWnPzPHfo","date":"Thu Mar 19 19:42:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great resource!","date":"Wed Mar 18 21:03:23 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"State Medical Licensure Board recommends telemedicine during coronavirus outbreak https://t.co/7Jyfej9g3L","date":"Tue Mar 17 20:58:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@realDonaldTrump has announced expansion of #Telehealth to combat the spread of #COVID19. For information, please click the link. https://t.co/Cmf2rMNYbp","date":"Tue Mar 17 18:43:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please take precautions to protect your family.\nFor more prevention information, please visit https://t.co/rMIMsLoLm8. \n#COVID19 https://t.co/qlrIalrzxu","date":"Tue Mar 17 00:00:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please follow these guidelines. Americans stand strong against #COVID19 https://t.co/dFt0eyiJdi","date":"Mon Mar 16 20:48:43 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please continue to exercise caution and protect your health. https://t.co/5VY6H8kyCu","date":"Mon Mar 16 17:05:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy 108th birthday to @girlscouts and to @GirlScoutsHS! As a public servant I appreciate your commitment to bettering your communities.","date":"Thu Mar 12 19:39:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"For updates on the #coronavirus, including travel information, please visit https://t.co/7sMv5ubrkl https://t.co/Yj8jYg9JGI","date":"Thu Mar 12 15:45:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to meet with @msstate @smamsu students who traveled to Washington, D.C., to learn more about careers in public service. https://t.co/556sbKp55K","date":"Wed Mar 11 21:28:46 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/T1aNuTFuA0","date":"Wed Mar 11 17:22:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our pro-growth policies are creating more job opportunities for Americans! https://t.co/g1hRBshGto","date":"Mon Mar 09 20:54:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, Congress took action to address the spread of the Coronavirus. Please read my Weekly Wrap-up. https://t.co/6c8mBRMTH1 https://t.co/cffxwPpQuo","date":"Sat Mar 07 16:44:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseAgGOP, I enjoyed being able to sit down with @MSFarmBureau today. Their Input is important to our work on behalf of farmers and Mississippi's agriculture industry. https://t.co/3dB2xZ9J3c","date":"Fri Mar 06 22:27:16 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the invitation to discuss the issues that are important to our First District constituents at the Tupelo Kiwanis Club. https://t.co/nDUCrAG4n6","date":"Fri Mar 06 21:36:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great time reading to Saltillo Primary School students! #ReadAcrossAmericaWeek https://t.co/D0p180VtkB","date":"Fri Mar 06 15:12:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"US jobs report February 2020: nonfarm payrolls up 273,000; unemployment 3.5% https://t.co/s3mtrbcC3h","date":"Fri Mar 06 14:35:44 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Good information. Please take precautions to protect your health.","date":"Thu Mar 05 17:31:04 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, the House passed, with my support, a supplemental funding bill to help protect American lives from the Coronavirus. The Administration's response to this public health emergency is appropriate and necessary, ensuring the best possible outcome for our state and the nation. https://t.co/UmvTcReiE0","date":"Wed Mar 04 23:27:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciated having @USDA @SecretarySonny testify about the state of the rural economy during the House Agriculture Committee hearing today. https://t.co/gEQbg4Py5O","date":"Wed Mar 04 20:50:31 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I had a great run with @16thSma, fellow members of Congress, and Army legislative staff. We talked about SMA Grinston’s “This is My Squad” initiative. I am proud of what he is doing for the force. https://t.co/aiwLPMySHT","date":"Wed Mar 04 15:57:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was my pleasure to welcome @boyscouts @Yocona Eagle Scout Keerthin Karthikeyan to our DC office. This outstanding young man is one of thirteen delegates from across America selected to deliver the Boy Scouts Report to the Nation. I am proud of his devotion to public service. https://t.co/ncOZmY10QD","date":"Tue Mar 03 20:10:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those who have suffered the loss of a loved one in Tennessee last night. Let us all pray for recovery and healing.","date":"Tue Mar 03 16:47:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/k1TI70gUHC","date":"Mon Mar 02 21:08:50 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I want to wish all the best in retirement to Judge James Roberts. He has devoted himself to public service with a long and distinguished career. I am honored to call Judge Roberts a friend. https://t.co/xD112ExT7k","date":"Sat Feb 29 18:35:12 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On Friday, I was pleased to introduce a bill to name the United States Post Office in Amory in honor of Retired Command Sergeant Major (CSM) Lawrence \"Rabbit\" Kennedy. For the latest from Capitol Hill to the First District, please read my Weekly Wrap-up. https://t.co/8rsHTwybOh https://t.co/Eeivq3vcnE","date":"Sat Feb 29 17:32:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The 2020 First Congressional District Art Competition deadline to submit artwork is April 15, 2020! We are excited about the competition which highlights the many talented students across the First District. For more information, contact Melinda.Whited@mail.house.gov.","date":"Sat Feb 29 02:00:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Coronavirus: Be informed and call your provider if symptoms develop https://t.co/AomrFAr6Vt","date":"Fri Feb 28 19:22:47 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I was pleased to meet with @MSWGCAP. Mississippi is home to one of the original Squadrons launched after World War II! I appreciate these men and women who are devoted to serving our great Nation. https://t.co/22ulGlnyJE","date":"Fri Feb 28 18:24:46 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please take the necessary precautions to #BePrepared @CDCgov","date":"Thu Feb 27 22:17:45 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Shannon DeBlock, Grace Kim, and Michelle Norman came to DC to discuss the military's Exceptional Family Member Program (EFMP). Earlier this month, the HASC Subcommittee on Military Personnel held a hearing to explore the program's effectiveness. https://t.co/qgzwq2gq39 https://t.co/keFtedmr14","date":"Thu Feb 27 21:12:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing Todd Gale with Columbus Light &amp; Water today at our DC office. We have an open-door policy here and at our offices located in the First District. Visit my website at https://t.co/nTpBVIf6ea for more information. Come see us! #MS01 https://t.co/8ZDJad9N4i","date":"Wed Feb 26 22:39:27 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news!","date":"Tue Feb 25 17:51:49 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Need help from a federal agency, but don't know where to begin? Our team is ready to assist you! Click here to get started. https://t.co/o3zMz9xelA","date":"Mon Feb 24 23:08:52 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"If you would to commemorate a special occasion, our team can help you! We can have an American Flag flown over the U.S. Capitol and send it to you. For more information, please read my Weekly Wrap-up.  ↓\nhttps://t.co/V17hw2IPdj https://t.co/Get1IB2p3d","date":"Sat Feb 22 17:36:59 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/VeukFImC1h","date":"Thu Feb 20 22:48:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering the courage and bravery of all those who fought to protect our freedoms in the Battle of Iwo Jima 75 years ago. Earl Brown, an Itawamba County native, was there. I am honored to call this great WWII Veteran my friend. https://t.co/vnkMczvq6l","date":"Wed Feb 19 17:04:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to announce the dates for the 2020 First Congressional District Art Competition! Art will be accepted until April 15, 2020, and the reception will be held at Blue Mountain College on April 23, 2020. For more information, contact Melinda.Whited@mail.house.gov.","date":"Tue Feb 18 19:34:38 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/opKQ5dyRDV","date":"Mon Feb 17 16:43:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Catch my Weekly Round-up for updates from the First District to Capitol Hill. It's a good read!  https://t.co/B5ilbypbdV https://t.co/dPlQAqLiL0","date":"Sat Feb 15 18:35:42 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Mason Bay! The @LafCo_District senior has been appointed to @WestPoint_USMA. He is an outstanding student, community volunteer, and athlete. To learn more about attending one of America’s prestigious military academies, contact Robert.Smith@mail.house.gov https://t.co/c8TeUo3qiK","date":"Fri Feb 14 22:02:10 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I wish to welcome Retired U.S. Army Captain Adam Napier, a new member of our team. Adam will offer assistance to Veterans throughout the First District. Expect to see him when and where Veterans gather! He can be reached at Adam.Napier@mail.house.gov. https://t.co/lJiCJvSObg","date":"Fri Feb 14 01:03:55 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi’s community colleges play a critical role shaping our excellent workforce. Thanks for the update on the issues that help you achieve your goals.","date":"Thu Feb 13 01:09:22 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a great night to honor the Boy Scouts of America Pushmataha Area Council Eagle Scouts. #MS01 https://t.co/TNwNL6rIFu","date":"Sun Feb 09 04:59:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please sign up for weekly updates from Washington. Click the link to get started. https://t.co/FmxK0OaSIn. #MS01","date":"Sat Feb 08 17:53:42 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week in Washington, I joined President Trump in celebrating the victory of the Great American Comeback. Please read my Weekly Wrap-up! https://t.co/z3f72oaM2A #MS01 https://t.co/ezju7aJwzd","date":"Fri Feb 07 23:03:41 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you @realDonaldTrump for your commitment to creating more jobs for Mississippians!","date":"Fri Feb 07 14:18:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In the words of @realDonaldTrump,\"We must always remember that part of our job is to put America first.\" Our Commander-in-Chief has kept his promises, delivering on all fronts. https://t.co/J8ZVqDbq8S  #MS01","date":"Wed Feb 05 04:07:19 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The best is yet to come. #SOTU","date":"Wed Feb 05 04:05:11 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tonight, we celebrated American economic and military strength and the great vision of America’s future. The best is yet to come. #SOTU","date":"Wed Feb 05 03:26:28 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"“If you attack American citizens, you forfeit your life.” -@realDonaldTrump \n\nThank you to our brave men and women who continue to defend Americans at home and abroad! #SOTU","date":"Wed Feb 05 03:18:05 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"All people are made in the image of God and every person has value. #SOTU","date":"Wed Feb 05 03:02:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@realDonaldTrump is committed to creating a brighter future for working families by ensuring that every child can have a great education and by supporting families with paid family leave. #SOTU","date":"Wed Feb 05 02:57:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@limbaugh has spent a lifetime fighting for freedom and supporting charitable causes. No one is more deserving of this award and I wish him a speedy recovery. #SOTU","date":"Wed Feb 05 02:56:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@realdonaldtrump understands the threat of an unsecured Southern Border. The President has made great progress securing the border and I’m optimistic he will continue working to keep American’s safe and protect our interests. #SOTU","date":"Wed Feb 05 02:46:44 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America is strong once again! We have a 50-year low employment rate, two great new trade agreements, and are yielding great results from Opportunity Zones. I look forward to seeing this unprecedented economic growth continue. #SOTU","date":"Wed Feb 05 02:12:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I have long advocated for policies that will strengthen protections for the unborn, and I will continue to work with my colleagues to give them a voice. Please read my January Wrap-up.  https://t.co/9Qg4YlbCkE  #MS01","date":"Fri Jan 31 22:52:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We will pray for strength and healing, J.T.","date":"Fri Jan 31 21:42:48 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today @realDonaldTrump will sign #USMCA!  This is an incredible win for all Americans families, workers, and farmers. \n\nPromises made, Promises kept. \n\n#USMCAwin","date":"Wed Jan 29 15:13:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I called out @SpeakerPelosi yesterday for supporting dishonesty. Thank you to @MSyallpolitics for helping me spread this message to the Mississippians who see right through the @RepAdamSchiff show.","date":"Tue Jan 28 18:42:47 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dems are still solely focused on the #impeachmentsham. \n\nMeanwhile the fentanyl ban expires in 9 days. \n\nWe must continue to work towards ending the #opioidcrisis. \n\n@SpeakerPelosi should bring this bipartisan extension to a vote in the House!","date":"Tue Jan 28 17:04:34 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@SpeakerPelosi is proud of @RepAdamSchiff’s dishonesty, unfairness, and lack of credibility. Democrats will stop at nothing to prevent @realDonaldTrump from winning 2020! https://t.co/II2B9y0NW4","date":"Mon Jan 27 16:42:29 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great memories and a great guy! You have made us proud. #MS01","date":"Fri Jan 24 22:20:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a Christian, every day when I walk,  I am marching for life. It is my duty as a Christian and Member of Congress to protect the lives of the unborn. Thank you  @realDonaldTrump for doing your part to advocate for the sanctity of life. #ProLife","date":"Fri Jan 24 15:09:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your Representative, it is my duty to fiercely protect the lives of the unborn. I am thankful to be recognized for my support of pro-life legislation with an A rating from @SBAList. #ProLife #MS01 https://t.co/hixelIQuaf","date":"Wed Jan 22 16:13:58 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Northrop Grumman Corporation has announced an $8.3 million plant expansion, creating 40 jobs at the company's Iuka facility. This investment is a testament to Mississippi's outstanding workforce and the important role Mississippi plays in U.S. aerospace capabilities. #MS01","date":"Wed Jan 22 14:42:01 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The life and legacy of Martin Luther King, Jr. will be recognized and celebrated at gatherings across Mississippi and throughout America today. This great civil rights leader will always be remembered. #MS01 https://t.co/tqWEuHXwCX","date":"Mon Jan 20 13:26:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, @realDonaldTrump signed Phase One of the trade agreement with China and the United States-Mexico-Canada Agreement (USMCA) - trade victories for America. Please read my Weekly Wrap-up. https://t.co/NHFH8BKJGd #MS01 https://t.co/s1optZZib3","date":"Fri Jan 17 21:52:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am so thankful for @realDonaldTrump’s work to protect all those who wish to practice their First Amendment religious rights. #ReligiousFreedomDay #MS01","date":"Thu Jan 16 22:10:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"USMCA is a win for famers, businesses, ranchers, and manufacturers. I applaud @realDonaldTrump  for seeing this through to the finish line!","date":"Thu Jan 16 17:51:20 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"President Trump signed the Phase One Trade Agreement with China today. @realDonaldTrump  continues to make good on his promise to fix failed policies. This agreement will be an incredible improvement for American businesses, farmers, manufacturers, and innovators!","date":"Wed Jan 15 20:10:14 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":". @SpeakerPelosi delayed sending the articles of impeachment to the Senate for nearly a month. What happened to their sense of urgency? Democrats know it’s all a sham!","date":"Wed Jan 15 16:06:18 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"USMCA is a win for Mississippi and America! #MS01","date":"Wed Jan 15 15:40:04 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Governor @tatereeves! I look forward to working with you and wish you well in this new role. #MS01","date":"Tue Jan 14 19:53:59 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Iranian people are done with the regime’s corruption and brutality. We need to stand with the people of Iran to help them achieve a better future!","date":"Tue Jan 14 17:08:54 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been an honor working with @PhilBryantMS - a leader who has demonstrated a deep devotion to the people of Mississippi. Every day, in every way, Governor Bryant has made us proud. #MS01","date":"Tue Jan 14 15:31:24 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This year is the 20th anniversary of the Trafficking Victims Protection Act. I’m thankful for @realDonaldTrump’s commitment to end human trafficking by naming January National Slavery and Human Trafficking Prevention Month!","date":"Mon Jan 13 18:58:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts are with all those who suffered damage. Thank you @PhilBryantMS #MS01","date":"Sat Jan 11 19:59:25 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On January 2, 2020, our military successfully carried out a mission to eliminate a brutal terrorist - Qassim Soleimani. I am proud of the leadership demonstrated by @realDonaldTrump - our Commander-in-Chief. https://t.co/kUONVKG6TT  Click to read my Weekly Wrap-up. #MS01 https://t.co/SythGfL2Ne","date":"Fri Jan 10 21:54:36 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please be weather conscious and have a plan in place. Be safe! #MS01","date":"Fri Jan 10 20:38:04 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"President Trumps’s decision to impose additional economic sanctions will apply more pressure on Iran to cease attacks on Americans and return to the bargaining table. @realDonaldTrump #MS01","date":"Fri Jan 10 18:45:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Democrats continue to attempt to undermine the President with a bizarre resolution. @realdonaldtrump took action to keep the American people safe by taking out a terrorist who was responsible for the deaths of hundreds of American troops.","date":"Thu Jan 09 16:56:04 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today is National Law Enforcement Appreciation Day. I am thankful for all they do to protect us. #MS01","date":"Thu Jan 09 14:01:32 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you @realDonaldTrump for protecting our troops and our great Nation. #MS01","date":"Wed Jan 08 18:10:08 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our men and women in uniform serving in the Middle East need to know they have our support back home. Now more than ever, we must stand united and support our Commander-in-Chief and servicemembers abroad. #MS01","date":"Wed Jan 08 16:43:40 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"National security must be America's chief priority. I support President Trump's decision to eliminate Qassem Soleimani before he could take more American lives. #MS01","date":"Tue Jan 07 21:21:15 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In June, Circuit Court Judge Andrew Howorth will retire after a long and distinguished career in the field of law. As founder of the Third Judicial District Drug Court, he has worked tirelessly to improve lives with profound success. I wish him well in his retirement.  #MS01","date":"Mon Jan 06 19:01:57 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"If you have damage from Tropical Storm Olga (Oct. 26) in Alcorn, Prentiss, Tippah, and Tishomingo Counties, @SBAgov Customer Service Center is now open @CrossroadsArena in Corinth. For more information about services and office hours, call 1-800-877-8339. #MS01","date":"Fri Jan 03 21:34:02 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciate all that you have accomplished on behalf of Mississippi and your commitment to improving the quality of life for one and all. #MS01","date":"Fri Jan 03 19:26:26 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy New Year! #MS01 https://t.co/e6itZ6lgz3","date":"Wed Jan 01 20:57:21 +0000 2020","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"From the time I first took office in 2015 to present day, it is my goal to advocate for policies that improve the quality of life for Mississippians. As we prepare to return to DC in January, I offer you a review of our work in 2019. https://t.co/B00qX7iX7X  #MS01 https://t.co/QClV2HQ5nS","date":"Fri Dec 27 20:15:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this Christmas Day, it is my hope that you and your family make many cherished memories that will last a lifetime. Please keep our men and women in uniform in your thoughts and prayers. Many will be far from home during the holidays. #MS01 https://t.co/mlEV5dVbBr","date":"Wed Dec 25 13:01:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In case you missed it, I discussed my concerns about the impeachment of President Trump on @supertalk on Thursday. My interview follows Congressman Michael Guest. Please click the link to listen. #MS01 https://t.co/gw0xRGyKu6","date":"Fri Dec 20 21:05:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"2019 was a great year! We are so thankful for all of our constituents that visited and everything we accomplished. Merry Christmas and Happy New Year! #MS01 https://t.co/cF4f5RrVO1","date":"Fri Dec 20 16:51:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, @Google announced that a Google Operations Center will be opening in northwest Mississippi. This will bring more than 350 jobs to Mississippi! We are excited to have Google in our great state!","date":"Fri Dec 20 15:57:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, the U.S. House of Representatives passed the United States-Mexico-Canada Agreement (USMCA), legislation that will modernize the North American Free Trade Agreement (NAFTA). #MS01 https://t.co/QX01yMfDWy https://t.co/olQ5qJow9P","date":"Thu Dec 19 21:48:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"#USMCA is a 21st-century trade deal that will fuel economic growth across America and in Mississippi, create jobs and expand opportunities for our farmers, manufacturers and workers. #USMCAnow","date":"Thu Dec 19 17:02:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Following hours of debate in the U.S. House of Representatives, the Articles of Impeachment were passed by a partisan vote with zero evidence or facts. I remain adamantly opposed to this witch hunt. #MS01 https://t.co/5CF1hrJ9p0","date":"Thu Dec 19 01:55:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This impeachment sham is absurd.  I urge the Senate to acquit so @realDonaldTrump can continue winning on behalf of the American people. https://t.co/HBJotmHpma","date":"Wed Dec 18 23:29:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today I will vote NO on impeachment against @realDonaldTrump!","date":"Wed Dec 18 17:32:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those impacted by severe weather on Monday. Recovery will be difficult, so be sure to offer them a helping hand when possible. #MS01","date":"Tue Dec 17 13:13:00 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Battle of the Bulge took place 75 years ago. Today we honor the brave men and women who served in World War II and put an end to Hitler’s regime. Thank you to our World War II Vets and those that continue to serve today. #MS01 https://t.co/IKoSDOodCQ","date":"Mon Dec 16 16:44:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Democrats’ Articles of Impeachment are unconstitutional and fail to meet the express criteria for impeachment. This continues to be a blatant attempt to overturn the election and to prevent @realdonaldtrump from winning 2020.","date":"Fri Dec 13 15:10:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Secretary Purdue announced an additional $550 million dollars in FY19 for rural broadband infrastructure development. This will connect rural communities to support agriculture, e-commerce, healthcare, and education Another example of @POTUS keeping promises to rural America.","date":"Fri Dec 13 14:13:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":".@SpeakerPelosi’s partisan prescription drug plan H.R. 3:\n-limit more than 100 cures\n-politics over patients \n-stifles innovation \n\n#MoreCures, Lower Costs H.R. 19: \n-completely bipartisan \n-promotes more cures \n-transparency &amp; accountability","date":"Thu Dec 12 17:49:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, the National Defense Authorization Act (NDAA) for Fiscal Year 2020 passed in the House of Representatives. Prior to the vote, I discussed my support for this bill on the House Floor. Please click to watch my remarks. #MS01 https://t.co/NvIMi4zMq7","date":"Wed Dec 11 23:30:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"#TrentKellytie makes it to the House floor! Merry Christmas! https://t.co/sfWyNh8NmN","date":"Wed Dec 11 21:15:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Getting into the Christmas spirit with this #tieoftheday! https://t.co/XgDr8l2AuV","date":"Wed Dec 11 17:32:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Lower Costs, More Cures Act uses bipartisan reforms to lower out of pocket spending, protect access to new medicine and cures, and champion competition. Every single provision is bipartisan. #HR19","date":"Wed Dec 11 14:43:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Articles of Impeachment filed against @realDonaldTrump fail to prove abuse of power and obstruction. This blatant attempt to place partisan politics over the will of the American people is unjustified. #MS01","date":"Tue Dec 10 22:38:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Republicans advocated for #USMCA for months while @SpeakerPelosi pushed the impeachment sham. No more delays. It’s time to vote and pass USMCA! https://t.co/It7rcAAe2v","date":"Tue Dec 10 15:43:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I, along with 158 of my colleagues, sent a letter to @SpeakerPelosi to urge her to ensure that the House takes up and passes USMCA. #USMCA would spark economic growth, drive innovation, and create jobs. \n\nIt's time to put aside the #impeachmentsham and pass USMCA! https://t.co/jLyLacdtsk","date":"Mon Dec 09 16:17:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On December 7, 1941, more than 2,300 lives were lost during the surprise attack on the U.S. Naval Base at Pearl Harbor. These soldiers, sailors, airmen and Marines paid the ultimate sacrifice, giving their all in the name of freedom. We will always remember them. #MS01 https://t.co/FOHg7mxFEz","date":"Sat Dec 07 14:01:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, @realDonaldTrump approved @PhilBryantMS's request for a major disaster declaration for the State of Mississippi. We are thankful for this declaration which will aid in the recovery from severe weather that occurred on October 26, 2019. #MS01","date":"Fri Dec 06 20:54:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Ashley Furniture in Ecru! The company is expanding, a $25 million investment that will create 100 jobs.  Pro-growth policies build confidence in corporate America. #MS01","date":"Fri Dec 06 16:34:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Record breaking jobs report! Unemployment is at a 50 year low! Americans are winning thanks to @realDonaldTrump.","date":"Fri Dec 06 14:44:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, Mississippi's congressional delegation sent a letter to President Donald Trump asking him to consider @PhilBryantMS's request for a major federal disaster declaration.  https://t.co/hOZhpRfJPk #MS01","date":"Thu Dec 05 21:32:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Democrats have been obsessed with impeaching President Trump since the beginning. It’s all a charade to prevent President Trump from winning again in 2020.","date":"Thu Dec 05 21:28:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Americans received 26.3 billion robocalls last year. Yesterday we passed the bipartisan TRACED Act to help end these disruptive and automated calls! https://t.co/J5IPCuEROZ","date":"Thu Dec 05 17:59:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I commend @USDA for issuing today's rule restoring fiscal conservatism and preserving SNAP benefits for those who need it most. To read more about the rule, please click on the link. https://t.co/J1enhpv1aC","date":"Wed Dec 04 22:33:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"If impeachment is so clear, then why does the Judiciary Committee have professors testifying instead of firsthand, fact witnesses? Expert witnesses and hearsay are no substitution for facts! #MS01","date":"Wed Dec 04 19:50:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/LV8nHcUxO5","date":"Wed Dec 04 15:45:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Democrats sent @RepAdamSchiff’s report to the Judiciary Committee. This report is nothing but unfounded accusations and assumptions based on hearsay. \nClick here for the facts:\nhttps://t.co/u2le8behTH","date":"Tue Dec 03 23:53:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with the Cochran family. #MS01","date":"Tue Dec 03 11:17:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am a proud cosponsor of House Resolution 730, Expressing support for the recognition and celebration of the vital role of small businesses, along with the efforts of the Small Business Administration to help Americans start, build, and grow businesses. #ShopSmallSaturday #MS01 https://t.co/WdBQJ83Dat","date":"Sat Nov 30 19:09:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Thanksgiving! As we gather around the table for food and fellowship, please remember all the men and women in uniform who are watching over us at this hour. https://t.co/JvN3RBZVKk  #MS01 https://t.co/Go1Gx6Du8y","date":"Thu Nov 28 16:12:57 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been almost a whole year since President Trump signed USMCA. That is a whole year that the Majority has chosen to put their partisan politics above the American worker. #USMCA is a no brainer and should be brought to a vote!","date":"Thu Nov 21 18:45:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We must uphold our commitment to our farmers by passing USMCA to ensure American Agriculture remains the strongest and most competitive in the world. #MS01 https://t.co/sHx2Zv3GMo","date":"Wed Nov 20 18:38:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tim Morrison and Lt. Col Alexander Vindman testified the transcript was accurate. This hearing is a partisan sham! The American people see through it. https://t.co/WSW15OUWSc","date":"Tue Nov 19 18:09:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this day in history President Lincoln delivered The Gettysburg Address. Follow the link to learn more: https://t.co/CxGXxC5cxK https://t.co/pmTeV257YB","date":"Tue Nov 19 17:44:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for the First District and the great state of Mississippi. We are thankful this investment in our workforce. https://t.co/L8z6cG1I7p  #MS01","date":"Mon Nov 18 18:56:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Viewpoint: Veterans deserve their American Dream https://t.co/uXq2glIKv3 via @WBJonline","date":"Mon Nov 18 16:21:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi State Representative Steve Holland has proudly served the people of District 16 for 36 years. He is a true Mississippian who is known for his enthusiasm and a steadfast commitment to public service. https://t.co/5ofpd8Ncsq #MS01 https://t.co/mcaY8sNzNL","date":"Sat Nov 16 16:01:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On November 11, ceremonies were held in Mississippi and across our nation to honor all those who have proudly worn the uniform. Let us all remember their service and the families who have supported them. Please read my newsletter. https://t.co/G6Bad8lDwj #MS01 https://t.co/QiB4jmStYR","date":"Fri Nov 15 21:42:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"China is lifting its 4 year ban on US poultry. Poultry is Mississippi’s top ag product, making this great news for our farmers and economy! #MS01   https://t.co/KbP6nXIAMp","date":"Fri Nov 15 17:14:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Retiring Lee County Justice Court Judge Sadie Holland is a legendary public figure who served the people of Lee County during a long and exemplary career. It was a pleasure to honor Judge Sadie on the House Floor. https://t.co/Lrqhv3XdZK  #MS01 https://t.co/7fJenymzX0","date":"Fri Nov 15 14:59:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The American people deserve the facts. The impeachment sham must stop! Follow the link to see my floor speech on impeachment. https://t.co/ngpiui408W https://t.co/PbqsMZJyfV","date":"Thu Nov 14 21:48:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Former Speaker of the Mississippi House of Representatives Billy J. McCoy was a devoted public servant who will always be remembered for his many accomplishments. To watch my remarks on the House Floor, please click on the link.  https://t.co/WPRbYarVrI #MS01 https://t.co/mSvKkXegQ0","date":"Thu Nov 14 20:25:00 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Another big win for Mississippi and our workforce. Pro-growth policies and a booming economy give employers the confidence to expand and create more jobs! #MS01","date":"Thu Nov 14 14:21:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The surging economy is giving companies the confidence to grow and create more jobs. @realDonaldTrump's robust trade agenda includes many potential economic opportunities in Mississippi and across the U.S. #USMCAnow #MS01 https://t.co/xdxw32NRJq","date":"Thu Nov 14 02:00:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Mississippi economy benefits from the $3.2 billion in exports that we sell to Canada and Mexico. That amount is expected to grow with passage of the USMCA. #USMCAnow #MS01 https://t.co/Ky3tGgvdsv","date":"Wed Nov 13 19:01:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This “impeachment inquiry” is a sham! https://t.co/vr5M6OSEOh","date":"Wed Nov 13 17:40:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The USMCA achieves bipartisan priorities and delivers a win for America’s farmers, ranchers, businesses, and workers. #USMCAnow https://t.co/F2oocpdWRI","date":"Wed Nov 13 14:04:32 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with the family of the former speaker of the Mississippi House of Representatives Billy McCoy. #MS01","date":"Wed Nov 13 12:50:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Agriculture is Mississippi's #1 industry, employing 29 percent of our workforce and contributing $16.75 billion to the state's economy. USMCA creates more trade opportunities across the board. #USMCAnow #MS01 https://t.co/cB0UvaGA68","date":"Wed Nov 13 12:00:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today we are celebrating 100 years of @FarmBureau! This is a great reminder that #USMCA would be a win for Americans! https://t.co/fgxytcIWIq","date":"Tue Nov 12 18:07:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating a milestone today! Thank you @FarmBureau  for advocating on behalf of our farmers and ranchers. #AFBF100 #MS01","date":"Tue Nov 12 17:38:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was humbling to be a part of this special day and to thank each and every Hero for their service. #MS01","date":"Mon Nov 11 18:21:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for our Veterans and their families who we recognized this morning at Guntown Middle School. #VeteransDay #MS01 https://t.co/QKCoV3JzOy","date":"Mon Nov 11 15:39:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today we thank our veterans and honor their service and bravery to our nation, as well as the dedication of their families. #MS01 https://t.co/0SLFFzN3Xm","date":"Mon Nov 11 14:56:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a special morning at Renasant Bank in Tupelo where I had the opportunity to thank our Veterans for their service. #MS01 https://t.co/0H6sYtr3Bd","date":"Fri Nov 08 17:56:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Livestock and catfish producers suffer mounting losses due to protected predatory birds. I have joined @SenHydeSmith @SenatorWicker and @RepMichaelGuest urging @USFWS to change the rules. https://t.co/bRwnGo5SbW #MS01 https://t.co/dxEU0PUQSt","date":"Wed Nov 06 20:03:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I believe all people are made in the image of God, and therefore every person has value. As your voice in Congress, I believe it is our duty as a nation to protect the lives and remains of the unborn. #HR4934 https://t.co/GAp5ACS7xq","date":"Tue Nov 05 16:42:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Click this link for more: https://t.co/KxQTcGBVWf https://t.co/1dHepVvwmw","date":"Tue Nov 05 14:41:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy National Veterans Small Business Week! We're celebrating the 2.5M veterans who served their country and now serve their communities as #VetBiz owners. Need help growing your business? Visit the new #GrowWithGoogle hub → https://t.co/jps1SA5GVE","date":"Tue Nov 05 14:13:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Join us in celebrating veteran-owned businesses across the United States this week. We are grateful for and inspired by their sacrifice and service in and out of uniform! #MS01 https://t.co/iJuXp2eOSt","date":"Mon Nov 04 15:51:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Another historic visit to Tupelo by President Donald Trump. #MS01 https://t.co/JQQjxTxkvU","date":"Sat Nov 02 01:53:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I have been humbled by the strength of the Gold Star families I have worked with to get The SFC Sean Cooley and SPC Christopher Horton Congressional Gold Star Family Fellowship Program Act passed in Congress. Please read my newsletter. https://t.co/VVNUB4hVpf #MS01 https://t.co/fRtmIRD8qf","date":"Fri Nov 01 21:47:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today I voted NO to the #ImpeachmentVote. This resolution denies @realDonaldTrump due process. #MS01 https://t.co/qmCq1Niyoj","date":"Thu Oct 31 15:58:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"House Democrats introduced H. Res. 660 to formalize their impeachment inquiry. This resolution reaffirms the process has been tainted and biased from the beginning, while failing to provide Republicans and the Administration the same due process rights. https://t.co/XmmAxS6bl9","date":"Wed Oct 30 21:45:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"https://t.co/WOjPDEK4sB","date":"Wed Oct 30 15:36:20 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I spoke on the floor of the U.S. House of Representatives about H.Res. 107, The Sergeant First Class Sean Cooley and Specialist Christopher Horton Congressional Gold Star Family Fellowship Program Act, a bill I was proud to introduce. Click to learn more! https://t.co/jxTmXVHfAm","date":"Tue Oct 29 22:24:57 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This morning we had the pleasure of meeting with @Mission_Ready CEO MG (Ret.) Larry Harrington and Executive, Business Coordinator Ashley Winburn to discuss how we can work together to strengthen national security and promote the welfare of America’s children. #MS01 https://t.co/qUB7pn9bFs","date":"Tue Oct 29 15:14:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Join us in saying #nomore to human trafficking in Mississippi by participating in No More Trafficking MS awareness day today! Post a picture with NO MORE on your hand. Save the National Human Trafficking Hotline number 888-373-7888. #MS01 https://t.co/cD5czoFzTi","date":"Mon Oct 28 16:46:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those who have suffered damage from today’s storm system.  Not enough can be said about the hard work and dedication of our first responders and utility crews who are working at this hour. #MS01","date":"Sun Oct 27 01:04:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So thankful for our men and women in uniform and for their families. Many sacrifices are made to protect our freedoms. #MS01","date":"Sat Oct 26 16:54:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Please dispose of any unused prescription drugs. For a drop off location near you, please click the link. https://t.co/n2JrVigl1A #MS01 https://t.co/uVTYCsqGq7","date":"Sat Oct 26 15:03:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Red Ribbon Week is a time to remember that by staying drug free you are sending a message to yourself and others about how you value yourself and your community. Speak out in support of healthy choices in support of Red Ribbon Week. #MS01","date":"Wed Oct 23 17:25:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Timber is the 2nd most valuable commodity in Mississippi with over 19.7 million acres of forest lands. Mississippi ranks number one in the nation in the number of Certified Tree Farms with more than 3,200. We are thankful for our foresters! #MS01","date":"Tue Oct 22 18:55:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations @the_msms for being selected @NicheSocial's 6th best public high school in the nation! The MSMS faculty has been ranked number 1 in the U.S. for three consecutive years! #MS01","date":"Mon Oct 21 21:34:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The secretive, partisan impeachment process is an attempt to remove a duly elected president and undo the will of the American people. #MS01","date":"Mon Oct 21 19:25:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for Prentiss County and our workforce!  #MS01","date":"Sat Oct 19 18:42:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our First District Athletes!\nAlex Cornelison, a 2019 @tcsdsocial graduate, was beyond excited when he was recruited to play for the @NEMCCTigers. Read more here: https://t.co/Ka4fqJk8dc #MS01 https://t.co/vfwVXq4e85","date":"Fri Oct 18 20:40:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Members of Congress took an oath to protect and defend the Constitution. Nowhere in the Constitution does it say that the Speaker of the House or Intel chairman has sole power in an impeachment inquiry. That power belongs to the whole House! We should have a vote! #MS01","date":"Fri Oct 18 18:18:20 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Every year, farmers invest their time and energy producing crops to feed and clothe our Nation. We must preserve their way of life.  Please read my newsletter. https://t.co/L8e4OuWdxd #MS01 https://t.co/sZ5vDlFZmf","date":"Thu Oct 17 20:49:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The partisan impeachment process has no transparency, no vote, and is taking place behind closed doors. If there were any basis to the claims it would be in public. \nhttps://t.co/kTd2gPhSz5","date":"Thu Oct 17 17:53:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The bipartisan #USMCA would improve American business by adding to the economy and creating jobs. It’s time to pass USMCA now! #MS01","date":"Wed Oct 16 13:02:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @MSManufacturers and to John H. McKay! #MS01","date":"Mon Oct 14 22:19:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy anniversary @AirbusHeli! #AirbusHeliUS50years #Lakota #MS01","date":"Mon Oct 14 17:51:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today is #NationalFarmersDay! We appreciate their steadfast commitment to feeding and clothing our great nation. #MS01 https://t.co/s1UnYeLuU4","date":"Sat Oct 12 14:38:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great time tossing the coin at the @NWCC_Rangers football game.  Thanks to @MichaelHeindl and his wife, Jennifer!  #MS01 https://t.co/eO0XPN8KP4","date":"Fri Oct 11 22:46:32 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great night tossing the coin at the @NWCC_Rangers football game! #MS01 https://t.co/OOTvsBpl4v","date":"Fri Oct 11 14:13:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In West Point, Graham Roofing is thriving under the leadership of Jonathan Poland, Christee Holbrook, and Suzanne Richardson.  #MS01 https://t.co/9G5f3Ch9Po","date":"Wed Oct 09 17:50:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are thankful for all of our job creators in the First District including Columbus Brick Company.  Enjoyed the tour with Quinton Hensley, Al Puckett, and Robert Maner.  #MS01 https://t.co/dWQOhDogo6","date":"Wed Oct 09 17:39:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Speaking with Soldiers and leadership of the 82nd Airborne, Forces Command and Special Operations Command at Fort Bragg, NC hammers home the need to get them the resources needed to fight and win America’s wars. #MS01 https://t.co/Cn8ZfSmjaJ","date":"Fri Oct 04 20:32:16 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is the duty of Congress to set aside partisan politics and do what Americans expect of us.  Please read my newsletter.  https://t.co/tTIBUhdLNf  #MS01 https://t.co/X3oYkeD1kF","date":"Fri Oct 04 18:06:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today is Manufacturing Day and an opportunity to recognize the impact corporate investment has in our great state and across the nation.  #MS01 https://t.co/0CIExwzT1C","date":"Fri Oct 04 12:09:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great morning to thank Mississippi Lieutenant Governor Tate Reeves for all his great work with @nationalguardMS!  #MS01 https://t.co/CeUMW8yXwz","date":"Thu Oct 03 15:34:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful for the great relationship between America and Uzbekistan! @JavlonVakhabov  #MS01","date":"Tue Oct 01 19:52:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Important information: Please take notice.  #MS01","date":"Tue Oct 01 19:46:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our First District Athletes: \nCaleb Huggins, a Burnsville native, is a pitcher for @TishCoBaseball. When he graduates from high school, Caleb hopes to continue to pitch in college and maybe one day - the Majors! Caleb is the son of Brent and Amanda Huggins. #MS01 https://t.co/6verqong9u","date":"Sat Sep 28 14:48:08 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am thankful for the hand of friendship Uzbekistan has extended to America.  It was humbling and a great honor to be presented with the Order Dustlik (Friendship) last night.   https://t.co/9MQE06wZbZ  #MS01 https://t.co/0jBxwT83GL","date":"Sat Sep 28 14:15:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Rather than carry out the business of the people, Democrats continue to pursue a politically motivated agenda based on unfounded claims against President Trump.  My thoughts: The Gallo Radio Show on @supertalk. https://t.co/aMpXdeY87J  #MS01","date":"Fri Sep 27 20:59:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Uzbekistan is a friend to Mississippi and America.  I remain committed to strengthening our relationship with the Uzbeks. https://t.co/WrRXSwfM1A  #MS01","date":"Fri Sep 27 20:45:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to talk with @RepMichaelGuest, @LynnFitch, and former Mississippi Governor @HaleyBarbour.  #MS01 https://t.co/Attcb8bKh7","date":"Thu Sep 26 20:08:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"#USMCA is a 21st century trade deal that will fuel economic growth in Mississippi and across the U.S., create jobs and expand opportunities for our farmers, manufacturers, and workers.  #USMCANow #MS01 https://t.co/U4tKRhumf2","date":"Mon Sep 23 21:49:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We care deeply about the rising cost of prescription drugs and want to ease the burden families face, but we must do so in a way that actually lowers prices and ensures that patients have the freedom and ability to choose what is personally best for them on healthcare. #MS01","date":"Mon Sep 23 19:57:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating our First District Athletes: Chamberlyn Grubbs is a @OleMissRebels cheerleader.  She has always enjoyed athletics, including cross country, soccer, and cheer.  Chamberlyn was also the salutatorian for her @SaltilloHS graduating class.  Great work!  #MS01 https://t.co/fo5CJ72ZHv","date":"Sat Sep 21 15:01:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #NationalRiceMonth and an opportunity to highlight the rice farmer's contribution to Mississippi.  There are 259 rice producing farms in Mississippi.  Our state is #5 in the nation for growing the most rice.  Photo Courtesy: MSU Extension-DeSoto County #thinkrice  #MS01 https://t.co/PfeylSn2RW","date":"Fri Sep 20 20:37:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to be selected as a conferee for the National Defense Authorization Act (NDAA) Conference Committee for Fiscal Year 2020.  We have the greatest fighting forces in the world, who need our support.  Please read my newsletter.  https://t.co/YOiqLP0Lb8  #MS01 https://t.co/UQMTRO9mXo","date":"Fri Sep 20 18:46:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating 72 years @usairforce!  This week is also a celebration for @Columbus_AFB - 50 years of modern pilot training! Congratulations!  #MS01 https://t.co/15RHwnCIBD","date":"Wed Sep 18 15:19:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The 1947 National Security Act restructured The United States military and intelligence agencies in the aftermath of World War II. On September 18, 1947, President Truman signed the National Security Act establishing the U.S. Air Force. Happy Birthday Air Force!","date":"Wed Sep 18 15:13:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is our duty as a Member of Congress to provide for our men and women in uniform.  They must have the tools they need to protect us all.  I am honored to be selected as a conferee for NDAA 2020.  #MS01\nhttps://t.co/PA51rMi0FT https://t.co/oXP8QnsS5w","date":"Wed Sep 18 14:10:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the opportunity to meet with Roger Bacon, Michael Joe Cannon, Michael Van Veckhoven, and Marty Milstead from the Mississippi Automobile Dealers Association today. #MS01 https://t.co/JUVqRpjyEy","date":"Tue Sep 17 21:05:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the pleasure of meeting with GEN Joseph Lengyel, Chief of the National Guard Bureau; Lt Col Ben Leestma; Maj Gen Sherrie McCandless; and CSM Christopher Kepner this afternoon. #MS01 https://t.co/7RiSBuHTq5","date":"Tue Sep 17 21:04:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today we remember B.B. King on his birthday, along with celebrating Mississippi for being the birthplace of the Blues.","date":"Mon Sep 16 21:02:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"You may have heard about the USMCA, but do you know what impact this will have on Mississippi?  Click the link to learn more.  \nhttps://t.co/WltvPcjxek  #MS01 https://t.co/RQ3oezkXtb","date":"Sat Sep 14 18:16:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We must bring America and our trade partners into the 21st century by enacting #USMCA.  Mississippi's economy benefits from the $3.2 billion in exports that we sell to Canada and Mexico.  #USMCANow   #MS01 https://t.co/TOOMJrBulc","date":"Thu Sep 12 13:30:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congress must do its job and pass the #USMCA.  This is a critical step to boost the economy, create jobs, and increase wages.  To learn more, please click on the link. https://t.co/CqywRGp8qn #Rally4USMCA #USMCAnow #MS01 https://t.co/NmaEG5vwqN","date":"Thu Sep 12 12:30:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our friends COL Robert Hilliard, Patricia Hemphill, and Jacob Brister with @VicksburgUSACE paid us a visit this afternoon. During our visit we conveyed the urgency to #finishthepumps https://t.co/Lg9tecnO3c","date":"Wed Sep 11 21:56:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Chief Cyrus Ben came to DC to represent the Mississippi Band of Choctaw Indians for the National Congress of American Indians' annual conference. Thank you for taking the time to meet with us! #MS01 https://t.co/4bgYSxkWtj","date":"Wed Sep 11 20:15:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the opportunity to meet with representatives from Regions bank, including Robert Leard, Regions Market Executive, and Brian Smith, Senior VP of Regions Bank today. #MS01 https://t.co/e9pTcV51ok","date":"Wed Sep 11 20:00:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"RADM Michael J. Silah, the Director of the Office of Marine and Aviation Operations, and OMAO Chief of Staff, Gregory Raymond, met with us today to discuss their work during hurricane season and their important partnership with the Mississippi Gulf Coast. #MS01 https://t.co/XGfuWcBCtB","date":"Wed Sep 11 18:00:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you, Tommie Cardin, for visiting us today! #MS01 https://t.co/To61YP26gx","date":"Wed Sep 11 16:25:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this day, eighteen years ago, our nation experienced one of the most devastating terror attacks in history. God bless all of the brave first responders who were there that day, and God bless our military in the continuous fight against global terrorism. #neverforget","date":"Wed Sep 11 13:12:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I sat down today with LTG Charles Luckey, Chief Army Reserve, to discuss how to best serve our troops in the Army Reserve. Our friends in service are always welcome here! #MS01 https://t.co/HSXyAYHSHf","date":"Wed Sep 11 00:00:27 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Members of the @msbankers dropped by today to talk about banking regulatory issues. Thank you for coming by! #MS01 https://t.co/wuLRM43JOr","date":"Tue Sep 10 23:00:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, I met with members of the Uzbekistan Armed Forces, who is the country that Mississippi National Guard partnered with through our State Partnership Program. Person to person engagement is critical for developing friendships and alliances in critical regions of the globe. https://t.co/BanmiGKraz","date":"Tue Sep 10 19:59:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@TheBCV Executive Director Sean Milner came by to deliver a message about the mission of this great organization and what they are doing for Mississippi.  #MS01 https://t.co/OlqBLUuoA0","date":"Tue Sep 10 19:32:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@ACSCAN representative Betty Jane Sparrow is in DC for the organization's 2019 Leadership Summit and Lobby Day.  We have an open-door policy.  Come see us! For more information, please click on the link.  https://t.co/GBvMxnGbyj  #MS01 https://t.co/CndGXzizDN","date":"Tue Sep 10 19:16:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed meeting with @MVSUDEVILS representatives La Shon F. Brooks, Chief of Staff, Dr. Kathie Stromile Golden, Special Asst. to the President, and Samuel Melton, Jr., Dir. of Sponsored Programs.  Thanks for a great meeting!  #MS01 https://t.co/cVeAWk5iyF","date":"Tue Sep 10 18:49:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I thoroughly enjoyed meeting with representatives of the Community College Policy Fellows Program, Mississippi Community Colleges Board, and the Alabama Community College System to discuss workforce needs an opportunities in Mississippi and Alabama.  #MS01 https://t.co/8fJeNyMhBv","date":"Tue Sep 10 18:19:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"After 25 years, it is time for NAFTA to be replaced with a 21st century trade agreement.  USMCA's provisions will help grow the economy and support additional jobs in Mississippi and across America.  #USMCAnow #MS01 https://t.co/SAoK9qCYei","date":"Tue Sep 10 13:01:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Listening to what you have to say at the Rotary Club of Southaven and ready to be your voice on Capitol Hill. #MS01 https://t.co/VfJWD19dO7","date":"Thu Sep 05 18:30:27 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news in DeSoto County. Spectra Laboratories, a subsidiary of Fresenius Medical Care North America, has broken ground on a lab in Southaven. 300 new jobs! Grateful to be a part of the announcement. #MS01 https://t.co/cSMvt6Sgn0","date":"Thu Sep 05 16:15:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated meeting with the Southeastern Timber Products team: Billy VanDevender, Aaron Samuels, and Mathew Phillips in Ackerman today.  The Southern Pine Sawmill began operations in 1972.  #MS01 https://t.co/1Ngqrdl825","date":"Wed Sep 04 22:38:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your Representative, I look forward to the August district work period and traveling throughout the First District, listening to what you have to say.  Please read my newsletter.  https://t.co/96xN0RkoUz  #MS01 https://t.co/3mbcvEShiX","date":"Fri Aug 30 17:45:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are happy to have Boyd Housey as an intern in our office this fall.  Boyd, a native of Pass Christian, is a student at Georgetown University.  He is majoring in Global Business.  I am thankful for Boyd's service to the First District.  #MS01 https://t.co/FkVy56E7NU","date":"Thu Aug 29 19:23:42 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Taking good questions and eager to talk about the United States-Mexico-Canada Agreement in New Albany tonight. #USMCA #MS01 @HouseAgGOP https://t.co/qst0yffJxw","date":"Tue Aug 27 00:59:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed meeting Pontotoc small business owner Angie Garrett and loyal customer Jacob Johnson today. #MS01 https://t.co/CT5qxuaFVR","date":"Tue Aug 27 00:28:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Military service is an honor and a privilege. #MS01 https://t.co/hEVGqwawr5","date":"Mon Aug 26 13:06:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to see @TVAnews approved its FY20 budget which includes a solid plan to meet energy needs for the next 20 years. #MS01","date":"Fri Aug 23 15:33:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great day in Olive Branch @McKesson's distribution center.  The company employs close to 500 team members - a number of whom are U.S. Military Veterans.  We are thankful to have this successful company in the First District.  #MS01 https://t.co/CD1C8NOEJR","date":"Thu Aug 22 19:38:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @DCSDsocialmedia Det. and Computer Forensic Examiner Greg Horton! He is winner of @SecretService 2018 NCFI Top Forensic Partner Award! He’s #4 in the nation. #MS01 https://t.co/KtU9LOBX0S","date":"Wed Aug 21 18:25:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to talk with World War II Veteran Carl Nance and to see good friends at the Ripley Rotary Club today.  Appreciated the invitation! #GreatestGeneration #MS01 https://t.co/8cRuVrLMJa","date":"Tue Aug 20 19:27:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Cat Reman Engines are a source of pride for your outstanding team members and for the great state of Mississippi.  Thanks for the hands-on tour! #MS01","date":"Tue Aug 20 18:51:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"More jobs for Mississippians! Start-up Avid Boats to hire 75 people in Amory. #MS01 https://t.co/CLCUpd4u30","date":"Tue Aug 20 16:18:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I have spent the August work period traveling throughout the First District, eager to hear what you have to say.  We have many miles to go before we return to DC.  Please read my newsletter.  https://t.co/simfPyrMB8  #MS01 https://t.co/Fjdz9RLajP","date":"Tue Aug 20 15:03:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed talking with everyone @MSCUA Columbus chapter tonight. As a member of @HSBCgop, it is my priority to listen to their ideas and concerns. #MS01 https://t.co/juRsuT55vp","date":"Tue Aug 20 01:40:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news! @AirbusHeli has delivered the 200th UH-72A Lakota for training operations at the Army Aviation Center of Excellence in Fort Rucker, Alabama.  It was delivered from the Airbus operation located in Lowndes County.  #MS01 https://t.co/CAcerBwdKA","date":"Mon Aug 19 21:36:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Good to see our Corinth friends today at the Corinth Rotary Club. It’s great to be back on the road this week in the district! MS01 https://t.co/axLYmptBHx","date":"Thu Aug 15 18:51:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit @MossyOak in West Point with Daniel Haas, Bill Sugg, Mayor Robbie Robinson, And Judge Chris McBrayer. #MS01 https://t.co/rGK6uC6OZm","date":"Wed Aug 14 21:02:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Back on the road today in the district. Great meeting with @gregoryconst folks who provide jobs to 160 people! Thanks for the tour and good company. #MS01 https://t.co/4jaUPqR7UW","date":"Wed Aug 14 19:10:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"There are critical issues impacting Mississippi and our nation.  I appreciated being able to share my thoughts and concerns on @supertalk. #MS01","date":"Tue Aug 13 20:45:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated meeting the outstanding staff at the state-of-the-art @WinstonMedical who devote themselves to caring for their patients and residents of Louisville and surrounding areas.  #MS01 https://t.co/EhYERNVMqS","date":"Mon Aug 12 22:01:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"C4C John-David Luttrell has completed basic training and @AF_Academy classes have begun!  I was proud to nominate this outstanding young man from Tishomingo County.  Read more about his progress in an upcoming newsletter.  https://t.co/qI6o2a9y3u  #MS01 https://t.co/vZc8RgFczg","date":"Thu Aug 08 19:59:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor and a privilege to serve in the U.S. Armed Forces.  I look forward to hosting Academy Day 2019.  Find out more about attending one of our Service Academies.  Save the date!  #MS01 https://t.co/PMfDjCJlNS","date":"Tue Aug 06 20:46:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We have enjoyed having J.T. Mitchell serve as an intern this summer!  J.T., a native of Jackson, Mississippi, is a rising senior at Sewanee: University of the South.  I wish J.T. well in his future endeavors and am thankful for his service to the First District.  #MS01 https://t.co/2X3nSqzSY3","date":"Fri Aug 02 21:31:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In coordination with Senator Dan Sullivan (R-AK), I am pleased to introduce the VA-DOD Shared Medical Facilities Act of 2019 on behalf of our veterans and current servicemembers.  To learn more, please click on the link. https://t.co/3XHHVfbgo6  #MS01 https://t.co/4JXDjhkJaY","date":"Fri Aug 02 20:45:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Academy Day 2019 is coming soon! Service Academy and ROTC representatives will be available to answer questions which could lead to a career as an officer in the U.S. Armed Forces. Hope to see you there.  #MS01 https://t.co/FHKyHhlxnI","date":"Thu Aug 01 22:05:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is time to bring relief to Americans through modernization of the Internal Revenue Service.  We will accomplish this task through the Taxpayer First Act of 2019.  Please read my newsletter.  https://t.co/pNHDPG15Jl  #MS01 https://t.co/JGDohS8tDs","date":"Wed Jul 31 22:34:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to introduce you to Bobby Simmons, a University of Mississippi rising junior and summer intern at our Washington, D.C., office.  For information about our internship program, please click https://t.co/K5FFhw4rE8 #MS01 https://t.co/3tB2hLoxjM","date":"Tue Jul 30 22:29:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to assist Vietnam-era War Veteran Michael Judd in his quest to apply for the Humanitarian Service Medal (HSM) for his service in Operation New Arrival.  We can't promise a similar outcome, but our team is eager to try.  please call (662) 841-8808.  #MS01 https://t.co/EIBZdzfHsr","date":"Tue Jul 30 22:00:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dawn and Hannah Blankenship from Saltillo are having a great time in Washington, D.C.!  If you are planning a trip to DC, let our team assist you.  To learn more, please click on the link.  https://t.co/Ec72iyuqhF  #MS01 https://t.co/TcbBLRd8iy","date":"Thu Jul 25 18:59:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to @MSEMA Exec. Dir. Greg Michel, Strategic Advisor Bryan Olier, and Senior Attorney William Dreher for the update on backwater flooding and response in the MS Delta. #MS01 https://t.co/4y5dlO30un","date":"Thu Jul 25 17:35:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Trent Lott Leadership Institute was well represented in DC by Kristy Wang (Holly Springs), Catherine Li (Oxford) , Don Fruge (Oxford), Mason Bay (Oxford), and Amanda Barnett (Holly Springs).  Thanks for coming to see us!  #MS01 https://t.co/PHHaaWpfWe","date":"Wed Jul 24 22:45:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed meeting with @MSFFA members Katie Barnes, James Carpenter, Hayley Hines, Anna Grace McKinney, and Oscar Martinez.  #HouseAgGop  #MS01 https://t.co/w5m1HSOWU4","date":"Wed Jul 24 22:29:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to meet with @ASA_Soybeans Board of Directors Mississippi member Willard Jack and Mississippi Soybean Association President Gip Carter.  Their input is essential to our work on the @HouseAgGOP.  #MS01 https://t.co/wwsYmXJq69","date":"Wed Jul 24 21:50:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mark Elliott, Director of Military &amp; Veterans affairs, JPMorgan Chase &amp; Company, came by to discuss the company's commitment to hiring veterans. As a member of @HASCRepublicans Subcommittee on Military Personnel, it was helpful to listen to his ideas. #MS01 https://t.co/KC5mmm5RCG","date":"Wed Jul 24 20:58:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Homelessness Response and Housing Agencies representatives Marika Baliko, Jarrett Frierson, Rory Weal, Bethany Latham, and Hannah Maharrey came by to discuss the good work they are doing to address homelessness in Mississippi. #MS01 https://t.co/fjYYDgiv4e","date":"Wed Jul 24 19:33:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great meeting with LaRue Peters, LCI Industries Asst. Manager - Mississippi. She is in DC working on behalf of the company’s employees who are blind or visually impaired. Enjoyed talking with LaRue and her friend, Laurie Peters. #MS01 https://t.co/p6BqSIOzxz","date":"Wed Jul 24 16:42:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The @MississippiDOT will widen the final segment of MS-76 in Itawamba County with a grant from the U.S. Department of Transportation.  This project will enable Toyota and others to grow their productivity providing more jobs for Mississippians. https://t.co/N0XNIaxUSq  #MS01 https://t.co/CKqYTL56yV","date":"Tue Jul 23 20:19:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for The Tanglefoot Trail and for Mississippi! Proud to have this popular rail-trail in the First District.  #MS01 https://t.co/1VstH0TdrF","date":"Tue Jul 23 17:12:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Scott Walker, CEO, @MECStateChamber, came by to discuss the good work being done to promote economic development with Mike Pepper, Exec. Director, @msroadbuilder, Hunter Fordice, President, Fordice Construction Company, and Steven Warren, President, Warren Paving, Inc. #MS01 https://t.co/K3VvXpziyT","date":"Thu Jul 18 21:24:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcomed Jimmy, Hayden, Jennifer, and Madeline Williams (Oxford) to our DC office this morning. I want to thank little Madeline for voting with me on the House floor. #MS01 https://t.co/Ovjd291kzg","date":"Thu Jul 18 16:30:25 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to see friends from Uzbekistan including the Min. of Foreign Affairs of Uzbekistan, H.E. Abdulaziz Kamilov, and Sen. Sodiq Safoev, the First Deputy Chairman of the Senate of Uzbekistan. Also attending was Major Amanda Villeret, State Partnership Prog. Dir. @nationalguardMS https://t.co/RqWKPpCiAi","date":"Wed Jul 17 22:12:08 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a very productive discussion about STEM education in Mississippi with Shelia Smith, @NSTA District VII Director (MS, LA, AR), and Mississippi Science Teachers Association President Elect Dr. Joe Sumrall. #MS01 https://t.co/YjgG8phhuS","date":"Wed Jul 17 20:58:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Radiance Technologies, Inc., CEO William C. Bailey and William F. Stiers came by to discuss the company’s role as a contractor for the Dept. of Defense, the national intelligence community, and for their commercial customers. #MS01 https://t.co/YLxMIcvVMD","date":"Wed Jul 17 19:27:06 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our Soldiers, Sailors, Airmen, and Marines willingly place their lives on the line to protect America.  It is our duty in Congress to support our troops. Please read my newsletter.  https://t.co/nhQMKdU2cq  #MS01 https://t.co/SAoWyr2Gvo","date":"Tue Jul 16 22:21:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Met with @canopychildren CEO Dr. John D. Damon to hear all about the good work they are doing for children in Mississippi.  #MS01 https://t.co/17yf293Da3","date":"Tue Jul 16 21:41:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"David and Josh Ashley operate a fast-growing small business in Jackson. As a member of @HSBCgop, it was great to learn more about their successful operation.  #MS01 https://t.co/duabfNhAAV","date":"Tue Jul 16 21:21:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit with @15thSMA, listening to his ideas about how to improve the quality of life for Soldiers and their families.  #MS01 https://t.co/AK612UV4Wc","date":"Tue Jul 16 20:34:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated meeting with Gretchan Kimble, ASCRS, (Madison) and Dr. Jason Stacy AANS/CNS (Tupelo) who are in DC for the @SpecialtyDocs's annual Advocacy Conference.  We discussed issues that are important to healthcare professionals and to their patients.  #MS01 https://t.co/QbJt021n79","date":"Tue Jul 16 20:27:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Christina Steube from Oxford\nand Hanna Stiglets from Gulfport\nare having a great time in DC. Thanks for coming to see us!  #MS01 https://t.co/b8UfpuszwG","date":"Mon Jul 15 23:02:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseAgGOP, it is my priority to listen to the concerns and ideas of all our farmers. I appreciated my time with sweet potato farmer Jamie Earp today. #MS01 https://t.co/DYE8VHC0Kg","date":"Mon Jul 15 22:50:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Jacoby Hayes, Tanika Hayes, Ajala Lee, Jaden Carter, and Jade Hayes came by to see us during their trip to Washington, D.C.  It was great to see them!  #MS01 https://t.co/fCloblWAvt","date":"Mon Jul 15 22:19:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Itawamba County was well represented by Jeff and Teresa McNeece, Reed Stanley, Josh and Sara Gammille today.  Our team assisted these families with their tours.  If you would like more information to plan your next trip to Washington, D.C., click https://t.co/5c3Unhx82x  #MS01 https://t.co/sbd3Wjq1nD","date":"Fri Jul 12 15:42:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, the House is set to vote on the National Defense Authorization Act (NDAA).  Moments ago, House Leadership held a news conference to discuss this problematic and partisan legislation.  In case you missed it, watch it here. https://t.co/q2sJ1heyCk  #MS01","date":"Fri Jul 12 15:03:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to celebrate @SouthernMiss @USMGoldenEagles with Chad Driskell, Vice President for External Affairs, Dr. Gordon Cannon, Vice President for Research, and Dee Dee Anderson, Vice President for Student Affairs. Thanks for stopping by!  #GoldenEaglePride  #MS01 https://t.co/T2ZtPRmvM7","date":"Wed Jul 10 19:20:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HASCRepublicans, it was great to meet COL Norberto Menendez, Army House Liaison Division Chief.  I look forward to working with COL Menendez as he takes on this new role.  #MS01 https://t.co/HkQ6LYhrqL","date":"Wed Jul 10 19:07:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Canada and Mexico are our first and second largest exports markets for United States food and agricultural products, making up 31 percent of total food and agricultural exports in 2018.  #USMCAnow #MS01 https://t.co/nQzkaK1fWe","date":"Wed Jul 10 17:00:42 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Need help navigating a federal agency? Field Representative Robert Smith is ready to assist you at our new office located in the Oxford City Hall.  You can contact Robert and all members of our outreach team by clicking on the link. https://t.co/2h9Miyr0Cu  #MS01 https://t.co/GlXcVV582k","date":"Tue Jul 09 22:04:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to the incoming Mississippi Band of Choctaw Indians Tribal Chief Cyrus Ben.  I wish you all the best in your new role.  #MS01 https://t.co/vz3CPIdPJd","date":"Tue Jul 09 21:42:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HouseAgGOP, it is important to me to listen to the ideas and concerns of all those in the MS agriculture industry.  Enjoyed meeting with @MSFarmBureau President Mike McCormick and livestock producers leadership today.  #MS01 https://t.co/2zTIH7oW6I","date":"Tue Jul 09 21:16:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to welcome our summer interns to the DC office! Each will learn all about the legislative process with help from our team.  In the photo are: Bobby Simmons, Maggie Tannehill, Taylor Witherspoon, and J.T. Mitchell.  Program information: https://t.co/a7NwfK1GVA  #MS01 https://t.co/1777USWpIC","date":"Tue Jul 09 16:50:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Major Eddie Garcia!  It was an honor to host the promotion ceremony and to celebrate his devotion to the safety of our nation.  I am proud to have Major Garcia as a member of our defense policy team.  https://t.co/OVrcTPzDLr  #MS01 https://t.co/R4OiPSHcFr","date":"Tue Jul 09 15:26:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciate all of our First District manufacturers for providing jobs which help to improve the quality of life.  Learn more about View, Inc., in DeSoto County by signing up for my newsletter.  Stay connected! https://t.co/vlRoMZD89g  #MS01 https://t.co/hQuL4L9R0B","date":"Mon Jul 08 21:34:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As we gather on this Independence Day, let us remember the service and sacrifice of those who gave all to protect the freedoms we enjoy.  I wish you and your family a happy Fourth of July! #MS01 https://t.co/LLl7kqfkoB","date":"Thu Jul 04 12:01:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great time was had by all @thehillbaseball celebrating this bipartisan tradition for charity.  #MS01 https://t.co/Gn3vucpuMy","date":"Thu Jun 27 22:44:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit and conversation about the importance of public service with @nationalbeta Mississippi delegates Caleb Nichols, LaDon Woullard, Zion C. Johnson, Chad Davis, Nadia McKenzie, Emma Anderson, and Kenning Bridges.  #MS01 https://t.co/1b9EVFyOMb","date":"Thu Jun 27 15:37:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Win or lose - we united for a good cause.  Watch it here. https://t.co/ipjP76v2pN. #MS01","date":"Thu Jun 27 03:20:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks!  We appreciate #ToyotaMS and those jobs. Toyota makes a difference in the lives of their Team Members, the surrounding communities, and the great state of Mississippi. #MS01","date":"Wed Jun 26 20:26:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a very productive discussion with @TRUCKINGdotORG representatives Whitney Stokes, Travis Dintelman, Jeremy Byrd, and Christian Garcia. #MS01 https://t.co/IAUluMQzBq","date":"Wed Jun 26 18:46:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is my pleasure to welcome our Guntown constituents to DC!  In the picture are: Mary and Jillian Huckaby, Brandi and Cora Ferrell, Cathy and Evan Ridley, and Keidyn Vanaman.  #MS01 https://t.co/LO4DDT3A77","date":"Wed Jun 26 18:38:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to have Ackerman Mayor Tim Cutts visit with us along with his wife, Tonya, and his sister, Sue Tarver.  #MS01 https://t.co/7m4HKbsabp","date":"Wed Jun 26 16:18:08 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Serving as an intern is a unique opportunity to learn about the legislative process in the setting of Washington, D.C.  This week, I enjoyed meeting interns from the offices of @SenatorWicker, @BennieGThompson, and @CongPalazzo.  Our program info: https://t.co/SGZwVRsUGD #MS01 https://t.co/nHyqi9OtKL","date":"Wed Jun 26 16:04:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to meet these young people and future leaders chosen to participate in the @OleMissRebels Trent Lott Leadership Institute.  It was great to spend time with Lorne Turner, Bouthe Calhoun, Ben Jackson, Jessica Luke, Courtney Cochran, and Quaron Marion.  #MS01 https://t.co/FPkobSD3Z1","date":"Wed Jun 26 15:45:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to wear @WP_Athletics @WPSGreenwave as we gear up for @thehillbaseball tomorrow night! #MS01 https://t.co/5lhe3q2KN9","date":"Tue Jun 25 21:40:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to Washington, @LeeCoSchools_MS graduate Skylar Sloan! She is the winner of the First Congressional District Art Competition. Skylar’s artwork will be included in the U.S. Capitol exhibit for an entire year! Congratulations! #MS01 https://t.co/YeHH3a79YY","date":"Tue Jun 25 15:22:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Just two more days until @thehillbaseball!  It has been my honor to wear the jerseys of a number of our First District schools, including @TishCoBaseball @tcsdsocial!  See you on the diamond this week.  #MS01 https://t.co/hpgBfyuMUT","date":"Mon Jun 24 11:00:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Looking forward to @thehillbaseball next week!  Our 6 a.m. practices have been preparing us to take on the Democrats.  Excited to represent @LeeCoSchools_MS @SALTILLOTIGERS @_shsbaseball on the diamond. #MS01 https://t.co/fSCUavsdfD","date":"Fri Jun 21 19:20:34 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Kayla Crowson and Ricky, Telethia and Rick Campbell represent Pontotoc well!  Thank you for coming to see us in DC.  #MS01i https://t.co/ypit3zTNwD","date":"Fri Jun 21 16:25:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great meeting with @OleMissRebels @OleMissASB @barron_mayfield, student body president, and @cshackelford98, student body vice president. Keep up the good work!  #MS01 https://t.co/vymwutEld3","date":"Fri Jun 21 16:18:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Wyatt Meriwether, winner of The Congressional Award silver medal.  I am pleased to see this young man working hard to achieve his goals and for all the time he has devoted serving his community. #MS01 https://t.co/AjwT2yE4ub","date":"Fri Jun 21 16:11:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to our DC office, David and Ginger Lancaster, Ben, Kayla, and Nellie Massengill from Corinth!  Come and see us again!  #MS01 https://t.co/U38pY9oSrX","date":"Thu Jun 20 21:02:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to our First Congressional District recipients of The Gold Award, Congress' highest honor for youth who have distinguished themselves through volunteer work.  In the photo are: C.J. Weddle, Jessica Gates, Maurissa Shumpert, and Mikayla Shelton. #gold2019 #MS01 https://t.co/346DEx2zyS","date":"Thu Jun 20 20:34:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The 33rd @electriccoopsms Washington, D.C. Youth Tour is well underway!  It was great to talk with these outstanding young people this afternoon. #MS01 https://t.co/k3N79LM8Y0","date":"Wed Jun 19 21:54:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Saltillo-Lee Junior Civitan Club's Carol Vandevander, Kalee Sanders, Corrie Sanders, Kailee Byrd, Destiny Ozbirn, Ethan Benefield, Tonya Cox, Gavin Gittleson, Mckenzie Jones, Tripp Cox, Houston Enlow, and Jennifer Byrd are enjoying their time in DC!  #MS01 https://t.co/z5jSTqsRj5","date":"Wed Jun 19 20:38:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed a great visit with @MSMusicEdu representatives Nancy Robertson and Tommy Creel.  We always enjoy having visitors.  If you or your family need assistance with a tour in DC, give us a call at (202) 225-4306. #MS01 https://t.co/M1wgDJoiEW","date":"Wed Jun 19 20:27:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Good luck today @HailState @HailStateBB today! Proud to wear your jersey for @thehillbaseball practice! #CWSOmaha #OmaDawgs #MS01 https://t.co/adhVWBb9MG","date":"Wed Jun 19 18:20:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"For far too long, our Mississippi farmers and other business operators who need seasonal workers have been forced to endure government red tape and frustrating delays. The introduction of the Paperwork Reduction for Farmers H-2A Modernization Act addresses this problem. ↓ #MS01 https://t.co/jJKPADvKLL","date":"Wed Jun 19 16:03:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A shout out to @mhschiefs @MHS_Chiefs_Ath at practice this morning!  Proud to represent the Senatobia school for @thehillbaseball  #MS01 https://t.co/8CRcDM7o4O","date":"Wed Jun 19 11:01:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Praying for the continued recovery of all those impacted by severe weather in our great state.  #MS01","date":"Tue Jun 18 22:37:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing everyone in Tate County last night, including Dale Dunigan and Pat Nozinich!  #MS01 https://t.co/IQ76tMrtLY","date":"Tue Jun 18 22:34:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations @HailStateBB!  Great game!  #MS01","date":"Mon Jun 17 04:01:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am pleased to join @SenatorWicker, @SenMarkey, and @RepHorsford to introduce legislation that would lead to more economic development and create jobs.  #MS01 https://t.co/l9tSEHF3de","date":"Thu Jun 13 21:05:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to have  @PhilBryantMS and @RepMichaelGuest come to the office this morning. Our favorite topic - Mississippi!  #MS01 https://t.co/umq2fT6g03","date":"Thu Jun 13 15:56:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HASCRepublicans, I remain committed to strengthening our national defense capabilities. Our work on the #FY20NDAA markup continues. The NDAA provides for our troops, their families, and sets national defense policy. Watch it here: https://t.co/77uz5CDM50 #MS01","date":"Wed Jun 12 23:38:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a special morning to remember how thankful we were to have had the United States Capitol Police with us on June 14, 2017, for the #CongressionalBaseballGame practice and to welcome back to the field one of the Heroes from that day - Special Agent Crystal Griner.  #MS01 https://t.co/v6oJdtNOMR","date":"Wed Jun 12 22:48:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of @LafCo_District teacher Marisa Atkinson and students JaNaudia Harris, Stephanie Kellum, and Christasha Turner who are taking part in @NationalHistory.  Good work!  #nhd2019  #MS01 https://t.co/wJZuMAl1Po","date":"Wed Jun 12 15:23:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"6 a.m. practice for @thehillbaseball is a great way to start the day and an opportunity to highlight our First District teams!  Honored to represent @TheWAthletics @MUWedu  #MS01 https://t.co/7vNQgmQUix","date":"Wed Jun 12 11:00:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@visitms's Rickey Thigpen, Bill Seratt, Rochelle Hicks, Mary Allyn Hedges, Kelli Carr, Lisa M. Winters, and Laura Beth Strickland love to promote tourism to the First District and to our great state of Mississippi. Thanks for all you do!  #MS01 https://t.co/b347fbfh31","date":"Tue Jun 11 22:27:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations @tupeloschools @MilamRipples for placing first in @SIFMAFoundation's 2019 #CapitolHillChallenge! The program teaches young people how to invest and save for the future and provides a better understanding of our government. Great job! #MS01 https://t.co/tLTLwQJliz","date":"Tue Jun 11 22:00:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great meeting with @VTXAero Rear Admiral Ed Boyington (USN,RET), President and CEO, and Don Davis, Sr., Vice President, Business Development and Strategy.  As a member of @HASCRepublicans, I always look forward to hearing from our Mississippi defense companies. #MS01 https://t.co/xePKnV8Wdi","date":"Tue Jun 11 19:51:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to @UNAUSA representatives Martin Genter, Nicole Rigsby, and Ella Schalski for sharing your thoughts and concerns with us.  #MS01 https://t.co/PQbm77pLAV","date":"Tue Jun 11 19:14:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi has much to offer new and existing businesses and industries. Thanks for the update on business development and recruitment @CorinthAlliance @clayton_stanley and @TVAed Regional Economic Development Consultant Kristi Brown.  #MS01 https://t.co/09zOq1nInU","date":"Tue Jun 11 19:05:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations @4CountyElectric!  The cooperative is celebrating 80 years of service.  We appreciate 4-County and all of their hardworking team members.  #MS01 https://t.co/pYT0G5blZl","date":"Fri Jun 07 18:07:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today marks the 75th anniversary of D-Day, the World War II invasion of Normandy.  So many lost their lives to deliver freedom and they succeeded. Let us remember all the fallen.  Please read my newsletter. https://t.co/0eAEZ7BuI5  #DDay75Anniversary #MS01 https://t.co/b5OG6VSGFn","date":"Thu Jun 06 21:02:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proudly representing our First District schools on the diamond including @dchsjaguars @athletics_dc for the 2019 Congressional Baseball Game for Charity.  Thanks @DTTsports for the shout out! https://t.co/hTtFAEu0Rw\n#MS01 https://t.co/sMpubC59zc","date":"Thu Jun 06 15:35:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering D-Day - the invasion by Allied Forces that would lead to victory and restoration of peace and freedom.  Our Heroes will always be remembered. #MS01 https://t.co/5J1gEjOADJ","date":"Thu Jun 06 10:00:40 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Jeffrey, Alicia, and Ava McVey from Rienzi are in DC.  We always look forward to seeing folks from home!  If you or your family are planning a trip to Washington, D.C., we can help with tour information and answer any questions that you may have.  (202) 225-4306  #MS01 https://t.co/6LPcl9vknr","date":"Wed Jun 05 20:19:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a good discussion with Oasis Petroleum Chairman and Chief Executive Officer Tommy Nusz about issues affecting the energy industry.  #MS01 https://t.co/mOLMsMpZkX","date":"Tue Jun 04 20:33:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It won't be long until we are on the diamond for the 2019 Congressional Baseball Game for Charity!  Our sunrise practices have been great and the momentum is building.  #MS01 https://t.co/pGQ8HnW4Wg","date":"Tue Jun 04 18:51:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"McKesson Pharmaceuticals representatives Daniel Ling and Shannon Hayden came by our DC office this morning. #MS01 https://t.co/ejYDO4RXqm","date":"Tue Jun 04 16:00:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Preserving wildlife in our state is a top priority and the topic of discussion with Mississippi Wildlife Federation’s Johnny Marquez. #MS01 https://t.co/uuDVWkjLd0","date":"Tue Jun 04 15:58:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to discuss the U.S. - Japan alliance and other important issues that impact our nations with Mr. Kiyoto Tsuji, Parliamentary Vice-Minister for Foreign Affairs, Ministry of Foreign Affairs (MOFA).  #MS01 https://t.co/fvDKlCOYCI","date":"Mon Jun 03 21:59:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit with @CDBankers today.  Thanks for stopping by!  #MS01 https://t.co/1vvecWDvgQ","date":"Mon Jun 03 21:56:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Honored to be a part of the retirement ceremony for Mississippi Farm Bureau Federation Reg. Mgr. Terry Norwood (Union County).  He has selflessly served his community and our state. Best wishes!  #MS01 https://t.co/H0AMV16KZt","date":"Fri May 31 19:59:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Senator Thad Cochran distinguished himself in service to our nation as a member of the U.S. Navy and as a U.S. Representative and U.S. Senator.  He served our great state of Mississippi and exemplified what it means to be a faithful public servant and impactful leader. #MS01","date":"Thu May 30 16:35:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Honored to spend time with young people selected to participate in @MS_Boysstate. #MS01 https://t.co/6XlNN3ubvu","date":"Mon May 27 22:43:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this Memorial Day, let us all remember those who gave all for our freedom. It was an honor to show our gratitude at Veterans Memorial Park in Tupelo. #MS01 https://t.co/dVqghpFx79","date":"Mon May 27 15:01:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"During the month of May, our nation observes National Police Week, recognizing all the men and women who have died protecting our communities.  Please click the link to read my newsletter.  https://t.co/rzjJoL1YYR  #MS01 https://t.co/dtf68G00xP","date":"Fri May 24 19:50:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @USArmy Major Bridget Day.  I was pleased to host her promotion ceremony last night.  #MS01 https://t.co/oiQzAHh3p8","date":"Fri May 24 15:05:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks for coming to see us, Stewart, Molly and Peyton Dodge (Booneville)!  We always look forward to having visitors.  If you would like to come see us in DC or need help planning your trip, please click the link https://t.co/s7Yq7u4hRu or give us a call at (202) 225-4306. https://t.co/miSe5pBQXT","date":"Thu May 23 21:28:36 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Lots of familiar faces from the First District (Tupelo)!  Enjoyed seeing Christy &amp; Molly Flynn, Gary, Sandy, Erin Ruth and Elise Waters, and Ray &amp; Ann Leeper.  Glad you're having fun in DC!  #MS01 https://t.co/d2Dtn8Rii3","date":"Thu May 23 21:23:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great conversation with @ChiefNGB about the status of the National Guard. #MS01 https://t.co/6FckT8LGN0","date":"Thu May 23 17:13:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to represent Itawamba Community College Indians during early morning practice this week.  We are gearing up for the 2019 Congressional Baseball Game for Charity set for June 26th at Nationals Park.  #MS01 https://t.co/nHj53RXAm3","date":"Thu May 23 11:30:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"To achieve healthcare reform, it is essential that we receive input from healthcare professionals which include the Emergency Nurses Association (ENA).  In the photo are: Shelly Logan, Jennifer Williams, Jennifer Heindl, and Kim Wright.  #MS01 https://t.co/7cqApn3F1U","date":"Wed May 22 20:38:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"North American Insulation Manufacturers Association's Earnest Wysong, Mark Bromiley, and Rick Roos came by to discuss how their industry has been impacted by regulatory reform.  Rolling back regulations has and will continue to be a top priority.  #MS01 https://t.co/b5XS8qIEQF","date":"Wed May 22 20:36:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Iraq and Afghanistan Veterans of America represents our nation's next generation of Veterans.  I appreciated hearing from Thomas Porter, a distinguished Veteran and an advocate for IAVA.  #MS01 https://t.co/EIZsMQtnmX","date":"Wed May 22 20:30:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"National Air Traffic Controllers Association's Dennis Hilton - Mississippi Coordinator, Fred Steele - Memphis, and Michael Long - Gulfport/Biloxi, came by today to discuss the National Airspace System (NAS) and the need for modernization. #MS01 https://t.co/nd7CjOmF93","date":"Wed May 22 20:25:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"From the Earth to the Moon to Mars and beyond.  @NASAStennis is taking our space program into the future.  It was an honor to participate in the Partners for Stennis Congressional Reception.  #MS01 https://t.co/hE0pGdYqfM","date":"Tue May 21 22:19:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@mssocietyofcpas Annette Herrin, CPA, Linda Keng, CPA, Karen Moody, CPA (MSCPA), Donna  Bruce, CPA (BKD), and Bob Cunningham, CPA, came by to discuss key topics that affect the accounting profession.  #MS01 https://t.co/Y0wDUxZZ5r","date":"Tue May 21 17:50:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Brother Dave from the First Baptist Church in Aberdeen and his wife, Amanda Dowdy, paid me a visit today. I, along with fellow Members of Congress, are wearing yellow roses on our lapels today to celebrate the 100th anniversary of women being able to vote. #MS01 https://t.co/F1FZWDcJWH","date":"Tue May 21 15:16:20 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Gathering with folks in West Point for Armed Forces Day. Mississippians have long answered the call to serve our nation. #MS01 https://t.co/agpZHxAw7c","date":"Sat May 18 16:30:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Another great week watching the sunrise on the baseball diamond while practicing for the 110th annual @thehillbaseball.  I am proud to participate in this charitable event again - I was even more proud to represent @NEMCCBASEBALL and @OleMissBSB! #MS01 https://t.co/owlaA2LPb4","date":"Fri May 17 20:24:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tim Rutledge, Regional Counterdrug Training Academy Director of Training, does great work helping to prepare law enforcement officers for duty - including hundreds of officers in the First District.  #MS01 https://t.co/iXbSrkjAYO","date":"Fri May 17 17:36:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Kenneth Akins and Ashby Baum with Westlake Chemical (Aberdeen) came by to discuss issues that are important to their industry on behalf of The Vinyl Institute.  #MS01 https://t.co/enTlX5Z0Zz","date":"Fri May 17 17:15:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As we recognize @InfraWeek, we also recognize the important role @AsphaltPaveMS carries out making our highways and roads safer.  #MS01 https://t.co/6hQkxAhg8a","date":"Thu May 16 19:53:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Don Switzer, Mgr. Of Sales, Steel Dynamics Flat Roll Group-Columbus Division, came by today. We appreciate all that the company does for the First District and Mississippi. #MS01 https://t.co/AFkW6exq4v","date":"Thu May 16 17:52:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to Lieutenant General Brian Kelly, Deputy Chief of Staff for Manpower, Personnel, and Services, USAF, for coming by to discuss issues that impact our men and women in uniform. #MS01 https://t.co/zgstxR1k77","date":"Thu May 16 17:21:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proudly representing @NWCC_Rangers at our 6 a.m. practice on Wednesday.  The Congressional Baseball Game for Charity is coming soon - June 26 at #NationalsPark  #MS01 https://t.co/pxzxrrPSlw","date":"Thu May 16 15:05:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, our nation recognizes #NationalPoliceWeek2019.  Law enforcement officers have made a pledge to protect lives and safety.  We appreciate their steadfast dedication.  I am honored to cosponsor legislation that honors their service. #MS01 https://t.co/fwf9cutBUu","date":"Wed May 15 22:25:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"To all the men and women who have given their lives to protect others, we honor them on this Peace Officers Memorial Day. #MS01 https://t.co/yNNfkScLUw","date":"Wed May 15 17:32:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to see my old friend and former neighbor, Cindy Riley!  She is a teacher at Foundations Academy in Brighton, Colorado.  Enjoyed talking with her students about our nation's rich history.  #MS01 https://t.co/4RAicIEIcQ","date":"Tue May 14 21:22:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering all those who have paid the ultimate sacrifice in the line of duty and the men and women who watch over us at this hour. #NationalPoliceWeek #MS01 https://t.co/7RbXawFvfC","date":"Mon May 13 22:10:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As #NationalSmallBusinessWeek comes to a close,  I am proud to highlight some of our First District business operators in my newsletter.  To learn more about your Mississippi neighbors, please click the link. https://t.co/Sb0R0ePMvi  #MS01 https://t.co/p453yzsvbh","date":"Fri May 10 16:10:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dr. Steve Collier, CEO of MississippiCare, a community health center with clinics in the First District, talked about an issue that is important to our state and nation - healthcare.  #MS01 https://t.co/C6DTeDBhch","date":"Thu May 09 22:00:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Ken Barbic, Assistant Secretary for Congressional Relations (OCR), @USDA came by.  As a member of @HouseAgGOP, I look forward to working with the USDA while I advocate for meaningful legislation that will have a positive impact on our producers and the Ag industry.  #MS01 https://t.co/b7BIBSkPsD","date":"Thu May 09 21:50:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Christy Reid, Jessica Salter, and Christina Laycock had a great time during their U.S. Capitol Tour with a member of our team as their guide. If you would like help planning a trip to DC, please click the link and let's get started! https://t.co/ilgtCFpc22  #MS01 https://t.co/opiL9LNioE","date":"Thu May 09 21:37:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a good discussion with Mississippi Petroleum Marketers and Convenience Stores Association representatives and members Philip Chamblee (Exec. Dir.), Kevin Sayle (Sayle Oil. Co.), Jim Lipscomb (Lipscomb Oil Co.) Rex Gillis (Dutch Oil Co.), and Matt Bogue (Dutch Oil Co.)  #MS01 https://t.co/4ivyptUKq0","date":"Thu May 09 21:09:08 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"These men and women answered the call to serve our nation.  I am a proud cosponsor of #HR95 - bipartisan legislation that will help to take care of these families.  #MS01 https://t.co/xLoTrEoOsW","date":"Thu May 09 20:39:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mike Chaney, Commissioner of Insurance for Mississippi, and Mark Haire, Deputy Commissioner of Insurance for Mississippi, came by to discuss issues that are impacting Mississippi's insurance customers.  #MS01 https://t.co/Qj4sFtAGhj","date":"Wed May 08 21:31:00 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Lieutenant General Michael Rocco, Deputy Commandant for Manpower and Reserve Affairs, @USMC, came by to discuss an upcoming hearing of the House Armed Services Subcommittee on Military Personnel.  As Ranking Member of the subcommittee, I appreciate his participation.  #MS01 https://t.co/jq4BJb9O3D","date":"Wed May 08 21:18:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@TennTom1 Development Authority Chairman of the Board Kevin Stafford, Administrator Mitchell Mays and Board Members Brian Roy, Nick Ardillo, and Martha Stokes updated our office on the current situation with the Tenn-Tom blockage and the need to deepen the channel.  #MS01 https://t.co/wCX9J42A8V","date":"Wed May 08 19:17:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi engineers Wayne Morrison, Craig Carter, Allen Scott, Ed Dedeaux, and David Bowman are in DC for the @ACEC_National legislative summit focusing on a number of issues including America's infrastructure. #MS01 https://t.co/ORSGFZxYJv","date":"Wed May 08 18:04:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@GAManufacturers member company representatives @AirbusHeli, Jeff Trang, VP, Technology and Flight Operations, @PPG, Steve Knight, Director, General Aviation Transparencies, and @Continental_AT, Rhett Ross, President and CEO, discussed collective priorities.  #MS01 https://t.co/XE89nEMZDO","date":"Wed May 08 17:34:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Hyperion Technology Group! The Tupelo company is expanding. 25 new jobs - a $500,000 corporate investment. The company provides government and industries custom electronic systems around the world. #MS01","date":"Wed May 08 14:27:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Christopher, Stephanie, Grayson, Caitlyn, Campbell, and George Sykes from Nesbit are having fun in Washington, D.C.  I’m glad they came to see us! #MS01 https://t.co/N0kYnZ94XR","date":"Wed May 08 14:09:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am honored to receive the @ACUConservative award for Conservative Achievement which is given to lawmakers who uphold conservative principles.  #MS01 https://t.co/57F1OYaPdK","date":"Tue May 07 22:19:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So proud of our young people in the First District!  Enjoyed visiting with Miss Tupelo 2019, Taylor Hughes, and her mom, Alisha Hughes.  #MS01 https://t.co/5GhJ39LzoM","date":"Tue May 07 21:10:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciate teachers and all that they do for our children!  #ThankATeacher #MS01","date":"Mon May 06 21:17:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are thankful for all of our nurses in the First District and across our great nation.  #MS01 https://t.co/00lSLYl2qq","date":"Mon May 06 20:46:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@MS_Boysstate is coming soon to @OleMissRebels. This program highlights rising high school seniors. https://t.co/F37mynoUtA. Register now! #MS01 https://t.co/WVqjuCX3X9","date":"Mon May 06 18:03:08 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@POTUS presented the Commander-in-Chief’s trophy to @GoArmyWestPoint today. Congratulations! #MS01 https://t.co/k0Wiy46YdD","date":"Mon May 06 16:48:25 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great economic news for America - April brings 263,000 more jobs and the unemployment rate is the lowest in a generation.  To read more, please click on the link. https://t.co/KA8D2GBp1U","date":"Fri May 03 23:01:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We will never forget the 6 million lives that were lost and will remain forever grateful for those who survived this tragedy.  #MS01 https://t.co/nkeRhy1XOA","date":"Thu May 02 19:36:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today, America recognizes #NationalDayOfPrayer.  I am grateful we live in a nation where we are free to practice our religious beliefs.  Many have paid the ultimate sacrifice to protect our freedoms.  Let us all pray together on this day.  #MS01 https://t.co/0ODatOsKJ8","date":"Thu May 02 17:31:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@LAWoodwardMD, Brian L. Rutledge PHD, MHSA, Chief of Staff, Office of the Vice Chancellor, and Kristy Simms, UMMC Govt. Relations, came to our DC office today.  UMMC's mission to deliver world-class medical care for every patient, every day is a profound achievement for MS. #MS01 https://t.co/HwLG85e83H","date":"Wed May 01 21:28:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A group of @HAPatriots students and their parents are having a great time touring Washington, D.C.  If you would like assistance with a tour, our team is here to help!  https://t.co/5aBPaRmdYl  Come see us!  #MS01 https://t.co/wj4VRV6mGT","date":"Wed May 01 20:30:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @WhitneyDrewrey, Mississippi's 2019 Teacher of the Year! Whitney is a special education teacher @LafCo_District's Upper Elementary School.  She is being honored in DC this week along with outstanding teachers from across the nation.  #MS01 https://t.co/sxahNGgVRH","date":"Wed May 01 18:39:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"May is #NationalMilitaryAppreciationMonth and an opportunity to remember the service and sacrifices made by our men and women in uniform.  At this hour, they are watching over us at home and across the globe.  #Grateful #MS01 https://t.co/Q7cI8fMarQ","date":"Wed May 01 11:01:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@msbankers Robert Barnes, CEO Priority One Bank, Johnny Barrett, CEO FNB Bank of Oxford, Alan Walters, CEO First Commercial Bank, John Shappley, Pres. &amp; COO First Commercial Bank, and Gordon Fellows, Senior VP Government Relations discussed data security and regulations.  #MS01 https://t.co/3Ky1OrZCS9","date":"Tue Apr 30 20:08:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It's Strolling Thunder on Capitol Hill today! From across the nation, families have come to bring attention to what babies need to thrive, including good child care and proper nutrition.  It was great to see Mark, Emily, and Grey Alexander McCauley (Oxford).  #MS01 https://t.co/3aldykeJAC","date":"Tue Apr 30 20:01:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dallas Allgood with @NatlPawnbrokers stopped in to see us at the DC office.  Through my role as a member of the @HSBCgop, I always want to hear the thoughts and concerns of our small business operators and those who represent their best interests.  #MS01 https://t.co/pdvR2hvkS2","date":"Tue Apr 30 19:52:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Kurdistan Regional Government (KRG) Ambassador H.E. Bayan Sami Abdul Rahman came to see us in DC today.  I appreciated meeting with her and to discuss my role on @HASCRepublicans.  #MS01 https://t.co/6jNnemoZ1P","date":"Tue Apr 30 19:48:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Rebecca Lipe, J.D., former @usairforce Judge Advocate and Associate Attorney, Steptoe &amp; Johnson LLP, came by our DC office today.  Lipe, a USAF Disabled Veteran, is a witness at our House Armed Services Military Personnel Subcommittee hearing.  #MS01 https://t.co/jTE9EI7atQ","date":"Tue Apr 30 19:24:34 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Saturday is National Prescription Drug Take Back Day.  Please search your medicine cabinet and dispose unwanted prescription drugs at an approved collection site.  To find a collection site near you, please click on the link.  https://t.co/ap873sMJ8V  #MS01 https://t.co/4HwE9Nchsa","date":"Fri Apr 26 19:52:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Members of the Mississippi Army National Guard are finally home!  We are thankful for their service and grateful for their supportive families.  Please read my newsletter.  https://t.co/ITRTuNzoUY  #MS01 https://t.co/yunLJmNknW","date":"Wed Apr 24 19:14:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations!  #MS01","date":"Tue Apr 23 15:49:25 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Sights and sounds from the 2019 Congressional Art Competition hosted by our team at @ItawambaCC. Congratulations to 1st place winner @LeeCoSchools_MS student Skylar Sloan and a special thank you to all our talented participants. #MS01 https://t.co/NxvOrh24qV","date":"Tue Apr 23 15:25:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great turnout in Oxford today! It was great seeing everyone. #MS01 https://t.co/2XSnekun8L","date":"Tue Apr 16 18:37:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks for the drawing, Makylie! @LeeCoSchools_MS #MS01 https://t.co/SaZjjzpDAZ","date":"Tue Apr 16 15:24:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Reading with youngsters at Saltillo Primary School. Great fun! #MS01 https://t.co/SSyerO0MfP","date":"Tue Apr 16 15:02:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Residents of Hamilton and Monroe County are hurting today from the loss of one of their fellow residents, Mr. Roy Ratliff.  We pray for his family, the swift recovery of the injured, and for all those who lost homes and property due to severe weather. #MS01 https://t.co/jD2Dn1EaTy","date":"Mon Apr 15 17:10:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those who are suffering at this hour in Hamilton and Monroe County.   Let us all remember those who have lost so much and reach out to them with words of comfort and a helping hand. #MS01","date":"Mon Apr 15 13:50:58 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"More than 80 talented young Mississippians have submitted artwork for the 2019 Congressional Art Competition from the district!  The awards ceremony will be held 5:00 p.m. on April 22 at the W.O. Benjamin Fine Arts Bldg. on the Itawamba Community College Campus in Fulton.  #MS01 https://t.co/Kuytc0lnAF","date":"Fri Apr 12 20:31:42 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Sammy, Marilyn, and Peyton Reed (Lee County) came to see us recently. Young Peyton came with me to @HouseFloor.  Thanks, Peyton!  Anyone who would like to visit our DC office or need assistance with a tour, please click on the link.  https://t.co/NzcnP7WgGn  #MS01 https://t.co/UvimL5ycIO","date":"Wed Apr 10 20:16:07 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@MSBeerDistrs representatives Steve Clark, Ricky Brown, Sean Moore, Brian Richardson, and Steve Allen came by our DC office to discuss beer industry issues.  As a member of @HSBCgop, it is important to me to listen to the concerns of business operators.  #MS01 https://t.co/916lu3IH0T","date":"Wed Apr 10 19:42:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@4H is an outstanding organization! I am proud of our young people who are participating!  It was my privilege to meet with Callie Shae Philips (Lee County), Hunter Brooks (Lowndes County), and Lana Estes (Union County).  #MS01 https://t.co/v5llZKq0yJ","date":"Wed Apr 10 17:21:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@MSDeptofRehab representatives Anna Tucker, Jan Schaefer, Billy Taylor, Chris Howard, Josh Woodward, and Kristy Embry provided an update on their rehabilitation programs.  Great work!   #MS01 https://t.co/AssIXPOh6r","date":"Wed Apr 10 17:15:20 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Toyota Motor Manufacturing Mississippi is making great progress on their Visitor &amp; Education Center according to Human Resources Asst. Mgr. Kevin Burgess, Body Weld Group Leader Andre Hardiman, Gov. Affairs Dir. Erik Kirkhorn, and Corp. Communications Dir. Kathryn Ragsdale. #MS01 https://t.co/FsEnsl6PJX","date":"Wed Apr 10 16:54:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enhancing economic and community development is a positive for all regions of our state.  I talked with Jefferson County officials this afternoon. In the photo are: James Wells, Cammie Hutcherson, Jerry Wilson, S.D. Johnson, Jr., Tracy Collins, and Brenda Buck.  #MS01 https://t.co/hslkPUeejp","date":"Tue Apr 09 22:44:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Optometric Association reps Minh Duong, OD, Linda Ross Aldy, CAE, Executive Director, Jay Fuller, OD, and Mississippi State Senator David Parker, OD, came by our DC office today to discuss the goals of their organization.  #MS01 https://t.co/fT38OcWtCN","date":"Tue Apr 09 22:38:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed meeting MajGen Daniel Leece, Staff Judge Advocate to the Commandant of the Marine Corps.  As a member of @HASCRepublicans, it is my top priority to listen to our men and women in uniform.  #MS01 https://t.co/9jqAt5Qcx4","date":"Tue Apr 09 22:32:42 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Bar Association representatives President Pat Bennett (Clinton), President-Elect Amanda Tollison (Oxford), and Executive Director Deanne Mosley (Jackson) came by today.  Thanks for a great visit!  #MS01 https://t.co/TuPwldOM35","date":"Tue Apr 09 22:27:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"TRICARE Reserve Select should be available to all National Guard and Reserve members.  To learn more, please click on the link.  https://t.co/MiowIaybDI  #MS01","date":"Tue Apr 09 19:38:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tax Day is fast approaching.  To see if you qualify for tax prep assistance, please click on the link. https://t.co/EUIgBpc2lt  You can also call (888) 227-7669.  #MS01","date":"Tue Apr 09 19:14:56 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am concerned about a contagious, fatal disease that is impacting our deer populations called Chronic Wasting Disease.  To learn more, please read my newsletter.  https://t.co/3EHLGYGN8T  #MS01 https://t.co/DIK47Aqij1","date":"Mon Apr 08 20:36:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to greet our Heroes coming home from the Middle East. #MS01 https://t.co/zogqKAlXmt","date":"Sat Apr 06 20:31:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of our First District business operators including Michelle and Dewayne Humphries with Integrity Roofing of Mississippi (Mantachie). #MS01 https://t.co/S1tD3UpkFn","date":"Fri Apr 05 20:56:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The @NRCAnews held their annual fly-in this week in DC.  Graham Roofing Inc. (West Point) President Christee Holbrook detailed issues that are important to the industry including workforce training and infrastructure. #MS01 https://t.co/DwiKeuNwrC","date":"Fri Apr 05 17:04:34 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I believe it is my duty to do everything in my power to protect God's gift of life.  This week, I signed a petition to have a vote on the #BornAliveAct. This vital legislation would require babies who survive abortions the same medical treatment as other babies.  #MS01 https://t.co/bEG3hrWtVE","date":"Thu Apr 04 20:03:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Met with National Ship Repair Industry Conference attendees: William M. Bolean, R. Keith Allen, Maarc A. Gadbois, Rob Stuardi, Mike Webster, and Mathew Majure in DC today.  Thanks for coming by!  #MS01 https://t.co/40glLJq0H0","date":"Wed Apr 03 22:17:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Cattlemen's Association President Joe Hancock (Mize), Executive Vice President Andy Berry (Magee), and Officer Nancy Jackson (Eupora) came by to discuss the Farm Bill and other issues facing cattle producers. #MS01 https://t.co/4gCO3EsaWN","date":"Wed Apr 03 22:09:28 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"PACCAR Inc is a valuable asset to Mississippi's economy and improving the quality of life through good paying jobs in the First District.  I appreciated the opportunity to talk with their Advanced Technology Team in DC. #MS01 https://t.co/jgtsEWCyMv","date":"Wed Apr 03 22:00:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Department of Banking and Consumer Finance Deputy Commissioner Rhoshunda G. Kelly came by to discuss their organizations top priorities which include consumer protection and data security.  #MS01 https://t.co/U4xlnb4COl","date":"Wed Apr 03 16:10:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I was pleased to welcome Renaissance Community Loan Fund CEO/President Kimberly LaRosa and CFO Chuck Wall to our DC office to discuss issues that are important to their industry and to our work on @HSBCgop.  #MS01 https://t.co/TSE4g9MgcR","date":"Wed Apr 03 15:56:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The new Assistant Secretary of the Army Manpower and Reserve Affairs Dr. E. Casey Wardynski came by to discuss their priorities and my role as Ranking Member of @HASCRepublicans Military Personnel Subcommittee. #MS01 https://t.co/3W6DUDPa5d","date":"Tue Apr 02 19:36:26 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@msbankers reps Scott Woods, @BobDGlover , Eric Chambless, Zach Luke, Wyman M. Jones, Gordon Fellows, Charles W. Nicholson, Jr., Gregory Moore, Huey Townsend, Mary Childs, Michael Booker, and Matt Mayo came by to discuss the progress that has been made to ease regulations. #MS01 https://t.co/1piIwuUnWb","date":"Tue Apr 02 19:21:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This weekend, as we spend time with family and friends, remember the sacrifices that have been made to protect our freedoms.  #VietnamWarVeteransDay #MS01 https://t.co/D4pxJlaoqw","date":"Fri Mar 29 21:50:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As an avid outdoorsman, I recognize Chronic Wasting Disease (CWD) as an epidemic.  The press release below details our plan of action.  #MS01 https://t.co/UgBNFwHnKI","date":"Fri Mar 29 21:01:48 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @LafCo_District Music Teacher Hannah Gadd - Mississippi Department of Education's Teacher of the Year!  This is the second year in a row that a teacher from the Lafayette County School District has been chosen for this honor.  #MS01 https://t.co/iRyIW0wRt4","date":"Fri Mar 29 19:05:41 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I enjoy every opportunity to talk about the importance of public service to young people including these Trent Lott Leadership Institute students @OleMissRebels. #MS01 https://t.co/4CsUNFEUtK","date":"Fri Mar 29 17:26:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Jay, Nicole and Gracie Thompson from Olive Branch came to see us at our DC office today. Thanks for stopping by!  #MS01 https://t.co/FeFqUoli0Q","date":"Thu Mar 28 16:19:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations! #MS01","date":"Thu Mar 28 13:28:20 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"What a fantastic group of young people from @OleMissASB!  We have an open door policy and I am always eager to listen.  Anyone who would like to pay us a visit can stop by and see us.  For tour information, please click the link. https://t.co/bMWdIMAj5M #MS01 https://t.co/CmvLYsDzQ2","date":"Wed Mar 27 21:37:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@Columbus_AFB 14th Flying Training Wing Commander Col. Samantha Weeks, Capt. Daniel Wilson, Senior Airman Dylan Fivecoate, and Chief Master Sgt. Raul Villarreal, Jr. discussed the valuable role they play preparing pilot training program students to defend America.  #MS01 https://t.co/a4MRjZZI7N","date":"Wed Mar 27 21:21:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As a member of @HSBCgop, I discussed the progress we have made to reduce regulations with Mississippi Hospitality and Restaurant Association representatives Jonathan Waller, Mike Cashion, Charles Frazier, and Denise Yates.  #MS01 https://t.co/2hE2i1Tkla","date":"Wed Mar 27 21:05:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is always great to see my friend and fellow proud Mississippian, Secretary of State Delbert Hosemann.  #MS01 https://t.co/czcRUQey2K","date":"Wed Mar 27 20:16:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We will always remember the service and sacrifice of all those who have paid the ultimate sacrifice defending our nation - and their families.  Kylie Owen and Jane Horton both lost loved ones. #GoldStar families are in our thoughts and prayers.  #MS01 https://t.co/xfBjt8qLX5","date":"Tue Mar 26 22:34:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@nationalguardMS LTC Andrew Rendon, his wife, Hilary, and daughter Sarah, came by to see us.  We appreciate LTC Rendon's service to our nation.  Thanks for stopping by!  #MS01 https://t.co/MRBM4r8WwD","date":"Tue Mar 26 22:17:06 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a productive meeting today with Major General Michael Taheri, Director of Staff, National Guard Bureau, the Pentagon, Arlington, Virginia. #MS01 https://t.co/awdfDuI7D8","date":"Tue Mar 26 21:17:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Heritage Foundation's Director of the Center for National Defense, Lieutenant General Thomas Spoehr, USA, (Ret.), visited our DC office today with Brandon Palumbo, Congressional Programs Associate and Colonel John \"J.V.\" Venable, USAF, (Ret.). #MS01 https://t.co/Nuo4eiafom","date":"Tue Mar 26 20:09:39 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Lt. General Charles Pede, the 40th Advocate General of @USArmy came by our office today to discuss military justice.  #MS01 https://t.co/z2T2CF11Z6","date":"Tue Mar 26 19:29:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"American Israel Public Affairs Committee (AIPAC) members Joshua Neuman, Merle Flowers, Le'Roy Davenport, Jerry Dattel, and Michael Shemper came by to discuss the importance of America's relationship with Israel.  #MS01 https://t.co/010SDroKMo","date":"Tue Mar 26 18:57:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On behalf of the U.S. Global Leadership Coalition's National Security Advisory Council, Lt. General Jerry H. Granrud (Ret.) and Lt. General William Kip Ward (Ret.) stopped by our office.  It was an honor to meet with them.  #MS01 https://t.co/dX2L0pNzGk","date":"Tue Mar 26 18:29:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Very proud all season of @OleMissWBB and @OleMissMBB teams. Wishing good luck to @HailStateWBK!","date":"Mon Mar 25 12:41:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It’s here! #MarchMadness","date":"Thu Mar 21 16:14:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating the creation of 200 jobs at the Dirt Cheap Distribution Center open house in Blue Mountain. Our workforce will deliver! #MS01 https://t.co/qPMliJW8ro","date":"Tue Mar 19 16:58:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a great celebration at Toyota Motor Manufacturing Mississippi roll out ceremony for the 2020 Toyota Corolla. #MS01 https://t.co/3RDMe7jr4k","date":"Mon Mar 18 21:11:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulation to Toyota Motor Manufacturing Mississippi where the line off ceremony was held today for the 2020 Toyota Corolla.  Not enough can be said about the impact Toyota has on our region.  #MS01 https://t.co/V3FLhCMjWa","date":"Mon Mar 18 17:19:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Threw the first pitch tonight at @OleMissBSB game! #MS01 https://t.co/v3sgleZAmv","date":"Sat Mar 16 00:05:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, our nation recognized National Agriculture Week.  We appreciate our farmers and all those in the agriculture industry for their hard work and dedication.  Please read my newsletter.  https://t.co/0H1kglLtwf  #MS01 https://t.co/N0L5fNz7rM","date":"Fri Mar 15 16:41:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"University of Mississippi External Affairs Director Amy Lewis came to our office with this!  #OleMiss #MS01 https://t.co/KbtLvb3XgK","date":"Thu Mar 14 21:28:00 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to have @SecArmy Mark T. Esper in our DC office this week.  We had a very productive discussion.  #MS01 https://t.co/PENGwUKcoh","date":"Thu Mar 14 21:25:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed visiting this morning with Mississippi Republican Party Chairman Lucien Smith.  #MS01 https://t.co/nxqVOqbDG4","date":"Thu Mar 14 14:24:13 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Soil &amp; Water Conservation Commission representatives Mark Gilbert, Pete Hunter, Jerry Smith, Anita Cowan, Kurt Readus, and Don Underwood came to see us in DC this morning.  Thanks for a great visit! #MS01 https://t.co/lvDKaPN7gR","date":"Thu Mar 14 14:13:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Only 15 percent of the budget provides for the common defense.  I agree with Rep. Mac Thornberry, Ranking Member of the House Armed Services Committee, that we must control spending without compromising defense readiness. #MS01","date":"Wed Mar 13 21:32:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Major General Stephen Strand, the new Commanding General of the 412th Theater Engineer Command, Vicksburg, MS, stopped by our DC office today.  I appreciated the opportunity to talk with him.  #MS01 https://t.co/cSt1mg30m7","date":"Wed Mar 13 21:09:31 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Scott Spivey, Executive Director, Jenny Layton, Senior VP of Marketing, MHC, Tony Jones, MHC Board of Directors, Chairman, and Dustey Walley, MHC Board of Directors with @MSHomeCorp discussed Opportunity Zone efforts in Mississippi among other issues.  #MS01 https://t.co/ehRVCYJWIV","date":"Wed Mar 13 21:04:45 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed talking with Major General Antonio A. Aguto, Deputy Chief of Staff, G-3/5/7 FORSCOM, Ft. Bragg.  #MS01 https://t.co/uSS6oGPmeo","date":"Wed Mar 13 20:54:57 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit with Hurricane Baptist Church (Pontotoc) Pastor Phillip Brock, Stephen Brock, Dick Caron, and Phil Robbins.  #MS01 https://t.co/xqZ01WgkFW","date":"Wed Mar 13 19:28:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations for a job well done, Tabitha! #MS01","date":"Wed Mar 13 18:35:42 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Atkins family in Hamilton, Mississippi, are fifth generation farmers. W.D. Atkins began farming with a plow and a mule.  Over the years, W.D and Jeanette's operation has changed significantly with the addition of smart equipment.  Good people! #NationalAgWeek #HouseAg #MS01 https://t.co/sodVKvD4MK","date":"Tue Mar 12 22:51:00 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@SMAMSU Student President @WilliamBonduris brought a reminder of home with him - a cowbell!  #MS01 https://t.co/xwf5ZnkmKh","date":"Tue Mar 12 22:08:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@JCStennisInst undergraduate and graduate students are in Washington, D.C. as part of their political studies.  I appreciated the opportunity to talk with them.  #MS01 https://t.co/2Qjcx9pF5j","date":"Tue Mar 12 21:57:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Met with a group of @LafCo_District JROTC students at the U.S. Capitol today.  It was great to see everyone! #MS01 https://t.co/eKcNja2O0x","date":"Tue Mar 12 21:38:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the privilege of visiting with students from Wheeler High School and Mike Kelly.  If you are interested in touring the United States Capitol, please visit https://t.co/zcWIn0QdPd  #MS01 https://t.co/ds4D3l6EjH","date":"Mon Mar 11 22:54:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #NationalAgWeek and an opportunity to recognize our farmers in the First District and across the nation for their dedication to feeding and clothing the nation.  Be sure to thank a farmer for all their hard work during the good and the lean times.  #MS01 #HouseAg https://t.co/3nCMVh1gI0","date":"Mon Mar 11 18:52:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@cvm_msstate Dean Kent Hoblet and Assistant Professor Alicia Oliver discussed issues on behalf of the Association of American Veterinary Medical Colleges in DC today.  #MS01 https://t.co/Yu0jhADVIs","date":"Thu Mar 07 23:35:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Blake McCollum and Joyce Li from Tupelo are having a great time in Washington, D.C.  Thanks for stopping by to see us!  #MS01 https://t.co/pRSEhfpX6C","date":"Thu Mar 07 23:06:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thriving economy is fueling growth and giving businesses and industries the confidence to expand and create more jobs.  Congratulations!  #MS01","date":"Thu Mar 07 18:41:02 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I am proud to represent the best interests of our military veterans.  A special thanks goes to Veterans of Foreign Wars (VFW) members who came to our DC office today.  Thank you for your service. #MS01 https://t.co/UQRMzfImfv","date":"Wed Mar 06 23:40:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated the opportunity to discuss ongoing flood control projects with representatives of the Yazoo Mississippi Delta Levee Board.  #MS01 https://t.co/DlQbL7BFgQ","date":"Wed Mar 06 23:39:03 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you for investing in our workforce and the great state of Mississippi! #MS01","date":"Tue Mar 05 18:20:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to @AFRnet Today's Issues host Tim Wildmon for the opportunity to discuss our work on Capitol Hill this morning.  #MS01 https://t.co/gNK5koZ5LS","date":"Mon Mar 04 16:58:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our open borders allow drugs, human traffickers and gang members to freely enter our sovereign nation.  I completely support President Trump's attempts to close our open border and protect the lives of U.S. citizens. #MS01 https://t.co/Tw1EnNTTxX","date":"Fri Mar 01 19:59:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I have and will continue to advocate for religious liberty and pro-life policies.  I am thankful to be recognized for scoring 100% for the @FRCAction 2018 Scorecard. To see the scorecard, please click on the link.  https://t.co/4SfLw6KDLL #MS01 https://t.co/ij1z8xXC8b","date":"Fri Mar 01 16:30:57 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciate the commitment and hard work of our First District sheriffs, including Lee County Sheriff Jim Johnson with his wife, Jamie. #MS01 https://t.co/JsHMjAWleB","date":"Fri Mar 01 15:52:34 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to the @EANGUS72 for honoring me with the G.V. \"Sonny\" Montgomery Eagle Award today! https://t.co/EAqoO8xDla","date":"Thu Feb 28 00:15:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had many visitors today including the American Association of Orthodontists, Mississippi Public Broadcasting, and Mississippi Association of Broadcasters. Thank you all for coming by! #MS01 https://t.co/7O2O9NSab3","date":"Wed Feb 27 21:39:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to see our guests from the Mississippi School Nutrition Association today and to listen to their thoughts about issues and legislation that will impact the children of our state. #MS01 https://t.co/Ls2avA61QM","date":"Tue Feb 26 21:32:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Delegation of Employee Benefit Professionals member Eugene Starks stopped by our DC office today.  Enjoyed talking with him.  #MS01 https://t.co/BbRaRbejE3","date":"Tue Feb 26 21:26:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Agriculture and Commerce Commissioner Andy Gipson visited our office today to discuss a number of issues including infrastructure and flooding.  #MS01 https://t.co/YABrF9Ve4N","date":"Tue Feb 26 21:13:18 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Here is the latest information from @MSEMA.  Our prayers are with the families who have lost so much.  #MS01","date":"Mon Feb 25 21:30:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with all those whose lives have been impacted by flooding. I appreciate our first responders who continue to work tirelessly. Please be weather aware today and tonight. #MS01 https://t.co/PmqIA8Y2MS","date":"Sat Feb 23 16:13:04 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Numerous businesses and industries play an important role supplying our farmers with the goods and services they need to produce healthy crops. Please read my newsletter. https://t.co/rC9kydhsBi  #MS01 https://t.co/GsaPQWeKhL","date":"Fri Feb 22 19:49:33 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for Mississippi!  #MS01","date":"Thu Feb 21 21:46:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud of our @nationalguardMS men and women! Looking forward to seeing more families reunited this spring.  #MS01","date":"Thu Feb 21 21:21:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations!  #MS01","date":"Thu Feb 21 20:36:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Honoring Vietnam War Veteran Carlyle “Smitty” Harris (USAF) POW with a brick from the prison he endured for eight years. @MyTupelo #MS01 https://t.co/C8mHu6FATF","date":"Wed Feb 20 01:09:32 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"LTG Wesley came by today! Thank you for your service. #MS01 https://t.co/1juGHrcxOl","date":"Thu Feb 14 22:30:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciated the opportunity to discuss issues that are important to these @MSFarmBureau Young Farmers today. #MS01 https://t.co/o1NfVxHs11","date":"Tue Feb 12 22:46:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We were so pleased to meet with @SOMississippi today! Thank you, it was a pleasure meeting you all this afternoon. #MS01 https://t.co/12Lg0uQ0Rh","date":"Tue Feb 12 22:34:07 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Clay County Sheriff Eddie Scott came by today with his family, Lori and Bradley Scott, and friends, Shelton Deanes, and R.B. Davis. Thank you, Sheriff Scott, for helping to keep #MS01 safe. https://t.co/1jP7L1Oo6C","date":"Tue Feb 12 17:01:57 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to VDAM Ted Carter from the (tag) @NavalAcademy  for meeting with us today! #MS01 https://t.co/WKoNPTwtpK","date":"Tue Feb 12 01:15:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Haley Fisackerly, President and CEO, and Allison Graves, Director of Federal Governmental Affairs of Entergy Mississippi came to the office today! #MS01 https://t.co/b1890OayWV","date":"Mon Feb 11 22:53:35 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"This week, @POTUS delivered the State of the Union address, highlighting all that has been accomplished by this administration.  Please read my newsletter.  https://t.co/oIG1349rai  #SOTU  #MS01 https://t.co/0eusXRFwYN","date":"Fri Feb 08 22:13:49 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations and good luck! #MS01","date":"Fri Feb 08 19:14:15 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Darrein Spann from the National Education Association came by for a visit today. An educated nation is a strong nation. #MS01 https://t.co/4aAoedXkWp","date":"Fri Feb 08 00:00:30 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the honor of the Afghanistan Ambassador, Her Excellency Roya Rhamani, visiting our office today. https://t.co/vFufq0n8Zf","date":"Thu Feb 07 23:00:37 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Desoto County Regional Authority stopped by today!  #MS01 https://t.co/DUC6jFb5Pb","date":"Thu Feb 07 21:18:21 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing @tweetbmc President Dr. Barbara McMillan at the #NationalPrayerBreakfast this morning. #MS01 https://t.co/0wkL408rAn","date":"Thu Feb 07 16:40:12 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to our friends with the National Rural Health Association for stopping by our office today! It is a top priority to make sure Mississippians and all Americans are receiving the best available healthcare. #MS01 https://t.co/sV50ZwXihj","date":"Thu Feb 07 02:00:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to Joe Mencer, Sean Doherty, Nicole Van Vleck, Kirk Satterfield, Daniel Berglund Farmer, Linda Raun, and Jackie Loewer from USA Rice Federation for meeting with us today! We support agriculture in #MS01 https://t.co/g0JlkwSVXd","date":"Thu Feb 07 00:00:27 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Nice to see Amy Dearmond, Director of Government Affairs from Leggett and Platt today! #MS01 https://t.co/H5fX0AKKGx","date":"Wed Feb 06 23:15:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So great to have Dr. David Puleo and Greg Carter from the School of Engineering @OleMissRebels come by today! #MS01 https://t.co/HBZ36XYiKp","date":"Wed Feb 06 21:46:14 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great visit with Jason Herring yesterday! #MS01 https://t.co/eq67hFRXAb","date":"Wed Feb 06 21:11:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Dr. Keenum, @msstate President, stopped by the office today. Thank you, Dr. Keenum and thank you Mississippi State. #MS01 https://t.co/Mzg7iw585A","date":"Wed Feb 06 19:48:50 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In the words of @POTUS, “We can bridge old divisions, heal old wounds, build new coalitions, forge new solutions, and unlock the extraordinary promise of America’s future.”  #SOTU #MS01 https://t.co/hI7xaeu22Y","date":"Wed Feb 06 18:30:53 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We appreciate Michael, Rita, Amanda and Ava Berthay for visiting our office today! If your family would like a Capitol Tour while visiting DC- please visit our website https://t.co/55ruJyYj0v…/washington-dc.htm #MS01 https://t.co/YSrKzdvmFO","date":"Wed Feb 06 18:08:07 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great speech by President Trump tonight. It was an honor to be there. #MS01 https://t.co/aSaTVDvVZA","date":"Wed Feb 06 04:12:38 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"President Trump will deliver the State of the Union speech this evening at 8:00 CST.  You can watch it live here.  https://t.co/oVRGr78pip  #MS01 https://t.co/UREaSZr0Pr","date":"Tue Feb 05 23:45:01 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you Linda Watkins and Gayle Harrell for stopping by on behalf of the American Association of Nurse Practitioners. We support nurses here in #MS01 https://t.co/bJr7H054zM","date":"Tue Feb 05 19:59:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations! MS01","date":"Tue Feb 05 17:13:52 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Some of Mississippi’s finest Assistant District Attorneys Takiyah Perkins and John Herzog came by yesterday! #MS01 https://t.co/jPcrWRxXNL","date":"Thu Jan 31 21:15:05 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We had the pleasure of receiving a visit from Mayor Robyn Tannehill of Oxford along with Jason Bailey and C.O.O. Bart Robertson yesterday! Thank you for making #MS01 great! https://t.co/n84jPr2uGy","date":"Thu Jan 31 17:00:24 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our friends President Blake Thompson and SGA President Anthony Jackson of @MissCollege dropped by today. We support higher education here in #MS01! https://t.co/lHmOreyK8K","date":"Wed Jan 30 22:37:09 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Such a pleasure see the American Short Line Railroad Association today! Thanks for coming by! #MS01 https://t.co/MwDBnxeVO8","date":"Wed Jan 30 20:13:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to Mayor Darren Musselwhite of Southaven and Mayor Allen Latimer for visiting the office today! We enjoyed our time with yall and your friends Tim Verner, Mary Lee Brown, Bill Brown, Dan Cordell, and Nick Manley! #MS01 https://t.co/wA9Ss8acI8","date":"Wed Jan 30 18:00:51 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Veterans have earned and deserve the best healthcare available.  #MS01","date":"Wed Jan 30 17:36:29 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you to our friends Ollie Lester, Lalashawna Fant, Patrina Pendarvis, Candice Chapman, and Angelitta Darden from the National Federation of the Blind for stopping by our office today! https://t.co/If1xHNPVx7","date":"Tue Jan 29 21:37:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Securing our border is vital to our success as a nation!  Please read my newsletter.  https://t.co/nyg3Q1KFoQ  #MS01 https://t.co/1ComGGWqZv","date":"Mon Jan 28 22:55:23 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a great day in DeSoto County where we gathered to celebrate the groundbreaking for the @nationalguardMS Readiness Center in Nesbit. #MS01 https://t.co/IC3r5tN1kL","date":"Mon Jan 28 22:00:27 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your Representative, I look forward to continuing my work on behalf of the First District on the House Armed Services Committee, the House Committee on Agriculture, and the House Small Business Committee.  To learn more, click on the link.  https://t.co/UHbIdjz4Pk  #MS01 https://t.co/FRjcoMqDFE","date":"Thu Jan 24 22:06:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for Mississippi! #MS01","date":"Thu Jan 24 20:44:44 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to represent the best interests of our military men and women.  https://t.co/FKM7W8TSzQ  #MS01","date":"Thu Jan 24 00:05:06 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"So great meeting with Dr. Gordon Cannon, Freddie White-Johnson, and Mike Jones from the Frannie Lou Hamer Cancer Foundation! https://t.co/FU5HrbK6mR","date":"Wed Jan 23 21:55:59 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your voice in Congress, I believe it is our duty as a nation to protect the lives of the unborn.  I will continue to advocate for policies that are #ProLife.  #MS01","date":"Fri Jan 18 18:46:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A booming economy, historic lows in the unemployment rate, and plentiful jobs are not just coincidences.  Please read my newsletter. https://t.co/jyf6xJ55ix  #MS01 https://t.co/dIg8UbiXXx","date":"Thu Jan 17 20:44:25 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Advanced Turbine Engine Company (ATEC) President Craig Madden and VP Jerry Wheeler stopped by with VP of Honeywell Beth Rossman and friends, Daniel Nesvet, Hunt Shipman, Sam Addock, and John Leggieri.  #MS01 https://t.co/bFwLkLkLB2","date":"Wed Jan 16 22:32:27 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a nice visit with Jimmy Bullock, Senior Vice President of Forest Sustainability for the Resource Management Service.  Thanks for stopping by to discuss forestry.  #MS01 https://t.co/NhfzwmxC2w","date":"Wed Jan 16 21:44:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to Rob and Holly Haven for visiting the office today.  We are always happy to give our folks from the First District a Capitol Tour.  Anyone who is interested in a Capitol Tour can give us a call at (202) 225-4306.  #MS01 https://t.co/hFbOej1pe2","date":"Wed Jan 16 21:40:47 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are thankful for this investment in our workforce! #MS01","date":"Mon Jan 14 18:37:07 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to our new interns, Bronti and John! Bronti and John will be assisting our team until summer. This is a unique opportunity to learn about the legislative process and work in the U.S. Capitol. To learn more about becoming an intern visit: https://t.co/h4MJvXni7p #MS01 https://t.co/DvBlmvdwTF","date":"Thu Jan 10 22:00:10 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Last week, we returned to Washington, D.C. for the swearing in of the 116th Congress.  It is an honor to serve as your Representative.  Please read my newsletter.  https://t.co/JY6LKB5zF0  #MS01 https://t.co/cFHsMDr2u3","date":"Thu Jan 10 21:41:17 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Welcome to our new interns, Bronti Viskovich and John Endres!  Bronti and John will be assisting our team until summer.  To learn more about becoming an intern, please click on the link. https://t.co/h4MJvXni7p #MS01 https://t.co/ciPSSMJWB5","date":"Wed Jan 09 22:33:43 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I enjoyed meeting with Paul Caja, VP of Taxation for MTD Products this afternoon. I am proud to represent and support great businesses such as MTD in #MS01 https://t.co/SRdpYSUF6i","date":"Wed Jan 09 22:22:22 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #LawEnforcementAppreciationDay and an opportunity to thank these men and women who willingly lay down their lives to keep us all safe.  #MS01 https://t.co/Jxr1Yu4hpL","date":"Wed Jan 09 20:49:55 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your Representative, it is my top priority to make sure your voice is heard on Capitol Hill.  Please read my newsletter.  https://t.co/x7WDFT8yTl   #MS01 https://t.co/XKEq2VMU8z","date":"Tue Jan 08 15:57:19 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great meeting with the Lucky Day Scholars from Ole Miss. These young students have bright futures ahead of them! #MS01 https://t.co/PkPaluIcWJ","date":"Sat Jan 05 00:21:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"As your Representative, it is my top priority to make sure your best interests lead to meaningful legislation.  I am proud of what we have been able to achieve in 2018.  Please read my newsletter.  https://t.co/GBKYZNtrxu  #MS01 https://t.co/Fl1kL4dnF6","date":"Thu Jan 03 18:05:46 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to see you! #MS01","date":"Tue Jan 01 19:24:54 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy New Year from our family to yours!  #MS01 https://t.co/ATBWg6A3UA","date":"Tue Jan 01 17:22:11 +0000 2019","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We wish you and your family a safe and happy Christmas!  https://t.co/A1vl1AAXvG  #MS01 https://t.co/pLpQjCh50a","date":"Tue Dec 25 19:09:22 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for Mississippi! #MS01","date":"Fri Dec 21 14:52:38 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Farm families make up less than three percent of the U.S. population, but they feed and clothe our nation.  To learn more about the 2018 Farm Bill, please read my newsletter.  https://t.co/1RpWXjYRPR  #MS01 https://t.co/WpsbCZF6GD","date":"Wed Dec 19 18:38:17 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to the Honorable John Hatcher, Chancery Court Judge of the First Chancery Court District. He is retiring after a long and distinguished career. #MS01 https://t.co/wqxlTL1pmu","date":"Tue Dec 18 22:07:23 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to serve as your Representative.  If you have any questions about our constituent services, please give us a call at (202) 225-4306 or (662) 841-8808.  #MS01 https://t.co/EoYzJo5IvE","date":"Mon Dec 17 20:43:09 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The late President George H.W. Bush was a distinguished leader and American patriot.  Please read my newsletter.  https://t.co/4tAnLcmqxm #MS01 https://t.co/dESOsJjoqy","date":"Wed Dec 12 22:18:39 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news! #MS01","date":"Tue Dec 11 22:18:36 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our community colleges are an invaluable asset in the First District and across our great state.  #MS01","date":"Tue Dec 11 22:15:26 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to First District award winners NaturePlex (Olive Branch) and Hyperion Technology Group of Tupelo.  We are thankful for their investment in Mississippi's workforce.  #MS01","date":"Mon Dec 10 21:38:14 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering all those who fought to defend our great nation and those who paid the ultimate sacrifice on December 7, 1941.  They will never be forgotten.   #PearlHarborDay #MS01 https://t.co/uQFkJDa4R8","date":"Fri Dec 07 13:34:16 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Williams-Sonoma, Inc.'s Sutter Street Manufacturing is expanding their upholstered furniture manufacturing operations.  The company is opening a facility in Lee County.  This will create 350 jobs over five years.  #MS01 https://t.co/DIfTSqOU4t","date":"Thu Dec 06 20:40:14 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Farewell to our 41st Commander in Chief.  May he rest in peace.  #MS01 https://t.co/DA2mZFY1GN","date":"Wed Dec 05 18:26:07 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"More than 4,000 members of @nationalguardMS deployed this summer in support of Operation Spartan Shield.  To read more about our visit with many of them on Thanksgiving Day, please read my newsletter.  https://t.co/DQzAHcYEnc #MS01 https://t.co/TlKoI44BU5","date":"Mon Dec 03 19:09:05 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Last week, It was great to visit with service members from the Texas National Guard, Task Force Alamo (1st Battalion, 141st Infantry Regiment) who are serving our nation at Camp Lemmonier, Djibouti. #MS01 https://t.co/iu6U41x5jD","date":"Wed Nov 28 21:25:37 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are grateful for everything that @AirbusHC_usa does for the economy of the Golden Triangle. It was great to visit with President &amp; CEO Chris Emmerson. #MS01 https://t.co/6dfTtCCigD","date":"Wed Nov 28 17:27:03 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is always great to see some fellow @nationalguardMS Guardsmen in D.C. Thanks so much Chief Warrant Officer James Graham, Chief Warrant Officer Jesse Lindsey, Chief Warrant Officer Tommy Smith, &amp; Chief Warrant Officer Preston Foster for stopping by. #MS01 https://t.co/rtKMsr1aCT","date":"Wed Nov 28 17:25:14 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to @DeltaTechLearn!  Ground has been broken on a new building dedicated to workforce development on their Horn Lake campus.  #MS01 https://t.co/nSctUTURkV","date":"Tue Nov 27 22:49:31 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is a privilege in this great nation to choose leaders who will let our voices be heard. Exercise that right today. It was good to see @RogerWicker, @SenHydeSmith, @PhilBryantMS, and Lee County Sheriff Jim Johnson in Tupelo on Monday. #MS01 https://t.co/cfSoHAn2x3","date":"Tue Nov 27 13:50:18 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to spend Thanksgiving Day with members of the 155th Armored Brigade Combat Team, Mississippi National Guard, who are stationed at Camp Buehring, Kuwait, in support of Operation Spartan Shield.  We are thankful for their service.  #MS01 https://t.co/MexTWzBXls","date":"Sun Nov 25 00:10:05 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #SmallBizSaturday and a great opportunity to show your support for small businesses.  Did you know that small businesses represent 99.9 percent of all United States companies? #ShopSmall #MS01 https://t.co/hLyCpUb8Lz","date":"Sat Nov 24 17:41:15 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On this Thanksgiving Day, we have much to be thankful for. Please read my newsletter.  https://t.co/NrlYtQ8IfD. #MS01 https://t.co/d5CpEzvHsc","date":"Thu Nov 22 19:44:03 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"There are 2.5 million veteran-owned small businesses across America.  We are thankful for their service to our nation and for their investment in our economy.  To learn more, please read my newsletter.  https://t.co/55JHgNB3HZ  #MS01 https://t.co/pJ4u5lgCxz","date":"Mon Nov 19 20:36:02 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@CooperTire has opened a new distribution center in Byhalia, creating 100 jobs.  It is the largest distribution center for the company nationwide.  We are thankful for Cooper's investment which is an important addition to the economy in the First District.  #MS01 https://t.co/7dWqY2HYsk","date":"Fri Nov 16 19:06:12 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to chat with Department of the Army Explosive Ordinance Disposal team of the year. SGM Jason Gerber, 1st Lt. Jesse Way, &amp; SSG Ryan Essenmacher are great examples of the courageous, dedicated men and women who serve this great Nation. https://t.co/8ofZYCgUOD","date":"Thu Nov 15 16:48:54 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Alieah Ward (Columbus, MS), Clyde Jackson (Columbus, MS), &amp; Ashley Snider (Louisville, KY) stopped by the office to discuss what my team and I can do to continue our support for American manufacturers of military parts. #MS01 https://t.co/5KhK1FNMRV","date":"Thu Nov 15 16:12:55 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great opportunity to discuss issues facing farmers with Thad Cochran Agricultural Leadership Program​ representatives. I remain committed to the hard-working Mississippi farmers who do so much for the Mississippi economy &amp; community. #MS01 https://t.co/zmC54MPfcI","date":"Wed Nov 14 15:46:52 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to discuss important issues facing agriculture at the Delta Council Board of Directors meeting.  #MS01 https://t.co/zz3YA4EKXH","date":"Tue Nov 13 22:35:40 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Abby Manufacturing in Walnut!  The manufacturer of steel and aluminum products has announced their second expansion this year.  The $1.4 million investment will add 10 jobs to their team of 130. #MS01 https://t.co/HjPQ6HFsoj","date":"Tue Nov 13 22:17:46 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"America's military veterans have earned and deserve our gratitude.  Be sure to thank a veteran for their service and their families who have made it possible for them to serve.  #VeteransDay #MS01 https://t.co/tByTsvSO5E","date":"Sun Nov 11 13:00:54 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Birthday to the United States Marine Corps.  These brave men and women proudly defend our nation and the freedoms we all enjoy.  #MS01 https://t.co/9OSJladqna","date":"Sat Nov 10 13:00:46 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Proud to honor our veterans during \"A Salute to the Veterans\" held by the 2nd grade music students of Lafayette Elementary School in Oxford. #MS01 https://t.co/5JmOoAi0oZ","date":"Fri Nov 09 20:32:05 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoying talking with folks in Oxford today. #MS01 https://t.co/4Zx098DEJR","date":"Wed Nov 07 17:54:51 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is a great honor to represent the people of the First District in Washington. I will continue to work tirelessly for the hard-working people of North Mississippi. Thank you for your continued support. #MS01 https://t.co/2Ugob5tRmL","date":"Wed Nov 07 15:40:31 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"We are free because millions of Americans have answered the call to serve our nation.  Veterans deserve our respect and gratitude.  Please read my newsletter.  https://t.co/Oj7vP3NT4M  #MS01 https://t.co/tsWRnHbJig","date":"Tue Nov 06 19:45:28 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In our democracy, power is derived from the people. Have your voice heard!#MS01 #GoVote\nFind your polling location: https://t.co/W4YRKgfTm7\n#MS01 #GoVote https://t.co/5CrNfGW8bL","date":"Tue Nov 06 15:43:22 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is National Veterans Small Business Week, an opportunity to recognize veteran-owned entrepreneurs like Robert Pepper in Eupora, and their contribution to our economy in Mississippi and across America.  #MS01 https://t.co/ObuHlSj7St","date":"Mon Nov 05 22:12:20 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The economy continues to surge forward.  #MS01 https://t.co/vYFOmASdjV","date":"Fri Nov 02 17:45:10 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Honored  to spend time with veterans at Cooper Tire in Tupelo. #MS01 https://t.co/2VBNP6zWaN","date":"Fri Nov 02 16:21:10 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing Matthew and Kayla Poe from Pontotoc at the Mississippi Farm Bureau Federation Washington, D.C. Fly-In to the Farm Conference today.  #MS01 https://t.co/8dVrozHMTs","date":"Thu Nov 01 20:52:29 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to meet this group of @MSFFA at the Mississippi Farm Bureau Federation Washington, D.C. Fly-In to Farm Conference.  #MS01 https://t.co/BSa0Eh8zXM","date":"Thu Nov 01 19:45:18 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Farmers invest their time and energy into cultivating crops that feed and clothe our nation. I will continue to advocate for policies that support them. It is an honor to be recognized for this effort by the MS Farm Bureau Federation with the Friend of Farm Bureau Award.  #MS01 https://t.co/lTzg27YNip","date":"Thu Nov 01 19:31:59 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On @supertalk @thejtshow today. #MS01 https://t.co/yQTwf55dep","date":"Thu Nov 01 17:40:21 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"At @MECStateChamber 17th annual Hobnob Mississippi. #MS01 https://t.co/6FEIhAZ1eK","date":"Thu Nov 01 17:25:12 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I’ll be on @supertalk at 12:05 today. #MS01 https://t.co/Mj0scoS8bW","date":"Thu Nov 01 16:20:57 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On The Gallo Show @supertalk this morning.  #MS01 https://t.co/3N9VeA6OYb","date":"Thu Nov 01 13:45:09 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to talk with @UMchancellor Jeff Vitter's Leadership Class @OleMissRebels.  #MS01 https://t.co/zMALlXf8rD","date":"Tue Oct 30 23:23:24 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Blue Springs DECA students - A great group of kids.  #MS01 https://t.co/n81C8RfDKt","date":"Tue Oct 30 19:41:53 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Meeting with the Mississippi Auto Dealers in Tupelo.  #MS01 https://t.co/jteRYvwmoh","date":"Tue Oct 30 19:40:45 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing folks in Pontotoc this evening. #MS01 https://t.co/YIyjGmWjvv","date":"Mon Oct 29 22:49:32 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to discuss the issues facing our state and the nation at the ICC State of the District Address in Fulton today. #MS01 https://t.co/zQmX4sKlyN","date":"Mon Oct 29 19:48:58 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Mississippi Department of Employment Security says the number of jobs is at a historic high and the unemployment rate is near a historic low. In Sept., nonfarm jobs in MS rose to 1,170,100 - the most jobs recorded in MS.  Our unemployment rate in September was 4.8%.  #MS01","date":"Fri Oct 26 22:10:13 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great news for commuters.  Northwest Mississippi drivers now have full access to Interstate 269.  @MDOT has cut the ribbon on the new highway from Interstate 55 in DeSoto County to State Route 305 in Marshall County, opening the final nine-mile segment.  #MS01 https://t.co/mKqPih9lwB","date":"Fri Oct 26 18:48:37 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Last night Saltillo resident Sean Suggs was recognized as one of Mississippi's 25 Most Influential African Americans by Our Mississippi Magazine. Sean was recognized for his work with @ToyotaMotorCorp/@ToyotaPolicy &amp; @MississippiEcon. Congratulations to Sean and his family! https://t.co/QB0vNxfTMD","date":"Fri Oct 26 17:10:38 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed spending time with folks in Oxford last night.  #MS01 https://t.co/5XMIk0nDTJ","date":"Thu Oct 25 18:32:36 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi Academy of Nutrition &amp; Dietetics reps. stopped by the office this morning. Emmy Parks, Diane Tidwell, Linda Pennington, Connie Black, Merrell Rodgers, Lauren Steele, &amp; Jamie Cole briefed us on what my office can do for the health and wellness of Mississippians. #MS01 https://t.co/t0lNCji7LR","date":"Wed Oct 24 15:24:11 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"October is National Disability Awareness Month. One in four American adults has a disability but are very capable and an asset to our workforce. The opportunities for employment continue to rise and when Mississippians with disabilities succeed, we all benefit. #NDEAM https://t.co/KXti6OvByq","date":"Wed Oct 24 15:21:58 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed a tour of PACCAR Engine Company in the Golden Triangle with Michael Guest and Plant Manager Lance Walters.  PACCAR started operations in 2010 and has continuously expanded.  They have grown from 150 - 600 team members.  #MS01 https://t.co/Jj16hrbOuE","date":"Tue Oct 23 21:19:29 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to see Tatyana Hampton, Makayla Lewis, Marianna Rucker, and Anita Alef in New Albany. #MS01 https://t.co/vNM0Kvd7X5","date":"Tue Oct 23 00:05:32 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great time with everyone and tossing the coin at @NWCC_Rangers game last night.  Thanks to @MichaelHeindl.  #MS01 https://t.co/MffZirVi8b","date":"Fri Oct 19 21:49:35 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to discuss issues that impact our state and the nation on @supertalk @thejtshow today.  #MS01 https://t.co/VawP58nF4Q","date":"Wed Oct 17 18:17:59 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Every day, hardworking Mississippians demonstrate a strong commitment to their employers through the products they manufacture.  Please read my newsletter.   https://t.co/sj9jPfnNzw #MS01 https://t.co/3harR99n1N","date":"Tue Oct 16 21:11:05 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Stopped by Farm Bureau with folks from Delta Council. #MS01 https://t.co/ZMdAqtsyYW","date":"Tue Oct 16 19:19:02 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed seeing folks at Cook Coggin Engineers today. #MS01 https://t.co/SRlqH0wZTs","date":"Mon Oct 15 19:34:06 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A large turnout at Academy Day 2018.  Proud of the many young people who are interested in attending one of our nation’s Service Academies. #MS01 https://t.co/0L998mbXDc","date":"Sat Oct 13 16:51:20 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Birthday @USNavy!  We are grateful for the commitment these men and women have made to protect our nation at home and across the globe. #MS01 https://t.co/8xFDawK8tR","date":"Sat Oct 13 12:00:40 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Academy Day 2018 is tomorrow.  The event is open to middle and high school students and their families, school officials, or interested citizens who want to learn more about America's prestigious military academies and the admissions process.  #MS01 https://t.co/CS7K6YVeY2","date":"Fri Oct 12 21:53:40 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is #NationalFarmersDay and an opportunity to thank our Mississippi farmers for the important role they play feeding and clothing the nation.  #MS01 https://t.co/gnLZNY69Vj","date":"Fri Oct 12 18:48:07 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@NatlHeadStart representatives from the First District stopped by the Office yesterday. They updated my team on their efforts to give every child the ability to succeed regardless of circumstances at birth. We are grateful for all the work they have done and continue to do. #MS01 https://t.co/5W5vCjSBBP","date":"Thu Oct 11 14:42:43 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Academy Day 2018 will be held on Saturday, October 13, from 10:00 am until Noon at the Jackson Avenue Center, 1111 West Jackson Avenue, Oxford, MS.  To learn more about this event, please read my newsletter.  https://t.co/RiNKHRdfK5 #MS01 https://t.co/N9NDRjsqfb","date":"Wed Oct 10 22:01:50 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed stopping by Columbus Rotary today. #MS01 https://t.co/gUQ42k2TXT","date":"Wed Oct 10 02:02:03 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Highlights from the Home Builders Association of Mississippi meeting. #MS01 https://t.co/4qlwlDmAem","date":"Fri Oct 05 20:04:59 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was an honor to receive the @NAHBhome Defender of Housing Award today.  Thanks to Kenneth Estes and other members of the Home Builders Association of Mississippi for the invitation.  #MS01","date":"Fri Oct 05 19:54:33 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi's workforce is second to none.  We appreciate all their hard work which helps manufacturers achieve their production goals. Celebrating @MfgDay in Mississippi and across our nation.  #MS01 https://t.co/c4f1C0waHZ","date":"Fri Oct 05 18:03:37 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Tax Cuts and Jobs Act continues to boost the economy.  Now it is time to make tax reforms permanent.  To learn more, please read my newsletter.  Also - Academy Day 2018 is coming soon.  Hope to see you there! https://t.co/noTXmZgiCz  #MS01 https://t.co/LOG9X8DvLh","date":"Fri Oct 05 16:46:19 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"In Tupelo with Rudy Dossett, Jr., David Leatherwood, and Rudy Dossett, III. #MS01 https://t.co/40Ebin7d5O","date":"Fri Oct 05 14:32:51 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to see everyone at Mississippi Manufactured Housing in Tupelo this morning. #MS01 https://t.co/3jWXLCcgii","date":"Fri Oct 05 14:04:44 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is Mississippi Manufacturing Week and a great opportunity for young people to learn more about the career paths available to them at the Imagine the Possibilities Career Expo this week.  The event is open to the public tomorrow from 2:00-5:00 at the @BCSARENA.  #MS01 https://t.co/QRp88QNDU9","date":"Tue Oct 02 22:03:53 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Academy Day 2018 is coming soon.  This is a great opportunity for middle and high school students who want to learn about America's military academies and their admissions process.  #MS01 https://t.co/sM3bSBq7LL","date":"Tue Oct 02 20:19:13 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Auto Parts Manufacturing Mississippi!  The company, located in Guntown, is increasing production.  This $100 million investment creates 50 jobs.  #MS01 https://t.co/wVJUUfz4Vy","date":"Tue Oct 02 19:10:52 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Today my team met with Mississippi representatives of the @ACCinTouch. Bryan &amp; Jane Anna Barksdale, Jenny White, and William Calhoun discussed issues facing their field and how we can assist in providing the best cardiovascular care to the people of Mississippi. #MS01 https://t.co/ikrqijUJHR","date":"Tue Oct 02 15:47:12 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On Sunday, September 30, our nation recognized Gold Star Mother's and Family's Day.  Donna Bagwell's son, U.S. Marine Corps Lance Corporal (LCpl) Lucas Tucker, paid the ultimate sacrifice on June 8, 2005, during Operation Iraqi Freedom.  #GoldStarFamily #MS01 https://t.co/46E4l1SD2E","date":"Mon Oct 01 21:24:44 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thankful to honor our veterans in Olive Branch this evening. #MS01 https://t.co/7TMxwIsaMX","date":"Sat Sep 29 00:26:01 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was a pleasure meeting COL Michael Ellicott, LTC Tom Darrow, Mr. Jim Lloyd, and Danny Ward. The @MemphisDistrict updated us on the work the US Army Corps of Engineers is doing in Mississippi's 1st District. #MS01 https://t.co/xWAtYT1pIR","date":"Thu Sep 27 17:14:59 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to receive the @NTU Taxpayers' Friend Award.  I will continue to advocate for pro-growth policies that will improve the quality of life for Mississippians and all Americans.  The Tax Cuts &amp; Jobs Act is working.  #MS01 https://t.co/lPKjP76nYt","date":"Wed Sep 26 21:42:52 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Memphis Stone and Gravel Company Vice President Alan Parks (Hernando) is in DC with other members of @NSSGA to discuss infrastructure, development, safety, the environment, and trade.  #MS01 https://t.co/2HBZxPkZ79","date":"Wed Sep 26 19:43:21 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Mississippi National Guard soldiers and airmen are providing #HurricaneFlorence2018 recovery support along the east coast.  To learn more, please read my newsletter.  https://t.co/YayUoTMDm7  #MS01 https://t.co/vPPsBxU6f4","date":"Tue Sep 25 20:50:12 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to have Lee County Board of Supervisors Mike Smith and Tony Roper stop by the office. They were in D.C to meet with White House officials about possible projects in Mississippi's 1st district. #MS01 https://t.co/1erxhgvptv","date":"Thu Sep 20 20:03:46 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Academy Day 2018 is coming soon.  The event is open to middle and high school students and their families, school officials, or interested citizens. Hope to see you there! #MS01 https://t.co/yBTbZmqjXB","date":"Thu Sep 20 19:39:55 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@nationalguardMS plays an important role in recovery efforts.  We are thankful for their service.  #MS01","date":"Wed Sep 19 19:06:55 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy Birthday @usairforce!  We are thankful for the commitment these men and women, including those @Columbus_AFB, make to protect our nation.  #MS01 https://t.co/Uqc8RK8qDz","date":"Tue Sep 18 12:01:01 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating the signing of the U.S. Constitution and the freedoms we all enjoy on this Constitution Day.  #MS01 https://t.co/dwFIdtJhDn","date":"Mon Sep 17 18:34:24 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It was great to see Mississippi State Representative Hank Zuber, Mary Childs, President and CEO of The Peoples Bank of Ripley, and Mississippi State Senator Rita Parks at our DC office today.  #MS01 https://t.co/cr7JCA4bKE","date":"Thu Sep 13 20:36:42 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our thoughts and prayers are with these men and women in uniform and all those offering assistance.  #MS01","date":"Wed Sep 12 20:42:54 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is exciting to see America's economy grow at a pace that we have not seen in years.  Please read my newsletter.  https://t.co/0Q9J5BRkiN #MS01 https://t.co/kkf6JjDFj4","date":"Wed Sep 12 19:18:27 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Remembering the thousands of Americans who lost their lives on September 11, 2001, and the many heroes who saved lives.  We remain a proud nation, ready to defend all that we cherish.  #MS01 https://t.co/I5r1DHbSDJ","date":"Tue Sep 11 11:01:04 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is National Truck Driver Appreciation Week, an opportunity to recognize truck drivers for their dedicated, demanding work on the road and for taking care of a very important job that is vital to our economy.  #MS01","date":"Mon Sep 10 19:01:34 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Great to see my friend Clay County Sheriff Eddie Scott, he is in town for a White House roundtable to discuss issues pertaining to law enforcement. https://t.co/e4AZZpUnQY","date":"Thu Sep 06 15:37:57 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is an honor to be recognized as a 2018 Hero of Main Street by @NRFnews.  Small businesses are the backbone of our economy.  I will continue to advocate for policies that will help them grow their businesses and create more jobs.  #retailadvocates  #MS01 https://t.co/7rcqWzYgC6","date":"Wed Sep 05 21:12:25 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Crop Insurance Professionals Association (CIPA) representatives William Cole of Batesville, MS, Marva Ulleland of Spokane, WA, and Matt Railey of Winter Haven, FL, came to my office today.  We discussed the Farm Bill and its effect on their business.  #MS01 https://t.co/8cB1N4BBie","date":"Wed Sep 05 20:21:40 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Our fall interns, Heston Lollar from Egypt, MS &amp; Alejandro Centurion from Mexico City, started yesterday. Alejandro graduated from Millsaps and Heston is pursuing his master’s degree from Mississippi State. We are excited to have them on board. https://t.co/atXGRfccfn","date":"Wed Sep 05 15:30:05 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Completed our August tour in the district with residents in Columbus, West Point, Houston, Woodland, Senatobia, Southaven, Byhalia, Eupora, and Ackerman.  To learn more, please read my newsletter.  https://t.co/Bwo7pC0IFN  #MS01 https://t.co/9LgcIdOr2o","date":"Tue Sep 04 20:07:26 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been a pleasure traveling throughout the district this month, visiting with many of you.  Please read my newsletter. https://t.co/psBC19oTpR    \n#MS01 https://t.co/ZkhRVHCc9G","date":"Fri Aug 31 21:31:51 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The good folks of Eupora.  Enjoyed seeing everyone. #MS01 https://t.co/TGmudP3P0D","date":"Fri Aug 31 14:26:07 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great day in Ackerman with Mayor Tim Curtis. #MS01 https://t.co/T5xDmbdliS","date":"Fri Aug 31 00:53:44 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Congratulations to Mueller Industries in Fulton.  The company has expanded with new warehousing and distribution operations, an investment of $3.83 million.  The expansion creates 60 new jobs.  #MS01 https://t.co/ai7wpPxirP","date":"Thu Aug 30 19:06:46 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Tate County Administrator Cole Massey in Senatobia today. #MS01 https://t.co/9bn3WzqEA5","date":"Wed Aug 29 22:38:51 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Had a great time at the Forever Young Senior Center in Southaven today. #MS01 https://t.co/mFJAy4wDcF","date":"Wed Aug 29 22:07:39 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Alma Jean's Southern Kookin in Senatobia with Alma Jean Burnett! #MS01 https://t.co/uG7MapA7C9","date":"Wed Aug 29 20:57:28 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Forever Young Senior Center in Southaven with member William Mooneyham and our Veterans Outreach Coordinator William Brooks.  #MS01 https://t.co/VUuuBmrPBt","date":"Wed Aug 29 20:27:44 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"@NorthwestMSCC with Dan Smith, Dr. Michael Heindyl, Michael Donas, and Dr. David Campbell. #MS01 https://t.co/b77S9vAuxm","date":"Wed Aug 29 16:58:38 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed spending the afternoon with residents of the Henry Clay Retirement Community in West Point including Peggy Starnes.  #MS01 https://t.co/AyXQ2q6xKH","date":"Tue Aug 28 21:40:08 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been a great month on the road, visiting with folks across north Mississippi.  Today, I appreciated the opportunity to spend time with residents of the Henry Clay Retirement Community in West Point.  Looking forward to more stops this week in the district.  #MS01 https://t.co/vzGmJGKzBm","date":"Tue Aug 28 20:12:42 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Celebrating the first delivery of the “Made in Mississippi” Arrow 3 Anti-Ballistic Missile canister from Stark in Columbus to Israel Aerospace Industries.  #MS01 https://t.co/kSgwFYcIh0","date":"Mon Aug 27 15:21:27 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Making our communities safer through the use of technology.  National Integrated Ballistic Information Network can help solve crimes by comparing bullet casings with those in a database.  The ATF mobile unit will be used to assist north MS law enforcement through December. #MS01","date":"Fri Aug 24 21:41:16 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"The Ripley Meet and Greet with The Peoples Bank Board Chairman Bobby Martin, President and CEO Mary Childs, CFO Kyle Smith, Vice President @BobDGlover, Tippah County Tax Assessor-Collector Joe Akins, and Tupelo District Office Director Darren Herring.  #MS01 https://t.co/vM8U2Dtbgw","date":"Fri Aug 24 20:59:23 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thanks to the Corinth Lions Club. #MS01 https://t.co/Nr2noutgMl","date":"Thu Aug 23 18:59:25 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"A great turnout at the Corinth Lions Club. #MS01 https://t.co/ip8nq3Bv47","date":"Thu Aug 23 17:17:14 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It is exciting to see renewed optimism throughout Mississippi and across the nation amid a booming economy and job growth.  Please read my newsletter.  https://t.co/y0J0Fy2Tml  #MS01 https://t.co/KJbtaYGEtK","date":"Wed Aug 22 21:26:27 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I appreciate every opportunity to meet with folks and will be back on the road this week.  To learn more about my work in the district, please click on the link.  https://t.co/ytDyltq9zg #MS01 https://t.co/e5qvqTOdJk","date":"Mon Aug 20 17:31:42 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"I look forward to August, spending time with hardworking Mississippians in the district.  I am always eager to listen to your ideas.  Please read my newsletter.    https://t.co/DUsSWLabvI   #MS01 https://t.co/8ydTMhajpi","date":"Thu Aug 16 20:34:57 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Happy 20th anniversary to @northropgrumman in Iuka. Our team was there to congratulate them during a celebration today. #MS01 https://t.co/g1gi3yFU6A","date":"Wed Aug 15 18:10:19 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Observing the RS-25 engine test @NASAStennis.  NASA's Space Launch System (SLS) will power the rocket @NASA is building to go to the Moon, Mars, and beyond. #MS01 https://t.co/JhJr1Bubzf","date":"Tue Aug 14 21:10:31 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"President Donald Trump has signed into law the John S. McCain National Defense Authorization Act for Fiscal Year 2019.  #NDAA will enable us to continue to rebuild our military and provide our troops with the tools they need to protect America.  #MS01","date":"Mon Aug 13 20:54:53 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Appreciated the opportunity to meet with State Farm agents in Tupelo today.  #MS01 https://t.co/HZEIJt53Ju","date":"Mon Aug 13 19:21:28 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It has been a productive week on the road.  Looking forward to spending more time in the First District throughout the month of August.  #MS01 https://t.co/TKbHRKvZZj","date":"Fri Aug 10 22:22:15 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Thank you for a closer look at the work being done at Westlake Chemical in Aberdeen, Plant Manager Jimmy Autrey and Compound Operator Ben Childers. #MS01 https://t.co/uSA75v9wEO","date":"Thu Aug 09 23:38:36 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"On the road again today in the First District. Got to meet many dedicated team members at Westlake Chemical. #MS01 https://t.co/1Kbo4SJzhv","date":"Thu Aug 09 20:47:16 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Taking part in a discussion with north Mississippi furniture manufacturers in Tupelo. #MS01 https://t.co/PmmHLtAQVk","date":"Wed Aug 08 17:40:52 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"It’s been a good morning discussing issues with residents in Iuka. #MS01 https://t.co/PXwG2xWQOS","date":"Wed Aug 08 16:32:25 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Enjoyed discussing important issues facing our nation at Bruce TV 7 this morning. #MS01 https://t.co/Z5puYe667x","date":"Tue Aug 07 16:15:10 +0000 2018","user_id":"3317799825"},{"handle":"RepTrentKelly","text":"Talking with a great group of people in Oxford this morning. #MS01 https://t.co/eqYJhiYjAd","date":"Tue Aug 07 14:52:24 +0000 2018","user_id":"3317799825"}]