[{"handle":"RepTrey","text":"🦈🦈🦈 https://t.co/HWhkHVNzib","date":"Wed Apr 06 22:07:12 +0000 2022","user_id":"811986281177772032"},{"handle":"RepTrey","text":"As I contemplate how I can work for you in new and better ways in the future, I won’t run for reelection this year….now I will fight for you and us in different ways.\n\nhttps://t.co/mwElf3bZf9","date":"Wed Jan 12 19:56:44 +0000 2022","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congress once again finds itself up against a funding deadline. I voted against the two-month, stop-gap funding bill that was released at 8am this morning because it perpetuates a broken system of temporary patches. Hoosiers deserve better and we can do better. https://t.co/ZXTNlgoMFF","date":"Thu Dec 02 22:30:10 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, @SpeakerPelosi is promising a vote on the Progressive BBB. What do you think BBB stands for?  Comment below.\n\n(a) Build Back Better \n(b) Biden’s Bullsh*t Bill\n(c) Breaking Businesses’ Backs\n(d) Blindly Burning Billions","date":"Fri Nov 05 15:57:54 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Democrats may not think checking the price before checking out is important, but the American people are going to be stuck paying the bill and we want to know. @HouseGOP is looking out for taxpayers and we've demanded a legitimate nonpartisan CBO score. https://t.co/yetSPsfTYO","date":"Thu Nov 04 17:48:22 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Now, &lt;24 hrs after the 2,135 pg bill was released, the Joint Committee on Taxation has produced a report out of thin air, claiming the bill costs $1.5 trillion. Notably, @jctgov ‘s score counts revenue of several proposals, but not costs. @mikedebonis https://t.co/13kb9RVaZz","date":"Thu Nov 04 17:48:21 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Meanwhile, I bet you can guess who they’re actually planning to cut taxes for … That’s right! Wealthy homeowners in high-cost Blue states! https://t.co/ODpUlQROva","date":"Thu Nov 04 17:48:21 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Dems and the administration claim that their historic tax increases will hit only corporations or billionaires, but American families and small businesses will end up stuck with tab. @housebudgetGOP https://t.co/f74MLVjUZf","date":"Thu Nov 04 17:48:20 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Progressives treat hard-earned taxpayer dollars like Monopoly money, but working Americans are who have to pay every time the federal government “Passes Go”. https://t.co/OwzSBnJYFA","date":"Thu Nov 04 17:48:19 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Dems calculate revenues just as poorly as they calculate costs—with their imagination! Progressives’ revenue estimates have fluctuated billions, and there’s no way to know what’s real vs. imaginary because it was drafted behind closed doors. https://t.co/HDxRAUw4pw","date":"Thu Nov 04 17:48:18 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"And this is only a “down payment.”  They’re already promising to come back for more! https://t.co/P5F2SjDl0e","date":"Thu Nov 04 17:48:17 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Americans know that creating new federal programs and massively expanding existing programs isn’t free, but there’s no telling what it will cost without a CBO score. @ReporterCioffi https://t.co/Nm1xR9nriD","date":"Thu Nov 04 17:48:17 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Does this Progressive shopping list look “Free” to you?? https://t.co/iN6K4MankJ","date":"Thu Nov 04 17:48:16 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We all know there’s no such thing as a free lunch, but Democrats and the administration keep insisting that the President’s Build Back Better plan won’t cost taxpayers a penny. https://t.co/Iam3TQhDKl","date":"Thu Nov 04 17:48:15 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday, I toured IBC Advanced Alloys’ new expansion, speaking with company president, Mark Wolma, and employees about the work they’re doing to build their business, bring well-paying jobs to the area, and invest in the Franklin community.\n\nhttps://t.co/jtBAUkt148","date":"Fri Jul 16 16:03:10 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"77 years ago, brave Allied forces stormed the beaches of Normandy fighting in the name of freedom to overcome our adversaries in Nazi-occupied France.\n \nThe sacrifice and heroism of these servicemembers will never be forgotten.","date":"Sun Jun 06 20:33:18 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, we remember the true cost of freedom and honor the men and women who paid the ultimate price for our country. American soldiers and their families dedicate their lives in service to this nation, and their selfless sacrifice deserves our utmost thanks and respect. https://t.co/3XetM9ziRu","date":"Mon May 31 18:28:00 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"https://t.co/dheVEELfjf","date":"Thu May 20 15:09:34 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was an honor to join @getactionpod and sit down with Dr. Al Knable and Nick Vaughn to discuss Hoosier priorities, the issues facing IN-09, and more! Check out the full episode here: https://t.co/Hi6DvHskGB","date":"Wed May 19 17:58:00 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Just dropped YIMBY with @RepDerekKilmer, incentivizing the removal of barriers and burdensome, restrictive land use policies to help Hoosiers access affordable housing and build better lives for themselves.\nhttps://t.co/nIXPut1Ial","date":"Thu May 13 20:51:48 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Too often, financial predators target senior citizens, who fall victim to scams. This week, the House passed @RepJoshG &amp; my Senior Security Act, which works on behalf of seniors to strengthen financial protections &amp; guard their life-long savings &amp; investments from scammers. https://t.co/Na8mPpToIb","date":"Thu Apr 22 20:51:30 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I’m proud to stand up and protect older workers. They are vital to our workforce in Indiana and across the country, making our economy stronger","date":"Fri Mar 26 14:11:29 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Live on @BloombergRadio with @kevcirilli to discuss today's FSC hearing on GameStop and market access for retail investors. Tune in now!\n\nhttps://t.co/8vHKL0xJTY","date":"Thu Feb 18 22:20:58 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thanks to the work of hardworking Hoosier manufacturers, @Toyota has produced their 30 millionth car right here in Indiana. Fitting for the \"Crossroads of America!\"","date":"Wed Feb 10 23:34:24 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"https://t.co/Yl5aagAfUW","date":"Thu Feb 04 23:37:06 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"One cannot protect our democracy by asserting that 535 members of the House &amp; Senate have the authority to choose our president. To be clear, that is what last night's votes were about. We must defend the integrity of our election system...","date":"Thu Jan 07 15:41:25 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"...and the will of millions of Americans, not continue our dangerous trend of ceding more and more of our God-given rights to a few in Washington.\n\nMy exclusive interview last night with the @DailyJournalNet on certifying states’ electoral votes: https://t.co/ONVkqzFuT3","date":"Thu Jan 07 15:41:25 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My thoughts on what happened at the Capitol this afternoon: https://t.co/SaV3glJxvu","date":"Wed Jan 06 21:19:04 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our team serves Hoosiers first.\n\nI wrote to Speaker Pelosi requesting that all COVID-19 doses designated to myself and my team be re-distributed to susceptible Hoosiers. Full letter ⬇️ https://t.co/8CY0ZZAGmX","date":"Sun Jan 03 21:52:10 +0000 2021","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My statement on tonight’s funding package ⬇️ https://t.co/GxV6Cr9C9n","date":"Tue Dec 22 01:17:25 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We have less than 6 hours to a shutdown, in the middle of a pandemic, and have had the worst economic recession in 90 years.\n\nYet, your reps don’t have a single word of the proposed bill. \n\nAmerica doesn’t have congressional leadership working on the needs of the American people.","date":"Sun Dec 20 23:51:01 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"79 years ago, our nation was attacked at Pearl Harbor. This “date which will live in infamy” solidified our commitment to fighting for freedom, justice, &amp; liberty around the world. Today, we honor the lives lost in this tragic attack &amp; pause to remember the true cost of freedom. https://t.co/fhpVMByh7D","date":"Tue Dec 08 00:36:28 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Investing in VETS Act solves the discrepancy between federal contracting goals for service-disabled veteran-owned small businesses &amp; other small business contracting categories, something that was brought to my attention during a constituent meeting w Eric from Jeffersonville","date":"Wed Nov 11 16:44:39 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, and every day, we give thanks to those who have served our country.  This year on Veterans Day, I am honoring our country’s veterans by introducing the Investing in Veteran Entrepreneurial Talents (VETs) Act. https://t.co/57zLJLhpSJ #VeteransDay https://t.co/AZy7etXqef","date":"Wed Nov 11 16:42:04 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"By the numbers, our Hoosier manufacturers:\n\n➡️ Employ almost 20% of Indiana’s workforce.\n➡️ Account for almost 30% of Indiana’s economic output.\n➡️ Export $21.6 billion to free trade partners around the globe.\n\n#MFGDay20","date":"Fri Oct 02 16:20:07 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #NationalManufacturingDay, a day to recognize the ingenuity and perseverance of American manufacturing and all it contributes to our country and economy. #MFGDay20 https://t.co/POF5FBaj2p","date":"Fri Oct 02 16:19:40 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At a farm roundtable in Washington County, a farmer shared his stories of costly black vulture attacks and his inability to protect his livestock because of the federal bureaucracy. We turned this into meaningful action for farmers across the country. https://t.co/HQaDG9wRpE","date":"Thu Oct 01 19:56:29 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the House → the Livestock Protection Act, which would fix the federal bureaucracy and allow Hoosiers to protect their livestock from predatory black vultures, has passed the House and the Senate, soon to be signed by the President.","date":"Thu Oct 01 19:55:57 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My statement on why I voted ‘yes’ to table H. Res. 1148, a resolution on statues in the U.S. Capitol that doesn’t help American families and businesses move forward and bounce back from this pandemic: https://t.co/MEL650lu1k","date":"Wed Sep 30 01:05:41 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"That’s why I’ve continued pushing for passage of my DRIVE-Safe Act, legislation to open up more driving industry jobs to Hoosiers at a time when we all want to see higher employment and wages → https://t.co/Lv4O1rWtkj #NTDAW2020","date":"Wed Sep 16 19:00:12 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Trucking is essential to our nation’s economy: getting products on our retailer’s shelves + directly into customers’ hands.","date":"Wed Sep 16 19:00:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning on @WDRBNews:  I introduced the #LivestockProtectionAct so Hoosier farmers can take proactive measures to protect their livestock from predatory birds → https://t.co/ca02hcjKok","date":"Thu Jul 11 15:04:58 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Trucking is essential to our nation’s economy: getting products on our retailer’s shelves + directly into customers’ hands.","date":"Wed Sep 16 19:00:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Over the past few months, truck drivers played a key role in delivering essential products like toilet paper, hand sanitizer, and face masks so we could stay safe throughout the pandemic. Thank you to all truck drivers for your tireless work. #NTDAW2020","date":"Wed Sep 16 18:59:40 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week is #NationalTruckDriverAppreciationWeek. We’ve always relied on our truck drivers for timely and efficient deliveries to our homes, our businesses, and our local shops and restaurants. #NTDAW2020","date":"Wed Sep 16 18:59:18 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our casework team was able to help Chris file his claim and receive the benefits he was due. We’re here to help you navigate the red tape of the federal bureaucracy and ensure that our government is working for you. Read the full story in Chris’s words: https://t.co/bYtPVwA3DA","date":"Mon Sep 14 16:18:55 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Meet Chris → a U.S. Army veteran from Nashville, IN. While filing a claim with the U.S. Department of Veterans Affairs (VA), Chris ran into bureaucratic delays and was having trouble making any headway with the federal government. https://t.co/HMXRY4euBr","date":"Mon Sep 14 16:18:35 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"These words from @GWBLibrary still ring true, 19 years later. I remember exactly what I was doing on the morning of September 11, 2001, and I’m sure you do too. It’s seared into our memories. Every year as we reflect on 9/11, we are reminded of how lucky we are to be Americans.","date":"Fri Sep 11 11:49:11 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“Terrorist attacks can shake the foundations of our biggest buildings, but they cannot touch the foundation of America. These acts shatter steel, but they cannot dent the steel of American resolve.” #September11","date":"Fri Sep 11 11:44:59 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our communities have done an incredible job helping Hoosiers get back on their feet after the COVID-19 shutdown. Now, strengthening our local infrastructure is a key component of delivering jobs and economic development to Indiana https://t.co/GAk46nxDND","date":"Thu Sep 03 17:55:54 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Six municipal airports in French Lick, Paoli, Seymour, Salem, Bloomington, and Bedford just received part of the U.S. Department of Transportation’s investment in airport safety and infrastructure grants.","date":"Thu Sep 03 17:53:22 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Nancy Pelosi: How about we give you $25 billion in more taxpayer money (on top of the $10 billion just received from Treasury) and a law that says you can't change anything that isn't working?","date":"Sat Aug 22 14:59:11 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"USPS: We have lost $78 billion in twelve years. Mail volumes are down to 1985 levels but addresses are at an all time high. 23% fewer people are coming into the post office to buy things, but post office locations are only down 4%.","date":"Sat Aug 22 14:58:55 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our small businesses up and down #IN09 are home to some of the hardest working people I’ve met. They’re providing for their families, employees, communities, and the future of our Hoosier economy. I will continue to fight for Hoosier small businesses every day in Congress.","date":"Tue Jul 28 18:24:31 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to join @1SI_Chamber today and receive the ‘Spirit of Enterprise’ Award from the @USChamber ➡️ https://t.co/FJ199jFm9G","date":"Tue Jul 28 18:23:27 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We had a great conversation today during our virtual roundtable on international trade, updates to rural broadband, and what the next coronavirus relief bill might mean for our state's agriculture community. Thank you to all Hoosier farmers who joined today! @INFarmBureau https://t.co/jjv9NeOQZ5","date":"Wed Jul 22 17:44:13 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our small businesses and Main Streets create so much character for our communities and I will continue to fight for their success and growth in Congress.","date":"Fri Jul 17 16:52:54 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"As we continue our recovery from the coronavirus economic shutdown, I toured downtown Seymour to discuss what the city is working on to increase jobs and opportunities here and maintain a vibrant downtown for Hoosiers, both local and visitors, to enjoy ➡️ https://t.co/4b7Rw8OclL https://t.co/kD87pdtwv4","date":"Fri Jul 17 16:52:29 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Heroes work here in Lawrence County #HealthcareHeroes https://t.co/erayeXN2cV","date":"Thu Jul 09 19:20:49 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I’ve had the pleasure to represent the professionals at @NAVSEACrane in Congress + work alongside them to support the Hoosier state’s role in our national defense. Congrats Capt. McKay on your new role + Capt. Oesterreich on your retirement. Both are extremely well deserved. https://t.co/tq5jjkMgHg","date":"Wed Jul 01 18:57:51 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I’m excited to see that thru the CARES Act, schools can apply for funds to provide students w/ laptops or hotspots so all can succeed while distance learning. We have a long way to go to solve this problem, but this is a great step in the right direction: https://t.co/RoLqBL0PpH","date":"Tue Jun 23 14:56:05 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At home learning during coronavirus highlighted this lack of access to reliable internet for many families who now need it to access the classroom.","date":"Tue Jun 23 14:54:47 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Disparity in access to reliable internet has always been a reality in Indiana. I’ve met with members of the Indiana Electric Cooperatives numerous times to discuss this issue + how to help all Hoosiers, especially students, access the internet and technology they need to succeed.","date":"Tue Jun 23 14:54:18 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"By including the DRIVE-Safe Act in the STARTER Act, Republicans are putting jobs and economic growth at the forefront of their surface transportation legislation, which is especially vital as we rebuild our post-coronavirus economy: https://t.co/xPNgw47XLM","date":"Wed Jun 17 18:10:51 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act, inspired by Hoosiers here in the Crossroads of America, has been included in the @TransportGOP STARTER Act: https://t.co/xPNgw47XLM https://t.co/eHP1yaqVwp","date":"Wed Jun 17 18:09:35 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To everybody who was and still is on the frontlines of coronavirus, thank you for your commitment to our communities, our health, and our safety.","date":"Tue Jun 16 13:03:19 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"and the Harrison County Health Department. https://t.co/89yhpEv7xf","date":"Tue Jun 16 13:03:02 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Harrison County Sheriff's Department https://t.co/bvIrKzksVY","date":"Tue Jun 16 13:02:35 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Harrison County Hospital https://t.co/23ygFl0CxF","date":"Tue Jun 16 13:02:01 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Georgetown Police Department https://t.co/7P5L0zU5Ng","date":"Tue Jun 16 13:01:19 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Floyd County Sheriff's Department https://t.co/SGegi2MopD","date":"Tue Jun 16 13:00:58 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Baptist Health Floyd https://t.co/3Ai2EdUKmr","date":"Tue Jun 16 13:00:22 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"the New Albany Police Department https://t.co/v2A8GCF51s","date":"Tue Jun 16 13:00:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To thank some of these incredible and hardworking Hoosiers for their time, dedication, expertise, and bravery, I spent yesterday afternoon delivering lunch to emergency rooms and police offices in Floyd and Harrison Counties:","date":"Tue Jun 16 12:59:15 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Many worked countless hours and days on the frontlines to ensure we had the health and safety measures necessary throughout each phase of the pandemic.","date":"Tue Jun 16 12:58:59 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"For the past few months, our communities have been all hands on deck to help others through the health risks and uncertainty posed by the coronavirus pandemic.","date":"Tue Jun 16 12:58:37 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations Naomi C. from Bloomington High School for winning the 2020 Congressional Art Competition with her piece “Carry-Out Only”, which will hang in the U.S. Capitol for the next year. Congrats Naomi and thank you to all who participated! https://t.co/EGR0dpwIsN","date":"Fri Jun 12 14:57:04 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On average, a PPP loan for a Hoosier business was just under $130,000, meaning that small businesses throughout our communities were prioritized by this loan program.","date":"Tue May 26 19:55:18 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To date, Hoosier small businesses have received over $9 billion in Paycheck Protection Program (PPP) loans to pay hardworking employees and get through this pandemic. https://t.co/3AQKydLRho @SBAgov","date":"Tue May 26 19:54:58 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Department of Health and Human Services (HHS) just announced that rural health clinics in Indiana will receive $3 million for coronavirus testing programs thanks to the Paycheck Protection Program and Health Care Enhancement Act ➡️https://t.co/bOzi8V5Onb","date":"Thu May 21 20:18:26 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"🚨Don’t forget: Today at 11AM, the Indiana Department of Workforce Development is hosting a virtual job fair with the U.S. Census Bureau. Register here ➡️https://t.co/8NNdbjMMFs","date":"Thu May 21 13:00:01 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A teacher’s dedication to our nation’s next generation of leaders knows no bounds, and that commitment to students has proven to be stronger than ever during this pandemic.","date":"Wed May 20 17:17:17 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Every Hoosier teacher is deserving of the ‘Teacher of the Year’ title for their tenacity and hard work in seeing our students through this pandemic and ensuring they continue to receive a great education 🍎https://t.co/h7eBJ1lUud","date":"Wed May 20 17:17:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Every Hoosier teacher is deserving of the ‘Teacher of the Year’ title for their tenacity and hard work in seeing our students through this pandemic and ensuring they continue to receive a great education 🍎https://t.co/h7eBJ1lUud","date":"Wed May 20 17:17:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Positive news and forward momentum on a vaccine as Americans across the country hope to get back to their jobs and day to day routines. This speaks to American ingenuity and leadership in biosciences ➡️https://t.co/iUEKWdiqSt","date":"Mon May 18 15:01:03 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Instead of helping Americans get back to work, we are voting on Speaker Nancy Pelosi’s wish list which includes funding for sanctuary cities, bailing out states, preventing state voter ID requirements, and more wasting of taxpayer dollars ➡️https://t.co/XHixVNMaTQ","date":"Fri May 15 14:17:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Now, states are working to safely reopen + balance health and economic growth. However, @SpeakerPelosi just intro'd legislation that recklessly spends tax $ + takes full advantage of this pandemic by spending your hard-earned money on her political agenda: https://t.co/nDoi6jqyx2","date":"Thu May 14 19:43:53 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To help Americans through this time, Congress has passed a few pieces of legislation to hold over families, businesses, and health care workers until we can reopen our communities and restart the greatest economy in the world. (1/2)","date":"Thu May 14 19:41:06 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To date, Congress has provided $765 billion in state + local funding to aid in our fight against coronavirus. Part of our federal response has been helping local + state governments respond to this pandemic in the best way possible for their own communities. https://t.co/s1D5fSBx3S","date":"Wed May 13 19:48:53 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A moving and special tribute for our #healthcareheroes. @BlueAngels","date":"Tue May 12 19:19:15 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"🎥: @meadowshospital, @ValleVistaHS, @CRHSouth, and Valle Vista Health System","date":"Fri May 08 20:23:33 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To our healthcare heroes: thank you. https://t.co/VALMTHySop","date":"Fri May 08 20:18:03 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thanks to @POTUS regulatory reduction and prioritization of testing, the private sector’s speed and skills to create the needed tests, and the collaboration between the two, America has conducted more than twice as many tests as the next leading country. (2/2) https://t.co/iRdjN1MiPJ","date":"Wed May 06 17:49:35 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Availability of coronavirus testing plays an important part in opening back up our country so people can get back to work. (1/2)","date":"Wed May 06 17:49:01 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy #NationalNursesDay to all Hoosier nurses who have been working tirelessly on the frontlines of coronavirus. Thank you for seeing your patients + their families through this difficult time and for always putting others first. We are eternally grateful. \n\n📸: @meadowshospital https://t.co/WPJbMhuUly","date":"Wed May 06 16:19:26 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #NationalTeacherAppreciationDay. Teachers at every level are working around the clock to make sure their students have what they need and ensure that their education is not disrupted. Thank you for your hard work that truly has a lasting impact on future generations. 🍎 https://t.co/T6ybHKu7ty","date":"Tue May 05 14:42:56 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I joined @thehill Coronavirus Special Report w/@SCClemons to discuss the importance of finding the right balance of minimizing coronavirus health risks while still enabling and empowering Americans to get back to their normal way of life. Tune in: https://t.co/QzPpL3gdZs","date":"Thu Apr 30 21:20:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"🚨Signed into law: @POTUS just signed the Paycheck Protection Program and Health Care Enhancement Act to:\n\n✅Increase PPP funding for small businesses\n✅Support our care providers and hospital systems\n✅Allocate more resources to get more Americans tested for coronavirus","date":"Fri Apr 24 17:07:35 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I hear from Hoosiers every day who are worried about feeding their families and saving their jobs. We have to recognize and have a conversation about the real economic cost of coronavirus and find a way to minimize both the economic costs and biological risks at the same time →","date":"Mon Apr 20 15:49:59 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Sheltering in place forever is not a sustainable strategy. It was a strategy meant to buy time. It was a strategy meant to flatten the curve. But it’s not a strategy that we can sit at home and wait for the coronavirus to pass. → https://t.co/UlCKg7D7ql","date":"Fri Apr 17 15:55:26 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We owe Americans a reasonable, thoughtful plan based in science to balance the health risks of coronavirus with the economic losses of people’s jobs and businesses and ability to support their children and go to church. As a country, we need a way forward. https://t.co/lKbXvm6im9","date":"Thu Apr 16 19:04:27 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great work, @IndianaUniv!","date":"Fri Apr 10 20:57:05 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Good news of the day☀️ Bryan’s whole neighborhood in Franklin welcomed him home after 10 days on a ventilator because of Coronavirus. I just spoke to Bryan on the phone and he was in bright spirits, happy to be home, and optimistic about our country’s ability to fight this virus. https://t.co/d779qi0rRO","date":"Fri Apr 10 18:36:58 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"You can only pick three #IN09 https://t.co/RKZOKFEV9J","date":"Tue Apr 07 23:03:23 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Updated stay-at-home guidance on our updated webpage. Click here for new FAQs from the Governor’s office and a fresh resource page for information you might need during this pandemic: https://t.co/xwTyB8f3BM","date":"Tue Apr 07 21:18:22 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Incredible work being done at Shields Windshields, making medical supplies with the glass typically used for their construction vehicle windshield operations. While they’re stepping up for our community, they are also looking to hire → https://t.co/aXDh1d8Imh","date":"Tue Apr 07 16:05:04 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"TOMORROW → @WorkforceIND is hosting a Facebook Live event to discuss unemployment insurance benefits. Also included: information for self-employed individuals + contractors and FAQs. To join live or to access the recording, head to: https://t.co/a8wIpm5mzh","date":"Tue Apr 07 14:12:11 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I joined Bloomberg Radio to discuss ensuring this $2 trillion of taxpayer money from the CARES Act is used efficiently and effectively in combatting Coronavirus. You work hard for the money you send to Washington – it always needs to be working for you: https://t.co/xQg4R5eFhK","date":"Mon Apr 06 13:56:07 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To bolster stocks of PPE in southern Indiana, John Riley of Maker13 here in Jeffersonville is turning his co-work space into a medical supplies manufacturer. Another incredible story of Hoosiers getting each other through this pandemic ➡️https://t.co/3zBvdbRxIR @newsandtribune","date":"Thu Apr 02 13:47:57 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My team has reached out to our local hospitals to check in, many of which are working to keep up with PPE supply needs. While some are seeing shortages in medical supplies, these Johnson County women are spending their social distancing time helping out: https://t.co/exB7QzOGaz","date":"Wed Apr 01 17:29:54 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Listen In: I joined @ChamberBloom to discuss the #CARESAct, what it means for small businesses, and where they can turn to best help their employees + the future of their business. New resources are coming in by the truck load, so Erin and I break everything down for you here →","date":"Tue Mar 31 16:02:51 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"If you visit my website at https://t.co/xwTyB8f3BM you can find information on everything from how to apply for unemployment insurance to resources for veteran healthcare during coronavirus. My team is updating this site daily with new information and the latest guidance.","date":"Tue Mar 31 13:46:23 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers, as we work together to fight coronavirus, there are numerous resources available from the Indiana state government, the federal government, and the private sector to help lessen the burden on Hoosiers and help families through this tough time.","date":"Tue Mar 31 13:45:56 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"According to the @Indiana_EDC, Employees for essential businesses do NOT need documentation. Law enforcement will not be stopping drivers on their way to work, traveling for an essential activity, or simply taking a walk. For more clarification: https://t.co/umRPGQCNHV","date":"Thu Mar 26 16:50:41 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today @GovHolcomb announced a statewide order for Hoosiers to stay home in an effort to stop the spread of coronavirus. Head to my website for FAQs on what this stay at home order means for you and your family → https://t.co/umRPGQCNHV https://t.co/3BpmRHE0uf","date":"Mon Mar 23 19:13:18 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Huber’s Starlight Distillery is repurposing its bourbon distilling process to make hand sanitizer and help keep Hoosiers safe and prevent the spread of coronavirus. Thank you, Huber’s, for your contribution to our fight against coronavirus → https://t.co/yEouXe5kmO","date":"Mon Mar 23 17:31:02 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On my website is a list of food banks in IN09 that are here to serve Hoosiers. I'm also doing what I can to work with schools who are putting plans into place to offer pick-up and drop-off meal services as kids’ school lunches have been disrupted: https://t.co/XMZ4skvX6G https://t.co/pg5Z4qRolm","date":"Mon Mar 16 17:46:30 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We have a duty in Congress to keep Americans safe, help our economy heal, &amp; help Hoosiers stay on their feet. I voted tonight for the Families First Coronavirus Response Act to provide necessary and affirmative relief to all sectors of our economy and employees affected. (2/2)","date":"Sat Mar 14 04:38:13 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The deep economic uncertainty caused by social distancing – a necessary effort encouraged by medical professionals to prevent the further spread of coronavirus - is hurting all sectors of our economy including our small businesses. (1/2)","date":"Sat Mar 14 04:37:09 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Latest update from the CDC – Indiana is receiving $10 million from the Centers for Disease Control and Prevention (CDC) to assist our state and local health departments who are on the frontlines of our coronavirus response efforts ➡️ https://t.co/qc45jiMTim","date":"Wed Mar 11 19:12:33 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@iafflocal558 + @IAFFLocal4444 were in DC this week to discuss the mental health issues fire fighters face everyday on the front lines of emergencies in our communities. They work round the clock to keep us safe; our country's laws should help keep them safe too. #IAFFLegCon https://t.co/UkHPSbT4DV","date":"Wed Mar 11 15:19:47 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Washing our hands is a simple but effective way to stay healthy during the coronavirus outbreak. Learn more about our country's all-hands-on-deck approach to the coronavirus, and what you and I can do to prevent it from spreading, here → https://t.co/Ft2MRpqOpf","date":"Tue Mar 10 20:12:32 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI: I joined @DanSpehler on @INFocusIndiana to discuss our efforts in Congress to deploy the resources necessary for Hoosiers, including hospitals and first responders, to stay healthy amid the #coronavirus outbreak. Listen here: https://t.co/hL7c9YyFoV","date":"Mon Mar 09 20:39:49 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great piece from @ApartmentWire\nin @thehill on the Yes in My Backyard Act, which passed the House last week, and the importance of encouraging local communities to expand access to affordable housing →\nhttps://t.co/gBIM4Amxwo","date":"Mon Mar 09 20:36:12 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On @BloombergTV: We have to make sure our supplemental funding for #coronavirus is a real and proactive policy response, not a political tool. https://t.co/npVVVCM9J9","date":"Tue Mar 03 19:59:07 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I joined @DavidWestin on @BloombergTV to discuss this morning's Federal Reserve rate cuts. I applaud the Fed in taking preemptive action to ensure we stabilize any economic outcomes because of #coronavirus. https://t.co/aKB8uLJwxI","date":"Tue Mar 03 19:46:06 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI → Last night the House passed the Yes in My Backyard Act, legislation that encourages communities to increase availability of affordable housing: https://t.co/4jebIlOsCo","date":"Tue Mar 03 14:49:27 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"PASSED THE HOUSE → The Yes In My Backyard Act passed the House with bipartisan support.  We want more affordable homes for American families. Today’s passage of YIMBY signals strong support across the aisle to reform our nation’s housing regulations at all levels of government.”","date":"Mon Mar 02 23:32:59 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations to @SeymourMainSt on a successful 25 years of bringing vibrancy, economic excitement, and opportunity to downtown Seymour. Looking forward to what’s to come! https://t.co/WhWGIJJEBF @SeymourTribune","date":"Mon Mar 02 21:32:31 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A safe and stable home serves as the bedrock for families, and I look forward to continue working to ensure access to affordable housing. Learn more about Yes in My Backyard here: https://t.co/ZGUP8LtNVw","date":"Fri Feb 28 15:58:45 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My legislation, the Yes in My Backyard Act, just passed the House Financial Services Committee with bipartisan support. This legislation encourages communities to increase availability of affordable housing. https://t.co/ORsz9UodvP","date":"Fri Feb 28 15:58:22 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The @USDOL just invested $4 million in Ivy Tech's skills training programs enabling Hoosiers to access the training they need: https://t.co/4QI8pVzsVw","date":"Wed Feb 26 19:27:49 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@IvyTechCC programs, located at campuses across the state, offer Hoosiers the skills they need to fill these jobs, gain the skills needed for a 21st-century workforce, and grow and be successful in their careers.","date":"Wed Feb 26 19:26:26 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In our strong economy, Hoosier businesses of all sizes are thriving, growing, and hiring, but the #1 problem I hear when I tour these businesses is they can't find enough people to fill their open high-skilled jobs. https://t.co/voWN2yQH4m","date":"Wed Feb 26 19:25:25 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Excited that @USDOL recognized @IvyTechCC efforts and is investing in skills training for Hoosiers","date":"Wed Feb 26 19:14:56 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our economy keeps climbing and empowering American prosperity. Highlights from the February Jobs Report:\n\n✅ 225,000 new jobs\n✅ 3.1% wage growth from last year\n✅ 3.6% unemployment\n\nhttps://t.co/sNIDxKiIVa","date":"Fri Feb 07 17:43:18 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was also honored to have State Rep. Woody Burton, from Johnson County, join me for this occasion who has served Hoosiers with a full heart for many years. Thank you, Woody, for your service and congratulations on your well-deserved retirement. https://t.co/KqJdmHmEIW","date":"Wed Feb 05 16:42:40 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"President Trump’s State of the Union last night reflected the American spirit and resolve of which we should be proud everyday. \n\n“We are Americans. We are pioneers. We are pathfinders.” @POTUS","date":"Wed Feb 05 16:41:51 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our nation’s strong economy and positive economic outlook continues to spur more investment and growth in our communities → Niagara Bottling just announced the expansion of its facility to the River Ridge Commerce Center and 27 new full-time job openings: https://t.co/Sj4xbvn9sV","date":"Mon Feb 03 16:57:00 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our very own Deidra of the Washington County Farm Bureau was invited to the White House for @POTUS signing of USMCA. Deidra has worked on her family's farm her whole life + is excited to finally have an updated trade deal that puts American farmers first! @INFarmBureau https://t.co/NBeuSH7AeS","date":"Wed Jan 29 21:44:49 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Tune in →  @POTUS made a promise to update our international trade agreements, ensure economic stability, and put American jobs first. By signing the USMCA today, he is keeping that promise:","date":"Wed Jan 29 16:16:37 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI → I joined @FreedomWorks to discuss why we need term limits, a lobbying ban, and spending reform to get to the root of a variety of problems Americans have with Congress and the way their federal government runs. Take a look: https://t.co/h77VnlY5VD","date":"Tue Jan 28 16:16:11 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"As companies grow, employers are offering the necessary training to fill their open jobs and help employees succeed for the long-term: https://t.co/94PgyfPKE5","date":"Tue Jan 21 20:06:54 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Like many here in Indiana, manufacturers across the country are set to increase spending on training programs as high-skilled, high-paid manufacturing jobs are on the rise in our booming economy.","date":"Tue Jan 21 20:06:40 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Like many here in Indiana, manufacturers across the country are set to increase spending on training programs as high-skilled, high-paid manufacturing jobs are on the rise in our booming economy.","date":"Tue Jan 21 20:06:40 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the Senate ✅ USMCA is one step closer to becoming law and providing economic certainty for Hoosier farmers and manufacturers. This updated trade deal is a win for Indiana and our American economy. On to the @POTUS desk!","date":"Thu Jan 16 16:56:16 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I have personally met with the hardworking staff members leading these programs and nonprofit providers, including Centerstone in Bloomington pictured here, to discuss the housing issues they see in their neighborhoods. https://t.co/hWs9JjuN2M","date":"Tue Jan 14 21:45:38 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"➡️ $1,658,493 for Centerstone Indiana Inc., Indiana University Health Bloomington, Inc., and Shalom Community Center, Inc in Bloomington\n➡️ $220,191 for LifeSpring, Inc. in Jeffersonville\n➡️ $56,148 for Blue River Services, Inc. in Corydon \n\nhttps://t.co/1CryyYull4","date":"Tue Jan 14 21:27:44 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Breaking 🚨 @HUDgov  announced an almost $2 million investment in combating homelessness in Indiana's Ninth Congressional District: https://t.co/1CryyYull4","date":"Tue Jan 14 21:27:15 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Now, a little over a year after opening and incredible success, Mark and Brigid are expanding The Root to downtown Jeffersonville, so more Hoosiers can benefit from the space and resources they offer → https://t.co/0sozOYcDcu","date":"Tue Jan 14 13:40:02 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last spring, I joined father/daughter duo Mark and Brigid who opened @TheRootCowork, a co-work space for start-ups and small companies, in New Albany. https://t.co/O4lcIOoQLr","date":"Tue Jan 14 13:39:30 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I spoke with @IIB about today's #JobsReport, our strong American economy, and our thriving Hoosier economy, where employers + businesses are seeing more growth than they thought was possible, and employees are seeing wage growth and more careers to choose from →","date":"Fri Jan 10 19:42:29 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"If you cross paths with a law enforcement officer, be sure to give him or her a quick thank you.","date":"Thu Jan 09 16:36:07 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #NationalLawEnforcementAppreciationDay a small token of appreciation from a grateful nation to each and every member of our law enforcement. Thank you for your tireless work to keep us, our families, our neighborhoods, our Friday night football games, + our borders safe.","date":"Thu Jan 09 16:35:39 +0000 2020","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our economy is working for everyone ➡️ pay for the bottom 25% of wage earners rose 4.5% over the past year. Exciting to see our pro-growth policies are paying off and giving everyone the chance to work toward their American Dream:  https://t.co/Y4s4xwE0PD","date":"Fri Dec 27 20:49:29 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Glad @SpeakerPelosi finally allowed what we knew would be a strong, #bipartisan vote on #USMCA https://t.co/cN3V2L3cYg","date":"Thu Dec 19 21:24:23 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Now that @SpeakerPelosi has had her vote, let’s get back to doing real work for the American people.","date":"Thu Dec 19 01:37:30 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Tonight, I voted NO on the Democrats' 3-year long attempt to overturn the results of the 2016 election of @POTUS. From the start this partisan process, the only impeachment along party lines in our history, has been about political showmanship, not Americans’ priorities.","date":"Thu Dec 19 01:36:59 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"One year later, our Charlestown community still mourns the loss of Sgt. Bertram, a dedicated neighbor, officer, friend, brother, and son, whose legacy of kindness and commitment lives on every day.","date":"Thu Dec 12 17:52:54 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I look forward to supporting this updated, 21st century trade deal when it comes to the House floor for a vote. #USMCANow","date":"Tue Dec 10 22:08:52 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"American manufacturing and agriculture, two defining pieces of our Hoosier economy, have been hard hit by trade uncertainty – and have long deserved a level playing field. Thanks to @POTUS leadership, the U.S, Mexico, and Canada have finally come to an agreement on #USMCA.","date":"Tue Dec 10 22:08:36 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Solid November Jobs Report: \n\n✅266,000 new jobs\n✅50 year unemployment low\n✅3.1% wage growth","date":"Fri Dec 06 14:12:07 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Waiting for @SpeakerPelosi to bring #USMCA to the floor https://t.co/dpmEwFmSte","date":"Thu Dec 05 21:41:46 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to write a letter of support on their behalf and look forward to the future transportation updates made possible by this grant: https://t.co/lXyy0atuN7 @theheraldtimes","date":"Tue Dec 03 16:31:14 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI ➡️ @USDOT announced a $1,125,000 grant for Bloomington Transit. Just last year I visited with General Manager Lew May and other members of the BPTC board who have worked hard to modernize their services for Hoosiers in Bloomington.","date":"Tue Dec 03 16:30:43 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night in Charlestown, Sgt. Ben Bertram of the Charlestown Police Department did not return home. It is with deep sorrow that our community mourns this loss. We thank you Sgt. Bertram. Rest easy. @CvillePDInd #ThinBlueLine https://t.co/cRPXgKB9Sf","date":"Thu Dec 13 17:42:18 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI ➡️ @USDOT announced a $1,125,000 grant for Bloomington Transit. Just last year I visited with General Manager Lew May and other members of the BPTC board who have worked hard to modernize their services for Hoosiers in Bloomington.","date":"Tue Dec 03 16:30:43 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Don't forget: In less than a year, you will need a REAL ID to enter a federal building or board a flight. Click here for information from the BMV + @DHSgov about how to obtain a REAL ID or how to know if you already have one ➡️ https://t.co/9yttNLr3yO","date":"Mon Nov 25 16:08:55 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Announcement from @LillyPad ➡️ Thanks to the #TaxCutsAndJobsAct, Eli Lilly is investing $400 million in manufacturing facilities and creating 100 new Hoosier jobs: https://t.co/vYp65TAyfj","date":"Wed Nov 20 18:58:30 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"November is National Alzheimer’s Disease Awareness Month. I recently sat down w/ volunteers who are advocating for our Hoosier seniors who are battling Alzheimer’s. Thank you for your tireless work; I will continue to support your efforts + senior care here in Congress. #EndAlz https://t.co/M4vf5JTwhb","date":"Tue Nov 19 17:11:59 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week is National Apprenticeship Week, a reminder of the importance of providing our students with the skills, leadership, and career training they need to find successful careers right here in Indiana ➡️ https://t.co/TvYDcxQlG9","date":"Sat Nov 16 17:58:52 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I recently held a veterans roundtable in Bedford to hear firsthand what veterans think about the VA health system, stories of success or roadblocks to care, and what our country and Congress can do to ensure veterans can access their VA care: https://t.co/aev2EnGkRq","date":"Tue Nov 12 17:57:10 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday was Veterans Day, a day not only to celebrate and thank our country’s veterans, but to listen to their stories and learn from their experiences.","date":"Tue Nov 12 17:56:28 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Read more about my visit to John Wooden Middle School in the @theheraldtimes: Hollingsworth answers student questions and urges them to stay engaged ➡️ https://t.co/2nK3tG5opW","date":"Tue Nov 12 16:05:47 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In addition to discussing the importance of a well-funded American military, we discussed the approach Twigg is taking as it competes to attract hardworking Hoosiers to its workforce. Thank you for taking time out of your busy schedules to meet with me and share your mission.","date":"Wed Nov 06 18:48:38 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@TwiggAerospace in Martinsville specializes in precision fabrications, supplying both military and commercial aerospace firms. https://t.co/GguJ4TpAGe","date":"Wed Nov 06 18:48:12 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Kicked off the day in Martinsville at John Wooden Middle School. I’m always impressed with our Hoosier students, and these 8th graders were no different. Thank you for your thoughtful questions! https://t.co/oQ0QjBn2kR","date":"Wed Nov 06 16:02:38 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@JFDpio your newest volunteer is all ready to go! ##HappyHallowen 🎃 https://t.co/NPuIVTZD9n","date":"Thu Oct 31 22:35:03 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I voted against today’s Democrat resolution to deprive @POTUS of his due process and against continuing a partisan investigation. House Democrats have misappropriated a solemn constitutional duty to delegitimize an election and the 62 million voters who supported our President.","date":"Thu Oct 31 15:42:19 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In @wbiw ➡️ White House Drug Policy Office Awards Funds to Scott County to Prevent Youth Substance Use: https://t.co/522T5SOYEf","date":"Wed Oct 30 21:14:34 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#IN09 @ONDCP DFC Support Program recipients:\n\n✅Upstream Prevention, Inc. (Greenwood)\n✅Scott County Partnership, Inc. (Scottsburg) \n\nHoosiers across Indiana are making a difference thru their devotion to our kids + drug use prevention in our communities: https://t.co/bz6E4tCBGK","date":"Wed Oct 30 18:49:12 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last week marked the anniversary of the SUPPORT Act, the single largest congressional effort to tackle the opioid epidemic, becoming law. This bill, which I voted for, reauthorized the Drug-Free Communities Program that helps strengthen our local partners fighting youth drug use.","date":"Wed Oct 30 18:12:06 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Just announced ➡️ 2 coalitions in #IN09 received @ONDCP Drug-Free Communities grants to continue the fight to prevent youth substance use: https://t.co/bz6E4tCBGK","date":"Wed Oct 30 17:57:46 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Spent the morning filling care packages for our troops who spend their days fighting ISIS #SupportOurTroops @the_USO https://t.co/V99gAeIQdv","date":"Wed Oct 30 15:05:35 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This brave Clarksville Fire crew rescued Levell Washington earlier this year from the Ohio River. I was honored to present them each with a small token of our Clarksville community's appreciation for always being here to keep us safe. https://t.co/GvInueiOBJ","date":"Tue Oct 29 20:04:38 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"National Prescription Drug-Take Back Day is this Saturday. Disposing of expired, unused, and unwanted prescription drugs is an important piece of our efforts to prevent opioid abuse for future generations. Click here to find a disposal location near you → https://t.co/7nckpfjyjs","date":"Tue Oct 22 18:41:38 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"✅Promises Made, Promises Kept ✅\n\nThe Trump Administration has completed 74 miles of wall along the southern border to keep our nation and our neighborhoods safe: https://t.co/2NCqUZZTzq","date":"Tue Oct 22 14:56:22 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Every day I tour manufacturers that are desperate for Hoosier talent, and there is no shortage of talent in our kids. I'm committed to ensuring we match up the talent we have with the jobs we need filled to empower our economy through the 21st century → https://t.co/BNCHeAHgqe","date":"Thu Oct 17 20:01:06 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you to all of our Chambers of Commerce, and the hardworking staff and volunteers, for all you do for the growth and vibrancy of our communities, and for always having me at your events, roundtables, and townhalls. #SupportYourLocalChamberOfCommerce","date":"Wed Oct 16 16:36:20 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our local Chambers of Commerce across Indiana provide incredible resources to our local businesses and Main Streets. #SupportYourLocalChamberOfCommerce","date":"Wed Oct 16 16:35:46 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Orange County’s Habitat for Humanity recently broke ground on their 30th build. They continue to work hard everyday to address the affordable housing crisis and provide safe homes. Thanks for showing me around and for helping make homeownership possible for Hoosiers. @Habitat_org https://t.co/lEMXVt2mL5","date":"Wed Oct 09 15:00:29 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Southern Indiana county gets $14M loan for faster internet → https://t.co/fzUZNUNAnW @Matt_D_McKinney","date":"Tue Oct 08 14:48:02 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"First thing this morning: coffee and conversation at our roundtable with Lawrence County veterans about how to provide those who have served our country better access to healthcare and education. https://t.co/3lGQ5XRXRt","date":"Tue Oct 08 13:51:22 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"IN09 has been fighting for stronger rural broadband + connectivity because of how vital it is for education, healthcare, farming, and business success. I look forward to the boost this @USDA loan will give our efforts to connect all to highspeed internet→ https://t.co/Vi8htLR8dA","date":"Mon Oct 07 18:06:01 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Lowest in 50 Years 📉: The jobless rate in September dropped to 3.5%, the lowest since December 1969 → https://t.co/FTsPXFoNl6","date":"Fri Oct 04 18:59:53 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I visited Eagle Manufacturing at Brown County High School. This student run business provides machining, engineering, and design services while giving our students a true first-hand experience in manufacturing and business processes. #MFGDay19 #NationalManufacturingDay https://t.co/MCRsGBq72p","date":"Fri Oct 04 15:53:36 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #NationalManufacturingDay, a day to celebrate generations of Made in Indiana and the men and women who work tirelessly everyday to advance Hoosier innovations → https://t.co/0xhEqifASl #MFGDay19","date":"Fri Oct 04 15:52:27 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congrats to the Wren family on your new home + thank you to @NAFCHabitat for your hard work on behalf of Hoosiers. Fighting the affordable housing crisis will continue to be a priority of mine so families can always have a stable roof over their heads → https://t.co/8LszFWPyJf","date":"Mon Sep 30 14:40:13 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning's read in @theheraldtimes on the bipartisan Yes In My Backyard Act that I introduced w/ @RepDennyHeck to help address our country's affordable housing supply → https://t.co/L1zQY51eHQ","date":"Mon Sep 23 13:01:37 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A safe and stable home serves as a bedrock for families. Our federal laws should encourage building affordable housing for our neighbors, not drive up costs and create barriers through burdensome and restrictive land use policies.","date":"Wed Sep 18 15:31:11 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI: I introduced the Yes In My Backyard Act with @RepDennyHeck → https://t.co/jwWYn3xgj8","date":"Wed Sep 18 15:29:53 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Outcome of Oregon’s unprecedented wage regulation:\n\nGrocery stores: we can’t afford this *cut staff*\nGrocery shoppers: lines are too long *picks self-checkout or orders online*\nOregon: Let's ban self-checkouts.\n\nhttps://t.co/bz18R3mBV0","date":"Wed Sep 11 18:37:41 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our vivid memories of September 11 serve as constant reminders for Americans, today + tomorrow, that our country and what we stand for can come under attack at any moment, but we are stronger than any adversary when we come together as one. #NeverForget → https://t.co/S55caEzl6r","date":"Wed Sep 11 12:49:03 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"After 25 years, it’s time for NAFTA to be replaced with a 21st century trade agreement to:\n\n➡️Generate an estimated $34 billion in new auto manufacturing investments\n➡️Break down trade barriers for farmers and manufacturers\n➡️Create more jobs and raise wages\n\n#USMCANow https://t.co/idzWzD8D2n","date":"Tue Sep 10 15:41:38 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I had a great meeting with @AARP volunteer Roger Shields about the importance of fighting for lower drug prices and protecting Medicare and Social Security: https://t.co/WVnVnYqjMt","date":"Tue Sep 10 15:27:07 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"Before 9/11 becomes just another day in the future,\" said New Albany Fire Department Battalion Chief Matt Bowyer, \"remember and teach the events of this day to the younger generations, so that all those people did not die in vain.\" https://t.co/mAXwaRa9k6 @newsandtribune","date":"Mon Sep 09 15:17:53 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"Speaking at a Greater Ellettsville Area Chamber of Commerce luncheon on Thursday, Hollingsworth answered questions ranging from health care to his stance on socialism.\" → https://t.co/LtivfVcZeH","date":"Fri Aug 16 19:55:40 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great Q&amp;A with the Salem High School senior class on everything that came to their minds, from state testing to what my favorite food is! https://t.co/pDUsnT7SVC","date":"Fri Sep 06 19:33:57 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On #NationalReadABookDay, Brinley at Bradie Shrum Elementary said her favorite part of going back to school is seeing her friends and reading new books. 📚 https://t.co/FBlCK9ELDQ","date":"Fri Sep 06 17:53:55 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Checked out the new pool at Salem Middle School before talking with Mr. Heavin’s social studies class about the issues that matter most to them and how I can ensure their voices are heard in Washington. Thanks for having me today! https://t.co/ofBVr0WeUD","date":"Fri Sep 06 16:57:16 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Next up: East Washington High School, where we talked paying for college, vaping, and other topics on the students’ minds. https://t.co/cuBksEtI7T","date":"Fri Sep 06 15:30:20 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Kicked off our back to school day in Washington County at East Washington Middle School, which was recently named a School to Watch! https://t.co/b2bAx3tGAG","date":"Fri Sep 06 14:47:45 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thanks for having me!","date":"Wed Aug 28 14:29:28 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I spoke to @JordanRichart @SeymourTribune about issues affecting Hoosier farmers, including record rainfall and trade. Read more about what I’m doing in Congress to help our agriculture community ➡️ https://t.co/GVvwiK41rv","date":"Thu Aug 22 14:55:48 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Read more about our discussions on healthcare and socialism at the Ellettsville Chamber of Commerce townhall here → https://t.co/LtivfVcZeH","date":"Fri Aug 16 19:56:47 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"When it comes to our nation's healthcare, we need to be focusing on delivering more options, more competition, and putting the patient at the center of care instead of a government bureaucrat.","date":"Fri Aug 16 19:56:11 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"Speaking at a Greater Ellettsville Area Chamber of Commerce luncheon on Thursday, Hollingsworth answered questions ranging from health care to his stance on socialism.\" → https://t.co/LtivfVcZeH","date":"Fri Aug 16 19:55:40 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Kicked off the day talking to the over 100 hard-working men and women at UPS in Bloomington. Thanks for having me this morning! @UPS https://t.co/ShPCbgqji4","date":"Thu Aug 01 14:07:32 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Morning read: My meeting with @BtownSchools Fellowship of Christian Athletes in the @SeymourTribune → https://t.co/gZowIvZxgo https://t.co/b9zMzynZji","date":"Thu Aug 01 13:39:01 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning I met with the leaders of @BtownSchools Fellowship of Christian Athletes and checked out their project, Shed for You. This amazing initiative offers basic needs for the community. Thanks for showing me around and for your commitment to Brownstown! https://t.co/7AUWP8n9Vw","date":"Mon Jul 29 14:46:37 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Coming Up → Academy Day! If you or someone you know are interested in attending a service academy after high school, be sure to attend Academy Day on Sept. 7 @ Seymour High School to learn more about the nomination process. Register here: https://t.co/VTvqVTwF5H https://t.co/z9e820jZdG","date":"Mon Jul 29 13:00:00 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My #DRIVESafeAct addresses the driver shortage, enhances safety + skills training for those entering the driver workforce, and opens up more job opportunities for young Americans: https://t.co/H27zmPAhxY","date":"Wed Jul 24 17:47:30 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"New report from @TRUCKINGdotORG:  Trucker Shortage Balloons to More Than 60,000 Driver Jobs → https://t.co/hhcWJvSIG8","date":"Wed Jul 24 17:44:13 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI: I introduced the Fostering Innovation Act, a bill to ensure costly federal regulations do not prevent investment in cutting edge, scientific and medical research and development → https://t.co/Gy427OxzbQ","date":"Wed Jul 24 12:09:17 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I introduced the bipartisan Fostering Innovation Act w/ @RepBenMcAdams to ensure government regulations do not get in the way of scientific and medical innovation → https://t.co/Gy427OPa3o https://t.co/KcM2z0Qz1B","date":"Tue Jul 23 21:47:42 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“Exploration is really the essence of the human spirit.” - Frank Borman #Apollo50th https://t.co/Q2IqM2cVrI","date":"Sat Jul 20 18:12:27 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Just announced → @US_EDA @CommerceGov is investing $3 million in Floyd County to make critical roadway infrastructure improvements and to attract $10 million in private economic investment and new Hoosier jobs: https://t.co/xiMqwPsOpX","date":"Wed Jul 17 19:32:05 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning on @WDRBNews:  I introduced the #LivestockProtectionAct so Hoosier farmers can take proactive measures to protect their livestock from predatory birds → https://t.co/ca02hcjKok","date":"Thu Jul 11 15:04:58 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#LivestockProtectionAct in @wbiw → \"Representative Trey Hollingsworth introduced the Livestock Protection Act of 2019 to address the deadly and costly black vulture attacks on livestock during calving season\" https://t.co/QmvlGIF1Uf","date":"Thu Jul 11 14:46:09 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#LivestockProtectionAct on @WHAS11 → \"Indiana Congressman Trey Hollingsworth wants to help farmers keep their livestock alive and that means changing the rules for a dangerous bird.\" https://t.co/iwNolPxlgh","date":"Thu Jul 11 14:37:49 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#LivestockProtectionAct in the @courierjournal → \"Farmers could soon enjoy more freedom when it comes to defending their livestock against vulture attacks, thanks to a new piece of legislation.\" https://t.co/aZtUjGlB3y","date":"Wed Jul 10 16:13:16 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#LivestockProtectionAct in the @newsandtribune → \"By attaining this preemptive permit, Hoosier farmers would be able to prevent the loss — a solution many have hoped for.\" https://t.co/fV8auQ6odN","date":"Wed Jul 10 14:07:57 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I introduced the #LivestockProtectionAct to empower farmers to proactively protect their livestock without interference by a bloated federal bureaucracy → https://t.co/5QzUSDgd9Q","date":"Wed Jul 10 13:43:58 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At an agriculture roundtable I hosted last year, a farmer from Washington County shared his story about how black vultures are destroying livestock and his frustrations with current federal law.","date":"Wed Jul 10 13:43:27 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Making Floyd County history → Congratulations to our own Romeo Langford, selected 14th in the NBA draft: https://t.co/M3RBHgKRza","date":"Fri Jun 21 13:39:31 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to present Thaddaeus Broussard with his Congressional Gold Medal for commendable public service today. Thaddeus volunteered at his local animal shelter in Sellersburg for two years as an animal care technician. Congratulations Thaddaeus! #gold2019 https://t.co/dSjIA8Haea","date":"Thu Jun 20 18:08:21 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Senior Security Act, which I introduced with @RepJoshG, is just a part of the important public-private partnership working together to address financial scams and fight for our seniors.","date":"Tue Jun 04 17:43:53 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today we held a bipartisan roundtable conversation on technology’s role in protecting seniors’ financial health. The stories shared about senior fraud and theft are heartbreaking and all too frequent in communities across the country. @SIFMA https://t.co/GI1tpY7Tn1","date":"Tue Jun 04 17:43:19 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Allowing the year-round sale of E-15 will reduce our dependence on foreign oil, lower costs for families at the gas pump, and help grow demand for Hoosier corn farmers. I'm excited to see this benefit all corners of our country’s economy → https://t.co/Kl4aAr2PLN","date":"Mon Jun 03 18:40:55 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Two years ago in Salem, Mayor Merry showed me the safety, sanitary, health, and water quality risks at the Salem Water Treatment Facility. Today, after working w/ the City of Salem and the USDA, we broke ground on the new Salem Water Treatment Facility! https://t.co/RnlmaMHyUW","date":"Mon Jun 03 15:57:09 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to spend the morning at the Professional Fire Fighters Union of Indiana state convention. We can always rely on our fire fighters and first responders to be there when we need them. Thanks for all you do. #PFFUI https://t.co/5JMhuf8p5s","date":"Thu May 30 17:02:09 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In Case You Missed It: I introduced the POLICE Act to ensure our local law enforcement officers can protect themselves while protecting us. Learn more here → https://t.co/wplf5NhPWV","date":"Tue May 28 16:11:48 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today we remember the brave men+women who have given their lives so we can live free here at home. On every war memorial there are countless names, each with their own story of bravery and service. We will never forget what they have given to this country #MemorialDay2019 🇺🇸","date":"Mon May 27 13:58:16 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A brighter look to the future: consumer optimism hits highest level in 15 years → https://t.co/PJswohHkLb via @WSJ","date":"Mon May 20 19:20:05 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great to see Greenwood Police Officer John Myers and his son in DC for Police Week. Thanks for stopping by my office and thank you Officer Myers for your commitment to the safety of Hoosiers. #NationalPoliceWeek @gpd_police https://t.co/tiBdbIb5Qc","date":"Thu May 16 19:50:32 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week, during #NationalPoliceWeek, I'm honored to reintroduce the POLICE Act and offer additional protections to our police men and women who dedicate their lives to keeping us safe. Learn more here → https://t.co/wplf5NhPWV https://t.co/s55yyuC4Ab","date":"Thu May 16 15:06:43 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning in the @newsandtribune: my thoughts on the importance of POLICE Week, honoring our law enforcement, and remembering the life of Sgt. Ben Bertram → https://t.co/PzWIN5cBQi","date":"Thu May 16 14:30:42 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week during National Police Week, and every week, we remember Sgt. Bertram’s legacy, his commitment to protecting Hoosiers, and every law enforcement officer who has made the ultimate sacrifice. #NationalPoliceWeek","date":"Tue May 14 20:34:10 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Charlestown Police Officers and their families traveled to Washington this week to honor Sgt. Ben Bertram, who died in the line of duty in December. #NationalPoliceWeek https://t.co/39VQs5STLy","date":"Tue May 14 20:33:56 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@theheraldtimes Arts Watch: 2019 Congressional Art Competition winners announced! → https://t.co/2OaeQYWKWX","date":"Mon May 13 14:26:17 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @WSJ → The @CFPB estimates that in 2017 seniors experienced 3.5 million incidents of financial exploitation. My #SeniorSecurityAct that passed the House helps address this growing problem: https://t.co/NvOesyBoLS #fintech @RepJoshG","date":"Fri May 10 16:18:31 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our local Hoosier businesses are built and run with heart and character. This week during #NationalSmallBusinessWeek, be sure to shop small and support our local businesses throughout Indiana!","date":"Thu May 09 17:13:40 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Pamela + Christie are working towards opening Inspired Grounds Cafe to give individuals with special needs, like their sons, the opportunity for a job right in their community. They are truly inspiring! https://t.co/GuJTGCaHcs","date":"Thu May 09 17:13:11 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations to our 2019 Congressional Art Competition  winners! → https://t.co/bXuTO2wuwZ @wbiw https://t.co/hwFbnkNlJy","date":"Wed May 08 17:07:51 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week is #NationalSmallBusinessWeek, a week to recognize the contributions of America's entrepreneurs and small business owners across the country. Our local businesses work tirelessly to help grow our Indiana economy  → https://t.co/hhM1NcTUJU","date":"Mon May 06 21:30:49 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Senior financial scams are at a record high, and it's time we take action to fight for our seniors who have spent years working + saving for retirement. The Senior Security Act is an important step in helping our parents + grandparents protect their life-long savings. https://t.co/ouw6cEnycW","date":"Wed May 01 16:24:41 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the House ➡️ Senior Security Act. This bill I introduced w/ @RepJoshG will help stop financial predators from targeting seniors. Learn more: https://t.co/rbqCtDklKw","date":"Tue Apr 30 18:36:05 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Ben Bertram Memorial Park is a fitting tribute for a man who dedicated his life to others. Our Charlestown community will always remember Sgt. Ben Bertram → https://t.co/0VW0dcdNrJ","date":"Tue Apr 09 14:49:21 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I’m fighting every day for businesses of all sizes to contribute to our Hoosier economy, create jobs, and promote growth right here in Indiana. Honored to receive @USChamber's Spirit of Enterprise Award → https://t.co/pUYe2gmlno #SOE19 https://t.co/rCKzDEqDao","date":"Thu Apr 04 14:43:33 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This legislation creates an interdivisional task force at the @SEC_News to strengthen financial protections for senior citizens. Find out more → https://t.co/zyw9CNAkcD","date":"Tue Mar 26 20:39:30 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I introduced the Senior Security Act w/@RepJoshG to fight on behalf of our senior citizens and protect their life-long savings and investments from financial scammers.","date":"Tue Mar 26 20:36:04 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"According to the Treasury Department, U.S. banks reported a record 24,454 suspected cases of elder financial abuse last year, more than double the amount five years earlier https://t.co/JH5mMQI60z @WSJ","date":"Tue Mar 26 20:34:03 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is National Agriculture Day! Our local family farms are this country's original small businesses, and Hoosier farmers are some of the most hardworking people I know. Learn more about how I'm fighting for Hoosier farmers → https://t.co/lFi33KrUuQ #NationalAgDay https://t.co/DsWVdfzAZz","date":"Thu Mar 14 16:48:18 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI on @wave3news: I visited the @CasiSoutherInd Head Start program in Jeffersonville. Our communities are fighting everyday for better futures for Hoosiers and our federal government should be allowing these local programs to flourish → https://t.co/873t4b6wTx","date":"Wed Mar 06 15:37:43 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My Banning Lobbying and Safeguarding Trust (BLAST) Act in the @dcexaminer: \"If we want Washington to control less of our lives, we need to make big government less profitable to the people who keep making it bigger.\" → https://t.co/YYngpvikk7","date":"Mon Mar 04 16:50:04 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I reintroduced the DRIVE-Safe Act w/@RepCuellar to:\n\n✅Address the trucking industry's driver shortage\n✅Open up more job opportunities for Hoosiers\n✅Enhance safety and skills training \n\nLearn more here: https://t.co/Lv4O1rWtkj","date":"Tue Feb 26 22:02:39 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Tune in → I joined @93wibc to discuss my legislation to ban Members of Congress from becoming lobbyists, the Green New Deal, and tonight’s immigration bill: https://t.co/bGDvoNoA90","date":"Fri Feb 15 00:14:30 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI: I reintroduced another bill to reform the way Washington works. Read more in the @Times_Mail → https://t.co/gwos7lCjCU","date":"Wed Feb 13 20:38:18 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great having you here!","date":"Wed Feb 13 18:16:18 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Politicians in Washington should be making decisions they know are right for their constituents and the country, not for their career or future lobbying job. Read more about my bill to ban Members of Congress from becoming lobbyists here → https://t.co/aYDAXJSkep","date":"Tue Feb 12 18:00:13 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Always thankful for our law enforcement for serving our neighborhoods. Hoping everyone is staying safe on the roads this morning.","date":"Sun Feb 10 15:53:45 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Centerstone program at the Jackson County Sheriff’s Department is all about second chances → https://t.co/IcBzS2HWaf https://t.co/0zxRo5mivz","date":"Tue Feb 05 18:13:24 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"After suffering injuries in the line of duty and keeping Corydon Elementary safe, Corydon School Resource Officer Steve Duley is back on the job. Thank you for your service Steve, and welcome back! → https://t.co/LkVPuQ9Pqk @WDRBNews","date":"Tue Feb 05 15:09:54 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the chaos and dysfunction in Washington, the interests and livelihoods of Hoosiers – and all Americans – are coming second to the self-interests, social media followings, and financial futures of too many Members of Congress → https://t.co/fH5PfuvOHU @SeymourTribune","date":"Mon Feb 04 15:23:55 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My #DRIVESafe legislation works to increase high-paying, high-skilled trucking career opportunities for Americans across the country. Companies like @Walmart are offering almost $90K salaries and expanded benefits for drivers → https://t.co/GC50KQdTmc @WLKY","date":"Tue Jan 29 15:18:21 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the chaos and dysfunction in Washington, the interests and livelihoods of Hoosiers – and all Americans – are coming second to the self-interests, social media followings, and financial futures of far too many Members of Congress → https://t.co/ZiIDQOrgn7 @wbiw","date":"Thu Jan 24 19:34:42 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to receive @IHIF1's 2018 Legislator of the Year award for my commitment to public health policy and service to Indiana’s health science business community. Learn more here → https://t.co/mV4MMCbYf9 https://t.co/Oc2ByHNvVy","date":"Tue Jan 22 21:27:51 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I joined @DanSpehler on @FOX59 to discuss why my term limits bill would ensure our government puts you and your family first → https://t.co/1iZLlPYrJa","date":"Mon Jan 14 18:21:32 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"To the men and women who work late, overnight, a double shift, and away from their family in the line of danger, thank you. Our communities and neighborhoods are better and safer because of you. #LawEnforcementAppreciationDay https://t.co/NlfxPAS1F7","date":"Wed Jan 09 20:43:42 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My first bill of the 116th Congress: Term limits for Members of Congress → https://t.co/5rCK0qlTcB https://t.co/TIsz2C7SbN","date":"Tue Jan 08 19:31:25 +0000 2019","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Merry Christmas from our family to yours! 🎄 Wishing everyone joy and happiness today and as we head into the New Year. https://t.co/UOuHUbP4Ih","date":"Tue Dec 25 14:00:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Support from @MonroeUnitedWay in @theheraldtimes on the 2018 Farm Bill that the House passed last week. This legislation will provide certainty and stability to Hoosier farmers and reform nutrition assistance programs → https://t.co/AZNEOzEpXb","date":"Wed Dec 19 23:07:09 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night in Charlestown, Sgt. Ben Bertram of the Charlestown Police Department did not return home. It is with deep sorrow that our community mourns this loss. We thank you Sgt. Bertram. Rest easy. @CvillePDInd #ThinBlueLine https://t.co/cRPXgKB9Sf","date":"Thu Dec 13 17:42:18 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy 202nd Birthday Indiana! #StatehoodDay https://t.co/EEQ1q3ZK9r https://t.co/rkNq2sPN04","date":"Tue Dec 11 16:43:32 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today's @indystar shares stories from Indiana in 1941 and the united front Hoosiers presented in the face of our country's enemies →  https://t.co/pPTJRqMTvy #PearlHarborRemembranceDay","date":"Fri Dec 07 16:00:29 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"A day that will live in infamy.\" Today, on the anniversary of the attacks on #PearlHarbor, we remember the lives lost at Pearl Harbor 77 years ago and reflect on the courage of every veteran who served in World War II. #PearlHarborRemembranceDay","date":"Fri Dec 07 15:59:23 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Celebrated Southern Indiana American Red Cross’s new location in Jeffersonville as they continue serving our community here through disaster training, Service to Armed Forces, and CPR/first aid training → https://t.co/30uuF8tfpT @newsandtribune","date":"Wed Dec 05 17:14:03 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Small businesses are a powerful force in our economy, providing jobs to our neighbors, investment in our communities, and excitement for our future as they grow and innovate. #SmallBusinessSaturday","date":"Sat Nov 24 17:00:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The strength of America's small businesses is this:\n\n✅ 29 million small businesses in the US\n✅ 2/3 of all new jobs are created by them\n✅ 47% of private sector employees work for them\n✅ 46% of private sector output comes from them\n\n#smallbusinesssaturday2018","date":"Sat Nov 24 16:35:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Across Indiana, small businesses, and the owners, employees, customers, and suppliers, make up who we are. Read my full column celebrating Hoosier small businesses here → https://t.co/CQ8COFSAUH #SmallBusinessSaturday @newsandtribune","date":"Sat Nov 24 16:13:39 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I’m thankful for our service men and women and emergency personnel who put their lives on the line for us, our neighborhoods, and our country every single day. Happy Thanksgiving, from my family to yours. #HappyThanksgiving https://t.co/jdbF45sUl5","date":"Thu Nov 22 14:31:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We have so much to be thankful for every day as Americans, much of which is because of the sacrifices that others make on our behalf. Because of their service, we can gather safely around the dinner table this evening surrounded by family and friends.","date":"Thu Nov 22 14:30:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@ProsserCareers students spent their afternoon yesterday building a house in New Albany from the ground up and learning helpful life skills. Learn more about Prosser’s on-site training in the @newsandtribune → https://t.co/BLiG4IUzJU","date":"Tue Nov 20 17:02:19 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On this day, 100 years ago, at the 11th hour on the 11th day of the 11th month, World War I ended. Today, on #VeteransDay, we remember the lives lost in World War I, and every brave hero who has ever served this country. Thank you for your service. 🇺🇸 https://t.co/ZbXVONyd2u","date":"Sun Nov 11 15:51:48 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Pro-growth tax code + fair federal regulations = strong economic growth:\n✅3.1% wage growth (highest in a decade)\n✅250,000 jobs added in October\n✅3.7% unemployment (lowest rate in nearly 50 years)\n✅Consumer confidence at an 18 year high","date":"Mon Nov 05 14:58:19 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"More economic good news from the October jobs report ➡️","date":"Fri Nov 02 15:33:49 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Latest numbers on wage growth: wages and salaries have jumped by 3.1%, the highest level in a decade. When our economy grows, everybody is #BetterOffNow → https://t.co/3RIB8IKEZw","date":"Thu Nov 01 16:32:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I am honored to receive the Award for Manufacturing Legislative Excellence from @ShopFloorNAM! I fight for the issues important to men and women who make things in America. https://t.co/OykLo6PkWJ","date":"Wed Oct 31 15:45:24 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #TakeBackDay. Visit my website to find a drop-off location to safely dispose of your unused prescription drugs → https://t.co/P7YSBn34Zy","date":"Sat Oct 27 13:39:37 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI→ @POTUS signed HR6. We all know someone, whether it's a family member, a friend, or a neighbor, who has been affected by the opioid crisis. That's why I won't stop fighting for commonsense measures to curb the tragedies caused by illicit opioids: https://t.co/BWj5Exgg5W","date":"Fri Oct 26 12:28:02 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The expansion of Clark Regional Airport is going to make a profound difference in the traffic that can come in + out of this airport, and I’m excited about the opportunities that this will bring as more and more businesses find a home right here in southern Indiana →","date":"Thu Oct 25 19:08:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you to all, including our local + state police departments and county partnerships, who are participating in Drug Take-Back Day, to cut the supply of prescription drugs and work toward ending the opioid epidemic. Click here to find out more → https://t.co/P7YSBn34Zy","date":"Wed Oct 24 20:45:35 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@POTUS is signing the SUPPORT for Patients and Communities Act, a compilation of more than 50 bills to forge ahead in our historic fight to provide tools to Hoosier families and communities hit by the scourge of opioid addiction. Watch live → https://t.co/tVTLfPpDkM","date":"Wed Oct 24 18:09:09 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Saturday is Drug Take-Back Day. From 10AM-2PM, you can properly dispose of expired and unused prescription drugs to support ongoing efforts to combat the opioid epidemic that is facing our communities. Click here to find a drop-off location near you → https://t.co/P7YSBn34Zy","date":"Wed Oct 24 13:14:29 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Chuck Lee, a Brown County veteran who served in the U.S. military for nine years in Panama, the Persian Gulf, and Iraq, is helping fellow veterans get back into nature and their daily routines → https://t.co/Kj2HEnWMUH @bcdemocrat #IN09","date":"Thu Oct 18 17:38:37 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“The U.S. is back on top as the most competitive country in the world, regaining the No. 1 spot for the first time since 2008” - @WSJ https://t.co/prcaXxSRRF","date":"Wed Oct 17 16:31:33 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Lukas always dreamed of attending the U.S. Naval Academy. I was honored to help him with his application process → https://t.co/aWApxwR2xh","date":"Tue Oct 16 14:19:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last year, I nominated Brett, who is now a cadet at the United States Military Academy in West Point → https://t.co/LhjYGW5a5c","date":"Mon Oct 15 15:29:17 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It is my distinct honor to nominate young adults to the United States Military, Naval, Air Force, Coast Guard, or Merchant Marine Academies. If you or someone you know is interested in attending a service academy, be sure to attend Academy Day on Saturday: https://t.co/sndoFGE2CB","date":"Mon Oct 15 15:28:26 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The @HouseGOP has:\n\n✅ Passed pro-growth tax reform for small businesses + middle class families\n✅ Passed over 50 bills to fight the opioid epidemic\n✅ Demanded accountability at the VA\n\nRead more of my thoughts in the @DailyJournalNet: https://t.co/pfRjwOMzHt","date":"Sat Oct 13 19:36:24 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @bcdemocrat: \"Eagle Manufacturing is a place where they can test those skills and learn where they might fit into their career paths.” More on another great program in #IN09 helping students gain the skills they need for successful careers → https://t.co/kcDcaAZnhH","date":"Fri Oct 12 16:04:08 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#NationalFarmersDay","date":"Fri Oct 12 14:36:17 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Agriculture is an important part of our state’s history – and our future. On #NationalFarmersDay thank you to all Hoosier farmers for your endless hardwork, for feeding our country, and for making Indiana proud. https://t.co/uEf8drKVEY","date":"Fri Oct 12 13:01:13 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Learn more about how this adjustment will help you keep up with the changing cost of living here → https://t.co/of9TykDooV","date":"Thu Oct 11 15:38:41 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Seniors: @SocialSecurity\njust announced that the cost-of-living adjustment for 2019 benefits will be 2.8%, the biggest increase in 7 years. This is great news for the millions of seniors I am fighting for every single day who rely on Social Security benefits to support themselves","date":"Thu Oct 11 15:37:53 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great visit in Jeffersonville at @maker13indiana,  a community workshop that provides the space, tools, and instruction necessary for anyone to come in and accomplish their next big idea. #MFGDay18 https://t.co/wg68gGmbXk","date":"Fri Oct 05 17:45:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, on National Manufacturing Day, and every single day, I'm honored to fight for our hardworking manufacturers and create an economy that allows our local manufacturing industry to thrive for generations to come. #MFGDay18 https://t.co/vprVM67YPh","date":"Fri Oct 05 12:18:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"If you're planning on visiting DC, be sure to visit https://t.co/4wPZADuCTq\nand schedule a tour of the U.S. Capitol to see his portrait hanging in the halls, representing #IN09. #hoosierhysteria","date":"Thu Oct 04 14:15:33 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"New Albany HS's own Romeo Langford has kicked off his @IndianaMBB career! https://t.co/C7IFKCzIjF #hoosierhysteria","date":"Thu Oct 04 14:15:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Attention Hoosier high schoolers: if you are interested in attending a service academy and are planning on applying this fall, all nomination applications must be postmarked today + sent to my Greenwood office. Learn more + download an application here → https://t.co/ZMhHSDhYD8","date":"Mon Oct 01 14:30:11 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Tune in at 10am to watch the commissioning of the #USSIndiana ➡️","date":"Sat Sep 29 13:32:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@CNBC: Consumer confidence in the economy is at its highest in 18 years → https://t.co/ackc9gsDJJ","date":"Wed Sep 26 14:14:18 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Over a million seniors in Indiana rely on Medicare programs to manage their care and costs. Check out 4 bills I supported that passed the House last week to maintain a strong Medicare program to protect the financial security and health of our seniors → https://t.co/QhcYedLoqX","date":"Thu Sep 20 20:21:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to be named a ‘Medicare Advantage Champion’ by the Coalition for Medicare Choices for my ongoing commitment to protect the Medicare Advantage program for millions of seniors. Learn more: https://t.co/ey3wJYDmxU @protectmyMA #MedicareAdvantage","date":"Thu Sep 20 19:59:14 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to receive the 2018 “Fueling Growth” Award and continue to fight to remove regulatory burdens and expand fuel options for consumers →  https://t.co/GWEtt7zHPi @hoosieragtoday","date":"Mon Sep 17 18:15:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#OnThisDay in 1787 the Constitution was signed “in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defense, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity” #ConstitutionDay https://t.co/qSUvFMy4WM","date":"Mon Sep 17 17:34:40 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Members of Indiana’s Task Force 1 are headed down to help North Carolina prepare for the storm. To all in #HurricaneFlorence’s path, stay safe.","date":"Wed Sep 12 15:54:10 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“On Tuesday morning, the 17th anniversary of the Sept. 11, 2001, terrorist attacks, Cooper found himself back at the school but this time attending a breakfast prepared by the FFA chapter for local first responders.” Today in the @SeymourTribune → https://t.co/rIqlek2jLy","date":"Wed Sep 12 15:27:32 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Flags at half-staff for the 3,000 Americans who lost their lives on September 11, 17 years ago. We will #NeverForget. 🇺🇸 https://t.co/haUI8yKHxf","date":"Tue Sep 11 16:21:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We will never forget. #September11 https://t.co/8hN9SRyUBt","date":"Tue Sep 11 12:45:40 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today's job report from @USDOL reflects a strong economy, making it easier for Hoosiers to get ahead:\n\n➡️ 201,000 new jobs added in August\n➡️ 3.9% unemployment\n➡️ Highest wage growth since April 2009","date":"Fri Sep 07 19:45:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Record-setting economic news: U.S. jobless claims fell to the lowest level in 49 years. After years of struggling to get ahead, Hoosiers are seeing more and more jobs and opportunities - and businesses are able to invest even more in their workers! https://t.co/zdQFsx43p1","date":"Fri Sep 07 14:16:18 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers deserve policies that put our local economy first, ensuring businesses of all sizes can continue to expand + innovate, create + sustain jobs, + contribute to our growing Indiana economy. Honored to receive the @NRFnews Hero of Main Street Award → https://t.co/YmO3lwyJjq","date":"Thu Sep 06 15:28:19 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Meet Elmo Young: a veteran from Bloomington who selflessly served this country on the front lines of Germany during World War II → https://t.co/gilwGekG1a","date":"Tue Sep 04 20:56:45 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The number one issue I hear from every business and manufacturer across IN09 is ‘I cannot find enough skilled workers.' @shsowlmfg in Seymour is working to solve this problem → https://t.co/bHD7Krhdya #IN09","date":"Wed Aug 22 11:39:53 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week in the Salem Democrat → Seaman 1st Class Carl Huff’s family receives the medals he earned during WWII #IN09 https://t.co/uunwGewGYI","date":"Sat Aug 18 21:16:29 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Main Street's performance over the last 21 months is unprecedented, translating to:\n✅ Improved employment and investment spending\n✅ GDP growth\n✅ Economic optimism\n\nVia @NFIB https://t.co/HUC3gYmpQc","date":"Tue Aug 14 18:19:50 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@POTUS signed the #NDAA into law: “We must protect those who protect us. When our service members are in uniform, it's our obligation to ensure that they have the finest equipment, the finest training, care and resources–better than any military on earth.” https://t.co/b4f90pMEaY","date":"Mon Aug 13 19:45:10 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Eva has served our community at JayC Food Stores for 77 years, making her the company’s longest serving employee. Join me in celebrating her! → https://t.co/KOLWGFsJU2 https://t.co/8cq5xUsSlo","date":"Fri Aug 10 13:48:35 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI: Last week, Elwood, a WWII veteran who lives in Greenwood, turned 100 → https://t.co/Bp16JzDPcz","date":"Mon Jul 30 18:59:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @theheraldtimes, @CookMedical shares why the #MedicalDeviceTax is harmful to economic growth → https://t.co/0eFX6wbQRZ","date":"Mon Jul 30 15:43:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"✅ Tax Reform\n✅ Regulatory Reform\n✅ Pro-Growth Policies\n\nI'm committed to supporting policies that unleash economic growth, opportunities, and jobs for Hoosiers and all Americans → https://t.co/WrfSgMmpAx","date":"Fri Jul 27 15:11:41 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Fighting for Hoosiers who fought for us is the highlight of my service in Congress. The time I spent w/ Carl’s family, discussing how his honorable service represents the best of our country + presenting them w/ these overdue medals, was a humbling experience I will never forget. https://t.co/ABSH0zPQdy","date":"Wed Jul 25 16:15:08 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Highlighted on @WLKY → Seaman 1st Class Carl Huff's family receives the medals he earned during WWII:   https://t.co/J034IQYNsT @WLKYMark #IN09","date":"Wed Jul 25 16:13:43 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Obamacare's #MedicalDeviceTax would increase healthcare costs for Americans and kill jobs right here in Indiana. Today, the House voted to repeal it, putting you in control of your healthcare and ensuring care is affordable for all → https://t.co/NFRNZWCnHQ","date":"Tue Jul 24 22:23:23 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At @GoodwillIndy I met Brandon, one of the almost 4,000 employees who help serve our community at Goodwill. Our Hoosier community is blessed with so many neighbors dedicated to the service of others. #IN09 https://t.co/bbjNTBqf6d","date":"Tue Jul 24 13:43:33 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Carl Huff fought for this country, and my office was honored to work hard for the Huff family to retrieve the medals he earned in selfless service. https://t.co/pTYR3YIIDh","date":"Mon Jul 23 20:05:25 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I was honored to present Seaman Huff’s service medals to his family. Carl fought for this country, and his family has been waiting far too long to honor him. I know Carl’s grandson, who accepted the medals on Carl’s behalf, will treasure these for years to come. https://t.co/DQ2LmzDJka","date":"Mon Jul 23 20:04:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Seaman 1st Class Carl Huff, who served in the U.S. Navy from May 1944–January 1946 during WWII, passed away in 2007 before he could receive the medals he earned in service. His daughter, Donna (Salem, IN) contacted my office in an effort to retrieve his medals from the US Navy.","date":"Mon Jul 23 20:03:49 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Via @newsandtribune: exciting growth and job creation news at River Ridge https://t.co/zmH73FZ53Y","date":"Wed Jul 18 18:00:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"One year ago today → Baby Beckham was born prematurely in Cancun, and it took a village to get him home safely: https://t.co/eaJ1aNwZxy","date":"Wed Jul 18 17:24:11 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"By passing the JOBS and Investor Confidence Act, we’re empowering Hoosier confidence to invest in growing American firms. https://t.co/EVgl7Sa31X","date":"Wed Jul 18 00:00:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Developing and Empowering our Aspiring Leaders Act: improving access to capital for startups → https://t.co/EVgl7Sa31X","date":"Tue Jul 17 23:25:49 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Senior Security Act➡️ Introduced w/ @RepJoshG and @RepSinema to strengthen protections for senior citizens’ lifelong savings and investments.","date":"Tue Jul 17 23:25:04 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Fostering Innovation Act: Ensuring costly regulations don’t stand in the way of success for biopharmaceutical companies on the cutting edge of scientific and medical research. Learn more → https://t.co/ncb7azgt5G","date":"Tue Jul 17 23:21:07 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Three bills that I introduced were passed in the JOBS + Investor Confidence Act, including:\n\n✅ Fostering Innovation Act\n✅ Senior Security Act\n✅ Developing + Empowering Our Aspiring Leaders Act","date":"Tue Jul 17 23:15:19 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the House → the JOBS and Investor Confidence Act, a bipartisan package of legislation aimed at helping America's small businesses and entrepreneurs + protecting senior citizen investors. Learn more: https://t.co/EVgl7Sa31X","date":"Tue Jul 17 23:12:28 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"More economic good news → @LehighHanson just announced it's investing $600 million into the Lehigh Cement Co. plant in Mitchell, adding more than 50 jobs in the next four years: https://t.co/Dv58blU76w\n\nI visited Lehigh Cement last year and look forward to seeing its growth! https://t.co/sutK7VbGU7","date":"Fri Jul 13 13:46:23 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday was an exciting day in Brown County → the Maple Leaf Performing Arts Center is officially underway and set to open this time next year! Click here to learn more about the 2,000 seat venue coming to Brown County: https://t.co/O3ytmtDNjl https://t.co/o25uH57Jpt","date":"Wed Jul 11 16:38:07 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning in the @SeymourTribune → members of the Jackson County Board of Realtors stopped by my office on their trip to Washington: https://t.co/va91oFbwWr Thanks for coming by! #IN09","date":"Wed Jul 11 14:54:47 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Downtown Martinsville is going through an exciting transformation and I was excited to check out Fables and Fairy Tales, Holy Smoke Hog Roast, 21 North, and J2 Dance Studio at Courthouse Square today + last Tuesday. I look forward to continue watching Martinsville grow! #IN09 https://t.co/rPFfwDbmEG","date":"Tue Jul 10 19:08:40 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you @lifespringinc in Washington County for your constant service to the mental and behavioral health needs of our community. This week, I was honored to join the grand-opening of LifeSpring’s new primary care center in Salem → https://t.co/gEnqIxU0DD https://t.co/XPo9MgJamf","date":"Fri Jul 06 15:25:41 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.” Wishing all Hoosiers a happy and safe 4th of July! #FourthOfJuly https://t.co/RBaeVeJZIB","date":"Wed Jul 04 13:00:02 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Among the competitors at last week's National Leadership and Skills Conference were 5 @ProsserCareers students! → https://t.co/dXZWThDC08 @newsandtribune https://t.co/iig0d95YBR","date":"Mon Jul 02 15:47:12 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My casework team is here to help you: Click here to learn more about how we helped Terry from Bedford with his taxes and how my office can help you or someone you know work with federal agencies → https://t.co/npyBImrl8J https://t.co/8xig043sgd","date":"Mon Jul 02 14:54:07 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations Olivia (New Albany) on winning the 2018 Congressional Art Competition. Her artwork of Romeo Langford will hang in the US Capitol for a year reflecting our Hoosier pride! 🏀 https://t.co/FoZX9L0kj5","date":"Wed Jun 27 22:01:38 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At today’s Honor Flight, a message to our Hoosier veterans: thank you for putting service above self and fighting for our country🇺🇸 https://t.co/rxz6Ochs5g","date":"Wed Jun 27 17:00:52 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you, @ProsserCareers, for providing our communities with Career and Technical programs that help Hoosiers develop the skills needed for high-wage jobs in fields like agriculture, manufacturing, public safety, business, and information technology. #IN09 https://t.co/OIQ1HyNvaS","date":"Fri Feb 02 20:10:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to fight for Hoosiers in effort to #BringBeckhamHome. Hoosiers are fighters &amp; Baby Beckham is no exception. https://t.co/IulTb8ENLE","date":"Fri Jul 21 14:59:59 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Fighting for a better economy and brighter futures for all Hoosiers is my top priority as your representative. The good news: Americans are continuing to feel more optimistic about our country’s economy → https://t.co/E4BwT7jDi8","date":"Tue Jun 26 16:16:40 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers - From ensuring families stay together at the border to providing certainty for Hoosier farmers, click here for a quick update on what I've been working on this week to represent you in Washington → https://t.co/yRPyHPmpPr","date":"Fri Jun 22 21:55:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Spending our first Father’s Day with Joseph’s grandpa Pat Francis. Happy Father’s Day to all Hoosier fathers and grandfathers who always help their children believe in their dreams. #HappyFathersDay https://t.co/pqVN7PWEIL","date":"Sun Jun 17 14:01:44 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"1,526 Hoosiers died of an opioid overdose in 2016. This week I supported over 30 bills to help our communities combat the opioid epidemic + ensure families are able to overcome this crisis → https://t.co/EIX3sCZRqa https://t.co/BsCydFmmQH","date":"Fri Jun 15 17:16:19 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great story in the @SeymourTribune: giving students opportunities for practical, hands-on experience in manufacturing + business development → https://t.co/dZ9MN1zZIF","date":"Mon Jun 11 18:33:34 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The faces of heroes. Today, on the anniversary of D-Day, veterans from Indiana and Kentucky gathered at the World War II memorial in Washington, DC. I was honored to thank these brave men and women personally and hear their stories of service. #DDay https://t.co/WljbOTPBDF https://t.co/yXcA2pnDJR","date":"Wed Jun 06 17:52:11 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My top priority is ensuring Hoosiers across #IN09 can find high-skilled jobs, higher pay, and a brighter future. Yesterday at Mister “P” Express, a trucking company in Jeffersonville, we discussed another piece of legislation to help Hoosiers succeed → https://t.co/f7QYh8OdUj","date":"Tue Jun 05 20:57:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"Without a doubt, the number one problem facing the trucking industry is the driver shortage. My message to all Hoosiers is this: the driver shortage doesn’t just affect trucking companies, it affects each and every one of you as well.\" - @intrucking → https://t.co/VktHod4vku","date":"Mon Jun 04 22:11:17 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @newsandtribune → the POLICE Act, which I wrote w/Floyd County Sheriff Frank Loop, supports our law enforcement officers at all hours of the day: https://t.co/3ANIRLnHeX @Aperoll27","date":"Fri Jun 01 16:47:52 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning in the @newsandtribune → a message to our local Gold Star families: your loved ones will never be forgotten. https://t.co/Du3viQTbrO","date":"Tue May 29 13:32:13 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today as we gather w/friends + family at home, at the park, or at the parade, let's remember why we gather: to think of those who gave their lives for the freedom of this great country. \"'Thank you' will never be enough for those who have made the ultimate sacrifice. #MemorialDay https://t.co/SKCj2UhcTX","date":"Mon May 28 14:00:02 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#Indy500 https://t.co/RdShkd45Lb","date":"Sun May 27 13:46:13 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thankful for our first responders and law enforcement during this tragedy. Kelly and I are praying for the Noblesville community, the teachers, the students, and their parents. Our country must find a way, through thoughtful debate, to create a safer world for our children. https://t.co/xoU5wpnjRi","date":"Fri May 25 14:32:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act enables truck drivers across the district and across the state to deliver goods in a safe, timely manner, attract the workforce they need, and create Hoosier jobs → https://t.co/jwaeYEzT18 @WISH_TV","date":"Wed May 23 19:44:59 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night, the House passed 14 bills to ensure our country is providing our heroes with the care and treatment they deserve. During Military Appreciation Month, we must thank and support our veterans for their service → https://t.co/tTovIFtSzD #MilitaryAppreciationMonth https://t.co/AGfZSxUJmV","date":"Tue May 22 14:01:34 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Reported out of @HouseJudiciary → the POLICE Act which I wrote with Floyd County Sheriff Frank Loop to keep our law enforcement officers safe in the line of duty. Learn more here: https://t.co/VUMIsxScGr","date":"Thu May 17 21:40:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In Terre Haute, 70 police officers and sheriff’s deputies escort Dakota Pitts, son of fallen Officer Rob Pitts, to school → https://t.co/M2cCbkroRs #NationalPoliceWeek","date":"Wed May 16 19:16:41 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In 2017, 135 police officers were killed in the line of duty. That’s a father, a mother, a brother, or a sister, who won’t be coming home for dinner tonight. To those who put their lives on the line to keep our communities safe, thank you. #NationalPoliceWeek https://t.co/PQFPwVuSIS","date":"Tue May 15 18:54:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act addresses the driver shortage and increases job opportunities for Hoosiers → https://t.co/H27zmPiG9o https://t.co/e2H4yNAZbQ","date":"Tue May 15 14:51:47 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today in @CNNMoney: \"trucker shortage could mean more expensive goods\" →  https://t.co/LpHUouGXyl","date":"Tue May 15 14:50:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week is #NationalPoliceWeek – a time to thank those who keep us safe and remember those who lost their lives in the line of duty: https://t.co/vKBdL2HE1l https://t.co/fMlkSrdsij","date":"Mon May 14 20:46:54 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy Mother’s Day to my wonderful wife Kelly and to all Hoosier moms and grandmas who provide endless love and support. We appreciate you today and everyday! 💐 #mothersday2018 https://t.co/ieZV4JICTT","date":"Sun May 13 17:48:30 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations to Oliva K (New Albany High School), Evan O (Silver Creek High School) and Brittany L (Bloomington High School North) on winning first, second, and third place in the 2018 Congressional Art Competition! Thank you to everyone who participated. https://t.co/UxiQ2a2qbH","date":"Wed May 09 15:34:59 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"National Teacher Appreciation Week → to the teachers across Indiana’s Ninth District, thank you for the countless hours you spend on our students and their futures. Your work truly has a lasting impact on future generations of Hoosiers. 🍎 #NationalTeacherAppreciationWeek https://t.co/rkf4iWHJ3w","date":"Tue May 08 16:47:13 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@RollsRoyce, employer of over 4,000 Hoosiers, announces a new employee benefits package funded by tax credits from the 2017 Tax Cuts and Jobs Act https://t.co/DYGTiGr0Ga #TaxReform","date":"Fri May 04 16:53:50 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Inspiration and Motivation → During a STEM roundtable at Girls, Inc., I heard from community leaders in Franklin on inspiring young women to enter STEM fields through mentorship and partnership programs with local businesses and the women who run them. #IN09 https://t.co/1ViZ41CTN2","date":"Thu May 03 21:10:02 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our local family farms are this country’s original small businesses. Today, as part of National Small Business Week, I sat down with the Campbell family at Campbell Farm in Franklin to discuss the upcoming Farm Bill. #NationalSmallBusinessWeek #FarmBill #IN09 https://t.co/uG4nP0fguz","date":"Thu May 03 16:04:12 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to join the @IndianaChamber and members of the @gwchamber during National Small Business Week. Our small businesses truly are the heart and soul of America. #NationalSmallBusinessWeek https://t.co/J1NlHCeWk7","date":"Wed May 02 16:12:46 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Fighting the opioid epidemic starts at a local level, and it's up to us to raise awareness and cut the supply of prescription drugs that too often act as a gateway to drug abuse #DrugTakeBackDay","date":"Sat Apr 28 16:00:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #DrugTakeBackDay. Click here to find a drop-off location near you → https://t.co/ofOaColXVZ","date":"Sat Apr 28 14:00:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"From roundtables on STEM education to the Stinesville Elementary Robotics Club, this week in Bloomington → https://t.co/Yxc0jYJPa7","date":"Fri Apr 27 20:08:37 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today in @theheraldtimes → elementary and middle school students representing #IN09 in world robotics competitions. Best of luck to all participating! https://t.co/RWxbNyd8h4","date":"Fri Apr 27 15:33:43 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Saturday is #DrugTakeBackDay. From 10AM-2PM, you can properly dispose of expired, unused, and unwanted prescription drugs to support ongoing efforts to combat the opioid epidemic that is facing our communities. Find a drop-off location near you → https://t.co/54yvLVf4d6","date":"Thu Apr 26 21:56:39 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The incredibly curious and talented students at @SES_RBBCSC built and programmed these robots and have made it all the way to compete in a world robotics competition for their programming. Thanks for letting me take one for a spin! ⚙️ https://t.co/7CraLOsgk3","date":"Tue Apr 24 17:23:28 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act helps local #IN09 businesses like @MisterPExpress address the labor shortage → https://t.co/1oKPv6bE9V https://t.co/eqXdl29Eqc","date":"Mon Apr 23 20:10:28 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @newsandtribune → Hoosiers across Indiana’s Ninth District are seeing the positive impacts of tax reform: https://t.co/BhjzTnZdGc #TaxReform","date":"Mon Apr 23 13:44:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The next generation of cures to combat illnesses that plague Hoosiers depends on investment in cutting edge, scientific and medical research and development. Honored to receive the 'Innovator of Biotechnology' award → https://t.co/rdgOrck5jd @IAmBiotech @IHIF1","date":"Wed Apr 18 19:16:37 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act:\n\n✅Addresses the trucking industry's driver shortage\n✅Opens up more job opportunities for Hoosiers\n✅Enhances safety and skills training\n\nRead more: https://t.co/pVfJZYKStn https://t.co/Gbgnv88siE","date":"Wed Apr 18 14:07:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#TaxReform stories from #IN09 → Hoosier families and businesses across Indiana’s Ninth Congressional District have already felt the positive impacts from tax reform. In New Albany, Will can invest in his small business: https://t.co/GYSRyKSfIb","date":"Tue Apr 17 20:00:55 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#TaxReform stories from #IN09 → Hoosier families and businesses across Indiana’s Ninth Congressional District have already felt the positive impacts from tax reform. In Bloomington, Joe can grow his business and create new jobs in his community: https://t.co/csYb1fxPGl","date":"Tue Apr 17 19:22:05 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#TaxReform stories from #IN09 → Hoosier families and businesses across Indiana’s Ninth Congressional District have already felt the positive impacts from tax reform. In Ellettsville, Joe has extra money in his pockets for everyday expenses like groceries: https://t.co/tYiyaJ8vJV","date":"Tue Apr 17 18:15:25 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#TaxReform stories from #IN09 → Hoosier families and businesses across Indiana’s Ninth Congressional District have already felt the positive impacts from tax reform. In Greenwood, Bridget is excited for the future: https://t.co/m6VlVVn946","date":"Tue Apr 17 17:06:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Kicked off #TaxDay on @WGCLradio talking about the benefits Hoosier families and businesses have seen from tax reform → https://t.co/9HHNw7hvlk https://t.co/zQdBFk7e05","date":"Tue Apr 17 16:42:34 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Submissions for the 2018 Congressional Art Competition are in, and we need your help picking this year’s winner! → https://t.co/wB62YdvaxP","date":"Mon Apr 16 17:58:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers – I just walked off the House floor after voting in support of a Balanced Budget Amendment to the U.S. Constitution. We need a balanced budget now and a Constitutional amendment to ensure it stays that way. https://t.co/1f7pOhM2pt https://t.co/7izX0NMn6h","date":"Thu Apr 12 21:36:02 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Attention all high school artists: if you’re interested in participating in the 2018 Congressional Art Competition, submissions are due tomorrow at 5PM! Click here to learn how to participate → https://t.co/G5e0CVrLaK","date":"Tue Apr 10 17:34:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Visit to @StRoseLions in the @DailyJournalNet: “I thought it was exciting, because we got to share what we thought about the issue to our representative, and he could spread that around” → https://t.co/g4EytZDIwY https://t.co/5odQjKDWCB","date":"Mon Apr 09 16:38:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At @YOUR_WCHS students are participating in the Capitol Hill Stock Market Challenge and learning about saving and investing; skills they will use for the rest of their lives https://t.co/neuCOKu1X8 @SIFMAFoundation https://t.co/mGafp02zdl","date":"Thu Apr 05 18:58:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Kicked off the day in Johnson County with thoughtful questions and discussion at St. Rose Middle School #IN09 → https://t.co/qx2GBmmuIx","date":"Wed Apr 04 17:34:30 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Check out today's @SalemLeader to learn more about my roundtable last week with Washington county women in business. Read more about it here → https://t.co/NpF2Lvebfw https://t.co/1PgC9YDxyA","date":"Wed Apr 04 14:31:49 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The DRIVE-Safe Act addresses the driver shortage and increases job opportunities for Hoosiers → https://t.co/H27zmPAhxY https://t.co/nlWQm8DonL","date":"Tue Apr 03 19:32:29 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today in the @WSJ: Trucking companies are struggling to attract drivers. “I get a lot of guys out of high school. They come down for an interview, I say come back and talk when you’re 21,” said Mr. Timmer. “I rarely see them again.” https://t.co/Q1aF7IZpqC","date":"Tue Apr 03 19:31:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers – stay safe on your drive home today. https://t.co/CzPCsztZQc","date":"Tue Apr 03 19:12:47 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Have a happy and blessed Easter - from our family to yours! https://t.co/rUy3LLCgFb","date":"Sun Apr 01 18:59:27 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Throughout March, over 250 Hoosiers visited the office for a Capitol tour with their family or school Spring Break trip. It was great see so many familiar faces in DC! https://t.co/sqR2fZk32N","date":"Fri Mar 30 20:29:51 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Celebrating #WomensHistoryMonth: Meet Mary Elftman, a veteran of the Indiana Army National Guard who now commits her time to helping fellow veterans. Learn more about her story here → https://t.co/xoRIs93ObJ https://t.co/1EGUoweBjJ","date":"Thu Mar 29 15:36:52 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"At the Salem Senior Center, I spoke to the senior residents about their concerns regarding Social Security + Medicare and what Congress can do to keep America’s promises to retired Hoosiers. After our discussion, I joined their Bingo game! Learn more → https://t.co/N1UJGPbaQt https://t.co/mN6OE6I5Sq","date":"Wed Mar 28 19:26:42 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"America needs to keep its promise to our seniors who for years have paid into these programs and worked tirelessly for their families and this country. I was honored to receive the ‘Guardian of Seniors’ Rights’ Award → https://t.co/c4TQ4MNb5h https://t.co/aaRsXR5BFP","date":"Tue Mar 27 20:24:52 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today in Salem, I sat down with local women in business, managers, job creators, and employees to hear their concerns and ideas about how Congress can better serve our local small businesses → https://t.co/6Orn5XsElc https://t.co/Iz8lGC4G8H","date":"Mon Mar 26 19:56:05 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to attend @CookMedical's groundbreaking for their new facility - adding more jobs and opportunity in Bloomington. Congratulations! https://t.co/s5TaxOgZR7","date":"Fri Mar 23 17:18:58 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Celebrating #WomensHistoryMonth: Meet Dr. Laura Hammack, Superintendent of Brown County Schools and committed Hoosier educator → https://t.co/sSWSHPQxeS https://t.co/y3elpUyOzm","date":"Thu Mar 22 15:05:08 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Introduced today: the DRIVE-Safe Act, which opens up more opportunities for all Hoosiers to achieve successful futures and for our local businesses to continue to thrive with a safer and better-trained workforce → https://t.co/YdarXTx7NJ https://t.co/EZyZ5KPfOI","date":"Wed Mar 21 21:15:10 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today on National Agriculture Day, I want to thank Hoosier farmers for their endless contributions to our local economy, the food they put on our tables, and their commitment to our communities → https://t.co/iFrWfNYVuT #AgDay #NationalAgricultureDay #IN09","date":"Tue Mar 20 17:56:10 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy #NationalAgDay to Hoosier farmers! #AgDay #IN09 https://t.co/1HDnGIK21Q","date":"Tue Mar 20 17:30:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Celebrating #WomensHistoryMonth: Meet Deidra, a farmer, nurse, and dedicated Hoosier in Washington County → https://t.co/NqCHDTfY5g https://t.co/YavKULO2yX","date":"Fri Mar 16 14:58:20 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Exciting news for Jackson County as our country turns its focus to updating and investing in rural broadband → https://t.co/Fv64Szofug @SeymourTribune #IN09","date":"Thu Mar 15 17:34:59 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the @DailyJournalNet: For decades, this country has pioneered biotechnology innovation, successfully pushing the limits of finding cures for some of the deadliest diseases. My thoughts to ensure it stays that way →  https://t.co/ncb7azgt5G","date":"Mon Mar 12 20:54:14 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Don’t forget: The 2018 Congressional Art Competition has begun! More details here → https://t.co/h0969uBmNT","date":"Mon Mar 12 18:22:32 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“Behind the badge was a warrior, and he put down his life for you, each one of you.” https://t.co/MRH2pbs9b7","date":"Fri Mar 09 18:52:42 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you @RedCross for working tirelessly to keep Hoosiers safe #IN09 https://t.co/ATAPVaBSiZ","date":"Fri Mar 09 18:33:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Celebrating #WomensHistoryMonth: Meet Lauren and Emily, high school students in Bloomington, students at Hoosier Hills Career Center, and future healthcare professionals → https://t.co/QumDZEz7pI #IN09 #InternationalWomansDay https://t.co/kfbH4cw7fK","date":"Thu Mar 08 19:05:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Comprehensive Regulatory Review Act removes expensive regulatory burdens put in place by Washington bureaucrats, so our community banks can offer these services to Hoosiers for years to come. (2/2)","date":"Wed Mar 07 18:35:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night the House passed the Comprehensive Regulatory Review Act. Our community banks in Indiana play a huge role in all of our daily lives: they offer mortgages, facilitate agricultural lending, give a helping hand to our local small businesses, + help create new jobs. (1/2)","date":"Wed Mar 07 18:35:10 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great to see @IUBloomington students in DC for this year's @AIPAC policy conference! #AIPAC2018 @Hoosier_IIPAC https://t.co/75sNPfSctL","date":"Tue Mar 06 23:15:16 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Future Hoosier Farmers in the House! Wyatt (Bloomington) is in D.C. today representing our next generation of farmers. #FFA #IN09 @IndianaFFA https://t.co/RvznwNU7se","date":"Tue Mar 06 19:15:01 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Deputy Jacob Pickett dedicated his life to the protection of others and making Indiana a safer place. My thoughts are with his family as well as his fellow officers, who put their lives on the line everyday to protect Hoosiers.  https://t.co/hG3ixpn9OB","date":"Sat Mar 03 16:42:51 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you, Landon, for being an engaged member of our community! https://t.co/OSwlAqH092","date":"Thu Mar 01 19:16:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Made in Indiana. To us, those three words are important. They invoke pride because they put our little slice of home on the map for others to see. Take a look at these Hoosier manufacturers → https://t.co/C9CPUAC9om https://t.co/StoxVa8o5Q","date":"Wed Feb 21 14:45:26 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"As a new father, I can't imagine the Parkland community's heartbreak. No matter who you are, we all want the same thing: a safer world for our children. I hope through thoughtful debate we can arrive at policy solutions that increase the safety and freedom of all Americans.","date":"Thu Feb 15 21:31:22 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the House → The Fostering Innovation Act, which I introduced with @RepSinema to cut red tape and help Hoosier companies making life-saving breakthroughs: https://t.co/67IyCjktot","date":"Wed Feb 14 22:13:39 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"AB Biotechnologies (Bloomington, IN): \"Ultimately these savings will be passed on to patients which benefits the community as a whole.\" #IN09 https://t.co/IvGsg2kPs0","date":"Wed Feb 14 20:43:50 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Indiana Health Industry Forum stands in strong support of the Fostering Innovation Act: “As more Indiana bioscience companies mature and look to IPOs as a viable fundraising option, we expect the benefits of the Act to accrue quickly.” @IHIF1 https://t.co/02mVlr6ynt","date":"Wed Feb 14 20:03:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Fostering Innovation Act will right-size the regulatory environment that detracts from medical advancements, enabling America to develop the next generation of cures to combat illnesses that plague Hoosiers. #IN09","date":"Wed Feb 14 19:06:49 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, the House is voting on the Fostering Innovation Act, which I introduced with @RepSinema to ensure that costly regulations don’t stand in the way of successful biopharmaceutical research.","date":"Wed Feb 14 18:24:51 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Mitch – thanks for sharing your story with me. The work you’re doing to represent Special Olympic athletes everywhere is inspirational! #SOHillDay https://t.co/g3aDiDZRlw","date":"Tue Feb 13 18:58:43 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This morning's read in the @newsandtribune's Stories of Southern Indiana: A Floyd County small business in space. → https://t.co/HLesyTR1Hi\n\nSporting my International Space Station Pin from @TechshotInc in their honor! https://t.co/q7aoSLHq6k","date":"Tue Feb 13 15:47:17 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers in DC → Members of the Indiana Drug Enforcement Association + @IndStatePolice stopped by my office today to discuss the different ways Hoosiers are fighting for the families, neighborhoods, and communities across our state who are hurt every day by the opioid epidemic. https://t.co/oaXfSg4yuR","date":"Tue Feb 06 21:37:43 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"More local education opportunities @PurdueNewAlbany, where full Purdue degrees and bright futures are offered right here in #IN09. https://t.co/z584eRd3Yp","date":"Fri Feb 02 20:25:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you, @ProsserCareers, for providing our communities with Career and Technical programs that help Hoosiers develop the skills needed for high-wage jobs in fields like agriculture, manufacturing, public safety, business, and information technology. #IN09 https://t.co/OIQ1HyNvaS","date":"Fri Feb 02 20:10:31 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thank you for having me! #IN09 https://t.co/77haal2fbt","date":"Fri Feb 02 19:46:22 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On @WGCLradio, I highlighted what I’m fighting for on behalf of Hoosiers. Listen in → https://t.co/9sviLlQhrX","date":"Wed Jan 31 21:59:12 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@joemcg_68 is in Washington and we’re in matching ties for #SOTU @INDOT https://t.co/OYeu22dj0S","date":"Tue Jan 30 22:54:13 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Looking forward to @joemcg_68’s arrival for tomorrow’s State of the Union! #SOTU #IN09 @INDOT https://t.co/8lQBvwY3ul","date":"Mon Jan 29 23:49:42 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, the House is voting on the Housing Opportunity Made Easier Act (H.R. 2255) to ensure that Habitat for Humanity and similar organizations can continue to receive donated appraisals on the homes they build – making it easier to help Hoosiers who need a home. https://t.co/KvKfFYegzc","date":"Mon Jan 29 16:31:39 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Welcome home Pratt Family! What a joy to be there as Clark and Floyd County Habitat for Humanity cut the ribbon on their first house of the year. https://t.co/UWRlDbI2Ca #IN09 https://t.co/O5Vf2zcLjC","date":"Mon Jan 29 16:30:22 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Harrison County Prosecutor Otto Schalk was in Washington, D.C. to testify on the opioid epidemic → https://t.co/BDRY4PRNqZ #IN09","date":"Mon Jan 29 16:06:45 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Excited for the continued positive changes that tax reform has made for Hoosiers #FedEx @RepJimBanks\n@RepLarryBucshon @RepWalorski @SusanWBrooks @RepLukeMesser @ToddRokita https://t.co/8luC1gMCrL https://t.co/XYzOEM5yHV","date":"Fri Jan 26 21:32:21 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosier parents know best. This is #nationalschoolchoiceweek, and at yesterday’s roundtable, I sat down w/Hoosier homeschool families to discuss why #schoolchoice is essential for finding the right learning environment. Every kid deserves to thrive &amp; work toward a bright future. https://t.co/4snJ1T2kFP","date":"Thu Jan 25 17:07:05 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"35 out of 50 State Capitol buildings were built with Indiana Limestone. So were the National Cathedral, the Pentagon, &amp; the Empire State Building, just to name a few. 3D Stone Inc in Bloomington is one of the many companies that carries on one of Indiana’s best traditions. #IN09 https://t.co/SfUZQ6gXwH","date":"Thu Jan 25 14:06:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Started off the day in Bloomington with great coffee and conversation with Hoosier farmers. Their thoughts and ideas are essential to me as I fight to ensure that Indiana’s agriculture community is well represented in Washington. #IN09 https://t.co/vhLCHVpXnw","date":"Wed Jan 24 15:57:20 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I just read the @HouseIntelComm memo; this report needs to be released. Americans deserve truth and transparency, two key pillars of our country’s democracy. #ReleaseTheMemo","date":"Fri Jan 19 22:19:47 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Ensuring that our Hoosier manufacturers continue to thrive and contribute to the growth of our neighborhoods, communities, and state is a top priority of mine in Congress →\nhttps://t.co/rH7At6zSXq https://t.co/09VjoSfs6G","date":"Thu Jan 18 17:14:27 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Passed the House → the Expanding Investment Opportunities Act, which I introduced to cut costs and promote job creation, as well as allow for more investment options for small businesses, companies, and Hoosiers saving for retirement. Learn more here: https://t.co/UQcHUdLybC https://t.co/k2a5AZvttY","date":"Wed Jan 17 22:52:26 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Excel Manufacturing, a manufacturing plant in Seymour, makes a wide range of car parts from cast iron, aluminum, steel, and bronze. This great Hoosier business celebrated 50 years in 2017. I toured Excel to see first-hand its contribution to our Seymour economy and beyond. #IN09 https://t.co/o4R5PMogaq","date":"Wed Jan 17 18:51:35 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Otto Schalk, Harrison County Prosecutor, was in DC today to testify in front of the Senate on the effects the opioid epidemic is having on southern Indiana. We are lucky to have such a hard-working Hoosier speaking on our behalf on this challenge facing our communities. https://t.co/snIGLMDzWS","date":"Tue Jan 16 23:53:38 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Had an incredible meeting today w/ Dr. Art Boerner, who works w/ drug-addicted mothers-to-be and babies, helping them build better futures. As drug addiction continues to touch lives in all our communities, Dr. Boerner's dedication to helping Hoosiers is inspiring. #IN09 https://t.co/cYOC5KE5IV","date":"Mon Jan 15 18:24:07 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"“The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of challenge and controversy.” Today we honor Martin Luther King Jr. and his life-changing legacy. #MartinLutherKingJrDay https://t.co/Vk8lNP9UP3","date":"Mon Jan 15 14:37:06 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Every day, our police officers like John are always there to keep our communities safe. To all Hoosier law enforcement officers, on Law Enforcement Appreciation Day and every day, thank you for your service. #LawEnforcementAppreciationDay","date":"Tue Jan 09 19:05:43 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was great having Clarksville Police officer John Miller in the office today for a tour of the Capitol. Thank you, John, for putting your life on the line every day to serve Indiana. #LawEnforcementAppreciationDay https://t.co/eUJbyEmavV","date":"Tue Jan 09 19:04:58 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Proud to welcome @usairforce General Goldfein to @NAVSEACrane w/ @SenToddYoung and @SenDonnelly.  As rogue nations like North Korea and Iran continue to threaten American lives, I was proud to support hard-working Hoosiers who are working tirelessly to protect Americans. https://t.co/4pOfejQ9Ja","date":"Mon Jan 08 20:56:52 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"2017 Constituent Services in Review: Below is a quick round-up of the services Hoosiers used their congressional office for last year – from sharing thoughts on legislation to getting help with a federal agency. Learn more about how we can help! → https://t.co/6UeGoqEaHO https://t.co/GUJRuQUOVL","date":"Thu Jan 04 18:43:17 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"If you or your family are planning a trip to Washington, DC this year, be sure to check out my website to schedule a tour of the U.S. Capitol. I want to ensure you have a visit to remember! → https://t.co/iMaYNpgo2q","date":"Wed Jan 03 18:01:56 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy New Year! Wishing you a happy and blessed 2018. https://t.co/7SLddzaVIY","date":"Mon Jan 01 15:00:00 +0000 2018","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Merry Christmas from our family to yours! https://t.co/Phz4hHFENe","date":"Mon Dec 25 13:33:18 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A major issue throughout 2017 has been whether or not we should build a southern border wall. I want to know where you stand on this important issue. Can you please click here to take a quick survey and share your opinion with me? https://t.co/MRczxakfwe","date":"Mon Dec 04 22:08:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I am thankful for the opportunity to serve my fellow Hoosiers as their Representative to Congress. I hope all of you enjoy this day of thanks. Happy Thanksgiving. https://t.co/qyhotMirQR","date":"Thu Nov 23 17:33:11 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I stood for Hoosiers. I stood to ensure that they receive more of their hard-earned paychecks; I stood to ensure that a convoluted and archaic tax code was simplified; I stood to ensure that special interests deductions and loopholes were removed. https://t.co/XTMDH1D81X","date":"Thu Nov 16 19:31:25 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Before today's vote on #TaxReform, I have been answering the phones in Washington with staff to hear what Hoosiers have to say. https://t.co/LtURjRxDgu","date":"Thu Nov 16 18:25:46 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week, we won a victory for Hoosiers against the Washington establishment. By passing the Presidential Allowance Modernization Act, we took much-needed steps toward cutting wasteful spending &amp; fighting to ensure that career politicians don’t receive a taxpayer check for life. https://t.co/uEzB5QgxlL","date":"Thu Nov 16 17:03:45 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night, the House finalized passage of the National Defense Authorization Act. This legislation finally authorizes our war fighters to be resourced properly and receive a much-earned and long-overdue raise. https://t.co/GRNGr62JBM","date":"Wed Nov 15 14:40:56 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, we pause to thank &amp; honor our veterans. These sentinels of freedom personify the words Alexander Hamilton once said, \"There is a certain enthusiasm in liberty, that makes human nature rise above itself, in acts of bravery and heroism.\" https://t.co/xMCT0JSaN4","date":"Sat Nov 11 18:42:41 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I am proud to honor the U.S. Marine Corps and all Marines throughout #IN09. For 242 years they have played a major role in defending our great Nation. Happy Birthday, Marines! https://t.co/R7frkzIWGO","date":"Fri Nov 10 14:39:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"3/ They will be able to assist you with VA and Social Security Benefits issues that you may be having.","date":"Fri Nov 03 13:23:37 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"2/ The event is from 10a - 2p and is located at the CASI building on 8th Street.","date":"Fri Nov 03 13:23:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"1/ Attn Veterans in Clark County: your Congressional office casework team will be at the Veterans' Stand Down event in Jeffersonville today.","date":"Fri Nov 03 13:22:22 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I introduced the Banning Lobbying And Safeguarding Trust (BLAST) Act. This is currently the most stringent legislation of its kind. https://t.co/J3ZUMtlqcV","date":"Tue Oct 31 23:27:11 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today's #TBT takes us to last Thursday when Indiana &amp; @IndStatePolice welcomed 33 new troopers into service for Hoosiers. Congratulations! https://t.co/WMEqISWs8D","date":"Thu Oct 26 20:29:38 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The House passed new sanctions on North Korea. You can either do business with the USA or North Korea but not both. https://t.co/xAHaqxNMj1","date":"Tue Oct 24 22:27:24 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"North Korea's pursuit for nuclear weapons threatens American interests. Proud to be an original co-sponsor of this bipartisan legislation. https://t.co/9w1hucHRbn","date":"Tue Oct 24 13:45:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations to my hometown, @CityofJeff, on being selected to decorate the @WhiteHouse's Indiana tree this year! https://t.co/Hn6BlAvsdy","date":"Mon Oct 23 15:33:53 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We owe it to police officers to provide all the tools &amp; resources needed to cope with the experiences they run into on our behalf. https://t.co/maXjrrZZOV","date":"Fri Oct 20 17:01:25 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Founders didn't envision a bureaucracy that makes decisions in spite of the People. We must push back the regulatory-state that is D.C. https://t.co/dZI4ntNuIK","date":"Thu Oct 19 21:47:10 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The Stand Down is an opportunity for veterans to seek help with housing eligibility, VA and Social Security benefits, and other services.","date":"Mon Oct 16 18:45:55 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Members of my staff will be present at Harrison County's Annual Stand Down tomorrow at Lincoln Hills Christian Church from 10a to 2p.","date":"Mon Oct 16 18:45:33 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to recognize heroes from successful cave rescue last month: Lawrence Co. Sheriff's Dept, @INdnrnews &amp; Bloomington Cave Rescue Team. https://t.co/1RlV3iOxlP","date":"Tue Oct 10 01:44:46 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Too many times, D.C. has failed to decide how taxes are spent. If Congress doesn't do their job, they don't get deserve to get paid. https://t.co/qIOVuR3LQA","date":"Thu Oct 05 16:47:37 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"One month ago, the House passed my bipartisan legislation nearly unanimously. Here's the @newsandtribune's coverage: https://t.co/D0M6VNMiSi","date":"Wed Oct 04 17:20:48 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The American people know that Congress no longer reflects the ideals and values of our communities. The time for term limits is now: https://t.co/xDr9iDYVEz","date":"Mon Oct 02 20:29:52 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In the midst of the senseless act of malice in Las Vegas, Hoosiers across #IN09 are praying that those affected find comfort. https://t.co/oXUGIv2HLm","date":"Mon Oct 02 16:39:07 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Insulting the sacrifices made by thousands of Hoosiers is not consistent with our values. #StandForTheFlag | https://t.co/VqIA4uE9N4","date":"Tue Sep 26 21:19:14 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The international community has no reason to question American resolve. We'll hold dangerous regimes accountable. https://t.co/aQdxYC09IE","date":"Tue Sep 19 22:32:18 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Great example of the American Dream being alive &amp; well. We should encourage this level of passion &amp; persistence. https://t.co/uVFE7hkDFj","date":"Fri Sep 15 17:48:19 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week, I put together care packages w/ @the_USO for members of the Armed Forces assisting in hurricane relief. https://t.co/NC53nJgdmC","date":"Fri Sep 15 13:40:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Those who lost their lives honor us and we should do everything within our power to honor them. #NeverForget https://t.co/l7ZPwi5tlx https://t.co/9ow6RYKQXN","date":"Mon Sep 11 16:10:16 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Linking bad legislative tricks to disaster recovery is not only bad government, it is immoral and the American people deserve better. 4/4","date":"Fri Sep 08 21:58:36 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The CR &amp; Debt Ceiling package created by the U.S. Senate ignores expectation that our gov plans for the future like we do here at home. 3/4","date":"Fri Sep 08 21:58:21 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On Wednesday, I voted for a clean disaster aid package b/c I do believe that we should help our neighbors when they need it most. 1/4","date":"Fri Sep 08 21:57:43 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Reminder for all middle school and high school students in #IN09! https://t.co/ewLiQKiU1U","date":"Fri Sep 08 17:36:31 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"9:30 pm &amp; the work day isn't over for your Congressional office. Waiting for late votes, I'm writing to constituents who sent emails today. https://t.co/2EZl9TMnn6","date":"Thu Sep 07 01:30:08 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers know what it means to lend a helping hand &amp; to genuinely be concerned for neighbors. We stand ready to help our fellow Americans. https://t.co/IrJLdULvBs","date":"Wed Sep 06 21:32:15 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Hoosiers want bipartisan solutions from D.C. I am glad that @RepSinema &amp; I were able to help provide #SmallBiz more opportunities to grow. https://t.co/hDeDzjeKzE","date":"Wed Sep 06 20:02:15 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last night, I joined the town of Brooklyn at the dedication of a new water fountain. I enjoyed getting to meet the participating students. https://t.co/IR8hsTLjEL","date":"Fri Sep 01 16:06:40 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today in Bloomington, I spent a few minutes w/ the brave men &amp; women ensuring everyone's safety at #MemorialStadium tonight for #IUvsOSU. https://t.co/xhxa0GF4jt","date":"Thu Aug 31 20:55:38 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I had the honor of recognizing and spending time with Sgt. White &amp; Ofc. Sage of the @SeymourPolice for their recent life-saving actions. https://t.co/DFLUuz2Ms7","date":"Wed Aug 30 15:18:43 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to visit @NAVSEACrane again last week. This Center is of vital importance to national security. https://t.co/qWoCTmnvVD","date":"Tue Aug 29 13:45:19 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Pleased @POTUS ended rule denying local police access to surplus lifesaving equipment. Local police now have access to much needed tools.","date":"Tue Aug 29 02:00:39 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The House is addressing dysfunction in DC by demanding VA accountability, ending harmful regulations, &amp; limiting power of bureaucrats. https://t.co/2EZqzeveqN","date":"Mon Aug 28 23:00:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The House is providing peace of mind for Americans by funding the fight against opioids &amp; passing sweeping reforms to end human trafficking. https://t.co/OiIISW5ttV","date":"Mon Aug 28 20:00:03 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The House is prioritizing national security by investing in proper resources &amp; providing service members w/ their largest raise in 8 years. https://t.co/IvXD9h9q8V","date":"Mon Aug 28 17:00:03 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The House of Representatives is working to spur economic growth by repealing Dodd-Frank &amp; investing in Main Street rather than Wall Street. https://t.co/bYKKbtQbpS","date":"Mon Aug 28 14:00:02 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I applaud Democrat Lee Hamilton for sharing a way to have more Hoosier voices heard in Washington. I agree 100%. https://t.co/Ws1kdHzfET","date":"Fri Aug 25 21:03:07 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Middle &amp; High school students in #IN09: Want to learn more about the United States #ServiceAcademies? Attend this event! https://t.co/l3SRe6flHo","date":"Tue Aug 22 21:42:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Please join me in keeping the City of Salem's Police Chief in our thoughts and prayers as he recovers from emergency surgery.","date":"Tue Aug 22 18:04:09 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Bureaucrats, not you, decided to close businesses they disapproved of. Your representatives put an end to it. https://t.co/gNYHNTyJya","date":"Mon Aug 21 21:28:19 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday, I had a roundtable discussion with local &amp; state firefighters about the Firefighter Cancer Registry Act. https://t.co/pA6iDlU3TQ","date":"Thu Aug 17 14:17:24 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Received a Congressional Action Survey? Please mail it back by 8/28 in the provided envelope! No survey? No worries, we will do another one! https://t.co/YLqpX7TW1w","date":"Wed Aug 16 14:48:33 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Take a few minutes to sign up for email updates from your congressional office! https://t.co/5azGlaXwkH","date":"Tue Aug 15 15:00:56 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Americans lost the ability to make health care decisions thanks to #Obamacare. The time to take back control is now! https://t.co/pXTe4Ton8l","date":"Tue Aug 15 00:10:39 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The bigotry demonstrated in #Charlottesville does not represent our great nation &amp; must be condemned. Prayers to those injured or killed.","date":"Sun Aug 13 02:14:08 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It has been a great week at home, in #IN09! Lots of great meetings w/ constituents in across the District including Monroe Co. and Clark Co. https://t.co/2iWTlSqTOy","date":"Fri Aug 04 21:15:52 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to present Mr. Jim Farr w/ medals that he never received during his faithful &amp; honorable service to our nation during WWII. https://t.co/HxqWRHBxp4","date":"Wed Aug 02 14:52:23 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Earlier this week, the @FinancialCmte unanimously passed bipartisan legislation that I wrote with @RepSinema.  https://t.co/yveXJf1JL3","date":"Thu Jul 27 12:51:41 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"House Democrats played partisan politics w/ National Security. Obstruction doesn't reflect Hoosier priorities. https://t.co/yWhujFSeHM","date":"Wed Jul 26 15:32:30 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We continue to cut a bloated federal government! Congress &amp; @POTUS cut 16 existing regulations for every new one! https://t.co/QCtSQX02OO","date":"Tue Jul 25 23:18:20 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Low unemployment in IN but many Hoosiers feel the American Dream is out of reach. I know we need better-paying jobs! https://t.co/ahvVNV5Cs6","date":"Mon Jul 24 18:57:12 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to fight for Hoosiers in effort to #BringBeckhamHome. Hoosiers are fighters &amp; Baby Beckham is no exception. https://t.co/IulTb8ENLE","date":"Fri Jul 21 14:59:59 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last evening, I spent several hours making random phone calls to constituents across #IN09. These calls allow me to hear your concerns. https://t.co/CIoP0yYaAy","date":"Wed Jul 19 13:34:18 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I proudly voted for #NDAA b/c it prioritizes proper resourcing of our warfighters &amp; an increase in pay that our military need and deserve. https://t.co/qIPL9T3zy2","date":"Sun Jul 16 15:33:37 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Quick #TBT to last week's District Work Week. I enjoyed having productive conversations all across #IN09! https://t.co/AYG17ujVz4","date":"Thu Jul 13 21:47:18 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Franklin Police - 317-736-3670 https://t.co/SgMRQ3YCnx","date":"Wed Jul 12 01:41:08 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Attention Johnson County Residents: an emergency shelter has been established. Contact Franklin Police for more info - 31-736-3670 https://t.co/eUiHKaqq9f","date":"Tue Jul 11 21:33:09 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Attention Johnson County Residents: an emergency shelter has been established. Contact Franklin Police for more info - 31-736-3670 https://t.co/eUiHKaqq9f","date":"Tue Jul 11 21:33:09 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last year, Planned Parenthood was busy conducting 73% of abortions here in Indiana. Planned Parenthood did 1.3% more abortions than '15. 1/2 https://t.co/IoQBkej4OO","date":"Tue Jul 11 01:17:05 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"In Bloomington, abortions went up nearly 24%! Life is sacred, precious, &amp; valuable. I remain 100% dedicated to fighting for the unborn! 2/2 https://t.co/vYmrVGrDj2","date":"Tue Jul 11 01:11:37 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"...And for the support of this Declaration...we mutually pledge to each other our Lives, our Fortunes, and our sacred Honor.\" #HappyFourth https://t.co/7DswT1B6Qx","date":"Tue Jul 04 12:44:58 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to welcome #IN09 Congressional Art Competition winner, Jenna Townsend, to Washington for the unveiling of her art in the Capitol! https://t.co/s08TNFx2bN","date":"Thu Jun 29 18:43:34 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My statement regarding @POTUS' decision to repeal the Environmental Protection Agency's Waters of the United States rule. https://t.co/5yJyLEPf7R","date":"Tue Jun 27 23:10:37 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Perfect example of government waste. I pledge to work w/ @POTUS to continue slashing the bloated federal government: https://t.co/q8xN3pqSFr","date":"Tue Jun 20 18:27:56 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My thoughts &amp; prayers are with Majority Whip @SteveScalise, the @CapitolPolice, &amp; staff who were affected by the horrific shooting today.","date":"Wed Jun 14 13:43:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI, @idsnews wrote an article about some recent legislation I introduced: https://t.co/EXDMOanWXv | #POLICEact","date":"Mon Jun 12 14:51:14 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The #ChoiceAct passed today. It returns power to consumers, brings overzealous regulations into check, &amp; ends the era of \"too big to fail.\" https://t.co/VTKGinfnEQ","date":"Thu Jun 08 22:45:48 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Quick #TBT to when Congress used the Congressional Review Act earlier this year to overturn 14 overreaching federal regulations. https://t.co/noCvAJAd7d","date":"Thu Jun 08 14:47:15 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"73 years since #DDay, liberty-loving people across the world haven't forgotten the bravery &amp; sacrifices made in defense of freedom. https://t.co/ITRFgqTanf","date":"Tue Jun 06 15:23:12 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congress must pass #TermLimits. I wrote legislation &amp; signed on to 7 other bills because this issue is vitally important to our republic. https://t.co/8XQiArpQda","date":"Sat Jun 03 15:00:04 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I wrote a guest column about why I voted against the Continuing Resolution that Congress recently considered. https://t.co/enymgETYnK","date":"Thu Jun 01 14:27:08 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On this Memorial Day, it is important that we reflect on all those brave souls who courageously paid the ultimate price for our nation. https://t.co/l5i6GbKd4v","date":"Mon May 29 13:30:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I introduced the POLICE Act b/c the trust we place in law enforcement doesn't stop at doors of a federal building. https://t.co/l0zgKL5DZb https://t.co/2lLO0BaTOW","date":"Tue May 23 16:59:44 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This past weekend, Salem was devastated by flooding. During my visit, it was clear the community had come together to combat this disaster. https://t.co/3M0KACHkuC","date":"Mon May 22 13:39:57 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a privilege to stand with fellow Hoosiers @VP, @RepLarryBucshon, and @SusanWBrooks to recognize police officers from across Indiana. https://t.co/vQmhbEWDMY","date":"Wed May 17 14:50:30 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"During #NationalPoliceWeek, we give thanks for all those who keep our communities safe. https://t.co/4x72VOHdSL","date":"Wed May 17 14:07:30 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Happy Mother's Day to mothers across #IN09. https://t.co/sevui2Sobi","date":"Sun May 14 22:43:20 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This week, we celebrate nurses across #IN09 &amp; the country who sacrifice time with their families in order to care for patients. Thank you. https://t.co/s2PyZDGGb9","date":"Wed May 10 14:33:23 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"The results are in &amp; Jenna Townsend is the #IN09 Grand Prize Winner for the Congressional Art Competition! https://t.co/vPYlX8YaOv","date":"Tue May 09 17:26:17 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Go and vote for your favorite 2017 Congressional Art Competition submission with a \"LIKE\"! https://t.co/M3s5ODSzuy","date":"Fri May 05 18:11:55 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I voted for the American Health Care Act today. See my statement here: https://t.co/PK6atoIet0 https://t.co/G1XpuNWFs7","date":"Thu May 04 18:49:25 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I voted against the $1.1 trillion spending bill b/c it neglected critical issues like our nation's growing deficit. https://t.co/QxfwSbPJwJ","date":"Wed May 03 22:36:48 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Small businesses are responsible for creating 63% of new jobs in the United States! #SmallBusinessWeek https://t.co/Up7xw4vkju","date":"Tue May 02 13:11:22 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Help decide which student's artwork will be displayed in the U.S. Capitol! Vote for your favorite with a \"Like\"! https://t.co/M3s5ODSzuy","date":"Mon May 01 20:37:51 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Last Saturday, the @USNavy christened a new Virginia-class submarine—the Indiana. #SSN789 is the 4th vessel named for the Hoosier State. https://t.co/KhNNCa1tFs","date":"Mon May 01 15:47:03 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I voted against today's Continuing Resolution because it was a measure that promoted the very culture in Washington, D.C. we need to change. https://t.co/CW5n2Tln3n","date":"Fri Apr 28 18:31:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#IN09 high schoolers: the deadline for the 2017 Congressional Art Competition is this week! Showcase your talents! https://t.co/G5e0CVrLaK","date":"Mon Apr 24 15:24:59 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Met w/ Citizens Climate Lobby, visited a school in Monroe Co. (read to Kindergarten too) &amp; hosted a Veterans roundtable w/ more to come. 2/2 https://t.co/0NglBdeXpd","date":"Thu Apr 20 14:46:46 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"April District Work Period is underway! I met w/ the Greenwood Airport, took part in a legislative townhall, &amp; spoke at NSWC Crane. (1/2) https://t.co/mww8G4J1AB","date":"Thu Apr 20 14:42:51 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"From our family to yours, Happy Easter. https://t.co/Yh7HFmGxEf","date":"Sun Apr 16 22:04:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It is Thomas Jefferson's birthday. A founding father &amp; author of our Declaration of Independence, we credit our nation's creation to him. https://t.co/zU0ag7Qnv8","date":"Thu Apr 13 19:54:45 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It is #TelecommunicationsWeek. Thank you to all 911 Dispatchers for working tirelessly to keep our Police, Fire, and EMS professionals safe. https://t.co/FRoSdEAkNI","date":"Wed Apr 12 18:20:19 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Attention high school students across #IN09: be on the lookout for information about the 2017 Congressional Art Competition! https://t.co/7J23sVKVW1","date":"Wed Apr 05 22:35:14 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@CFPB failed in its core mission &amp; became a partisan seat of tyranny focused on suffocating #SmallBiz &amp; shackling consumers w/ bad policy. https://t.co/NBwxwecyLZ","date":"Tue Apr 04 18:18:46 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":".@POTUS authorized the #KeystoneXL Pipeline. This creates good-paying jobs &amp; ensures America's energy independence and national security. https://t.co/EZ6VbyngLU","date":"Mon Mar 27 14:49:25 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"My statement about the health care legislation: https://t.co/CDMz5bd392","date":"Fri Mar 24 22:42:56 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Proud to have introduced legislation w/ @RepSinema that will slash regulations &amp; empower companies to innovate! https://t.co/xyA9RgYI6n https://t.co/iSZnL25I47","date":"Thu Mar 23 01:58:36 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I spent time this morning calling random constituents across #IN09 to discuss issues that are important to them and their families. https://t.co/5NGP4LsfvB","date":"Fri Mar 17 17:17:42 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"#IN09 farmers contend w/ an overbearing government &amp; shouldn't be deterred from growing crops that end up on our tables or in our gas tanks. https://t.co/ICpAOOY1eX","date":"Tue Mar 14 19:39:02 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Franklin Community Schools in Johnson Co. is accepting nominations for 2017 Hall of Fame class. Deadline tomorrow! https://t.co/qFWXdUtZ6h","date":"Sun Mar 12 22:17:50 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday, I had the honor to recognize @ClarkSheriff Deputy Wes Harper's life-saving actions on the House Floor. https://t.co/DeIebf053p","date":"Fri Mar 03 23:05:15 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A #TBT &amp; thank you to the students at the Bedford Head Start for providing beautiful artwork that is hanging in the Jeffersonville office! https://t.co/XqcZrQoOzM","date":"Thu Mar 02 20:22:16 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I enjoyed spending some time with @ErinMcPike and @TheIJR team this afternoon. Thanks for having me on! https://t.co/76ZFybGsiT","date":"Wed Mar 01 01:00:58 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Our caseworker, Shelly, is a graduate of Eastern High in Pekin. So, to celebrate the State Championship, co-workers decorated her office! https://t.co/kk6aIQchL9","date":"Mon Feb 27 14:23:11 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"This District work week was jammed packed with stops all across the District. See the recap here: https://t.co/qHaDBqQCLs","date":"Sun Feb 26 23:29:43 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congrats to the Eastern Lady Musketeers of Pekin on winning the Indiana Girl's Basketball 2A State Championship today! cc: @ehsmusketeers","date":"Sat Feb 25 23:58:02 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"\"...the U.S. [Freedom] Index was dragged down by Obama's anti-growth war on businesses, investors...\" | https://t.co/S3d4cFcFvo","date":"Thu Feb 16 14:37:34 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Janet Yellen testified with @FinancialCmte today. We must drive changes to the Fed that are needed for the growth &amp; success of the economy. https://t.co/v1gQadApPi","date":"Wed Feb 15 20:31:36 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Had an absolutely wonderful time at Hoosier Uplands' Bedford Head Start today. Amazing to see the impact on students &amp; families in #IN09. https://t.co/Bo0tN4Njfg","date":"Thu Feb 09 22:23:41 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Honored to sit w/ @IndianaBankers to talk about how we get intrusive govt out of the way &amp; enable more opportunities for Hoosiers. https://t.co/4fMxRWgvna","date":"Wed Feb 08 02:42:04 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday, the House unanimously passed HR 387. It requires law enforcement to obtain a warrant (like all other surveillance) for emails. https://t.co/xHEhRTLrPS","date":"Tue Feb 07 16:11:22 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Obama Administration developed a rule that limited options for small investors. @POTUS returned those options today w/ his Executive Order.","date":"Fri Feb 03 19:03:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"We need to return the Supreme Court to the role our Founders envisioned; the new #SCOTUS can return the Court to its rightful place.","date":"Wed Feb 01 01:57:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On 1/31/1871, land was purchased to build Quartermaster Station in #Jeffersonville. Learn about this depot: https://t.co/oJNWxiKpzo #IN09 https://t.co/P45xFYkFmo","date":"Tue Jan 31 14:43:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"These men embodied the principles that mankind has embraced for centuries. We're meant to be explorers. #Apollo1 https://t.co/U2ue3k5YsY","date":"Sat Jan 28 02:20:18 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Proud to launch new website for #IN09. It has contact info for all offices &amp; help for dealing w/ federal gov. https://t.co/4wPZADuCTq","date":"Wed Jan 25 18:58:43 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Glad @POTUS took steps to ensure that unaccountable gov bureaucrats stop leveling burdensome regulations on Hoosiers https://t.co/DGxwNiDvpk","date":"Mon Jan 23 01:23:32 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (8/8) https://t.co/xlktXHAsWJ","date":"Fri Jan 20 17:11:44 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (7/8) https://t.co/3GKLS61hBX","date":"Fri Jan 20 17:11:27 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (6/8) https://t.co/x0yKjwzlsu","date":"Fri Jan 20 17:10:33 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (5/8) https://t.co/sHuJ19CLvO","date":"Fri Jan 20 17:10:06 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (4/8) https://t.co/zO1p5z17IV","date":"Fri Jan 20 17:09:45 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (3/8) https://t.co/RXOsr31cvO","date":"Fri Jan 20 17:09:24 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (2/8) https://t.co/RBmnwtM2n9","date":"Fri Jan 20 17:09:05 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a pleasure to welcome Hoosiers from across #IN09 to THEIR office in Washington, D.C. for this momentous occasion. (1/8) https://t.co/uDlg6I7XRR","date":"Fri Jan 20 17:08:36 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Not very long from now, America will have its 45th President inaugurated. I look forward to working w/ @realDonaldTrump &amp; @mike_pence! #IN09 https://t.co/2ForQ6ACt6","date":"Fri Jan 20 15:35:40 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"It was a packed day, but we’re just getting started. I look forward to criss-crossing #IN09 multiple times in the coming months (10/10)","date":"Wed Jan 18 13:45:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to present Officer R. Thomas a certificate of Congressional Recognition &amp; a letter praising his dedication. (9/10) https://t.co/CdXYG8shuc","date":"Wed Jan 18 13:40:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I was honored to present Reserve Officer T. Ash w/ a certificate of Congressional Recognition &amp; a letter praising his dedication. (8/10) https://t.co/ePavwFgQZn","date":"Wed Jan 18 13:35:00 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I ended the day w/ the @TownClarksville honoring two officers from Clarksville Police Dept. who had been named Officers of the Year. (7/10)","date":"Wed Jan 18 13:30:02 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Afterwards, I met w/ the team at Ramsey Popcorn Company &amp; heard about the great products they produce right here in Harrison County. (6/10) https://t.co/aabKOQQd79","date":"Wed Jan 18 13:25:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Next, I spent some time w/ Springer-Springer Insurance in Orleans, IN talking about their business and this economic climate. (5/10) https://t.co/NicRq12m8U","date":"Wed Jan 18 13:20:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"After a quick lunch at Christie’s on the Square for lunch, I made the trip to Mitchell to meet with Mayor JD England. (4/10) https://t.co/r5pGqGpdfv","date":"Wed Jan 18 13:15:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"From there, I made a stop at the Salem Apothecary &amp; spoke with Rebecca about overreaching govt regulations facing her business (3/10) https://t.co/vB7gm9G2M8","date":"Wed Jan 18 13:10:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I made sure to stop &amp; speak w/ Rita at Lincks Clothing and Shoes before meeting w/ Washington County Assessor Jason Cockerill (2/10) https://t.co/hAy3R3fo3R","date":"Wed Jan 18 13:05:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday was a busy day meeting w/ constituents &amp; small business owners across #IN09! Started by meeting w/ Mayor Merry in Salem, IN (1/10)","date":"Wed Jan 18 13:00:02 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Yesterday, I participated in a Memorial March for Dr. Martin Luther King, Jr., a man who continues to inspire many throughout the world. https://t.co/msvSurz5ab","date":"Wed Jan 18 04:25:52 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@TownClarksville it was an honor to be able to spend some time with you this evening to congratulate Ofcs. Thomas &amp; Ash.","date":"Wed Jan 18 03:44:55 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"On Sundays, my family gathers to complete an afternoon of community service. Today, we spent time at a local food kitchen.","date":"Sun Jan 15 21:17:46 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"First step taken toward #FullRepeal of Obamacare today. Hoosiers deserve a #BetterWay where companies compete for their hard-earned dollars. https://t.co/MIrOxDK2Xj","date":"Fri Jan 13 23:00:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Under Obamacare, average family premium jumped $4,300. Not close to $2,500 @BarackObama promised. Time for #FullRepeal and a #BetterWay. https://t.co/YtYePEwe5x","date":"Fri Jan 13 15:12:45 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"A quick #TBT to the article from the @idsnews about the first piece of legislation I introduced: #TermLimits! https://t.co/9PpSSb7ylH","date":"Thu Jan 12 16:08:35 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Obamacare has failed the American people: options have reduced and premiums have skyrocketed. Now is the time for #FullRepeal.","date":"Wed Jan 11 17:43:32 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I introduced my first piece of legislation: a Constitutional Amendment in favor of #TermLimits for Members of Congress.","date":"Mon Jan 09 23:05:01 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today is #LawEnforcementAppreciationDay. I’m calling Sheriffs &amp; Police Chiefs expressing thanks for the service their departments provide. https://t.co/bV9v6xpqha","date":"Mon Jan 09 20:55:07 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Today, I had the honor of presenting a U.S. Flag to the #GoldStarFamily of SGT. Matthew L. Deckard in honor of his ultimate sacrifice. https://t.co/7mnVTlg1lp","date":"Sat Jan 07 19:58:14 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Congratulations to @realDonaldTrump &amp; @mike_pence on being certified the next President and Vice President by a Joint Session of Congress.","date":"Fri Jan 06 19:06:10 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"ICYMI yesterday, I gave my inaugural floor speech in support of the #REINSAct which the House passed last night. https://t.co/kqhgxmbk3d","date":"Fri Jan 06 13:35:52 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"I'm honored that my colleagues have selected me to serve on @FinancialCmte. Together, we will reduce the burden of federal regulations!","date":"Thu Jan 05 20:28:51 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"@RepJimBanks as am I, friend!","date":"Thu Jan 05 00:25:15 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Thanks to all those from #IN09 who reached out regarding this issue. It is my strongest belief that the House should always be transparent. https://t.co/acN0uO5Hdw","date":"Wed Jan 04 01:36:19 +0000 2017","user_id":"811986281177772032"},{"handle":"RepTrey","text":"Officially a member of the #115thCongress! I am excited to get to work for the Hoosiers of #IN09!","date":"Wed Jan 04 01:23:23 +0000 2017","user_id":"811986281177772032"}]