[{"handle":"RepTomEmmer","text":"These kinds of attacks are happening across the country, and now here in Minnesota.\n\nBy not investigating, the DOJ is enabling these acts of vandalism.\n\nToday, I signed a letter demanding the DOJ investigate these acts of destruction.\nhttps://t.co/G4aQRg9yfD","date":"Thu Jun 16 21:20:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are set to spend more than $5,000 on gas this year, a 78% increase from 2021.\n\nWhen Americans are struggling to afford basic essentials, forcing them into electric vehicles is not a rational solution.\n\nWe need an all-of-the-above energy strategy.\nhttps://t.co/9qmNCfxVZF","date":"Thu Jun 16 19:20:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The United States is far too reliant on China for our rare earth mineral supply. \n\nThis is a matter of national security. Mining these essential resources here in the United States is the responsible, ethical, and forward-thinking solution.","date":"Thu Jun 16 17:07:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"With 70% of our nation’s supply out of stock, @ICEGov is warning consumers about the risks of counterfeit baby formula.\n\nMore information on this serious issue can be found here: https://t.co/3eZe9DawYz","date":"Thu Jun 16 15:59:40 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The leaked Supreme Court decision has resulted in widespread violence aimed at pro-life pregnancy centers across the country. \n\n@HouseGOP members are urging the DOJ to investigate these serious attacks.\nhttps://t.co/Ke6wMdV8Hs","date":"Thu Jun 16 15:05:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations to Becker Police Chief Brent Baloun on 30 years of service in law enforcement!\n\nThank you for your service to our community. https://t.co/FdDfMJvBK1","date":"Thu Jun 16 13:59:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Ending the stigma around mental illness requires open conversation and access to quality care.\n\nToday, I had the chance to meet with the Minnesota Association of Community Mental Health Programs, which provides mental health services to more than 200,000 Minnesotans each year. https://t.co/sX4EHtuxA8","date":"Wed Jun 15 19:09:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden would rather grovel to foreign dictators than incentivize domestic energy production.\n\nThis is unfair to Americans who have been forced to pay weeks of record-high prices. https://t.co/4oa6psfiH4","date":"Wed Jun 15 17:24:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The United States must continue to stand with Israel. \n\nThis week, I had the chance to sit down with @AIPAC to discuss our shared concerns regarding a potential nuclear agreement with Iran. https://t.co/YidJ1xSsLe","date":"Wed Jun 15 15:54:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Due to the Biden Administration's reliance on foreign actors, Minnesotans are facing shortages of medical dye used in scans that detect cancer and other serious diseases. \n\nI am proud to join @RepSteel to address this life-threatening crisis.\nhttps://t.co/3Vnt3gygmK","date":"Wed Jun 15 14:10:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must end elder abuse. \n\nThis #WorldElderAbuseAwarenessDay we recognize our seniors’ right to age with dignity. https://t.co/WOGiiIQJ90","date":"Wed Jun 15 13:54:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This issue is far too common, both in Minnesota and across the country. That is why I introduced the STOP Act which would create a grant program to support the prevention, identification, and eradication of elder abuse.","date":"Wed Jun 15 13:54:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This afternoon, I had the opportunity to meet with the @MN_Chamber. \n\nWe had an in-depth conversation on inflation, supply chain issues, and other challenges facing Main Street businesses. https://t.co/Smim73mpjj","date":"Tue Jun 14 21:04:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We all do.\n\nUnleash American energy NOW!\nhttps://t.co/gVxYLfTxID","date":"Tue Jun 14 19:08:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy 247th Birthday to the @USArmy! \n\nThank you to all who bravely defend our great nation. https://t.co/dXsf6L9WRP","date":"Tue Jun 14 17:04:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wholesale prices remain elevated, hovering near 40-year highs.\n\nAmerican families are struggling, being forced to spend an additional $5,000 this year to keep up.\n\nWe must cut wasteful spending, balance the budget, and focus on pro-growth policies.\nhttps://t.co/Lh1bdYSyhu","date":"Tue Jun 14 15:12:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For all our differences, one flag flies in recognition of our shared freedom. Happy #FlagDay! https://t.co/TYsLUUNXiX","date":"Tue Jun 14 13:16:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"June is National Great Outdoors Month!\n\nDid you know that Minnesota is home to six national parks?\n\nI am proud to cosponsor @RepMMM’s bill to allow all veterans, servicemembers, and Gold Star Families free access to our country’s national parks. https://t.co/KrNdy9AVls","date":"Mon Jun 13 20:19:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, national gas prices officially hit an average of $5 per gallon.\n \nDiesel prices have risen 75% in one year.\n \nWe should be advancing policy that incentivizes domestic energy production, not groveling to foreign dictators. \nhttps://t.co/K5wsmuvhg9","date":"Mon Jun 13 18:17:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This weekend, I had the chance to tour @RiotBlockchain’s Bitcoin mining facility, Whinstone, built with the help of Industrial Louvers Inc. based in Delano, MN! https://t.co/YttOhyHTea","date":"Mon Jun 13 16:03:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In a recent WSJ survey, 83% of Americans negatively describe the state of the economy.\n \nAfter last week’s report on consumer prices, I am not surprised. The print-and-spend mentality in Washington, D.C. must end.\nhttps://t.co/QpKUh3uhaj","date":"Mon Jun 13 14:19:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"June is Alzheimer’s Awareness Month. \n\nMore than 6 million Americans are living with Alzheimer’s and every 65 seconds someone else develops the disease. Together, we can all work to #ENDALZ https://t.co/3DgORjr1FE","date":"Fri Jun 10 18:21:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In April, I sent a bipartisan, bicameral letter to Secretary of State Antony Blinken urging him to work with the Ukrainian government to expedite the adoption of more than 300 Ukrainian children waiting to join their American families. \nhttps://t.co/uwIkvqhCQX","date":"Fri Jun 10 16:19:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I had the opportunity to meet with a few of these families, including the Hayslett family from Zimmerman, MN. \n\nOur casework team has been working with them and is doing everything they can to reunite them with their daughter. https://t.co/I9nNnJ3ot3","date":"Fri Jun 10 16:19:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"🚨Inflation surges 8.6% over the past year!🚨\n\nAmericans are feeling the pain and President Biden claims he “has done all he can do.” That is patently false. \n\nWe must stop the print-and-spend schemes.","date":"Fri Jun 10 13:39:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I have repeatedly urged the Administration and Secretary Yellen to abandon these dangerous, anti-privacy proposals, yet they continue to go after your personal data. \n \n@HouseGOP won’t give up Americans’ right to financial privacy without a fight. \nhttps://t.co/Gop2AtzSpg","date":"Thu Jun 09 20:00:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last year, confidential taxpayer information, collected and housed by the IRS, was stolen and leaked. \n\nInstead of getting to the bottom of this severe theft and restoring trust amongst taxpayers, this Administration has completely ignored it.","date":"Thu Jun 09 20:00:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration is hell-bent on monitoring ALL of your financial transactions.\n \nThey have repeatedly shown they cannot be trusted to protect your financial information, yet they want more.\n \nI don’t think so.\nhttps://t.co/7bPsUNJbJR","date":"Thu Jun 09 20:00:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"So nice to meet with the @MNExcellence Fellows yesterday.\n\nThe Minnesota Excellence in Public Service Fellowship is an outstanding program for women interested in public service. https://t.co/aBtY6iyW0i","date":"Thu Jun 09 18:43:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@RepRalphNorman is a great addition to the @FinancialCmte.\n\nI look forward to working with him as we continue to advance policy to increase access to our financial markets and strengthen the American economy.","date":"Thu Jun 09 16:06:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Soft-on-crime policies have emboldened criminals and led to record homicides across the country.\n\nWe need to empower our law enforcement to keep Americans safe, not demonize them. \nhttps://t.co/TGsqm7V81W","date":"Thu Jun 09 15:18:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I had the chance to visit @2harvest. As working Americans face double-digit price hikes at the grocery store, we are grateful to food banks like Second Harvest who have stepped up to support those in need. https://t.co/siuG08H29N","date":"Thu Jun 09 13:48:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Need assistance dealing with a federal agency? My casework team stands ready to help!\n\nReach out to my district office in Otsego at (763) 241-6848 for more information. https://t.co/yVf0iDpjGY","date":"Wed Jun 08 20:55:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations to Matthew Scherber, a young photographer, Junior at Buffalo High School, and Sixth District Congressional Art Competition winner for his piece entitled “Freedom on a Friday Night”. https://t.co/UefBQTcVXD","date":"Wed Jun 08 17:51:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Gas prices are surpassing record highs almost every day.\n\nThis isn’t a “transitional phase,” Mr. President. We need to unleash domestic energy production now! \nhttps://t.co/fM33YwnY9C","date":"Wed Jun 08 16:34:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great work, @WaiteParkPolice! \n\nI am glad to see this was resolved quickly and safely with the help of community members and other local law enforcement agencies.","date":"Wed Jun 08 15:16:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I had the chance to speak at the Alliance for Regenerative Medicine Conference.\n\nAs a co-chair of the Personalized Medicine Caucus, it was great to highlight some of our bipartisan work to encourage innovative, high-quality care. https://t.co/yYa72ruqB0","date":"Wed Jun 08 14:12:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s inflation-inducing spending spree is forcing many Americans to delay retirement.\n\nInflation is a tax on all of us, and we need real solutions to address it. \nhttps://t.co/hdBfsIKlwD","date":"Tue Jun 07 21:39:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My Responsible Budget Targets Act will deliver balanced budgets within fifteen years without causing major disruptions to government services. https://t.co/2X4IxaeFfS","date":"Tue Jun 07 21:39:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Many liberal economists agree: President Biden’s out-of-control spending has drastically increased U.S. inflation.\n\nReckless government spending and money printing led us here, and we cannot afford to spend our way out.","date":"Tue Jun 07 21:39:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Always great to chat with farmers from #MN06 and the @MNFarmBureau. \n\nInflation and supply chain crises are impacting all of us, but they are hitting agriculture producers especially hard. https://t.co/ImQbcmgQgq","date":"Tue Jun 07 20:23:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I had the opportunity to sit down and chat with Tom Lyons on @MNMilitaryRadio. As always, great to talk about our work to support Minnesota’s veterans. \n\nListen to our conversation here:\nhttps://t.co/InXBVd3Rzj","date":"Tue Jun 07 16:37:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We are proud to represent the largest dairy producing county in the state of Minnesota, Stearns County! Happy #NationalDairyMonth to all our dairy farmers, and thanks for all you do to feed America. https://t.co/tV5wCJBKqr","date":"Tue Jun 07 14:02:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I have introduced legislation to prevent the Fed from issuing a CBDC directly to Americans. https://t.co/DPlmxVIy83","date":"Mon Jun 06 21:13:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Fed report pitched a CBDC that would supposedly ensure privacy while also prioritizing user-identification. But “privacy” and “identification” are irreconcilable.","date":"Mon Jun 06 21:13:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are right to be concerned. For instance, China has already created a CBDC that can be used to spy on citizens and marginalize political dissidents.","date":"Mon Jun 06 21:13:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over 70% of public respondents to the Fed’s report on central bank digital currency DO NOT support the U.S. developing a CBDC. https://t.co/i8pSeb6I7N","date":"Mon Jun 06 21:13:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Food security is national security. We cannot allow foreign adversaries to weaken our ability to feed our own citizens.\n\nLast week, I joined @jdtcnt to discuss our work to prevent China from buying up American farmland. https://t.co/FUSb5voA4s","date":"Mon Jun 06 19:51:48 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"National gas prices have officially DOUBLED since President Biden took office.\n\nEnough is enough. We must encourage domestic energy production and prioritize an all-of-the-above energy strategy.\nhttps://t.co/TzTgnJBlD4","date":"Mon Jun 06 17:48:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is a tragedy—monitoring this situation and thinking of those hurt &amp; killed in the accident today.","date":"Mon Jun 06 16:29:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today marks the 78th anniversary of D-Day and the Battle of Normandy. \n\nOn this day, we honor the servicemembers who courageously stormed the beaches to save the world from the greatest evil we have ever known. We will always remember their sacrifice. https://t.co/z1qi0gpHP6","date":"Mon Jun 06 13:19:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For years, my office’s Young Women’s Leadership Program has connected present and future female leaders in the Sixth District.\n \nWe have a great program scheduled for 2022 and there is still time to apply! https://t.co/Hvd4hUqSY2","date":"Fri Jun 03 19:21:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Even liberal economists don’t believe Democrats’ “greedflation” claims.\nhttps://t.co/RCsczhHfea","date":"Fri Jun 03 15:50:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Bad economic policy has led to the highest inflation in 40 years.\n\nIt is long past time to rein in government spending and restore fiscal sanity in Washington.\nhttps://t.co/GF8xuG2wY8","date":"Fri Jun 03 15:50:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our farmers suffer some of the worst rates of suicide and depression in the country.\n\nThis is why I authored the STRESS under COVID-19 Act which provides supplemental funding for the Farm and Ranch Stress Assistance Network.","date":"Fri Jun 03 13:35:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I had an in-depth conversation with @McconkeyMonica on farm stress and mental health in rural America. https://t.co/lpd40NW6mh","date":"Fri Jun 03 13:35:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am proud to cosponsor @RodneyDavis’ Protecting Family and Small Business Tax Cuts Act to ensure the TCJA tax cuts continue when Americans need them most.\nhttps://t.co/K7oH3tZQer","date":"Thu Jun 02 17:50:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are now paying more in total income taxes than ever before.\n\nPresident Biden has promised to repeal the Tax Cuts and Jobs Act and raise your taxes further – including taxing UNREALIZED capital gains.\nhttps://t.co/hcC0q8P741","date":"Thu Jun 02 17:50:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with members of the @IBEW292 earlier this week.\n\nThank you for giving me the opportunity to see the Charles Lindberg Joint Apprenticeship Training Center! https://t.co/sYxB1xBT8G","date":"Thu Jun 02 16:19:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I had the chance to meet with the Congressional App Challenge winner from #MN06.\n\nAryssa created Depression Revolution, an app that connects users facing depression with mental health resources.\n\nCongratulations and great work Aryssa! https://t.co/zmzAcoThSq","date":"Thu Jun 02 14:30:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Responsible Budget Targets Act offers a practical solution to help balance our nation’s budget and decrease wasteful government spending.\nhttps://t.co/4qKtjiN8Zl","date":"Wed Jun 01 20:06:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Real wages are falling, prices are surging, and the economy is contracting.\n\nWe need real solutions to address inflation.\nhttps://t.co/B9cpeRE4Lg","date":"Wed Jun 01 20:06:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans have now driven 30 billion miles on #E15.\n\nE15 eases prices at the pump and is an essential piece of an all-of-the-above energy approach. https://t.co/bgp9D77VZZ","date":"Wed Jun 01 17:50:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Finally.\n\nNow, let’s rein in government spending. \nhttps://t.co/FiYeHLJ07s","date":"Wed Jun 01 14:52:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Ending the stigma around mental illness requires open conversation and access to quality care.\n\nAs Mental Health Awareness Month draws to an end, we commit to providing accessible mental health care for every American struggling with a mental illness. \nhttps://t.co/2ILUdhvxZJ","date":"Tue May 31 20:23:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"China’s American agricultural land holdings have increased tenfold in the last decade.\n\nFood Security is national security; we cannot allow foreign adversaries to weaken our domestic food production.","date":"Tue May 31 19:27:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am proud to cosponsor @RepNewhouse’s bill to prohibit China from buying American farmland. \n\nMore from @RiponAdvance here:\nhttps://t.co/25At5biQas","date":"Tue May 31 19:27:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Forget summer vacations, many Americans are struggling to afford enough gas to get to work. \n\nWe must incentivize domestic energy production and restore American energy independence. \nhttps://t.co/hL8XASZ3xG","date":"Tue May 31 18:21:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The 2022 Young Women’s Leadership Program begins soon, but there is still time to apply! https://t.co/KCEBKX2Fel","date":"Tue May 31 16:58:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"What a great initiative to increase access to health care across the 6th District.\n https://t.co/W6iV7DzBpa","date":"Tue May 31 15:35:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, we remember those who made the ultimate sacrifice to defend our great nation. \n\nThey will never be forgotten. https://t.co/Om38U7nyTl","date":"Mon May 30 14:32:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In May, we celebrate Military Appreciation Month! Year-round, I am grateful for the strength and sacrifice of our service members.\n \nTo all of our service members and their families – thank you! https://t.co/iwIJ7M5194","date":"Fri May 27 16:42:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our 2022 Young Women’s Leadership Program is starting soon, but there is still time to apply! https://t.co/IevsucU6QV","date":"Fri May 27 15:42:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota is the largest producer of iron ore and taconite in the United States. \n\nWe can either mine critical minerals safely and responsibly here in the U.S., or we can remain reliant on countries like China and Russia.\nhttps://t.co/EfwocqXOOL","date":"Fri May 27 13:44:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Financial Services Committee needs a reminder: Central bank digital currencies are a nonstarter for the United States.","date":"Thu May 26 17:14:21 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"After nearly six years with the Sherburne County Sheriff's office, K9 Officer Riggs began his retirement yesterday.\n\nThank you Riggs, for your service to Minnesota and Sherburne County!\nhttps://t.co/QAVhYNsFo6","date":"Thu May 26 16:42:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy to see this was resolved peacefully. Great work by the @StCloudPDMN!","date":"Thu May 26 14:48:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Jacquie and I are absolutely heartbroken to hear about the tragedy unfolding in Uvalde. Praying for the entire Robb Elementary community and the families of those lost in today’s senseless act of violence.","date":"Tue May 24 21:12:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Any U.S. backed CBDC must be open, permissionless, and private. \n \nAnything less than that is nothing more than a government surveillance tool.\n \nWe must understand the problems a CBDC could solve before considering launching one. \nhttps://t.co/2jpYha2J6I","date":"Tue May 24 20:12:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s reckless economic policies are leading to stagflation.\n\nThe print-and-spend mindset in Washington, D.C. must end.\nhttps://t.co/lygGDhJiAt","date":"Tue May 24 18:14:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced a bill prohibiting the Fed from issuing a central bank digital currency directly to individuals. Here’s why it matters: https://t.co/S7pQ5rVc6n","date":"Wed Jan 12 15:16:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Joe Biden’s anti-energy agenda is actively harming the American people.\n\nThere is nothing “incredible” about it. https://t.co/AioVvlvWQU","date":"Tue May 24 15:18:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is destroying Americans’ ability to save for the future. \n\nAmericans, on average, have $9,000 less in their savings accounts than they did in 2021. \nhttps://t.co/sT85paaKtg","date":"Tue May 24 13:25:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/fDbTdbziHA","date":"Mon May 23 19:54:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Families across America are scared due to widespread baby formula shortages. Areas of Minnesota are dealing with out of stock levels as high as 47%.\n\nThis weekend, I sat down with @esmemurphy at @WCCO to discuss this ongoing crisis. https://t.co/MrIveMp7p7","date":"Mon May 23 18:38:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over the weekend, I chatted with @SwanSit at @veecon in Minneapolis about the future of web3 in the United States and government’s responsibility to not mess it up.  \n\nGreat to speak with an awesome, engaging audience. \n \nRemember: Your government works for you.","date":"Mon May 23 17:04:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is impacting every sector of the American economy. \n\nIt has nothing to do with “corporate greed” and everything to do with bad economic policy.","date":"Mon May 23 16:12:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thank you to everyone who came to my town hall in Blaine on Friday! These events are important as they give me a chance to hear about the issues directly impacting the Sixth District.\n\nIf you didn’t get a chance to attend, you can always email me at: https://t.co/8LVIr3NfRr https://t.co/6kBUQgSQ69","date":"Mon May 23 14:54:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Unbelievable. President Biden would rather appease socialists in Venezuela than give up his regulatory barrage on American energy.\nhttps://t.co/YefF2kJc4n","date":"Fri May 20 19:50:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Homicide rates have increased 48% in 2022 compared to 2020, according to @MjrCitiesChiefs.\n\nAmericans cannot afford any more of Democrats’ soft-on-crime policies.","date":"Fri May 20 17:56:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to support @RepDonaldsPress and @SenTuberville Financial Freedom Act of 2022.\nhttps://t.co/WwVu9kIClx","date":"Fri May 20 16:40:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Self-directed 401(k) accounts should be… self directed. Congress will ensure the government cannot prohibit Americans from investing part of their self-directed 401(k) accounts in Bitcoin or any other assets.","date":"Fri May 20 16:40:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"New CBP data reported 234,088 migrant encounters in April, a record high. \n\nLess than half were expelled under Title 42, a policy the Biden Administration is ending in 3 days. https://t.co/GcJR7Tmo3H","date":"Fri May 20 15:19:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I met with the Minnesota Petroleum Marketers Association. \n\nWe discussed how the Administration’s regulatory assault on the energy industry has resulted in soaring energy bills for American families. https://t.co/Ov0RC16q7i","date":"Fri May 20 14:02:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is crushing American working families.\n\nPresident Biden’s careless economic policies are directly at fault. https://t.co/OzvDz1Sdg0","date":"Thu May 19 20:45:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with leaders from Sherburne County yesterday to discuss my support for ongoing infrastructure projects in the Sixth District! https://t.co/kkBi1QwR0r","date":"Thu May 19 19:18:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Open. Permissionless. Private. The United States government should never design a surveillance tool that puts us in line with China’s digital authoritarian state.","date":"Thu May 19 18:06:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more here: https://t.co/SLIP9rtSMw","date":"Thu May 19 18:06:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is why, ahead of next week’s Financial Services Committee hearing on CBDCs I joined @PatrickMcHenry and the @FinancialCmte in a letter to @FederalReserve Chair Jerome Powell concerning the Fed’s recent CBDC white paper. \nhttps://t.co/WjqFWEizVT","date":"Thu May 19 18:06:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@FinancialCmte wants to understand what problems a CBDC would solve BEFORE we create and launch one.","date":"Thu May 19 18:06:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I had the chance to meet with representatives from @WYTorganization. Thank you for all you do to assist amputees with their recovery! https://t.co/LX3GTlZxFa","date":"Thu May 19 14:31:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation will cost the average American family more than $5,000 this year. \n\nThe Biden Administration’s inflation crisis is impacting all of us, but it’s hurting working families the most. \nhttps://t.co/73Mf9dt89V","date":"Thu May 19 13:19:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our law enforcement officers work tirelessly everyday to keep our communities safe.\n\nI am proud to support @RepJuliaLetlow’s resolution to honor our fallen officers. \nhttps://t.co/ITdzIezOAS","date":"Wed May 18 21:57:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Another day of record high gas prices due to the Biden Administration’s regulatory assault on the energy industry.\nhttps://t.co/jxZ9yNx5jM","date":"Wed May 18 20:24:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"via @POLITICOPro\nhttps://t.co/2FbxPtF1tv","date":"Wed May 18 18:47:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler, you put all of the SEC’s taxpayer funded resources into crypto crackdowns. Now you don’t have the funds to do your actual job so you’re coming to Congress for more? You’ve got to be kidding me. https://t.co/L1fH5Cd57m","date":"Wed May 18 18:45:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Prices are surging, wages are falling, and our economy is shrinking – a perfect recipe for stagflation.\n\nDemocrats’ reckless economic policies are directly responsible. \nhttps://t.co/yJydZcQS4v","date":"Wed May 18 17:49:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Baby formula is not a luxury, it is a necessity. \n\nThe Biden Administration’s failure to address this shortage has only made this crisis worse.\nhttps://t.co/K4qHAulxO0","date":"Wed May 18 16:12:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news via @washingtonpost – The American people are not interested in government bureaucrats dictating “truth.” https://t.co/8RWgo9UCMi","date":"Wed May 18 15:12:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseGOP WILL shut down this Orwellian attempt to censor our free speech. https://t.co/1Rk3SBuca5","date":"Wed May 18 14:08:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For the sixth time, Democrats have blocked the American Energy Independence from Russia Act. \n\nAmericans are paying record-high gas prices with no end in sight. We must unleash our energy independence! https://t.co/yzWRAU9QzF","date":"Tue May 17 19:36:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wonderful as always to sit down with Minnesota advocates from the @AlzAssociation. Together, we will bring an end to this vicious disease. https://t.co/AOLbwHN7CE","date":"Tue May 17 18:04:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Absurd &amp; dangerous. \nhttps://t.co/Cry6albffR","date":"Tue May 17 16:28:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This will greatly exacerbate the inflation crisis impacting every American. https://t.co/TxDCXK7o2M","date":"Tue May 17 13:23:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The last few years have been difficult for many of our law enforcement officers. \n\nDuring #NationalPoliceWeek we recognize the courage of those who have chosen to serve and protect our communities. \nhttps://t.co/u2sAV28HKM","date":"Mon May 16 16:23:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is a great initiative to build connections in the St. Cloud community!\nhttps://t.co/BSQL17wD6n","date":"Mon May 16 14:37:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today and every day, we remember the 73 peace officers killed in 2021. More police officers were killed in the line of duty in 2021 than in any year since 1995. https://t.co/YIxdraB0Ys","date":"Sun May 15 14:22:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am happy to announce that I will be hosting an in-person town hall at the Blaine City Hall on Friday, May 20th at 7PM. Hope to see you there! https://t.co/BIiYztyCSC","date":"Fri May 13 19:55:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@FinancialCmte learned of the CFPB’s shadowy fellowship program made up of individuals paid over $200k annually of taxpayer dollars WITHOUT ethical or financial transparency. \n\nProud to work w. @PatrickMcHenry, @RepBlaine &amp; @RepTimmons to demand answers. https://t.co/eGzO3iHmPL","date":"Fri May 13 18:52:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI: FASB will (finally) establish crypto accounting standards. See our nonpartisan letter about this issue below. ⤵️","date":"Fri May 13 16:00:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, two Eden Prairie police officers untangled two bald eagles. With the officers help the eagles were able to fly away unharmed. \nIncredible work!\nhttps://t.co/UCFrS7qtaK","date":"Fri May 13 15:15:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, along with the Congressional #Blockchain Caucus, I wrote a letter to Chairman Richard Jones of @FAFNorwalk, urging him to provide authoritative accounting guidance for companies that hold #virtualcurrencies. Read more below ⤵️ https://t.co/TOi1cIVXE5","date":"Wed May 12 21:29:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Young people can borrow hundreds of thousands in student loans but cannot invest in startups without meeting “accredited investor” regulations. \n\nAbsurd.","date":"Fri May 13 14:31:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our law enforcement officers are often the first to interact with survivors of domestic violence and sexual assault.\n\nWe must give first responders the resources they need to provide much-needed support. \nhttps://t.co/GqqUgemos9","date":"Fri May 13 13:49:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"#CD6 - Potential tornado in area. Find shelter and stay safe!","date":"Fri May 13 00:47:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congress has recognized that this bureaucratic regulatory posture on digital assets is unproductive. So, we are working together, across the aisle, to find solutions that will allow the United States to lead in digital asset policy.","date":"Thu May 12 20:02:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For that reason, I introduced the FSOC Reform Act, which brings the FSOC under congressional oversight and increases the transparency of the council. The future of crypto will be decided by the American people, not bureaucrats. https://t.co/9BblUvXQkg","date":"Thu May 12 20:02:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If Congress doesn’t pass the legislation the Admin wants us to pass? Doesn’t matter. The stablecoin report &amp; the crypto EO both direct FSOC to find risks with digital assets and stablecoins - once they label it as systemically risky, regulators can move forward with their agenda.","date":"Thu May 12 20:02:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This recent history demonstrates to me that the FSOC is no longer independent of partisan pressures and should be brought under Congressional appropriations so elected officials can make sure the voices of the voters are represented in the decisions of the FSOC.","date":"Thu May 12 20:02:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Instead, the PWG wants Congress to pass stablecoin legislation that doesn’t have consensus in Congress, not even amongst Committee Democrats, and is threatening to utilize the \"independent\" FSOC as a vehicle to circumvent Congress and the American people on digital asset policy.","date":"Thu May 12 20:02:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, Secretary Yellen confirmed that the FSOC is not supposed to take direction from the White House, as that would compromise the independence of the council. This doesn’t seem to be the case when it comes to digital assets and stablecoins…","date":"Thu May 12 20:02:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Secretary Yellen chairs the Financial Stability Oversight Council (FSOC), an independent council of regulators tasked with identifying financial stability risks and aligning regulatory frameworks around those systemic risks.","date":"Thu May 12 20:02:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The future of crypto, web3, and the “ownership economy,” cannot and must not be dictated by any entity that is supposed to be independent, but instead takes its cues from a political agenda. 🧵 https://t.co/VKZA1OpfTa","date":"Thu May 12 20:02:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Throughout the week, I will be adding some inspiring stories to this thread, highlighting the great work that law enforcement officers do in our state.","date":"Thu May 12 19:23:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"#NationalPoliceWeek https://t.co/auzaoKfDMD","date":"Thu May 12 19:23:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wholesale prices remained at record highs in April. \n\nInflation is a tax on every American, costing families an extra $5,000 this year. \nhttps://t.co/jwhOBYwrE5","date":"Thu May 12 17:27:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More severe weather is expected this afternoon &amp; evening.\n\nBe sure to monitor local news and seek shelter if necessary. Stay safe!","date":"Thu May 12 15:52:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Families across the country are struggling to deal with the nationwide shortage of baby formula. \n\nIn Minnesota, 40% of the baby formula supply is out of stock.\n\nRecently, I joined more than 100 of my colleagues demanding the FDA take immediate action to address this crisis.","date":"Thu May 12 15:10:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more on the @HouseGOP’s efforts to address this life-threatening crisis here: https://t.co/4TgrCD84lx","date":"Thu May 12 15:10:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"When gas prices are surpassing record highs seemingly everyday, President Biden is doubling down on his anti-energy agenda.\nhttps://t.co/AvDCFRDOoj","date":"Thu May 12 14:01:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are already strained by inflated prices. \n\nNow, many are unable to find baby formula for their children. \n\n@HouseGOP has requested answers from the FDA and we haven’t heard back.\n\nThis administration has no plan to address this crisis. \nhttps://t.co/5xItNWXNX7","date":"Wed May 11 21:40:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"2021 marked another painful milestone in our country's fentanyl crisis--the first time 100,000 American lives were lost to overdoses in a single year.\n\nWe must secure our borders. We must stop the flow of these poisonous drugs into our county.\nhttps://t.co/C2uaFqZDlK","date":"Wed May 11 18:51:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"FYI - @GaryGensler responded to our bipartisan oversight letter on the SEC’s crypto info collection process. Gensler’s response doesn't provide Congress with the specific data and insights we requested in our 13 questions.\n\nDon’t worry, CT, we will obtain this information. https://t.co/PnbcFWnjMN","date":"Wed May 11 16:32:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On May 11th, 1858, Minnesota became the 32nd state to achieve statehood. \n\nHappy 164th Birthday to the great North Star State! https://t.co/AdOAlMs6By","date":"Wed May 11 15:38:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Now, they’re framing their inflation crisis as “Putin’s Price Hike”.\nhttps://t.co/2bmN51DjBJ","date":"Wed May 11 13:37:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Then, they tried to convince the American people “corporate greed” was to blame. \nhttps://t.co/JadC5zAqmR","date":"Wed May 11 13:37:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American people know better. \n\nThis crisis is a direct result of President Biden and House Democrats' reckless spending.","date":"Wed May 11 13:37:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Later, they called it a “high-class problem”.\nhttps://t.co/YmwAmQIezs","date":"Wed May 11 13:37:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Then, the White House, Federal Reserve, and Treasury Department said it would be “transitory”.\nhttps://t.co/Vrm5se3GaS","date":"Wed May 11 13:37:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"First, the White House tried to convince the American people that inflation was a good thing.\nhttps://t.co/dw6bgUksSz","date":"Wed May 11 13:37:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is eroding American’s savings and paychecks – a tax on all of us. \n\nInstead of leading us out of this crisis, the Biden Administration has only pointed fingers. 🧵\nhttps://t.co/JLqA251cZC","date":"Wed May 11 13:36:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Even liberal economists agree: President Biden’s out-of-control spending has exponentially increased U.S. inflation.\n\nYou want a plan to solve inflation Mr. President? Stop the wasteful spending.","date":"Tue May 10 20:00:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"#ICYMI\nLast week, I joined @AshBennington on @RealVision to discuss the ongoing conversation around crypto regulation in Washington, D.C.\n\nWatch here:\nhttps://t.co/pecWt4OoJY","date":"Tue May 10 18:26:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden says his inflation crisis is not because of reckless spending. \n\nHe might want to run that by his own Treasury Secretary. https://t.co/vMRMRrgzTz","date":"Tue May 10 16:46:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, I joined more than 100 of my Republican colleagues and urged the Biden Administration to stem the flow of fentanyl coming across our southern border. \nhttps://t.co/tShQiRJa0T","date":"Tue May 10 16:10:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today is the first #NationalFentanylAwarenessDay. \n\nCBP agents have reported a 4,000% increase in fentanyl seizures over the last 3 years. \n\nEvery day the Biden Administration fails to act, we risk losing more Americans to this crisis. https://t.co/wfY7cuydFg","date":"Tue May 10 16:10:21 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More information here: https://t.co/GEUhoVPHgW","date":"Tue May 10 14:35:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"There is still time to apply for our Young Women’s Leadership Program! https://t.co/A27LfSGEIW","date":"Tue May 10 14:35:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Gas prices hit a new all-time high today.\n\nThe American people cannot afford the Biden Administration’s war against domestic energy. \nhttps://t.co/rhedhe73N4","date":"Tue May 10 13:34:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Local alert: Potential for some severe weather tonight. Be sure to monitor local news and seek shelter if necessary. Stay safe!","date":"Mon May 09 20:28:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Why do politicians and bureaucrats insist on “protecting” Americans from investing their money how they choose?\nhttps://t.co/HivSBl5vll","date":"Mon May 09 19:43:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Retailers are being forced to ration baby formula due to the Biden Administration’s supply chain failures.\nhttps://t.co/qWQJBUKSVc","date":"Mon May 09 18:06:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is why I sent a bipartisan letter today to SEC Chair @GaryGensler with @RepDarrenSoto, @WarrenDavidson, @RepAuchincloss, @RepDonaldsPress, @RepJoshG, @RepTedBudd, and @RepRitchie regarding the SEC’s crypto information seeking process. https://t.co/8HcTgZA0XL","date":"Wed Mar 16 15:30:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Republican oversight efforts of out-of-control regulators are paying off: the SEC has extended the public comment period of three contentious proposed rulemakings, including the proposed “exchange” rulemaking. \nhttps://t.co/APVnJrTGdC","date":"Mon May 09 16:36:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"May is Mental Health Awareness Month. \n\nIn 2020, 21% of American adults—that’s 52.9 million people, or 1 in 5 adults—experienced mental illness.\n\nWe must incentivize quality, accessible mental health care for every American. https://t.co/oFedVo4TCU","date":"Mon May 09 15:43:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am consistently impressed with @StCloudPDMN’s commitment to our community. These new partnerships with local veterans groups show a continued dedication to improving community outreach and relationships. https://t.co/mIKpgIA2vY","date":"Mon May 09 13:28:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Mother’s Day, especially to my mom Patsy, and of course, my wife (and mother to our seven amazing kids) Jacquie! https://t.co/raPrmWHace","date":"Sun May 08 13:17:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today is the 148th running of the Kentucky Derby.\n \nThis year, I will be cheering for Zandon, a 3-year-old thoroughbred, owned by a family from the Sixth District!\nhttps://t.co/yIzvt7jIf6","date":"Sat May 07 14:45:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I introduced the Emergency Rental Assistance Accountability and Transparency Act.\n\nThis bill will provide much needed oversight to the tens of billions spent on the failed American Rescue Plan.\nhttps://t.co/7VmUTy4b2z","date":"Fri May 06 18:46:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats have completely neglected their oversight responsibilities. \n\nThe @FinancialCmte and I remain committed to preventing the waste of YOUR taxpayer dollars.","date":"Fri May 06 18:46:48 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Secretary of Energy is pushing you to spend $55k on an electric vehicle but doesn’t even seem to understand how they work… or the key resources needed to produce them. https://t.co/Kndj6H0lX9","date":"Fri May 06 16:03:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Furthermore, I have joined a letter to the Secretary of Homeland Security questioning the legal authority of the Biden Administration to establish this dubious “Ministry of Truth”. https://t.co/7mEmlsE7xS","date":"Fri May 06 14:36:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am proud to co-sponsor the Protecting Free Speech Act to disband this Orwellian board and prevent the use of government funds from being spent on anything similar. https://t.co/Fq2CiaLykW","date":"Fri May 06 14:36:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration has no business policing our free speech. \n\nA “Disinformation Governance Board” is a fundamentally un-American idea.\n\nWe cannot allow Washington bureaucrats to become the arbiters of truth.","date":"Fri May 06 14:36:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Military spouses serve alongside their loved ones. They are an irreplaceable support system for our nation’s service members. \n\nOn Military Spouse Appreciation Day, we as a nation show our gratitude for the sacrifices they make every day. https://t.co/7nRmxhKNZD","date":"Fri May 06 13:50:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The SEC’s announcement to nearly double the size of its crypto enforcement unit does not seem very technology neutral.🤔 https://t.co/CMumbAxiW7","date":"Thu May 05 19:20:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"One party control in Washington has resulted in: \n\n❌Record high inflation\n❌Real wages plummeting\n❌Economy shrinking\n\nAmericans cannot afford @HouseDemocrats reckless economic policy.","date":"Thu May 05 18:43:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Small businesses have faced unprecedented challenges over the last few years.\n\nInflation &amp; hiring challenges have strained Minnesota's 500,000+ small businesses. \n\nDuring #SmallBusinessWeek we recognize the important service these businesses bring to our communities. https://t.co/dQLGDS3bXS","date":"Thu May 05 15:34:40 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This morning, we join millions of Americans for #NationalDayofPrayer https://t.co/T51bikqnUc","date":"Thu May 05 13:24:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American people oppose this effort. \nhttps://t.co/SUbTANf9qe","date":"Wed May 04 20:09:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My Community Outpost Outreach and Engagement Act will lead to greater community engagement with law enforcement officers.\nhttps://t.co/9S2dQr94N5","date":"Wed May 04 17:15:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Violent crime in Minnesota is out of control. We need more law enforcement visibility, not less.\nhttps://t.co/pAho3bPbuf","date":"Wed May 04 17:15:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Get a warrant.\nhttps://t.co/el6n0SZnxY","date":"Wed May 04 15:47:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"According to CBP data, more than 7000 migrants crossed the border per day, on average, in March.\n\nDHS is preparing for 18000 per day after Title 42 is lifted. \n\nRoughly the size of the City of St. Michael, MN. DAILY. \n\nWe must secure our southern border. \nhttps://t.co/OU9mN9I4mx","date":"Wed May 04 14:46:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Only those who cannot win in the marketplace of ideas need to rely on censorship.\n\nWhy are you so afraid of free speech, Mr. President? \nhttps://t.co/CqbHGZKQXZ","date":"Tue May 03 20:26:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"👇","date":"Tue May 03 18:57:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This will greatly exacerbate the inflation crisis impacting every American.\nhttps://t.co/TxDCXK7o2M","date":"Tue May 03 18:40:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In 2020, Inspector Generals returned nearly $16 in savings to taxpayers for every dollar invested in their budget. This bill will provide much-needed oversight to the tens of billions spent on rental assistance in the so-called American Rescue Plan.\nhttps://t.co/ROiYwLJS9h","date":"Tue May 03 16:02:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congress cannot afford to waste a single dollar of American taxpayer money. \n\nSo, today, with @PatrickMcHenry and the entire @FinancialCmte, I introduced the Emergency Rental Assistance Accountability &amp; Transparency Act.","date":"Tue May 03 16:02:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I wonder how many taxpayer dollars are being wasted in @GaryGensler’s personal crusade against the crypto industry?\nhttps://t.co/Rm15PR8MAL","date":"Tue May 03 14:37:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My Main Street Growth Act will bring capital formation opportunities to communities across America.\nhttps://t.co/7k2jLCEdyg","date":"Mon May 02 19:46:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must make it easier for companies to go public so Americans can have more opportunities to form capital and achieve financial success.","date":"Mon May 02 19:46:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy National Beef Month to all our ranchers and producers, thank you for all you do to feed America! https://t.co/rMCt0QsPkQ","date":"Mon May 02 16:36:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are struggling, and President Biden is laughing. \nhttps://t.co/sIV2set9D9","date":"Mon May 02 15:15:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is already surging at 40-year highs.\n\n“Canceling” student debt will only make things worse. \nhttps://t.co/thcoQrCsSj","date":"Mon May 02 13:40:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every year, the DEA hosts National Prescription Drug Take-Back Day.\n \nPrescription drug abuse affects many Americans, remember to take back any unused prescription drugs so they can be safely disposed of. https://t.co/oaeRTYDwuy","date":"Sat Apr 30 14:46:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/KUzh4fvKQE","date":"Fri Apr 29 18:56:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A Disinformation Board is a desperate—and dangerous—last-gasp effort to censor our free speech. \n\nMr. President, you will not be successful in your mission to silence the American people.","date":"Fri Apr 29 18:20:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats reckless spending and failed leadership have crippled the U.S. economy.\nhttps://t.co/f8OEom3RAK","date":"Fri Apr 29 17:19:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It's April 29th @GaryGensler. The \"Blockchain Eight\" hasn't received a response to our March 16th oversight letter.\n\nWe've given you more time than you give the American people to respond to your proposed rulemakings.","date":"Fri Apr 29 14:59:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Labor costs increased by the largest amount in 21 years in Q1 of 2022. President Biden’s print-and-spend policies continue to wreak havoc on small businesses. \nhttps://t.co/mtzfX5fiNM","date":"Fri Apr 29 14:05:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud of the nonpartisan work of Blockchain Caucus members.","date":"Thu Apr 28 19:36:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Digital Commodity Exchange Act, reintroduced today by my friend @CongressmanGT, gives the CFTC the authority to regulate crypto spot markets - streamlining regulation for exchanges and providing a place for tokens deemed not securities (digital commodities) to trade.","date":"Thu Apr 28 19:36:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is why I sent a bipartisan letter today to SEC Chair @GaryGensler with @RepDarrenSoto, @WarrenDavidson, @RepAuchincloss, @RepDonaldsPress, @RepJoshG, @RepTedBudd, and @RepRitchie regarding the SEC’s crypto information seeking process. https://t.co/8HcTgZA0XL","date":"Wed Mar 16 15:30:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’ve been working with @CongressmanGT, @RepRoKhanna, and @RepDarrenSoto (members of the Blockchain Caucus) on two pieces of sensible, pro-crypto legislation that recognize a token is separate and distinct from a securities offering… because U.S. framework should reflect that.","date":"Thu Apr 28 19:36:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"With the new term “Investment Contract Asset,” my bill, Securities Clarity Act, separates a token from a securities contract in existing law, allowing the SEC and token issuers to easily determine when a token is offered as part of a securities contract and when it is not.","date":"Thu Apr 28 19:36:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with @KrauseHolsteins today, one of my constituents, a dairy farm leader, and one of the newest @MNFFA Hall of Fame members! https://t.co/Q4iKL4w1bG","date":"Thu Apr 28 17:20:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The U.S. economy shrank 1.4% in Q1 of 2022, the worst quarter in 2 years. \n\nWhat was that about a Biden Boom? \nhttps://t.co/YeE0WCVcIC","date":"Thu Apr 28 15:00:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A 2021 study found that 3 out of 4 American teens do not feel confident in their personal financial knowledge.\n\nThe same study found that more than 70% of American teens want more personal finance education.\n\nWe must prioritize financial literacy education. https://t.co/X2QfVMNkgj","date":"Wed Apr 27 19:53:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on every American, costing families an extra $5,200 this year.\n\nThis is the opposite of a \"high-class problem\". It is hurting working families the most.\nhttps://t.co/yicL7nDYed","date":"Wed Apr 27 16:33:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I had the opportunity to tour Landwehr Construction’s new headquarters in St. Cloud.\n\nGreat to speak with the Landwehr team about how we can continue to support local business at the federal level. https://t.co/9SxD1M2Q2L","date":"Wed Apr 27 13:43:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A new @NFIB study reports 93% of small businesses are being substantially (62%) or moderately (31%) impacted by inflation.\n\nThis is a direct result of the Biden administration’s inflationary policies. \nhttps://t.co/90JQraW3sk","date":"Tue Apr 26 21:19:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The President’s budget proposal includes 36 tax hikes--including taxing UNREALIZED capital gains. \n\nMake no mistake, this will impact EVERY American’s retirement savings.","date":"Tue Apr 26 15:46:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week I had the chance to tour the new RB Scott Equipment facility in Clearwater.\n\nWe discussed how current record-breaking inflation has impacted the construction and building industry. https://t.co/9UZYb84Jgm","date":"Tue Apr 26 13:19:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"An online platform that is open source would increase trust and provide a digital space with the democratic values that underpin this nation. I hope we capture this opportunity.","date":"Mon Apr 25 20:36:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We assemble online and we speak online, but we don’t have a true digital public forum because the online platforms where we carry out public debate gatekeep access.","date":"Mon Apr 25 20:33:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on every American, but it’s squeezing those on a fixed income the hardest.\nhttps://t.co/taFahXtk2F","date":"Mon Apr 25 18:05:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"According to new CBP data, migrant encounters at our southern border are up 542% from 2020.\n\nThis crisis will only be exacerbated by ending Title 42. https://t.co/VpWaNlrbh3","date":"Mon Apr 25 16:12:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more about the Due Process Continuity of Care Act here⬇️\nhttps://t.co/CWi5KzsbDJ","date":"Mon Apr 25 14:45:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I had the opportunity to sit down with Cpt. Patrick O’Malley, the Jail Administrator in Wright County. It was great to get some real-world feedback on how my Due Process Continuity of Care Act will benefit both local counties and inmates struggling with mental health challenges. https://t.co/mKwVakoUXI","date":"Mon Apr 25 14:45:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy birthday to the U.S. Army Reserve! https://t.co/Z0IY24c1lK","date":"Sat Apr 23 14:47:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In a time when the Biden Administration should be removing regulatory red tape to support necessary infrastructure efforts, they are more concerned with appeasing the radical left.\nhttps://t.co/MF3IA2pwo4","date":"Thu Apr 21 19:25:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota’s agriculture industry is the backbone of our state’s economy. Thank you to the more than 7,100 constituents who joined my telephone town hall last night. We had a great conversation with leaders in the Minnesota ag community and provided many resources to MN06 farmers. https://t.co/usM86MfFVC","date":"Thu Apr 21 17:08:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, I visited the @UAPipeTrades Local 539 training center. It was great to see this new state-of-the-art facility and speak with a few of their hard-working members. https://t.co/37GTfTVtyH","date":"Wed Apr 20 21:58:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Record high inflation is destroying small businesses across the county.\n\nYesterday, I had the opportunity to sit down with @SBAgov District Director Brian McDonald. I have always been and will always be a defender of Main Street businesses.\nhttps://t.co/n2iYmzTYMl","date":"Wed Apr 20 20:27:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On Monday, I had the opportunity to visit the Leonard family dairy farm. Six generations of Leonards have farmed here, and it was amazing to see and hear how they have adapted and changed over the years! https://t.co/qnoIsNtUnS","date":"Wed Apr 20 18:06:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"REMINDER: My telephone town hall with @MNFarmBureau President Dan Glessing and MinnStar Senior Vice President Ken Theisse is tonight at 7 PM CT! https://t.co/8Gfqr2KvCl","date":"Wed Apr 20 14:22:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"These are today’s gas prices in the Sixth District--47% higher than this time last year. https://t.co/cEOq9AeWEI","date":"Tue Apr 19 20:27:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The failed American Rescue Plan created ZERO jobs and significantly increased inflation to its highest levels in over 40 years.\n\nThis is not a ‘Putin price hike’. It is the direct result of @HouseDemocrats failed policies. https://t.co/IQk1frFVuL","date":"Tue Apr 19 17:21:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats inflation-inducing spending spree is forcing Americans to postpone or reverse their retirement plans.  \nhttps://t.co/Kc3rEISAle","date":"Tue Apr 19 14:33:48 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"…and this administration wants to create a central bank digital currency.","date":"Mon Apr 18 20:57:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden administration has completely botched what should have been a booming economy.\nhttps://t.co/AYJ0Nzgvy2","date":"Mon Apr 18 20:39:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Government spending has created an inflation crisis the likes of which we haven’t seen in forty years. \n\nRead about how I’m working to restore fiscal sanity in the @sctimes ➡️\nhttps://t.co/2l3gFEAhpj","date":"Mon Apr 18 16:40:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Border security is national security.\n\nThe Biden Administration’s negligence at our southern border begs the question: how many other suspected terrorists haven’t been caught?\nhttps://t.co/2NbpNx5IKM","date":"Mon Apr 18 15:15:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today is the last day to file your 2021 taxes. If you need any assistance with filing, my casework team stands ready to assist. Find filing tips on my website, here➡️\nhttps://t.co/ucObGNq9JJ","date":"Mon Apr 18 14:46:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Jacquie and I want to extend a warm and happy Easter to all who celebrate! #HeIsRisen https://t.co/MTYUiqIMUK","date":"Sun Apr 17 12:07:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wishing all who celebrate a peaceful and reflective Good Friday. https://t.co/P56Ohw7TVC","date":"Fri Apr 15 11:32:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more in @MinnPost here:\nhttps://t.co/y27crCEKFO","date":"Thu Apr 14 20:24:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our national debt has surged to more than $30 TRILLION.\n\nWe must bring government spending under control, and we need to do it now. https://t.co/vpy4eEfrsO","date":"Thu Apr 14 20:24:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s massive budget proposal includes the largest tax hikes in history, yet leaves out the Hyde amendment.\n \nI was proud to join my colleagues to push back against this proposal and protect the unborn.\nhttps://t.co/AILY44dJ3J","date":"Thu Apr 14 17:02:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More information here: https://t.co/Sy6Bsu8VI4","date":"Thu Apr 14 15:12:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am pleased to announce that we will be hosting an agriculture focused telephone town hall with @MNFarmBureau President Dan Glessing and MinnStar Senior Vice President Kent Thiesse this Wednesday, April 20 at 7PM CT. https://t.co/QtMnh4H7uL","date":"Thu Apr 14 15:12:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The SEC’s accredited investor regulations are absurd. Gatekeeping wealth creation is un-American.\n\nAmericans are smart enough to make their own financial decisions, but @GaryGensler thinks he knows better.","date":"Wed Apr 13 18:17:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Staffing shortages aren’t the only barriers to accessible mental health care. Our Expanding Access to Inpatient Mental Health Act will allow doctors, not arbitrary coverage caps, to dictate a patient’s routine of care &amp; keep crucial beds open to patients. https://t.co/TdvR46OEex","date":"Wed Apr 13 17:48:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans have to test negative before flying into the U.S.\n\nChildren around the country are being forced to wear masks in school.\n\nMasks are still required for public transportation.\n\nIf we are still in a COVID emergency, why is Joe Biden ending Title 42?\nhttps://t.co/mjzIteqdFW","date":"Wed Apr 13 14:57:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wholesale prices are surging beyond economists predictions.   \n\nAmericans cannot afford any more of the Biden Administration’s inflationary policies.\nhttps://t.co/KB5ieMWJK9","date":"Wed Apr 13 13:26:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on every American. https://t.co/pCtgX6QXTg","date":"Tue Apr 12 20:05:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, I sent a letter to the Biden Administration urging action on this serious issue. https://t.co/sKw49p3VzC","date":"Tue Apr 12 18:21:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As citizens of Ukraine bravely fight off Russian aggression, another tragedy has come to light: Ukrainian children in the process of adoption by American families are unable to reach their new homes. \nhttps://t.co/uwIkvqhCQX","date":"Tue Apr 12 18:21:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Gray wolves are no longer endangered, yet they continue to pose a significant threat to our agriculture community. \n\nLast week, I joined a letter with 23 of my colleagues encouraging the Administration to support state led conservation of the gray wolf. https://t.co/J3MDzq9r5N","date":"Tue Apr 12 15:50:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation has increased every month of Joe Biden’s presidency. This is no ‘Putin price hike’ -- it’s a tax on every American, levied by the Biden Administration. \nhttps://t.co/B2UtSkoOaC","date":"Tue Apr 12 13:12:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats' reckless spending has caused U.S. inflation to significantly outpace other countries. https://t.co/PNDqJfdiDq","date":"Mon Apr 11 18:46:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thank you, @RepKatCammack for joining me in this important effort!","date":"Mon Apr 11 14:41:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Simply put, the reckless spending by our government must stop. Our current trajectory is unsustainable and threatens future generations of Americans. \n\nWe must rein in government spending. https://t.co/469LquA24V","date":"Mon Apr 11 13:55:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more from The @RiponAdvance here:\nhttps://t.co/zX2RPFZVWK","date":"Mon Apr 11 13:55:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wishing a peaceful &amp; contemplative Palm Sunday to all who recognize this sacred day. https://t.co/rSBQXtWIfP","date":"Sun Apr 10 22:15:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration refuses to issue new permits for domestic energy production.\n\nUnleash American energy dominance now! https://t.co/4RkJUmn9ag","date":"Fri Apr 08 18:22:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Energy companies may have leases available, but the Biden Administration won’t grant them extraction permits.\n\nAmericans cannot afford any more of the Biden Administration’s anti-energy agenda.","date":"Fri Apr 08 16:10:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Another great year of the @HockeyCHC!  The Lawmakers took home the win for the 4th year straight, a great event for a fantastic cause! https://t.co/wt0ZUQXMPG","date":"Fri Apr 08 14:55:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The lawmakers take it home!! https://t.co/xq1YLT2doc","date":"Fri Apr 08 00:38:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"At it again! 🚨 4-2 🚨 https://t.co/L6qhQVwAtu","date":"Fri Apr 08 00:13:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Lawmakers score!! 3-2 https://t.co/9gEQXY58zK","date":"Fri Apr 08 00:08:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"And the lawmakers score! 2-2","date":"Thu Apr 07 23:45:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Let’s go boss! Current score 1-1 https://t.co/qvL5MAOGFi","date":"Thu Apr 07 23:16:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Tonight while our boss is representing the Lawmakers at the @HockeyCHC, Team Emmer will be taking over! https://t.co/XHJNpVscyp","date":"Thu Apr 07 23:14:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I had a chance to speak with students from Edina High School. I always enjoy hearing from Minnesota’s young people—our state has a great next generation of leaders. https://t.co/AzOyhqPlie","date":"Thu Apr 07 20:15:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I spoke with the @manacrna. We had an in-depth conversation on barriers to entry in the profession and ensuring quality care for patients. https://t.co/KVnxJzZt52","date":"Thu Apr 07 18:42:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans can hardly afford to put food on the table because of inflation. \n\nThe Biden Administration’s response? Telling you to spend $55k on an electric vehicle. https://t.co/wTlGmeVJ8a","date":"Thu Apr 07 16:10:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Looking forward to another successful year of my office’s Young Women’s Leadership Program!\nhttps://t.co/cLTvy6GmMQ","date":"Thu Apr 07 14:44:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"See you on the ice!👀🏒\nhttps://t.co/YNmypjsHKi","date":"Thu Apr 07 13:30:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The print-and-spend scheme in Washington must end.\n\nWe cannot afford to spend our way out of this crisis.\nhttps://t.co/XlVIYWtScw","date":"Wed Apr 06 21:34:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I sat down with @MinnesotaPork. Minnesota is the second largest pork producing state in the country. It was interesting to hear how inflation and supply chain issues have impacted this important sector of our state’s economy. https://t.co/iXy7guIL6Y","date":"Wed Apr 06 20:39:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with members of the @StCldAreaChamb today! We had an in-depth conversation on the current challenges facing the St. Cloud business community. https://t.co/qALsXxrfYf","date":"Wed Apr 06 19:41:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more on our legislation here: https://t.co/4qKtjiN8Zl","date":"Wed Apr 06 17:01:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, our national debt has ballooned to over $30 trillion. We can still change course, but we must act now.\n\nToday, with @SenatorBraun, I introduced the Responsible Budget Targets Act, which offers a practical solution that will help balance our nation’s budget.","date":"Wed Apr 06 17:01:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s budget mentions ‘equity’ 75 times. \n\nIt mentions ‘inflation’ 6 times. \n\nThis is not a serious proposal.","date":"Wed Apr 06 14:49:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Welcome to the force, Bosco!\nhttps://t.co/oT0xmOpcER","date":"Wed Apr 06 12:42:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More than 80% of Americans believe we are heading for an economic recession. \n\nThe Biden Administration has completely fumbled what should have been a booming economy.\nhttps://t.co/hW2EcYGlFR","date":"Tue Apr 05 19:24:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration’s plan to raise taxes will kill nearly 140,000 jobs and force wage cuts for workers. https://t.co/bhwzgbvFCV","date":"Tue Apr 05 17:39:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepTimmons @RepFredUpton @RepDavidValadao @RepAnnWagner @RepJoeWilson @RobWittman @RepDonBacon @RepBoebert @RepCawthorn @DesJarlaisTN04 @DrNealDunnFL2 @virginiafoxx @RepAGonzalez @RepGrothman @CongressmanHice @RepAshleyHinson @RepBillJohnson @RepDaveJoyce @RepJohnJoyce","date":"Tue Apr 05 14:22:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepLaHood @RepBlaine @RepMariaSalazar @PeteSessions @GReschenthaler @RepWalberg @RepBradWenstrup @RepLeeZeldin @RepClayHiggins  @RepJuliaLetlow @RepMichaelGuest @RepJimBaird","date":"Tue Apr 05 14:22:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRussFulcher @RepBobGibbs @replouiegohmert @RepHartzler @RepHarshbarger @repkevinhern @RepRichHudson @RepHuizenga @RepJacobs @RepDustyJohnson @RepJohnKatko @MikeKellyPA @RepTrentKelly @RepLaMalfa @RepDLamborn @boblatta @RepFrankLucas @RepLisaMcClain @cathymcmorris @RepMeijer","date":"Tue Apr 05 14:22:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepMeuser @RepMaryMiller @RepMMM @RepMoolenaar @RepBarryMoore @RepNewhouse @RepRalphNorman @RepGregPence @congbillposey @RepTomRice @RepJohnRose @RepRosendale @RepDavidRouzer @AustinScottGA08 @CongMikeSimpson @RepAdrianSmith @RepBryanSteil @RepChrisStewart @RepTenney @RepTiffany","date":"Tue Apr 05 14:22:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepStefanik @CongressmanGT @RepRickAllen @RepArmstrongND @RepBalderson @RepJimBanks @RepBentz @RepBice @RepDanBishop @RepBost @RepTedBudd @RepKatCammack @RepJerryCarl @RepBuddyCarter @RepBenCline @TomColeOK04 @RepJohnCurtis @RodneyDavis @RepEllzey @RepPatFallon @RepFeenstra","date":"Tue Apr 05 14:22:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thank you to @RepPeteStauber, @RepFischbach, @RepGregMurphy, and @RepArrington for co-leading this effort. https://t.co/pnHiJ6bfvo","date":"Tue Apr 05 14:22:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Skyrocketing input prices are robbing our farmers of their livelihoods, and even today’s high commodity prices can’t keep pace. \n\nToday, I led a letter with 96 of my colleagues urging President Biden to take action on rising fertilizer prices and help our farmers.","date":"Tue Apr 05 14:22:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, on Gold Star Spouses Day, we remember all the Americans who gave everything in service of our freedom. \n\nThank you all for your patriotism and strength. https://t.co/cl5HOHFXj9","date":"Tue Apr 05 13:08:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Federal Reserve Bank of San Francisco confirms what many of us already knew – reckless government spending is directly responsible for this inflation crisis.\nhttps://t.co/3rdV1G4eVV","date":"Mon Apr 04 16:21:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are experiencing the highest levels of inflation in 40 years, the Biden Administration is proposing increased spending and raising taxes. \n\nWe cannot afford to spend our way out of this mess. https://t.co/5wSRnNMWkz","date":"Mon Apr 04 13:33:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Learn more here: https://t.co/L2dEl1lLla","date":"Fri Apr 01 20:34:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Calling all student artists in Minnesota’s 6th District! \n\nThe 2022 Congressional Art Competition has begun. The winner’s piece will be hung in the U.S. Capitol for a year. https://t.co/yxYkCkUh4Z","date":"Fri Apr 01 20:34:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Violent crime is raging across the country. \n\nRadical ‘defund-the-police’ rhetoric is only stoking the flames. \n\nWe must stand behind our law enforcement officers. https://t.co/4urkeuCCQV","date":"Fri Apr 01 16:11:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder: The last day to file your taxes is April 18th. \n\nVisit my website for some helpful tips on filing your tax return! https://t.co/ucObGNq9JJ","date":"Fri Apr 01 13:47:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s anti-energy policies led us to this point. Now, his administration is handicapping our future energy security.","date":"Thu Mar 31 19:20:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Many states still have billions of dollars in unspent Covid-19 relief funds, and @HouseDemocrats are clamoring for more!\n\nWe cannot spend our way out of this inflation crisis. \nhttps://t.co/Zrtelz06gG","date":"Thu Mar 31 18:42:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Earlier this week, SECURE 2.0 passed the House of Representatives.\n\nI am proud to cosponsor this important bipartisan legislation that will make it easier for Americans to save for retirement.\nhttps://t.co/mA4IHkOEXe","date":"Thu Mar 31 16:31:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI \nLast week I joined @Avery_Akkineni on @GaryVee’s #MarketingForTheNow. We had a great discussion about my recent crypto legislation, web3, and CBDCs.\n\nWatch here: \nhttps://t.co/kzqPzXDUgE","date":"Thu Mar 31 15:29:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Personal Consumption Expenditures Index rose by 6.4% in the year through February, the fastest increase since the 1980s.\n\nMore than 60% of American families report they can't afford to keep up with rising costs. \nhttps://t.co/FBUQwkW03X","date":"Thu Mar 31 13:17:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We need to move away from the SEC’s one-size-fits-all regulatory posture.\n\nThe Main Street Growth Act will allow for the creation of venture exchanges so small and medium cap companies can go public through a more streamlined process. https://t.co/fyijhs9jiY","date":"Wed Mar 30 21:18:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The U.S. is not “behind China on crypto.” CBDCs are not crypto – they’re a government surveillance tool. Crypto creates freedom, it doesn’t destroy it.","date":"Wed Mar 30 19:13:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Welcome home to fellow Minnesotan and NASA Astronaut, @Astro_Sabot!\n\nCongratulations on setting the record for longest spaceflight by a @NASA Astronaut! https://t.co/A0QAjHD7MT","date":"Wed Mar 30 17:03:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/6Vd9DvBIHB","date":"Wed Mar 30 15:04:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The United States should never seek to compete with China in developing the best surveillance state. Thank you, @SenTedCruz, for joining me in this fight.","date":"Wed Mar 30 15:04:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Any central bank digital currency that is not open, permissionless, and private – like cash – is simply a surveillance tool. I am proud to have @SenTedCruz lead the Senate companion of my CBDC legislation. 👇","date":"Wed Mar 30 15:04:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced a bill prohibiting the Fed from issuing a central bank digital currency directly to individuals. Here’s why it matters: https://t.co/S7pQ5rVc6n","date":"Wed Jan 12 15:16:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Year after year, my office’s Young Women’s Leadership Program has connected present and future women leaders in the Sixth District. I’m excited to announce that we have begun accepting applications for the 2022 Spring/Summer session. https://t.co/MP51dhqoIx","date":"Wed Mar 30 14:10:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Learn more and apply here: https://t.co/GEUhoVPHgW","date":"Wed Mar 30 14:10:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"American families cannot afford more of Washington’s print-and-spend policies.","date":"Wed Mar 30 13:18:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Energy security is national security.\n\nWe must commit to an all-of-the-above energy policy.","date":"Tue Mar 29 19:47:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The longest serving member of the Republican party, and Dean of the House of Representatives, Congressman Young represented the State of Alaska for 49 years. I always enjoyed chatting with him about my time in Alaska at @uafairbanks. https://t.co/JfrrXSHSWH","date":"Tue Mar 29 16:20:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, the House of Representatives honors Congressman Don Young. \n\nA fierce advocate for the State of Alaska, a legend in the halls of Congress, and a loyal friend.\n\nWe will all miss him dearly. https://t.co/SzSnScMV91","date":"Tue Mar 29 16:20:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Big thanks to Toby on behalf of the Committee and the 6th District for lending Congress his time and expertise as we explore ways to strengthen our housing markets.","date":"Tue Mar 29 15:18:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I had the pleasure of welcoming Tobias Peter as a witness at our @FinancialCmte hearing on strengthening our housing markets. Toby is a constituent of mine from St. Cloud, MN. I have been fortunate to know Mr. Peter for the past four years. https://t.co/ioCrDcoLpU","date":"Tue Mar 29 15:18:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, we honor the 2.7 million men and women who served our country in the Vietnam War.  We are forever grateful for the courage and sacrifice of all who serve. https://t.co/JhFB7bIKxi","date":"Tue Mar 29 14:03:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans cannot afford any more of President Biden’s anti-energy agenda.\n\nGas prices are up 81% since Biden took office.\nhttps://t.co/EJCzNKATnj","date":"Mon Mar 28 19:25:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration must secure our borders immediately.\nhttps://t.co/68T8lNJKSc","date":"Mon Mar 28 17:23:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden insults the intelligence of the American people when he tries to rebrand increased gas prices as the ‘Putin price hike’.\nhttps://t.co/jJxpzhhnQh","date":"Mon Mar 28 13:43:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"✅Challenged and requested information from the Biden Administration regarding farmers mental health during the severe drought felt across Minnesota in 2021.","date":"Fri Mar 25 18:46:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"✅Offered a resolution expressing support for the designation of November 18th as ‘National Rural Mental Health Day’.","date":"Fri Mar 25 18:46:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Due to the nature of their work and the lack of mental health resources available in rural areas, people who work in agriculture suffer from higher rates of depression and suicide.\n\nHere is some of the work I have done to increase mental health resources for our nation’s farmers:","date":"Fri Mar 25 18:46:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"✅Authored the STRESS Act, which became law in 2018, which provided resources to the Farm and Ranch Stress Assistance Network.","date":"Fri Mar 25 18:46:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"✅Introduced legislation to provide improvements to the Farm and Ranch Stress Assistance Network.","date":"Fri Mar 25 18:46:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Illegal immigrants are surging across our southern border and the Biden Administration is urging ICE officers to ‘use more discretion before making arrests’.\n\nWe must secure our borders. \nhttps://t.co/NCKgxxfSI5","date":"Fri Mar 25 17:07:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last night, my staff had the opportunity to sit down with some of Minnesota’s future agriculture leaders!\n\nThey discussed their concerns and hopes for the future of agriculture and learned more about their upcoming convention. Thank you to all who participated! https://t.co/sp7Ig1hiT1","date":"Fri Mar 25 13:30:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m joining @avery_akkineni on @GaryVee’s #MarketingForTheNow today at 4:50pm EST. Excited to chat about all things NFTs, web3, and the Blockchain Caucus.\nhttps://t.co/WJmxDDkJYj","date":"Thu Mar 24 20:30:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration’s crusade against American energy has caused monthly heating costs to DOUBLE in Minnesota.\n\nWe must embrace an all-of-the-above energy strategy and return to the era of energy independence. \nhttps://t.co/ciWMZAf97S","date":"Thu Mar 24 17:50:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"✅Crypto donations to Ukraine have totaled almost $100 million. \n✅40% of the vendors supporting Ukraine have accepted crypto as payment. \n✅Banks in Ukraine are not operating. Crypto exchanges are operating 24/7.\n\nCrypto is essential. \nhttps://t.co/mXmwG7JPqf","date":"Thu Mar 24 15:46:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy birthday to my best friend, the love of my life, my wife Jacquie! https://t.co/R1gKLmi5Qd","date":"Thu Mar 24 14:25:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Steak +16.9% https://t.co/kv4uVEbJPq","date":"Thu Mar 24 13:58:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Milk +11.2% https://t.co/uSYuRktFCv","date":"Thu Mar 24 13:58:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Eggs +11.4% https://t.co/yD3XD9evd3","date":"Thu Mar 24 13:58:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"When @HouseDemocrats talk about a #BidenBoom, this is what they really mean:","date":"Thu Mar 24 13:58:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our nation’s farmers are struggling. High input costs around the farm are eroding any potential gains. \n\nLast week, I joined a bicameral letter urging the Biden Administration to reconsider their stance on imported fertilizer. https://t.co/rH8W1DMsQ6","date":"Wed Mar 23 16:37:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yes! Also, any US CBDC must be open, permissionless, and private - like cash.","date":"Wed Mar 23 14:59:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI:\n‘No other industry is regulated by conclusory public comments and threatened enforcement actions. It has to stop!’\nhttps://t.co/GWrLAHptja","date":"Wed Mar 23 13:55:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American people are under monumental financial stress due to the prices at the gas pump. \n\nBiofuels are an integral part of an all-of-the-above energy approach. \n\nWe must return to the era of American energy independence.","date":"Tue Mar 22 18:36:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"According to a recent ICE report, deportations fell by nearly 68% last year, to the lowest level in 26 years -- despite record high illegal crossings!","date":"Tue Mar 22 16:01:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Russia’s unacceptable attacks on Ukraine are having serious impacts on American farmers.\nhttps://t.co/gD3FPLbEjm","date":"Tue Mar 22 14:24:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@GOPLeader is absolutely correct. \n\nInflation is attacking American’s pocketbooks and House Democrats have no plans to address it.","date":"Tue Mar 22 13:48:40 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Sadly, the last year has been very difficult for many of our farmers. Sky-high input costs have eroded gains and led to increased prices for consumers. \nhttps://t.co/dY1FQno24w","date":"Mon Mar 21 17:37:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Agriculture Week to all the farmers, ranchers, and producers in Minnesota! https://t.co/wF7BHL5nof","date":"Mon Mar 21 14:18:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Tonight, Alaska lost a leader, the House lost its Dean, and I lost a friend. Jacquie and I will be holding Don’s memory close and praying for Anne and the many people who loved him.","date":"Sat Mar 19 02:07:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, @SecYellen finally acknowledged that Americans are in for another year of ‘very uncomfortable’ inflation.\n\nHer administration’s policies are directly responsible.\nhttps://t.co/0i482paVly","date":"Fri Mar 18 17:30:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"According to Kelly Blue Book, the average cost of an electric vehicle is $56,437.\n\nThe average salary in the United States is $53,490.\n\nThe Biden Administration is so out of touch it is absurd.","date":"Fri Mar 18 14:54:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Of all the tragedies happening in Ukraine, this hits especially close to home. Praying for James and his family tonight.","date":"Thu Mar 17 22:51:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Grateful that my office was able to help facilitate Sixth District-based @VistaOutdoorInc and @FederalPremium’s important ammunition donation to the people of Ukraine.\nhttps://t.co/xLzyH818vw","date":"Thu Mar 17 19:34:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"America must commit to an all-of-the-above energy policy.\n\nLet’s allow consumers to decide when they are ready to fully embrace EVs – not force adoption.","date":"Thu Mar 17 15:46:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news! Proud to see this bill finally become law. https://t.co/DWvV9Ri2Ca","date":"Thu Mar 17 13:22:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Analysis of @BLS_gov statistics reveal that President Biden’s print-and-spend policies have led to massive price increases in consumer goods.\n❌New cars &amp; trucks +12.4%\n❌Flooring +11.3%\n❌Tools +8.7%\n❌Toys +6.7%","date":"Wed Mar 16 19:44:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to have a chat with Minnesota HealthWorks today! https://t.co/9N8xI3WHnB","date":"Wed Mar 16 18:01:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"There is still time to apply for a summer internship in my Washington D.C. or Otsego District office! \n\nMore info here: https://t.co/8Jg6EEJqkn","date":"Wed Mar 16 17:17:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crypto startups must not be weighed down by extra-jurisdictional and burdensome reporting requirements. We will ensure our regulators do not kill American innovation and opportunities.","date":"Wed Mar 16 15:30:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"While the SEC has authority to obtain info from market participants for rulemaking purposes, it must ensure that these inquiries don't infringe on the standards established in the Paperwork Reduction Act, which limits the burden the govt. imposes on private businesses &amp; citizens.","date":"Wed Mar 16 15:30:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is why I sent a bipartisan letter today to SEC Chair @GaryGensler with @RepDarrenSoto, @WarrenDavidson, @RepAuchincloss, @RepDonaldsPress, @RepJoshG, @RepTedBudd, and @RepRitchie regarding the SEC’s crypto information seeking process. https://t.co/8HcTgZA0XL","date":"Wed Mar 16 15:30:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My office has received numerous tips from crypto and blockchain firms that SEC Chair @GaryGensler’s information reporting “requests” to the crypto community are overburdensome, don’t feel particularly… voluntary… and are stifling innovation.","date":"Wed Mar 16 15:30:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"America must commit to an all-of-the-above energy policy.\nWe must restore American energy dominance!","date":"Tue Mar 15 20:30:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Listen to our entire conversation here:\nhttps://t.co/Vpr2fLJXcV","date":"Tue Mar 15 17:58:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I joined @thauserkstp on @WCCOradio to discuss the ongoing crisis in Ukraine. https://t.co/mRH0B72UMS","date":"Tue Mar 15 17:58:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Producer prices have increased 10% since February of last year, the largest year-on-year increase ever recorded.\n\nThis has nothing to do with the crisis in Ukraine and everything to do with Biden’s print-and-spend policies. \nhttps://t.co/H4habX66KI","date":"Tue Mar 15 14:47:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is impacting every part of daily life for American families:\n❌Chicken +13.2%\n❌Lunch meat +11%\n❌Baby food +8.4%\n❌Pet supplies +7.5%","date":"Mon Mar 14 20:46:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"During #WomensHistoryMonth we celebrate the monumental achievements of women from Minnesota and beyond.\n\nHappy Women’s History Month! https://t.co/a9g0sRsvkC","date":"Mon Mar 14 18:03:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Shifting to a cashless economy is inevitable, but we should never surrender decentralized money.","date":"Mon Mar 14 13:22:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As we have moved into the digital economy of the 21st century, the risk of financial censorship is higher than ever before because society primarily transacts digital money through intermediaries.","date":"Mon Mar 14 13:22:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In Feb., the significantly intermediated financial system allowed Canada to wield its powers freeze financial assets of citizens protesting against vaccine mandates - a politically unpopular opinion. A Western democracy should never practice digital authoritarianism akin to China","date":"Mon Mar 14 13:22:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Fortunately, there are decentralized payment tools that preserve the democratic values that are so integral to the free world. I am dedicated to ensuring Americans have financial tools that, like cash, are open, permissionless, private, and resilient to intermediated control.","date":"Mon Mar 14 13:22:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The cost? An irresponsible government could weaponize emergency powers and order financial institutions to arbitrarily freeze the accounts and assets of individuals that engage in politically unpopular activities.","date":"Mon Mar 14 13:22:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This isn’t far from home.","date":"Mon Mar 14 13:22:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Without the freedom to transact, there is little substance to the protections offered by the Bill of Rights.","date":"Mon Mar 14 13:22:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Modern society is shifting toward a cashless economy. More and more transactions are digital and move through intermediaries. These digital transactions afford consumers significant conveniences but come with a cost…","date":"Mon Mar 14 13:22:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The ability to transact freely underpins all American constitutional rights. For instance, the right to free speech, assembly, or religion might require a website, traveling to a different location, booking a hotel, or leasing a facility.","date":"Mon Mar 14 13:22:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Financial freedom is integral to American freedom. However, these democratic values are under attack – a 🧵","date":"Mon Mar 14 13:22:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is taxation. \n\nWages are not keeping up and inflation continues to surge.\nhttps://t.co/USztwKOBay","date":"Fri Mar 11 20:47:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"91% of the Biden Plan’s 1.9 trillion went to non-public health spending.  \nhttps://t.co/7M2O56VT8w","date":"Fri Mar 11 17:31:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Now, @HouseDemocrats and the Biden administration are pushing for additional Covid funding. When states are sitting on tens of billions in unspent funds, this is unthinkable. \nhttps://t.co/09LpCoI9CW","date":"Fri Mar 11 17:31:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American Rescue Plan pushed already-skyrocketing inflation even higher, leading to the highest levels in over 40 YEARS. \nhttps://t.co/s1FMiKCAUP","date":"Fri Mar 11 17:31:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This plan created ZERO jobs. \nhttps://t.co/tlIQZfhVvf","date":"Fri Mar 11 17:31:21 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today marks a year since the passage of President Biden’s $1.9 TRILLION Covid spending plan. For all that spending, here’s what he has to show for it:","date":"Fri Mar 11 17:31:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota’s trucking industry is suffering due to President Biden’s crusade against American energy. \n\nWe must bring back American energy independence. \nhttps://t.co/wAcMdNAmFq","date":"Fri Mar 11 15:53:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crippling inflation continues to erode American’s savings.\nhttps://t.co/zjBnlXNbF9","date":"Thu Mar 10 20:52:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must reinstate domestic mining of critical minerals. The Biden Administration refuses, preferring to rely on foreign dictators for critical minerals.\nhttps://t.co/zkNIeI1Zlg","date":"Thu Mar 10 17:33:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I co-sponsored @RepPfluger Midland over Moscow Act, to immediately reimpose sanctions on the Russian Nord Stream II pipeline.","date":"Thu Mar 10 17:33:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are feeling the pain at the pump. President Biden’s anti-energy agenda has sent prices soaring to record highs. \n\nThis week, I supported multiple initiatives to bring back the era of American energy independence.\nhttps://t.co/qOxK71hrEx","date":"Thu Mar 10 17:33:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I co-sponsored @cathymcmorris American Energy Independence from Russia Act, which requires Biden to submit an energy security plan to Congress and restart construction on the Keystone XL pipeline.  \n\nEnergy security is national security. We must increase domestic production.","date":"Thu Mar 10 17:33:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on every single American—and it impacts those with the least the most.\nhttps://t.co/PVwslaJRDf","date":"Thu Mar 10 14:15:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Overall, it’s critical that we maintain tech and economic leadership on the global stage and I look forward to continuing to work to find bipartisan solutions to keep our great crypto community right here in the United States.","date":"Thu Mar 10 01:54:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Financial freedom is American freedom.","date":"Wed Mar 02 19:20:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"3) Most fortunately, the EO doesn’t ask the SEC to weigh in. SEC Chair Gensler has spent the past year intimidating crypto innovators and entrepreneurs with his unproductive regulation by public statement and enforcement action. His input is not critical.","date":"Thu Mar 10 01:54:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"2) The EO places the “highest urgency” on the agencies to study CBDCs. Any commonsense analysis of a potential U.S. CBDC that is not open, permissionless, and private would illuminate that the very idea is an entire nonstarter and a disservice to Americans.","date":"Thu Mar 10 01:54:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"1) Decentralization is the Point: The EO doesn’t mention decentralization once. The disintermediation of our economy will enable all Americans, regardless of circumstance, to decide their futures, not a bank or Big Tech or the government.","date":"Thu Mar 10 01:54:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Given this Admin’s regulatory posture toward the crypto community, we have no reason to assume that the directives in the EO will yield results that appropriately acknowledge the importance of leading w. digital asset policies that prioritize open, permissionless, &amp; private tech.","date":"Thu Mar 10 01:54:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Sec. 1 findings of the EO are sound: We have a national interest in fostering digital asset innovation. The rest of the EO focuses on consumer protection, systemic risks, global competitiveness, international standards, and placing guardrails on code to make sure its resilient.","date":"Thu Mar 10 01:54:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Now, let’s read between the lines:","date":"Thu Mar 10 01:54:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crypto, tokenization, blockchain, NFTs, smart contracts, &amp; stablecoins are powering a more viable economic structure with individual autonomy. As a country, it’s imperative that we develop a strategy to foster this innovation.","date":"Thu Mar 10 01:53:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"(The @BlockCaucus has been advancing a pro-crypto legislative and oversight agenda for the past 8 years.)","date":"Thu Mar 10 01:53:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As expected, this Executive Order directs various federal agencies to study benefits and risks of digital assets to our economy/global competitiveness and provide legislative recommendations.","date":"Thu Mar 10 01:53:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Just finished reviewing Biden’s Executive Order on Digital Assets… Here are a few thoughts:","date":"Thu Mar 10 01:53:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Extending the student loan moratorium is a bad-faith Democrat scheme that will certainly exacerbate skyrocketing tuition prices. \n\nAmerica must lead with policies that make education and opportunities accessible to all, not force Americans to take on debt to access opportunity.","date":"Wed Mar 09 20:46:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crypto is one of the only ways to securely and reliably get funds into Ukraine. Let’s focus on that &amp; not spew misinformation that has been discredited by Treasury officials.","date":"Tue Mar 08 23:19:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Another bad take. US-regulated crypto exchanges are compliant with sanctions -- that fact alone highlights the need to foster crypto innovation domestically and not push it offshore.\nhttps://t.co/xfBH8i7rZD","date":"Tue Mar 08 23:19:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I had the pleasure of meeting with Minnesota leaders of the School Nutrition Association. https://t.co/6TMtEncT0E","date":"Tue Mar 08 22:13:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I said goodbye to my friend and colleague, Congressman Jim Hagedorn.\n\nJim, thank you for your friendship and service to our state. We will all miss you dearly. https://t.co/D7B4LsrDCX","date":"Tue Mar 08 20:22:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This morning, I met with the Minnesota Professional Fire Fighters. It was great to discuss how we can work together to be a resource to our local first responders. https://t.co/Pp68b9OeER","date":"Tue Mar 08 16:41:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Hockey is for everyone. \n\nGreat story from @kare11 on a young athlete who hasn’t let his medical condition keep him off the ice. \nhttps://t.co/Maa2s2K57l","date":"Tue Mar 08 14:32:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s crusade against American energy has resulted in the highest gas prices in United States history.","date":"Mon Mar 07 20:34:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, our national debt is more than $30,302,000,000,000.\n\nThat’s $91,065 per American. \n\n@HouseDemocrats want to continue to spend and expect YOU to pick up their tab.","date":"Mon Mar 07 17:46:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden and @HouseDemocrats would rather fund hostile regimes in Venezuela and Iran than increase American energy production.","date":"Mon Mar 07 14:50:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am proud to see the @MNWild working to end the stigma associated with mental health.\nhttps://t.co/D8yoPjeMZA","date":"Fri Mar 04 19:35:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to support @RepTiffany in this effort.","date":"Fri Mar 04 16:58:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Deadly fentanyl is stealing lives from our communities. \n\nWe must halt the flow of these poisonous drugs into our country. https://t.co/qsosq5i8qZ","date":"Thu Mar 03 19:30:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Police departments around the country have seen a mass exodus of officers thanks to slashed budgets and ‘defund the police’ rhetoric. \n\nNow more than ever, we need skilled law enforcement officers in our communities. \nhttps://t.co/U1mlx1EHTr","date":"Thu Mar 03 17:07:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy birthday to our amazing boss! -Staff https://t.co/aCVIfTpQ4O","date":"Thu Mar 03 14:29:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Financial freedom is American freedom.","date":"Wed Mar 02 19:20:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I spoke with Minnesota educators from the National Association of Secondary School Principals. \n\nI remain committed to policies that provide schools the resources they need to encourage and empower our students. https://t.co/AcAWrcPNkS","date":"Wed Mar 02 18:43:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Many small businesses barely made it through the Covid-19 pandemic, others were forced to close. \n\nNow, runaway inflation is causing a whole new set of challenges. \n\nWe must end the print-and-spend mentality in Washington.\nhttps://t.co/3vO0Fr7Uqg","date":"Wed Mar 02 17:22:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read my full statement on tonight's #SOTU here: https://t.co/htwMBowbNb https://t.co/6WelGHCiLc","date":"Wed Mar 02 03:24:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Nearly 60% of Americans believe the United States is worse off than it was just one year ago. https://t.co/8e9cS9E24G","date":"Tue Mar 01 22:07:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great meeting today with the @DAVHQ. I remain committed to ensuring our veterans receive the highest levels of care when they return home. https://t.co/vC1VWblV20","date":"Tue Mar 01 19:47:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesotans remain in a state of scarcity due to the Biden administration’s disastrous supply chain failures. \nhttps://t.co/DbPVyKaN6L","date":"Tue Mar 01 18:44:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s decision to release 30 million barrels of oil from U.S. strategic reserves is a 1.5 day solution to a long-term problem of his own making.\n\nWe must restore American energy independence.","date":"Tue Mar 01 17:39:47 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last night, I stood on the House floor with the entire Minnesota delegation for a moment of silence in remembrance of our friend, Representative Jim Hagedorn. https://t.co/LrVVcEkEBV","date":"Tue Mar 01 16:03:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to support!","date":"Tue Mar 01 15:08:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden, you owe it to us to chart our course back to safety and prosperity. The American people deserve better.  \n\nWatch my message ahead of tonight's #SOTU  ⬇ https://t.co/N46R5eVTCO","date":"Tue Mar 01 14:12:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For the more than approximately 20 percent of inmates in our nation’s jails with mental illness and substance use disorder, treatment isn’t a luxury, it’s a necessity.\n\nRead more about my recent legislation in @MinnPost⬇️\nhttps://t.co/CWi5KzsbDJ","date":"Mon Feb 28 22:51:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For too long, patients have relied on the “test and see” approach to prescribing pharmaceuticals. As co-chair of the Personalized Medicine Caucus, I introduced bipartisan legislation to use pharmacogenomic (PGx) testing to prevent adverse drug events. https://t.co/wfueaTsojN","date":"Mon Feb 28 20:20:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI\n“We are the greatest experiment and freedom that the world has ever known. That being the case, why would we ever want to emulate the Communist Party of China?”\n\nListen to my recent @OnTheBrinkCIV appearance here: \nhttps://t.co/7zgOUyHoAQ","date":"Mon Feb 28 17:29:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Many often shy away from discussing mental health challenges. \n\nAs a member of the Congressional Mental Health Caucus, I am pleased to see Anoka-Hennepin schools making this conversation a priority. \nhttps://t.co/PL8BOOjn8Z","date":"Fri Feb 25 17:17:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/HlqwMIirO2","date":"Thu Feb 24 18:40:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"While this administration focuses on gatekeeping capital formation opportunities, I'll be working to give Americans more access to the markets. \nhttps://t.co/U6ecy7LZuI","date":"Wed Feb 23 23:06:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The @MNFFA has developed and inspired generations of agriculture leaders in our state.\n\nAs we celebrate #FFAWeek I am proud to support @RepMann’s efforts to recognize National FFA Week. https://t.co/GZLCZcokB6","date":"Wed Feb 23 19:10:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I had the opportunity to tour @atsusadotbiz. It is always a pleasure to speak with community leaders and hear how Congress can continue to support small business. https://t.co/CG4py2LM7z","date":"Wed Feb 23 17:24:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"With inflation reaching 40 year highs, it’s no surprise consumers aren’t confident in Biden’s economy.\nhttps://t.co/lLYXbJGUlw","date":"Wed Feb 23 16:02:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"“Among the men who fought on Iwo Jima, uncommon valor was a common virtue” —Admiral Chester W. Nimitz \n\nOn this day in 1945, U.S. service members raised our flag on Mt. Suribachi. https://t.co/sglKKOZbpv","date":"Wed Feb 23 14:30:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI\n\n“The United States of America needs to recognize that much like the Internet, you need to get out of the way and let the innovators do what they do best: creating and growing new opportunities.” \n\nListen to my discussion with @APompliano here: https://t.co/qVuovyMzko","date":"Tue Feb 22 21:59:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I was proud to sponsor @RodneyDavis legislation to make the Tax Cuts and Jobs Act permanent.","date":"Tue Feb 22 20:29:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Tax Cuts and Jobs Act brought much needed relief to Minnesotans.\n \nIt created opportunity for American business to thrive and made us competitive in the world economy.\n\nIt is past time for Congress to make these tax cuts permanent.\nhttps://t.co/d0PmpOwDYf","date":"Tue Feb 22 20:29:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, I had the chance to ‘jump in the cab’ with Long Haul Trucking and @mntruck!\n\nTruckers keep our shelves stocked and our economy moving, and I’m grateful to them. https://t.co/1wlXlNcKet","date":"Tue Feb 22 18:38:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On this day in 1980, as the world watched, a group of young athletes helped us all believe in miracles again. https://t.co/Iq7gGE9n4M","date":"Tue Feb 22 16:45:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"\"There are things I never would have thought of before, but now with the price increases... it all is adding up”\n\nMinnesotans are feeling the sting of @HouseDemocrats inflation crisis.\nhttps://t.co/ZWbIqhxxFF","date":"Tue Feb 22 14:44:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Presidents' Day! Today, we honor the leaders that made America the greatest nation in the world. https://t.co/n4Fv7t709g","date":"Mon Feb 21 17:15:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today I joined @RepPeteStauber and @RepFischbach to honor our friend and colleague, Representative Jim Hagedorn. https://t.co/Rb6Hnh3CzQ","date":"Fri Feb 18 14:50:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news. It’s time to unmask our kids.\nhttps://t.co/UwAaoUxHgi","date":"Thu Feb 17 17:44:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"REMINDER: My telephone town hall with Local Taxpayer Advocate Wendy Rozinka is TONIGHT! https://t.co/eZJdQRCWmE","date":"Thu Feb 17 17:14:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Financial freedom is American freedom.\n\nI commend @FreedomWorks decision to highlight my legislation surrounding central bank digital currencies. https://t.co/koFYh539D7","date":"Thu Feb 17 16:25:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We received a response from SEC Chair Gensler to our 11/3/21 letter regarding BTC spot ETFs. This issue remains a priority for us and we will continue to oversee the SEC in its mission to maintain fair and orderly markets and facilitate capital formation. https://t.co/WbgSDj7o0T","date":"Thu Feb 17 15:36:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must stop the constant print-and-spend schemes in Washington D.C.\n\nInflation is a tax on every American.","date":"Thu Feb 17 15:16:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Housing prices are through the roof and demand in Minnesota is at record levels.\n\nFor those trying to build a new home, the Biden Administration’s supply chain crisis has added more than $18,000 to new home costs.\nhttps://t.co/o3J9LK7nyg","date":"Wed Feb 16 20:07:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Home heating costs are out of hand. \n\nThis is a direct result of President Biden and @HouseDemocrats’ anti-energy policies.\nhttps://t.co/96eQhM5f1V","date":"Wed Feb 16 16:46:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Violent crime rates are at record highs across the country.\n\nCrime in our major cities is out of control, all due to Democrat’s ‘defund-the-police’ rhetoric. \nhttps://t.co/9u41rfNKqr","date":"Wed Feb 16 15:09:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflated prices on seed, fertilizer, and pesticides are directly hurting Minnesota farmers. This will only lead to higher prices at the grocery store for all Americans.\nhttps://t.co/qqcFbAxhZN","date":"Tue Feb 15 18:16:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Nothing makes the case for crypto more than a government freezing bank accounts to suppress free speech…\nhttps://t.co/Ud8ZtoMy3h","date":"Tue Feb 15 15:52:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Remember when @SecYellen and @federalreserve told us their policies were working and inflation was transitory?\n\nThey were wrong.\nhttps://t.co/JveCYXvgQX","date":"Tue Feb 15 14:08:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A newly declassified report shows the Biden administration’s ‘indecisiveness’ during the Afghanistan withdrawal caused chaos and confusion resulting in the death of 13 American service members.\nhttps://t.co/1IbjzUBrUA","date":"Mon Feb 14 20:29:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I joined the @BanklessHQ podcast to discuss the future of crypto in the United States.\n\nListen here ⬇️\nhttps://t.co/iJVlhrtmsU","date":"Mon Feb 14 18:27:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Gas prices are continuing to rise across Minnesota and it’s harming low-income families the most.\nhttps://t.co/1LApx5IwvX","date":"Mon Feb 14 17:23:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As tax season continues, I am pleased to announce that I will be hosting a telephone town hall with Local Taxpayer Advocate Wendy Rozkina on Thursday at 7PM CT. https://t.co/3i5XuKjhlQ","date":"Mon Feb 14 16:46:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Valentine’s Day to my best friend and the love of my life, my wife Jacquie. https://t.co/qziOniK1B3","date":"Mon Feb 14 14:30:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Hearing loss is a serious medical condition, and improper care can cause additional harm.\n\nToday, I sent a letter to FDA Commissioner Woodcock concerning over-the-counter hearing aids.\nhttps://t.co/hVxmgdKkvc","date":"Fri Feb 11 20:04:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Your Super Bowl party is going to cost a lot more this year.\nhttps://t.co/89nDGYBAg7","date":"Fri Feb 11 19:04:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Very disturbing report from the Senate Intelligence Committee.\n\nThis warrantless surveillance of American citizens must end.\nhttps://t.co/X4d4rpj66m","date":"Fri Feb 11 16:04:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks to the Biden Administration’s anti-energy stance, fuel and home heating prices are running wild. https://t.co/WerUk4ms0I","date":"Fri Feb 11 15:02:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation continues to run out of control. When will @HouseDemocrats learn that we can’t spend our way out of this crisis?\nhttps://t.co/ORF8t8UzeM","date":"Thu Feb 10 19:40:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Fentanyl has accounted for 64% of all U.S. overdose deaths. \n\nToday, I joined @RepBryanSteil urging President Biden to confront the fentanyl epidemic plaguing our country. https://t.co/Hvf4rSOLFu","date":"Thu Feb 10 17:50:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation surges 7.5% over the past year, the highest levels of inflation since 1982! \n\nAmericans continue to have their hard-earned paychecks eroded by Biden’s inflation crisis.\nhttps://t.co/yK1gjwUsI7","date":"Thu Feb 10 14:07:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Community Outpost Outreach and Engagement Act, which I introduced, will expand funding for these outposts nationwide to foster relationships between law enforcement and the communities they serve.","date":"Wed Feb 09 19:44:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wonderful to see Waite Park considering adding a COP House to the community!\n\nThese locations allow for increased police-citizen interaction, build mutual respect, and allow for collaboration within the community. \nhttps://t.co/WQmgSR6s6N","date":"Wed Feb 09 19:42:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Record numbers of small businesses are being forced to raise prices on consumers to offset Biden’s inflation crisis.\nhttps://t.co/R4pi0brXg5","date":"Wed Feb 09 18:17:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden is attempting to distance himself from the @HouseDemocrats ‘defund the police’ rhetoric.\n\nThe American people won’t forget.\nhttps://t.co/LlvfBK8s2a","date":"Wed Feb 09 17:00:31 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration is now allowing illegal immigrants to fly into the interior of the United States using their arrest warrants as identification. \nRidiculous.\nhttps://t.co/WtJugcZFfP","date":"Wed Feb 09 15:45:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More evidence that the Biden administration’s failure in Afghanistan didn’t have to happen.\n\nA preventable tragedy.\nhttps://t.co/SGYjLyciMn","date":"Tue Feb 08 21:58:45 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The report: \n\n❌Doesn't provide a definition for stablecoin\n❌Asserts that both bank-like products &amp; investment-like products could be stablecoins\n❌Abuses this ambiguity to ask Congress to lump these assets together &amp; hand them solely to the banks\n\nI'm not on board with that.","date":"Tue Feb 08 19:55:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I discussed the President’s Working Group Report on stablecoins' dangerous lack of nuance. See my remarks here⬇️\nhttps://t.co/fNK9KVNjth","date":"Tue Feb 08 19:55:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A new bipartisan report finds that Mexico is now the dominant source of fentanyl in the United States.\n\nIn 2021, US drug overdoses surpassed 100,000 for the first time ever.\n\nWe must stop the flow of these poisonous drugs into our county.\nhttps://t.co/bjMXUFbpco","date":"Tue Feb 08 17:08:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We have seen inflation impact every sector of our economy – this time its fruits and vegetables.\n\nProduce essentials have doubled in price during the past year.\nhttps://t.co/RYa4qHKPXh","date":"Tue Feb 08 14:16:18 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Biden’s anti-energy policies have led to yet another week of increased gasoline prices. https://t.co/zr2mRIiiGM","date":"Mon Feb 07 21:50:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Good to give Americans more access to the digital asset ecosystem through the traditional markets. \nhttps://t.co/Hz6s0z7cfa","date":"Mon Feb 07 19:26:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more here➡️\nhttps://t.co/zJj4HUUYEf","date":"Mon Feb 07 19:05:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For the more than approximately 20% of inmates in our nation’s jails with mental illness and substance use disorder, treatment isn’t a luxury, it’s a necessity. \n\nThe Due Process Continuity of Care Act will ensure that pre-trial inmates have access to potentially lifesaving care. https://t.co/FDW0wonfC8","date":"Mon Feb 07 19:05:34 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I urged the House of Representatives to take action on inflation, a crisis impacting every American.\n\nView my remarks here: https://t.co/uLCmF1TwqX","date":"Mon Feb 07 17:48:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats continue to cling to ‘defund the police’ rhetoric—even after a record year of law enforcement deaths. Sickening.\nhttps://t.co/Yi5WmNWziD","date":"Mon Feb 07 16:50:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Out of control government spending has led to soaring inflation.\n\nWhether you agree with me or not, we owe it to the American people to address this problem.\nhttps://t.co/xF3b1mmlJu","date":"Mon Feb 07 15:33:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Birthday to my son Billy! Your mom and I are so proud of the man you have become! https://t.co/8gemBZtkc5","date":"Sun Feb 06 14:58:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It’s not about ethical or responsible mining. It’s all posturing. The Biden Administration would rather have the rare earth metals in your tech be mined by children. https://t.co/St7VpP7jit","date":"Fri Feb 04 20:29:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A license to report is not a get-out-of-jail-free card. So why is @POTUS acting like it? \n\nYesterday, I joined my colleague @RepBenCline expressing concern over the Biden Administration’s dangerous ‘catch-and-release’ policy. Read more here: \nhttps://t.co/xZgHcLAFmC","date":"Fri Feb 04 19:01:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Birthday to the @the_USO. Thank you for all you do to support our men and women in uniform!","date":"Fri Feb 04 18:46:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden Administration’s failure in Afghanistan cost 13 American service members their lives and cost the taxpayers BILLIONS of dollars.\nhttps://t.co/B3UWXYaJZt","date":"Fri Feb 04 16:32:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today's jobs report is no credit to President Biden's disastrous economic agenda. \n\nOn Monday, the White House was managing expectations for what they were sure would be more losses. \n\nThey were prepared to fail as they always do.\nhttps://t.co/BsT8Ln2N7d","date":"Fri Feb 04 15:34:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, on #WorldCancerDay we remember those who have survived, those who are still fighting, and those who have lost their lives to this horrific disease. https://t.co/4fdflQvNyR","date":"Fri Feb 04 14:11:24 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Good luck to all the @TeamUSA athletes competing in the Olympics.\n \nWord to the wise - Do. Not. Accept. Any. Digital. Yuan.","date":"Fri Feb 04 00:31:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every day, I hear from my constituents regarding increased fuel and energy prices. The Biden administration's anti-energy stance is directly harming American families. https://t.co/3PcviGr91x","date":"Thu Feb 03 21:08:26 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We should logically be able to use crypto for everyday, small dollar transactions. Our tax code shouldn’t complicate that. Proud to support @RepDelbene’s very commonsense bill. https://t.co/FMHs5UX6Xz","date":"Thu Feb 03 17:44:44 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Overdose deaths in Minnesota have nearly doubled since 2016. We must stop the flow of these poisonous drugs into our country. https://t.co/r2bX77YQ8K","date":"Thu Feb 03 15:15:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/Oh6LJsXdrn","date":"Thu Feb 03 14:08:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In Minnesota, fatal overdoses rose nearly 40% in the last year. \n\nWe must stop the flow of these poisonous drugs into our country.","date":"Wed Feb 02 20:29:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, the U.S. national debt hit $30,000,000,000,000. Our national debt continues to put our country on an unsustainable path. \n\nWe MUST reign in the out of control spending in Washington if we want America to remain an economic superpower.","date":"Wed Feb 02 17:28:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’ve introduced amendments to ensure that these massive spending packages have proper oversight. Democrats blocked them at every turn. \nhttps://t.co/uIsm8uXTRN","date":"Wed Feb 02 17:28:00 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congress has authorized $5.7 trillion in Covid related spending since early 2020.\n\nNearly $800 billion remains unspent or uncommitted. https://t.co/QhvpNM0ub5","date":"Wed Feb 02 17:27:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"And look! Supply chain issues are hitting summer activities as well.https://t.co/UKwJv5XGT7","date":"Wed Feb 02 16:03:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Supply chain issues have impacted everything from vegetables at your local grocery store to used vehicles. Now, thanks to the Biden Administration, Minnesotans are unable to enjoy some of our favorite winter activities. https://t.co/WeiS7mTICV","date":"Wed Feb 02 16:03:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"What happened today in Richfield was a tragedy. \n\nViolence is tearing our communities apart. We must empower our law enforcement to keep Minnesotans safe.","date":"Tue Feb 01 21:12:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, on the first day of #BlackHistoryMonth we celebrate and honor the achievements of Black Americans. \n\nHappy Black History Month! https://t.co/G2pYovwPaf","date":"Tue Feb 01 20:03:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats so-called ‘America Competes Act’ authorizes $8 billion for a UN climate slush fund. \n\nThis is not a bill to compete with China. \n\nIt’s a thinly veiled attempt to pass radical Green New Deal policies.","date":"Tue Feb 01 16:53:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden administration’s catastrophic economic policies caused inflation to hit 7% in 2021. \n\nIt hasn’t stopped there.\n\nInflation has now climbed to more than 8% in my district.\nhttps://t.co/09dM8N9igj","date":"Tue Feb 01 15:04:40 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Take that Wisconsin.\nhttps://t.co/OdI1LFlFGR","date":"Tue Feb 01 14:20:21 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Nice work!","date":"Tue Feb 01 00:15:02 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, The Willie O’Ree Congressional Gold Medal Act became law! I was proud to co-lead this legislation to honor Willie and finally give him the place in history he deserves! https://t.co/LSLckMpoVb","date":"Mon Jan 31 20:37:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"🏒","date":"Mon Jan 31 19:02:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Still waiting, @GaryGensler","date":"Mon Jan 03 15:14:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As the American people continue to feel the pinch at the gas pump, the Biden administration’s anti-energy agenda continues to harm working families.\nhttps://t.co/nSNhAXJFuy","date":"Mon Jan 31 18:56:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Students deserve to have their digital identities protected. Today, I sent a letter to @usedgov inquiring about the current status of student data privacy protections. \nView the letter here⬇️ https://t.co/tcM1q35o0U","date":"Mon Jan 31 17:41:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats America Competes Act gives @SecYellen the power to unilaterally block American’s digital currency payments worldwide. This is another unacceptable step toward CCP-style financial authoritarianism.","date":"Mon Jan 31 17:14:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Sounds like Jen Psaki is the one living in an alternate universe… https://t.co/LVl9HGt0U7","date":"Mon Jan 31 16:07:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Americans are more worried about inflation than any other issue. My Inflation Working Group Act will help Congress determine the root causes of the inflation impacting all of us. https://t.co/OC3ZkxUtoK","date":"Mon Jan 31 14:47:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A key inflation measure rose 4.9% from a year ago.\n\nThis is the fastest increase since 1983.\n\nInflation is a tax on all of us.\nhttps://t.co/GmuMPM5FBJ","date":"Fri Jan 28 19:25:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden administration’s incompetent border policies are a real threat to national security. https://t.co/5BCMaj2e2w","date":"Fri Jan 28 15:08:05 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My constituents are feeling the impacts of inflation from the grocery store to the gas pump, and now at reliable, low-cost dining options. Inflation is a tax on all of us.  https://t.co/gv2yopb5ot","date":"Thu Jan 27 20:57:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Another day, another baseless rejection of a Bitcoin spot ETF.","date":"Thu Jan 27 17:09:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I joined a bi-partisan group urging @SecYellen to provide clarity on reporting requirements for crypto. The United States must create an environment where this technology can continue to thrive onshore. Read our letter here: https://t.co/iKClN2OKiU","date":"Thu Jan 27 16:26:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Oil prices rose to $90 a barrel yesterday for the first time since 2014. Biden’s weak foreign policy may lead to even HIGHER energy prices. \nhttps://t.co/97QOMqNXva","date":"Thu Jan 27 15:58:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, #WeRemember the millions of innocent lives lost during the Holocaust. #NeverAgain https://t.co/ibgyXuY5NR","date":"Thu Jan 27 14:16:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Energy prices are skyrocketing. Rare earth metals are in short supply, causing widespread shortages and further disrupting supply chains. The cancellation of the Keystone Pipeline and Twin Metals mineral leases has and will continue to exacerbate these problems.","date":"Wed Jan 26 19:08:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"America should be leading the way for responsible extraction of these resources. NOT handing control to foreign competitors.","date":"Wed Jan 26 19:08:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American people continue to pay the price for the Biden administration’s stance against domestic production of critical resources.","date":"Wed Jan 26 19:08:32 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Disappointing decision from the Biden administration. Undercutting American independence on key resources and relinquishing production of critical minerals to foreign adversaries. https://t.co/uCoYpsWOfN","date":"Wed Jan 26 17:43:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American government works FOR the American people. Let’s not forget that.","date":"Wed Jan 26 17:03:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats introduced legislation that would give the Sec. of the Treasury dictatorial-level power to prohibit any transactions they deem concerning without due process. This leaves the American people powerless to hold @SecYellen accountable.","date":"Wed Jan 26 17:03:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As a member of the ALS Caucus, I am proud to see the Act for ALS become law.  Read more in the @StarTribune from @LoriLarHeller. #endALS \nhttps://t.co/FC499Jc2kd https://t.co/xcyXJiIHer","date":"Wed Jan 26 16:14:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This past weekend, the Sauk Rapids PD lost their only canine officer, Thunder.  Thunder served communities across MN6 and was a regular at local school events.  Thank you Thunder, for your service to Minnesota and CD6!\nhttps://t.co/rOCLskxqcL","date":"Wed Jan 26 14:33:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Due to Pres. Biden’s radical anti-American energy policies, analysts are predicting average gas prices will hit $4 per gallon this summer. https://t.co/GCFf6T53jW","date":"Tue Jan 25 20:17:59 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on all of us, and we finally got the bill - $3,500 per household in 2021! \nhttps://t.co/0HQF6Hz8z7","date":"Tue Jan 25 16:53:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Illegal migration causes tragedies beyond our border with Mexico. The Biden administration must secure our borders! https://t.co/hDJ6qDlmZa","date":"Tue Jan 25 15:04:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The 2022 tax filing season begins today! Here are some resources to help with filing your return⬇️ https://t.co/pWj8lwt77c","date":"Mon Jan 24 20:51:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Parents deserve a voice in their children’s education—including where they learn. I’m proud to support school choice for every family. #NationalSchoolChoiceWeek https://t.co/qBUGPAbEUQ","date":"Mon Jan 24 19:24:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, oil prices hit levels we haven’t seen since 2014. This is a direct result of the Biden administration’s disastrous energy policies. https://t.co/8HKTB0H5cZ","date":"Mon Jan 24 17:07:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, the House of Representatives passed my legislation to award Willie O’Ree with a Congressional Gold Medal. Read more about Willie and this well-deserved honor here via @StarTribune: \nhttps://t.co/jBoQvsM9GV","date":"Mon Jan 24 15:17:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"All life is sacred. Today, on National Sanctity of Life Day, we reaffirm our commitment to defend the unborn.","date":"Sat Jan 22 19:23:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today may be my favorite Minnesota holiday, @HockeyDayMN! To celebrate, here is a picture of me during my high school hockey days at St. Thomas Academy! https://t.co/90TS8O6MzY","date":"Sat Jan 22 15:45:43 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I encourage the crypto community to provide comments and feedback to the Fed by May 20, 2022.  https://t.co/NYy2SP1nEJ","date":"Fri Jan 21 18:39:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My bottom line thought on the Fed’s CBDC report: We’ve waited a long time for this opaque report. \n\nWhat this report really clarifies? The Fed seeks to fit the future of financial transactions in the US into the box of the legacy financial structure.","date":"Fri Jan 21 18:39:40 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The IRS is already forecasting massive problems for the upcoming tax season. Find tips for the 2022 filing season here: https://t.co/ZuxQTvn9L9","date":"Fri Jan 21 16:11:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reviewing.","date":"Thu Jan 20 21:33:56 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I was honored by the @FaithandFreedom  Foundation with the Friend of the Family award.  I will always stand up and defend family and individual values. https://t.co/k1iPX61YX9","date":"Thu Jan 20 18:00:25 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today marks the one-year anniversary of one-party rule in Washington. The here is what they have to show for it:\n\n❌Skyrocketing inflation\n❌Record high crime rates\n❌Immigration disaster\n❌Weak foreign policy","date":"Thu Jan 20 16:37:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, I joined @ThinkingCrypto1 to discuss my new CBDC legislation, Bitcoin spot ETF, and the future of the @BlockCaucus. Listen to the podcast here: https://t.co/oOpMQYCyq3","date":"Thu Jan 20 14:43:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I am proud to have earned an A+ on the @SBAList pro-life scorecard. I will always vote to protect the rights of the unborn and defend their right to life. https://t.co/wngcMP7Txs","date":"Wed Jan 19 20:30:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I was proud to co-lead this legislation to honor Willie with the Congressional Gold Medal, and finally give him the place in history he deserves. https://t.co/arwaWxZC2f","date":"Wed Jan 19 19:19:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@NHL After his career on the ice, he continued his work to grow the game.  Willie became the NHL’s Diversity Ambassador, where he established the Hockey Is For Everyone initiative.  In partnership with this program, the @MNWild has been able to introduce 100 kids to the game. https://t.co/o2HZ2psSeo","date":"Wed Jan 19 19:15:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Despite the challenges Willie faced on and off the ice, he spent more than 24 seasons as a professional hockey player. Due to his incredible achievements, he was inducted into the Hockey Hall of Fame in November 2018. Photo credit @NHL. https://t.co/EZBsk0TmGY","date":"Wed Jan 19 19:15:03 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In 1958, Willie O’Ree was called up from the minors to play for the Boston Bruins, becoming the first black player in @NHL history. Today, the House of Representatives passed our bill to honor him with the Congressional Gold Medal. https://t.co/SYLX6AOwQ4","date":"Wed Jan 19 19:14:29 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/BBT9eqLQTr","date":"Wed Jan 19 16:47:16 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Concerning to see OCC Comptroller Hsu stipulating away the pro-innovation strides made w/ @BrianBrooksUS. Keeping our banking systems from utilizing blockchain-based payment rails is a huge mistake with drastic consequences for the American people and US economic competitiveness.","date":"Wed Jan 19 16:47:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, FEMA will be holding a briefing on their Youth Preparedness Council. This is a great opportunity for high school students to get involved in their community and learn more about FEMA emergency management. Learn more here: https://t.co/Tit2Zki8kj","date":"Wed Jan 19 15:22:37 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Hockey is for everyone.  Thank you Willie, for all the work you have done to grow the game of hockey. https://t.co/Xbi7V4IEZh","date":"Wed Jan 19 14:16:20 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation wiped out MONTHS of pay from the average worker in 2021. \nhttps://t.co/axiBrVn9Ie","date":"Tue Jan 18 19:19:35 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Rampant inflation is killing small businesses across the country! \nhttps://t.co/2yEsf7DY8O","date":"Tue Jan 18 17:08:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Almost there. Looking forward to the vote on the Willie O’Ree Congressional Gold Medal Act this week!\nhttps://t.co/lTgRp0MeMU","date":"Tue Jan 18 14:43:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, on Martin Luther King Jr. day, we remember the life and legacy of the great civil rights icon. https://t.co/13U5LwwSsi","date":"Mon Jan 17 15:09:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This Religious Freedom Day, we reflect on just how hard-won our right to worship is—and why we cannot allow it to be eroded.","date":"Sun Jan 16 15:13:51 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a tax on all Americans, but it’s hitting working families the hardest. https://t.co/kWRm2k3Z5n","date":"Sat Jan 15 19:24:21 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wholesale prices are through the roof, rising nearly 10% in 2021. It is beyond clear this inflationary crisis is NOT transitory.\nhttps://t.co/bogK9gFWIr","date":"Fri Jan 14 20:31:42 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Searching for a Covid test? Having difficulty finding one? Last year, the Biden administration redirected more than $850 million intended to expand testing to housing for illegal immigrants. \nhttps://t.co/yBY7zDmDKI","date":"Fri Jan 14 18:05:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The State of Hockey is sending 13 skaters to the Winter Olympics this year. More than any other state!","date":"Fri Jan 14 16:29:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news! This #SCOTUS decision is victory for our constitution &amp; rule of law.","date":"Thu Jan 13 22:19:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Due to Biden’s anti-American-energy policies, 20% of Americans couldn’t pay their energy bills in 2021. https://t.co/pasL5X7AsM","date":"Thu Jan 13 21:50:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yes I am.","date":"Thu Jan 13 20:00:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I joined the @NatResources forum on Minnesota Mining and American Potential.  I was great to discuss these important economic issues with my colleagues @RepPeteStauber and @RepFischbach. https://t.co/zU24dpYFt2","date":"Thu Jan 13 19:49:49 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Willie O’Ree is a living legend.  As a lifelong hockey fan, player, and coach I am proud to co-lead legislation to honor Willie with the Congressional Gold Medal and give him the place in history he deserves. I’m excited to see this legislation meet this important threshold!","date":"Thu Jan 13 18:46:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"https://t.co/Uc8KOUoCF5","date":"Thu Jan 13 18:46:19 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"83% of American workers say their pay hasn’t kept up with inflation! Biden’s inflation crisis is destroying Americans' budgets and their ability to save for the future.https://t.co/1ZTERmIgQR","date":"Thu Jan 13 17:32:13 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I think it’s very obvious that one of the main drivers of inflation has been runaway government spending over the past year, which has pumped trillions of new dollars into the U.S. economy – despite our $30T debt.","date":"Thu Jan 13 15:14:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The American people deserve solutions. I’ve introduced a bill that will establish a bipartisan congressional working group on inflation, which will determine what is driving the dramatic price increases working Americans are seeing at the supermarket and the gas pump.","date":"Thu Jan 13 15:14:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"But regardless of whether you agree with me or not, let’s at least talk through the issue. I’d welcome a debate: we owe that to the American families across the country who are feeling the pinch.","date":"Thu Jan 13 15:14:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The number one concern I am hearing from constituents is skyrocketing prices. Yet, we dedicate far too little attention to this issue in Congress. https://t.co/Jsxc3HR07S","date":"Thu Jan 13 15:14:53 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Glad my staff was able to meet with @MNcounties President Todd Patzer today to discuss their 2022 priorities! https://t.co/3r3L4iIGVL","date":"Wed Jan 12 20:51:01 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last year, I joined a bipartisan letter to Ambassador Tai urging her to address the long-standing market access barriers in India. https://t.co/tMvXwcxsnl","date":"Wed Jan 12 17:09:52 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news for Minnesota’s over 3,000 pork producers who have been weighed down by these tariffs! The Indian government has agreed to allow imports of U.S. pork and pork products! https://t.co/c7GffGI5mO","date":"Wed Jan 12 17:09:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations to MN Farm Bureau President Dan Glessing on being elected to the @FarmBureau Board of Directors!\nhttps://t.co/pcfE6g2B55","date":"Wed Jan 12 16:20:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Simply put, we must prioritize blockchain technology with American characteristics, rather than mimic China’s digital authoritarianism out of fear.","date":"Wed Jan 12 15:23:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Any CBDC implemented by the Fed must be open, permissionless, and private. This means that any digital dollar must be accessible to all, transact on a blockchain that is transparent to all, and maintain the privacy elements of cash.","date":"Wed Jan 12 15:23:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In order to maintain the dollar’s status as the world’s reserve currency in a digital age, it is important that the United States lead with a posture that prioritizes innovation and does not aim to compete with the private sector.","date":"Wed Jan 12 15:23:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Requiring users to open an account at the Fed to access a United States CBDC would put the Fed on an insidious path akin to China’s digital authoritarianism.","date":"Wed Jan 12 15:23:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Not only does this CBDC model raise “single point of failure” issues, leaving Americans’ financial information vulnerable to attack, but it could be used as a surveillance tool that Americans should never be forced to tolerate from their own government.","date":"Wed Jan 12 15:23:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As other countries, like China, develop CBDCs that fundamentally omit the benefits and protections of cash, it is more important than ever to ensure the United States’ digital currency policy protects financial privacy, maintains the dollar’s dominance, and cultivates innovation.","date":"Wed Jan 12 15:23:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"CBDCs that fail to adhere to these three basic principles could enable an entity like the Federal Reserve to mobilize itself into a retail bank, collect personally identifiable information on users, and track their transactions indefinitely.","date":"Wed Jan 12 15:23:07 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced a bill prohibiting the Fed from issuing a central bank digital currency directly to individuals. Here’s why it matters: https://t.co/S7pQ5rVc6n","date":"Wed Jan 12 15:16:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Highest inflation numbers since 1982, Biden’s inflation crisis remains out of control!\nhttps://t.co/RmTfotgJlV","date":"Wed Jan 12 14:21:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with you Chris!","date":"Tue Jan 11 21:12:04 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news for Minnesota mining!\nhttps://t.co/BMD25j4PqZ","date":"Tue Jan 11 19:02:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Read more on how to help stop human trafficking in your community here: https://t.co/qAB9kc2538","date":"Tue Jan 11 17:49:11 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This #HumanTraffickingAwarenessDay, we can come together to save victims of #HumanTrafficking hidden in plain sight. If you suspect a case of human trafficking call the @DHSBlueCampaign Human Trafficking Hotline at 1-888-373-7888. https://t.co/hMFtoSd8vo","date":"Tue Jan 11 17:49:10 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden administration claimed their $1.9 trillion American Rescue Plan would create 4 million new jobs in 2021.\n\nIt didn’t deliver jobs. Not a single one. \nhttps://t.co/tlIQZfzwTP","date":"Tue Jan 11 16:41:46 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"New digital currency legislation coming soon👀","date":"Tue Jan 11 15:26:39 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Did you know that the official state drink of Minnesota was milk? On #NationalMilkDay I want to thank our state’s producers for their hard work stocking our shelves with nearly 10 billion pounds of milk per year! https://t.co/ShTiKvDHg6","date":"Tue Jan 11 14:23:12 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"During the previous administration, America achieved energy independence for the first time in nearly 70 years. Those days are long gone. Biden’s anti-energy agenda is directly harming Americans!\nhttps://t.co/1KyJwdiSLQ","date":"Mon Jan 10 22:56:09 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations to the growing Waltz family!","date":"Mon Jan 10 22:23:14 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Where are the tests, Mr. President?","date":"Mon Jan 10 20:01:28 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Glad to see my colleagues, @PatrickMcHenry and @SenToomey, working to rein in Gensler’s attempts to hinder U.S. leadership in blockchain technology and digital currency.","date":"Mon Jan 10 16:47:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler continues to show his true colors. By shortening the comment period on new SEC rules, he is attempting to avoid public accountability. We won't let him.","date":"Mon Jan 10 16:47:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota students need to be in their classrooms with their teachers. \nhttps://t.co/kUnOMA8pcs","date":"Mon Jan 10 15:42:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesotans, as you make your way to work or school this morning, make sure to bundle up! @NWS is predicting wind chills of -40!","date":"Mon Jan 10 14:24:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over the past year, our law enforcement officers have faced mass hostility, budget cuts and increasing crime.  This Law Enforcement Appreciation Day I thank all the brave men and women who stand in harms way to keep us safe. https://t.co/gs0yb3wHxB","date":"Sun Jan 09 15:17:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The senseless violence in our major cities is a direct result of Democrats anti-law enforcement rhetoric. Giving violent criminals a free pass was never the answer. It must end. https://t.co/0VQP69Ora8","date":"Fri Jan 07 21:12:57 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Less than HALF of expected jobs were created in December.\n\nInflation remains out of control.\n\nBiden has no plan for the economy.\nhttps://t.co/XktsynPEdj","date":"Fri Jan 07 15:46:08 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It was great to meet with President Fenner of the Waconia Chamber of Commerce earlier this week! https://t.co/VNdOOQdUqE","date":"Thu Jan 06 21:36:36 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I spoke @CES on the future of crypto regulation in the United States! #CES2022 [Photo credit: Consumer Technology Association] https://t.co/VIewepjYVv","date":"Thu Jan 06 19:44:38 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, I had the chance to visit The Goddard School in Blaine. Childcare services are invaluable to working families, but over the past two years many have struggled to stay afloat. Thanks to Mike Sokol and the Goddard School team for welcoming me! https://t.co/gQaCw4S7Fz","date":"Thu Jan 06 15:37:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Ready to file your tax return? You may be interested in attending a Pre-Filing Season Awareness virtual event hosted by Minnesota’s IRS Taxpayer Advocate! You can find more information here – https://t.co/Ap9EG7vAdv","date":"Wed Jan 05 20:06:33 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wage gains are being eroded &amp; erased by Biden’s inflation crisis. Every working American is having their livelihood chipped away. \nhttps://t.co/UEKDkIOgiF","date":"Wed Jan 05 17:04:17 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I want to thank SCFD Battalion Chief Jerry Raymond for his 22-years of service to the department and community of St Cloud. Congratulations on your retirement! https://t.co/vp2jhR5oL2","date":"Wed Jan 05 15:38:27 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Call your Representative and tell them to join the Blockchain Caucus. \n\nwagmi","date":"Wed Jan 05 14:12:23 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I visited the North Memorial Air Ambulance Base in Princeton. Incredible to see the life-saving work that our first responders do every day! https://t.co/GCdiiKIRWF","date":"Tue Jan 04 22:20:30 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last year I led a letter with @RepFischbach, @RepPeteStauber &amp; @RepHagedorn to U.S. Trade Representative Tai expressing concerns about Canada bending rules to unfairly benefit its dairy industry at the expense of U.S. producers. https://t.co/qeSmBuzrBj","date":"Tue Jan 04 20:53:55 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news for Minnesota dairy farmers!","date":"Tue Jan 04 20:53:54 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This morning, I sat down with President of VFW Post 8731, Ron Vaughn. We had a great discussion on the issues facing Minnesota Veterans. https://t.co/LZXsaqWp0x","date":"Tue Jan 04 19:20:50 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"After a year when inflation hit nearly 40-year highs – everyone is feeling the squeeze of this crisis. https://t.co/qdNdaMmF1B","date":"Tue Jan 04 17:18:41 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI: The Accelerating Access to Critical Therapies for ALS was recently signed into law. I was proud to co-sponsor @SteveScalise and @cathymcmorris impactful legislation that will provide access to promising treatments for people battling ALS!","date":"Tue Jan 04 15:02:58 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Chair McWilliams led the FDIC with integrity, and I’m gravely concerned about the independence of the agency now that @chopracfpb and President Biden have taken the reins. Hopefully they’ll do the right thing and prioritize financial innovation over cronyism.","date":"Mon Jan 03 21:00:22 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Going into 2022, Americans will continue to feel the effects of Biden’s anti-energy policies at the fuel pump. https://t.co/4nXdJ1Z2sn","date":"Mon Jan 03 18:02:06 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Still waiting, @GaryGensler","date":"Mon Jan 03 15:14:15 +0000 2022","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"That said, we still have foundational questions to answer. What digital assets are securities/commodities/currency? Lots to figure out, but we have all of 2022 to gear up for it so we can pass critical legislation when the agenda and priorities change after the midterms.","date":"Fri Dec 31 20:56:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This Congress, I put pressure on our regulators on everything from crypto tax to BTC ETFs to crypto accounting standards and much more.\n \nThere's a lot of work to be done, and a focus on stablecoins, CBDCs, BSA/KYC, mining, and tax will be top of mind for Congress.","date":"Fri Dec 31 20:56:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Bipartisanship for all bills is key. \n \nBut Congress has two primary jobs: 1) legislating. 2) holding regulators accountable (some folks at the SEC come to mind). Bills are hard to pass, so holding regulators accountable is just as important of a job, if not more.","date":"Fri Dec 31 20:56:26 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"3. @CongressmanGT 's bill, the Digital Commodities Exchange Act, gives the CFTC the authority to regulate crypto spot markets.\n4. And finally, a SEC token safe harbor bill that takes an issuer from issuance to decentralization. McHenry has one that mimics Hester's proposal","date":"Fri Dec 31 20:56:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"1. McHenry's Keep Innovation in America Act - this is a good fix for the crypto pay-for in the infrastructure bill. \n2. My bill, the Securities Clarity Act - helps determine when a token is offered as part of a securities contract or not.","date":"Fri Dec 31 20:56:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"But, we have yet to see anything pass out of Congress and get signed into law. We will very likely see this change after the midterms, so it's more important than ever to start preparing our agenda for the next term.","date":"Fri Dec 31 20:56:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Now for a recap of what's been done:\n\nIn 2021, Congress introduced 35 crypto bills. There are several bipartisan, industry supported proposals on the table. I have introduced three bipartisan crypto bills and have cosponsored many more. https://t.co/27EF5nHdf6","date":"Fri Dec 31 20:56:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"4. Industry: Many incredible organizations educate Members + their staff. There are three keystone groups: @coincenter (a think tank), @BlockchainAssn and @DigitalChamber. More groups are coming on the scene to represent crypto interests. We are immensely grateful to all.","date":"Fri Dec 31 20:56:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"3. Senate Banking + Finance Committees: In wake of the Infrastructure bill fiasco and misguided crypto tax amendment, key members on these committees spoke out and supported legislative fixes. This helped identify members willing to lead on crypto in the Senate.","date":"Fri Dec 31 20:56:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler, I’m still waiting on your response to our Nov. 3 letter asking you to make sense of why Bitcoin futures ETFs are allowed to trade but not Bitcoin spot ETFs.","date":"Fri Dec 03 19:08:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This may lead some to think crypto policy is becoming partisan - it is not. Education is key to orange pilling, and FSC's last crypto hearing reaffirmed that crypto is very much still nonpartisan.","date":"Fri Dec 31 20:56:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"2. @FinancialCmte: Congress can't ignore crypto anymore. @PatrickMcHenry prioritized crypto policy for Republicans on the Committee. Maxine Waters, the Chair, followed suit to some degree, but Ds typically lean skeptical for investor protection and environmental reasons.","date":"Fri Dec 31 20:56:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Let's start with the different actors on the Hill moving crypto policy:\n \n1. @BlockCaucus: We're a group of 40+ Republicans &amp; Democrats who work together to advance a commonsense regulatory approach for web3. The Caucus's support has become instrumental to advancing web3 policy.","date":"Fri Dec 31 20:56:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I've been co-leading the bipartisan Blockchain Caucus with @RepDarrenSoto. As 2021 wraps up, I wanted to update you on the Caucus, my work and what we need to accomplish in 2022 to support crypto and web3 innovation in the US.","date":"Fri Dec 31 20:56:12 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Even while navigating this year's COVID restrictions, speaking to my constituents directly was a major priority. I was proud to be able to host 8 town halls in the first half of the 117th Congress! https://t.co/NQIWfZvWNS","date":"Fri Dec 31 17:18:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Even when 60% of the world’s Bitcoin mining was forced out of China, the network remained reliable. This technology is capable of so much—if we let it. https://t.co/uVMtY0xHal","date":"Thu Dec 30 13:44:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In the first half of the 117th Congress, my office has secured more than $8 million for Minnesota’s 6th District! https://t.co/UZpYIhjdYR","date":"Thu Dec 30 13:37:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In the first half of the 117th Congress, I have authored and introduced 27 pieces of legislation, covering everything from protecting taxpayer privacy to addressing the opioid epidemic. https://t.co/2dBR4swXUP","date":"Wed Dec 29 13:54:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As 2021 draws to a close I’m proud of all we were able to accomplish this year. Click below to read about my office’s work this year and stay tuned to hear about some highlights. https://t.co/0V2NNywoOr","date":"Tue Dec 28 16:41:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"mc 🎄🎅🏻","date":"Sat Dec 25 23:10:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"May you all have a Merry Christmas! Jacquie and I hope your day is full of family, friends, and joy. Read below for a Christmas message ⤵️ https://t.co/vKKZxXSezV","date":"Sat Dec 25 14:21:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Biden’s inflation crisis is causing real impacts on Americans this holiday season. President or the Grinch? https://t.co/Zt5CHwkQuy","date":"Wed Dec 22 21:48:45 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Recently, I sat down with @PerianneDC at The Takeover @RealVision Conference to discuss the future of crypto and web3. You can view our conversation here - https://t.co/rrylBehjki","date":"Wed Dec 22 19:59:47 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Skyrocketing prices are a reflection of supply chain bottlenecks, labor shortages and the inflation ALL caused by the Biden administration!\nhttps://t.co/vY9CzXiDzB","date":"Wed Dec 22 18:46:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wishing a very Happy Birthday to my son, Joe! Your mother and I are so blessed to be your parents, and we hope your year is filled with happiness and success. https://t.co/paVBdcvgbI","date":"Wed Dec 22 15:43:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I have seen firsthand the great work that Anna Marie’s Alliance does. I applaud these @SCTCC students for supporting such an impactful organization!\nhttps://t.co/0YZQqpMsHl","date":"Wed Dec 22 14:45:37 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks, Gary, for protecting investors from crypto, the best performing asset class on the market. You are really helping Americans buy homes, save for college, and plan for retirement.","date":"Tue Dec 21 19:23:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Many families are struggling this holiday season, wonderful to see so many in our community working to make things a little easier. https://t.co/bLFlPUiLUy","date":"Tue Dec 21 16:05:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Commissioner Roisman has been a dependable voice in the @SECGov for rational investor protection without impeding growth. Thank you Elad for your service to the American people.","date":"Mon Dec 20 21:57:12 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This weekend, Sen. Manchin said NO to Biden’s socialist Build Back Broke agenda. The American people agree- this bill is a disastrous spending spree.\nhttps://t.co/BMaifS91zQ","date":"Mon Dec 20 20:52:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Learn more about the program here https://t.co/67xAJX7z0j","date":"Mon Dec 20 18:01:54 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to see the U of M and Stearns County providing opportunities for women to enter the agriculture field!\nhttps://t.co/0ztzFKpiTx","date":"Mon Dec 20 17:56:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yet another clear indication that the inflation we are experiencing is NOT transitory.\nhttps://t.co/jl6LOaNl3z","date":"Mon Dec 20 16:20:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Heartbroken to hear about the passing of Lori McClintock. Jacquie and I will be keeping the entire McClintock family in our thoughts tonight.","date":"Mon Dec 20 03:01:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Parents deserve to have a say in what is taught in their child’s classrooms and should not be excluded from providing their input. That is why I was proud to co-sponsor the Parents Bill of Rights Act. https://t.co/DrbZwbir1H","date":"Fri Dec 17 17:39:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Chemical abortion has led to a surge in ER visits and life-threatening complications for mothers. This is a very disappointing decision coming from the FDA.\nhttps://t.co/e2WcianG6v","date":"Fri Dec 17 15:54:11 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More than 65% of Americans are experiencing financial hardship due to Biden’s inflation crisis. They also know that his Build Back Broke plan will make the crisis worse.\nhttps://t.co/GfUB7FCiAT","date":"Thu Dec 16 18:47:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota businesses are being hammered by the Biden Administration’s disastrous supply chain issues.  \nhttps://t.co/gWQJrmFfTM","date":"Thu Dec 16 17:28:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Sad to see the real-world consequences of Democrats’ anti-law enforcement rhetoric. However, I am far more concerned about elderly Minnesotan’s ability to afford basic essentials in Biden’s economy.\nhttps://t.co/TTDJxXIvjH","date":"Thu Dec 16 14:22:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The “defund the police movement” has led to all-time high murder rates across the country. Enough is enough. https://t.co/q466NI8uo9","date":"Wed Dec 15 18:33:09 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesotans, the @NWS is predicting unseasonably severe weather today.  Be sure to monitor local news and seek shelter if necessary. Stay safe!","date":"Wed Dec 15 17:32:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For 130 years, our great nation continues to grant its citizens unalienable rights. It is with great pride to recognize the anniversary of the day our Bill of Rights was ratified. #BillofRightsDay","date":"Wed Dec 15 15:02:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Bad take.","date":"Wed Dec 15 00:31:08 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wonderful to meet with my friend Dan Glessing today.  He has been doing a fantastic job as the new President of @MNFarmBureau and I look forward to his continued leadership! https://t.co/vIduMf99BM","date":"Tue Dec 14 22:44:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"45% of Crypto investors gave $1,000 or more to charity in 2020. At a time when charities are really struggling, we must continue to foster innovation that allows people to give back. https://t.co/1qm8aC0oLO","date":"Tue Dec 14 20:50:43 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to see Minnesotans supporting small businesses this holiday season. But remember - small businesses rely on supply chains too. The longer this crisis persists, the worse it will be for all of us.\nhttps://t.co/Rrhz9CntpJ","date":"Tue Dec 14 15:04:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The legacy of the Abraham Accords continues! This is great news for the United States &amp; our partners in the region.  \nhttps://t.co/IHzEnmoaGp","date":"Mon Dec 13 21:35:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Rising prices are out of control. Democrats control the House, Senate and the White House—where is their plan? \nhttps://t.co/Gile7FENQi","date":"Mon Dec 13 19:02:28 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a TAX on all Americans, and nearly 70% of them disagree with Biden’s handling of the current crisis.\nhttps://t.co/OkQ9lak8z9","date":"Mon Dec 13 15:35:30 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wishing a Happy Birthday to the @NationalGuard! Minnesota is honored to be home to a thriving @MNNationalGuard who serve this country at home and around the world. Thank you for your dedication.","date":"Mon Dec 13 13:42:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This report confirms what we always knew. The Build Back Broke plan will bury Americans in debt for generations.\nhttps://t.co/MsAoJBmbne","date":"Fri Dec 10 19:20:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is a TAX on every American, but it hits working families the hardest. \nhttps://t.co/05KFmuzJRA","date":"Fri Dec 10 19:06:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats’ radical “defund the police” strategy has caused a massive shortage of law enforcement officers across the country. We MUST support those who put their lives on the line to keep our communities safe.https://t.co/QQ1OjAcuSY","date":"Fri Dec 10 17:28:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Hugely disappointing inflation figures yet again. Prices are at a nearly 40-year high—when will it be enough for Democrats to take action? \nhttps://t.co/wUEaMqqDOP","date":"Fri Dec 10 15:41:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Looking forward to this great addition to the @MNMilMuseum at Camp Ripley! https://t.co/SbgFuXxdsZ","date":"Thu Dec 09 18:18:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"That is why I’m proud to have recently introduced the Advancing and Promoting Programming (APP) Act to streamline federal resources &amp; ensure the next generation of developers stay competitive. Read more here: https://t.co/EN2EV1SlXA","date":"Thu Dec 09 14:51:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Computer Science Education Week is the perfect opportunity to foster STEM skills from a young age. I’m impressed with pivotal work the schools in #MN06 do to encourage enthusiasm in pursuing STEM education.","date":"Thu Dec 09 14:51:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A light touch regulatory approach will allow the crypto industry to grow and thrive in the United States!\nhttps://t.co/bneCP4Y9KG","date":"Wed Dec 08 23:06:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thank you @SBF_FTX for discussing the efforts FTX and other exchanges take to ensure sound spot markets.","date":"Wed Dec 08 21:46:02 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"How does the SEC’s concern over spot market vulnerability apply to spot ETFs when it doesn’t apply to futures ETFs? Both get 100% of their price discovery from the spot market.","date":"Wed Dec 08 21:45:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today in @FinancialCmte, I asked @SBF_FTX about the extensive guardrails in place protecting crypto spot markets from fraud and manipulation. The SEC cites this concern as the reason they are barring access to Bitcoin spot ETFs. See my remarks here: https://t.co/v3WRWQOJ4y","date":"Wed Dec 08 21:45:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crypto is facilitating Web 3.0, which gives Americans ownership over their digital lives so Big Tech can’t continue to profit off of Internet users. I’ve been working on these issues since 2015 on the @financialcmte and as co-chair of the @blockcaucus.","date":"Wed Dec 08 15:52:58 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Crypto isn’t a passing fad, it’s a legitimate financial tool used by millions. At this morning’s hearing, I hope my colleagues in @FinancialCmte will join me in demanding regulatory clarity for crypto. https://t.co/jtAsI9o5Sa","date":"Wed Dec 08 15:32:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to see investments in the next generation of our state’s workforce. I’m proud of the work that @StCloudState is doing to address this serious issue. \nhttps://t.co/l7k5xSObat","date":"Wed Dec 08 14:12:11 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Saule Omarova’s radical and communist views on America’s free market clearly disqualified her for the position of Comptroller of the Currency. Glad to see she’s come to the same conclusion. https://t.co/vbXOC5cAvl","date":"Tue Dec 07 23:16:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to lead this bipartisan, bicameral legislation to honor three Minnesota heroes!\nhttps://t.co/VVHIHxdm5Y","date":"Tue Dec 07 22:37:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"There have been more than 1.7 million border apprehensions in FY2021 ALONE. ‘Border Czar’ Harris has no plan to address this massive crisis and still has not visited the border. https://t.co/SUYAziZ2OL","date":"Tue Dec 07 20:09:41 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Make no mistake- Democrats don’t care about fighting for working Americans.  They just want to use them as their personal piggy banks.","date":"Tue Dec 07 18:59:48 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Meanwhile, the IRS has massive backlogs and can’t even process the information they already have. And yet, less than 3% of that funding will go to taxpayer advocacy.","date":"Tue Dec 07 18:59:30 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In their latest spending spree, @HouseDemocrats are trying to give the IRS $80 BILLION more in funding, giving the IRS more enforcement agents than the Pentagon","date":"Tue Dec 07 18:59:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I joined @tothestoics on @DWealthMuse to discuss the future of crypto &amp; blockchain opportunities in the U.S.\nhttps://t.co/VPn6ZdiJ7u https://t.co/4uzGQ3qOz6","date":"Tue Dec 07 17:40:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Pearl Harbor Remembrance Day honors the 2,403 Americans who lost their lives 80 years ago in the Japanese attack on Pearl Harbor. As we honor these victims and veterans, we must never forget their sacrifice on that tragic day. https://t.co/VM29fVEHTc","date":"Tue Dec 07 13:58:32 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden energy crisis continues. https://t.co/DW2FYdCg1M","date":"Mon Dec 06 21:51:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On the last day of Hanukkah, Jacquie and I want to wish all who celebrate a happy, safe, and peaceful holiday!","date":"Mon Dec 06 18:06:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"That is why in the beginning of the 117th Congress I proudly cosponsored the Saving America’s Mine Act to protect federal lands where mining is permissible from unilateral action to halt the mining of critical minerals from any Administration. https://t.co/FZozAw6i51","date":"Mon Dec 06 16:41:45 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The mining industry has a rich history in the state of Minnesota. On #NationalMinersDay we acknowledge the hard work and dedication of brave #miners who provide the critical minerals that build this country. https://t.co/RPofGYC1vE","date":"Mon Dec 06 16:34:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud to announce that I am introducing legislation to rename the post office in Avon in his honor. https://t.co/unh5PvTz8g","date":"Sun Dec 05 18:36:43 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Two years ago, we lost three Minnesota National Guardsmen in the line of duty, including Kort Miller Plantenberg from Avon, MN. His sacrifice to our great state and nation will never be forgotten. https://t.co/nzL9pQlHQs","date":"Sun Dec 05 18:36:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, we lost a lifelong servant to the American people. Praying for Elizabeth and the entire Dole family during their time of grief.","date":"Sun Dec 05 18:02:54 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler, I’m still waiting on your response to our Nov. 3 letter asking you to make sense of why Bitcoin futures ETFs are allowed to trade but not Bitcoin spot ETFs.","date":"Fri Dec 03 19:08:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The world isn’t going to wait for @GaryGensler to approve Bitcoin spot ETFs. Now, we’re seeing other nations leave us behind in real time. \nhttps://t.co/yvTQtVxE4M","date":"Fri Dec 03 17:20:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Disappointing, but unsurprising. \nhttps://t.co/y9DGrL6t2F","date":"Fri Dec 03 14:52:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wonderful news- congratulations, Blake!","date":"Thu Dec 02 21:01:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Let’s call inflation what it is, Secretary Yellen: a crisis created and exacerbated by your own department. https://t.co/QwkY3d9evz","date":"Thu Dec 02 19:49:59 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The White House claims rising prices are a ‘high class’ problem. Meanwhile, more than 70% of lower-income Americans now report that they are facing financial hardship thanks to Democrats' spending sprees. https://t.co/KrNpmqZGui","date":"Thu Dec 02 15:02:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over the last #80years our @CivilAirPatrol has selflessly served America’s communities with emergency response, aviation, youth development, and educational opportunities. Happy 80th Anniversary to our dedicated volunteers! #CivilAirPatrol","date":"Wed Dec 01 18:52:59 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I spoke on the House floor to recognize Dan Glessing, @MNFarmBureau's newest President.  I have known Dan for many years and I’m confident that he will make a great leader for Minnesota’s agriculture community! https://t.co/l8GYgW7Jji","date":"Wed Dec 01 18:33:37 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@HouseDemocrats My constituents just experienced the most expensive Thanksgiving dinner to date. Today, I spoke in @FinancialCmte to demand the Biden Administration address the inflation crisis hurting working Americans. https://t.co/0I174SNdzt","date":"Wed Dec 01 16:58:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats tried to tell us that skyrocketing prices were transitory. But even Fed Chair Powell admits that this inflation isn’t going anywhere. https://t.co/TmzxdU5exk","date":"Wed Dec 01 16:57:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, the Supreme Court will hear a case that will determine if their future will stay in the hands of unelected judges or be up to the American people.","date":"Wed Dec 01 15:40:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"At 15 weeks, babies have fingers and toes. They are capable of independent movement and feeling pain. \nTheir lives are worth fighting for. https://t.co/XB4hjzOZBP","date":"Wed Dec 01 15:39:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with leaders from across Sherburne County in D.C. today. Thank you for all that you do to fight for Minnesotans! https://t.co/npfcUB4KS1","date":"Tue Nov 30 22:21:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder that only 28% of the $46.5 BILLION allocated for Emergency Rental Assistance has been distributed to those who need it most. \n\nWe must pass the Renter Protection Act &amp; get these funds to families in need!","date":"Tue Nov 30 20:20:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last month, I led a bipartisan letter with @RepDarrenSoto to @GaryGensler urging him to approve Bitcoin spot ETF applications.","date":"Tue Nov 30 18:18:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Withholding approvals for Bitcoin spot ETFs only shows the SEC’s baseless &amp; wildly inconsistent approach to regulating crypto.","date":"Tue Nov 30 18:17:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden flies to Minnesota this morning. We’re waiting for him to answer for: \n\n❌Skyrocketing prices \n❌Soaring home heating costs\n❌The supply chain crisis\n\nBut I’m not holding my breath.","date":"Tue Nov 30 15:22:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I will continue to find ways for Congress to advance care for individuals living with diabetes. #DiabetesAwarenessMonth","date":"Sat Nov 27 14:59:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"With 7.8 percent of Minnesota adults living with either type 1 or 2 diabetes, I am proud to have supported the Expanding Access to Diabetes Self-Management Training Act. This legislation provides better resources to help those suffering from diabetes to manage their condition.","date":"Sat Nov 27 14:59:28 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Thanksgiving from my family to yours! Today and every day, I’m thankful for my family and the opportunity to serve the Sixth District of Minnesota. https://t.co/8U6WznmLrw","date":"Thu Nov 25 13:15:54 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This Thanksgiving week, I’m grateful for every family that makes up the Sixth District. November is National Adoption Month, when we recognize the sacrifice &amp; love that makes up every adoptive family. You can read my #NationalAdoptionMonth message here: https://t.co/Ibh6d1rQD4","date":"Wed Nov 24 14:09:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Biden administration manufactured an energy crisis by targeting key pipelines. Now, they’re tapping into our strategic fuel reserve &amp; endangering our nation’s future to try to fix their own mistakes. \nhttps://t.co/kol3J6CF4h","date":"Tue Nov 23 22:52:02 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’ve worked with Dan Glessing for years as an advocate for Minnesota’s farmers and producers, and I’m confident he’ll be a great leader as President of the Minnesota Farm Bureau. Congratulations, Dan! https://t.co/fEa7gQqLqO","date":"Mon Nov 22 22:14:08 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Good luck Journey!","date":"Fri Nov 19 20:22:59 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Right now, the House is voting on a bill that adds $367 BILLION to our deficit. All to allow the IRS to target farmers, small businesses &amp; working families, worsen already-skyrocketing inflation &amp; hammer domestic energy production. \n \nThis is a tragedy.","date":"Fri Nov 19 14:21:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This resolution asserts the importance of continued investment in rural mental health, and of legislation like my STRESS Act. https://t.co/hH2mqw9Put","date":"Thu Nov 18 22:40:48 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must continue to shed light on this alarming issue—that’s why I introduced legislation to designate November 18 as Rural Mental Health Day.","date":"Thu Nov 18 22:40:41 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Rural communities are especially vulnerable to the threat of mental illness. Tragically, Americans living in rural areas die of suicide at nearly DOUBLE the rate of their urban counterparts.","date":"Thu Nov 18 22:40:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Good luck Riley! I’m so proud of the talent we have here in the Sixth District. \nhttps://t.co/6Rt60msHsG","date":"Thu Nov 18 18:41:26 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, the Senate is considering President Biden’s dangerous nominee for OCC chair. She has: \n \n❌Advocated for the government to control every American’s bank account\n❌Said she wanted domestic energy producers to “go bankrupt” \n❌Touted the social policies of the Soviet Union","date":"Thu Nov 18 17:31:37 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As a co-chair of the Personalized Medicine Caucus, I’m committed to advocating for innovative solutions to devastating diseases like #PancreaticCancer. Join me on World Pancreatic Cancer Day in spreading awareness and pushing for a cure #WPCD","date":"Thu Nov 18 17:10:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Superintendent Willie Jett has been an amazing advocate for students, partner to parents, and leader in the St. Cloud community. I was proud to honor Willie on the House Floor prior to his well-earned retirement. Thanks, Willie! \nhttps://t.co/3a0hZjXn1z","date":"Thu Nov 18 14:26:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’ve been hard at work introducing legislation to decrease opioid death and dependency, but we can’t fix this problem unless we address the crisis at the border. https://t.co/8ciLQeyF98","date":"Wed Nov 17 22:17:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It’s naïve to think that just because Minnesota doesn’t share a border with Mexico, the crisis there isn’t hurting our state. Opioid deaths are a tragedy &amp; becoming far too common thanks to the pipeline of cheap, deadly fentanyl across our southern border. https://t.co/VVNW4S7Bto","date":"Wed Nov 17 22:17:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced the Pregnancy Loss Mental Health Research Act, which will direct the NIH to invest in research into the mental and emotional toll of pregnancy loss. https://t.co/MRTwe0jqpU","date":"Wed Nov 17 21:46:53 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Bereaved mothers deserve access to proper treatment and care, and that is impossible without additional clinical research into the grief associated with pregnancy loss and education for health care providers.","date":"Wed Nov 17 21:46:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Pregnancy loss is a devastating event that can cause enormous pain. Despite its frequency--thousands of mothers experience pregnancy loss every year— little research has been sponsored by the NIH to understand the scope and severity of the mental injury by such loss.","date":"Wed Nov 17 21:45:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"All my work in the crypto space, including bills like the Securities Clarity Act or Safe Harbor for Taxpayers with Forked Assets Act which @Valkenburgh mentioned today, is to give this technology, this next great innovation, a chance to thrive and for Americans to thrive with it.","date":"Wed Nov 17 20:08:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@valkenburgh @JECRepublicans We’re already seeing countries like China attempting to regulate this technology out of existence—their approach cannot be America’s blueprint.","date":"Wed Nov 17 20:07:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@valkenburgh @JECRepublicans At its core, blockchain technology allows us to share ideas, currency, and information without permission or centralized control. It allows us to own parts of our digital identity that third parties currently profit from.","date":"Wed Nov 17 20:07:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@Valkenburgh’s testimony today before @JECRepublicans underscored that crypto is just like every innovation that made America great: a product of our pioneers' ingenuity.","date":"Wed Nov 17 20:06:16 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The White House is continuing to double down on policies that kill domestic energy production—all while heating costs soar through the roof. Enough is enough! \nhttps://t.co/IaoVnbJJSJ","date":"Wed Nov 17 14:29:45 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@FinancialCmte My bill with @RepEdPurlmutter will allow credit unions to protect their customers &amp; employees by expelling abusive members. Read more here ⤵️https://t.co/3KDplZsGhk","date":"Tue Nov 16 19:01:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Credit Union Government Modernization Act is now @FinancialCmte approved. ✅","date":"Tue Nov 16 19:00:59 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I spoke on the House Floor to honor Kevin Paap’s work for our ag community. Thank you for your leadership, Kevin! \nhttps://t.co/ExyeUqYl3s","date":"Tue Nov 16 17:35:37 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is only the beginning. Skyrocketing prices are already chipping away at our household budgets, our holiday traditions, and our leisure time…and it’s only getting worse. \nhttps://t.co/C5nwKAlS9Q","date":"Tue Nov 16 14:12:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Unacceptable. Working Americans keep paying the price for the Biden Administration’s disastrous policies—whether it’s at the pump, the checkout line of the grocery store, or when they’re paying their heating bill. \nhttps://t.co/DW2FYdTRqm","date":"Mon Nov 15 21:17:47 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to join @FinancialCmte’s Digital Assets Working Group to offer guiding principles for a U.S. CBDC!","date":"Mon Nov 15 20:05:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Any Central Bank Digital Currency must maintain America’s global leadership &amp; allow private-sector innovators to lead the way, but most importantly, it must be open, permissionless, and private – like cash.","date":"Mon Nov 15 20:05:45 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced legislation to help ensure that veterans who fall victim to fraud receive fair reimbursement, no matter when their case is resolved.  https://t.co/7WNpycSIDM","date":"Mon Nov 15 18:13:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"For many veterans, the process of accessing fairly-earned benefits can be confusing, circuitous, and even open them up to fraud. To make matters worse, some defrauded veterans and their families never see that money returned.","date":"Mon Nov 15 16:54:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I was proud to co-sponsor the Improving HOPE for Alzheimer's Act last Congress to provide outreach and education to health care practitioners regarding care planning services for Medicare recipients with Alzheimer's or other related dementias. #ENDALZ","date":"Mon Nov 15 14:08:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"November marks #NationalAlzheimersDiseaseAwarenessMonth, and while it is impossible to understate the financial, physical, and emotional costs of Alzheimer's, making continued federal investments in research so critical. https://t.co/1kpWUWTdAD","date":"Mon Nov 15 14:08:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder that as your family’s energy costs could be rising by THOUSANDS this winter, the Biden administration is considering shutting down yet another American energy source. https://t.co/PQcTn07zWf","date":"Fri Nov 12 20:50:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, we introduced bipartisan legislation to address this – the Inpatient Opioid Safety Act will modernize safety standards to address and mitigate this risk. https://t.co/8ciLQeyF98","date":"Fri Nov 12 20:02:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Addiction isn’t the only risk that opioids pose to patients. Approximately 180,000 Americans experience serious opioid-related side effects in an inpatient setting every year. Death or injury from opioid-induced respiratory depression is a preventable tragedy.","date":"Fri Nov 12 20:02:12 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Unfortunately still relevant.","date":"Fri Nov 12 17:15:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Simply nonsensical and unfair. We will keep the pressure. American investors deserve better.","date":"Fri Nov 12 17:15:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every day, the money in your paycheck can buy less and less. Democrats’ solution? Keep on spending. \nhttps://t.co/xaiIfpjbDz","date":"Fri Nov 12 14:02:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I recently heard the story of Sixth District veteran Russ Jorgenson. Russ served as a Tech Sergeant in WWII from June of 1942 to November of 1945 with the 19th bomb squadron and 22nd bomb group, flying in B-24’s as a radio operator and gunner. Thank you for your service, Russ. https://t.co/mJb849XQNO","date":"Fri Nov 12 00:46:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Monitoring the breach at the American Embassy in Yemen as it develops. I’m praying for a quick &amp; peaceful resolution for any Americans and allies involved.","date":"Thu Nov 11 16:11:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Ben Peterson was welcomed by Vietnam veterans after returning home from two years of service in Iraq. After surviving a battle with PTSD, he founded the nonprofit Engage Your Destiny to bring hope &amp; healing to veterans and their families. https://t.co/4YsRrjPxIo","date":"Thu Nov 11 15:00:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@SemperFiFund Roy Reiser, a veteran of World War II, has spent the last 74 years supporting fellow veterans and his community in his work with the American Legion. The Pine County resident was honored by Quilts of Valor for his service. https://t.co/lfzM00Yu8s","date":"Thu Nov 11 14:56:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"After losing a leg in Afghanistan as a Navy Corpsman, Thomas Scott of Burnsville founded his own nonprofit, @SemperFiFund, to help injured service members transition from long-term rehabilitation to independence. https://t.co/RjFu2tspYw","date":"Thu Nov 11 14:54:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This Veterans Day, join me in saluting these veterans who continue to serve, even after their call of duty. Read on to learn more about some heroes from Minnesota ⤵️","date":"Thu Nov 11 14:53:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The men and women who take an oath to protect our nation do so with great bravery and risk enormous personal sacrifice. It makes sense that veterans’ commitment to service would continue after their time in the military has ended. https://t.co/z0oqzmePFo","date":"Thu Nov 11 14:52:55 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Don’t worry—rising prices won’t affect you. Just as long as you don’t: \n\nDrive to work\nBuy a home \nGive presents at Christmas\nShop for groceries\n…or anything else","date":"Wed Nov 10 19:25:43 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Prices rose almost a full percentage point last month. Inflation is now up 6.2%--the highest in over 30 years. What will it take for Democrats to recognize this is as a crisis? https://t.co/l7bmQ2yacN","date":"Wed Nov 10 17:32:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Amazing news. We must make veteran homelessness a thing of the past nationwide- I’m proud to have supported legislation like the Homeless Veteran Families Act to make this goal our reality. \nhttps://t.co/G9jdKmRz0i","date":"Wed Nov 10 16:37:32 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy Birthday to the @USMC! Our nation is a safer place because of our dedicated service members. I’m especially proud of my son, Bill, for joining the many brave men and women serving in the Marine Corps. https://t.co/2vinUFysuP","date":"Wed Nov 10 15:12:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today would be a great day to pass the Renter Protection Act.","date":"Tue Nov 09 21:20:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today I sent a letter to @GaryGensler with my @blockcaucus co-chair @RepDarrenSoto about Bitcoin ETFs. It doesn’t make sense that Bitcoin futures ETFs are allowed to trade but Bitcoin spot ETFs are not. https://t.co/k1WTF0HA0U","date":"Wed Nov 03 16:44:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If @HouseDemocrats were confident about the contents of their MASSIVE spending bill they would have no problem waiting for a CBO score. Instead, they’re trying to force a vote on thousands of pages of legislation members haven’t had the chance to read. Wonder why.\n\n#NoScoreNoVote","date":"Fri Nov 05 20:54:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The House has been voting on a motion to adjourn for THREE HOURS. \n \nDems in disarray once again.","date":"Fri Nov 05 15:42:30 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"November is Pancreatic Cancer Awareness Month! Research is critical to creating change for #pancreaticcancer patients, and I’m proud to support continued investment to end this devastating disease. @PanCAN https://t.co/qNX7liWsxT #PanCANawareness","date":"Fri Nov 05 15:41:08 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I don't know about those places, but if you let us know when you’re in town I’ll have Jacquie pack you up some hotdish!","date":"Fri Nov 05 13:48:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to welcome Congressman Mike Carey, new representative for Ohio’s 15th District, to the House of Representatives!","date":"Thu Nov 04 19:51:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I sent a letter to Federal Housing Finance Agency (FHFA) Acting-Director Sandra Thompson urging her to address these regulatory concerns and remove this barrier to homeownership. https://t.co/REXWjMdMtX","date":"Thu Nov 04 14:57:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is causing major headaches: backlogs, hidden costs, and inflated prices for those pursuing home ownership.","date":"Thu Nov 04 14:57:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last year, 2.1 million Americans became homeowners—the largest jump in nearly two decades. At the same time, homebuyers have had access to fewer registered appraisers thanks to burdensome regulations on the industry. https://t.co/THkfZqSItn","date":"Thu Nov 04 14:56:47 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"American investors deserve choice. https://t.co/HxkmlppCV8","date":"Wed Nov 03 16:44:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"While the trading of two Bitcoin futures ETFs in October is a step forward for the millions of Americans who want to invest in crypto through traditional methods, the onus is on the SEC, now more than ever, to allow Bitcoin spot ETFs to commence trading.","date":"Wed Nov 03 16:44:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today I sent a letter to @GaryGensler with my @blockcaucus co-chair @RepDarrenSoto about Bitcoin ETFs. It doesn’t make sense that Bitcoin futures ETFs are allowed to trade but Bitcoin spot ETFs are not. https://t.co/k1WTF0HA0U","date":"Wed Nov 03 16:44:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every type of heating fuel is skyrocketing, and it’s no mystery why. The Biden administration has done everything in their power to slow domestic energy production to a halt.\nhttps://t.co/VkEtUGDqRa","date":"Wed Nov 03 14:48:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Mike, so sorry for your loss. Praying for you and the whole family tonight.","date":"Tue Nov 02 23:53:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last month, AG Merrick Garland issued a memo calling for DOJ intervention in attacks against school board officials…without offering any evidence that such attacks ever existed. Now, he’s blowing off congressional inquiries on the basis of the memo. \nhttps://t.co/Jchd5QbpIx","date":"Tue Nov 02 21:14:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI: President Biden is already a million jobs short of what he promised. Now, third quarter reports on our GDP indicate that our economic growth is faltering further. https://t.co/ZIdx1WC9il","date":"Tue Nov 02 17:20:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder that not one of the 1,500 pages of President Biden’s spending bill includes the Hyde Amendment. That means that there’s nothing stopping taxpayer dollars from being spent on abortion.","date":"Tue Nov 02 13:13:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It’s more than clear that any regulatory changes to crypto MUST be subject to Congressional oversight!","date":"Mon Nov 01 20:50:48 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On top of that, the PWG wants stablecoin issuers to register as banks. Meanwhile, #MichaelHsu at the OCC has halted all of the progress @BrianBrooksUS made with the OCC special purpose bank charter, which would provide qualifying fintechs to operate as national banks.","date":"Mon Nov 01 20:50:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"With its stablecoin report, the PWG seems to try to force Congress to choose between handing over regulatory power to bureaucrats or risking the unchecked FSOC stamp out crypto innovation.","date":"Mon Nov 01 20:50:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My office is still reviewing the President's Working Group on Financial Markets stablecoin report, but here are some initial thoughts:","date":"Mon Nov 01 20:49:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"New York City isn’t an outlier. Federal vaccine mandates have a price, and communities across the country will be forced to pay it. \nhttps://t.co/tgzENy3EhW","date":"Mon Nov 01 19:31:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepJimmyPanetta When access to capital is limited to a select few, we risk missing out on the next great idea. https://t.co/GwaCAWyWCs","date":"Mon Nov 01 17:13:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I reintroduced the Main Street Growth Act with the support of my colleague @RepJimmyPanetta. This bipartisan bill allows for the creation of venture exchanges for small and medium cap companies.","date":"Mon Nov 01 17:12:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I sent a letter to Administration officials expressing my concern with this proposed implementation. https://t.co/Ngragdy7tU","date":"Fri Oct 29 18:28:17 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Administration’s proposed standards for air ambulatory services make reimbursement unpredictable, and could hinder the ability of companies like the Minnesota-based Life Link III to serve patients in immediate and dire need.","date":"Fri Oct 29 18:27:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The accessibility of emergency air medical transport is a life or death proposition—which is why I’m so concerned about the Biden Administration’s proposed interim final rule for the No Surprises Act. https://t.co/LfpHAloRUn","date":"Fri Oct 29 18:27:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"In less than a year, the Biden administration has taken us from rebounding from the COVID-19 crisis to dealing with empty shelves, worker shortages, and skyrocketing prices.","date":"Fri Oct 29 18:06:32 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Unbelievable. The Biden Administration is actually considering giving illegal migrants $450k per person, while in the same framework cutting Medicare services for rural Americans. We don’t need to wonder where Biden’s priorities are—he’s showing us. \nhttps://t.co/TyHwWj75um","date":"Fri Oct 29 17:43:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Spot on. https://t.co/TlaMfNBC47","date":"Fri Oct 29 15:13:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If you share household costs using Zelle or accept tips on Venmo, this provision applies to you. Democrats will stop at nothing to squeeze every possible dollar from working Americans.","date":"Thu Oct 28 21:24:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats tried to use your bank transactions to spy on you. We called them on it, and they were forced to back down. Now, they’re trying to use fintech instead.","date":"Thu Oct 28 21:22:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The tools that allow working families to build financial stability, like retirement savings and investments, are being used by Democrats as a trap to squeeze additional tax dollars. This is unthinkable: Democrats want to punish Americans for trying to achieve the American Dream.","date":"Thu Oct 28 18:27:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I joined @GOPLeader Kevin McCarthy for a roundtable discussion on this disastrous proposal. \nThank you to my colleagues \n@RepDrewFerguson @Rep_Clyde @RepAshleyHinson @MikeKellyPA for standing with me!\nhttps://t.co/TsrzIYLAs5","date":"Thu Oct 28 18:02:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If you spend just $28 per day, the IRS wants to spy on your bank accounts. This isn’t just an egregious violation of privacy—it’s an attack on working Americans. https://t.co/QIKMF62AMq","date":"Thu Oct 28 18:01:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The surveillance scheme being pitched by Democrats is going to drive working Americans away from the financial system. President Biden is forcing Americans to choose: give up their privacy, or become unbanked.","date":"Thu Oct 28 16:17:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"3 in 5 adults already don’t trust the IRS with their personal data. Seeing as the IRS experiences over 1.4 BILLION cyberattacks per year, why would they?","date":"Thu Oct 28 15:42:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is Democrats' goal: to weaponize the IRS against the American people. https://t.co/0TSfWQ9E1P","date":"Thu Oct 28 15:03:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday in @FinancialCmte, I questioned @CFPB Director Rohit Chopra about his agency’s dubious hiring practices. https://t.co/DtTvD0cd9p","date":"Thu Oct 28 13:39:04 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every government agency owes accountability to the American people. I’m deeply concerned by the reports that the Biden Administration has been pushing out non-political employees to make room for cherry-picked, Biden-approved replacements.","date":"Thu Oct 28 13:38:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@MNagriculture This effort has become all the more important as farmers and ranchers work hard to keep up with strained supply chains, the continuing challenges of the COVID-19 crisis, and an unprecedented drought. Read more about my work to support our ag community ⤵️https://t.co/KNmwyDS45W","date":"Wed Oct 27 19:13:02 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to announce that the USDA has awarded $500,000 to the @MNAgriculture as part of their initiative to train professionals and provide resources in service of eliminating high stress levels in the ag community. https://t.co/ehyuVaESQP https://t.co/7LZjXVuOvi","date":"Wed Oct 27 19:12:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great news. This is a win for every hardworking American who would have been targeted by this disastrous proposal!","date":"Wed Oct 27 17:08:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Which, thanks to President Biden’s inflation crisis, is getting more expensive by the week.","date":"Wed Oct 27 16:03:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud to join this effort!","date":"Wed Oct 27 14:04:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder that President Biden’s IRS monitoring scheme would go after every worker that doesn’t report their income on a W2: every farmer, contractor, plumber, or hairdresser. Democrats are trying to squeeze every possible tax dollar from working Americans, not billionaires.","date":"Wed Oct 27 13:38:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Democrats' proposal to have the IRS surveil the bank accounts of tens of millions of Americans is outlandish. This is a promising development—we must stop this attack on our privacy!\nhttps://t.co/nhMC8QqIkC","date":"Tue Oct 26 21:54:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s disastrous policies have become a life-threatening tax on working families!","date":"Tue Oct 26 19:54:02 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every type of heating fuel will be more expensive this winter. If we’re lucky and get a warmer winter, Minnesota families who rely on propane may be forced to pay an ADDITIONAL $1,800 in energy costs—but if it’s a cold winter, that figure could DOUBLE. \nhttps://t.co/4xq5aOd08S","date":"Tue Oct 26 19:53:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It’s bittersweet to hear that my friend, Superintendent Willie Jett, is retiring. For nearly a decade, Willie has been a great leader in our community and a resource to countless families in the Sixth District. https://t.co/NtrCls9cnF","date":"Tue Oct 26 19:12:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On his first day in office, President Biden destroyed over 10,000 jobs by canceling the Keystone Pipeline. Since then, he’s exercised prohibitions on domestic energy production all across the country. Now, Americans are paying the price.\nhttps://t.co/toUKrD5Xrz","date":"Tue Oct 26 18:18:16 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is great news—but this tragedy never should have happened in the first place. Praying for Ladavionne’s quick recovery &amp; that officials in our state will finally see the cost of crime run amok. \nhttps://t.co/WDYBejOyX0","date":"Tue Oct 26 14:52:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I spoke in the @FinancialCmte on the need to pass the Renter Protection Act &amp; immediately deliver these funds! https://t.co/b3QxmzgBuv","date":"Tue Oct 26 12:57:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More than 80% of the funds appropriated for Emergency Rental Assistance haven’t even been distributed to those in need, but somehow Democrats think that they can spend their way out of this crisis.","date":"Tue Oct 26 12:57:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great event happening this week! Thanks to Project Connect &amp; the St. Cloud State students who worked to put this together. https://t.co/Np9Y9Qb4dG","date":"Mon Oct 25 21:43:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced the CFPB Whistleblower Incentives and Protection Act, which will create a program at the @CFPB to ensure whistleblowers are rewarded fairly.","date":"Mon Oct 25 19:29:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Incentivized whistleblower programs allow civil servants to serve as watchdogs for the American people, and in the case of the Consumer Financial Protection Bureau can help stop financial crimes in their tracks. https://t.co/EMoR2CIq9h","date":"Mon Oct 25 19:29:13 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Reminder that there are over 360 Americans still trapped in Afghanistan. President Biden hasn’t answered a question about his catastrophic withdrawal in 45 days.","date":"Mon Oct 25 13:59:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Each year the @DEAHQ gives Americans an opportunity to safely dispose of unwanted &amp; unused medications to help combat prescription drug addiction. This #NationalTakeBackDay, find a collection site near you at: https://t.co/iX7BHqhgnQ https://t.co/KTJoTWw5CJ","date":"Sat Oct 23 16:59:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@POTUS's solution is to spend an additional $80B in IRS enforcement to surveil the bank accounts of every American that spends more than $850/month. This is a disastrous attack on the right to privacy of every law-abiding American. Watch me speak out on the House floor ⤵️ https://t.co/ThjZZ5ONWe","date":"Thu Oct 21 20:27:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats have told the American people that they have a plan to offset their massive $5.5T spending spree without hurting working families. They’re lying.","date":"Thu Oct 21 20:26:09 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Rising prices aren’t a “high-class problem,” they’re a tax on working families. Today, I spoke on the House floor to hold the Biden Administration accountable for this worsening crisis. https://t.co/hBq1xO9suf","date":"Thu Oct 21 17:39:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats simply don’t understand: you can’t spend your way to prosperity.","date":"Thu Oct 21 16:52:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline .@repjulialetlow @RepLoudermilk @RepFrankLucas @RepBlaine @USRepLong @RepNancyMace @RepMalliotakis @RepMann @RepBrianMast @RepMcCaul @RepLisaMcClain @RepMcClintock @PatrickMcHenry @RepMcKinley @cathymcmorris @RepMeijer @RepMeuser @RepCarolMiller @RepMMM @RepMoolenaar","date":"Thu Oct 21 15:13:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@RepGregPence @RepWalberg @RepFeenstra @RepMaryMiller @TomColeOK04 @RepClayHiggins @RepBentz @RepTroyNehls @RepHalRogers @RepJasonSmith @RepRutherfordFL @RepHartzler @RepSpartz @RepMattGaetz @RepGregSteube @RepSamGraves @RepMikeJohnson @virginiafoxx\n@RepJohnKatko @RepMGriffith","date":"Thu Oct 21 15:12:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX @Rep_Clyde @RepJamesComer @RepDanCrenshaw .@RepBradWenstrup @RepGallagher @RepLaTurner @RepRickCrawford @RepBoebert @RepBost @RepMoBrooks @RepGusBilirakis @RepGusBilirakis @HerreraBeutler @RepBice @RepJohnCurtis @RepAlexMooney","date":"Thu Oct 21 15:09:45 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX @Rep_Clyde .@CongressmanGT @RepTiffany @RepTimmons @RepMikeTurner @RepFredUpton @RepDavidValadao @RepBethVanDuyne @RepAnnWagner @RepWalorski @TXRandy14 @RepWebster @RepWesterman @RepRWilliams @RepJoeWilson @RobWittman @rep_stevewomack @repdonyoung @RepLeeZeldin","date":"Thu Oct 21 15:09:26 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX @Rep_Clyde .@RepDavidRouzer @RepChipRoy @RepMariaSalazar @SteveScalise @RepDavid @AustinScottGA08\n@PeteSessions @CongMikeSimpson @RepAdrianSmith @RepSmucker @RepPeteStauber @RepSteel @RepStefanik @RepBryanSteil @RepChrisStewart @RepVanTaylor @RepTenney @RepRosendale","date":"Thu Oct 21 15:09:16 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX .@RepBarryMoore @RepBlakeMoore @RepMullin @RepGregMurphy @RepNewhouse @RepRalphNorman @RepDevinNunes @JayObernolte @RepBurgessOwens @CongPalazzo @USRepGaryPalmer @RepScottPerry @RepPfluger @congbillposey @TomReedNY23\n@GReschenthaler @RepTomRice @RepMikeRogersAL @RepJohnRose","date":"Thu Oct 21 15:08:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline .@RepFrenchHill @RepAshleyHinson @RepTrey @RepRichHudson @RepHuizenga @RepRonnyJackson @RepJacobs @RepBillJohnson @RepDustyJohnson @Jim_Jordan @RepDaveJoyce @RepFredKeller @RepYoungKim @RepKinzinger @RepDavidKustoff @RepLaHood @RepLaMalfa @RepDLamborn @boblatta @RepDLesko","date":"Thu Oct 21 15:07:53 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX @Rep_Clyde .@RepBobGibbs @RepCarlos @replouiegohmert\n@RepTonyGonzales @RepAGonzalez @RepJenniffer @RepBobGood @RepGarretGraves @RepMarkGreen @RepGrothman @RepMichaelGuest @RepGuthrie @repdarrellissa @RepHagedorn @RepHarshbarger @repkevinhern @RepHerrell @CongressmanHice","date":"Thu Oct 21 15:07:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop @VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX .@WarrenDavidson @RodneyDavis @DesJarlaisTN04 @MarioDB @RepDonaldsPress @RepJeffDuncan\n@DrNealDunnFL2 @RepRonEstes @RepPatFallon @RepDrewFerguson @RepFischbach @RepFitzgerald @RepBrianFitz @RepChuck @JeffFortenberry @RepFranklin @RepRussFulcher @RepMikeGarcia @RepGarbarino","date":"Thu Oct 21 15:07:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington @RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop .@VernBuchanan @RepKenBuck @RepLarryBucshon @RepTedBudd @RepTimBurchett @michaelcburgess @KenCalvert @RepKatCammack @RepJerryCarl @RepBuddyCarter @JudgeCarter @RepCawthorn @RepSteveChabot @RepLizCheney @RepBenCline @RepCloudTX @Rep_Clyde @RepJamesComer @RepDanCrenshaw","date":"Thu Oct 21 15:06:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks to the 201 colleagues who joined me in this fight! @RepRickAllen @Robert_Aderholt @MarkAmodeiNV2 @RepArmstrongND @GOPLeader @RepArrington\n@RepBrianBabin @RepDonBacon @RepJimBaird @RepBalderson @RepJimBanks @RepAndyBarr @RepJackBergman @RepAndyBiggsAZ @RepDanBishop","date":"Thu Oct 21 15:05:58 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I’m demanding the Biden Administration rescind this proposal and end this attack on law-abiding Americans. https://t.co/lMCzK8cdl8","date":"Thu Oct 21 14:27:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last month, I led 140 of my colleagues in a letter to Secretary of the Treasury Yellen and IRS Commissioner Rettig asking them to reconsider the proposal—and was ignored. We won’t give up Americans’ right to privacy without a fight. https://t.co/k3yRhVhe1H","date":"Thu Oct 21 14:25:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The Democrat proposal for IRS enforcement would subject virtually every taxpaying American to government surveillance of their bank accounts. This is unacceptable. https://t.co/Gop2AtRtgO","date":"Thu Oct 21 14:25:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’ve said it before and I’ll say it again: crypto is not a partisan issue. Just look to the bipartisan @blockcaucus! https://t.co/fprq0T7Lyx","date":"Wed Oct 20 16:31:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"yikes","date":"Wed Oct 20 14:47:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden’s mismanagement of our economy is costing Americans too much.","date":"Tue Oct 19 13:06:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Think about what your family could do with an extra $175 per month. That’s a week’s worth of groceries or a few trips to the movies, new clothes for school, or a night out at a nice restaurant. https://t.co/oFwSwgMboJ","date":"Tue Oct 19 13:06:30 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is a lie. @POTUS’ agenda is already costing every household in America.","date":"Mon Oct 18 16:18:53 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As we close out National Police Weekend, I’m grateful to the brave officers who risk their lives &amp; work tirelessly to keep our communities safe. I’m glad my staff could attend the National Peace Officers Memorial Service yesterday in D.C. #BackTheBlue https://t.co/LUJaabBVGR","date":"Sun Oct 17 19:56:54 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@HouseDemocrats are speaking out of both sides of their mouth. They want to bring unbanked Americans into our financial system. At the same time, they’re working to spend billions in IRS enforcement that will drive working Americans away from banks.","date":"Thu Oct 14 19:25:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Biden administration officials are so out of touch that they can’t understand inflation is eating away at the budgets of working families. \n \nThe only “high class” problem here is that White House officials can’t relate to millions of Americans. \nhttps://t.co/Lxn1Teuui0","date":"Thu Oct 14 18:49:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@FinancialCmte You can watch me question expert witness @ToddZywicki about how small businesses could be supported by going cashless here ⤵️ https://t.co/gk9yNHw4hi","date":"Thu Oct 14 18:46:54 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I led a hearing of the @FinancialCmte’s Subcommittee on Oversight and Investigations, where I highlighted the implications of a cashless economy. https://t.co/gk9yNHw4hi","date":"Thu Oct 14 18:46:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"More than ever before, it is possible for businesses of all sizes to operate without the costs and liabilities that come with processing cash.","date":"Thu Oct 14 18:45:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Distributed ledgers allow us to easily and accurately trace crypto. Make no mistake, cash is still king for criminals—disappointing to see @RepCleaver spread misinformation about traceability at our @FinancialCmte hearing today.","date":"Thu Oct 14 18:39:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"China’s regulatory crackdown took them off the map for crypto. It’s a cautionary tale—and we can’t allow it to be repeated in the U.S. \nhttps://t.co/AsG4WIitAP","date":"Wed Oct 13 18:51:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy birthday to the U.S. Navy! Thank you to all the dedicated service members who are and have served to keep us all safe, including my son Joe.","date":"Wed Oct 13 17:55:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I announced the introduction of my Advancing and Promoting Programming (APP) Act with the support of @CongressmanRaja @RepDannyDavis  &amp; @JayObernolte, which will streamline federal resources &amp; help the next generation of developers stay competitive. https://t.co/EN2EV1AL62","date":"Tue Oct 12 22:20:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Government resources to help innovators access the tools &amp; resources necessary to create applications for mobile devices exist, but can be out of date or unhelpful.","date":"Tue Oct 12 21:29:46 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over the last year and a half, our entrepreneurs, innovators and small businesses have had to work harder than ever to connect with their customers. A digital presence has become essential to stay in business, even for the smallest companies.","date":"Tue Oct 12 21:29:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is what Democrats want $80 billion additional in funding for the IRS to do: spy on the bank accounts of millions of Americans.\nhttps://t.co/2ROx00P9Xy","date":"Tue Oct 12 21:21:11 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud to fight for the future of our ag community, from helping address the ongoing drought and protecting family farms from burdensome capital gains increases to fighting stress in farm country. You can read more about my work for MN’s farmers here ⤵️ https://t.co/Zsa5qc6mqB","date":"Tue Oct 12 17:22:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Wishing a happy #NationalFarmersDay to all the incredible hardworking #farmers in Minnesota. Thank you for tirelessly putting food on our shelves and helping keep us nourished! https://t.co/7aB8rG7YhM","date":"Tue Oct 12 17:21:58 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Amazing to join leaders, innovators &amp; trailblazers at Minnesota Blockchain’s Smart Contacts event in Minneapolis last night. The future of crypto will have a global impact, but it’s great to see the work that’s already happening in our own backyard. https://t.co/kaUufHEr44","date":"Fri Oct 08 16:48:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation is taxation, pass it on. \nhttps://t.co/eC3CZSYZQU","date":"Fri Oct 08 13:59:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m so grateful to the whole team at Allina for allowing me to visit, and for their work for our community even in the face of tragedy.","date":"Thu Oct 07 21:01:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@AllinaHealth The brave men and women working there returned to the job nearly eight months after the horrific shooting that killed their colleague, medical assistant Lindsay Overbay.","date":"Thu Oct 07 21:00:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I paid a visit to @AllinaHealth Clinic in Buffalo. https://t.co/bLBM2ATCEZ","date":"Thu Oct 07 21:00:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I sent a letter urging leaders at the Centers for Clinical Standards and Quality and National Government Services to prioritize the availability of the procedure. https://t.co/Aff62IN956","date":"Thu Oct 07 20:05:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"However, a proposed local coverage determination could make epidurals, a commonly used treatment for chronic pain that does not require opioids, less accessible to patients across the country.","date":"Thu Oct 07 20:03:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Ensuring that non-opioid treatments and pain management techniques are available to patients is one of the most important steps we can take to curb the opioid epidemic.","date":"Thu Oct 07 20:02:48 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A whopping 75% of individuals suffering from an opioid addiction didn’t start with illegal drugs—they became addicted with legal, doctor-prescribed medications. https://t.co/1nWcuGKh9R","date":"Thu Oct 07 20:02:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI- @HouseDemocrats shot down common-sense amendments from many of my Republican @FinancialCmte colleagues, including my amendment to oversee the spending of millions of taxpayer $ as part of the Rental Assistance Program. Read more via @taxreformer https://t.co/ASlAQOW4AO","date":"Thu Oct 07 14:20:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Don’t let Biden tell you that his border crisis doesn’t have a cost. \nhttps://t.co/XNdSlW8EpD","date":"Thu Oct 07 13:24:48 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If you didn’t have the chance to attend, you can share your opinions with me on my website - https://t.co/8LVIr3NfRr","date":"Wed Oct 06 23:04:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Hearing directly from my constituents in person is the most rewarding part of my work to represent Minnesota’s Sixth. Last night, I had my first in-person town hall of the year in Wright County. https://t.co/IhKGFbeS3L","date":"Wed Oct 06 23:03:30 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Democrats talk a big game about paying for their out-of-control spending proposals by “taxing the rich.” But the bottom line is this: allowing skyrocketing inflation to sap working Americans’ bank accounts is part of the plan. https://t.co/qbMHYTrWrt","date":"Wed Oct 06 19:03:53 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Watch me hold @GaryGensler accountable for how his leadership could devastate American crypto investors. \nhttps://t.co/VYMbj6BFvb","date":"Tue Oct 05 19:08:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Clearly there is no path for digital asset securities to be traded anywhere, so it is clear that retail investors would be hurt by Gensler’s actions. @GaryGensler, step out of the way.","date":"Tue Oct 05 18:52:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"If Gensler deems a coin with a $1B market cap and tens of thousands of investors a security, what happens to those investors? The value of the token will plummet &amp; retail investors won’t be able to trade it.","date":"Tue Oct 05 18:51:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Can a broker-dealer like Charles Schwab deal in a digital asset that has gone through SEC registration? Would they be able to trade these digital asset securities and custody them? No.","date":"Tue Oct 05 18:50:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Let’s say someone who issued a token agrees with Chairman Gensler wants to register it as a security with the SEC. Once registered, can this token trade on the NYSE or NASDAQ? No.","date":"Tue Oct 05 18:50:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler thinks that most cryptocurrencies are securities. Let’s indulge his line of thinking for a moment just so we can see how harmful it is to everyday investors.","date":"Tue Oct 05 18:50:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Rep. Maloney just offered to yield Congressional authority to the SEC's unelected bureaucrats.","date":"Tue Oct 05 18:01:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@GaryGensler I've already offered an innovation-friendly accounting framework. ⤵️ https://t.co/GX5moEvqCY","date":"Tue Oct 05 17:31:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@GaryGensler, the FASB must prioritize crypto accounting standards. This is an easy step toward clarity for crypto investors.","date":"Tue Oct 05 17:23:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Looking forward to questioning @GaryGensler later today during the @FinancialCmte hearing on SEC oversight. https://t.co/5IOah9Sp4x","date":"Tue Oct 05 15:56:41 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This bill will create a lifeline to capital for small businesses who have been affected by the spread of COVID-19, allowing job creators to raise up to $250,000 without facing burdensome reporting requirements.","date":"Tue Oct 05 14:03:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud to join my @FinancialCmte colleague @PatrickMcHenry in introducing the Small Entrepreneurs’ Empowerment and Development (SEED) Act. https://t.co/rtqFAteyTU","date":"Tue Oct 05 14:03:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Jacquie and I have had a great weekend visiting our sons. Joe is at the Naval Academy and we’ve been able to spend time with our Marine Bill during his pre-deployment leave. We’re so proud of our two brave young men for serving their country. https://t.co/0K2RiNj5PJ","date":"Sat Oct 02 23:11:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I spoke on the floor of the House of Representatives in Nicole’s honor.","date":"Sat Oct 02 15:28:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Nicole died by suicide in 2018 after a traumatic sexual assault while serving in the Army, and her passing will be a loss for our community forever.","date":"Sat Oct 02 15:28:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today marks the third annual Nicole Burnham Veteran Suicide Awareness 5K walk, memorializing the life &amp; legacy of Private Nicole Burnham. https://t.co/Lvo6IGpClh","date":"Sat Oct 02 15:27:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to join the team at @CoinDesk this morning to talk about my work to keep crypto permissionless, private &amp; growing!","date":"Fri Oct 01 19:35:28 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As a pillar of our economy, it is crucial that we support our manufacturing industry. @MfgDay is the perfect opportunity to inspire the future workforce and address the #skillsgap #MFGDay21 https://t.co/1mUbUrafDK","date":"Fri Oct 01 18:19:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As the House author of the Abby Honold Act, which offers training for law enforcement in evidence-based, trauma-informed care for victims of sexual assault, I am committed to securing proper care for victims and bringing assailants to justice. https://t.co/43haEUc0Iw","date":"Fri Oct 01 02:33:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Sexual assault is a horrendous crime, and painfully common in communities across America. Out of every 1000 cases that are reported, 995 perpetrators walk free. This is unacceptable.","date":"Fri Oct 01 02:33:57 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The House is still in session and I’m in D.C. for votes, but my staff spent the evening in St. Cloud to attend the Central Minnesota Sexual Assault Center’s Take Back the Night March on my behalf. https://t.co/uG7F71Dr7A","date":"Fri Oct 01 02:33:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Saule Omarova’s nomination would be a death knell for private industry, consumer choice and crypto—the fact that she could be Dem’s pick is disappointing but not surprising.","date":"Thu Sep 30 22:22:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Putting Tracey Stone-Manning up for confirmation is just more proof of the Biden Administration’s disdain and disregard for rural America. Senate Dems have a choice: vote her down or abandon the majority of our country. https://t.co/RT1PqS258t","date":"Thu Sep 30 15:53:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Protecting our border shouldn’t fall on a single state government. But thanks to the Biden Administration’s apathy, negligence, and incompetence, states like Texas are carrying border security on their shoulders. https://t.co/7nUXCXyG9x","date":"Thu Sep 30 14:46:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"A vote for Tracy Stone-Manning is a vote against rural America. We can’t risk putting her in charge of the Bureau of Land  I’m proud to stand with my @WesternCaucus colleagues in urging @SenateDems to reject her nomination.","date":"Thu Sep 30 14:30:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Opponents of Line 3 fought tooth and nail to stop this project. The verdict is clear: #Line3 is a safe, reliable way to bring Minnesotans the energy they need. https://t.co/dmIQAXoLJX","date":"Thu Sep 30 13:14:47 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@CMSGov This week, I wrote a letter to CMS Administrator Chiquita Brooks-LaSure urging her to rethink this rule, allow patients increased access to LITT, and immediately remedy the procedural misstep. Read more \nhere ⤵️ https://t.co/n9AzKmlm50","date":"Wed Sep 29 21:06:04 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"However, for patients across America, access to LITT is at risk. The new @CMSGov Hospital Inpatient Prospective Payment System (IPPS) final rule, which is being implemented without a public comment period, will significantly reduce hospital compensation for the treatment.","date":"Wed Sep 29 21:02:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Manufactured in Minnesota and used by doctors all over the country, LITT medical devices can shrink or eliminate tumors and lesions inside of a patient’s skull.","date":"Wed Sep 29 21:01:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ITT—Laser Interstitial Thermal Therapy—is a breakthrough treatment for patients suffering from inoperable brain tumors and epilepsy. \nhttps://t.co/MXNIrzBSkW","date":"Wed Sep 29 21:01:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I spoke at the @FinancialCmte in support of my Credit Union Governance Modernization Act, which will help credit unions protect themselves and their members from fraudulent or abusive practices. Thank you, @RepPerlmutter for your support for our legislation.","date":"Wed Sep 29 20:50:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Antiquated credit union rules are putting credit union members and employees in danger. We must move banking into the future. https://t.co/GMHUQom1jq","date":"Wed Sep 29 20:49:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"#Line3 is the result of thousands of Minnesotans who worked through challenging conditions to bring these important resources to our state. Grateful for them today. \nhttps://t.co/fq0SB6WPL1","date":"Wed Sep 29 20:22:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Tracy Stone-Manning as head of the Bureau of Land Management isn’t just wrong—it’s dangerous. We know her record: supporting eco-terrorists and opposing active land management. Read more from my colleague, @RepNewhouse: https://t.co/izaMtafntP","date":"Wed Sep 29 19:33:09 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Inflation isn’t going away. As long as Democrats go on spending sprees on the taxpayer’s dime, this problem is only going to get worse. And if you’re not already feeling stress on your wallet, you will soon. https://t.co/CjUHtMIaS2","date":"Wed Sep 29 14:36:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"ICYMI – Last week, I introduced the Government Shutdown Prevention Act, which will create an operating plan in the event legislators cannot reach a spending agreement and cut away at our federal deficit. Read more here via the Ripon Advance https://t.co/KOkGa6EOHv","date":"Wed Sep 29 12:33:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Grateful to educators like St. Francis Superintendent Beth Giese! \nhttps://t.co/Hhj6XyILpE","date":"Tue Sep 28 21:00:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, Nancy Pelosi and @HouseDemocrats voted on a bill that legalizes abortion UNTIL BIRTH. These are far-left policies that run counter to the will of the majority of Americans.","date":"Tue Sep 28 17:17:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m excited to announce that I will be holding my first in-person town hall of 2021 next week, on October 5. The event will be hosted at the Montrose Community Center in the City Council Chambers from 7PM-8PM Central. Learn more here: https://t.co/zesaszqWtn https://t.co/N1OXZrtTjC","date":"Tue Sep 28 16:20:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks to my colleagues @RepRoKhanna @RepDarrenSoto @CongressmanGT @RepFrankLucas @RepSwalwell @RepTedBudd for joining me in this effort!","date":"Tue Sep 28 15:55:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I sent a bipartisan letter to Federal Reserve Chairman Jerome Powell highlighting the need for private sector digital asset innovation. https://t.co/JEfTBcPXTV","date":"Tue Sep 28 15:53:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This is an outright lie and @PressSec, President Biden &amp; the Democrats know it. Reality check: this legislation will add over a TRILLION dollars to our national debt, directly onto the shoulders of American workers &amp; the next generation.","date":"Tue Sep 28 14:49:49 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Decentralized digital assets like crypto give everyday investors democratic access to financial services. Government action must support private sector innovation, not compete with it. https://t.co/3jZQ1X8MSK","date":"Tue Sep 28 14:32:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"My Government Shutdown Prevention Act provides a safeguard to ensure this type of crisis won’t happen again. https://t.co/YzwXyHVuJT","date":"Tue Sep 28 13:47:26 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our federal government is currently bracing for a complete shutdown without a backup plan. That means that Americans will go without government services and millions won’t get a paycheck. https://t.co/AXbNHwSw7u","date":"Tue Sep 28 13:46:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Canada isn’t just one of our nation’s largest trading partners. We exchange culture, travelers, and maintain family bonds across our northern border. https://t.co/ccHy6gxMJZ","date":"Mon Sep 27 23:20:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"However, land ports of entry between the U.S. and Canada have been closed for over a year, putting enormous pressure on border communities, like ones in Minnesota that rely on Canadian tourism. https://t.co/xDtIf6svjb","date":"Mon Sep 27 23:20:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I joined my colleagues @RepPeteStauber &amp; @RepFischbach in a letter to Secretary of Homeland Security Alejandro Mayorkas demanding an immediate report from DHS outlining their plan for operationalizing new border procedures.","date":"Mon Sep 27 23:20:42 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, I joined my colleague @RepFrenchHill in calling for China’s voting weight at the IMF to not be increased until the CCP demonstrates it can play by the rules of the international community. https://t.co/93jISw9Q7q","date":"Mon Sep 27 21:54:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"China seeks to expand its global influence over international institutions like the IMF, World Bank &amp; G20—all while bucking OECD standards, concealing information on their lending practices, and committing human rights abuses. https://t.co/8wOdwF4JfA","date":"Mon Sep 27 21:53:52 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Amazing work is being done here! Thank you to everyone working to prevent the tragedy of suicide &amp; spread awareness. https://t.co/xmoc8DQc2f","date":"Mon Sep 27 21:40:58 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thinking of the brave health care workers heading back to serve their fellow Minnesotans at the Allina Buffalo Clinic today. I’ll be keeping the family &amp; loved ones of Lindsay Overbay, who was killed in the tragic attack on the clinic, in my prayers. https://t.co/3vG6ZlRCib","date":"Mon Sep 27 21:24:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Learn more here ⤵️ https://t.co/N8z4eDXMPc","date":"Mon Sep 27 17:12:09 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Attention high school students &amp; families: I will be hosting a Service Academy Information Night for students interested in applying to the U.S. Military Academy at West Point, U.S. Air Force Academy, U.S. Naval Academy &amp; U.S. Merchant Marine Academy. https://t.co/WsQ3GBOpRH","date":"Mon Sep 27 17:11:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m relieved that the House voted to provide funding for Israel’s Iron Dome defense system and outraged at some of my colleagues’ attempts to abandon our nation’s closest ally in the region.","date":"Mon Sep 27 13:40:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last week, Democrats nearly abandoned Israel, like they did Afghanistan, while they are under direct threat. https://t.co/QFEDCFnhQt","date":"Mon Sep 27 13:40:16 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Open. Permissionless. Private. If China bans it, you know it’s something worth fighting for.","date":"Fri Sep 24 17:01:39 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, I joined the Congressional Biofuels Caucus on a letter to President Biden urging him to stand up for rural communities and support the Renewable Fuel Standard (RFS).","date":"Fri Sep 24 16:34:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden promised he would support investments in biofuels, my colleagues &amp; I want to ensure he follows through. If the President abandons his commitment, he will cut demands for renewable, clean fuels by 5 BILLION gallons—turning his back on America’s farmers and ranchers https://t.co/k2tiCud86w","date":"Fri Sep 24 16:34:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Digital. Authoritarianism. China is forcing its citizens away from decentralized currency and onto the digital yuan so the CCP can track all money movements. You fear Big Brother? Then you should also fear what the Fed might be designing. \nhttps://t.co/We8w01gNwC","date":"Fri Sep 24 14:00:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations on a well-earned retirement, Mark! Thank you for 38 years of service to the Sixth District. \nhttps://t.co/nxTFne70UK","date":"Fri Sep 24 13:38:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud to have voted to fully fund Israel’s Iron Dome. Disappointed that eight of my colleagues decided to turn their backs on one of our nation’s most trusted allies. https://t.co/aLusIIDXYi","date":"Thu Sep 23 19:56:12 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"President Biden would rather risk further shortages in education and health care workers than let Americans make their own medical decisions. \nhttps://t.co/rDBTSiIf2x","date":"Thu Sep 23 18:59:29 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This bill is a disgusting attempt to silence the American people, and I strongly oppose it.","date":"Thu Sep 23 15:44:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"It would unconstitutionally override laws at the federal and state level to allow abortions at any time, and for any reason, UNTIL BIRTH.","date":"Thu Sep 23 15:44:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, the House is considering HR 3755. For those who oppose abortion, the overwhelming majority of Americans oppose late-term abortions, this bill is horrifying.","date":"Thu Sep 23 15:44:15 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Investing in American clean energy is a common-sense solution; it creates jobs, lowers costs for consumers, and strengthens our nation’s energy independence. #NCEW2021 https://t.co/jeDs3heat3","date":"Thu Sep 23 14:30:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Last month, there was an over 300% increase in border apprehensions from the last year. President Biden has created a crisis. \nhttps://t.co/PkDvtOMM7e","date":"Thu Sep 23 13:07:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I met with the @MNPoliceAssn to discuss how they can build community trust and improve policing, using programs like the one championed in my Community OutPost Outreach and Engagement Act. Read more about my work here: https://t.co/9S2dQrqFED","date":"Wed Sep 22 19:15:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Over the past year, our state’s law enforcement has navigated unprecedented challenges—all while battling rising crime to keep our communities safe. https://t.co/lRPTwDiF1m","date":"Wed Sep 22 19:14:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Congratulations to the @monticello_MN Fire Department on the long-awaited grand opening of their new firehouse! So glad my staff could join the department’s 30 volunteer firefighters for this exciting event. https://t.co/gVzPBYZ7aP","date":"Wed Sep 22 18:17:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"What’s more, the clean energy sector has been consistently growing, even during the COVID-19 pandemic. #NCEW2021","date":"Wed Sep 22 18:10:19 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Clean energy brings thousands of job opportunities to the Sixth Congressional District, from companies like Blattner Energy in Avon, one of our nation’s top solar contractors. #NCEW2021 https://t.co/LtMJaySXv3","date":"Wed Sep 22 18:09:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"What is a security? What is a digital asset? How can we craft a framework that keeps crypto accessible for millions of Americans? \n\nThank you to @faryarshirzad &amp; the team at @Coinbase for meeting with me today to discuss the future of innovation-friendly regulations. https://t.co/hzQE4rbDN9","date":"Wed Sep 22 15:59:24 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Great to meet with @MAKMinnesota today! Together, we’ve been working to create meaningful &amp; lasting investments into our state’s infrastructure. Thank you to the team at @MnDOT for coming out to meet with me in DC! https://t.co/TwMI1N99iX","date":"Wed Sep 22 15:15:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"You can read more about my work here: https://t.co/NuHZxXIWyI","date":"Wed Sep 22 14:00:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"As a member of the Congressional Biofuels Caucus, I believe in these clean and domestic resources that help rural America thrive. That is why I am proud to cosponsor this bipartisan resolution with my colleagues: https://t.co/OeqWoyQMoR","date":"Wed Sep 22 14:00:34 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This National Clean Energy Week, I’m proud to support innovative energy solutions like bioenergy, hydrogen &amp; more. #NCEW2021","date":"Wed Sep 22 13:57:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"On this World Alzheimer’s Day, my thoughts are with the nearly 6 million people living with this devastating disease &amp; the hard work of their caregivers. I’m proud to support the Comprehensive Care for Alzheimer’s Act, which will improve care and outcomes for patients. #EndAlz https://t.co/tmGPGbFq3f","date":"Wed Sep 22 01:02:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":".@RepDustyJohnson – you’re exactly right. This proposal will be a disaster for consumer privacy and community banks alike!","date":"Tue Sep 21 20:28:05 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@SenRandPaul This legislation will automatically decrease government spending by 1%, and reduce spending by an additional percentage point for every 90 days funding is not agreed to. Our nation’s future is not a bargaining chip—my bill will make sure our leaders don’t treat it as one.","date":"Tue Sep 21 18:43:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Today, I introduced companion legislation to my colleague @SenRandPaul's bill, which will avert a shutdown in the event a spending agreement cannot be reached by the end of the fiscal year.","date":"Tue Sep 21 18:43:06 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Our nation is again on the brink of a government shutdown that could disrupt the lives of millions of Americans. We owe our children and grandchildren a much better budget process – especially now that the country is nearly $30 TRILLION in debt. \nhttps://t.co/YzwXyId5Br","date":"Tue Sep 21 18:40:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This #NationalCleanEnergyWeek, I joined Kayla Christensen, Executive Director of the @MNEnergyForum, in conversation on how the GOP can become a leader our clean energy future. @NCEWConf #NCEW2021 https://t.co/YGTn2GBPWT","date":"Mon Sep 20 21:44:08 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Clean energy gives us the opportunity to be caretakers of our environment while also supporting economic growth. #NCEW2021 https://t.co/xuP8zNxwC3","date":"Mon Sep 20 21:41:59 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"“The likelihood there's going to be the Taliban overrunning everything and owning the whole country is highly unlikely” -President Joe Biden\nhttps://t.co/ZSSwN8VtIg","date":"Mon Sep 20 16:03:27 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks to @michaelcburgess for fighting for mental health care for all Americans! The IMD exclusion has been an arbitrary barrier to care for too long.","date":"Sat Sep 18 14:54:22 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, I spoke in support of @RepTimmons’s amendment to allow public housing residents to withhold rent for every month in which their safety concerns have been left unmet, finally giving public renters the same protections as their private-market counterparts. https://t.co/hvRGt8yojQ","date":"Thu Sep 16 22:17:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Every renter, regardless of circumstance or income, deserves safe and sanitary living conditions. I’m deeply disturbed by reports that some cities have falsified records of inspections and wait times—leaving residents stranded in unsafe housing. https://t.co/oPpECAaxIM","date":"Thu Sep 16 22:16:16 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This week, I spoke in @FinancialCmte in support of my colleague @RepAndyBarr’s amendment to require the Council to un-censor previously hidden housing reports, analysis, and data before spending any more money. https://t.co/Zm69dAymtF","date":"Thu Sep 16 19:58:58 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Government spending that ignores facts to push political messages isn’t just waste—it’s fraud. But it’s exactly what the U.S. Interagency Council on Homelessness has done when hiding data that questions the effectiveness of their taxpayer-funded programs. https://t.co/1zL4NBeVMK","date":"Thu Sep 16 19:56:35 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This #SmallBusinessWeek, we recognize the service these businesses bring to our communities, and the hard work of the @SBA_Minnesota to help keep small businesses’ doors open during this difficult time.","date":"Thu Sep 16 14:43:44 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Minnesota is home to more than 500,000 small businesses, employing over a million men and women across our state. #SmallBusinessWeek https://t.co/FX7fDjLcCc","date":"Thu Sep 16 14:42:03 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"I’m proud to join @CongressmanHice in demanding @SecBlinken work to address these abuses. https://t.co/8kUH1BkOQG","date":"Thu Sep 16 12:46:11 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The right to religious freedom should be inalienable. I’m disturbed by reports of human rights abuses being perpetrated against religious minorities in Nigeria, and their government must be held accountable.","date":"Thu Sep 16 12:46:02 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I spoke at @FinancialCmte in favor of my amendment to allow the Treasury IG to recoup ERA funds that were the subject of waste, abuse &amp; fraud. https://t.co/rm2PK8qlYi","date":"Wed Sep 15 21:44:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"However, when @HouseDemocrats pushed through a second round of funding earlier this year, they included NO oversight from the IG- leaving no safeguard that these funds would be spent appropriately.","date":"Wed Sep 15 21:44:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"During the initial rollout of the Emergency Rental Assistance Program, the Inspector General of the Treasury was given the authority to oversee the distribution of relief dollars to ensure that taxpayer money was being used for its intended purpose.","date":"Wed Sep 15 21:43:56 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"$25 billion in taxpayer dollars for emergency rental assistance is not being overseen by anyone to protect against waste, fraud, and abuse because @HouseDemocrats don’t think that’s necessary. I introduced an amendment this week to fix that. https://t.co/EoJhlacD8b","date":"Wed Sep 15 21:43:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday in @FinancialCmte I offered an amendment to the FY22 budget which would prioritize this funding to those who need it most.","date":"Wed Sep 15 20:28:50 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"We must immediately direct these funds, not needlessly expand eligibility.","date":"Wed Sep 15 20:28:36 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"The botched rollout of the Emergency Rental Assistance Program has left billions of taxpayer dollars languishing in a government program instead of going to Americans in need. https://t.co/bvhr7qXNht","date":"Wed Sep 15 20:28:20 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I spoke in support of my @FinancialCmte colleague Rep. @FrenchHill’s amendment to correct this error and stop preventable abuse of this program. https://t.co/R7Xrco7XSL","date":"Tue Sep 14 21:10:21 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Loopholes in the Rental Assistance program have allowed renters to claim benefits with no accountability, all while having their housing costs paid off by their landlords. This has an enormous cost: taxpayer dollars burned on waste and fraud.  \nhttps://t.co/ALb0dZdNs7","date":"Tue Sep 14 21:09:01 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Is @GaryGensler actually attempting to assume authority over stable coins by rebranding them “stable value coins”?","date":"Tue Sep 14 15:00:40 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Yesterday, I supported @RepJohnRose’s amendment to reallocate an additional $6 billion to address shortfalls in the Coronavirus Economic Relief for Transportation Services Program.","date":"Tue Sep 14 13:54:53 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"This has resulted in over 36,000 vehicles parked, and over 88,000 employees laid off. To make matters worse, federal rescue programs for the motorcoach industry have been drastically underfunded.","date":"Tue Sep 14 13:54:41 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"America’s motorcoach industry is a tentpole of infrastructure for our rural &amp; urban infrastructure alike—but it’s been crippled as a result of the COVID-19 outbreak.\nhttps://t.co/uWDVwQVsz5","date":"Tue Sep 14 13:54:23 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Proud of my casework team’s work on the evacuation from Afghanistan. We will not give up until every American is home safely. https://t.co/uBBYjCw3EW","date":"Tue Sep 14 13:44:18 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Thanks to my colleagues @RepFrenchHill &amp; @PeteSessions for speaking out in support of this amendment!","date":"Mon Sep 13 19:49:07 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@HouseDemocrats Today, I offered an amendment to the FY22 budget to fund the Departments of Treasury and Housing and Urban Development Inspector Generals, to ensure every dollar of the American Rescue Plan’s $1.9 trillion in spending goes to an American in need. https://t.co/PVPwduk5MH","date":"Mon Sep 13 19:48:51 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Unsurprisingly, @HouseDemocrats didn’t allocate ANY money for the Inspector Generals to oversee the American Rescue Plan programs.","date":"Mon Sep 13 19:48:00 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"There should be oversight on EVERY taxpayer dollar spent to make sure government isn’t wasting your money. . For every $1 allocated to inspector generals to oversee spending programs, $16 of waste, fraud, and abuse is uncovered. https://t.co/QrvFjJd7a4","date":"Mon Sep 13 19:47:31 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"Happy birthday to my son, Jack. Wishing you the best year yet and can’t wait to see all you accomplish! https://t.co/Sax9zCccRy","date":"Mon Sep 13 19:31:33 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepMullin @RepJohnKatko @repkevinhern @RepFranklin @RepJuliaLetlow @Jim_Jordan @RepDanBishop @boblatta @RepAndyBiggsAZ @RepGusBilirakis @RepMeuser @RepRosendale @rep_stevewomack @RepGarbarino @RepLisaMcClain @JeffFortenberry @RobWittman @michaelcburgess","date":"Mon Sep 13 15:33:43 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepRonEstes @RepMoBrooks @RepWesterman @RepDonaldsPress @RepJimBanks @RepDLamborn @RepDLesko @RepBarryMoore @RepYoungKim @MarioDB @RodneyDavis @RepFischbach @RepTomRice @Rep_Clyde","date":"Mon Sep 13 15:33:26 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@CongressmanGT @RepMikeJohnson @RepTimmons @RepPfluger @RepArrington @VernBuchanan @RepJasonSmith @RepTenney @RepJenniffer @RepTrentKelly @RepFeenstra @RepLizCheney @RepDrewFerguson @RepLaMalfa @MikeKellyPA \n@RepBryanSteil","date":"Mon Sep 13 15:33:14 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepJackBergman @cathymcmorris @RepMeijer @RepMalliotakis @RepKenBuck @replouiegohmert @RepDavidValadao @KenCalvert @RepWalberg @CongressmanHice @RepRichHudson @RepGuthrie @RepFredKeller @RepPeteStauber @RepScottPerry @JudgeCarter @RepFredUpton\n@RepGrothman @RepTimBurchett","date":"Mon Sep 13 15:32:38 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepHartzler @RepKinzinger @RepGallagher @DHarshbargerTN1 @RepMaryMiller @RepKatCammack @RepLaHood @RepFitzgerald @RepBost @RepHagedorn @RepChuck @RepBlakeMoore @RepMikeRogersAL @RepDevinNunes @RepTrey @RepBurgessOwens @RepJerryCarl @RepDonBacon @RepAndyHarrisMD @RepMoolenaar","date":"Mon Sep 13 15:32:25 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepAnnWagner @RepJeffDuncan @RepRalphNorman @RepBlaine @RepAshleyHinson @RepAdrianSmith @PeteSessions @RepBobGibbs @RepAndyBarr @TXRandy14 @RepTedBudd @RepAlexMooney @RepLoudermilk @WarrenDavidson @Lancegooden @RepHerrell @RepDustyJohnson @RepMMM @RepGregMurphy @RepBenCline @RepHuizenga @RepBrianFitz @RepBalderson @RepCarolMiller @RepCloudTX @RepFrenchHill @RepJohnRose @RepWalorski @RepStefanik @RepVanTaylor @GReschenthaler @RepLarryBucshon @congbillposey @RepArmstrongND","date":"Mon Sep 13 15:32:10 +0000 2021","user_id":"2914515430"},{"handle":"RepTomEmmer","text":"@RepAnnWagner @RepJeffDuncan @RepRalphNorman @RepBlaine @RepAshleyHinson @RepAdrianSmith @PeteSessions @RepBobGibbs @RepAndyBarr @TXRandy14 @RepTedBudd @RepAlexMooney @RepLoudermilk @WarrenDavidson @RepRWilliams @DesJarlaisTN04 @AustinScottGA08 @RepMarkGreen @RepFrankLucas @RepRickAllen @TomColeOK04 @RepBradWenstrup @RepDavidKustoff @RepBuddyCarter @RepDavid @RepSmucker @RepMann @RepLeeZeldin @RepMichaelGuest @RepBethVanDuyne @RepJamesComer @RepChipRoy @RepAGonzalez","date":"Mon Sep 13 15:31:53 +0000 2021","user_id":"2914515430"}]