[{"handle":"RepTiffany","text":"Biden’s war on American energy is intentional. \n\nIt’s all a ploy to force YOU to buy into their green fantasy.\n\nDon’t take my word for it, take Biden’s own Secretary of Energy's. https://t.co/U4Hfzw96fG","date":"Thu Jun 16 17:28:01 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Another record-setting month for illegal border crossings as the Biden-induced tidal wave of foreign migrants continues to flood American communities.\nhttps://t.co/0S3NQFZOmt","date":"Thu Jun 16 13:24:56 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden administration has turned our federal government into the biggest human trafficker in the world. \n\nThey could stop what’s going on down at our southern border. \n\nYet, they willfully refuse. https://t.co/Xt8QEm3bEs","date":"Wed Jun 15 23:17:20 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tomorrow morning I will be joining @jdtcnt with @RepPeteStauber to discuss how President Biden’s disastrous energy policies have led to skyrocketing gas prices and possible summer blackouts in the Midwest.\n\nBe sure to tune in at 7:55 AM CST!\nhttps://t.co/P6RZiNfmC8","date":"Tue Jun 14 22:52:20 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"For the first time, the Midwest Independent System Operator (MISO) is warning of potential power outages and blackouts this summer, something that could get worse as our nation continues to shift away from traditional, reliable energy sources.\nhttps://t.co/WfyoEDCazu","date":"Tue Jun 14 18:45:45 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This just goes to show why it is so important to balance our budget. \n\nDemocrats believe they can keep spending YOUR tax dollars like there’s no tomorrow.\n\nThankfully, the @RepublicanStudy introduced a fiscally responsible budget that will balance our budget in only 7 years.","date":"Tue Jun 14 18:04:18 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you, @RepBoebert, @RepAndyBiggsAZ, @Lancegooden, @WarrenDavidson, @RepBenCline, and @RepMalliotakis, for joining this effort.","date":"Tue Jun 14 16:34:39 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The refusal of soft-on-crime DAs and Biden's DOJ to enforce the law, go hand in hand with the tragic outcomes that we see in news reports every day.\n \nToday, I demanded @TheJusticeDept to pick up the slack where rogue prosecutors have declined to prosecute certain federal crimes. https://t.co/lVgadmNeNg","date":"Tue Jun 14 16:34:38 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Families and small businesses across America are fighting record gas prices, soaring grocery bills, and runaway inflation.\n\nThe White House @PressSec says this is what a \"historic economic boom\" looks like. https://t.co/Xb9P7COKV8","date":"Tue Jun 14 13:49:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The only way we’d hear less about the Kavanaugh suspect is if he was on Hunter Biden’s laptop.","date":"Mon Jun 13 13:29:57 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden still hasn't met with the victims’ families in Waukesha. Meanwhile, de-fund the police extremists are getting the VIP treatment.\nhttps://t.co/S3JsfWe3dQ","date":"Mon Jun 13 12:47:07 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Gee, I wonder what happened right there?\n\nOh wait, that's when President Biden and the rubber-stamped Congress were sworn in. https://t.co/0yAmnYcxFE","date":"Fri Jun 10 17:11:10 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Inflation rose 8.6% in May. Gas prices are $5 a gallon. A recession is looming.\n\nBy the way @POTUS, Jimmy Carter called to thank you for making him look good. https://t.co/CFP7uzb3dn","date":"Fri Jun 10 13:30:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Will there now be a prime time hearing on inflation?\nhttps://t.co/XAXYpWnuek","date":"Fri Jun 10 13:06:22 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unfortunately, my colleagues on the other side of the aisle refused my legislative request to hold prosecutors responsible.\n\nInstead, they would rather have violent criminals roaming our streets.","date":"Wed Jun 08 19:27:04 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Rogue prosecutors in Dem-run cities, like Milwaukee, continue to release predators from custody almost as fast as the police can arrest them.\n\nAmericans are sick &amp; tired of the lawlessness!\n\nWe need to focus on putting criminals behind bars to prevent tragedies from occurring. https://t.co/fCj7x2SCK5","date":"Wed Jun 08 19:27:03 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It was great meeting with @AFPWI to discuss affordable energy, inflation, and increased access to healthcare in the Northwoods.\n\nAlways great to see fellow Wisconsinites on the Hill!","date":"Wed Jun 08 18:31:43 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you to everyone in #WI07 who joined my telephone town hall last night with @Jim_Jordan.\n\nWe heard from many Wisconsinites who are feeling the pain of $5 for a gallon of gas and 40-year high inflation. \n\nI enjoyed discussing solutions and looking forward to the next one! https://t.co/siIgyGAGnW","date":"Wed Jun 08 15:55:19 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Joe Biden 🤝 Communist China https://t.co/E9GrduWBsg","date":"Tue Jun 07 15:21:40 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It was great to join my good friend @RepPeteStauber for a roundtable where we heard from local business leaders.\n\nI am hoping Congress can work together to unleash American energy and stop excessive government spending to help ease some of their concerns.","date":"Fri Jun 03 20:04:59 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"So the @WhiteHouse’s plan to tackle #inflation is better press releases?","date":"Thu Jun 02 22:09:37 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The knee-jerk reaction from Democrats is to punish law-abiding citizens for the sins of the few.\n\nInstead of proposing messaging power grabs that exploit recent tragedies to take away our rights, we need real solutions that address the mental health crisis &amp; crime in our society. https://t.co/4qM8cfhsPV","date":"Thu Jun 02 17:09:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Not only today, but every day, we pay homage to the brave heroes who paid the ultimate sacrifice fighting for our flag, our values, &amp; our way of life – for without their sacrifice, our stars and stripes would not be waving proud.\n\nWe may not know them all, but we owe them all.🇺🇸 https://t.co/xdhMzOwnOz","date":"Mon May 30 14:28:26 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The WHO is a corrupt, wholly-owned subsidiary of Communist China.\n\nGiving this bureaucracy even more power after the incompetence of the last 2 years is like hiring the arsonist who started the fire to help you put it out.\n\nWe must withdraw from #WHO!\nhttps://t.co/wfFmnysSPV","date":"Fri May 27 13:54:20 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Spending tens of billions of dollars in foreign aid month after month while American families struggle to pay their bills is not what I was sent to Congress to do.\n\nThank you, @RepHerrell, for leading this effort and demanding accountability for the American taxpayers.","date":"Tue May 24 20:29:21 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"A great read from my good friend @RepPeteStauber.\n\nInstead of crippling our domestic mining industry and increasing our reliance on foreign countries, like China, for critical minerals, we need to support Made-in-America mining here at home.\nhttps://t.co/UK6qqybMMJ","date":"Tue May 24 16:09:42 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"A BIG win for energy affordability and reliability in Wisconsin and the Upper Midwest.\n\n#EnergyIndependence \nhttps://t.co/pRSwdu7y18","date":"Tue May 24 15:54:48 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"President Biden’s decision to rejoin the corrupt @WHO is concerning enough.\n\nGranting this international bureaucracy even more power is almost unthinkable.\n\nWe must #DefundtheWHO!\nhttps://t.co/BWn9gtVO17","date":"Mon May 23 17:31:27 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden-Pelosi \"solution\" to the baby formula shortage is to give FDA bureaucrats a $28 million raise?\n\nBlank checks for bureaucrats is not the formula needed to fix this crisis. https://t.co/tpreVVrsu8","date":"Thu May 19 16:18:20 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Americans cannot find baby formula.\n\nAmericans cannot afford gas.\n\nAmericans cannot safely walk on the streets in major cities.\n\nWelcome to another day in Joe Biden’s America!","date":"Thu May 19 14:00:16 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Who knew George Orwell’s \"1984\" would become a how-to manual for the Biden administration?\n\nWhile freedom-loving Americans stood up and shut down Biden’s Orwellian Disinformation Governance Board, we must make sure that nothing like this is ever created again. https://t.co/QRKpmJzo4Q","date":"Thu May 19 13:02:46 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Firebombings of pro-life groups &amp; intimidation of justices are all acceptable to the Democrats—despite having clear law that makes it a crime.\n\nNow, abortion activists are calling for a summer of rage.\n\nWhere is Biden's DOJ? Off targeting concerned parents. https://t.co/GHgXfMMc1A","date":"Wed May 18 20:24:37 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This week, I asked President Biden to visit #Taiwan and meet with President Tsai @iingwen during his trip to Asia. I sincerely hope he will consider doing so. America doesn't need a permission slip from #China to talk to our friends and partners.\n\nhttps://t.co/3RmCiHXiC9","date":"Wed May 18 12:52:48 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Back in February, Joe Biden said he was using “every tool” to bring down gas prices.\n\nFast forward to May, and gas prices are still at an all-time high.\n\nIt’s safe to say that Joe’s “tools” aren’t the sharpest in the shed.","date":"Tue May 17 19:56:55 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Despite the fact that the gray wolf has recovered, radical environmentalists, with help from a California judge, have re-listed the gray wolf, posing an ongoing threat to farmers and pet owners in Wisconsin.\n\nIt’s time for states to be in charge of their own wolf management.","date":"Tue May 17 13:06:02 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden’s DHS @SecMayorkas told us two weeks ago that the border is secure. \n\nMeanwhile...","date":"Mon May 16 20:06:44 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Canceling American oil and gas leases when prices at the pump are at record highs is a little like giving baby formula to illegal aliens for free when American parents can't find it in stores.\nhttps://t.co/vJIWjfpqQW","date":"Mon May 16 15:10:37 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Just talk to your local sheriff's offices who are seeing the impact firsthand and they will tell you that they saw more fentanyl-related deaths than car accidents last year.","date":"Fri May 13 19:09:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It doesn’t have to be this way, and it shouldn’t be a political issue. This is an American issue, and for the sake of American lives, it’s long past time to change course.\n\nRead more from my latest op-ed👇.\nhttps://t.co/c9jOybxIll","date":"Fri May 13 19:09:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"By refusing to enforce our immigration law, President Biden has already shattered the peace and quiet of too many American neighborhoods, leaving countless families who have lost a son or a daughter to fentanyl poisoning as collateral damage.\n\nThread🧵 https://t.co/9plk6sDbJV","date":"Fri May 13 19:09:52 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"From free cell phones, travel expenses, hotel rooms, and more, taxpayers are picking up the running tab for President Biden’s open borders obsession.\n\nThe No More Phones Act is a step in the right direction to get taxpayers out of the business of funding the #BidenBorderCrisis.","date":"Thu May 12 19:36:36 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"At a time when Americans can barely afford groceries, families cannot find baby formula, and gas prices are at an all-time high, the Biden administration is focused on canceling oil &amp; gas leases, spending $40 billion in Ukraine, and being the arbiter of truth.\n\nLet that sink in.","date":"Thu May 12 18:57:50 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The only thing Democrats want to produce in America is more paperwork and more bureaucracy. \n\n@NatResources has solutions to cut red tape and tap into Made in America mineral resources, but as with every other crisis, the one-party rule in Washington continues to ignore them. https://t.co/zYGsimLxil","date":"Thu May 12 16:56:15 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Americans cannot even find baby formula at their local grocery stores, but the Biden administration is reportedly using your tax dollars to make sure people who are not American citizens have some.\n\nAmericans last, illegals first!\nhttps://t.co/5wtPVW3Smb","date":"Thu May 12 15:12:16 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Left-wing extremists have shown us time and time again, first during the summer of 2020 &amp; now with the arson of Wisconsin Family Action, that they will resort to violence when they do not get their way.\n\nBiden's DOJ must put political beliefs aside &amp; investigate this heinous act. https://t.co/6M7DU9yVoV","date":"Thu May 12 14:28:04 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Despite an increase in attacks, each day, our heroes in blue suit up to keep us safe.\n\nLet's take time during #NationalPoliceWeek to pay tribute to those who have lost their lives in the line of duty and reaffirm our support for those protecting us.\n\nEvery week, we #BackTheBlue! https://t.co/OQqIgSv2Uz","date":"Wed May 11 20:49:13 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Last May: The Biden administration swore inflation would not be a problem, labeling it “temporary.”\n\nThis May: #BidenInflation remains at a near 40-year high as the CPI rose 8.3% in April.\n\nAmericans simply cannot afford more lies from the Biden brigade!\nhttps://t.co/YETJLVCCCu","date":"Wed May 11 16:32:04 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Stay safe #WI07!","date":"Tue May 10 20:53:31 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Republicans are fighting to refuel America by:\n\n    ☑️Restarting the Keystone XL Pipeline\n    ☑️Drilling for more American oil and gas\n    ☑️Stopping the “green fantasy” regulatory assault on energy producers\n\nYet, the No Plan Democrats would rather force Americans to pay MORE!","date":"Tue May 10 17:17:57 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats are scrambling to blame inflation on everything else besides the root cause – themselves. \n\nTheir unhinged spending crushed our economy, and now Americans are bearing the brunt of it.\n\nIt’s time for Joe “the buck stops with me” Biden to take responsibility! https://t.co/AAMl79Ie9Z","date":"Tue May 10 17:02:33 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Stop spending trillions of dollars we don't have!\n\nStop paying able-bodied, working-aged Americans to stay home!\n\nDrill for oil and gas here in America!\n\nYour turn, @POTUS.","date":"Tue May 10 14:55:07 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This administration keeps breaking records for all the WRONG REASONS!\n\nInstead of unleashing domestic energy production, Biden’s anti-American energy wrath continues to punish hardworking Americans.","date":"Tue May 10 13:20:08 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden’s Orwellian style #MinistryofTruth is yet another attempt from the Divider in Chief to weaponize the government against We the People.\n\nDHS has no business policing speech!\n\nTheir business is to secure our homeland - a task they have mismanaged &amp; neglected for far too long.","date":"Fri May 06 19:10:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is becoming a pattern. It should be in his Twitter bio.","date":"Wed May 04 19:32:17 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Big Brother Biden’s CDC tracked millions of Americans’ phones to spy on YOUR location during the pandemic.\n\nAnd they did it by using YOUR tax dollars.\nhttps://t.co/KzBoF6kJkd","date":"Wed May 04 17:26:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This bone-headed scheme was an insult to vets from the very beginning, one the #Biden administration should never have even considered.","date":"Wed May 04 16:32:10 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Coming soon to a neighborhood near you.","date":"Tue May 03 21:50:56 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"94% of Americans are concerned about inflation.\n\nYet, over the weekend President Biden and liberal elites made a mockery of how much Americans and seniors living on fixed income are paying for gas and goods.\n\nCan this administration be anymore out of touch with reality? https://t.co/iuTQZNXXYn","date":"Tue May 03 16:54:25 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden administration just broke another record.","date":"Mon May 02 16:05:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden administration continues to shove their green fantasy down the throats of the American people and our hardworking farmers.\n\nThey would rather have us spend more than drill more!\nhttps://t.co/8XNR5mWvf4","date":"Mon May 02 15:36:44 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Elon: Pays $44 Billion to protect the freedom of speech. \n\nBiden: How can we still censor conservatives? https://t.co/OhAgDj97cY","date":"Fri Apr 29 23:19:56 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"WATCH: @SecMayorkas, who says he is “proud” of the way DHS handled the Afghan evacuees' “vetting” process, ADMITS that the Biden administration DID NOT vet Afghans properly before bringing them into the United States.\n\n@JudiciaryGOP https://t.co/SvKRaXL8Ti","date":"Thu Apr 28 18:37:01 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"How many more Americans have to die from drug overdoses until Joe Biden secures our border?\n\nHow many more migrants have to perish on their journey that the Biden admin is incentivizing?\n\nHow many more women have to be trafficked by cartels?\n\n@SecMayorkas &amp; @POTUS, how many more? https://t.co/ylUzTbKutb","date":"Thu Apr 28 15:21:11 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"TUNE IN: @RepBoebert and I will join Meg Ellefson on @WSAU at 8:05 AM CST to discuss Biden’s border crisis, the need for America’s energy independence, and more.\n\nLISTEN HERE👇\nhttps://t.co/qDwUFFcWv9","date":"Thu Apr 28 12:58:28 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden administration has executed a comprehensive and deliberate strategy to destroy the sovereignty of our nation.\n\nThere is nothing safe, orderly, and humane about it.\n\n@SecMayorkas has intentionally made a mockery of our immigration law, and tomorrow I will demand answers. https://t.co/NiNkEHbK4m","date":"Wed Apr 27 15:47:59 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden White House: \"The economy is great and inflation is transitory\"\n\nAlso the Biden White House: \"There might be food shortages.\"","date":"Wed Apr 27 12:59:15 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Coming up on @newsmax, I will be discussing the crisis at our southern border, and what I hope to hear from @SecMayorkas tomorrow in the @JudiciaryGOP hearing.\n\nWatch here 👇\nhttps://t.co/pzvihtIv4K","date":"Wed Apr 27 12:57:29 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"While I guess I won't ever be taking that \"dream\" vacation to Siberia, I couldn't care less about what Vladimir Putin and his Kremlin cronies think of me.\n\nhttps://t.co/JW3zATYCOQ https://t.co/ZXKGTPeeYT","date":"Tue Apr 26 20:18:10 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"From fentanyl poisonings to terrorist crossings, the sovereignty of our southern border is under siege.\n\nLast week, I joined @STEPHMHAMILL to discuss the national security crisis that is taking place down at our southern border and ending up in northern and western Wisconsin. https://t.co/rRCbgOnTpM","date":"Mon Apr 25 19:36:34 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Just last week I heard from migrants who paid $3,000-$5,000 a head to Mexican cartels for their journey to our southern border.\n\nThe Biden administration knows this, and they are incentivizing even more life-threatening travel.\n\n@SecMayorkas must explain this to @JudiciaryGOP! https://t.co/67Pfva86g0","date":"Mon Apr 25 16:05:05 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tragic news continues to come from the chaotic southern border.\n\nBiden orchestrated this all on his own, and he could easily stop this if he wanted to.","date":"Sun Apr 24 15:44:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tune in below 👇","date":"Fri Apr 22 18:23:48 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Fixed it for you, @thehill. https://t.co/i6kijHv1Bl","date":"Wed Apr 20 21:52:18 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden bureaucracy should respect the court ruling lifting his misguided mask mandate! \n\nI will introduce legislation that blocks any appeal of that decision when Congress reconvenes so Americans can continue to breathe easier.\nhttps://t.co/ju5wQ4J411","date":"Wed Apr 20 16:58:49 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"You’ve already paid for the border wall materials.\n\nAll Joe Biden has to do is allow it to be built. \n\nLet’s Build Back Better &amp; FINISH THE WALL! https://t.co/MJnHuCl3Ml","date":"Wed Apr 20 00:41:10 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is nothing but a photo op. I’ve seen the horrors of the Darién Gap firsthand.\n\n#ImpeachMayorkas","date":"Tue Apr 19 19:36:47 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats claim they are the “green” party, but I’ll let you be the judge. Take a look at the environmental impact of Biden’s open borders. ⤵️ https://t.co/eOSf9qM9Ki","date":"Tue Apr 19 19:00:38 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #BidenBorderCrisis is coming through @sherifflamb1's front yard and landing right in our backyards in Wisconsin.\n \nFentanyl is poisoning Americans. Cartels are trafficking women. And Joe Biden is deliberately allowing it to continue under his watch. https://t.co/t5jE1D6TTa","date":"Tue Apr 19 03:04:28 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I’ll be going live on @stinchfield1776 with @sherifflamb1 in a few minutes. \n\nTune in below!\nhttps://t.co/DUR2qIHiQ5","date":"Mon Apr 18 23:55:03 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Hey guys. You're only 15 months and 3 million illegal migrants late!\n\nhttps://t.co/3pRzVxqa1c","date":"Mon Apr 18 18:10:36 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I warned last year that allowing thousands of poorly vetted foreigners into the US first and asking questions later would have consequences. \n\nPresident Biden's plan to further loosen entry restrictions at our border will only make a bad situation worse.\nhttps://t.co/y6nNGvRi4d","date":"Mon Apr 18 13:01:51 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"He is risen! From my family to yours, we wish you a happy Easter full of peace and blessings. https://t.co/4CYOQsYWf1","date":"Sun Apr 17 13:15:14 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Is the Biden administration considering putting the care of veterans on the back burner to help assist with their self-inflicted #BidenBorderCrisis?\n\nThat would be a disservice to our veterans, and I thank @CongressmanHice for raising this concerning issue.","date":"Thu Apr 14 18:03:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The “MINKS” Amendment in the COMPETES Act would devastate mink farmers across America, especially here at home in #WI07. \n\nThis backdoor attack on our hardworking mink farmers must be stopped!\nhttps://t.co/tOJGnPsEzJ","date":"Thu Apr 14 14:57:51 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"President Biden keeps trying to pass the buck when it comes to the inflation disaster his reckless policies have caused.\n\nBut the fact of the matter is that Joe Biden is single-handedly responsible for the inflation tax that is hammering everyday Americans.\n\nSee for yourself ⤵️ https://t.co/sMAkhgUFa6","date":"Thu Apr 14 13:10:14 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Despite warnings of a mass migration event, the Biden admin lifted Title 42, and now 140,000 migrants are headed toward our southern border.\n\n#SleepyJoe and #BorderCzarHarris need to wake up and listen to the majority of Americans.\n\nSecure our border now!\nhttps://t.co/XiHA8Ky5SR","date":"Wed Apr 13 16:52:16 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"And the POLITICAL science continues.\n\nThe Biden administration is planning to extend the mask mandate on planes, but they are lifting pandemic restrictions on illegal aliens.\n\nWill they ever stop putting the American people LAST?\n\nhttps://t.co/suq5zN9zze","date":"Wed Apr 13 15:47:44 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is not Putin’s price hike. This is not transitory. This is not a high class problem.\n\nEvery single American is bearing the brunt of Biden’s 8.5% inflation tax.\nhttps://t.co/rRqQLDgRI6","date":"Tue Apr 12 14:37:47 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This👇","date":"Mon Apr 11 19:47:50 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@RepGallagher @RepBryanSteil @RepBenCline for joining this effort.","date":"Mon Apr 11 16:53:55 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you @RepNewhouse @RepWesterman @RepAndyBiggsAZ @RepBentz @RepJackBergman @RepKenBuck @RepTomEmmer @RepFischbach @RepRussFulcher @replouiegohmert @RepGrothman @RepHerrell @RepDLamborn @RepMcClintock @RepScottPerry @RepRosendale @RepPeteStauber @Congressman_JVD and","date":"Mon Apr 11 16:53:54 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unelected bureaucrats &amp; California judges do not know what is best for Wisconsin’s wolf management – state officials do.\n\nThat’s why @RepBoebert and I led a letter to @SecDebHaaland demanding her to follow the science &amp; appeal a recent decision to re-list the gray wolf. https://t.co/NylXnlGp5b","date":"Mon Apr 11 16:53:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"American tax dollars are funding Biden’s mass illegal immigration.\n\nFirst, it’s debit cards and cell phones. \n\nThen, it's hotels, air travel, education, and heath care.\n\nIt never ends, and it’s destroying the American Dream for those legally waiting their turn. https://t.co/NXzcARyHiq","date":"Thu Apr 07 14:41:35 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It's no secret that @SpeakerPelosi and I don't agree on much, but I'm glad she is paying an official visit to #Taiwan -- and ignoring the predictable temper tantrum from the Chinese Communist Party.\nhttps://t.co/UbwBLwXqeQ","date":"Thu Apr 07 12:21:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Until @HouseJudiciary addresses the crisis at our southern border, the American people will continue to pay the price.\n\nWe will continue to pay not only with our tax dollars, but through drug overdoses and sex trafficking.\n\nIt’s mind-boggling that Democrats are okay with this! https://t.co/GtT9jOzey5","date":"Wed Apr 06 23:04:48 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden admin is willfully removing the last tool in America’s toolbox to deter illegal immigration. \n\nBy lifting pandemic restrictions on illegal aliens, #Biden is deliberately opening the flood gates to more migrants and more drugs while making communities less safe.","date":"Tue Apr 05 20:59:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Farmers all across #WI07 are struggling to break even this year due to rising fertilizer and fuel costs.\n\nI demand President Biden reverse his anti-American energy policies to alleviate some of the pressure our hardworking farmers are facing this spring planting season.","date":"Tue Apr 05 17:11:22 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"If Joe Biden and Kamala Harris actually cared about the crisis at our southern border, don’t you think they would take a visit there?\n\nIt’s clear they do not care, and as a result of ending Title 42, Americans will further suffer the consequences of the #BidenBorderCrisis. https://t.co/7H5HdqLrKU","date":"Tue Apr 05 16:04:29 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats are rushing to free illegal aliens from pandemic restrictions at the southern border.\n\nBut Americans are still forced to wear masks on planes, trains, Uber's, and in some classrooms.\n\nHow does that make sense?\nhttps://t.co/1obO7K3GT1","date":"Mon Apr 04 22:47:11 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unfortunately not an April Fools' joke, folks! https://t.co/B1EmOjaeJl","date":"Fri Apr 01 14:52:31 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@NRDems might dismiss the skyrocketing propane costs Americans are facing, but here in Wisconsin, it’s pretty darn important to keep your home warm. \n\nThe Biden administration should stop funding authoritarian regimes and allow America’s energy capabilities to lead the world. https://t.co/5FGUhSeWuA","date":"Thu Mar 31 21:32:49 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"#TBT to last March when President Biden claimed his border crisis was \"seasonal.\"\n\nOVER 2 MILLION illegal border crossings later, and we know that wasn't true.\n\nSeasons come and go, but the #BidenBorderCrisis is well into its 2nd year with no end in sight! https://t.co/7fwnO2I5p7","date":"Thu Mar 31 20:27:03 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #CCP has taken advantage of their preferential trade status for over two decades.\n\nIt’s past time for Congress to right the wrongs made by previous lawmakers and revoke China’s Most Favored Nation trade status.\n\nIf not, America’s manufacturing sector will continue to suffer.","date":"Thu Mar 31 18:44:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats in the House are still trying to falsify label Biden’s own energy crisis as Putin’s price hike.\n\nEnough with the excuses, here are the facts! https://t.co/YYfjvWMbif","date":"Thu Mar 31 17:22:18 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I’ve heard from many Wisconsin farmers who can no longer compete with the corporate welfare that has propped up substandard energy sources for far too long.\n\nThe FARM Act is a much-needed policy that will restore fairness to energy and agricultural policy.\nhttps://t.co/xusQ0pUlvn","date":"Thu Mar 31 14:36:52 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"So this is what they meant by the #BidenBoom?\n\nAmericans will be spending an EXTRA $433 per month on average to keep up with Biden’s inflation tax.\nhttps://t.co/cdv9vESYra","date":"Wed Mar 30 16:50:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"President Biden might claim his polices aren’t holding back domestic energy production, but he isn’t fooling anyone.\n\n#EndTheBidenBan and unleash domestic oil and gas production!","date":"Wed Mar 30 15:24:24 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden admin admits it will soon unleash a new flood of illegal migrants into US – as many as 18,000 per day – overwhelming our communities, our schools, our welfare, and our public health system.\n\nEnough is enough. Secure the southern border now!\nhttps://t.co/kiNugXs3EU","date":"Wed Mar 30 14:48:27 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #BidenBorderCrisis gets worse every day.\n\nPresident Biden and @SecMayorkas should stop empowering cartels and human traffickers and start enforcing the law.","date":"Tue Mar 29 18:12:21 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Your tax dollars hard at work.\nhttps://t.co/02ncvIT7Yn","date":"Tue Mar 29 12:31:02 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The organized retail crime wave sweeping our nation is a result of the Dems’ soft-on-crime policies.\n\nWhile local law enforcement are doing all they can to stop these smash-and-grab syndicates, they can’t do it alone.\n\nThe Biden admin must stop coddling criminals and punish them!","date":"Mon Mar 28 15:55:55 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"President Biden said global food shortages are “gonna be real.” So why is he spending your hard-earned tax dollars to take prime US farmland out of production?\nhttps://t.co/WwhUMj9RXP","date":"Mon Mar 28 14:02:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Less than 9% of the \"so-called\" #AmericanRescuePlan went to combating the virus through vaccines and testing.\n\nYet Speaker Pelosi says she wants $45 billion more in “COVID” aid.\n\nWhy would we want to spend MORE tax dollars on golf courses and ballparks!","date":"Thu Mar 24 15:58:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden admin must stop its knee-jerk policy of importing thousands of refugees into the US first and asking questions later. Displaced Ukrainians should be resettled in nearby countries so they can more easily return home when the situation stabilizes.\nhttps://t.co/948Fz7HJgX","date":"Thu Mar 24 14:28:42 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Under President Trump, Wisconsinites were paying $1.45 for a gallon of propane in March 2020.\n\nTwo years later under President Biden, Wisconsinites are now paying $2.64 per gallon to heat their homes.\n\nFrom keeping warm to filling up, Biden’s green price hike is hurting everyone!","date":"Wed Mar 23 15:31:33 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"America's trade policy with Communist #China has been a total disaster for 20 years. It has made America weaker, and China's oppressors stronger. That's why I introduced bipartisan legislation with Rep. Chris Smith &amp; @RepTomSuozzi to end it.\nhttps://t.co/N5zKBbf441","date":"Wed Mar 23 13:00:46 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"For too long, presidents of both parties have embraced a failed and unfair trade policy that has shipped our jobs to China and enriched the brutal dictatorship in Beijing. It's time for a change.\nhttps://t.co/OnHhdyJbsC","date":"Tue Mar 22 23:56:48 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Over the last two decades, we’ve seen America’s manufacturing sector suffer while China’s rulers engage in slavery &amp; genocide.\n\nWe can't afford to enable this bad behavior on a ‘permanent’ basis anymore. China's preferential trade status must be revoked!\nhttps://t.co/GkWWMoUWSD","date":"Tue Mar 22 19:56:42 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Going live on @iHeartRadio with @VickiMcKenna in a few minutes.\n\n👇Tune in below!\n\nhttps://t.co/FKUZgOy0GI","date":"Tue Mar 22 19:28:09 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Farmers, ranchers, hunters, and pet-owners have seen enough real-world evidence to know that it is their lives and livelihoods being threatened by federal policy decisions – not the wolves’.\n\nCongress must pass H.R. 286, the Managing Predators Act!\nhttps://t.co/cghocI9K4W","date":"Tue Mar 22 14:14:36 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Three more years to flatten Biden's \"transitory\" inflation curve?","date":"Tue Mar 22 12:46:38 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Judge Jackson’s troubling record of handing down light sentences to individuals convicted of child pornography and sexual abuse raise serious questions about her fitness to serve on the Supreme Court. \n\nWe must get to the bottom of this!","date":"Mon Mar 21 21:51:49 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Joe Biden has made America a global mecca for \"crime tourism.\"\n\nhttps://t.co/OJlRGg3e8b","date":"Sat Mar 19 13:30:00 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Don Young spent most of his life singularly focused on serving the people of Alaska. His loss will be felt deeply across the Last Frontier.\n\nMy prayers are with his family and loved ones during this time.","date":"Sat Mar 19 02:27:55 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As inflation, gas prices, violent crime, and illegal immigration spiral out of control to record highs, this is what Congress is debating before lawmakers head home for Spring Break. https://t.co/LRj4omuNEZ","date":"Fri Mar 18 15:18:44 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wisconsinites are paying MORE to heat their home, MORE to fill up their tank, &amp; what is President Biden doing about it?\n\nHe is doubling down on the same exact anti-America energy policies that got us here in the first place.\n\nBiden’s green fantasy has become America’s nightmare! https://t.co/UtLXQ1kkx7","date":"Thu Mar 17 21:25:22 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This \"mass migration event\" was triggered on Jan. 20, 2021 when the Biden admin rolled out the welcome mat for illegal aliens by refusing to enforce our laws.\n\nNow they're acting surprised that millions of migrants are poised to make a run for the border.\nhttps://t.co/tqavdXwScb","date":"Thu Mar 17 20:36:31 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Working in Washington, but still repping my Wisconsin pride.\n\n@BadgerMBB all the way! Go Badgers! https://t.co/J6JDi29Nmb","date":"Thu Mar 17 16:03:34 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats defunded the police. Woke prosecutors did not prosecute crime. And now we have a violent crime wave sweeping our nation.\n\nFacts are facts.\n\nI hope and pray the Democrats reverse course, but so far, it’s clear that Biden’s “fund the police” cry was just lip service. https://t.co/d1eJ4ftXie","date":"Wed Mar 16 23:30:46 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Interesting… Kamala Harris is increasing travel to tout “infrastructure” and Biden’s overreaching executive orders, but she can’t find time to visit the epicenter of their self-inflicted border crisis.\n\nI thought she was suppose to be Biden’s Border Czar?\nhttps://t.co/T65C5Kytwq","date":"Wed Mar 16 14:02:41 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"At his SOTU, Biden pledged to “stop the flow of illicit drugs” following the worst year of drug overdoses in America.\n\nSadly, this was another Biden lie.\n\nCartels continue to smuggle fentanyl &amp; Americans continue to lose loved ones each day Biden refuses to secure our border.","date":"Tue Mar 15 22:09:08 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"There is nothing “seasonal” about Biden’s border crisis. \n\nBiden’s year-round border crisis is emboldening cartels, allowing fentanyl to flow freely, and harming our communities.\n\nKeep Title 42 in place and secure the southern border now! https://t.co/gLoZSuGyXA","date":"Tue Mar 15 18:51:05 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Sane Americans who live in the real world dispute this claim.","date":"Mon Mar 14 23:28:56 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The White House messaging plan: Repeat the same lie over and over again in hopes that someone will start to believe it.\n\nDesperation has clearly set in, and the American people aren’t buying it.","date":"Mon Mar 14 20:01:13 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Joe Biden is breaking records for all the wrong reasons.\n\n🚨 All-time record high for gas\n🚨 40-year record high for inflation\n🚨 Record homicides in 16 cities \n🚨 Record high of drug overdoses\n\nIt doesn’t have to be this way, but it’s the sad reality of the Dems’ one-party rule.","date":"Mon Mar 14 19:18:00 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Apparently President Biden thinks working class people are idiots.\n\nCan this administration be anymore tone deaf and out of touch with reality?\nhttps://t.co/uT5WqEHk7H","date":"Fri Mar 11 21:49:49 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Economists warned that the “so-called” American Rescue Plan would stoke inflation. Biden ignored them.\n\nHere we are one year later and Americans are still picking up the tab.\n\nRecord gas prices. Highest inflation in 40 years. Yet, Biden, Pelosi, &amp; Co continue to spend even MORE.","date":"Fri Mar 11 19:34:44 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"THROWBACK THURSDAY: Your friendly reminder that a Biden Treasury nominee called for bankrupting American energy producers. \n\nFrom the start, it’s been the Biden admin’s goal to end domestic oil &amp; gas production. Anything said otherwise is a bold-faced lie.\nhttps://t.co/YHPUqjOsvT","date":"Thu Mar 10 22:30:47 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I am proud to join @RepMoBrooks’s Freedom to Fly Maskless Act to overturn federal mask mandates for those using public transportation and air travel.","date":"Thu Mar 10 19:08:54 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"One day before Biden’s SOTU, Democrats suddenly waived their magic Fauci wand and removed the House floor mask mandate.\n\nYet, the Biden admin continues to dictate YOUR personal decisions with anti-science mandates.\n\nIt’s never been about science. It’s always been about control.","date":"Thu Mar 10 19:01:37 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Inflation has increased every month of Joe Biden’s presidency.\n\nThis is not “Putin’s price hike.” These are the results of Biden’s budget busting spending and anti-energy agenda.\n\nAs Americans feel the pain at the pump, Biden takes ZERO responsibility.\nhttps://t.co/grNEi7kmrh","date":"Thu Mar 10 16:37:02 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"My statement on the Dems’ $1.5 trillion omnibus package.\n\nAmerican families &amp; small businesses are facing record gasoline prices, rising grocery bills, &amp; the highest inflation in 40 years thanks to the Democrats’ runaway spending. This bill doubles down on that failed strategy. https://t.co/f5h2b1lm7q","date":"Thu Mar 10 12:39:29 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"70% of Americans want the U.S. to increase oil and gas production. \n\nWhat is President Biden waiting on?\n\nEnergy independence is national security!","date":"Wed Mar 09 19:42:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"To set the record straight, the rising energy costs are a direct consequence of President Biden’s green fantasy.\n\nOn day one, he launched a war on American energy by canceling the Keystone XL Pipeline. \n\nIt’s time for Joe (the buck stops with me) Biden to take responsibility!","date":"Tue Mar 08 23:48:09 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As a direct result of the Democrats’ defund the police movement and demonization of law enforcement, crime is skyrocketing in liberal cities.\n\nThe facts couldn’t be more clear.\n\nBut @HouseJudiciary would rather “Reimagine Public Safety” than #BackTheBlue. https://t.co/vIBcoWPF5X","date":"Tue Mar 08 19:55:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats are suddenly flip-flopping on their radical defund the police stance after their polls plummeted, but we will not forget their vile anti-police calls that led to a deadly crime wave.\n\nNeed proof? \n\nTune in below.","date":"Tue Mar 08 16:18:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Last week, President Biden avowed the rebirth of Made in America products during his SOTU.\n\nThis week, his administration is cutting deals with socialists in Venezuela to purchase their oil.\n\nWill the lies ever stop? https://t.co/mxu7FuXFWF","date":"Mon Mar 07 20:57:57 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thousands of Americans have been fired as a result of President Biden’s tyrannical vaccine mandates. \n\nIt’s way past time for us to end this once and for all! \n\n#DefundVaxMandates","date":"Mon Mar 07 18:22:04 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The White House would rather beg Venezuela and Iran for oil than unleash our own domestic supply.\n\nAmerica LAST. Adversaries FIRST.","date":"Mon Mar 07 15:38:30 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you: @RepNewhouse, @RepPeteStauber, @RepTomEmmer, @RepFischbach, @RepLizCheney, @RepJackBergman, @RepBryanSteil, @RepGallagher, @RepGrothman, @RepFitzgerald, @RepRussFulcher, @repdonyoung, @RepRosendale, @RepBoebert, and @RepBentz for joining me in this effort.","date":"Fri Mar 04 16:33:52 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Rural communities have been a ping-pong ball bouncing back &amp; forth between gray wolf listings and de-listings for years. \n\nEnough is enough – we need a permanent legislative solution that gets Washington out of the wolf management business &amp; puts states back in the driver’s seat. https://t.co/NZddsweTy9","date":"Fri Mar 04 16:33:52 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"More and more Americans are seeing the outdated and dishonest \"One #China Policy\" for what it is: A failure. It's time for Congress to recognize reality by passing my bill to recognize #Taiwan.\nhttps://t.co/yWClqw0WsP","date":"Fri Mar 04 13:25:01 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Joe Biden can come to Superior to tout American jobs all he wants, but on day one, he killed thousands of Wisconsin jobs by canceling the Keystone XL Pipeline.\n\nWe must get back to the basics of infrastructure!\n\nAsphalt and concrete. Not green giveaways and red tape. https://t.co/iZP0cxnWIR","date":"Thu Mar 03 00:15:08 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Follow the science… 🤡","date":"Wed Mar 02 21:18:38 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"If President Biden really wanted to end the opioid epidemic, he would start by securing our southern border.\n\nFor the past year, his open border policies have empowered cartels to seize control and flood our communities with fentanyl. \n\nSecure the southern border now!","date":"Wed Mar 02 03:21:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"In the blink of an eye, Democrats announced that they would no longer be requiring masks on the House floor for Biden’s #SOTUinCrisis.\n\nWhat changed?\n\nThe politics.","date":"Wed Mar 02 02:33:21 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats ripping up the American Dream: https://t.co/tiDAfeavQV","date":"Wed Mar 02 01:07:33 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Democrats will build a wall around the U.S. Capitol for Biden’s #SOTUinCrisis but refuse to build one at our southern border to protect American citizens. \n\nSafety for me, but not for thee! https://t.co/lPYKcohAZK","date":"Tue Mar 01 22:37:12 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🤔\nhttps://t.co/ZkLnstT1hT","date":"Tue Mar 01 17:00:16 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We will not let the DOJ’s anti-parent directive be swept under the rug. The Biden administration must be held accountable for labeling concerned parents as domestic terrorists.\n\nParents deserve answers!","date":"Tue Mar 01 01:01:14 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden administration‘s green fantasy has killed American jobs, caused energy prices to skyrocket, and funded Putin’s war machine.\n\nUntil the White House unleashes American energy production, Russia will continue to benefit.\n\nWe must bring back America’s energy independence! https://t.co/aECjEtpOIp","date":"Mon Feb 28 22:17:20 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Weakness leads to war.\n\nMy statement on Russia's invasion of Ukraine: https://t.co/4s5SdLpToS","date":"Thu Feb 24 19:48:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It is past time to end the mask mandates on air travel.","date":"Sat Feb 19 15:55:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As I warned last year, the #BidenAdministration has been recklessly releasing potentially dangerous Afghans into our communities. The White House told us they were “fully vetted.” They lied.\n\nhttps://t.co/1aM0NETp8Y","date":"Fri Feb 18 19:12:11 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"My deepest condolences to the Hagedorn family. Jim was a dedicated public servant, a valued colleague and a friend. https://t.co/PJb8SDVVWp","date":"Fri Feb 18 16:05:29 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The American people deserve answers.","date":"Tue Feb 15 21:22:09 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The recent reports of Capitol Police digging into the business of members of Congress, staff and constituents is disturbing and raises many concerns. \n\nI joined @RepAndyBiggsAZ calling on @HouseAdm_Dems to provide answers to lawmakers on unauthorized surveillance.","date":"Tue Feb 08 19:08:41 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tune in this afternoon ⬇️","date":"Thu Feb 03 20:11:00 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Good luck to Minocqua's very own, Kevin Bolger, as he competes in the 2022 Beijing Winter Olympics as part of the USA cross country ski team! 🇺🇸 https://t.co/DnvNKlTvvR","date":"Thu Feb 03 17:50:33 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Maurice Drayton has left the @packers today and is reportedly being courted by the Biden administration.","date":"Tue Feb 01 22:15:47 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Lunar New Year of the Tiger to the Taiwanese-American community leaders and friends in Wisconsin!","date":"Tue Feb 01 21:08:58 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The genocide ambassador from Communist #China has gone too far. Threatening Americans on American soil is outrageous.\n\n @POTUS should tell Comrade Qin to pack his bags and expel him from the United States immediately.\nhttps://t.co/Ew4jVQWkLa","date":"Sun Jan 30 14:50:30 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"⬇️⬇️⬇️","date":"Thu Jan 27 19:05:04 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Pelosi’s COMPETES Act is weak. It is time to hold Communist China accountable.","date":"Wed Jan 26 22:46:47 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"When @VP Harris was Senator Harris she backed high-level meetings between senior US and #Taiwan officials. \n\nYesterday I asked her to do as VP what she voted for in the Senate, and meet directly with Taiwan’s Vice President William Lai next week. ⬇️\nhttps://t.co/9sRCqdIda7","date":"Fri Jan 21 17:03:01 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Denying life-saving medical care to Americans based on skin color is wrong, it is illegal, and it is un-American.\n\nhttps://t.co/QpPG1LVHTA","date":"Thu Jan 20 21:45:03 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"For a year, Americans have been subjected to the consequences of Biden's soft-on-crime policies at our border, in our cities and now on the railroads. \n\nGarland needs to enforce our laws instead of spending time labeling parents \"terrorists\". Read more ⬇️\n\nhttps://t.co/JynnDNzkVi","date":"Thu Jan 20 19:42:49 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I am honored to earn an A+ on @SBAList’s pro-life Scorecard. I am committed to protecting the rights of the unborn and the conscience rights of taxpayers who don’t want their tax dollars paying for abortion. https://t.co/qche1HZqH7","date":"Wed Jan 19 17:51:21 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Donald Sterling was run out of the #NBA for making wildly inappropriate remarks. Will Commish Adam Silver hold @Warriors owner @Chamath to the same standard?\nhttps://t.co/fSMUx4DcZD","date":"Tue Jan 18 14:58:23 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Looks like a Golden State @Warriors owner said the quiet part out loud about the @NBA view on the #genocide being carried out in #China. Hey Coach @stevekerr -- care to give your boss an assist here?","date":"Mon Jan 17 19:06:53 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I spoke on the House floor against the Democrats’ federal takeover of elections. Their attempt to hijack a bill related to NASA to promote voter fraud is one giant leap backwards for American election integrity.\n\n⬇️⬇️⬇️ https://t.co/CUTtGcMGT3","date":"Thu Jan 13 19:56:24 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Reminder: Parents are not domestic terrorists and have every right to be concerned about their children's education.","date":"Thu Jan 13 15:57:08 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Friendly reminder to those of you in the Twin Cities: Restaurants and taverns in #WI07 are open for business – and you aren’t required to show your papers. https://t.co/7HhQfAApTs","date":"Wed Jan 12 23:59:06 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Reports show that Biden transferred funds from COVID-19 testing to cover the cost of housing illegal immigrants. I joined @RepDLesko for answers on why the President refuses to put Americans first.","date":"Fri Jan 07 19:43:42 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Communist China's genocide, forced labor camps, widespread human rights abuses, espionage and threatening to destroy #Taiwan apparently didn't make the cut. https://t.co/cAseIFeML0","date":"Fri Jan 07 16:24:08 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Just a reminder that it is January 6, 2022, and #Biden policies have given Americans the worst inflation in 40yrs, a 60yr high in homicides, at least 2m illegal aliens flooding our country in a single year, a foreign policy in shambles, and a new high for Covid infections.","date":"Thu Jan 06 15:41:34 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Buck passing 101: October 2020 ➡️ Now https://t.co/Rh0YoCDwLT","date":"Tue Jan 04 18:14:14 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Who is in charge here?\nA. Walensky\nB. Fauci\nC. Biden\nD. None of the Above https://t.co/Vxyn3SABr6","date":"Mon Jan 03 16:36:56 +0000 2022","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I didn't realize April Fools' Day was in December this year.","date":"Thu Dec 30 03:29:19 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"https://t.co/y7b71BLbVx","date":"Sat Dec 25 20:55:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"So to recap: #Biden was for the border fence ... before he was against the border fence ... before he was for the border fence.\nhttps://t.co/tAnxRtdxMY","date":"Tue Dec 21 17:58:57 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I'm optimistic about Verso's merger agreement with BillerudKorsnäs and I look forward to working with the new company to fully reopen the Wisconsin Rapids mill – something that would benefit the state’s economy and improve the environment. https://t.co/bLc66BPIjl","date":"Mon Dec 20 20:31:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Birthday, @NatResources!","date":"Fri Dec 17 14:34:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"American taxpayers: The global elites' ATM.\nhttps://t.co/Yw6cptzLdw","date":"Thu Dec 16 15:59:20 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The illegitimate, corrupt and undemocratic Ortega regime's decision to become a client state of #China by cutting ties with #Taiwan will only make life worse for the people of #Nicaragua. The Biden admin should lead by example and recognize Taiwan. \nhttps://t.co/XN3znj2qlq","date":"Fri Dec 10 00:15:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"With energy prices continuing to rise, some families might be hoping to get lumps of coal for Christmas to heat their homes!🎄","date":"Thu Dec 09 19:00:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I met with the Mayor of Cémaco, Panama, the Honorable Francisco Agapi.\n\nWe discussed the ongoing chaos and humanitarian crisis unfolding in the Darien Gap due to Biden's immigration policies implemented on Jan. 20th. https://t.co/HVIDMQ8Qli","date":"Wed Dec 08 22:17:13 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We took a stunning helicopter ride over the Grand Canyon last weekend with @westerncaucus for the annual Winter Western Roundtable and Field Tour.\n\nYou can tell why it is one of the 7 Natural Wonders of the World! 🌎 https://t.co/cBuYdc8oud","date":"Wed Dec 08 18:37:39 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This morning, I am joining @CIS_org for a panel discussion on the Darien Gap.\n\nTUNE IN ⬇️⬇️⬇️","date":"Tue Dec 07 14:56:48 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"America's Carter-era \"One China Policy\" is dishonest and outdated. It's time for America to lead by example, and recognize Taiwan as a free and independent nation. We don't need a permission slip from China to have normal ties with our friends and allies. https://t.co/nGVIysD5Z2","date":"Fri Dec 03 14:30:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I will always stand for life and support legislation that protects the unborn.","date":"Wed Dec 01 18:45:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Twitter banned a former US president and censors investigative journalism like #projectveritas – but gives state-run Chinese “media” outlets blue checks.\n\nIf Twitter is going to host #CCP propaganda agents, could they at least replace their blue checks with red ones?","date":"Wed Dec 01 15:25:24 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"While Biden is in Minnesota touting the Democrats' infrastructure bill, Americans are dealing with the real impacts of government overspending.","date":"Tue Nov 30 18:27:21 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Thanksgiving! Wishing you a happy holiday full of good food, family and friends.","date":"Thu Nov 25 16:20:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The attack in Waukesha wasn't \"caused by a SUV.\" https://t.co/S2y8Elh4nn","date":"Thu Nov 25 04:15:55 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden’s decision to cancel the Keystone XL pipeline killed thousands of jobs, risked our energy independence and caused gas and home heating costs to rise. \n\nAmericans shouldn’t have to deal with the consequences when we could be producing our way out of this energy crisis.","date":"Tue Nov 23 18:48:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Meanwhile, in California - where organized groups of looters are knocking off jewelry stores in broad daylight with impunity - local \"leaders\" are doubling down on crazy.","date":"Tue Nov 23 17:11:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Praying for those in Waukesha tonight.","date":"Mon Nov 22 00:59:58 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I voted no on Biden-Pelosi #BuildBackBroke bill. Thousands of new IRS agents, amnesty for 7m illegals, tax hikes and trillions more in gov handouts will worsen inflation, dig us deeper into debt and supercharge illegal immigration. \n\nAmericans don't want it and can't afford it.","date":"Fri Nov 19 17:11:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"To all the parents across Wisconsin and across America:\n\nWe do not view you as a threat and we hope you continue to participate in your children's education. I will be right there with you.","date":"Thu Nov 18 19:57:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"One day after the FBI memo, AG Garland said he did not think parents getting angry at school boards constitutes domestic terrorism.\n\nDoes he not know what the FBI is doing? Or did he lie to us?  He must answer these questions before our committee. https://t.co/YdelfhKPuC","date":"Thu Nov 18 19:45:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨🚨🚨","date":"Wed Nov 17 21:05:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Overreaching federal vaccine mandates will affect 80 million Americans. \n\nI joined @RepFredKeller and my GOP colleagues to nullify Biden's mandate and ensure that the decision to get vaccinated is up to the individual.","date":"Wed Nov 17 16:32:35 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"AG Garland testified that parents are not domestic terrorists. So why did the FBI investigate parents using counterterrorism tools?\n \nWe need answers.","date":"Tue Nov 16 22:24:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Border apprehensions are up 128% from last October. \n\nYet, President Biden refuses to do anything to stem this record-breaking tide of illegal immigration.","date":"Tue Nov 16 20:55:28 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"After attempting to spy on your bank account, the Biden admin now wants to end private banking by requiring every bank account to be set up at the Fed. \nhttps://t.co/weu7SGD54M","date":"Mon Nov 15 22:54:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Not even our Wisconsin cranberries are safe this holiday season…\nhttps://t.co/T9gLggxHH9","date":"Mon Nov 15 18:46:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Our warriors have selflessly answered the nation’s call. Though we will never be able to fully repay our veterans for their sacrifices, today we pause to remember their service. Have a great Veterans Day. https://t.co/jAMEEgakwx","date":"Thu Nov 11 16:56:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"➡️ Trillions in big government socialist spending Americans don't want and can't afford.\n➡️ Shutting down pipelines and killing US energy dominance.\n➡️ Forcing millions of Americans to choose between the jab and their job.\n\nThis is Joe Biden's economy.","date":"Wed Nov 10 20:44:46 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Team Biden to energy companies: \n\n\"We want them to go bankrupt.\"","date":"Wed Nov 10 14:18:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"TUNE IN:","date":"Tue Nov 09 20:26:19 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The labor shortages caused by the Biden admin’s overreaching policies are causing a ripple effect across our nation and hurting central Wisconsin.\nhttps://t.co/2yqV25VlfZ","date":"Tue Nov 09 15:39:43 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Translation from Biden-speak to plain English:\n\n\"Yes, we are trying to shut down another critically important energy pipeline, and this one is a direct hit to Wisconsin.\"","date":"Mon Nov 08 19:40:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"$1,500 to heat your home last winter means $3,000 this winter. Shutting down Line 5 would make things even worse. \n\nWhy is the Biden admin telling Wisconsinites who rely on natural gas and propane to go jump in a (frozen) lake?\nhttps://t.co/BeZGNm1ub2","date":"Mon Nov 08 15:27:40 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Even a broken clock is right twice a day. 🕰","date":"Sat Nov 06 01:06:40 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"How much will this cost the American people?","date":"Fri Nov 05 18:53:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The border crisis is out of control. \n\nI sent a letter to @POTUS with @RepMoBrooks, @RepRonnyJackson and @RepBrianBabin demanding he take decisive actions against governments who are contributing to the chaos on the southern border. https://t.co/SB56P8sggX","date":"Thu Nov 04 20:02:09 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Overreaching vaccine mandates are only worsening our labor shortages. The choice to get the vaccine should be up to the individual, not the federal government.","date":"Thu Nov 04 16:07:53 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Free @RepJimBanks from Twitter jail. Big Tech can't silence conservative voices forever...","date":"Tue Nov 02 20:29:11 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Transnational child trafficking on an unprecedented scale, brought to you by the Biden administration.","date":"Tue Nov 02 15:01:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Do you think illegal aliens deserve a $450,000 cash reward for breaking our laws?\n\nApparently the Biden administration does. It could cost you more than $1 billion.\n\nYour tax dollars at work.\n\nhttps://t.co/8B1twxQRme","date":"Thu Oct 28 20:30:39 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Addressing the economic crisis facing America  &gt;  Pushing a Democratic wish list disguised as a tax and spending package","date":"Thu Oct 28 18:03:14 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Only 19 dems think IRS bank account monitoring is a bad idea. Good start, but a baby step. Could we get more than 19 to oppose hiring 87k more IRS agents?","date":"Thu Oct 28 02:06:48 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"After approving the vaccine for kids ages 5-11, the committee concluded “We’re never gonna learn about how safe the vaccine is until we start giving it.\"\n\nApparently ‘trust the science' is now code for FDA approval to use our kids as test subjects.\nhttps://t.co/i1BG9EdRvH","date":"Wed Oct 27 16:41:41 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Runaway government spending is the cause of the inflation crisis. \n\nAnother $2 trillion or $3 trillion or $10 trillion in deficit spending will only intensify the problem.\n\nIn other words, if you find yourself in a hole, the first thing you have to do is stop digging.","date":"Wed Oct 27 13:50:20 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"School board meetings have vigorous debate, but that's a good thing.\n\nICYMI: This morning, I joined @newsmax to discuss the @JudiciaryGOP letter demanding AG Garland rescind his memo that goes after parents who attend local school board meetings. https://t.co/S7RaqKj3vH","date":"Tue Oct 26 15:52:56 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Hey @NBA and @Nike - \n\nThis is what it *really* looks like when an athlete stands for something, even if it could cost them everything.","date":"Mon Oct 25 21:12:36 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"For 50 years, Taiwan has been unfairly excluded from the United Nations. This must change.\nFact: Taiwan is an independent, democratic country.\nFact: Taiwan has never been part of Communist China, even for one day.\nFact: China is China, Taiwan is Taiwan.\nhttps://t.co/lzNxSzPdv5","date":"Mon Oct 25 18:18:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Leave it to an Evers appointed Dane County judge and the Evers DNR to find a way to misinterpret and misconstrue plainly worded wolf hunt law. \n\nOur sportsmen deserve better.\nhttps://t.co/G4dvx6mlz6","date":"Mon Oct 25 15:50:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden’s disastrous withdrawal leaves the door open for the Taliban and China to take advantage of Afghanistan's mineral wealth. \n\nWe must do all that we can to produce these key minerals here at home and reduce dependency on adversaries like China. 🇺🇸 https://t.co/h6dfucJijm","date":"Fri Oct 22 15:47:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As someone who’s been down to the border multiple times, I’d say it would definitely be a good idea...\nhttps://t.co/GSGvkCk8kp","date":"Fri Oct 22 13:29:27 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We still need answers from AG Garland. I joined @Newsmax to discuss the concerns I raised at today's Judiciary hearing. https://t.co/YihnlI07JO","date":"Thu Oct 21 20:07:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"During today's hearing, I pressed AG Garland on:\n- The USDA's unfair race-based debt relief program\n- Concerned parents labeled as \"domestic terrorists\"\n- Accountability for Facebook for disregarding U.S. immigration law\n\nWatch ⬇️ https://t.co/c8GKzR294z","date":"Thu Oct 21 17:43:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨 TUNE IN: I will be joining @Newsmax at 2:30 CT to discuss today's @JudiciaryGOP hearing with AG Garland.","date":"Thu Oct 21 17:40:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The video @HouseJudiciary didn't want to show ⬇️","date":"Thu Oct 21 14:38:21 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I will never subject Americans’ constitutional right to keep and bear arms to the whims of international bureaucrats at the United Nations.\n\nI joined @RepHartzler on her efforts to defend Americans' #2A rights.","date":"Wed Oct 20 19:38:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congratulations to Trig and Tula Solberg on the 50th anniversary of their business. Since 1971, the Solbergs have owned and operated supermarkets and convenience stores in Wisconsin's Northwoods. \n \nThank you for your service to our #WI07 communities! https://t.co/o2ObtxXUta","date":"Wed Oct 20 17:21:31 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The border crisis worsens as @VP spends months searching for the \"root cause\" of illegal migration. \n\nHere's a hint: You can find it at 1600 Pennsylvania Ave.\nhttps://t.co/jSDYzzEPgg","date":"Wed Oct 20 14:52:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"TUNE IN: I will be joining @cspanwj this morning at 7am CT!\nhttps://t.co/kZloGMvf8h","date":"Wed Oct 20 11:50:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"While Washington, DC is spending, the rest of America is struggling \n \nThe Democrats’ $5T package gives taxpayer funded handouts to families earning as much as $800k, while programs that rural Americans rely on are left behind.","date":"Tue Oct 19 19:46:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The supply chain crisis is hurting America's small businesses. \n\nThat’s why I cosponsored the bipartisan DRIVE-Safe Act which will allow more qualified drivers to transport goods across state lines.\n\nhttps://t.co/uMbFazvXGH","date":"Mon Oct 18 14:25:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨 TUNE IN: I will be joining @VickiMcKenna today at 3:07 CT. \nhttps://t.co/CACy2sSSln","date":"Thu Oct 14 19:30:26 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Prices for staples we rely on continue to rise, thanks to reckless and unsustainable government spending. \n\nGasoline ⬆️ 42.1%\nPropane, kerosene, and firewood ⬆️ 27.6%\nGas Utilities ⬆️ 20.6%\nMeats ⬆️ 12.6%\nEggs ⬆️12.6%\n\nWe all feel it.","date":"Thu Oct 14 16:50:53 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The only \"pipeline\" the Biden admin doesn't want to shut down is the one carrying illegal aliens into our communities.\nhttps://t.co/gZ9Qao30n4","date":"Wed Oct 13 18:31:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We must make sure that people are properly screened before, not after, they arrive. \n\nThe SECURE America Act will make necessary reforms that put America’s safety first.","date":"Wed Oct 13 17:44:24 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Democrats' $3.5 trillion reconciliation bill will fund pet projects like:\n❌ Government handouts for households making $800k a year\n❌ IRS snooping on your bank account\n❌ Pushing Green New Deal initiatives","date":"Tue Oct 12 20:59:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"ICYMI: Classifying parents as domestic terrorists for exercising their first amendment is wrong. \n\nAG Garland needs to explain why he’s using the DOJ to target parents. ⬇️ ⬇️ ⬇️","date":"Tue Oct 12 17:34:51 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The situation on the chaotic US-Mexico border becomes more dangerous and violent every day as hundreds of thousands of illegal migrants flood into our country. @POTUS is failing to do his most basic duty, which is to protect America from foreign invasion. \nhttps://t.co/18qJPKc8lu","date":"Fri Oct 08 19:23:18 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"✅ Make Less\n✅ Pay More \n❌ Get America back to work","date":"Fri Oct 08 16:59:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Effective diplomacy has to be more than just words. The Biden admin must take concrete steps in response to Communist China's dangerous and reckless provocations in the #Taiwan Strait.\nhttps://t.co/cRJ8KoJzEt","date":"Thu Oct 07 14:40:31 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As crazy as this idea is (and it is definitely crazy), what's even crazier is that you'd need 5 of these just to pay for Biden's \"human infrastructure\" package.\n\nhttps://t.co/1ITtW3Xf2J","date":"Wed Oct 06 17:52:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@RepAndyBiggsAZ and I are still waiting on answers…\nhttps://t.co/TJVVMr8vHA","date":"Tue Oct 05 18:21:11 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Maybe if you wear two masks long enough you start believing $3.5 trillion is the new $0?","date":"Mon Oct 04 20:30:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden admin is preparing to reverse Trump's \"Remain in Mexico\" policy after seeing a 317% increase in border apprehensions from just last year. \n\nIt doesn’t make sense. It just makes the problems worse.","date":"Mon Oct 04 19:34:52 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@HouseBudgetDems Chairman: \"The federal government can afford anything\"\n\n *sane Americans dispute this claim* https://t.co/bgtgylxgXT","date":"Sun Oct 03 15:06:34 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Dems have gone from filibustering, to calling the filibuster racist, to calling for minority rule.","date":"Fri Oct 01 19:34:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"All we have seen this week in DC is chaos, confusion, and conflict. https://t.co/FQ7WZckAHB","date":"Thu Sep 30 17:42:18 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I warned about the chaotic mass migration headed for our border when I visited Panama back in May. \n\nThe Biden admin and Democrats refused to listen. Will @POTUS listen to Panamanian government?\n\nhttps://t.co/byJm8jzKhb","date":"Thu Sep 30 14:23:39 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tracy Stone-Manning’s history of eco-terrorism makes her unfit to lead our nation’s largest federal land agency.\nI’m joining my @WesternCaucus colleagues in calling for @SenateDems to reject her nomination to the Director of @BLMNational.","date":"Wed Sep 29 18:47:21 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Will YouTube also ban accounts that falsely claim that Border Patrol officers carry \"whips\" and that Biden's $5.5 trillion spending bill will cost nothing?\nhttps://t.co/I5Li7f7bSq","date":"Wed Sep 29 16:12:14 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Maybe that's because you and @POTUS have spent the last 9 months breaking it.\n\nMaybe try enforcing the law.\n\nhttps://t.co/XIylSXxq8Q","date":"Mon Sep 27 19:04:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Another day another incident, this time a group assault on US servicewoman. Thousands of Afghans have been brought to the US, many with no identity documents. Most were not translators. Vetting has been incomplete &amp; rushed. @POTUS owes Americans answers.\n\nhttps://t.co/fvUETSruHR","date":"Sun Sep 26 14:00:30 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"One month since evacuations from Afghanistan began and information still remains unclear.\n\n@RepAndyBiggsAZ and I sent a letter to @POTUS demanding answers amid new charges of heinous crimes against Afghan nationals.\n\nRead the letter here: https://t.co/nE7jqisthM","date":"Fri Sep 24 15:31:46 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"When you bring tens of thousands of Afghans into America now and ask questions later, bad things are bound to happen.\n\nI joined @IngrahamAngle last night to discuss ⬇️ https://t.co/XYTzdOeV9l","date":"Fri Sep 24 13:45:28 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨 TONIGHT at 9:40 pm CT: I'll be on with @IngrahamAngle to talk about the refugee situation at Fort McCoy.","date":"Thu Sep 23 23:00:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I joined @newsmax to address the situation unfolding at Fort McCoy in Wisconsin.\n\nWatch ⬇️⬇️⬇️ https://t.co/mhRnd2211s","date":"Thu Sep 23 20:38:48 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨 TUNE IN: I will be joining @newsmax at 2pm CT to discuss the conditions at Fort McCoy.","date":"Thu Sep 23 17:00:37 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is what happens when @POTUS waves thousands of people into our community first and asks questions later.","date":"Thu Sep 23 01:09:11 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We polled our listeners and here are the results: \n\n📍85% said they've seen the impact of overspending and inflation in their family’s daily life and budget\n\n📍78% said overreaching mandates in their schools and communities have impacted their children’s learning and development","date":"Wed Sep 22 15:20:30 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you to my friend @RepMaryMiller and my #WI07 constituents for joining our Telephone Town Hall last night on Education and CRT. \n\nWe had a great discussion and encourage all to continue to stay involved with your local school districts. https://t.co/LDbvNtEbQK","date":"Wed Sep 22 15:20:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unfortunate to see @SpeakerPelosi cave to the Hamas fan club and de-fund Israel's Iron Dome.\n\n#StandWithIsrael","date":"Tue Sep 21 22:02:46 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Over a year later, statues that were torn down by protestors were restored today in Madison. Great to see “Forward\" and Col. Heg returned to their former glory.","date":"Tue Sep 21 21:02:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨 TUNE IN: I will be joining Vicki McKenna at 2:35 CT on @newstalk1130 to discuss the refugee crisis and border crisis.","date":"Tue Sep 21 18:17:28 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"ICYMI: On Friday, I visited Fort McCoy again for an update on the situation.\n\n Watch ⬇️ ⬇️ ⬇️ https://t.co/jkCHvou79R","date":"Tue Sep 21 17:40:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@PressSec just said the tidal wave of illegal migrants overwhelming the Texas border are “not intending to stay.” \n\nDoes she think they are coming to see a Cowboys game?","date":"Mon Sep 20 19:46:18 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This #Biden admin \"solution\" has more to do with public relations than securing the border. It will only encourage more child trafficking and fake \"families\" to make a run for the border, as smugglers see showing up with a minor as the short-cut to amnesty.","date":"Mon Sep 20 17:14:18 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Americans deserve clear answers from the Biden admin on the now-accelerated vetting process.\n\nRead more ⬇️⬇️⬇️","date":"Mon Sep 20 14:52:46 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Illegal immigration is out of control. That's why I filed an amendment to the annual DOD bill authorizing deployment of armed forces to shut it down. \n\nAmericans are sick of Biden's open borders. It's time for Congress to act. https://t.co/rOOt4dwJZu","date":"Sun Sep 19 18:24:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read the full amendment here: https://t.co/ReyQCsYuIx","date":"Sun Sep 19 18:24:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Coming soon to a school, hospital and community near you, courtesy of @POTUS","date":"Sat Sep 18 17:05:17 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"When Republicans expressed concern about giving amnesty to illegal aliens with multiple drunk driving convictions, this is what the Democrat Judiciary Committee Chairman had to say ⬇️","date":"Thu Sep 16 20:14:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"While chaos on the border escalates, the Biden admin and Dems continue to push for wide amnesty and refuse to protect American communities.","date":"Thu Sep 16 19:00:58 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I joined the @westerncaucus podcast with @RepNewhouse &amp; @WAPolicyGreen.\n\nListen below ⬇️⬇️⬇️","date":"Thu Sep 16 15:37:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Dec. 2020 ➡️ Sep. 2021 https://t.co/40Q7B5AprK","date":"Mon Sep 13 23:13:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden admin wasn't being honest when they implied most #Afghans coming to US are \"translators.\" Today @SecBlinken admitted that under questioning from my friend @RepScottPerry ⬇️","date":"Mon Sep 13 20:24:57 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On this day of mourning, we honor the memories of the victims of 9/11 as well as those who gave their lives defending this nation. Our nation remain committed to your success and are forever in your debt. https://t.co/beoNMFWGyV","date":"Sat Sep 11 15:02:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Time to pump brakes on #Biden admin push to bring in thousands of people now and ask questions later. #Afghans must be fully vetted in safe 3rd countries, and SIV process fully completed before, not after, arrival in US. Refugee orgs also have obligation to protect US security.","date":"Sat Sep 11 00:05:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Women and girls forced to marry men against their will among sea of #Afghan migrants. Rushed, short-cut screening will harm public safety in America and victimize vulnerable Afghans. \nhttps://t.co/I6DHPW4Ole","date":"Sat Sep 11 00:05:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Pedophiles reportedly exploiting #Biden admin push to bring in as many #Afghans as possible -- potentially allowing them to hide among evacuees with underage victims in tow.\nhttps://t.co/itjpqFVfVS","date":"Sat Sep 11 00:05:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"A previously convicted and deported #Afghan rapist already made it to US, raising serious questions about pre-arrival vetting processes.\nhttps://t.co/S0ETzGkqfr","date":"Sat Sep 11 00:05:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"An #Afghan national was allowed to board an evac flight out of Kabul with explosives in his luggage before being stopped in #Germany. Who puts explosives in their fleeing-the-country suitcase? And how did he get them on board?\nhttps://t.co/mXp50ReEcE","date":"Sat Sep 11 00:05:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Decision to stop #Afghan flights into US a day late and a dollar short for #FortMcCoy, where measles and covid cases among evacuees have already been detected.\nhttps://t.co/czsCRc1ei4","date":"Sat Sep 11 00:05:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Another day, another alarming report: Flights of #Afghan nationals into America halted due to \"health safety concerns\" at US bases in #Qatar and #Germany. How many already got in?\nhttps://t.co/6HpKoiuBZa","date":"Sat Sep 11 00:05:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"My friend @RepScottPerry and I sent this letter to #Biden admin today demanding full membership in the #UnitedNations for #Taiwan. America doesn't need a permission slip from Communist #China to support our allies. It's time: #UNforTaiwan https://t.co/bCYVkJ4nwF","date":"Thu Sep 09 23:47:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Latest vetting blooper: Afghan evacuee boarding US-bound plane from Germany reportedly found with \"blasting caps and other explosives\" in luggage.\n\nSafe to say TSA's 3.4 ounce limit on liquids isn't being rigorously enforced on these flights?\nhttps://t.co/2WZmpZBwk8","date":"Wed Sep 08 00:22:43 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Another report on potential sex traffickers slipping on to #Afghan evacuation flights. #Biden admin \"vetting\" process clearly failing. Too many cases of people not being fully screened before entering US. This must stop.\n\nhttps://t.co/Y6ELQ1JidZ","date":"Sat Sep 04 14:34:17 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"If these reports are true, American tax dollars may be financing international child sex trafficking and #Biden admin vetting is worse than we ever imagined. https://t.co/HvfsRiBU4f","date":"Fri Sep 03 19:42:18 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"TUNE IN: I will be on Spicer &amp; Co. on @newsmax at 5:18 CT to talk about my trip to Fort McCoy.","date":"Thu Sep 02 22:07:53 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"TONIGHT: I joined @TuckerCarlson to discuss what I learned on my visit to Fort McCoy last Friday.\n\n⬇️ ⬇️ ⬇️ https://t.co/ERKK8kEJIL","date":"Tue Aug 31 01:10:00 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"🚨TUNE IN: 7:20 CT on @FoxNews \n\nI will be on with @TuckerCarlson to discuss my recent visit to Fort McCoy.","date":"Mon Aug 30 22:13:41 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@RepStefanik Congratulations!","date":"Mon Aug 30 16:33:09 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Devastating news from Kabul. Biden bears the responsibility for allowing this conflict to collapse into total chaos.\nhttps://t.co/MzJ6bm1V2B","date":"Fri Aug 27 14:38:11 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As the world watches the tragedy unfolding in Afghanistan, I am cognizant of how our veterans may be feeling in the wake of the news. There are resources available to you, should you need them. \n\nVeterans Crisis Line: call 1-800-273-8255 or text 838-255. https://t.co/aIG24a5eKa","date":"Thu Aug 26 20:57:35 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unbelievable developments. \n\nMy heart breaks as we learn of the death of our Marines in Kabul. Our thoughts and prayers are with the families of our warriors. \n\nWe will never forget. May God bless them all.","date":"Thu Aug 26 17:48:53 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Americans have not been given a true view of what is happening. It’s time to get to the bottom of it.\n\nRead more from @ToriRichards25 ⬇️\nhttps://t.co/Kodqj4RObK","date":"Thu Aug 26 16:57:09 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Not every Afghan looking to come to the US is a translator. Without a government in Afghanistan, there are gaps in our vetting system. Our immigration officers can't call the Taliban and ask them to verify people's backgrounds.\n\nRead my latest column here: https://t.co/UG7owQHipZ","date":"Wed Aug 25 20:49:27 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #Biden admin has given conflicting answers on whether screening will be completed before #Afghan nationals enter US. This NBC report suggests it's definitely not happening in #Kabul","date":"Wed Aug 25 19:14:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Cautionary tale from #France. \n\nCollapse of #Afghan government and closure of US embassy make careful vetting more difficult. Stakes are too high for rushed or incomplete screening. Doing this right is more important than doing it fast.\n\nhttps://t.co/tS97UJxrKd","date":"Tue Aug 24 20:31:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I voted to help get #Afghans who worked for US out and my office is working to help evacuate Americans, interpreters &amp; translators. But not everyone in the crowd at the Kabul airport worked for us. We must determine who qualifies before - not after - letting them into the USA.","date":"Sun Aug 22 21:20:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We have a responsibility to ensure that #Afghans are who they say they are and that their stories check out before we cut them loose into American communities. That is not a radical proposition - it is common-sense. We must get this right. https://t.co/eUKuUDHHyr","date":"Sun Aug 22 21:20:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Biden admin has declined to elaborate on their plan to bring Afghan nationals to Fort McCoy in Wisconsin.\n\n@POTUS has already allowed one catastrophe to unfold overseas and Americans cannot afford for a similar catastrophe to unfold here.","date":"Wed Aug 18 19:28:17 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"US national security has been deeply degraded since Jan 20. Allowing entry of thousands from a known terrorist hotbed who have not been screened on top of the border crisis will further degrade national security and undermine public safety.","date":"Tue Aug 17 16:25:28 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden should take Afghans to 3rd countries where vetting can be done safely &amp; thoroughly. \n\nThe White House must also ask local officials for consent before releasing tens of 1000’s of Afghans into our communities.","date":"Tue Aug 17 16:25:27 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Disturbing reports that 5000 Afghans per day are headed to the US – including Fort McCoy in Wisconsin. \n\nAfghanistan is a dangerous country that is home to many dangerous people","date":"Tue Aug 17 16:25:27 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"All can see #Kabul is in chaos. Conducting background &amp; ID checks on 1000’s of #Afghans in pandemonium is impossible. The Biden admin's plan to bring planeloads into the US now and ask questions later is reckless and irresponsible.","date":"Tue Aug 17 16:25:27 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Public health officials have cried wolf one too many times and a growing number of Americans justifiably no longer believe a word they say. \n\nHow many times can these people be wrong before they are held accountable?\n\nhttps://t.co/jOzYEIJAfy","date":"Wed Aug 04 17:19:16 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congratulations to Rice Lake's Kenny Bednarek on his silver medal in the 200m. Great to see #WI07 represented in Tokyo!\n\nhttps://t.co/IjUNxQ3w0r","date":"Wed Aug 04 13:39:13 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"No more lockdowns, no more mask mandates. Let's get our kids back in school. https://t.co/0AgAYexI2b","date":"Mon Aug 02 18:40:37 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Public health officials' dizzying record of flip-flops on everything from mask mandates to the origins of COVID-19 in a Chinese lab, has permanently damaged the credibility of our public health agencies.","date":"Thu Jul 29 15:07:14 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"If you would like to join our next Telephone Town Hall, sign up here: https://t.co/EL0c5LfgsO","date":"Wed Jul 28 14:11:16 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you to all who joined my Telephone Town Hall on inflation and government spending last night with @RepFitzgerald!\n\nWe had great questions from listeners across #WI07 and I look forward to doing more in the future. https://t.co/2SULOdjWHY","date":"Wed Jul 28 14:11:16 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@SenRonJohnson and @SenatorBaldwin should oppose the confirmation of Tracy Stone-Manning to the top Bureau of Land Management position.\n \nHer dark background and ties to extremist organizations make her unfit to act as an honest broker when it comes to land management decisions.","date":"Fri Jul 23 18:57:25 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read my full statement here: https://t.co/87ZRvW5a19","date":"Fri Jul 23 18:57:25 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Pelosi’s decision to block @Jim_Jordan and @RepJimBanks from the Jan. 6th committee continues to show that the House is not a serious place, just a political theater.","date":"Wed Jul 21 18:56:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It’s no secret that we need more active management of our forests.\n\nI introduced the Responding Aggressively to Prevent Insects and Disease (RAPID) Act, which will accelerate the timelines of management projects and reduce the risk of wildfires. https://t.co/dXySeQGSuT","date":"Wed Jul 21 15:46:20 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Car rentals ⬆️  87.7%\nGas prices  ⬆️  45.1% \nHotel prices ⬆️ 16.9%\n\nReckless spending is costing Americans more this summer. Instead of fixing inflation, the Democrats plan on spending more.","date":"Tue Jul 20 15:16:57 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@RepArrington warns of the dangers to family farms if Biden significantly increases the death tax.\n\nAmerican farming families shouldn’t bear the burden of runaway DC spending.","date":"Mon Jul 19 18:21:51 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Biden's radical spending agenda is destroying middle and working-class families. https://t.co/CE7prWOq7v","date":"Mon Jul 19 15:59:57 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I will continue to stand up for life and support the Hyde Amendment because your taxpayer dollars should never fund abortions.\n\n #HydeSavesLives https://t.co/B11BaGSQE4","date":"Thu Jul 15 14:56:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As a former dam tender, I know the importance of hydropower.\n \nDuring today's @NatResources  markup on the “Blue New Deal” I introduced an amendment to eliminate the bill’s harmful mapping provision that targets dams, levees, and dikes in the interior of the US. https://t.co/fdSwhyPNmh","date":"Wed Jul 14 17:04:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Representing the USA in the Olympics is a privilege and honor that should not be misused to participate in divisive, anti-American rhetoric. 🇺🇸","date":"Mon Jul 12 18:49:40 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The people of #Cuba are demanding an end to six decades of oppression, corruption and economic mismanagement.\n#StandWithCuba #Libertad","date":"Mon Jul 12 16:28:17 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Door-to-door vaccine squads are an abuse of power, waste of resources and violation of medical privacy. \n\nAmericans can make their own decisions without government snooping and coercion.","date":"Fri Jul 09 17:41:09 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wrong. It is not the government’s business to know private health information but it is their duty to know who is entering our country.\n\nhttps://t.co/Ysg5arcJ2i","date":"Thu Jul 08 19:25:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Constitution-loving NY gun manufacturers: COME to WI! We have skilled labor, a favorable tax climate, and great Americans. \n\nDon’t stay where they want to bankrupt you. Leave the radical Empire State and come to the Badger State!\n\nhttps://t.co/SoDfU2kB1Z","date":"Thu Jul 08 17:36:20 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"First Amendment protections apply to all of us and they should be defended. \n\nLooking forward to continued conversations with @JudiciaryGOP so that we can pass meaningful legislation that increases transparency and holds Big Tech accountable.","date":"Wed Jul 07 18:30:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The Chequamegon-Nicolet National Forest covers more than 1.5 million acres of the Northwoods.\n \nI joined @RepMMM on the VIP Act which would give all veterans and Gold Star families free access to national parks and forests, like the Chequamegon-Nicolet in #WI07. https://t.co/43voqkeR4K","date":"Tue Jul 06 20:01:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"At this point, every state is a border state. This crisis is affecting everyone.\n\nWATCH: I joined @newsmax today to discuss my trip to the border this week.\n\n⬇️ ⬇️ ⬇️ https://t.co/sSzoJxHR6n","date":"Thu Jul 01 19:53:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wisconsin must help where we can because every state is now a border state. \n\nI was joined by @RepGrothman and @RepFitzgerald on the letter requesting Gov. Evers to approve Texas and Arizona's request and send personnel to our southern border immediately.\n\nhttps://t.co/h4u8aU1GXi","date":"Wed Jun 30 14:01:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tracy Stone-Manning has ties to dangerous eco-terrorism tactics, particularly \"tree-spiking\".\n\nI joined @RepHerrell in the letter urging @EnergyDems to oppose her nomination to the Director of the Bureau of Land Management.","date":"Mon Jun 28 22:25:47 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This trip shouldn't be just another item to cross off the to-do list.\n\nMany of my @HouseGOP colleagues and I witnessed the crisis at the border firsthand, @VP needs to do the same.","date":"Fri Jun 25 17:23:50 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@HouseJudiciary Dems just canceled today's immigration hearing. \n\n... Maybe in honor of @VP Harris's trip to the southern border tomorrow?","date":"Thu Jun 24 18:36:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@NatResources is back to in-person hearings.\n\nToday, I urged @Interior Sec. Haaland to follow the science and keep the gray wolf delisted so states like Wisconsin can continue to manage the wolf population.\n\nWatch below ⬇️ ⬇️ ⬇️ https://t.co/aowY2Xq4p0","date":"Wed Jun 23 17:52:02 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Great to meet with Taiwan Ambassador @bikhim &amp; @MOFA_Taiwan\nOur countries share a deep commitment to democracy &amp; human rights.\nAmerica doesn’t need a permission slip from #China to talk to our friends \n#TaiwanCanHelp #TaiwanIsaCountry https://t.co/kJazMjHoAV","date":"Wed Jun 16 23:48:49 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I joined @RepRichHudson in the letter to the Attorney General and the ATF Acting Director urging them to correct this unconstitutional injustice.\n\n⬇️ ⬇️ ⬇️","date":"Tue Jun 15 15:08:56 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Flag Day!\n\nOn June 14th, 1777, our nation came together to adopt our flag as a symbol of a new nation that stands for freedom, liberty, and justice for all. \n\n244 years later, we honor those ideals and the sacrifices of men and women who died defending our nation. https://t.co/XhVoDNijIi","date":"Mon Jun 14 20:55:47 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"ICYMI: During yesterday’s @JudiciaryGOP hearing, I asked FBI Director Wray about the immigration loopholes I witnessed first-hand at the Darien Gap. https://t.co/tb6zQzBQal","date":"Fri Jun 11 18:07:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It’s time for Democrats to stop denying that there is a crisis at our border and work with us to end the worsening chaos that their dangerous and destructive open border policies have unleashed. https://t.co/6OEgCjeOGK","date":"Fri Jun 11 15:43:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The official cancellation of the Keystone Pipeline and Biden’s decision to waive sanctions on Russia’s Nord Stream 2 Pipeline makes it clear:\n\nBiden is putting Russian jobs over American energy and putting our national security at risk.","date":"Fri Jun 11 14:02:35 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you @SecPompeo for joining me in Wausau, WI to host a roundtable discussion on the global business climate with many of our #WI07 business leaders. https://t.co/Vi73dFdsSp","date":"Wed Jun 09 21:29:51 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I went to the Darien Gap and witnessed the pipeline of human misery created by Biden’s policies. \n\nMeanwhile, the VP jokes and laughs about refusing to visit the border.","date":"Wed Jun 09 19:16:41 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I’ve seen the turmoil Biden’s caused at the US border all the way down to Panama.\n\nVP Harris instead of laughing it off, I suggest you go visit our border — maybe then you’ll get the point.","date":"Wed Jun 09 13:57:30 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@VP is looking for \"root cause\" of migrant surge. \n\nGuatemalan President just gave her the answer...\n\nSpoiler Alert: He currently lives at 1600 Penn.\n\nhttps://t.co/PAFwuRANIi","date":"Tue Jun 08 14:07:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@VP is looking for \"root cause\" of migrant surge. Guatemalan Prez just gave her the answer... Spoiler Alert: He currently lives at 1600 Penn.\n\nhttps://t.co/PAFwuRANIi","date":"Mon Jun 07 23:56:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@VP Harris is looking for \"root cause\" of migrant surge. Guatemalan Prez just gave her the answer... Spoiler Alert: He currently lives at 1600 Penn. https://t.co/PAFwuRANIi","date":"Mon Jun 07 22:49:57 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"ICYMI: This morning, I joined @foxandfriends to discuss my recent trip to the Darien Gap in Panama. \n\nWhat we saw was stunning. \n\nBecause of Biden’s immigration “green light” there is tidal wave of illegal immigration coming to our border from South America. https://t.co/FGXL2Uwwrn","date":"Fri Jun 04 19:09:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On this day 32 years ago, we remember the thousands of pro-democracy protesters killed by Chinese troops in the Tiananmen Square massacre.\n\nNever give up. https://t.co/YSMXY1nJ6q","date":"Fri Jun 04 17:21:52 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Memorial Day! \n\nWe remember those who have made the ultimate sacrifice in the defense of our great nation. Our servicemembers and their families know all too well that freedom is not free. \n\nWe have much to be thankful for and owe a great debt to them and their families.","date":"Mon May 31 18:35:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unfortunately, by narrowly focusing on one isolated event in an effort to promote a political narrative while ignoring the broader context of violence in which it happened, the bill establishing this commission represents a missed opportunity.","date":"Wed May 19 23:33:24 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I remain deeply concerned about the rise in politically-motivated crime and I have consistently denounced it.","date":"Wed May 19 23:33:24 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"From the attempted massacre of GOP lawmakers in 2017 on a VA baseball field and the widespread rioting, looting, arson and murder that gripped many American cities for months, to the January 6 riot and the recent vehicular attack on Capitol Police that left one officer dead...","date":"Wed May 19 23:33:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Over the last year, Congress has spent over $7 trillion, but Dems still want to continue to spend even more.\n \nI joined @RepublicanStudy to introduce their most conservative budget yet - which includes two of my bills: the ACRE Act and the bill to scrap the One China Policy.","date":"Wed May 19 18:40:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Enough. It's time for lawmakers to go back to work like everybody else.  \n\nhttps://t.co/WVHNTqGenV","date":"Wed May 19 17:34:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Extra unemployment benefits don't make sense when so many employers are desperate for help.\n \nI joined @SenRonJohnson and my WI GOP colleagues calling on @GovEvers to cut benefits that are discouraging people from getting back to work.\n\nhttps://t.co/6SqiLFvkLj","date":"Mon May 17 17:55:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tonight I took some time to join @RepKenBuck for the special order on cancel culture with a free speech rhyme... https://t.co/B60uLfl5Mb","date":"Wed May 12 00:03:48 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today on the Senate side, the tradition of failing upwards in DC has continued with Andrea Palm's confirmation as Deputy Secretary of @HHSGov.\n\nWisconsin knew better.","date":"Tue May 11 21:57:20 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"#WeStandWithIsrael","date":"Mon May 10 19:39:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Sending a thank you to @FAPA_HQ for helping to coordinate a donation of 50,000 face masks from the Taiwanese people to medical providers in WI-07. \n\n#TaiwanIsHelping and could help even more if @WHO would stop excluding Taiwan to appease China.","date":"Fri May 07 16:09:11 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"➡️ Candidate Biden promised to \"Build Back Better\" but President Biden’s first acts were to cancel the Keystone XL pipeline and strangle American energy development on public land.","date":"Thu Apr 29 02:21:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"➡️ Candidate Biden promised \"bipartisanship\" but President Biden and Speaker Pelosi have approved trillions in new spending, burying future generations of Americans under a growing mountain of debt – with little debate and input from Republicans.\n\n#JointAddress","date":"Thu Apr 29 02:21:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"➡️ Candidate Biden promised \"unity\" but President Biden spent the first 100 days of his term pursuing a radical agenda and fueling an illegal immigration crisis on our southern border.","date":"Thu Apr 29 02:21:07 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The last 100 days have demonstrated that Americans were the victims of a bait-and-switch in November. \n\nPresident Biden and House Democrats have no intention to seek unity and every intention to double down on \"America Last\" agenda.","date":"Thu Apr 29 02:21:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It’s time to break China’s dangerous choke-hold on the W.H.O. \n\nTaiwan’s exclusion from the W.H.O. due to Chinese pressure isn’t just unfair, it is unwise – and as we saw last year, it is unhealthy.\n \nIt’s time to #LetTaiwanHelp. https://t.co/kKP9tsHqAU","date":"Tue Apr 27 22:40:21 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We polled our listeners. Here's what they said:\n \n83% said they feel less confident in the Admin’s handling of the border situation than they did one year ago.\n\n93% said they'd prefer border wall construction to continue.\n\n96% said a secure border is better for Americans.","date":"Thu Apr 22 19:39:34 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you to everyone in #WI07 who joined last night's Telephone Town Hall with my colleague @RepArrington on the border crisis! https://t.co/I6otQKxa46","date":"Thu Apr 22 19:39:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you @NatResources for allowing Luther Hoffman, Project Manager with Target Hospitality from Eagle River, WI, to provide valuable insight into how Biden’s shutdown of the Keystone XL pipeline project has put many people out of work.","date":"Wed Apr 21 16:27:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I supported @RepDanBishop’s amendment to stop Democrats from defunding the police.\n\nThe majority claims they support law enforcement, but the facts tell us otherwise. I'm concerned about public safety in the wake of another lawmaker’s incitement of violence in Minneapolis. https://t.co/RUTDuCxrUA","date":"Tue Apr 20 19:34:02 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Did taxpayers foot the bill for a first-class #jurytampering junket to #Minnesota by Rep. Maxine Waters? https://t.co/c9jRQPpdY1","date":"Tue Apr 20 15:29:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The @sltrib owes my friend @RepBurgessOwens an apology. I'd say they should be ashamed of themselves - but we all know the #fakenews peddlers are shameless.","date":"Fri Apr 16 15:24:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Patiently waiting for Hollywood, Big Tech, and the outrage mob on the left to denounce this racist drivel.","date":"Fri Apr 16 14:29:04 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Babies born alive after an attempted abortion deserve the same standard of care afforded to any other newborn baby. \nToday, I joined my GOP colleagues and signed the discharge petition demanding @HouseDemocrats bring this bill to the floor for a vote. https://t.co/Y02qHiNRd4","date":"Wed Apr 14 22:15:03 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Pres Biden’s made empty promises to bring US troops home from “forever wars” before. Sad to see yet another delay for sake of photo-op. Why postpone?","date":"Wed Apr 14 18:46:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Drastic policy changes have led to a surge of illegal immigration, which is overwhelming Border Patrol and exacerbating the public health situation.\nI sent a letter to @SecMayorkas expressing concerns and requesting answers about the Biden admin's handling of the border crisis. https://t.co/ufHWWzWTJc","date":"Wed Apr 14 15:51:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Vaccine passports are just another example of the government overreaching in Americans' daily lives. \n\nI joined @RepAndyBiggsAZ and my GOP colleagues on the No Vaccine Passport Act to ensure the federal government never spends your tax dollars on this unconstitutional idea.","date":"Mon Apr 12 20:14:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As of Monday April 5th, all Wisconsin residents age 16+ are eligible for COVID-19 vaccines.\n\nFor more information visit my website: https://t.co/3ZK6dJ9MKS","date":"Tue Apr 06 17:47:12 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"During this critical time, we need a Deputy HHS Secretary who is focused on improving access to health care and supporting state and local officials.\n \nToday, @RepFitzgerald and I sent a letter to Senate Finance urging members to reject the confirmation of Andrea Palm. https://t.co/tvkVbNIQ5O","date":"Thu Apr 01 15:18:49 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@RepBurgessOwens and I announced our plan to introduce the ACRE Act this week.\n\nThe bill will prohibit officials at the USDA from discriminating or providing preferential treatment to any person on the basis of race, color, national origin or sex.","date":"Wed Mar 31 16:48:36 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It’s one thing to gear relief programs to farmers who have fallen on hard times and are struggling to make ends meet, but it is fundamentally unfair for the government to treat farmers differently based on immutable characteristics.","date":"Wed Mar 31 16:48:36 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read the press release here: https://t.co/aaLkxfcteU","date":"Wed Mar 31 16:48:36 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wisconsin has over 64,000 farms, spanning 14.3 million acres of the state's land, many of which are in the 7th District. \n\nOur farms produce a range of products from cranberries to livestock and poultry, including our famous dairy farms. 🧀\n\nHappy National Agriculture Day, #WI07! https://t.co/nPfPDwPUSr","date":"Tue Mar 23 17:56:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I joined my Wisconsin colleagues on the letter to Gov. Evers on the new reports of COVID-19 deaths in long-term care facilities. \n\nWe need answers so that we can understand these discrepancies in the numbers.","date":"Tue Mar 23 14:57:49 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This has been a difficult year and we must work together to interpret the science and establish learning models that put kids back in the classroom.\n\nRead the press release here: https://t.co/jC6dqsLeCf","date":"Thu Mar 18 18:32:14 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It has been one year since K-12 schools closed and switched to full virtual learning.\n\nToday I sent a letter to school administrators and staff encouraging them to make the best decisions for their schools for the 2021-2022 school year. https://t.co/668GAIwW4g","date":"Thu Mar 18 18:32:14 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Lakes Community Health Center in Iron River and Family Health Center of Marshfield were added to the federally-operated Health Center Vaccine Program working to distribute vaccines to our most rural communities. Excited to keep moving #Forward in the battle to reopen our nation.","date":"Thu Mar 11 16:15:05 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We need fair elections in Wisconsin.\n\nThank you to the Wisconsin Assembly Committee on Campaigns and Elections for looking into this disturbing report. \n\nhttps://t.co/IRhYJJSXgL","date":"Wed Mar 10 16:57:31 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"If @govevers and Madison don’t want the @WDExpo, we will take them in the WI-07 before they leave the Dairy State for Texas or Florida.\n\nhttps://t.co/DhUHugqziw","date":"Sun Mar 07 15:14:23 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"H.R. 1280 ignores the harm that anti-law enforcement rhetoric and unchecked violence have inflicted on our communities and our police over the last year. \n\nWe must stand up to the mob, stand up for rule of law, and reject this dangerous legislation. https://t.co/P1xM7x70XL","date":"Thu Mar 04 00:28:39 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I sent a letter to @SenRonJohnson and @SenatorBaldwin urging them to oppose the $1.9 trillion American Rescue Plan Act, which contains roughly $1 trillion in spending not directly related to pandemic relief.\n\nRead the letter here: https://t.co/mer7pEUavs","date":"Tue Mar 02 22:00:22 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"H.R. 1 allows for taxpayer dollars to go to partisan political ads and fails to include my amendment that would close a loophole that allows politicians to pocket campaign funds by paying their spouses.\n\nThis bill is not for the people, it's to enrich the politicians. https://t.co/SjFGxHL7KE","date":"Tue Mar 02 20:05:43 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It's time to get students back to school.\n\nLast week, I joined my colleagues on this resolution to support students and parents and get our students back to in-person learning.","date":"Mon Mar 01 20:05:12 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read my press release here: \nhttps://t.co/OXpgHvOip0","date":"Mon Mar 01 17:35:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I, along with @RepScottPerry, re-introduced the bill to do away with the \"One China Policy\".\n\nFor over 40 years, American presidents of both political parties have repeated Beijing’s bogus lie that Taiwan is part of Communist China – despite the objective reality that it is not.","date":"Mon Mar 01 17:35:54 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The razor wire fence around the United States Capitol is still up in Washington, DC. \n\nIt doesn’t make sense. Just like the $1.9 trillion spending bill that we’re voting on in Congress this week.\n\n@SpeakerPelosi, tear down this wall and send the National Guard home. https://t.co/0pB86FC2ic","date":"Fri Feb 26 19:01:58 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read my statement on the ruling here: https://t.co/tc34vGL8km","date":"Sat Feb 20 18:27:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On Friday, the appeals court ruled that the Wisconsin wolf hunt will move forward. This ruling is a complete and total victory for sportsmen, farmers, families and the rule of law.","date":"Sat Feb 20 18:27:33 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I look forward to working with my colleagues on the National Parks, Forests, and Public Lands Subcommittee to restore the health of our federal lands, revitalize rural America and ensure the federal government upholds open public access and responsible resource development.","date":"Wed Feb 17 20:13:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, Wisconsin’s Natural Resources Board made the unanimous decision to issue 200 permits for a February wolf hunting season.\n\nThis is a great victory for accurate science, Wisconsin sportsmen, farmers and families that has been years in the making!","date":"Mon Feb 15 20:51:47 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read my press release here: https://t.co/v8tL439QiX","date":"Mon Feb 15 20:51:47 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today's decision is a major victory for Wisconsin farmers, families and sportsmen. It's time for @GovEvers and @WDNR to follow state law, end the delays, and move forward with a #wolf hunt immediately. \n\nhttps://t.co/C5dYFPOlHE","date":"Thu Feb 11 17:53:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"“One day a week” of in-person classes ≠ \"reopening”\n\n#reopenschools #reopenAmerica #circleback \n\nhttps://t.co/n1QBNVchqQ","date":"Wed Feb 10 15:56:52 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Saddened to hear of the passing of @RepRonWright. My prayers are with his family and friends today as they mourn the loss of such an honorable man.","date":"Mon Feb 08 21:09:48 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Passing the OMAR Act will help restore public confidence in Congress.\n\nRead my press release here: https://t.co/c5OhPY0Ybm","date":"Fri Feb 05 20:13:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The bill would put an end to candidates for office tapping their campaign accounts to enrich their spouses.\n\nIt is outrageous and inappropriate for Members of Congress to convert campaign donations to personal funds in this way.","date":"Fri Feb 05 20:13:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I introduced the Oversight for Members And Relatives (OMAR) Act with @RepGallagher. \n\nFor too long, lawmakers of both parties have engaged in the ethically dubious practice of pocketing campaign funds by hiring spouses and laundering the money as campaign related expenses.","date":"Fri Feb 05 20:13:38 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tonight, I joined my colleagues on the House floor to discuss the Biden administration's attack on American energy. \n\nWith the stroke of a pen, these efforts will compromise national security, economic security, and job security for millions of Americans. https://t.co/fL2v5Ys0cR","date":"Fri Feb 05 02:31:37 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The CDC said that schools can safely reopen, even without vaccinating teachers.\n\nWe're past due. We must get our students back in school.\nhttps://t.co/bg2nB66zIe","date":"Thu Feb 04 20:56:08 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The #wolf has been de-listed and @WDNR must authorize a hunt. State law is clear, state management is needed and sportsmen expect the state to come through. Don't run out the clock!","date":"Thu Feb 04 17:30:17 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I joined as an original cosponsor on @RepArmstrongND’s Keystone XL Pipeline Construction and Jobs Preservation Act. This bill authorizes construction of the recently halted Keystone XL project and will save thousands of the jobs lost by President Biden's executive order.","date":"Tue Feb 02 22:18:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As a father of three beautiful daughters, I know how precious life is and I am proud to be pro-life. \n\nCongress has a responsibility to protect the lives of the unborn and I am committed to continuing my work to support pro-life legislation and uphold the sanctity of life. https://t.co/Rpy8e44whi","date":"Fri Jan 29 17:27:01 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I am pleased to announce that I will serve on @NatResources and @JudiciaryGOP for the 117th Congress.","date":"Wed Jan 27 20:40:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I am committed to working with my colleagues on @JudiciaryGOP to defend our constitutional right to keep and bear arms, strengthen border security, protect free speech online and hold Big Tech companies accountable.","date":"Wed Jan 27 20:40:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On @NatResources, I look forward to defending American energy independence, improving forest management practices, reducing our reliance on other countries for strategic raw materials and making sure that Wisconsin wildlife conservation decisions stay in Wisconsin.","date":"Wed Jan 27 20:40:59 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"76 years ago, thousands were liberated from Auschwitz-Birkenau. Today, on Holocaust Remembrance Day, we honor the millions of lives lost. #neveragain https://t.co/Mk1CwklZD9","date":"Wed Jan 27 17:04:55 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I joined my colleagues on the @RepublicanStudy letter in support of the bipartisan Hyde Amendment. Over the past four decades, the amendment has saved millions of lives by banning taxpayer-funded abortions. \n\nWe will continue to fight to protect life. #SaveHyde","date":"Tue Jan 26 18:08:53 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read the letter here: https://t.co/08RsuECOcJ","date":"Thu Jan 21 00:16:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"President Biden's decision to rip up the Keystone permit on the first day of his term is a rejection of bipartisanship. Today, I signed this letter with @RepGrothman, @RepBryanSteil, @RepGallagher, and Rep. Fitzgerald in support of the completion of the Keystone XL project.","date":"Thu Jan 21 00:16:45 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Thank you, @CapitolPolice!\n\nWe are so grateful for your service and  dedication. Thank you for being our #heroes https://t.co/prZg1bAXAY","date":"Tue Jan 12 19:38:10 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"About time @StateDept accepted reality that #Communist #China doesn't speak for #Taiwan and that US doesn't need a permission slip to talk to friends. I proposed this change last summer in the House and I'm happy to see @SecPompeo adopt it.\n\nhttps://t.co/KIFVba3r8X","date":"Sun Jan 10 03:50:19 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I am deeply saddened to learn of the death of USCP officer, Brian Sicknick. My thoughts and prayers are with his family.","date":"Fri Jan 08 16:08:42 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Peaceful protest is a constitutionally guaranteed right and that right must be protected for all Americans. \n\nViolence is unacceptable.","date":"Wed Jan 06 19:53:29 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Failing to address these irregularities and violations, we risk further degrading public trust in our democratic institutions – and that is something no one in American can afford to let happen.\n\nRead my full statement here: https://t.co/3loYtU28LX","date":"Tue Jan 05 21:43:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Tomorrow's objection is not an effort to nullify or undermine our democracy. This process is rooted in the constitution and recent precedent. It is the same process used by Democrat lawmakers after the 2000 and 2004 elections.","date":"Tue Jan 05 21:43:06 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Ballots cast that violate procedures set forth in state statute “may not be included in the certified result of any election.” That is the law and why I will support tomorrow's objection. This is the last option to protect the rights of Wisconsin voters who cast legal ballots.","date":"Tue Jan 05 21:42:02 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I voted for @GOPLeader for Speaker of the House because I know that Leader McCarthy would do a much better job than @SpeakerPelosi.","date":"Sun Jan 03 21:02:41 +0000 2021","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Once again, the American taxpayer is being asked to sign a blank check now and ask questions later.\n\nTonight, I am voting no on the CASH Act.","date":"Mon Dec 28 23:13:20 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Less than 24 hours after President Trump signed the 5,500 page spending bill, we are being asked to approve billions more with little discussion or debate.","date":"Mon Dec 28 23:13:20 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The bill includes few restrictions to steer assistance to the most vulnerable and does not include any common-sense liability protections for small businesses, health providers or schools.","date":"Mon Dec 28 23:13:20 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Merry Christmas! Wishing you and your family a wonderful holiday season. https://t.co/E27AGe0d2T","date":"Fri Dec 25 12:57:54 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"What is happening in Washington has become an annual, instant-replay train wreck in the eyes of most Americans – whose elected representatives have little input on the debt being charged up on the nation’s credit card. \n\nAmericans deserve a real say in how their money is spent.","date":"Tue Dec 22 02:12:39 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Adding almost a trillion dollars in COVID-19 assistance to this package is just insult to injury, the relief money could have passed on its own months ago. \n\nA measure I would have supported as a stand-alone bill.","date":"Tue Dec 22 02:12:39 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The annual budget process in Congress has become the definition of insanity, as we are confronted with the same last-minute spending bills written behind closed doors with little to no involvement from lawmakers.","date":"Tue Dec 22 02:12:38 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"That depends, @RepRoKhanna - Will the $2,000/month be bundled as campaign contributions for California Congressmen by Communist Chinese spies?\nhttps://t.co/a1ZGIRcXlv","date":"Thu Dec 17 21:51:09 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As we head into the next semester, it is time to reform contact tracing and quarantine protocols that are keeping healthy students out of class and parents stuck at home.\n \nRead my new op-ed on a better way to keep students safe in school: https://t.co/SrmWLp7Nv9","date":"Wed Dec 16 20:51:04 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Hey @Jack, might want to have one of your world class \"fact checkers\" take a look at this whopper. \n\nBetter yet, you could save time and money by just pre-labeling every Tweet from #Communist #China as \"disputed.”","date":"Tue Dec 15 16:00:23 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is about the integrity of our system. \n\nEvery legal vote must be counted, credible complaints of fraud and irregularities must be investigated, and legitimate legal challenges must be heard and addressed by our independent judiciary.","date":"Fri Dec 11 18:53:07 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"By the end of Winter 2021, 1/3 of Wisconsin restaurants will have closed due to COVID-19 restrictions.\n\nOur small businesses are suffering. \n\n@SpeakerPelosi: it is time to act now. Pass relief. Extend PPP. https://t.co/JifWhaFqhJ","date":"Thu Dec 10 19:10:16 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":".@RepSwalwell may be hard pressed to qualify for @WhiteHouse tour tickets at this point…\n\n“[T]his goes back to the beginning of the last decade, and it’s something that congressional leadership knew about it,” Swalwell said.\n\nhttps://t.co/OOJnQdjWus","date":"Wed Dec 09 21:56:07 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Agreed. \n\nLet's come together to develop practical contact tracing measures that keep students in school and parents at work.","date":"Wed Dec 09 19:28:43 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, our thoughts are with the missing pilot. Praying for his safe return.","date":"Wed Dec 09 14:36:49 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Allowing the Communist Chinese to exploit this dangerous loophole puts national security at risk and fuels crime and corruption. \n\nRead about my effort to close it here:\nhttps://t.co/VGFqObgrpe","date":"Fri Dec 04 15:25:30 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I was honored to recognize my good friend, Tom Casperson, on the House floor.\n\nAs a state senator, I worked with Tom across state lines on many issues. He will be remembered not only for his impact on Michigan's Upper Peninsula, but also for being a man of great faith. https://t.co/1bnGkwyTUA","date":"Thu Dec 03 19:26:11 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"My deepest sympathies to Tom's wife, Diane, and family. It has been a privilege to know such a fine man.","date":"Thu Dec 03 19:26:11 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"With this out-of-touch agenda, @SpeakerPelosi is running #Congress like a 3-ring circus and it sure isn't #TheGreatestShowOnEarth.","date":"Tue Dec 01 15:02:26 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Now is the perfect time to support local small businesses in our communities.\n\nRemember to shop small for Small Business Saturday and all season long! #shopsmall https://t.co/tvCNbGPTzu","date":"Sat Nov 28 14:15:23 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Thanksgiving! https://t.co/vH78CS89rD","date":"Thu Nov 26 19:04:54 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The likelihood of virus transmission is nearly impossible when schools have strict enforcement of masks.\n\nIt's time to update the COVID quarantine protocols for K-12 schools.","date":"Fri Nov 20 16:35:14 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As a result of quarantine protocols, we are seeing entire schools being effectively shut down due to the contact tracing guidelines while only a few students may actually be sick with COVID-19.","date":"Thu Nov 19 18:22:30 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I urge our health care providers and leaders to allow local school boards to set their own policies rather than using a one-size-fits-all model that is holding back too many kids, families and making it more difficult for us to effectively overcome the effects of the pandemic.","date":"Thu Nov 19 18:22:30 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read more in my most recent op-ed: https://t.co/OmrDGFfNpK","date":"Thu Nov 19 18:22:30 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Three. Years. Behind. \n\nDue to the current state of our K-12 education system that is how far our children could find themselves academically due to COVID-19 restrictions.","date":"Thu Nov 19 18:22:29 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today on National Rural Health Day, we celebrate the #powerofrural by recognizing our healthcare workers in #WI07. \n\nThank you for your tireless work and dedication to your communities! https://t.co/PCJyNXTkEF","date":"Thu Nov 19 15:58:23 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I will continue to work to support our veterans and ensure those who have served receive the care and benefits they deserve.","date":"Wed Nov 11 14:03:07 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Happy Veterans Day! 🇺🇸 \n\nToday, we honor the great men and women who have served our nation. Thank you and your families for the incredible sacrifices you have made for us. We forever remain a grateful nation. https://t.co/7049s6mIFq","date":"Wed Nov 11 14:01:53 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The election is not over, and it is bigger than President Trump or Joe Biden – it is crucial to have transparency so the American people have confidence in the integrity of our election system.","date":"Mon Nov 09 15:02:27 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Let’s halt the premature rush to declare a winner in the presidential race to ensure that every legal vote is counted and that every legitimate legal challenge is heard and addressed by our independent judiciary.","date":"Mon Nov 09 15:02:27 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Americans want a transparent process that counts every legally cast ballot.","date":"Fri Nov 06 21:15:39 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today is a big win for Wisconsin. The announcement to delist the gray wolf represents an important first step toward restoring local control over the skyrocketing gray wolf population in Wisconsin. \n\nhttps://t.co/ow46vfh41G","date":"Thu Oct 29 18:51:51 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"But there is more work to do. \n\nWe need to permanently restore wolf management authority in law to where it belongs: the capable hands of state policymakers and fish and game agencies","date":"Thu Oct 29 18:51:51 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congratulations to Justice Amy Coney Barrett!","date":"Tue Oct 27 00:23:35 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The American people deserve less political theater and more work from their elected leaders.\n\nI look forward to watching Judge Barrett become Justice Barrett in the coming days when she is confirmed. #ConfirmACB","date":"Thu Oct 22 16:38:10 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"The decision by @JudiciaryDems to boycott today's vote on Judge Amy Coney Barrett’s nomination was disappointing, unfortunate and an insult to Judge Barrett, who has shown remarkable grace and patience throughout these proceedings.","date":"Thu Oct 22 16:38:09 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today’s election-year posturing was eerily reminiscent of what we saw in Madison a decade ago, when Democrats in our state legislature pulled a “no show” and ran off to Illinois in a desperate, last-ditch effort to grind the people’s business to a halt. \n\nThey too failed.","date":"Thu Oct 22 16:38:09 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Manufacturing is essential to Wisconsin’s economy. Today on @MFGDay, I want to thank the manufacturers of this great nation and join them in raising awareness of the industry’s need for future creators!","date":"Fri Oct 02 14:58:06 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"More information here: https://t.co/oQkmNtdYlm #MFGDay20 #CreatorsWanted","date":"Fri Oct 02 14:58:06 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wishing @POTUS and @FLOTUS a speedy recovery. You and your family are in my thoughts and prayers! \n\nTogether, we will continue to fight the COVID-19 virus.","date":"Fri Oct 02 14:13:53 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Last night, Ms. Angie Kennell was honored by @CCAInstitute as the #WI07 2020 Angel in Adoption. \n\nThank you to Ms. Kennell and to all honorees for their extraordinary work to make the dream of a family a reality for every child.","date":"Thu Oct 01 14:53:28 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Impressive work by researchers at MacIver Inst. correcting inaccurate #covid19 information from @DHSWI. It's critical that people receive accurate data so they can make informed decisions. Thanks to @MacIverWisc for being on the job.\n\nhttps://t.co/Qexkyi3MVy","date":"Wed Sep 30 20:13:13 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congratulations to Judge Amy Coney Barrett on her nomination to the Supreme Court today!\n\nWell deserved!","date":"Sat Sep 26 23:54:42 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"House Republicans are committed to: \n\n🇺🇸 Restoring the American way of life\n🇺🇸 Rebuilding the American economy\n🇺🇸 Renewing the American dream\n \nRead more on our #CommitmentToAmerica: https://t.co/4P9iggqHBs","date":"Tue Sep 22 17:52:41 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read the press release here: \nhttps://t.co/cCS6l6eNQk","date":"Thu Sep 17 17:54:34 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Last night I introduced legislation calling for an end to the outdated “One China Policy” and closer ties with our allies in #Taiwan.\n \n#America doesn’t need a permission slip from Communist #China to talk to our democratic friends and partners. \n\nIt’s time for a change.","date":"Thu Sep 17 17:54:33 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Watch live: https://t.co/i7ORjbpIor","date":"Wed Sep 16 20:23:09 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Looking forward to joining @RepAndyBiggsAZ tonight for the special order on the House floor. \n\nTune in to watch!","date":"Wed Sep 16 20:07:42 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, we remember the thousands who lost their lives and the first responders who ran into the chaos 19 years ago during the 9/11 attacks in New York City and Washington, DC. \n\nWe will #neverforget their courage and sacrifices. https://t.co/FweiL4Sgbm","date":"Fri Sep 11 15:07:33 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"But… won’t everyone be wearing #masks on #Halloween?\n#TrickOrTreat 🤔😷👻🎃 https://t.co/KkMquAt2Ut","date":"Wed Sep 09 14:02:06 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, with @RepPeteStauber, I introduced legislation to permanently remove the gray wolf from the federal endangered species list. We need to return the authority to control the gray wolf population back to where it belongs: the hands of state lawmakers and wildlife officials.","date":"Fri Sep 04 17:31:04 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Read my latest op-ed on how America’s privately owned shipyards like #FraserShipyards could help boost the capabilities of the #USNavy, save taxpayers money and boost the northern #Wisconsin economy.\n\nhttps://t.co/qbJOHavKfU","date":"Thu Sep 03 15:41:05 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Once again, the message from liberal politicians is ‘do as we say, not as we do.' \n#DoubleStandard #PelosiBlowout #LightfootHaircut #DeBlasioGym\n\nhttps://t.co/OORQ1aJiLc","date":"Wed Sep 02 15:37:39 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Great news for US agriculture &amp; our friends in #Taiwan.  Free and fair trade between free and fair countries is win-win and I look forward to formal talks for a #US #TaiwanFTA\n\nhttps://t.co/OD3Zn8eL68","date":"Tue Sep 01 16:33:01 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I have asked AG Barr to open a Civil Rights investigation into the possible politically motivated killing of Bernell Trammell.\n\nRead the letter:\nhttps://t.co/QhejaEEKbt","date":"Thu Aug 20 19:29:22 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"@GOPLeader has the facts.\n\nInstead of dealing with real crises, we are being called back to Washington to deal with a phony crisis and vote on a bill that had no chance for amendments.","date":"Wed Aug 19 23:57:22 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today is the 100th anniversary of Women’s Suffrage in America.\n\nDid you know Wisconsin was the first state to ratify the 19th Amendment on June 10th, 1919?\n\nhttps://t.co/rPmkmwIy28","date":"Tue Aug 18 17:20:44 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Blocking freeways is not peaceful protest. It is dangerous and must stop. Obstructing traffic jeopardizes access to vital emergency services. Wisconsin businesses and workers rely on I-94.  @SecElaineChao @TheJusticeDept \n\nhttps://t.co/JLVv7CDsAj","date":"Fri Aug 14 16:57:13 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As I described to #AGBarr during a recent @JudiciaryGOP hearing, some leaders continue to turn a blind eye to lawlessness.","date":"Tue Aug 11 17:14:38 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I hope this historic visit to #Taiwan by @SecAzar is the first of many, long-overdue high-level exchanges between our two free and democratic nations.","date":"Wed Aug 05 13:52:31 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"As we continue to fight COVID-19, ICE and CBP are protecting Americans by seizing fraudulent medical supplies at our border.","date":"Fri Jul 31 15:23:54 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Judiciary Cmte Dems are limiting the ability of Republicans to discuss and debate #BigTech censorship at a hearing today – the same way #BigTech is limiting your ability to discuss and debate issues online. \n\nWe must protect #freespeech!","date":"Wed Jul 29 13:46:48 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"These violent riots are no “myth”.","date":"Tue Jul 28 16:39:16 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We have few legislative days, but House Dems would rather waste time on partisan attacks and relive impeachment than discuss the real issues. https://t.co/FkYXbPphL4","date":"Thu Jul 23 22:13:41 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I asked House Democrats to allow an up-or-down vote on my amendment to the Interior Dept budget that would end Washington meddling in Wisconsin wolf management decisions. \n\nWe will find out tomorrow if they do. Stay tuned. https://t.co/ae9iAo4Sn1","date":"Tue Jul 21 15:00:01 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"With lawmakers returning to their states for the Independence Day work period, I was back home in #WI07 this week!\n\nREAD MORE: https://t.co/Xs2bDrqqDQ","date":"Fri Jul 10 21:19:28 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congress should do what is necessary to restore law and order. \n\nLawlessness must not be tolerated.","date":"Fri Jul 10 18:47:36 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"This is unacceptable. All @JudiciaryGOP members should be allowed to represent their constituents by attending the hearing and questioning the witnesses.","date":"Wed Jul 08 14:12:54 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Open-ended school shutdowns have set students back and pushed parents to the breaking point.\n\nIt is time we work to reopen our schools.","date":"Tue Jul 07 16:50:48 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I was on @DrydenWire to discuss my first few months in Congress! \n\nWATCH:","date":"Tue Jul 07 16:43:21 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, we come together to celebrate our great country!\n \nWe reflect on the sacrifices of our veterans and the wisdom of our founders who made it possible for generations of Americans to live a free and fulfilling life.\n \nHappy 4th of July! https://t.co/LaS1cIdvto","date":"Sat Jul 04 14:00:01 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I’ve got some updates to share with you from this week in our latest edition of the Telegram.\n\nREAD HERE:\nhttps://t.co/K8VMZuqm08","date":"Thu Jul 02 20:00:00 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We set another record with 4.8 million jobs created last month! \n\nAnother great sign that our country is getting back to work and our strong economic recovery is continuing.\n\nhttps://t.co/beobquZCEa","date":"Thu Jul 02 15:47:02 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, the #USMCA goes into effect.\n\nThe agreement cuts red tape and allows for freer and fairer trade between the US, Canada and Mexico.\n \nTruly a win for Wisconsin small businesses and farmers. \n\nhttps://t.co/QbmiMaH1xp","date":"Wed Jul 01 16:48:07 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Follow me on @parler_app!\n\nAccount: RepTiffany https://t.co/nIqxa8YWPS","date":"Mon Jun 29 17:14:34 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Subscribe to the weekly e-newsletter to stay up to date!\n\nhttps://t.co/A2rbKKdaP6","date":"Fri Jun 26 20:50:31 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I have a lot to share with you this week!\n\nRead the newsletter here: \n\nhttps://t.co/GFseO5wyhz","date":"Fri Jun 26 20:46:29 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, @RepMcCarthy discussed the riots, lawlessness and mob violence in Madison.\n\nThe criminal behavior needs to stop. \n\nEnough is enough. https://t.co/kCNaRFEsh3","date":"Fri Jun 26 01:09:26 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On @620wtmj today, @GovEvers once again described violent rioters as “protesters,” and suggested that destruction of property and assault and battery are somehow protected by the 1st Amendment. If he can’t tell the difference, he’s not qualified to lead the people of Wisconsin.","date":"Wed Jun 24 23:31:00 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Property damage, destruction and physical assault are not legitimate forms of political discourse.\n \nEnough is enough.","date":"Wed Jun 24 18:13:29 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Today, I released a statement on the violence in Madison and called for the resignation of Governor Evers. \n\nRead the statement here: \n\nhttps://t.co/bd1CanCa2h","date":"Wed Jun 24 16:21:46 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Violence has no place in America.\n\nToday, I released a statement on the device left at the Hudson GOP office in Hudson, WI. \n\nREAD HERE: \nhttps://t.co/PmpKiUessv","date":"Tue Jun 23 19:13:22 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Wisconsin shows lower unemployment rates than states that imposed the most severe lockdowns during the pandemic.\n\nLet’s reopen America and get back to work!\n\nhttps://t.co/oCiWRPLcNr","date":"Mon Jun 22 18:11:34 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Forced online schooling is unfair to rural families. \n\n“The least privileged kids will be stuck...Children will be pushed into the next grade regardless of whether they’re ready. Many will never catch up.” \n\n#ReopenOurSchools and get kids back to class.\nhttps://t.co/gxrSzpB7Qt","date":"Mon Jun 22 13:39:25 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Marshfield Medical Center in #WI07 awarded $1 million to aid services impacted by the COVID-19 pandemic.\n \nLet’s continue to work together to get Wisconsin and America back up on her feet again.","date":"Wed Jun 17 19:22:21 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"2.5 million jobs added in May, unemployment down, and largest monthly rise in retail sales on record! \n\nGreat news for American families, workers and employers.\n\nhttps://t.co/sqtiexDoDP","date":"Tue Jun 16 16:03:28 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Deeply saddened to hear the passing of Cheryl Sensenbrenner, advocate for Americans with disabilities and the wife of fellow Wisconsin Congressman Jim Sensenbrenner. My thoughts and prayers are with the Sensenbrenner family.","date":"Mon Jun 15 19:32:36 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"All government agencies and programs benefit from proper oversight and appropriate transparency. That’s just good government. \n \nBut abolishing entire police departments is dangerous and reckless.","date":"Mon Jun 15 16:54:19 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Stay connected!\n\nSUBSCRIBE to the WI-07 weekly newsletter:\nhttps://t.co/A2rbKKdaP6","date":"Fri Jun 12 19:36:00 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Public safety and security, including the security of America’s border, remains a serious challenge for our nation.  \n\nRead more in my weekly newsletter: \nhttps://t.co/r9vOrwTG26","date":"Fri Jun 12 19:22:55 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"We can protect elderly and vulnerable citizens without hurting kids’ education. That’s why I joined @RepJimBanks in backing the Reopen Our Schools Act, so students can safely return to the classroom this fall. It's time to get back to school without overly restrictive conditions.","date":"Thu Jun 11 17:35:06 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I visited the new border fence with @RepAndyBiggsAZ in Cochise County, AZ that keeps illegal trafficking out of the country and protects the property of local ranchers. \n\nTruly a success story. https://t.co/YKSPlF9Loo","date":"Wed Jun 10 20:38:40 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Congratulations to the Class of 2020! #WI07","date":"Tue Jun 09 19:10:45 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Very excited to join @RepAndyBiggsAZ and fellow members of Congress to get a look at what is happening along our southern border.","date":"Tue Jun 09 15:21:04 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Defunding the police is a fringe idea that is both dangerous and extreme.\n\nAmericans want safe communities, not lawlessness and anarchy.","date":"Mon Jun 08 17:24:34 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Stay connected! \n\nSubscribe to my weekly e-newsletter:\nhttps://t.co/A2rbKKdaP6","date":"Fri Jun 05 21:07:24 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"It's been a busy month! \n\nI traveled to Washington, DC with my family, where I was sworn in to Congress to represent our community. #WI07\n\nREAD MORE: \nhttps://t.co/LaYQAXtAJr","date":"Fri Jun 05 21:07:24 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"I support this important reform from @RealDonaldTrump, which will help speed up key infrastructure projects, create good family wage jobs and ensure tax dollars are spent on concrete and asphalt.\n\nNot wasted on endless paperwork and costly red tape.\n\nhttps://t.co/Zlj5oqFTH1","date":"Fri Jun 05 20:14:17 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"News report in today's @journalsentinel by @WisVoter on my arrival in Congress during challenging times. \n\nIn 200+ years, Americans have faced difficult circumstances but always expected their elected officials to show up.\n\nhttps://t.co/HPNhn6BlH7","date":"Fri Jun 05 18:56:12 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"Unemployment rates down as American employers added 2.5 million jobs in May.\n\nIt’s time we open small businesses and get back to work to keep this recovery going. #OpenAmerica\n\nhttps://t.co/hoeJIKdV2c","date":"Fri Jun 05 14:51:38 +0000 2020","user_id":"1267841066335682562"},{"handle":"RepTiffany","text":"On May 20th, I was sworn into office as a member of the U.S. House of Representatives. I look forward to serving Wisconsin’s 7th District and the American people. https://t.co/nbAoAI7YMg","date":"Wed Jun 03 17:59:24 +0000 2020","user_id":"1267841066335682562"}]