[{"handle":"Robert_Aderholt","text":"Bob Gates didn’t go far enough. I believe Joe Biden has been wrong on almost every economic issue for his entire career. Now that he’s in charge, all those bad decisions are having a negative impact on all Americans. https://t.co/pOwh18LIMx","date":"Thu Jun 16 16:41:47 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we celebrate 247 years of service by the U.S. Army. It was on this day in 1775 that Congress resolved the Army into existence and appointed George Washington to command in the defense of American liberty. #ArmyBDay #Army247 https://t.co/cvGCPiFHOB","date":"Tue Jun 14 14:11:51 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"According to fivethirtyeight, Joe Biden has the lowest approval rating of any President at this point in their presidency going all the way back to Harry Truman.  But looking around at our country right now, is it any surprise?\nhttps://t.co/mEPUUQkX0k","date":"Mon Jun 13 20:31:40 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When are Democrats going to hold a primetime hearing on this? https://t.co/FfpwZqmIxf","date":"Fri Jun 10 13:11:33 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I joined Americans United for Life in calling on the Biden DOJ and Mayor Muriel Bowser to investigate illegal late-term abortions being performed in D.C. and across the country. The fight to protect our most vulnerable continues. https://t.co/oxyrQROhVo","date":"Thu Jun 09 18:08:55 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats seem to have little concern about the price at the pump. Instead of let them eat cake, Democrats just say let them buy an EV.","date":"Wed Jun 08 17:56:48 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The economy is headed down a dark path and the Biden Administration has no road map. We need real solutions to our constantly increasing prices. https://t.co/jGfq12DJmV","date":"Tue Jun 07 21:01:56 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we honor the brave men who put their lives on the line 78 years ago in the advance on Normandy Beach. Because of their bravery we continue to live in freedom sustained by unwavering courage and strength. May we always remember their sacrifice to our country. https://t.co/MoJVCkCw0c","date":"Mon Jun 06 17:42:43 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama was, is and will continue to be the best choice for Space Command.  https://t.co/LFc3FRN0S5","date":"Thu Jun 02 20:35:04 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we hit a new record high national average at $4.67 per gallon. We need to return to American energy independence, start producing for ourselves, and get these prices down. https://t.co/YQlZZDdF7O","date":"Wed Jun 01 18:07:04 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As I’ve said before, relying on China and our adversaries for minerals critical to our industrial base is a ticking time bomb. We have to aggressively address this issue. https://t.co/GN1RUUytoc","date":"Mon May 23 20:03:28 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I asked Administrator @SenBillNelson with @NASA about securing American research and development within the space industrial base. Evidently China didn’t like his answer. Its past time to expose China’s theft of American research and technology. https://t.co/weOX0Pzdk9","date":"Fri May 20 20:29:17 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @boeing for the successful launch of the Starliner capsule atop of the @ulalaunch Alabama built Atlas. A great step to a second option for getting astronauts to low Earth orbit. @BoeingSpace","date":"Thu May 19 23:20:15 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I asked @SecRaimondo about our import reliance for critical minerals. “Vulnerable” is not a word that should be used to describe our standing with China on any issue. It’s time to work towards domestic production and trade with allies, not adversaries. https://t.co/YnVbrkOjke","date":"Wed May 18 18:29:34 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A huge step forward today by @usairforce and @LockheedMartin in ensuring we are competitive with our adversaries in new weapons development. https://t.co/llfnTUgTgk","date":"Tue May 17 19:12:46 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @HsvMayorsOffice on this great honor. Huntsville, and North Alabama, have a great quality of life that's getting national attention. https://t.co/ayFf26xVu7","date":"Tue May 17 13:56:08 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We need to return to the fiscal polices we had under President Trump where the economy was booming and inflation was in check.","date":"Mon May 16 15:56:45 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"New Pew Research poll shows that 70% of Americans see inflation as the biggest issue facing our country, an issue that will cost the average American household over $5,000 this year. https://t.co/iMcfp2sQfL","date":"Mon May 16 15:56:44 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Big news today from @ehtelescope!","date":"Thu May 12 14:32:13 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm calling on us make new investments in our military to meet the challenges we have coming at us from Russia, China, North Korea and Iran. China in particular wants to match, and surpass us in military capability by the middle of the century. https://t.co/DEG4r1tkMl","date":"Thu May 12 13:41:14 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Join me in recognizing our law enforcement as we observe National Police Week. As crime rates rise, these heroes work hard every day to ensure our communities remain safe. https://t.co/uZJJpTfpxR","date":"Wed May 11 15:22:09 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I've always felt the decision to locate\nSpace Command in Huntsville would\nstand up to the scrutiny. This report is\nan important step in cementing this\nchoice. https://t.co/X4tnBynnyd","date":"Wed May 11 00:24:12 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We know so much more now about the development of unborn babies than we did in 1973.  Roe V Wade has become outdated and needs to be struck down. 60 million innocent human heartbeats have been stopped.  No more! https://t.co/TKDa3xwzfA","date":"Tue May 03 18:22:32 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While we have an Administration that seems to want to crack down on the First Amendment, it’s good to know we have a Supreme Court that still champions it.  Even the liberal justices.  https://t.co/tfMvyA4yBN","date":"Mon May 02 15:25:34 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The failed economic policies of the Biden Administration are coming home to roost.  https://t.co/4QLagw3q5p","date":"Thu Apr 28 12:53:48 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"You do not get to create a danger and then pretend to be concerned about it.","date":"Wed Apr 27 15:45:16 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is a ridiculous statement. Russia started this unprovoked war. If there is any danger of a nuclear engagement, it's a danger that Russia alone created. https://t.co/psbyqVARyx","date":"Wed Apr 27 15:38:19 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Over 220,000 migrants were apprehended in March. Secretary Mayorkas will have a lot to answer for in this week's hearings.","date":"Tue Apr 26 16:23:44 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today has been a good day for free speech.","date":"Mon Apr 25 19:53:56 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@TheDaleJackson Bedrock","date":"Mon Apr 25 01:08:15 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"That didn't age well. https://t.co/kiClzvfIrt","date":"Wed Apr 20 18:35:19 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While we seek for space to be a peaceful domain, it would be naive to assume that Russia and China will do the same. Our adversaries will surely continue these tests and our national security will be at a heightened risk because of it. https://t.co/INgpu6rDZR","date":"Tue Apr 19 02:41:31 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is a positive development. This transportation mask mandate makes no sense.   https://t.co/1CrfIyVVU5","date":"Mon Apr 18 17:48:12 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’ve been sanctioned by Russia. I guess we will be canceling our Siberian spring break plans.  But in all seriousness, I’m proud to be on this list. https://t.co/EPIcFmWMvn","date":"Thu Apr 14 00:59:38 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I joined my colleagues in penning a letter to the U.S. Attorney General asking for the appointment of a special counsel to lead the investigation into Hunter Biden by the U.S. Attorney’s Office for the District of Delaware. \nhttps://t.co/AZmljSfVdL","date":"Tue Apr 12 20:23:44 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is the only way to ensure that there is no conflict of interest, and that the Administration won’t be investigating the son of the president that they work for.","date":"Tue Apr 12 20:23:44 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s time for the mask mandate to end.  https://t.co/qUSp1LvTxg","date":"Mon Apr 11 20:42:59 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Biden continues to blame inflation on everything except his failed economic agenda. During his campaign he promised to govern as a centrist but I, and the people of Alabama, have seen him do nothing but bend to the radical wing of his party.https://t.co/YezuG2C5Gh","date":"Fri Apr 08 19:58:38 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Contrary to the Biden Administration’s belief, the job of the Department of Defense is not to pursue climate issues. Its job is to defend American citizens and our interests abroad. Increasing the defense budget is for security and strength, not for woke governance. https://t.co/7Dafps8FgW","date":"Wed Apr 06 16:45:36 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for ULA and Blue Origin, all with operations and hundreds of employees right here in Alabama.\nhttps://t.co/cr8Uw7r5br","date":"Tue Apr 05 15:23:04 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our defense industry and critical infrastructures are threatened everyday by cyber-attacks from our adversaries. As their capabilities become more advanced, we must ensure that we stay ahead in our own defense. https://t.co/UixLzKVpkh","date":"Mon Apr 04 19:45:44 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Coming from two nations, neither of which were created by democracy, this is outlandish. Beijing has refused to condemn Russia’s invasion of Ukraine, and with this alliance, the United States needs to remain vigilant in its dealings with these autocratic, totalitarian nations. https://t.co/R8ixKyeEDy","date":"Sat Apr 02 16:01:00 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This would be hilarious if it wasn't so scary and troubling. Russia, nor China, have democracy or the world's best interests at heart.  They want all people to live under autocracy. @CBSNews  https://t.co/bryCszZt2z","date":"Thu Mar 31 14:30:56 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Since 2017 we have moved to 100% reliability on China and other countries for 14 of 35 critical minerals necessary for the defense industrial base. We cannot continue to rely on adversaries for the materials that we need for our defense. https://t.co/b5XxPwsyEW","date":"Wed Mar 30 18:41:40 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is a growing problem. How China's TikTok, Facebook influencers push propaganda (from @AP) https://t.co/BLsd7W2lhe","date":"Wed Mar 30 18:19:51 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wishing a big welcome home to astronaut Mark Vande Hei after his U.S. record 355 day-long stay on the @Space_Station! His trip is another key in the quest to help @NASA get Americans back to the moon and on to Mars. https://t.co/AMICrdJXQc","date":"Wed Mar 30 14:43:27 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was glad to be able to pay my respects to my friend and colleague, Don Young of Alaska. https://t.co/Lf50YRisG4","date":"Tue Mar 29 20:53:32 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we honor all of the Vietnam Veterans and their families for their bravery and the sacrifices they made serving our great nation. Thank you to all who served. https://t.co/D33hn1dmbI","date":"Tue Mar 29 14:00:03 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On Monday, Ukraine recaptured the city of Trostyanets and today the city of Irpin outside of Kyiv. The Ukrainian people surprised Putin with their resilience and continue to push back on his brutal attempt to bring back Soviet-style control to the region. https://t.co/2rg7ZJJNyC","date":"Mon Mar 28 20:02:20 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We’ve seen that even children are not safe from Putin’s war, and I am proud to help lead an effort to protect these who are truly among the most vulnerable.","date":"Wed Mar 23 15:03:06 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I have joined my fellow co-chairs of the Congressional Coalition on Adoption in penning a letter to U.S. Secretary of State Anthony Blinken advocating for the approximate 300 Ukrainian children who are currently engaged in the adoption process with American families. https://t.co/nm92AXrYST","date":"Wed Mar 23 15:03:05 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today on #NationalAgDay we recognize the unwavering dedication and contributions of all branches of the agriculture industry. The work of our farmers, ranchers, farmworkers, foresters, and fishers is a service not just to the nation, but to the world. Thank you for all you do! https://t.co/lrOR98tb6s","date":"Tue Mar 22 23:14:00 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm saddened to learn that my colleague, but more importantly, my friend, Congressman Don Young has passed away.  When he was walking the halls of Congress, more than 4,000 miles from home, Alaska was first and foremost on his mind.\nhttps://t.co/ovWGtGsmyw","date":"Sat Mar 19 02:27:22 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to everyone @nasa on this great accomplishment.  I of course have to acknowledge everyone at @NASA_Marshall for their work on @NASA_SLS.  I can't wait to one day see this powerful rocket return us to the moon and beyond.","date":"Fri Mar 18 17:16:05 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We can not afford to wait for China to act to strengthen our forces and relationships with our allies. Ensuring a strong defense budget year after year allows us to stay ahead of our adversaries. https://t.co/xdjGl9fDB0","date":"Thu Mar 17 19:20:30 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The people of Ukraine are determined to standup to this invasion and I support efforts for America to help them in this defiance.","date":"Wed Mar 16 13:48:47 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was good to hear from President Zelensky in his address to Congress this morning.  And afterward, I also got a chance to speak to Ukraine's Ambassador to the U.S., Oksana Markarova. https://t.co/x9LSeP4cmY","date":"Wed Mar 16 13:48:46 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is what Biden’s energy policies have gotten us. With the ban on Russian oil imports, it’s time to make up that difference with more American energy sources. That gives us energy independence, while also creating American jobs. https://t.co/1dJNFcPHZ8","date":"Mon Mar 14 19:21:10 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last night I voted to ban Russian energy imports. This is a good first step in the right direction, now Biden needs to do his part by finishing the Keystone XL pipeline and removing regulations on drilling. https://t.co/93lxsU6bdi","date":"Thu Mar 10 15:28:41 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Putin does not care if he kills or hurts children. It’s just another day at the office for him. Ukraine: Russian strike hits hospital (from @AP) https://t.co/BylWywxjSN","date":"Wed Mar 09 16:10:24 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While I'm glad we are banning Russian oil, it needs to be replaced with American oil from American soil.   We don't need to replace the oil from one dictator with the oil from another dictator. https://t.co/T7SHmb4tyk via @usatoday","date":"Tue Mar 08 14:06:51 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Putin has shut down any media that highlights the atrocities he has committed against Ukraine. The people of Russia do not have the freedom of speech or protest, and now they will be hidden from seeing the true nature of what their leader is doing to innocent, sovereign people. https://t.co/pohKjPCr8M","date":"Sun Mar 06 22:58:38 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Unfortunately, it seems Russia, like Cuba and North Korea, won’t taste that freedom as long as the current leadership is in power.","date":"Fri Mar 04 22:21:27 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For a brief time after the Cold War, Russians got a taste of freedom.  I believe that sowed a seed that will ultimately prevail in this current crisis.","date":"Fri Mar 04 22:21:27 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While it makes no logical sense, President Putin seems to want to turn Russia into North Korea. And he wants to make his people suffer just the same with poverty and famine, all the while using his nuclear weapons as blackmail against the world.","date":"Fri Mar 04 22:21:26 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I’m calling for an end to the importation of Russian oil and gas. I also call on President Biden to approve the Keystone Pipeline and lift the extreme restrictions on further oil and gas exploration in the U.S.","date":"Thu Mar 03 20:07:48 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"House Republicans to Pelosi: Reopen the People's House Today - House Republican Leader https://t.co/3giF53GwLi","date":"Thu Mar 03 00:32:58 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I fully support our efforts to help the people of Ukraine. But I'm disappointed the President did not address our own defense needs with increased spending to address the new threats from Russia and China.","date":"Wed Mar 02 03:17:32 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I fully support our Veterans and the V.A.  They have fought and earned that commitment.","date":"Wed Mar 02 03:07:10 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Abortion stops an innocent human heartbeat.","date":"Wed Mar 02 02:59:38 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is a crisis at our southern border.  This administration has not done enough.","date":"Wed Mar 02 02:58:12 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Requiring people to show an I.D. to vote, is not suppressing the vote.","date":"Wed Mar 02 02:55:50 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats have been calling for defunding the police for two years now.","date":"Wed Mar 02 02:54:54 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrat Covid regulations hurt the economy, while doing little to stop the spread of the virus.  State's with the most restrictive Covid requirements, had just as many cases, if not more.","date":"Wed Mar 02 02:47:46 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We also need to buy American when it comes to oil and natural gas.","date":"Wed Mar 02 02:45:26 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I agree we need to stop relying on Chinese made goods. This also goes for our military equipment.  It should all be sourced/made in the U.S. or in our allied countries.","date":"Wed Mar 02 02:34:21 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Biden Administration is adding burdensome regulations to the infrastructure bill to make it difficult to start repairing our roads and bridges.  We need to be able to move fast!","date":"Wed Mar 02 02:30:03 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The infrastructure bill was filled with too much leftist \"pork\" and not enough real infrastructure funds.","date":"Wed Mar 02 02:25:50 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When I was in Lithuania last week, they were very concerned Putin would not stop at Ukraine, but would come after them as well.","date":"Wed Mar 02 02:17:33 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"With the situation in Ukraine, and Putin's actions, I'm hoping to hear the President talk about increasing military defense spending.","date":"Wed Mar 02 02:13:37 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm proud to stand with the Ukrainian people.","date":"Wed Mar 02 02:11:04 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I plan to live tweet my reactions to the President's speech tonight.","date":"Wed Mar 02 01:44:21 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"One thing we need to hear from Biden tonight is a plan to combat record-high inflation. But I’d be willing to bet his only plan is more spending. https://t.co/VN5Hx8Mg3D","date":"Wed Mar 02 01:22:47 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The State of the Union address is an opportunity for presidents to talk about their accomplishments. So, you probably won't hear President Biden talking about these facts tonight. Or if he does, it will be only in passing or to downplay it. https://t.co/W1QGRJNSav","date":"Tue Mar 01 18:18:41 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The best offense is a robust defense.  Now is the time for Congress to increase our military spending to make sure we can respond to all threats.  It is not the time for trying to make our military green and woke. https://t.co/HuaAgPHYPV","date":"Mon Feb 28 20:12:02 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We continue to send prayers to the people of Ukraine during this dark time.","date":"Thu Feb 24 17:04:08 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This invasion is a brutal effort by Putin to stamp out a democratic nation on his doorstep. Nothing like this has occurred in Europe since WWII.","date":"Thu Feb 24 17:04:07 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sending my prayers to the people of Ukraine.","date":"Thu Feb 24 03:43:31 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I think the AHSAA does need to further clarify why they would not make a reasonable religious accommodation for the Oakwood team, especially since it had been worked out among the other teams it would impact.  https://t.co/MtsRdby7Zd","date":"Wed Feb 23 15:14:34 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The unsecured southern border isn’t just an issue in border states, it’s a coast-to-coast case of drug traffickers targeting our communities as new markets. https://t.co/KBRXxOBrMh","date":"Thu Feb 17 18:10:18 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden said that “forecasters continue to project inflation easing substantially by the end of 2022.” Meanwhile families will pay over $3,000 more a year for everyday items. https://t.co/A7rML2BZ9C","date":"Tue Feb 15 17:00:11 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Inflation is a tax on every American that is wiping out any gains in economic growth. The Biden Administration has no plan to deal with it and just calls it “transitory.” https://t.co/auJQWA4G3t","date":"Thu Feb 10 13:52:01 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is the amount seized, but far more is able to slip, undetected, through our porous border every year. https://t.co/uQzcWsjqIN","date":"Wed Feb 09 18:35:17 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This increase is unbelievable. We have to make sure this deadly drug stays OUT of our communities. https://t.co/Mr3WBqSjU6","date":"Tue Feb 08 14:51:05 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Illegal immigration isn't the only issue we have at the border. Deadly drugs like fentanyl are pouring in at alarming rates and plaguing our communities with counterfeit pills.\nhttps://t.co/EIllFcCKcG","date":"Mon Feb 07 19:18:29 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If we are to reach a bipartisan deal on the federal budget, then the Hyde Amendment must be included. https://t.co/wgez3DcDAh","date":"Tue Feb 01 22:08:10 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was great being at the ribbon cutting Thursday of Dura Automotive Systems’ new facility in the Shoals. Their innovation is creating hundreds of new jobs right here in the 4th District. https://t.co/NVV62915Ge","date":"Fri Jan 28 12:39:49 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations!  War Eagle!","date":"Mon Jan 24 17:13:45 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"New airline lands soon in northwest Alabama | https://t.co/NuIddxODaF https://t.co/fRVV5MbLV5","date":"Mon Jan 24 17:00:37 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am profoundly grateful that 52 senators stood up for our democracy. They stood up against changing the filibuster and ultimately stood up against a federal takeover of our elections from the states where that authority has been for more than 200 years.","date":"Thu Jan 20 04:15:16 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s now been one year since the announcement that United States Space Command would be permanently headquartered in Huntsville. Space Command belongs in the Rocket City. It’s the perfect match. https://t.co/JAn4ajnAkL","date":"Thu Jan 13 22:23:15 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The employer mandate issued by the Administration was too broad &amp; heavy-handed – a one-size fits all requirement that did not take into account the realities of workplaces &amp; our economy.  I’m glad we have a high court that will rein in this type of government overreach. #SCOTUS","date":"Thu Jan 13 19:48:54 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Even though a Monmouth University poll found that support for voter I.D. is at 62% among Democrats, 87% among Independents, and 91% among Republicans.  H.R. 1 needs to be stopped.","date":"Tue Jan 11 20:00:36 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats are making a big push to pass H.R. 1 which would take control of elections from the states and give it to the Federal Government.  It would ban laws requiring people to show I.D. before voting. https://t.co/bXBLoQSYlI","date":"Tue Jan 11 20:00:35 +0000 2022","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The James Webb Space Telescope is well on its way. Congratulations and good job to everyone at @NASA_Marshall for all the hard work you did to make this happen. #JamesWebbSpaceTelescope https://t.co/qqW9tcRvQ5","date":"Sat Dec 25 14:06:17 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is one of the best Christmas gifts America could get this year. This bill was far too expensive and far too radical. And even the supposedly slimmed down version was filled with hidden costs. I applaud Senator Manchin for standing his ground.  https://t.co/o5wyZuGyzn","date":"Sun Dec 19 14:48:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Build Back Broke will cost far more than what Democrats are selling it as.  The sticker price is not the final cost. https://t.co/L475dwb9o4","date":"Thu Dec 16 23:13:30 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Another piece of evidence entered in the case against Biden’s Build Back Broke legislation.  Americans are already paying for the other huge spending bills this year, they can’t take much more.  https://t.co/gdiVsJhN49","date":"Fri Dec 10 13:49:25 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I think Americans are already paying far more than their fare share for gas Mr. President.","date":"Thu Dec 09 18:09:58 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@WBRCnews @WVTM13 @CBS_42 @abc3340  Let’s help @ArabTribune find the owner of this ornament that fell out of the sky during the 2011 tornado outbreak. It likely came from Cullman or west.  After 10 years, it needs to return to its owner. https://t.co/ydeCmlANDM","date":"Thu Dec 09 18:07:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was good meeting with the Alabama Cattlemen’s Association. Thanks for coming by the office in Washington. https://t.co/sdF4EXfRmE","date":"Wed Dec 08 20:49:00 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we remember the 80th anniversary of the attack on Pearl Harbor and the 2,403 Americans who lost their lives. #PearlHarbor80 https://t.co/WizyP8wFke","date":"Tue Dec 07 14:11:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m glad the Biden Administration finally decided to make this obvious choice. With China’s recent human rights abuses, theft of intellectual property, &amp; their lack of COVID openness, I don’t think the CCP should be celebrated on the world stage.  https://t.co/JReReTCVI5","date":"Mon Dec 06 19:06:50 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On the eve of the 80th anniversary of America’s entry into WWII, we’ve lost an American hero, the epitome of the Greatest Generation. It was one of the honors of my life to meet and know Senator Bob Dole. https://t.co/oqYTNEZ9ve","date":"Sun Dec 05 17:28:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the Crimson Tide as SEC Champs. Georgia is great and I feel like we will meet again. I know @RepTerriSewell and I are looking forward to those Georgia treats from @repdavidscott and @CongressmanHice","date":"Sun Dec 05 01:04:10 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Joe Biden promised economic growth and a surge in jobs – clearly this was a hollow promise.  Today’s disappointing job report is another failure of this Administration.  Vaccine mandates, the Afghanistan disaster, soaring inflation, and lack of leadership –really it’s nothing new","date":"Fri Dec 03 18:20:21 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Unborn babies are innocent human beings.  SCOTUS has the opportunity to right a wrong.  #EmpowerWomenPromoteLife https://t.co/j5oyfCUSod","date":"Wed Dec 01 13:09:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear this news. Cecil Hurt is part of the Alabama Football fabric and will forever be a part of its rich history.","date":"Tue Nov 23 23:31:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The two Joe Bidens.  Green New Deal Joe Biden: kill the XL Pipeline and kill fossil fuels!  Approval Ratings Crashing Joe Biden: Release the fossil fuels!","date":"Tue Nov 23 15:01:48 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It gives tax cuts to the wealthy, hikes taxes on middle-class families, and adds hundreds of billions to the already morbidly obese national debt.","date":"Fri Nov 19 14:55:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Americans are already hurting from inflation that’s the highest in a generation.  Adding trillions upon trillions of more spending will only make this worse.  Build Back Better is filled with new taxes on hardworking Americans.","date":"Fri Nov 19 14:55:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats in the House are determined to force through President Biden's Build Back Broke bill.  They call the legislation \"transformative.\"  And they are right.  Here are some of those \"transformative\" items and what BBB really stands for. https://t.co/GQXqNPHVNl","date":"Fri Nov 19 02:47:50 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/zFMOx50b9f","date":"Wed Nov 17 21:06:21 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/GiO2zOBiFP","date":"Mon Nov 15 18:00:57 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the newest town in Alabama and the 4th Congressional District.  Cherokee Ridge in Marshall County had their official ribbon cutting this afternoon. https://t.co/IrP3vVXwrW","date":"Sun Nov 14 21:15:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Even with these tax credits, the average American family cannot afford an electric car.  So, these tax credits end up subsidizing electric cars for wealthy people.  Meanwhile, hardworking middle and low income people are struggling to pay for gas.","date":"Fri Nov 12 17:00:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Inflation is a tax on all Americans, especially those least able to afford it.  But Democrats are forging ahead with even more inflationary spending.  This is why we call it Build Back Broke. https://t.co/ezCS65kljI","date":"Wed Nov 10 16:03:38 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy Birthday to the United States Marine Corps! https://t.co/68IcXcUV52","date":"Wed Nov 10 14:03:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear this news.  My prayers go out to his family and friends.","date":"Wed Nov 10 00:00:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Climate change should not be the magic word that lets government micromanage every aspect of our lives. Lowering the oceans by draining your pockets.  https://t.co/H0yiuaeewF","date":"Tue Nov 09 14:15:20 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The news media is heralding the “infrastructure” bill by listing what most of us consider infrastructure. But do the math here.  That seems to only add up to a small portion of $1.2 trillion. Why don’t they list the other “stuff?” $865 billion seems missing. https://t.co/HcHjax9wOy","date":"Sun Nov 07 14:59:50 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I voted no Friday night to the Biden Infrastructure bill.  Most people agree our infrastructure needs a lot of work, but only around 10 percent of this bill goes to what most of us would call infrastructure.  You know, like roads &amp; bridges &amp; utilities like water &amp; broadband.","date":"Sat Nov 06 13:17:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The other 90 percent goes to liberal wish list items like the Green New Deal.  It is also tied now to the even bigger Build Back Broke bill.  Voting for one, increases the likelihood the other gets passed too.  We need to focus on actual infrastructure.","date":"Sat Nov 06 13:17:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Less than two months now to the launch of the most powerful telescope ever.","date":"Fri Nov 05 20:42:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No score, no vote.\n\nPeriod.","date":"Fri Nov 05 15:25:14 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I fully support AG Marshall in his challenge to this overreach by the Biden Administration.  https://t.co/9M5AfyEgiM","date":"Fri Nov 05 13:41:02 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden’s reckless spending bill puts a target on American families. Rather than incentivizing marriage and family structure for children, this radical legislation penalizes it.\n\nThis is ridiculous. American families and taxpayers deserve better.","date":"Mon Nov 01 19:19:17 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Inflation is rising, the GDP has slowed dramatically, Thanksgiving 2021 will be the most expensive in history, and Christmas gifts will likely arrive late. \n\nDemocrats answer: spend $2.5 billion on “tree equity”.","date":"Mon Nov 01 17:27:20 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Biden’s scaled back Build Back Better is still just as bad. It’s still a taxpayer supported slush fund directed at Democrat special interests.","date":"Thu Oct 28 16:14:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Why does President Biden always talk about good paying “union” jobs? Why don’t we just focus on good paying jobs, regardless if they are union or not?","date":"Thu Oct 28 15:58:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy 80th Anniversary to @TeamRedstone.  It was on this day in 1941 a groundbreaking ceremony was held for the facility.  Redstone and everyone who works there has played a vital role in our nation's defense everyday for the past 80 years. https://t.co/NSIdeSB2zY","date":"Mon Oct 25 13:04:54 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Biden Admin is working hard to weaponize the IRS. Their proposals will infringe on our right to privacy &amp; will mobilize an entire federal agency against American taxpayers.\n\nI proudly join my colleagues in demanding the Biden Amin rescinds this proposal.","date":"Thu Oct 21 16:09:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Here's the bottom line: Inflation is a tax on the American people. https://t.co/iolsHgO60S","date":"Tue Oct 19 16:19:09 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am very sorry to hear that Colin Powell has passed away. Although I didn’t always agree with him politically, his service to our nation is something we can all admire and respect. I send my prayers to his family during this sad time.","date":"Mon Oct 18 13:18:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats want to weaponize the IRS to invasively spy on Americans with transactions over $600.\n\nThis is unprecedented government overreach. President Biden and Speaker Pelosi are waging a war on American’s privacy.\n\nThis cannot stand. I will fight this at every step. https://t.co/O6YDvFuzpd","date":"Fri Oct 15 14:44:54 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I believe in the American Dream, and I believe in America’s workforce. But the Democrat’s socialist agenda is putting it all at risk. \n\nIt’s time we put a stop to the far left’s war on work.","date":"Thu Oct 14 13:03:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The far left’s out of control spending is ruining our economy. Since January, we’ve seen inflation rise and businesses close every single month. \n\nIt’s beyond clear that Bidenomics has failed.","date":"Wed Oct 13 15:30:53 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I joined @newsmax this morning to discuss the Democrats socialist spending spree. Their plan disregards our national debt and puts the burden solely on the shoulders of American taxpayers.","date":"Mon Oct 11 17:04:38 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I took this photo of General Odierno while I was visiting Iraq &amp; he was giving us an update on the sectarian violence.  His leadership gave our military the plan to bring stability to Iraq.  I am saddened to hear of his passing after battling cancer.  He was one of our finest https://t.co/3JOFfDfRsv","date":"Sun Oct 10 12:43:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"183,000 people decided to drop out of the workforce in September, despite the large number of available jobs.  This number will get even worse if Democrats ram through this huge $3.5 trillion socialist spending package.","date":"Fri Oct 08 13:56:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China’s Communist Party is determined to destroy democracy and freedom. They’re actively tearing down #HongKong and are continuing their aggression towards Taiwan. \n\nWe must hold the CCP accountable on the world stage and stand by the freedom-loving people of Taiwan.","date":"Tue Oct 05 13:29:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My heart breaks for the family and friends of this brave officer. They are all in our prayers.  https://t.co/pm2VuT24iG","date":"Sat Oct 02 16:30:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Praying for these officers and their families.  #ThinBlueLine","date":"Fri Oct 01 20:45:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Just when you think the Biden Administration can’t get more radical, we get this nominee who praises the Soviet financial system. The one that collapsed 30 years. Comptroller of the Economy - WSJ https://t.co/mY4kFgDkPW","date":"Thu Sep 30 11:47:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There’s no excuse for blatantly disregarding the facts of this legislation - the financial future of our nation is at stake. This bill will cost American taxpayers for generations to come.","date":"Wed Sep 29 17:22:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Democrats treat federal funding like they're playing with monopoly money. To be clear, we MUST talk about numbers and dollars. American taxpayers deserve nothing less.","date":"Mon Sep 27 18:42:17 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Extreme, radical, unprecedented. Those three words describe the Democrats abortion bill being voted on today in Congress. \n\nBut this Abortion on Demand legislation doesn't change the fact that abortion stops an innocent, human heartbeat. We must #FightForLife &amp; reject this bill. https://t.co/ZZblqdK3n5","date":"Fri Sep 24 14:25:09 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"❌States that legally fight to uphold pro-life laws must pay litigation costs to the pro-abortion plaintiffs if they lose \n❌If the pro-abortion plaintiffs lose, they're protected from paying such costs and fees\n\nWe must #FightForLife &amp; reject this radical legislation. https://t.co/qQZBEFSylX","date":"Thu Sep 23 16:56:34 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"❌Treats abortion as a \"medical procedure\", devaluing the sanctity of life\n❌Medical professionals who conscientiously oppose abortion risk losing their jobs\n❌Faith-based facilities that oppose abortion risk losing public funding","date":"Thu Sep 23 16:56:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats \"Women's Health Protection Act\" has one purpose only: radical access to abortion. The bill\n\n❌Allows abortion on demand\n❌Removes protections for the unborn at the state &amp; federal level\n❌Permits late-term abortion\n❌Blocks pain-capable laws at 20-weeks of pregnancy https://t.co/uvJqWTY2Oa","date":"Thu Sep 23 16:56:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is what happens when Democrats defund the police and impose long, crippling lockdowns. \nhttps://t.co/LCXv97x7Et","date":"Thu Sep 23 15:27:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Iron Dome is an essential defense system that has saved many lives from rockets launched by terrorists. Pulling funding from this is simply dangerous, and it leaves our ally behind. \n\nI will always stand with Israel 🇺🇸🇮🇱","date":"Tue Sep 21 20:19:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Millions of people are impacted by Alzheimer's, both those living with it &amp; their families. On #WorldAlzheimersDay, lets raise awareness for Alzheimer's &amp; everyone that is affected by it. It's my hope that one day we will find a cure for this painful disease. @alzassociation https://t.co/f7mwDYGhjK","date":"Tue Sep 21 14:28:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While border patrol agents tried to hold 12,000 migrants from walking into Texas, our “Border Czar” went to a football game &amp; the President went for a bike ride.\n\nThis Administration needs to step up and deal with the crisis at our southern border. It’s their Constitutional duty.","date":"Mon Sep 20 17:59:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As of today, President Biden has been in the White House 8 months and I don’t think anyone could say America is headed in the right direction.  In fact, the polls show the exact opposite. There seems to be no one at the wheel as America veers off the road.","date":"Mon Sep 20 14:19:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On this day in 1787, our Founding Fathers signed the most important governing document in history. By creating the Constitution, they gave us the framework to become the most free and prosperous nation on Earth. Today, and everyday, we celebrate and defend our #Constitution https://t.co/qwaTr9yPtV","date":"Fri Sep 17 15:50:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am proud to co-sponsor this resolution honoring all the American heroes who served in Afghanistan throughout the Global War on Terror. These brave men and women sacrificed everything in order to keep our nation safe. We are forever indebted to them for their service.","date":"Thu Sep 16 14:29:35 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"NASA Selects Five U.S. Companies to Mature Artemis Lander Concepts https://t.co/lJVeKCM7t1","date":"Tue Sep 14 21:50:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Biden Administration should have read the editorial section of the Washington Post back in July.  Even the liberal WAPO editorial board ran this perspective piece from two social scientists. Yes, his mandates will backfire. https://t.co/nBt9hGFHoj","date":"Mon Sep 13 15:26:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is unconstitutional. The U.S. Constitution does not give the President this type of authority.  No where in Article 2 of the Constitution will you find anything that even remotely gives the President this kind of power.  https://t.co/3kCYjkRVHy","date":"Thu Sep 09 20:00:46 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As Ranking Member for the subcommittee on Commerce, Justice, and Science, I am proud to fight for life and champion issues important to North Alabama.","date":"Thu Sep 09 15:14:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China’s communist power grab in Hong Kong is reaching new heights. \n\nAs a nation founded on the ideas of liberty and freedom, the U.S. must firmly stand against the CCP’s authoritarian overreach and support #HongKong as they fight for freedom.\n\nhttps://t.co/QovjZj9G8g","date":"Tue Sep 07 14:46:27 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden says 90% of Americans who wanted to leave Afghanistan have been able to leave. Leaving 10% behind is not a success. The Taliban cannot be trusted to protect them and give them safe passage. They killed an Afghan man for singing. They won’t protect Americans.","date":"Tue Aug 31 20:00:29 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Obama’s Defense Secretary once said that Joe Biden has been wrong about every foreign policy situation in the past 40 years. He was right, and this is what it looks like. https://t.co/frP3VLyhsZ","date":"Mon Aug 23 15:23:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No plan, no commitment, no answers. President Biden and his team are failing to lead at every turn. Let’s not forget that this Administration is still fumbling the border crisis and economic crisis - and now they’ve left Afghanistan in shambles with no hope of rescue.","date":"Tue Aug 17 19:21:52 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"That should be \"is\" not \"his\"","date":"Mon Aug 16 20:58:08 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden says the \"buck stops with him\" on the situation in Afghanistan, but in the same remarks blamed President Trump for what his happening.  You've been the Commander in Chief since January 20th.  No one is to blame for this colossal lack of planning other than you sir","date":"Mon Aug 16 20:44:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Biden Administration is a rudderless ship at sea. Whether it’s the border, the economy, and now the loss of Afghanistan, there seems to be no plan to deal with anything. 20 years of deep sacrifice on the part of our military, &amp; it’s all lost in days.  https://t.co/e4ZmbN5L4A","date":"Sun Aug 15 12:14:41 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Biden Administration’s border policies have been a disaster from the very beginning. Even before he took office, he said things that I believe communicated a message of “once I’m in office, come on up, the welcome mat will be out.”","date":"Thu Aug 12 19:54:22 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Agriculture and rural development play a vital role not only in the 4th District, but the entire State of Alabama. These issues have always been top priorities of mine in Congress, and I am proud to fight for them everyday.","date":"Thu Aug 12 16:45:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Joe Rogan is right. Government mandates take away power and freedom from all of us. \n\nThe government is supposed to be “of the people, by the people, for the people”, not the other way around. \nhttps://t.co/dEFUwOxDjT","date":"Mon Aug 09 16:37:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Defending our nation should always be priority number one. We cannot let our military capabilities fall behind the likes of China and Russia, and that’s why bolstering the budget for national defense is so crucial. Now is the time for strength, not weakness.","date":"Thu Aug 05 16:52:16 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Whether it’s Bowser, Newsom, or Whitmer, apparently mask mandates and “following the science” only apply to people who don’t make the rules. Just goes to show how big government solutions are never the answer.","date":"Wed Aug 04 16:15:02 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Georgia's law is very similar to Alabama's election law. And in 2020, we had the highest turnout in our state's history.","date":"Tue Aug 03 17:45:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I joined my colleagues in asking this lawsuit by the DOJ be dismissed.  The U.S. Constitution gives states broad powers to regulate elections in their own states. The changes to Georgia's election law will not prevent a single person from casting a ballot. https://t.co/MIeP6tJBxV","date":"Tue Aug 03 17:45:36 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Police need our support now more than ever. Crime is on the rise throughout the country and defunding law enforcement will only put our communities at further risk.\n\nWe cannot let political scores jeopardize the safety of this nation and the officers that protect it.","date":"Fri Jul 30 17:08:50 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Olympic gold🥇for Auburn-bound Suni Lee! Congrats on a great performance, you have made our state and our country proud. \nhttps://t.co/LF8oYUdNkS","date":"Thu Jul 29 13:26:10 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For 40+ years the Hyde Amendment had widespread bipartisan support. Democrat and Republican President’s signed it into law without hesitation. \n\nBut now, the very amendment that has saved millions of lives is being torn to pieces. We must save Hyde because #HydeSavesLives","date":"Tue Jul 27 20:44:01 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is no excuse here, the President cannot pressure private companies to censor free speech it doesn’t agree with. \n\nThat is an affront to everything the First Amendment stands for, and there is no place for that in this country. \nhttps://t.co/QSljbLO1r1 #FoxBusiness","date":"Thu Jul 22 23:20:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I stand in solidarity with the Cuban people who are courageously fighting for freedom. Their struggle against tyranny deserves unrelenting support from the United States. \n\n#SOSCuba #CubaLibre 🇺🇸🇨🇺 https://t.co/QvfYy129lg","date":"Thu Jul 22 20:03:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Cubans are fighting for freedom every day against a brutal and oppressive communist regime. The United States, and the rest of the world, must support these brave men, women, and children without hesitation. \n\nI proudly stand with the Cuban people. #CubaLibre","date":"Wed Jul 21 16:53:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Jeff Bezos and his crewmates on a historic flight to space, and safe return. BE-4 engines built in Huntsville will power many future flights. @blueorigin","date":"Tue Jul 20 21:34:26 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is the 52nd anniversary of Apollo 11, our first Moon landing. The last week of July, 1971 the U.S. launched its 5th Saturn V rocket, Apollo Moon mission in only 24 months.","date":"Tue Jul 20 21:34:26 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Second Amendment is a pillar of this nation, and it gives every American the opportunity to protect themselves and their loved ones. \n\nWe cannot let this right be infringed, and that’s why I am proud to sign into this amicus brief in defense of the #2A.","date":"Tue Jul 20 19:21:02 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Failed liberal policies have led to rising inflation and soaring prices.\n\n📈45.2% price increase in used cars\n📈45.1% price increase in gas\n📈5.6% price increase in milk\n\nThe consequences: \n📈88% of Americans fear inflation is here to stay\n📈61% say it will hurt them overall https://t.co/tOK6yLnTwf","date":"Mon Jul 19 18:03:53 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am proud to be on the front lines of the fight to #SaveHyde. This amendment, and all similar Pro-Life policies, are under attack from the far left. I will always stand up for life and fight to protect the most vulnerable among us. #HydeSavesLives https://t.co/W0mDEIA3Os","date":"Fri Jul 16 16:50:44 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"An estimated 2.5 million lives have been saved because of the Hyde Amendment, which had bipartisan support for over 40 years.","date":"Thu Jul 15 17:53:44 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Earlier today I said that we must do everything we can to save the Hyde Amendment, and a few minutes ago I did just that. I joined my Republican colleagues in fighting to #SaveHyde and prevent taxpayer dollars from funding abortion. https://t.co/tOq9Xku6o3","date":"Thu Jul 15 17:53:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"After four decades of bipartisan support, the Hyde Amendment is now being torn to shreds by the far left. \n\nMake no mistake about it, this partisan power play puts vulnerable babies at risk just to score political points for liberals. \n\nNow more than ever, we must #SaveHyde https://t.co/kq9lEnDysF","date":"Thu Jul 15 14:49:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is what happens when you throw endless money from the rooftop and hope it helps. \n\nMaybe now the Administration will realize their big government approach isn’t working.","date":"Tue Jul 13 15:18:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Olympics should be about patriotism and the love of one’s country. And it should be a time when partisan politics is put aside. If you do not love America, I cannot begin to imagine why you would want to represent America on the world stage.","date":"Mon Jul 12 18:38:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I love seeing the American flag being waved all over the world where people are yearning for freedom, whether it’s in Hong Kong, Venezuela, or just yesterday in the streets of Cuba. “Because the flag still stands for freedom.” https://t.co/39isi36IEk","date":"Mon Jul 12 14:22:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"America must stand with the Cuban people who have had enough of living under the yoke of a communist/socialist totalitarian regime.  “Free” things can never justify the taking of freedom. But under that type government it always seems to do just that.  https://t.co/qECW5EVbNb","date":"Mon Jul 12 11:34:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Washington Post gave 3 Pinocchios to Democrats for claiming it's Republicans who want to defund the police and not them.  Democrats have seen how the \"Defund\" movement is polling &amp; what it's doing to crime. They need to make a beeping noise when they back up that quickly.","date":"Wed Jul 07 17:20:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Ensuring the U.S. does not use taxpayer dollars to fund international abortion is just common sense. Especially when that money would be funneled to the brutal communist regime in China. I am unapologetically Pro-Life, and I will always fight for life &amp; fight against the CCP. https://t.co/pHapuRGwXL","date":"Thu Jul 01 16:33:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For 100 years the CCP has brutally violated human rights, persecuted Christians, starved its own people, and propagated lies. They attack neighbors like Taiwan &amp; suppress freedom in Hong Kong.\n\nA century of CCP rule is nothing to celebrate. It's a dark milestone in history.","date":"Thu Jul 01 13:28:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I will always remember the images of Secretary Rumsfeld helping to carry stretchers outside of the Pentagon on the morning of September 11th after a plane had slammed into the building at the hands of terrorists.","date":"Wed Jun 30 20:03:14 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sorry to hear of the passing of Donald Rumsfeld.  During two stents as Secretary of Defense, and his three terms in the House of Representatives, he lived a life dedicated to public service.","date":"Wed Jun 30 19:57:01 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Nothing says Happy 4th of July like failed liberal policies digging deeper into your wallet.","date":"Wed Jun 30 17:10:33 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Team 1 of Russellville City Schools! These students took home 5th place in the 2021 American Rocketry Challenge. They have made the 4th District proud. \nhttps://t.co/rihrEivxiy https://t.co/zQIGp7qFsA","date":"Tue Jun 29 17:23:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sorry to hear of Sonny’s death. We served together in Congress and he was a true servant of Alabama’s 1st District. Former Alabama congressman Sonny Callahan dies at 88  (from @AP) https://t.co/cWpgbKS0zK","date":"Fri Jun 25 21:25:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The VP’s visit conveniently misses the epicenter of the crisis by 800 miles. Which is like the fire department responding to a fire in the wrong town and at the wrong house.","date":"Fri Jun 25 15:16:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The crisis at the southern border is very real. Over 170,000 illegal immigrants have crossed the border every month for the past 3 months. These are record numbers.\n\nOur Border Czar is finally visiting 93 days later. Maybe now this Administration will take the crisis seriously.","date":"Fri Jun 25 15:08:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"But now, the equal rights of female athletes are being torn away by culture war madness that deems it okay for biological males to compete against biological females. This directly undermines what Title IX stands for, and young women are paying the price.","date":"Wed Jun 23 14:33:34 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today marks the 49th anniversary of Title IX. For nearly half a century this law has leveled the playing field for women's sports. https://t.co/mKR1NqNBBm","date":"Wed Jun 23 14:33:33 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For nearly five decades the Hyde Amendment has garnered strong bipartisan support. Joe Biden was in favor of Hyde for his entire career in the Senate.\n\nBut now, Hyde is under attack. I stand with @AGSteveMarshall and all who are in the fight to #SaveHyde.","date":"Tue Jun 22 16:36:59 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This decision is a monumental win for religious liberty.  The court's 9-0 decision, with even the liberal justices joining in, shows how important religious liberty is to the very foundation of our country.","date":"Thu Jun 17 14:51:14 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The SCOTUS decision in Fulton v. City of Philadelphia is a win for religious freedom and for life. Finding a home for foster children will always be important work, and it’s crucial we protect faith based groups that undertake this loving service.","date":"Thu Jun 17 14:51:14 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was proud to sign on to this letter. The VA needs to be focused on improving and saving lives, not ending life.","date":"Wed Jun 16 13:43:30 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am cosponsoring the Defund Wuhan Institute of Virology Act so that American taxpayer dollars never fund the Wuhan lab again.","date":"Tue Jun 15 17:33:25 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Just last year, Xi Jinping said “Science has no borders, but scientists have a motherland”. This mindset of the CCP and their refusal to allow a full investigation into the Wuhan lab is beyond unacceptable. \nhttps://t.co/MwdWkucaAh","date":"Tue Jun 15 17:33:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Stars and Stripes represent freedom, hope, and the greatest Nation in the world. I am proud to stand for our flag and our country. \n\nHappy #FlagDay everyone! 🇺🇸 https://t.co/yvMRhZ1Y7g","date":"Mon Jun 14 14:00:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sending my condolences to everyone at ⁦@abc3340⁩. But especially to Chris’ family. He leaves behind his wife and three young sons. I hope you will join me in lifting them up in prayer.  https://t.co/LIN8apqWH3","date":"Sat Jun 12 23:11:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden’s economic plan of throwing money out of a helicopter has quickly led to this: high unemployment numbers and rising inflation.","date":"Thu Jun 10 15:37:03 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy birthday greetings from Alabama to my friend and colleague @repdonyoung of the great state of Alaska. https://t.co/zm1DVvPpT7","date":"Wed Jun 09 13:37:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congrats to Hackleburg, Winfield, Russellville and Tharptown High Schools for qualifying for the National Finals of the 2021 @RocketContest &amp; earning a chance to compete for the title of National Champion! Good luck #TARC2021 https://t.co/9zfHZjNZTm","date":"Thu Jun 03 20:56:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Hundreds of children in China are waiting for their forever home, but the Chinese government has halted the adoption process with families in the U.S.\n\nI join my colleagues in calling on @SecBlinken to engage with Beijing to ensure adoptive families are united once and for all.","date":"Wed Jun 02 20:42:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Biden is bent on returning us to energy dependence. https://t.co/erJnSsoWki","date":"Tue Jun 01 20:23:20 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Hyde Amendment has been non-controversial and bipartisan for nearly five decades. It has resulted in saving millions of innocent lives. But now Hyde is under attack, and President Biden has removed it from his budget proposal.\n\nNow more than ever, we must #SaveHyde https://t.co/C0XkLGeDIr","date":"Sat May 29 16:14:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This $6 trillion 2022 budget is just reckless.  This is a liberal wish list on steroids. Even President Biden admits in the budget it will cause our national debt to skyrocket to $39 trillion. #bidenbudget https://t.co/lu6gzwG3Se","date":"Fri May 28 18:16:09 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China's lies and deception about the Coronavirus led to a global pandemic. We cannot continue to listen to their propaganda. Congress must get answers for the American people on how COVID-19 originated. \n\nIt's time to investigate the Wuhan lab.","date":"Fri May 28 13:44:49 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"✅1994 Joe Biden: \"those of us who are opposed to abortion should not be compelled to pay for them.\"\n\n✅2006 Joe Biden: \"I do not vote for funding for abortion… I won’t support public funding.”\n\n❌2021 Joe Biden: poised to release budget allowing taxpayer funded abortion.","date":"Thu May 27 17:39:16 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden promised to unify the country, and he had an opportunity to do that by merely staying consistent. Instead, he listened to the far left – and sadly, innocent babies could pay the price for it.","date":"Thu May 27 17:39:16 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While scientists around the world are starting to focus more and more on the Wuhan lab origin theory of COVID, why isn't the Biden administration doing the same? https://t.co/DkZvVtTY6y","date":"Wed May 26 15:57:41 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"D.C. statehood is an old liberal idea to boost Democrats power. It’s not about representation for D.C. residents, it’s about adding two Democrats to the Senate. \n\nIf Sen. Schumer really wants representation for D.C., why doesn’t he support giving the land to Maryland?","date":"Tue May 25 15:46:46 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/j7AKGmUOdl","date":"Fri May 21 17:33:09 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden will not stand in the way of a Russian pipeline across Europe but he will stand in the way of the XL Pipeline here in America. This hypocrisy needs to stop and the XL Pipeline needs to start back! https://t.co/nQCTJeKUc2","date":"Thu May 20 12:21:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Instead of working across the aisle, or across the Capitol with the Senate, House Dems are throwing more money out of a helicopter. Their $1.9 billion \"security\" plan will militarize the Capitol &amp; make it harder for Americans to access the People's House. This is unacceptable. https://t.co/BnxlEIzrwj","date":"Wed May 19 19:57:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The attacks and violence orchestrated by Hamas against Israel cannot stand. With over 3,100 rockets launched at Israel, we are well past time in making it clear: The United States must support our longtime ally. \n\nI will always stand with Israel. 🇺🇸🇮🇱","date":"Mon May 17 20:33:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was glad to play a role in the efforts by ⁦@SteveScalise⁩ and ⁦@RepBradWenstrup⁩ to get this designation changed. The victims of this terrorist attack deserved to have this classified as what it truly was.  https://t.co/vtgwx3wg5p","date":"Sun May 16 14:45:28 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The ‘70s Called, And It Wants Its Economy Back https://t.co/eFJXDQnvHJ","date":"Fri May 14 16:35:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Throughout this past year we've seen our hospital systems put to the ultimate test. Those on the front lines have worked tirelessly to care for individuals and communities affected by the Coronavirus. \n\nThank you to all the selfless heroes who have kept us safe and healthy! https://t.co/qCEEVSK4I1","date":"Thu May 13 16:18:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We all aspire to leave the world better than we found it, the Davidson’s achieved that and much more.","date":"Thu May 13 03:04:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m saddened to hear of Dorothy Davidson’s passing. She was a trailblazer in every sense of the word. She and her late husband Julian have left such a lasting legacy on the Huntsville community. https://t.co/TdTQ2GHlxr","date":"Thu May 13 03:04:25 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This week is #NationalPoliceWeek, and I want to take a moment and thank all of the brave men and women who serve as Police Officers in Alabama and across our country. They risk their lives to protect us every single day, and that is truly heroic. Thank you all for your service. https://t.co/S5dbnfqNbx","date":"Wed May 12 17:47:55 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud @GovernorKayIvey for this decision.  With so many jobs available across our state, there is no need for endless unemployment benefits. As the recent jobs report shows, this is hurting our economy, not helping it.","date":"Mon May 10 19:28:11 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Finding a forever home for foster children will always be important work, and during National Foster Care Awareness Month it’s crucial we stand by those who undertake this loving service. Especially faith based groups that go to great lengths to find homes for vulnerable kids.","date":"Mon May 10 18:01:07 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Everywhere you look there are signs saying “hiring” and even some that say “signing bonus.”  Yet, unemployment is creeping up. It’s time to end the incentives to not work.","date":"Fri May 07 14:34:26 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Hoping to get started back. But it’s still raining and the wind is bad. @spann https://t.co/s8hTkU89xI","date":"Fri May 07 01:03:07 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Covering up the diplomas. https://t.co/za9kV3dGUK","date":"Fri May 07 00:45:50 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Snead State graduation(where I just spoke) is taking a 30 minute pause as a storm rolls in.  @waff48 @whnt @WAAYTV @rocketcitynow https://t.co/KmFtTywyHN","date":"Fri May 07 00:41:59 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On this #NationalDayofPrayer, let’s remember that all things are possible when we put our trust in God and His plan. Please join me today in praying for our neighbors, our country, and the great State of Alabama. https://t.co/mppFWlFhxX","date":"Thu May 06 16:17:44 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Cherokee Ridge in Marshall County is now the newest municipality in the 4th Congressional District. Congratulations on your township! https://t.co/bzEx4WRvCb","date":"Wed May 05 01:26:04 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I demanded answers today from the FBI as to why the Congressional baseball practice shooting that injured several people including a Capitol Police officer and my friend ⁦@SteveScalise⁩ was classified as suicide by cop instead of domestic terrorism.  https://t.co/lmdUB6B8Uu","date":"Thu Apr 29 19:08:16 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"100 days ago, President Biden pledged to be a “President for all Americans”. Apparently that didn’t apply to innocent and vulnerable babies. \nhttps://t.co/wgWgNsVWSS","date":"Thu Apr 29 16:50:20 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"GDP numbers show that the stimulus passed by Congress and signed by President Trump last year have got the economy back on solid ground. This will continue as the economy opens back up. There is no need for more gargantuan spending bills.","date":"Thu Apr 29 13:59:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The speech @SenatorTimScott is giving, is the speech we needed to hear tonight.","date":"Thu Apr 29 02:38:36 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Biden did not give a single mention of @NASA or returning Americans to the moon, including the first woman.  If America is going to continue to lead in the world, that also means leading in space.","date":"Thu Apr 29 02:21:31 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"“No Amendment to the Constitution is absolute.” - President Biden\n\nEvery freedom enshrined in our Constitution is guaranteed to every American. This statement from the President is unbelievable.","date":"Thu Apr 29 02:11:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden just told Congress and the American people that there is no crisis at our Southern border. The facts beg to differ. It’s high time the President admits the truth and starts working to solve this crisis. https://t.co/CZT43HZ2wn","date":"Thu Apr 29 02:08:17 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats: The 2020 election was the most secure election in our history.  Also Democrats:  We need to pass H.R. 1 to secure our elections.   #JointSession","date":"Thu Apr 29 02:08:07 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Joe Biden has worked for four decades to dismantle the Second Amendment. His words tonight about gun control are the same as they’ve always been: liberal, extreme, and political.","date":"Thu Apr 29 02:03:46 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats just got the green light to defund the police. Unsurprisingly, rioting and burning down cities hasn’t been mentioned.","date":"Thu Apr 29 02:02:15 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"\"No responsible American president can remain silent when basic human rights are violated.\" \n\nWhat about the genocide being committed by the Chinese Communist government against its own people?","date":"Thu Apr 29 02:00:00 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"FDR's New Deal, adjusted for inflation, cost a total of around $860 billion.  President Biden's proposals make Roosevelt look like a deficit hawk. #JointAddress","date":"Thu Apr 29 01:50:58 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A federally mandated $15 minimum wage would ravage the economy in rural areas of Alabama and kill small businesses.","date":"Thu Apr 29 01:30:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"How many jobs have been lost thanks to President Biden's executive orders?","date":"Thu Apr 29 01:19:05 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I assume President Biden is talking about the Food Box Program that connected farmers to those who needed food, implemented by the Trump Administration.","date":"Thu Apr 29 01:16:52 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Biden's promise of 100 shots in 100 days was already being delivered when he took office, thanks to the efforts of the Trump administration and Operation Warp Speed.","date":"Thu Apr 29 01:11:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Getting ready to do some live tweeting of POTUS's address to Congress","date":"Thu Apr 29 00:57:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China’s communist regime has worked relentlessly to isolate Taiwan from the global community. The @WHO cannot bend the knee to Beijing and let their influence dictate global affairs. \n\nWe must #LetTaiwanHelp and ensure Taiwan’s full participation at the World Health Assembly.","date":"Tue Apr 27 16:17:26 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Back in 2019 my office began hosting events like the one pictured here in Cullman to stress the importance of Alabama doing well in the 2020 Census. These events, and the efforts of @GovernorKayIvey and her team paid off. Alabama’s voice in Washington has not been diminished. https://t.co/mP0PAcLRry","date":"Mon Apr 26 20:36:40 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"D.C. statehood isn't about equal representation, it's about unequal power in Congress.\n\nDemocrats want D.C. statehood just to add two Dem Senators &amp; consolidate power in the House. It's a power grab that would make our Founders roll over in their graves.\nhttps://t.co/ZVoQU4VIXz","date":"Thu Apr 22 13:52:22 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The CCP is blatantly violating human rights in Xinjiang. There is no question about it. For China to claim this fact as just “lies and false information” is outrageous – this is nothing more than government-sanctioned hypocrisy coming out of Beijing.","date":"Tue Apr 20 15:38:54 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Proven launch capabilities are a hallmark of @ulalaunch.  Congratulations!","date":"Mon Apr 19 17:54:58 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"‘Raises a lot of questions’: NASA selects SpaceX to land humans on the moon after four consecutive explosions during testing https://t.co/8ZxEjXmi7M","date":"Fri Apr 16 22:26:57 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In 1983, Senator Joe Biden warned that court packing would, “put in question, if for an entire decade, the independence of the most significant body...in this country, the Supreme Court of the United States of America.”\n\nI agree with the 1983 version of Joe Biden. https://t.co/fGaMDRFIgs","date":"Thu Apr 15 16:59:45 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Every human life is precious, and it's our responsibility to always protect the most vulnerable among us. \n\nBabies deserve the right to life, and babies that survive abortions should never, ever be left to die. It’s time to #EndInfanticide and pass the Born-Alive Act. https://t.co/8KRgiQg2CE","date":"Wed Apr 14 22:04:00 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner I am very proud to add my name to this discharge. I will always fight for life!","date":"Wed Apr 14 21:45:26 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For 45 years the Hyde Amendment has protected federal tax dollars from funding abortion. Every Congress &amp; Administration supported Hyde no matter what party was in charge, until now. I'm calling on @POTUS to support Hyde, just like he did for four decades.\nhttps://t.co/OMSB3hkkue","date":"Tue Apr 13 15:40:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Whether it’s this, H.R. 1 or DC statehood to increase Democrat senators, Democrats are determined to have one party rule over America.  https://t.co/eZAPLFh0yY","date":"Fri Apr 09 15:59:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Extreme gun control legislation isn’t the answer to stopping gun violence. Look at the cities in America with the most severe gun laws and you’ll see that those same cities have the highest violent crime rates in the country.","date":"Thu Apr 08 16:35:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Biden’s executive actions today do two things: appease the far left and infringe upon our Second Amendment right to bear arms.","date":"Thu Apr 08 16:35:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As a co-chair of the Friends of Scotland Congressional Caucus, I’m proud to be celebrating #TartanDay and the longstanding US-Scotland relationship alongside the thousands of other Americans with Scottish ancestry and connections.","date":"Tue Apr 06 13:12:35 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The people running @mlb have decided to abandon baseball and instead enter the cancel culture game.  Which has become the left’s new national pastime.","date":"Sat Apr 03 14:51:21 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My thoughts and prayers go out to Officer Evans’ family and the entire Capitol Hill Police force. May Officer Evans rest in eternal peace.","date":"Fri Apr 02 23:22:58 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am deeply saddened to hear about the passing of Capitol Hill Police Officer William “Billy” Evans. His bravery and heroism were on full display today. His actions undoubtedly saved lives, and his sacrifice must always be remembered and honored.","date":"Fri Apr 02 23:22:58 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am closely monitoring the situation at the U.S. Capitol. My prayers go out to the Capitol Police and the officers who have been injured.","date":"Fri Apr 02 17:43:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for airports in Alabama. In the 4th District, there will be 5 local airports that will receive funding. This allocation will go a long way in making improvements to infrastructure and safety. I am glad to see the FAA investing in Alabama.","date":"Thu Apr 01 22:58:44 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"To all those who served in the Vietnam War, thank you for your bravery and sacrifice! #VietnamVeteransDay https://t.co/eqBhWirxTv","date":"Mon Mar 29 19:01:33 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Check out 'Photos of migrant detention highlight Biden’s border secrecy' on Alabama Daily News website https://t.co/pwT8TmIvUE","date":"Tue Mar 23 13:52:28 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today’s successful test of @NASA_SLS  at Stennis Space Center is the exciting punctuation mark of the most rigorous testing of a launch vehicle since the Apollo program. https://t.co/1euKeUoqx7","date":"Thu Mar 18 20:56:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"That is important because this is the only super- heavy-lift launch vehicle designed from the beginning to meet @NASA  stringent human-rated safety specifications.  Congratulations to everyone at NASA, especially at @NASA_Marshall","date":"Thu Mar 18 20:56:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wishing everyone a Happy St. Patrick’s Day! ☘️","date":"Wed Mar 17 14:24:01 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s been 50 days since President Biden called for unity in his inaugural address. Sadly, his actions have not lived up to his words.\n\nIt’s time for President Biden to end his 50 day drive to divide &amp; become, as he pledged, “A President for all Americans”.\nhttps://t.co/oHTtS2dz3S","date":"Thu Mar 11 18:59:39 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The left says this is common sense reform, but we know it’s far from reasonable. Universal background checks won’t deter criminals from obtaining firearms, &amp; it would likely lead to a national gun registry. This “bipartisan” legislation is simply this: extreme gun control.","date":"Thu Mar 11 14:34:48 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"House Dems are championing extreme gun control legislation that will infringe upon our 2nd Amendment rights. The “Bipartisan Background Checks Act” is yet another liberal attempt to suppress the rights of law abiding citizens. https://t.co/0SE15YX2WL","date":"Thu Mar 11 14:34:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The $1.9 trillion liberal wish list was never about COVID. Even President Biden’s Chief of Staff called it “The most progressive domestic legislation in a generation”.\n \nTo be clear, this partisan money grab has 9% to do with relief and 91% to do with progressive pet projects.","date":"Wed Mar 10 17:38:21 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Republican Study Committee urges party to zero in on border crisis, link to Biden’s ‘radical’ policies #BidenBorderCrisis https://t.co/YLoZREuW8M #FoxNews","date":"Mon Mar 08 15:34:27 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"From the article: “Every writer and producer on his team knew the perfectionist’s expectations and knew not to stray into personal bias or activism.” Now personal bias and activism seems to be encouraged by the national media.  https://t.co/ZpaxQnBOa4","date":"Sat Mar 06 14:59:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations @NASA_Marshall &amp; their launch experts &amp; @northropgrumman for this award of the Mars ascent vehicle.  This work is an important stepping stone in our robotic, and eventually human, exploration of Mars.","date":"Thu Mar 04 22:17:47 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Air Force documents show how Alabama beat Colorado for Space Command HQ https://t.co/XzxsAjv008","date":"Tue Mar 02 16:07:42 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"House Democrats tried to push H.R. 1 through last year. It was a bad bill then and it’s a bad bill now. \n\nThis legislation will do nothing to restore faith in our elections. Rather, it’s sole aim is to keep liberals in power. This bill is a far cry from being “For The People”. https://t.co/UEMYIW4olo","date":"Mon Mar 01 22:08:45 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"❌$1.5 billion for Amtrak\n❌$270 million for the National Endowment of the Arts &amp; Humanities\n❌$112 million for a subway to Silicon Valley\n\nSadly, these are just a few of the many wish list items in this spending bill. But to be clear, this has nothing to do with COVID “relief”.","date":"Fri Feb 26 16:30:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The $1.9 trillion COVID “relief” package has little to do with COVID. Over half the money will go to unrelated liberal policies.\n\n❌$220 billion to bailout blue states\n❌$185 billion to bailout mismanaged pensions\n❌$30 billion for public transit","date":"Fri Feb 26 16:30:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Chinese Communist Party will stop at nothing to dismantle democracy in Hong Kong. They are now quite literally writing the book on it.\n\nAs a country built on the ideals of democracy and freedom, we must #StandWithHongKong\nhttps://t.co/QHt1FRuas5","date":"Thu Feb 25 14:57:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Additionally, freedom of speech and religion will be infringed upon by legal designations and government mandated actions, which will dismantle key parts of the First Amendment.  \n\nIn short, the “Equality Act” will create an unequal America.","date":"Wed Feb 24 18:04:49 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Gender equality has come a long way in America, but H.R. 5 will unravel the progress we have made. By opening female-only arenas of life to biological males, the accomplishments and safety of women are in jeopardy.","date":"Wed Feb 24 18:04:48 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Things like female sports and prisons will now be subject to including biological males, and the risks to physical safety and individual achievements is obvious.","date":"Wed Feb 24 18:04:48 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Becerra is a bad choice for HHS Secretary.  He has no  health experience. He also supports the practice of partial birth abortions. His primary qualification in President Biden's eyes seems to be that he was a Trump nemesis  https://t.co/i5VcirgZ87 via @politico","date":"Tue Feb 23 16:12:36 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"That is why I am a proud cosponsor of the H.Res. 59, which expresses the sense of Congress that the United States should not be a party to this agreement until China and others are held to these strict standards.","date":"Fri Feb 19 18:11:28 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rejoining the Paris Climate Agreement will not only hurt Alabamians in the pocketbook but fails to hold some of the largest polluters accountable, specifically #China.","date":"Fri Feb 19 18:11:28 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @NASA  and the contractors on another successful Mars landing – this time, the Perseverance. Alabama built the rocket that got it there (ULA Atlas V), and Tuscaloosa County High School student Vaneeza Rupani named the Ingenuity helicopter!","date":"Thu Feb 18 21:01:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m very sad to hear of the news of Rush Limbaugh’s passing.  For more than three decades Rush has been a voice for conservatism.  When he began his nationally syndicated program, he singlehandedly changed the political landscape of America.","date":"Wed Feb 17 17:56:27 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rush’s message in the early 1990s helped lead to the Republican revolution of 1994 and I believe played a role in my own election.   Rush will be missed.  My prayers go out to his family and millions of listeners.","date":"Wed Feb 17 17:56:27 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Trump has been acquitted, an outcome that was known all along. I’m hopeful that now that this political distraction is over, we can get back to work to solve our nations many challenges.","date":"Sat Feb 13 21:31:41 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was proud to sign on to this letter.  https://t.co/fCiRejgHhn","date":"Fri Feb 12 23:32:18 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama was the only state out of 50 to get an A on their 2020 election integrity scorecard.  Thank you to @JohnHMerrill for building up Alabama's great, secure election system.","date":"Wed Feb 10 16:14:11 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The retirement of @SenShelby will be a huge loss to Alabama and to our nation. His work and influence has been felt in every corner of our state.  Alabama’s economic strength owes a lot to his leadership.","date":"Mon Feb 08 17:28:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I look forward to continuing to work with him the next two years on our respective Appropriations Committees to continue to serve and deliver for the people of Alabama.","date":"Mon Feb 08 17:28:19 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The spoils of victory!\n\nThank you @RepBalderson for putting together this friendly wager between our two states’ great football programs. \n\nThese treats from the Buckeye state will taste great while we dream of next season which is just 211 days away! https://t.co/Qjf3D34Ups","date":"Fri Feb 05 16:53:23 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm glad to hear this.  The Artemis program has had great bipartisan support since its inception.  Returning to the moon and going on to Mars is a national priority that should always transcend politics.   https://t.co/cApNfGW2Qx via @upi","date":"Thu Feb 04 20:21:10 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Help Huntsville win best airport again. Go cast a vote for them.","date":"Mon Feb 01 14:34:23 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is the last day of Human Trafficking Awareness Month. As a country, we must focus on eradicating this awful crime. It’s time to #EndHumanTrafficking https://t.co/kCEoBr22A5","date":"Sun Jan 31 19:23:21 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As a father I know how scary it is when one of your children is sick or hurt. We will be praying for Addie!","date":"Fri Jan 29 17:47:52 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Innocent babies deserve the right to life. They are the most vulnerable among us, and I will always fight to protect them. \n\nThat’s why I am an original co-sponsor of the Born Alive Act, and I will always be proud to be #ProLife","date":"Fri Jan 29 16:32:16 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Joe Biden in October: “you can’t [legislate] by executive order unless you’re a dictator. We’re a democracy. We need consensus.” Meanwhile, steam is coming off his executive order pen.  https://t.co/MS9DUxeO3h","date":"Thu Jan 28 20:30:43 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"But now, Democrats, caving to far left pressure, want to end this protection, and force tax payers to fund abortions","date":"Tue Jan 26 20:46:33 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm proud to say that I'm one of those who signed on to this letter.  For four decades, the Hyde Amendment, which prevents tax dollars from funding abortions, has had bipartisan support, including from then Senator Joe Biden. .https://t.co/tsSW2mUOGm #FoxNews","date":"Tue Jan 26 20:46:32 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In the 48 years since Roe v. Wade, over 60 million innocent babies have been aborted. That is a national tragedy. \n\nOur country must protect the most vulnerable among us &amp; that starts with the unborn. I believe that every life matters, &amp; that’s why I’ll always be proudly #ProLife https://t.co/EEuUBwffsH","date":"Fri Jan 22 14:04:56 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The National Guard came by the thousands to protect D.C., hundreds from Alabama &amp; have worked tirelessly throughout their time here. To have them forced out of the Capitol is unacceptable. These are brave American men and women, and they deserve to be treated with respect.","date":"Fri Jan 22 03:53:46 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations! https://t.co/rljNwwsuuL","date":"Thu Jan 21 03:40:29 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I will look for ways to work with his Administration but I will also work to make sure that conservative ideals and principles are not swept aside either.","date":"Wed Jan 20 17:47:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I of course did not support Joe Biden, but he is now the President of the United States. And I echo President Trump in that I will be praying for him and his family in these coming years.","date":"Wed Jan 20 17:47:24 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm glad to see @SecPompeo make this determination.  The Chinese Communist government, as almost all communist governments do, have forced harsh penalties, including death, on people simply trying to practice their religion in peace.","date":"Tue Jan 19 18:43:31 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"And Twitter had better not flag this for unproven facts.  It's 18.  Period!","date":"Tue Jan 12 04:52:08 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the Alabama Crimson Tide and Coach Nick Saban on their National Championship win tonight over Ohio State.  This is the 18th National Championship in school history! https://t.co/kZo8kPp9bW","date":"Tue Jan 12 04:50:49 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I've put down a little wager for tonight's National Championship game with my colleague @RepBalderson of Ohio. https://t.co/IoVkGRrnou","date":"Mon Jan 11 18:33:15 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Here’s a short video I recorded commenting on what occurred today here at the Capitol. https://t.co/xbkSJg6gUk","date":"Wed Jan 06 23:30:51 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"God has brought this nation through many dark days over the past 240 plus years. We have always been able to settle our disputes peaceably. I believe He will continue to guide &amp; protect this nation. However, as a nation we need to see His guidance in peace. He is in full control!","date":"Wed Jan 06 21:04:45 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was on the House Floor this afternoon objecting to the electoral votes with many of my colleagues. We had to evacuate due to a security breach. I ask for your prayers during this time in our nation's history.","date":"Wed Jan 06 21:04:44 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Since my video post earlier today, I have also decided to challenge the electoral votes of Arizona and Nevada.  So, that is six states (Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin) I will be challenging tomorrow. https://t.co/dQYnD4bAXY","date":"Tue Jan 05 21:50:09 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wednesday I plan to challenge the electoral votes of Georgia, Michigan, Pennsylvania and Wisconsin.  The video below goes into more detail as to why I feel these states' votes should be objected to. https://t.co/odi64JqEBK","date":"Tue Jan 05 19:16:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I want to welcome Alabama’s two newest members of the U.S. House of Representatives: Jerry Carl from the 1st District and Barry Moore from the 2nd.  I’m looking forward to working with these two great Alabamians! https://t.co/f6DTIDTIr6","date":"Sun Jan 03 22:19:13 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I also call on my colleagues in the House to support the plan put forward by @tedcruz , @TTuberville and others in the Senate to create a bicameral commission to examine this election.","date":"Sun Jan 03 14:15:12 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is my statement on the Congressional role in certifying the electoral college vote, and specifically, how I plan to vote this week. I support the plan offered by ⁦@RepMoBrooks⁩  https://t.co/F6Yk9Lp5Cn","date":"Sun Jan 03 14:13:37 +0000 2021","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @nasa and the @NASA_SLS  team for this major milestone in the evolution of the worlds most powerful rocket.\nhttps://t.co/SDnzH6vpiA","date":"Wed Dec 23 16:21:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"From the beginning of this pandemic, truckers have been keeping the roads hot getting us the supplies we all need. Now, they are playing a huge role in transporting the Covid vaccines. Thank you truckers! #truckers","date":"Fri Dec 18 22:49:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to the leadership of President @realDonaldTrump and @VP Mike Pence, Operation Warp Speed has created a COVID-19 vaccine faster than the experts predicted. \n\nWhile Democrats will try and downplay it, this is a big win for our country and the world.","date":"Fri Dec 18 15:54:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was an honor to participate again this year as Alabama’s nine electors cast their votes for President and Vice President. The Electoral College is an important part of our democratic republic form of government. https://t.co/Skp7XaFqF5","date":"Mon Dec 14 18:36:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On December 14, 1819 Alabama was officially granted statehood. For 201 years, millions of Alabamians have lived and worked in the greatest state in the union, and I am proud to count myself as one of them. \n\nHappy Birthday, Alabama! https://t.co/XZnJTjdB0A","date":"Mon Dec 14 17:59:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If you’re above the age of 40 or so, and grew up in North Alabama, then you probably remember watching Country Boy Eddie every morning on @WBRCnews. Join me in wishing him a happy 90th birthday today. https://t.co/ZlwjIjFkcp","date":"Sun Dec 13 15:10:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations!","date":"Fri Dec 11 18:41:50 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m proud to support this amicus brief filed with the U.S. Supreme Court to ensure the 2020 Presidential election was conducted fairly and without voter fraud. I signed onto the brief but a technical snafu in the sponsor’s office kept mine and several other members off the list.","date":"Fri Dec 11 01:18:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The sponsor is working to have my name and others officially added tomorrow. I support this lawsuit 100%. Our democracy depends on free, fair and accurate elections. That is the bedrock of our democracy.\nhttps://t.co/njmnyDVeqe","date":"Fri Dec 11 01:18:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the @WFP &amp; @WFPChief David Beasley for being awarded the #NobelPeacePrize today. The work the WFP does to fight hunger around the world is remarkable, and I am happy that the U.S. continues to work alongside this great organization.","date":"Thu Dec 10 14:09:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the first set of Artemis astronauts announced today by @VP &amp; @JimBridenstine and @NASA One of them will be the first woman on the moon and the next man. It’s time to return to the moon and on to Mars and deep space.","date":"Wed Dec 09 20:18:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For 44 years there has been bipartisan support for the Hyde Amendment, which prevents taxpayer money from funding abortions. Today, House Democrats are holding a hearing on dismantling this longstanding protection. It is disgraceful to see a policy that is estimated to...","date":"Tue Dec 08 17:14:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"...have saved over 2 million innocent babies be put on trial. Joe Biden even supported Hyde as recently as last year, but has now changed his mind to satisfy the far left. We must save the Hyde Amendment and I will fight to make sure we do. RT if you will join me to #SaveHyde","date":"Tue Dec 08 17:14:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Chuck Yeager epitomized the American spirit of exploration and pushing new boundaries of science. He will be missed, but his legacy will live on.  https://t.co/t8Z8AKPdbQ","date":"Tue Dec 08 05:22:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The CCP continues to trample freedom in their own country and in #HongKong. Their actions are beyond unacceptable, and holding the communists accountable is the right thing to do. \n\nThe message is clear: the U.S. will not stand for China’s unlawful conduct.","date":"Thu Dec 03 16:33:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Seems like the only small business House Dems are concerned about saving during COVID is marijuana shops. \n\nThat’s why the MORE Act is up for a vote this week, a bill that will effectively legalize marijuana with no public health guardrails and commercialize the drug.","date":"Tue Dec 01 17:39:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I urge all of my colleagues to vote No on this legislation and prevent the widespread production and use of marijuana.","date":"Tue Dec 01 17:39:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rural Broadband is a necessity, and the Coronavirus pandemic has put a spotlight on this issue. When Congress approves stimulus funds, states should be able to use that money to expand their broadband infrastructure.\nhttps://t.co/YkAlqqfHvy","date":"Tue Nov 24 17:56:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, I introduced a bill with Rep. @boblatta to do just that, and I urge my colleagues to support this legislation and pass the EXTEND Act.","date":"Tue Nov 24 17:56:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Proud to participate in today’s @USChamber discussion about the programs and people that will drive the next era of human deep space exploration!","date":"Tue Nov 17 18:39:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"NASA &amp; @BoeingSpace are constructing the world’s most powerful rocket @NASA_SLS to bring personnel and materiel support to cislunar orbit and the surface below.","date":"Tue Nov 17 18:39:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This action promotes national awareness of adoption, celebrates children and families involved in adoption, and encourages the people of the United States to secure safety, permanency, and well-being for all children.","date":"Tue Nov 17 16:14:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Protecting the most vulnerable among us has always been, and always will be, a top priority of mine. That’s why I was proud to sponsor a resolution in Congress reaffirming November as National Adoption Month. https://t.co/fjTM3KwRBp","date":"Tue Nov 17 16:14:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Chinese Communist Party has made it clear, they will stop at nothing to dismantle liberty and democracy. \n\nAs a country built on the pillar of freedom, we must always #StandWithHongKong","date":"Thu Nov 12 19:05:41 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Caroline &amp; I have known Harold &amp; Bonnie for more than 25 years and consider them dear friends. Harold will be greatly missed &amp; I pray for Bonnie and their family. https://t.co/Mf7BsyZdgP","date":"Tue Nov 10 23:14:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s been a whole week since the election and votes are still being counted. That is unacceptable. \n\nThis slow count undermines the integrity of this election, especially since these votes are still trickling in from Democrat leaning counties.\n\nIt’s November 10th!","date":"Tue Nov 10 21:06:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congrats to the #1 team in the nation! @AlabamaFTBL","date":"Mon Nov 09 15:28:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As I stated Friday, every legal vote should be counted. Presidential Elections are over when the votes are certified, and the Electoral College meets in December. President Trump has every right to legally challenge any state results and to seek a recount where appropriate.","date":"Sat Nov 07 16:55:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is a link to my statement about the current status of the U.S. Presidential Election:  https://t.co/EltoQr7bIM https://t.co/r2VL4IO60Z","date":"Fri Nov 06 17:14:55 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The brave men and women who serve our nation are heroes to us all, and it’s up to us to honor them.\n\nThis month, please join @America250 for their November Salute by uploading a picture of a military service member or veteran who has touched your life.\nhttps://t.co/L6bgjrmQuI","date":"Fri Nov 06 16:31:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you for the overwhelming support for another term in the United States House of Representatives. It is truly my honor to serve you everyday in Congress.","date":"Wed Nov 04 03:10:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy 100th Birthday Radio!  On this day in 1920, the first radio broadcast in the United States is made from Pittsburgh. The way we get information &amp; entertainment changed forever. And 100 years later, radio is still an important part of our lives. @ALBroadcasters https://t.co/tEaMLP3uk1","date":"Mon Nov 02 13:17:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"✅ Small and large businesses are reopening their doors\n✅ Operation Warp Speed is working to get 300 million doses of a COVID-19 vaccine by January","date":"Sat Oct 31 14:10:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This Halloween, don’t let Democrat scare tactics about our country and our President haunt you. The truth is in the facts. \n\n✅ The American economy is making a comeback with a historic GDP surge of 33.1%\n✅ Unemployment claims are dropping","date":"Sat Oct 31 14:10:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning in Northport, I was awarded as a National Federation of Independent Business (@NFIB) Guardian of Small Business. Small businesses are the lifeblood of our economy and they are so important to Alabama. https://t.co/bR2Zf0nFDl","date":"Thu Oct 29 18:51:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We were at NorthRidge Fitness, one of the thousands of businesses that took advantage of the Paycheck Protection Program we created in Congress to help businesses get through the pandemic. @nfib_al","date":"Thu Oct 29 18:51:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @realDonaldTrump economic conditions and policies in place before the pandemic hit made this quick recovery possible.","date":"Thu Oct 29 12:57:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The arrests taking place in Hong Kong are dispicable acts of communist oppression. China’s security laws go against every fabric of freedom and free speech that exist.\n\nThe CCP must be held responsible on a global stage.\n\nI will always #StandWithHongKong","date":"Wed Oct 28 15:22:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Operation Autumn Hope should serve as a blueprint for stopping human trafficking, saving children, and arresting those responsible for these disgusting crimes. We must do everything we can to protect vulnerable kids and #EndHumanTrafficking","date":"Tue Oct 27 15:23:45 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Amy Coney Barrett on her confirmation to the Supreme Court. She will make a great justice and decide cases based on the Constitution and the law.","date":"Tue Oct 27 00:20:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I welcome USDA’s announcement of $37 million to expand rural broadband in Alabama.  https://t.co/7ngCMLWzLK","date":"Fri Oct 23 20:20:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Expanding rural broadband brings opportunities for businesses, better educational tools for our kids and opens access to telehealth for the vulnerable. I was proud to create the ReConnect program in the 2018 Appropriations Bill.","date":"Fri Oct 23 20:13:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While the CCP continues to push out communist propaganda and disinformation, the U.S. continues to stand strong and take China head on. I applaud @SecPompeo and President @realDonaldTrump for issuing these designations.","date":"Wed Oct 21 18:23:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I send my condolences to Huntsville Mayor Tommy Battle on the loss of his wife Eula. You and your family are in our prayers.","date":"Tue Oct 20 18:10:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last call for filling out your Census. If you have not already, please complete yours and make sure your family and friends have as well. Let’s make #AlabamaCount","date":"Wed Oct 14 18:16:11 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Completion of the 130-metric ton @NASA_SLS with the EUS will, in turn, offer an unsurpassed, government-secured capability to facilitate large-scale payload missions which can include international partnerships.","date":"Tue Oct 13 18:44:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @NASA on providing international leadership on working together in space.","date":"Tue Oct 13 18:44:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm excited to share the news that @Homtex_Inc in Cullman, Alabama has been awarded a contract to supply the U.S. Capitol complex with masks for members, staff and visitors.  I've already been wearing their masks for sometime and they are great! https://t.co/DlA5PsdIqa","date":"Fri Oct 09 15:16:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to my friend @WFPChief for winning the Nobel Peace Prize.  @WFP is feeding millions of people around the world.  This is certainly an honor that is well earned.","date":"Fri Oct 09 14:16:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Calling all Alabamians! October 5th is the deadline to fill out your Census. Have you completed yours? Have your friends and family? If not, please take a few minutes to fill out your Census @AlabamaCounts \nhttps://t.co/SxBz4PVh4x","date":"Thu Oct 01 17:45:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Safety Pledge enacted by President Trump is a great step toward ending child exploitation online. This pledge, along with $100 million from DOJ to combat human trafficking, will help prevent innocent lives from becoming victims of these awful crimes.\nhttps://t.co/CTKujhSqJp","date":"Wed Sep 30 15:21:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Protecting the most vulnerable among us is not something to take lightly, it's our responsibility and duty. Babies need care, love, and the utmost protection possible - especially those born prematurely. Thank you @realDonaldTrump for taking this action in the fight for life.","date":"Mon Sep 28 13:24:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/913wt1Hfnc","date":"Mon Sep 28 13:24:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud President Trump for making such a great nomination, Amy Coney Barrett will make an excellent Supreme Court Justice.","date":"Sat Sep 26 21:37:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The nomination of Amy Coney Barrett to be the next Associate Justice of the Supreme Court is a big win for this country. She is a defender of free speech, a protector of the Constitution, and an advocate for the most vulnerable among us.","date":"Sat Sep 26 21:37:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"You can read the economic impact study here: https://t.co/oGOeWc4bZe","date":"Fri Sep 25 15:17:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The new economic impact report @NASA just released shows the impact @NASA_SLS is having on America and Alabama.  In Alabama, 14,000 jobs and 2.3 billion in economic impact.  Across America, 28,000 jobs with 5.5 billion in annual economic impact. @NASA_Marshall https://t.co/1Y72LMefLj","date":"Fri Sep 25 15:17:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to John S. Jones Elementary School in Rainbow City on earning recognition as a National Blue Ribbon School! This is a great honor and it is well deserved.\nhttps://t.co/nyOpWHGbtQ","date":"Fri Sep 25 13:25:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The House of Representatives has no say in matters of choosing a new justice, but I support Senator McConnell in his role as the Senate Majority Leader to guide the nation through this process.","date":"Tue Sep 22 14:28:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Constitution clearly defines how a new justice is to be placed on the Supreme Court. It’s ultimately up to the President to nominate someone and it is the privilege of the Senate to decide when and if a nominee gets a vote.","date":"Tue Sep 22 14:28:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Justice Ginsberg served the court faithfully for a quarter of a century.  She was respected and admired for her dedication to her work, to her friends and as a pioneer on the Court. She will be missed.","date":"Sat Sep 19 02:13:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations Brady!  You are doing a great job representing your school, Etowah County and the 4th District.  https://t.co/hZkQl2G16j","date":"Fri Sep 18 15:14:08 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Sorry to hear of the death of Winston Groom. His novel Forrest Gump, and the subsequent film, added another rich layer to Alabama’s literary legacy.  https://t.co/BPr0T5KFeE","date":"Thu Sep 17 20:17:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Put your Constitutional knowledge to the test during #ConstitutionWeek and take the @America250 quiz! \nhttps://t.co/mtYt66JhsI","date":"Wed Sep 16 16:50:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Commitment to America is a clear path toward a bright future for our country. We must restore our way of life, rebuild the greatest economy the world has ever seen, and renew the American Dream. I am proud to support this plan put forth by @HouseGOP #CommitmentToAmerica https://t.co/G5GiMauJl0","date":"Tue Sep 15 20:58:34 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to be here at this historic ceremony and witness the signing of the Abraham Accords. Congratulations to Israel, Bahrain, and the United Arab Emirates on this remarkable achievement. U.S. leadership across the globe is strong with @realDonaldTrump as President. https://t.co/xJJU0tk9Yw","date":"Tue Sep 15 17:45:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"An historic event is about to take place at the White House.  The first time more Arab nations (UAE and Bahrain) have recognized Israel in a quarter century.  This, thanks to the diplomacy of @realDonaldTrump https://t.co/ERvGqd6kHc","date":"Tue Sep 15 15:30:13 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We Will Never Forget https://t.co/odOtCH5qol","date":"Fri Sep 11 12:33:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This has been one of my top priorities and something I was proud to help deliver when Ag Appropriations Chairman. Look forward to seeing more projects constructed around the state in the coming years. There is a lot of work ahead, but it will make a big difference for Alabama ag.","date":"Thu Sep 10 19:59:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Investing in Alabama’s irrigation infrastructure will bring significant benefits to crop yields, farm income, and rural communities as a whole. @AlfaFarmers @ALSoilAndWater","date":"Thu Sep 10 19:41:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to celebrate the culmination of many years of hard work by a lot of people. Today we opened one of the first projects enabled by the Alabama Irrigation Initiative. https://t.co/Axt6kD7cx5","date":"Thu Sep 10 19:41:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On this day 60 years ago, President Eisenhower dedicated @NASA_Marshall at Redstone Arsenal in Huntsville. https://t.co/B42x4mIN33","date":"Tue Sep 08 13:56:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I was given a tour of the @blueorigin test facility at @NASA_Marshall which is utilizing the historic Stand 4670 from the Apollo era.  Blue Origin is helping to end our dependence on Russian made rocket engines and employing hundreds here in Alabama. https://t.co/76U1TXGLGg","date":"Thu Sep 03 21:35:41 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Beautiful.   @NASA_SLS @NASA_Marshall @JimBridenstine https://t.co/AqKAEA0dem","date":"Wed Sep 02 19:09:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, 75 years later, there are roughly 300,000 American WWII veterans still alive. To those from the Greatest Generation who served our country, both living and past, thank you for your service!","date":"Wed Sep 02 16:19:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"September 2, 1945 is a day that has been etched in the pages of American history. It marked the official end of World War II, with American soldiers and officials watching as Japanese Foreign Minister Mamoru Shigemitsu signed formal surrender documents aboard the U.S.S. Missouri. https://t.co/NIIVWrhKd8","date":"Wed Sep 02 16:19:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the 47 countries of the African region on being certified free from wild polio virus. \n\nThe leadership and significant role the United States played to help #EndPolio in Africa is something we can all be proud of. @Rotary @ShotAtLife","date":"Tue Aug 25 14:57:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"With so many cancellations across the country, it’s good to see the @SEC going forward with football this season.\n\nIt’s clear that players are safer on the field rather than elsewhere, and that is what matters most. Great decision to #LetThemPlay \n\nhttps://t.co/P5WTvTTO6B","date":"Mon Aug 17 17:58:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I met with @FBI Director Christopher Wray at the agency’s new facilities in Huntsville on Redstone Arsenal.  Thousands of people will soon be working here for the FBI. https://t.co/X5XEACzPZ1","date":"Tue Aug 11 19:57:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Players are safer within their programs than they are being sent back home.   #LetThemPlay https://t.co/GhmJJuZDSh","date":"Tue Aug 11 15:05:13 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@porcyon They are 6 feet apart.","date":"Mon Aug 10 19:28:51 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Glad to be speaking today to the Guntersville Rotary club. One of the first in person meetings since the virus started.  (Proper Covid Precautions are being taken) https://t.co/eq2Ni4HCpu","date":"Mon Aug 10 17:40:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"To hear this news on the 23rd anniversary of the last British troops leaving Hong Kong is maddening. \n\nHong Kong deserves the freedom they were guaranteed, not the corrupt, tyrannical overreach the CCP is showcasing. \n\nI stand with Hong Kong.","date":"Mon Aug 10 16:16:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @ulalaunch for winning 60% of the national security launches in today's announcement of the U.S. Air Force Phase 2 awards!","date":"Fri Aug 07 22:14:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Access to high speed, high quality broadband is a necessity in today's world. The fact that rural America has been largely left behind on this issue is unacceptable.\n\nhttps://t.co/Be6hEjqSPZ","date":"Fri Aug 07 21:43:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"That's why I am leading a letter to Congressional leadership \nurging that CARES Act funds be eligible for permanent rural broadband infrastructure and that Congress provides additional time for the buildout of new infrastructure.","date":"Fri Aug 07 21:43:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you, President Trump, for listening and taking action on this important issue.\nhttps://t.co/eRgVn1RkOt","date":"Thu Aug 06 13:27:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Bringing medical manufacturing back to the United States is crucial, especially when China continues their quest to be a global pharmacy.\n\nI applaud @realDonaldTrump for taking this necessary step forward. This is a great day for our country. \n\nhttps://t.co/pB1vSVrS9m","date":"Thu Aug 06 13:27:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Glad to see our two American astronauts are safely back on earth with a beautiful splashdown in the Gulf of Mexico.","date":"Sun Aug 02 18:57:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was such a great honor to be invited to speak today at the multiple @north_alabama graduation ceremonies today. https://t.co/k12cKZZgGE","date":"Sat Aug 01 20:55:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"So sorry to hear this news, especially after it appeared his battle with Covid-19 had been won. My prayers go out to his family and his colleagues who I know are hurting.  https://t.co/wNFFxpEKqW","date":"Sat Aug 01 00:46:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I will continue to work closely with @governorkayivey and @senatordelmarsh, making sure we utilize all our resources to bring educational tools to kids across Alabama’s 4th Congressional district.","date":"Fri Jul 31 20:49:55 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is good news for kids across Alabama. A reliable internet connection is not a luxury, it is a necessity. This is especially true for children who will have to learn at home. We cannot allow kids in rural communities to be left behind.","date":"Fri Jul 31 20:49:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great news for farmers in northern Alabama! \nhttps://t.co/ChXPsFcJib","date":"Thu Jul 30 19:44:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Packages from China containing suspicious seeds have been sent to Americans across the country. Unsurprisingly, they are often mislabeled as things like “jewelry” to get people to open them. \n\nIf you receive one of these packages, please report it here: https://t.co/XEs2DMkNok","date":"Thu Jul 30 14:56:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for our state, but it comes as no surprise. Alabama has always been a wonderful state to live and work in!","date":"Wed Jul 29 21:50:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This afternoon the Alabama Congressional Delegation welcomed home the earthly remains of our colleague and friend, Rep, John Lewis to the Alabama Capitol rotunda. He will soon be laid to rest, but his legacy will go on through the ages. https://t.co/OBYqYHXXg7","date":"Sun Jul 26 20:04:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Celebrate Christmas in July by filling out your Census! @uscensusbureau  @AlabamaCounts  @GovernorKayIvey https://t.co/07wodajyKL","date":"Thu Jul 23 16:00:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This would expand competition, giving farmers more options to bring their produce to market and alleviate current backlogs, building a stronger food supply chain.\n\nI will continue to fight for legislation and policy that benefits the American farmer and consumer.","date":"Wed Jul 22 22:14:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was pleased to be an original cosponsor of the RAMP-UP Act which would offer grants and loans to smaller processors enabling them to comply with federal food safety standards.","date":"Wed Jul 22 22:10:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"After their initial findings, USDA outlined a series of policy proposals.  \n\nFor instance, USDA recognized the high burden for smaller meat processors meeting federal guidelines and noted “a resurgence in demand for services provided by these small and very small processors”.","date":"Wed Jul 22 22:10:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Though I am pleased to see progress from the investigation, I will monitor closely as USDA and DOJ continue to assess whether any violations of the Packers and Stockyards Act or Antitrust laws occurred.","date":"Wed Jul 22 22:10:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"USDA has outlined initial findings from its ongoing investigation into cattle and beef price disruptions following COVID-19 and the Holcomb plant fire. In May, I joined my colleagues in urging Sec. Perdue to conclude their investigation as quickly as possible.","date":"Wed Jul 22 22:10:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is the 51st anniversary of @NASA 's Apollo 11.  I am proud of the thousands of Americans who play a role in designing and completing the @NASA_SLS, which like the Saturn V, was designed from the beginning to provide astronauts safe passage to the Moon once again.","date":"Mon Jul 20 16:04:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was truly an honor to serve with him. No matter the subject he spoke on, John was always passionate and commanded the floor of the House of Representatives. My condolences and prayers to his family.","date":"Sat Jul 18 14:08:17 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sorry to hear of the passing of my colleague, and fellow Alabama native, Congressman John Lewis. My daughter and I had the opportunity to visit Selma with John on the 50th Anniversary of Bloody Sunday back in 2015, and saw up close his passion for Civil Rights.","date":"Sat Jul 18 14:08:17 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to see this.  Very fitting on a day that @GovernorKayIvey has declared Artemis Day in Alabama! @NASA_SLS  @NASA_Marshall","date":"Fri Jul 17 17:12:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On July 16, 1969 the crew of Apollo 11 set out on the most daring space exploration mission in human history, with their eyes looking towards the Moon. \n\n51 years later, we are working to send astronauts back to the Moon, and soon we will send them far beyond - to Mars. @NASA https://t.co/pvGZ9wq6ig","date":"Thu Jul 16 15:41:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I offered an amendment to prohibit DC from using tax dollars to fund abortions.  The last time the restrictions were allowed to expire, DC immediately began using tax dollars and paid for 300 abortions. Not surprising, but Democrats voted down my amendment on a voice-vote. https://t.co/aEfg5YADC4","date":"Wed Jul 15 17:10:55 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the @NASA_SLS  team; another milestone checked off!","date":"Thu Jul 09 20:57:41 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"House Republicans criticize NASA spending bill - SpaceNews https://t.co/DJwXrrC9mX","date":"Thu Jul 09 13:08:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"CJS Subcommittee markup.  The people’s work on appropriations bills continues this week despite COVID-19. https://t.co/ADfm3qydbp","date":"Wed Jul 08 13:35:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China’s extreme aggression towards Hong Kong is beyond unacceptable. It’s clear the communist regime is waging a political and corrupt war against freedom. We cannot tolerate this on the world stage, period. I applaud @SecPompeo for his work in standing with Hong Kong.","date":"Tue Jul 07 15:05:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Highlighting the need for rural broadband access and increased funding for the ReConnect program. #ruralbroadband #ReConnect https://t.co/8S8jhWeTnw","date":"Tue Jul 07 13:28:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Ramp Up Act will help address the current backlog of livestock and build a stronger industry for the future.","date":"Thu Jul 02 22:38:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Disruptions to meat processing this spring showed that our current system needs greater flexibility. I am an original cosponsor of this legislation because increased competition and capacity in the meat processing sector is good for farmers and the American consumer.","date":"Thu Jul 02 22:38:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our economy is moving in the right direction.","date":"Thu Jul 02 13:18:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Another month, and once again, the sold called \"experts\" were wrong about jobs.  4.8 million new jobs in June.  The \"experts\" said it would only be 2.9.","date":"Thu Jul 02 13:17:21 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm excited to see the investment in the Cullman area. I was pleased to play a role in securing these funds and look forward to continuing to work to grow all of our communities.","date":"Wed Jul 01 15:11:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was my honor to speak this morning on the House floor to remember the late Jack Thompson. Thompson was born in Colbert County and went on to have a distinguished career in agriculture, including serving as Alabama's Commissioner of Agriculture and Industries from 1995-1999. https://t.co/9IIJIEET4v","date":"Wed Jul 01 14:50:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wearing a face mask is a great and recommended way to help keep you healthy and safe, just ask Bo! #BoKnows","date":"Tue Jun 30 15:23:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The program lost only one week of schedule in 2019.  The testing of this taxpayer-controlled asset provides data valuable both to SLS flights and future commercial rockets.","date":"Fri Jun 26 14:41:10 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The “Green Run” engine test - the most vigorous test of any system in decades- will be this year at @NASAStennis.  Real hardware, right now.","date":"Fri Jun 26 14:41:10 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @NASA_Marshall just completed the largest-scale test program of rocket structures since the Shuttle program, with a successful test of the Space Launch System 70 foot tall liquid oxygen tank. @NASA_SLS https://t.co/V5ZwFD1Z8p","date":"Fri Jun 26 14:41:09 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Access to high speed, high quality broadband shouldn’t just be a reality for big cities, it must be a reality for rural communities too. That’s why I fought hard to secure critical funding in the CARES Act, and I’m glad to see it’s paying off in Alabama. @GovernorKayIvey","date":"Fri Jun 26 13:34:17 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s a great honor to receive the @USChamber 2020 Spirit of Enterprise Award. Since I’ve been in Congress, I have always supported pro-growth policies - and I will continue to support policies that boost our economy, increase employment, and encourage folks to buy American.","date":"Mon Jun 22 16:02:10 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thankfully, here in Alabama, we have home-grown groups like Cullman EC who have taken this issue into their own hands. I want to congratulate @cullmanec and thank them for the great work they are doing! https://t.co/72sfTx8itM","date":"Thu Jun 18 16:26:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Access to high speed, high quality broadband is a reality for some in this country, but not all. Rural America has been left behind, and that is beyond unacceptable.","date":"Thu Jun 18 16:25:41 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The United States flag is a symbol of freedom around the world – an everlasting sign of unity, strength, and hope. It’s our national pride that we treasure and fly high with honor. Let’s remember that as we celebrate Flag Day today and look to the beautiful red, white, and blue. https://t.co/sFhSGjHWPe","date":"Sun Jun 14 20:27:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"With restaurants, churches, stores, and entertainment venues opening across the state, I am glad to hear that sporting events could return to Alabama as well. This is great news for getting back to business. \nhttps://t.co/GqKPdK85N8","date":"Wed Jun 10 18:41:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The 24 hour news cycle can make it difficult sometimes to stay up to date on what really matters. That’s why I send out a weekly newsletter every Friday, giving you updates on what’s happening in Washington and Alabama. Have you signed up for it yet?https://t.co/kIBCsFCDHZ","date":"Tue Jun 09 22:18:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last year, I was able to go to Normandy with my family and see this hollowed place where so many young Americans gave their tomorrows for our todays.","date":"Sat Jun 06 16:01:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On June 6, 1944, thousands of American troops changed the course of history. \n\nOur brave American forces stormed the beaches of Normandy and showed the world what American strength looks like. On D-Day, 76 years later, we thank the Greatestest Generation for defending our freedom https://t.co/3lYvclmqNQ","date":"Sat Jun 06 16:01:27 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"America's unemployment rate falls to 13.3% as economy posts surprise job gains https://t.co/0wDZRSEDEW","date":"Fri Jun 05 12:54:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud @realDonaldTrump for taking a bold stand and issuing this Executive Order on Advancing International Religious Freedom. He understands the importance of this issue around the world and that supporting religious freedom is the right thing to do.\nhttps://t.co/IhcCJo6XzA","date":"Wed Jun 03 15:43:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Religious freedom is a core value in this country, guaranteed to every citizen by the Constitution. We hold that right near to our hearts, as we know that millions across the globe do not have this same freedom.","date":"Wed Jun 03 15:43:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Not only did he bring Auburn football back into prominence by winning games, SEC Championships, and what probably should have been a 1983 National Championship, he was a wonder molder of young men.","date":"Mon Jun 01 18:56:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While he will long be remembered for the games he won and the contributions he made to the great Auburn-Alabama rivalry, there are hundreds of people who were touched by him who will carry on his legacy for decades to come.","date":"Mon Jun 01 18:56:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If there was a college football version of Mount Rushmore, Pat Dye could be there among the greats. https://t.co/yDxtnl8ByC","date":"Mon Jun 01 18:56:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Historic moment for @NASA and the entire country. Proud of the men and women who made this happen, and especially proud of all the amazing NASA personnel working hard in Huntsville to push us beyond the ISS to our next destination - Mars.","date":"Mon Jun 01 18:12:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Furthermore, peaceful protest is something we all respect and something that is guaranteed by the U.S. Constitution.  However, violent elements that are bent on theft and mindless destruction, in many cases toward the people they claim to care for, have no place in our society.","date":"Mon Jun 01 17:12:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The death of George Floyd is unacceptable, as anyone can see from the video that was taken at the scene. It is tragic. Many have turned to peaceful protest as a way to highlight this injustice.","date":"Mon Jun 01 17:12:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"And all of it from the @NASAKennedy with their great team of @NASA , @usairforce , and civilian Ground Systems experts.","date":"Sat May 30 19:28:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Astronauts @Astro_Doug &amp; @AstroBehnken on their historic liftoff.  Cancellation of the Ares 1 by the previous Administration left US astronauts without a vehicle when the Shuttle was retired.","date":"Sat May 30 19:28:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Success in space has always required close work between the private sector and NASA. I look forward to a regular tempo of crewed flights to the @Space_Station followed soon by flights of the @NASA_SLS program.","date":"Sat May 30 19:28:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Virtual classrooms and distance learning will be inevitable for the future of education – providing yet another reason to make broadband access a top priority for Alabama and the rest of the country. It’s time, let’s get rural broadband done. \nhttps://t.co/A0Tapfrgnz","date":"Fri May 29 15:00:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The fight against COVID-19 is not over, help is still needed. Antibodies from people who have recovered from the virus can be used to save others. If you’re a survivor, please consider donating plasma – you can learn more here: https://t.co/5W7maw8nAF","date":"Thu May 28 19:53:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We are seeing great results from @realDonaldTrump 's Farmers to Families Food Box program. @NAAgriplex in Cullman partnered with @USDA to deliver fresh Alabama farmer grown produce to food banks &amp; other organizations. Thank you to everyone involved @IvankaTrump @SecretarySonny https://t.co/KbzoIlYUex","date":"Thu May 28 17:02:35 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In times of adversity, one of the most important things we can do is work together to find solutions. It’s what America is all about, and it’s what Congress is elected to do. Sadly, we can’t work together when the other side doesn’t show up. https://t.co/c8L95mnEK0","date":"Wed May 27 23:14:15 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Freedom and Democracy are pillars which our country was built upon. We fought for ours long ago and we support those seeking it across the globe. \n\nTo the people of Hong Kong, we stand with you.","date":"Wed May 27 17:19:05 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you to all those who gave the \"last full measure of devotion.\" #MemorialDay https://t.co/v91z05rnae via @YouTube","date":"Mon May 25 14:10:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On this day in 1908, the Wright brothers filed a patent for their “flying machine”. Making the impossible, officially possible. \n\n112 years later, we are still working on flying machines - but these are bound for Mars. https://t.co/5puCSIwNLm","date":"Fri May 22 20:18:27 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Marshall County has been hit hard. 643 positive cases with 121 in the last two weeks, but there are currently only two people in the whole county hospitalized. Which is much, much better than it could be. https://t.co/zaPg8tAaSY","date":"Fri May 22 16:00:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is outrageous. Communism is a threat we thought we had defeated a generation ago, but it’s clear China is bent on expanding this authoritarian form of government.\nhttps://t.co/7PhG0Z0HOW","date":"Thu May 21 14:57:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"To be clear, Planned Parenthood is prohibited from receiving funds from the CARES Act. They are an organization of 500+ employees, which bars them from getting any economic relief from the bill. The fact that they did is unacceptable, they now must refund the SBA immediately.","date":"Wed May 20 22:24:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Leave it to Planned Parenthood to rob Americans of COVID-19 funding. \n\nI guess taking life away from babies isn’t enough for them, now it seems like they are also trying to take life away from small businesses.","date":"Wed May 20 18:02:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Have you signed up for my weekly newsletter? Each Friday, I update you on what’s happening in Washington and in Alabama’s 4th District. Click the link below to subscribe! \nhttps://t.co/kIBCsFCDHZ","date":"Tue May 19 16:30:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @BoeingSpace @ulalaunch for Sunday’s successful launch of #AtlasV #X37B, the second national security mission for the @SpaceForceDOD #AmericaStrong  Photo from ULA https://t.co/9GT52FK8ls","date":"Mon May 18 19:22:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I spoke on the floor of the House of Representatives today to express my opposition to Nancy Pelosi’s liberal wish list. https://t.co/sBI532mqSf","date":"Fri May 15 22:52:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For much of Congress’ history it was much more difficult and deadly for members to travel to Washington to vote. Yet they did it.  No one ever suggested allowing members to vote by telegraph or telephone.  But leave it to Speaker Pelosi and the do nothing Dems to be the first. https://t.co/UPT3u6nLkQ","date":"Fri May 15 17:53:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Likewise, the sooner we schedule multiple flights of the @NASA_SLS Block1B the better, since its unmatched fairing capability will spur nations to partner with the U.S. Space program, as opposed to the military-driven space program of China.”","date":"Fri May 15 17:46:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @NASA on the announcement of the Artemis Accords.  These accords re-invigorate America’s role as the world’s leader in space, promoting responsible use of, and decommissioning of, space assets and opening the door to a new era of international cooperation.","date":"Fri May 15 17:46:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Taiwan has been excluded from the WHO for over a decade – an attempt obviously backed by the Communist regime in China. It’s time we held the WHO accountable, and that’s why I joined a letter urging the WHO to abide by its own Constitution and allow Taiwan a voice. https://t.co/cK0eLqF73M","date":"Thu May 14 21:13:38 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This bill we will vote on tomorrow is $3 trillion!   FDR's New Deal, adjusted for inflation, was around $740 billion.  And it's filled with money that has nothing to do with fighting or recovering from this pandemic.","date":"Thu May 14 19:27:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations @MikeGarcia2020 on your victory in California. I am looking forward to working together on the pressing issues facing our country. Welcome to Congress!","date":"Wed May 13 22:10:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If members are not willing to travel to our nation’s capital to cast votes, maybe they need to reconsider their choice of serving in Congress.","date":"Wed May 13 20:11:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When you run for Congress you know you are sometimes going to have to cast tough votes.  In this case, the toughness is working in this current environment. But we were elected to go to Washington and vote for our constituents, not vote from our couches. https://t.co/ekHiuXIDdd","date":"Wed May 13 20:11:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When times called for cooperation, Speaker Pelosi chose partisanship. When America needed to come together to address the remaining needs of COVID-19, Democratic leadership chose to go their own way.","date":"Wed May 13 19:48:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It appears as though Speaker Pelosi and her deputies are now more interested in shaping the debate for November than solving the real problems of today. This is shameful.","date":"Wed May 13 19:48:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Unfortunately, the Phase 4 stimulus has gone in a different direction. Speaker Pelosi has chosen to use this moment to write a wish list of liberal policies meant to divide the country, as not a single Republican was involved in developing this bill.","date":"Wed May 13 19:48:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In the last two months, Congress has passed three economic relief packages with a great deal of bipartisan support. These bills weren’t perfect, but they were necessary to combat COVID-19. We knew we needed to work together, and we did.","date":"Wed May 13 19:48:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"China’s Communist regime will stop at nothing to cover up its role in the COVID-19 pandemic. They’re now hacking American research that’s trying to combat the virus. This is unacceptable. The CCP must be held accountable for blatant criminal acts like this https://t.co/iMc7RD8oZ6","date":"Wed May 13 16:02:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Liberal La La Land just came to life now that @SpeakerPelosi released her 1,815 page wish list. \n\nThis multi-trillion dollar monstrosity was dreamed up behind closed doors with zero bipartisan input. \n\nTaxpayers deserve better.","date":"Tue May 12 23:27:52 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"#hercsoveralabama https://t.co/Wv1Vf8fzC4","date":"Tue May 12 17:38:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Make sure to look up and catch the #HercsOverAlabama today! As a salute to the heroes on the frontlines of the COVID-19 pandemic, the 908th Airlift Wing from @MaxwellAFB is conducting flyovers. Check out the times and locations below. https://t.co/exJFO2jNgP","date":"Tue May 12 13:26:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The doctors, nurses, and emergency personnel on the front lines of the COVID-19 pandemic are heroes to us all. During Hospital Week, let’s all make sure to thank our #HospitalHeroes for their service to our community! https://t.co/ObNTRciJAG","date":"Mon May 11 19:01:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As National Police Week begins, I want to thank all of the brave Police Officers who keep our district safe. You are all heroes, and we are blessed to have such courageous individuals here in Alabama. Thank you, Police Officers! https://t.co/mJeKjDymR3","date":"Sun May 10 19:34:35 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It's All Aboard for National Train Day. Thanks to the @NatlParkService, families can explore America's first intercontinental railroad from the comfort of your own home. Click the link for more information. \nhttps://t.co/pNf9c1YJu2","date":"Sat May 09 16:05:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wallace State President Dr. Vicki Karolewics awards diploma via FaceTime during drive-thru graduation celebration https://t.co/UlUtYDHVio via @CullmanTribune","date":"Fri May 08 13:47:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Looks like Democratic leadership is at it again, creating some big government spending bill behind closed doors. This type of political game is not what the country needs right now.","date":"Thu May 07 19:11:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While the national media narrative seems to constantly highlight that the United States has the most COVID-19 cases, it’s even more important to put things in perspective.  We have conducted the most testing and our per capita death rate is lower than many other countries. https://t.co/RvSErlimWY","date":"Wed May 06 14:56:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you @AlabamaNG for the flyover in Birmingham.  Your gesture and your service is greatly appreciated. https://t.co/NeIR0qMS3H","date":"Tue May 05 18:21:05 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is #TeacherAppreciationDay and here in Alabama we have a whole lot of truly wonderful teachers. Your selfless and tireless work to educate kids in our state is incredible. Let’s all make sure to #SendTeachersLove today. Thank you, Teachers! https://t.co/EAEOlVc85h","date":"Tue May 05 16:47:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Yet another reason to push ahead with this work.  The rocket core is at Stennis Space Center to be test-fired this summer, and the EUS will reach critical design review by the end of this year.","date":"Tue May 05 13:59:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"To reach bigger asteroids in time, millions of miles from Earth, and attempt to redirect their orbits, the Space Launch System (SLS) with the Exploration Upper Stage (EUS) will have more volume and speed than any rocket yet flown.","date":"Tue May 05 13:59:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last week @SpeakerPelosi was on CNBC to call for expanding broadband into rural America. I was fighting for rural broadband when fighting for rural broadband wasn’t cool.  But I welcome all the support I can get for these efforts.  Let’s get rural broadband done! #ruralbroadband https://t.co/49fOdtzipu","date":"Mon May 04 17:22:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Important news from the IRS: for VA &amp; SSI recipients with eligible children, tomorrow is the deadline to act and quickly receive your full Economic Impact Payment. Please click the link for more information.  https://t.co/Xmf9gP1g5B","date":"Mon May 04 14:10:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rural broadband has been an issue for years, and I have been working on it for a long time. But it looks like some Dems just realized that. It’s time for bipartisan legislation that benefits rural Americans. Let’s get broadband done. https://t.co/QpMrOJefWS","date":"Sat May 02 19:59:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear this news. https://t.co/Y0qNSafj7d","date":"Fri May 01 13:30:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rural broadband has always been an essential need, and the COVID-19 crisis has put a spotlight on that. We must address this issue in the Phase 4 stimulus, and that’s why I sent a letter to House and Senate leadership today, urging them to take action and fund rural broadband. https://t.co/PC2I03eYrw","date":"Wed Apr 29 21:20:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"NASA’s Mars Helicopter now has a name: Ingenuity. This came from Northport’s very own Vaneeza Rupani, who was selected from a crowd of 28,000 to name the historic aircraft. We are very proud of her wonderful accomplishment. Congratulations, Vaneeza! https://t.co/b8Jfjui2sw","date":"Wed Apr 29 14:50:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I appreciate the Federal Reserve of Atlanta highlighting my efforts to expand broadband to rural America  https://t.co/wldQnNZLqy via @AtlantaFed","date":"Wed Apr 29 13:43:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@KINGS_80 @GovernorKayIvey The White House Phase 1 guidelines require a two week decline in new infections.  Alabama has not achieved that yet.","date":"Tue Apr 28 16:40:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The new Safer at Home order is a solid step in the right direction for Alabama. I am happy that @GovernorKayIvey loosened some restrictions on recreation, business, and health care services. I am hopeful that this new order will bring positive results for our state. https://t.co/VHFH0qekzL","date":"Tue Apr 28 16:29:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Albertville custodian named Cintas Custodian of the Year https://t.co/SaF2gN50ee","date":"Mon Apr 27 17:31:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We will never forget that day nine-years-ago. 2011 Tornado Anniversary Memorial https://t.co/LHX3V8jp9N via @YouTube","date":"Mon Apr 27 13:23:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Launched in 1990 from the Space Shuttle Discovery, the Hubble Telescope has gone further than anything in history, inspiring us all along the way. Today marks 30 years that @NASAHubble has been on its mission, and we certainly hope that continues for 30 more. https://t.co/jMNEDQ3yzQ","date":"Fri Apr 24 20:01:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great news for Alabama! Funding from @HUDgov is headed our way. This allocation will make a positive and sizable impact for our communities that are struggling because of COVID-19. Thank you @SecretaryCarson https://t.co/uYvkIomKsn","date":"Fri Apr 24 18:30:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For 220 years the Library of Congress has educated and inspired people around the world. As a co-chair of the LOC Caucus, I’d like to wish the @librarycongress a very happy birthday! https://t.co/fL5NOeQ1tK","date":"Fri Apr 24 15:22:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"One week from today, we will announce the winners of the 2020 4th District Art Competition. The 50 high school students who entered worked very hard, so even though we will announce the winners online, we will still try to make it special for them. https://t.co/gXabUuqqra","date":"Fri Apr 24 14:21:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The NFL Draft starts later today, and I have a feeling our Alabama and Auburn guys are in for a big night!\n\nGood luck to all of the @AlabamaFTBL &amp; @AuburnFootball players in this years draft!","date":"Thu Apr 23 22:10:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Alabama Farmers Federation has created a website where National Guard members and Veterans who have been laid off from their jobs can look for work on Alabama's many farms. @AlfaFarmers   https://t.co/pcJs26fDe5","date":"Wed Apr 22 17:47:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On the @jeff_poor show while Mary Elliott does school work. https://t.co/TcpZWDhP48","date":"Tue Apr 21 20:49:45 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Interesting numbers from Huntsville Hospital CEO David Spillers. Huntsville Hospital currently has one patient on a ventilator because of COVID-19.   They have 55 patients on ventilators for other conditions not related to COVID-19.","date":"Mon Apr 20 17:22:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Chinese Communist Party has been working for years to become a global pharmacy. And after blatantly lying and withholding information about COVID-19, I think it’s time we implement Buy America policies in the medical supply and pharmaceutical industry. https://t.co/aSCrA7SrZ7","date":"Fri Apr 17 15:29:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Conducting an online meeting this morning of the 4th District’s Get Back to Work committee that @GovernorKayIvey requested we all put together.  It’s time to be making these plans to get everyone back to work as soon as safely possible. https://t.co/j3VSyigerd","date":"Fri Apr 17 14:16:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Enough is enough, we need to put political games aside. The PPP fund is depleted and Americans are counting on us to do something. I'm urging Democratic Leadership to support and pass the Senate replenishment bill. Now. \n\nhttps://t.co/odmvHSskQQ","date":"Thu Apr 16 21:48:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"1790 Census: counted by 650 US Marshals on horseback, recorded on forms made of parchment and animal skin.\n\n2020 Census: can be counted on your phone while you watch a rerun of Bama’s 26-23 Championship win over UGA.\n\nWhile you watch that OT thriller, fill out your Census!","date":"Thu Apr 16 20:21:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"So far 19,244 PPP loans have been approved in Alabama.  For a total dollar amount of $3,819,600,518.  This program has had some issues, but they are getting worked out and it's having a big impact on Alabama.  We need to approve more money for this fund ASAP!","date":"Tue Apr 14 19:28:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Three months ago today.","date":"Tue Apr 14 13:58:34 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Photos from DeKalb County this morning.  A road that's been washed away on County Road 44 near Fyffe and flooding in Fort Payne that's the worst since May of 2003. https://t.co/mBpYORJO0s","date":"Mon Apr 13 14:43:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Praying no one in Boaz was hurt.","date":"Mon Apr 13 00:10:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we celebrate the 50th Anniversary of the Apollo 13 launch. The “successful failure” started with hope, brought near tragedy, and ended with triumph over incredible odds. 50 years later, our sights are still set on the Moon, but they now extend further, to Mars. https://t.co/G9kubbBpg4","date":"Sat Apr 11 17:04:11 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to all the utility workers out there still on the job making sure the lights stay on, the water keeps flowing and the toilets keep flushing!  https://t.co/F22uZO5qOx via @YouTube","date":"Thu Apr 09 18:03:09 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"An article that echos the letter I sent to the President.  We need to be making more of our critical goods right here in America. https://t.co/FzMCiR3Zpb","date":"Wed Apr 08 20:28:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning I went on with @TheDaleJackson to discuss the current COVID-19 situation.  One topic, the Democrat proposal to Federalize elections and demand all voting by mail.  I think this would be a recipe for widespread fraud.\nhttps://t.co/d844k0PZz2","date":"Wed Apr 08 16:43:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Two weeks ago I wrote about the critical need for rural broadband funding. Now, we have it:\n\n✅ $200 million for FCC’s Connected Care Pilot Program\n✅ $100 million to the ReConnect Program\n✅$25 million for Distance Learning &amp; Telemedicine \n✅$15 million for Rural Telehealth","date":"Wed Apr 08 13:21:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/Mj0Hqb3Xoh","date":"Wed Apr 08 13:21:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Praying for and wishing the best for @BorisJohnson","date":"Mon Apr 06 20:26:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is a clear link between unsanitary 'wet markets' and the creation of novel diseases like #COVID-19. The Chinese Communist Party must change course and implement safer food practices now.","date":"Mon Apr 06 18:56:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you to those working at our local grocery stores and drug stores.  I know these stores are very busy and hectic right now. So, please thank these folks when you go to do your shopping. https://t.co/rDGYbxpKaA via @YouTube","date":"Sat Apr 04 14:51:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We are aware of the problems many local banks are having with the PPP portal.  I’ve spoken directly with many of you. We are reaching out to the Treasury Department to see that this is corrected as soon as possible.","date":"Fri Apr 03 19:37:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank You Postal Workers, UPS, FedEx employees https://t.co/R17YWnWl6i via @YouTube","date":"Fri Apr 03 13:11:38 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My website has a section dedicated to Coronavirus related Frequently Asked Questions.   There is a lot of useful information there.   https://t.co/YsFuSYFGzx","date":"Thu Apr 02 19:28:51 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Filling out the Census is a lot easier than it was in 1920.  Take some time to fill our your census form, online, by phone or mail. @uscensusbureau @AlabamaCounts  #2020Census \n https://t.co/AOupPiA5sq via @YouTube","date":"Wed Apr 01 18:18:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy Census Day!\n\nCensus Day is important, because whenever you complete your #2020Census, you should count everyone living (or sleeping) in your home most of the time as of April 1—whether you are related to them or not. Respond now at https://t.co/MitVaCYRSz. @AlabamaCounts https://t.co/Cot25b9F7t","date":"Wed Apr 01 12:10:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What does “Safer at Home” mean for Alabama? @ALPublicHealth has great information to help answer frequently asked questions. https://t.co/9fcptN0KCP","date":"Tue Mar 31 21:28:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Joining me in the Alabama delegation to sign on to this letter are @RepMoBrooks and @RepTerriSewell Thank you.","date":"Tue Mar 31 21:12:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I joined other members of Congress in sending a letter to @HHSGOV to ask for the exact type of testing mentioned in this story from @CBSSUNDAY @CBSNEWS https://t.co/riE63iZBlR via @YouTube","date":"Tue Mar 31 20:50:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rural hospitals are in dire need of financial relief. I am urging @SecAzar to prioritize immediate funding for rural hospitals with the money we designated HHS on Friday. Secretary Azar, please put HHS to work to save these hospitals. https://t.co/S1GpWBHDbZ","date":"Mon Mar 30 18:11:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you doctors for all you are doing right now.  You are part of the foot soldiers in this current war we are fighting. #NationalDoctorsDay https://t.co/PgWwXBQzKk","date":"Mon Mar 30 15:44:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Red Land Cotton in Lawrence County, known for their sheets made with Alabama grown cotton, is now also making masks for healthcare professionals.  Thank you for stepping up to help during this current COVID-19 situation.  https://t.co/ZW1hQhX05b via @YouTube","date":"Mon Mar 30 13:32:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@FunkafideFilth @AlfaFarmers @YouTube Chicken, beef, milk, sweet potatoes, wheat, soybeans, peanuts, corn, tomatoes and on and on.","date":"Sat Mar 28 16:17:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"People are working hard to keep the grocery stores stocked with food, but that food starts with farmers. Thank you for all you're doing! @alfafarmers https://t.co/zj14PpgUGd via @YouTube","date":"Sat Mar 28 16:08:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Now that @realDonaldTrump has signed the 3rd Coronavirus stimulus bill into law, help will start to flow to millions of Americans.  And @GOPLeader Kevin McCarthy was absolutely instrumental in guiding this bill through Congress.  Thank you!","date":"Fri Mar 27 20:55:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A big thank you to @RepKayGranger for all the work she and her staff did on the @HouseAppropsGOP committee on guiding this 3rd stimulus bill through the House.  These efforts will soon bring real help to millions of Americans.","date":"Fri Mar 27 20:50:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m back in Washington waiting to vote on the phase 3 stimulus. https://t.co/K6hh79kE39","date":"Fri Mar 27 17:14:50 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I have been fighting for the past several years to increase access to broadband internet to rural America. I’m proud to say this 3rd stimulus includes hundreds of millions to make sure people in these areas are never cutoff from telehealth or distance learning again. https://t.co/h3Hrbqcbr9","date":"Fri Mar 27 12:04:27 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm sorry that Alabama students will not be going back to class, especially for seniors who've had their final year disrupted.  But, these are difficult times and require difficult solutions.","date":"Thu Mar 26 21:34:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm very sorry to hear of this first Coronavirus related death in Alabama.  I know this person's family must be going through a very difficult time.  https://t.co/0PDHOdr8DR","date":"Wed Mar 25 22:00:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"With all of the kids home from school, we thought they might enjoy some House Mouse, Senate Mouse.  https://t.co/SIRvYoFt6x","date":"Wed Mar 25 14:53:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As you make plans for dinner tonight, you might want to call a local restaurant and order something to pickup or go through a local drive-thru like we did at lunch today.","date":"Tue Mar 24 20:30:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In order to support local restaurants and to make sure there is work for restaurant workers, whether they work for a locally owned business or chain, this Takeout Tuesday is also known as the Great American Takeout.  #GreatAmericanTakeout https://t.co/nyDlrCQgN4","date":"Tue Mar 24 20:30:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"5) $15 federal minimum wage\n6) Provisions on official time for union collective bargaining \n7) Companies receiving assistance now must have 1/3 of board members chosen by workers\n8) Postal Service debt bailout","date":"Tue Mar 24 13:20:21 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"1) Required early voting \n2) Required same day voter registration \n3) Full offset of airline emissions by 2025\n4) Publication and reporting of greenhouse gas statistics for individual flights","date":"Tue Mar 24 13:20:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The COVID-19 epidemic requires fast action and relief to small businesses and families. This is not the time to write a partisan wish list in the Phase 3 stimulus. Here are some of the ridiculous proposals included:","date":"Tue Mar 24 13:20:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Coronavirus outbreak shining an even brighter light on internet disparities in rural America https://t.co/Mj0Hqb3Xoh","date":"Sun Mar 22 12:04:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Small businesses and non-profits can now apply for loans from the Small Business Administration if they have been impacted by the COVID-19 outbreak.\nhttps://t.co/UIp8E1haEy","date":"Sat Mar 21 16:29:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is a video I made addressing these Facebook messages about a \"national shutdown.\" https://t.co/PHS6nzSEqA via @YouTube","date":"Fri Mar 20 19:11:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Aderholt lobbies Trump: Rural kids need broadband access https://t.co/aqYeaSiHq1","date":"Fri Mar 20 16:17:34 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"First Day of Spring in Alabama's Beautiful 4th Congressional District https://t.co/ny0KhQCBpV via @YouTube","date":"Fri Mar 20 14:49:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Many people have asked about the tax filing deadline. I sent a letter to President Trump yesterday requesting the deadline be moved. Today, it has been announced the deadline has now been moved to July 15th. https://t.co/vc8y9MqJTn","date":"Fri Mar 20 14:38:15 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks @AlfaFarmers for highlighting my efforts to continue to expand rural broadband.  This current crisis we find ourselves in, highlights why this can wait no longer.","date":"Fri Mar 20 00:52:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Alabama Cooperative Extension System has some great Coronavirus related tips on their website.  @ACESedu    https://t.co/yKbEH72e2b","date":"Thu Mar 19 15:42:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm asking @realdonaldtrump to include more funding for rural broadband in the next Coronavirus relief package.  People in rural areas are struggling to work from home and do school work from home. #ruralbroadband #ReConnect @usda https://t.co/G9mhyWb6uI via @YouTube","date":"Wed Mar 18 22:39:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A lot of people are getting their census forms in the mail right now. With a lot of us cooped up at home, now would be a great time to complete the 2020 Census.  @uscensusbureau @AlabamaCounts https://t.co/MgE5EW6RqE","date":"Wed Mar 18 18:01:05 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Supporting Small Businesses Impacted by the Coronavirus https://t.co/QdLx1IoIY5 via @YouTube","date":"Wed Mar 18 14:15:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great information here.","date":"Wed Mar 18 14:05:51 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabamians laid off or unpaid due to coronavirus are eligible for unemployment compensation https://t.co/tGQGRniHLF","date":"Tue Mar 17 14:04:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you to all of the healthcare professionals who are on the front lines of COVID-19 outbreak. Your dedication, your concern and your compassion are greatly appreciated. https://t.co/b14RwFDoOe","date":"Tue Mar 17 13:47:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We can do a lot during the next two weeks to dramatically bring down the number of cases of COVID-19 in our country. https://t.co/TfkvWIac3K","date":"Mon Mar 16 20:41:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Information for Americans who are currently overseas and trying to return home safely. https://t.co/6Gc3fxLoOg","date":"Mon Mar 16 19:36:52 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"New recommendations from the CDC about gatherings of 50 people or more.   https://t.co/004t87O8Mm","date":"Mon Mar 16 17:06:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @uscensusbureau announced some important guidelines today for college students.  Even if they have left campus because of the Coronavirus, they are still to be counted as part of their college/university count.  More details are here: https://t.co/kO2uItLSK2 @AlabamaCounts","date":"Mon Mar 16 16:51:13 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Some good news, the JSU student who was tested for the coronavirus after having some symptoms, has tested negative.","date":"Mon Mar 16 15:30:41 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This will allow schools to continue to feed students even though schools are closed.  It will be up to individual school systems to determine if and how they will administer the student feeding.","date":"Sun Mar 15 17:50:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I have been notified that the USDA has granted Alabama a statewide waiver to the National School Lunch Act congregate feeding requirement, it is effective immediately, and will continue through June 30, 2020.","date":"Sun Mar 15 17:50:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I spoke this afternoon with Len and June Brooks of Cullman.  They are in in quarantine in Texas after being onboard the Grand Princess.  Both are doing fine, are in good spirits and aren't sick.  Hopefully they will get to come home around March 24th. https://t.co/JfbULmgTXk","date":"Sat Mar 14 21:13:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We know that people who are in nursing homes are probably the most vulnerable to COVID-19.  So, I just want to say to all of the women and men who work at Alabama's nursing homes, how much we appreciate everything you are doing to protect our elderly. Thank you! #nursinghomes","date":"Sat Mar 14 19:49:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"to George W. Bush reciting the Lord's Prayer on September 11, 2001, we have always turned to God and when we have, we have time and time again come through whatever we were facing.","date":"Sat Mar 14 16:20:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"America has a long history of turning to God for help and guidance during times of crisis. From George Washington calling for prayer during the formation of our country, to Franklin Roosevelt leading the nation in prayer as D-Day unfolded,","date":"Sat Mar 14 16:20:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Trump has declared Sunday a National Day of Prayer, as one of the responses to the Coronavirus. Whether your church will be meeting Sunday or not, I urge you to join in prayer for our nation during this time. https://t.co/Y09TgI0V9l","date":"Sat Mar 14 16:20:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you @realDonaldTrump &amp; @VP for the update this afternoon on the Federal efforts to combat COVID-19. Declaring a national emergency will bring the full force of the federal government to bear to end this outbreak in our nation.","date":"Fri Mar 13 20:00:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I've been on the phone this morning talking to hospitals across the 4th Congressional District to check on their preparedness for the Coronavirus. https://t.co/ad6cwzBEwR","date":"Fri Mar 13 16:15:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @CQ Photo of the Week:   FDA Commissioner Stephen Hahn and Rep. Robert B. Aderholt, R-Ala., greet each other with an elbow bump, one preventative measure against the spread of COVID-19 https://t.co/dYw3HLRFMp","date":"Fri Mar 13 16:02:35 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s reassuring to see the actions @realDonaldTrump is taking to protect Americans from the Coronavirus. Steady leadership, and not panic, is what we need most at this time. #CoronaVirusUpdate","date":"Thu Mar 12 03:28:08 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @HHS announced today more state and local assistance is on its way –  $560m from the \n@CDCgov to fight the coronavirus, including more than $8 million for Alabama.","date":"Wed Mar 11 18:33:52 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The newest town in the 4th Congressional District is ready to be counted in the 2020 Census.  @AlabamaCounts  #Census2020 https://t.co/8JDRvnfWOg","date":"Wed Mar 11 14:04:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It is a great honor to be chosen to serve on the @250America Commission with other House members like @RepHolding pictured on the left.  Also in the photo are Commission Executive Director Frank Giordano and Chairman Dan DiLella. https://t.co/pZAuI65MMY","date":"Tue Mar 10 20:25:13 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Praying for a full recovery for John and for comfort for his family.","date":"Tue Mar 10 12:11:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s an honor to serve in the House with @repdonyoung   He always has the people of Alaska first and foremost on his mind and I know they are proud of his service.","date":"Fri Mar 06 22:41:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While there has been some negative news in regard to the stock market and the coronavirus, the reality is that the U.S. economy is not only sound, it's continuing to grow.  273,000 Americans were added to the payrolls last month. #Jobs","date":"Fri Mar 06 15:41:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The 50th Bassmaster Classic is underway on Lake Guntersville! #bassmasterclassic https://t.co/34Zhs44Qnl","date":"Fri Mar 06 13:10:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm glad to see that Jerry is recovering and back at work! @wvtm13 https://t.co/m3zHiq62Ed","date":"Thu Mar 05 19:21:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What an encouraging message and what a great milestone he has made.","date":"Wed Mar 04 17:07:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congrats to @RepKayGranger, one of the toughest fighters Texas has ever seen.","date":"Wed Mar 04 04:40:15 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Cullman ties for no. 6 micropolitan in U.S. https://t.co/I3snAicNbA via @CullmanTribune","date":"Tue Mar 03 16:27:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm praying for the people in and around Nashville.  Here in Alabama, we certainly know what they are going though this morning. #nashvillestrong  #nashvilletornado","date":"Tue Mar 03 15:36:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I just voted in Haleyville before having to fly back to Washington.  No matter who you are planning to vote for today, I encourage you to get out and vote.  #AlabamaPrimary https://t.co/mOMGEXpsug","date":"Tue Mar 03 15:32:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Overnight storms are when NOAA weather radios can be extremely helpful.","date":"Mon Mar 02 20:55:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to @cullmanec for the kind words.  It was my pleasure to help. https://t.co/JkQ0xVd8LC","date":"Mon Mar 02 20:46:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations Ms. Mahan! https://t.co/Tbc44M5C3H","date":"Mon Mar 02 15:29:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/Mu91Dpkg27","date":"Sat Feb 29 14:21:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I voted to condemn Senator Bernie Sanders’ comments praising communist Fidel Castro. A literacy program instituted to help spread propaganda is no bright spot in a dark regime that executed and jailed those who sought freedom.","date":"Thu Feb 27 22:58:31 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Enjoyed meeting with CEO and President of @AerojetRdyne , Eileen Drake, and talking about their advances in engine production, as well as the benefits @NASA_SLS and EUS will bring to our nation's space programs. https://t.co/b1wJ3o4dT6","date":"Thu Feb 27 17:00:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is a huge investment in West Alabama https://t.co/mZXnIMMILL","date":"Thu Feb 27 14:44:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Dr. Harris says the state will be able to test for the virus starting next month, rather than having to send any possible samples to the CDC in Atlanta.  Thank you Dr. Harris for the update.","date":"Wed Feb 26 22:54:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama's State Health Officer, Dr. Scott Harris, gave me an update on the Coronavirus and it's possible impact on Alabama. He says the state is making preparations in case the virus starts to spread in the U.S. https://t.co/7jdVmCy8nU","date":"Wed Feb 26 22:52:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This afternoon I met with ALDOT officials.  I asked for updates on two very pressing issues impacting the 4th District, the HWY 231 closure and the HWY 101 flooding situation. After meeting with them, I'm very confident they have a solid plan to deal with both of the situations. https://t.co/GDMydWgrty","date":"Wed Feb 26 21:33:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to @AmericasVetDogs for stopping by and bringing Pepper. She is one of the service dogs helping our veterans when they have completed their service to our nation.  Thank you. https://t.co/v8NbyiWHP7","date":"Wed Feb 26 19:27:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I enjoyed getting to meet with the Alabama Broadcasters Association, representing some of your favorite local TV and radio stations. @abc3340 @WBRCnews @whnt @CBS_42 @WAAYTV @robbiemcalpine @ALNewsNetwork https://t.co/EH4Gocr8Kq","date":"Wed Feb 26 15:00:05 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you @SenShelby!","date":"Tue Feb 25 21:47:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news.  The GE plant in Decatur employs a number of people from the 4th District and this expansion has added to that number. https://t.co/EsiPu4TeOS","date":"Tue Feb 25 14:54:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks @SteveScalise for the king cake as we celebrate Mardi Gras, which of course began in Mobile, Alabama 😀 https://t.co/CP7IgDM3dy","date":"Tue Feb 25 14:38:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The American farmer is already the most efficient in the world. This initiative by  @SecretarySonny will build on our success and allow new generations to be even more successful. @USDA","date":"Mon Feb 24 21:11:27 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our Cullman office has a special helper today.  #comet https://t.co/ZpLkfRXR93","date":"Mon Feb 24 16:04:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you @RepMikeRogersAL for your leadership on this issue.","date":"Mon Feb 24 15:02:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Sending prayers and well wishes to Sheldon Haygood for a full and speedy recovery.","date":"Wed Feb 19 17:16:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This photo popped up in the memories today. It's from February 18, 2016 as I was meeting with farmers in Cullman County. I love meeting with our District's many farmers and appreciate everything they do for our state and country. @FarmersGov @AlfaFarmers https://t.co/4jXnFdI8tw","date":"Tue Feb 18 16:31:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was an honor to help cut the ribbon on the new @blueorigin rocket engine plant in Huntsville this morning. This plant, and the other high tech industries that are moving here and expanding here, are a testament to how I believe this new decade is going to be Alabama's decade. https://t.co/6KkDTV77vi","date":"Mon Feb 17 18:44:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Hilda Smith of Winfield.  It was announced today she will be forming a chapter of @txeqorg in Alabama, our state's first.  Equusearch has participated in numerous searches for missing people across the country.  Now a chapter will be even closer to home. https://t.co/V1p1O35w2m","date":"Sat Feb 15 23:26:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy Valentines Day! https://t.co/56IrN7Fzia","date":"Fri Feb 14 15:20:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@Mickey_Ferguson you’re not lame!  @JANICEROGERS6 @MikeDubberlyGDA https://t.co/o6HcC0GbR8","date":"Fri Feb 14 15:09:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@FUN927 Happy World Radio Day @FUN927","date":"Thu Feb 13 21:34:03 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud @AGSteveMarshall for taking a stand on these senseless and heartless attacks on our law enforcement officers.","date":"Thu Feb 13 21:16:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is World Radio Day. Commercial radio is celebrating 100 years. For almost a third of that time, Rush Limbaugh has been on the air &amp; has been credited with saving A.M radio. So we send him  prayers for a full recovery on this World Radio Day. #WorldRadioDay https://t.co/aW3HSWKmV3","date":"Thu Feb 13 20:43:15 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Highway 231 between Arab and Huntsville has been closed because of heavy rain causing damage to the roadway.  A large number of people in Marshall and Cullman counties, especially people in Arab, use this to get to Huntsville everyday.  I know ALDOT is working on a repair plan. https://t.co/OyqAG0iM6x","date":"Thu Feb 13 20:36:34 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I met with Alabama supplier contractors to the @NASA_SLS program and was one of three speakers at the luncheon, with approximately 300 attendees in attendance. It was great to see everyone. https://t.co/FEqOD2mp0w","date":"Wed Feb 12 23:34:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is a threat for severe weather tonight (Wednesday). Here are the timing maps from the Huntsville and Birmingham Weather Service offices. https://t.co/q7pqaidFe9","date":"Wed Feb 12 21:59:14 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Sending prayers to Cullman Sheriff's K-9 Deputy Adam Clark, his family, friends and fellow officers. He is in critical condition at Huntsville Hospital after being involved in a vehicle crash overnight. His K9 partner, Figo, was also hurt, but is doing well. https://t.co/bAYVfwy1XY","date":"Tue Feb 11 17:42:26 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Cullman County has always been one of the biggest sweet potato producing counties in Alabama.  https://t.co/1NZy0HuAUI via @whnt","date":"Mon Feb 10 21:40:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to United Launch Alliance on the 82nd successful launch mission of the Atlas V rocket, which carried NASA’s Solar Orbiter spacecraft, and to Arab, AL native Tim Dunn who was the NASA launch director for this mission. https://t.co/hfLJ4FLh33","date":"Mon Feb 10 16:14:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@RocketCenterUSA Very sorry to hear this.","date":"Fri Feb 07 22:30:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our economy continues to soar!  And what is so special about this current economic boom, is that it's being felt across all demographics and locations.  https://t.co/O4sE9eCkA1","date":"Fri Feb 07 16:53:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Brand-name bites headed to Albertville | New development scores Firehouse Subs, DD, Baskin-Robbins https://t.co/ByncKz6GJI","date":"Fri Feb 07 15:20:19 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama's economy is not only attracting more and more U.S. companies, but companies from around the world are discovering Alabama's great business climate and creating thousands of new jobs in manufacturing!  Here are new numbers released just today by @OFII   #BLUECOLLARBOOM https://t.co/yLWJ9i5Nzd","date":"Fri Feb 07 00:44:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I keep a bust of Ronald Reagan in my office to remind me of what a champion he was for conservatism, but also what a champion he was for America.  His optimism in our nation never wavered.  Today would have been his 109th birthday. https://t.co/XyIXJYmz46","date":"Thu Feb 06 17:48:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@jeff_poor Season's Acquittals to you as well my friend, although I prefer the less PC Merry Acquittal.  Hopefully we can be on with you soon.","date":"Thu Feb 06 16:46:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The best peanuts on the Hill! My front office has Alabama roasted peanuts as our official office snack! https://t.co/43NmWJoqfK","date":"Wed Feb 05 22:16:27 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/WQnob20soU","date":"Wed Feb 05 22:00:51 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@realDonaldTrump America can lead this century just like we led the last century.  I call on all Americans to join with us to work towards an even better and brighter future.","date":"Wed Feb 05 21:31:48 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Now that @realDonaldTrump has been rightfully acquitted, it’s time to move on.  With this behind us, this is a new beginning for the President and our nation to focus on growing our economy, strengthening our military and restoring our values. https://t.co/q2ZsNETMgq","date":"Wed Feb 05 21:31:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is sad and disturbing. ⁦@GovernorKayIvey⁩ mentioned just last night the growing number of Alabama officer killed in the line of duty.  This trend needs to stop! #ThinBlueLine  https://t.co/EtSoHHbgPK","date":"Wed Feb 05 16:27:13 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I think the Speaker knows her party is in trouble after @realDonaldTrump delivered that great, optimistic speech. https://t.co/FotntTDieX","date":"Wed Feb 05 15:37:17 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy #NationalWeatherpersonsDay to the TV chief meteorologists who serve the 4th District, their staffs and the men and women of the @NWSHuntsville @NWSBirmingham https://t.co/tpOM7OtRSF","date":"Wed Feb 05 15:12:46 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The ripping sound you heard was the ripping up of the Democrat majority.  Last night the Iowa debacle and now this.  Democrats just keep the fodder coming.  @realDonaldTrump https://t.co/e6F4wC77ea","date":"Wed Feb 05 04:24:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Speaker Pelosi evidently couldn’t handle all  the good news about the American economy and American greatness. https://t.co/9ATb23hLAn","date":"Wed Feb 05 04:17:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I just told @realDonaldTrump how much I loved his speech tonight.  #SOTU https://t.co/9Tu0lMIQIe","date":"Wed Feb 05 03:30:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"One of the greatest State of the Union speeches I've ever seen.  @realDonaldTrump knocked it out of the park!","date":"Wed Feb 05 03:25:55 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What a great surprise!","date":"Wed Feb 05 03:19:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you Staff Sergeant Christopher Hake for your sacrifice for our nation.","date":"Wed Feb 05 03:14:49 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We are going back to the moon and on to Mars, and @NASA_Marshall  in Huntsville will lead the way!  Congrats to the great engineers and managers at @NASA NASA. #SOTU","date":"Wed Feb 05 03:09:45 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Trump's appointments to the Federal bench will be one of his greatest lasting legacies. #SOTU","date":"Wed Feb 05 03:07:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No sanctuary cities!","date":"Wed Feb 05 03:00:23 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Absolutely, keep investing in rural America!  RT if you agree with this.  #SOTU","date":"Wed Feb 05 02:59:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The national Democrats have no place for anyone who is pro-life. That’s a stain on their party.","date":"Wed Feb 05 02:55:53 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I long for the day when there are no abortions because there are no unwanted babies.  Even today there are more people wanting to adopt than there are babies waiting to be adopted. RT if you agree","date":"Wed Feb 05 02:55:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Rush Limbaugh is a fighter! I know he will beat cancer.  And is definitely worthy of the  Presidential Medal of Freedom #BeatCancer  #SOTU","date":"Wed Feb 05 02:51:05 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No socialist healthcare, ever!  #SOTU","date":"Wed Feb 05 02:44:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Looking forward to seeing North Alabama play a big role in the Space Force! #SpaceForce","date":"Wed Feb 05 02:32:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"USMCA is a promise made and a promise delivered and will set us a new course for trade deals in the future! RT if you agree.   #SOTU","date":"Wed Feb 05 02:27:43 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@mattmurphyshow Multitasking.  But I have to admit it's difficult to tweet and do all this clapping at the same time.","date":"Wed Feb 05 02:22:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Democrats claim small business isn’t thriving under @realdonaldtrump. In Alabama, business licenses are up 16% in the past three years.  #SOTU","date":"Wed Feb 05 02:17:30 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Economic records are being broken across the board.  That's worth standing up for! #SOTU","date":"Wed Feb 05 02:15:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"America is stronger under @realdonaldtrump.  Our military is being rebuilt to preserve peace and prosperity at home. #SOTU","date":"Wed Feb 05 02:10:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Under @realdonaldtrump there are 100,000 new jobs in Alabama, 10,000 of them in the manufacturing sector that Democrats wrote off as dead #SOTU","date":"Wed Feb 05 02:09:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The economy under @realdonaldtrump has not missed Alabama.  2.7 percent record unemployment rate #SOTU","date":"Wed Feb 05 02:08:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We are all headed into the House Chamber to take our seats for tonights SOTU speech by @realDonaldTrump  I'm looking forward to hearing his optimistic view of our nation's future.","date":"Wed Feb 05 01:50:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I hope @JohnCena as seen the outpouring of support and encouragement for him to pay a visit to Landen at Childrens Hospital in Birmingham. https://t.co/X5qGb43fll","date":"Tue Feb 04 19:36:11 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If you think the way Democrats are waiting on these caucus results tonight are bad, it will pale in comparison to the wait we will all have for healthcare if they get Medicare For All.","date":"Tue Feb 04 04:14:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Sending prayers and well wishes to Rush. https://t.co/CiBWZxHZpW","date":"Mon Feb 03 20:46:07 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Landen Godsey continues to improve in an AL hospital after he was hurt in a tornado that killed his mom &amp; dad in Dec.  His family is asking John Cena to consider visiting him in the hospital in Birmingham to encourage him.  So, @JohnCena could you possibly help this young man? https://t.co/J8T3SaAi2s","date":"Mon Feb 03 19:15:28 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This sounds extremely interesting.  Thanks @RocketCenterUSA for hosting these types of events!","date":"Mon Feb 03 15:53:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Looking forward to hearing @realDonaldTrump as he gives his 2020 State of the Union Tuesday night.  #StateOfTheUnion #SOTU https://t.co/C2sRVEXOSJ","date":"Mon Feb 03 14:33:24 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Where was the outrage when this impeachment process began and Democrats would not allow Republicans to call witnesses? The commentators were silent then. Nothing to see here, move along. But now a lack of witnesses is a “perfidy”?","date":"Sun Feb 02 15:38:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s great to see how the @FBI continues to build a presence in Alabama.  Thousands of FBI jobs are coming to North Alabama and now an expanded mission with @AuburnU","date":"Sat Feb 01 16:08:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you to @realDonaldTrump for signing an Executive Order on Combating Human Trafficking and Online Child Exploitation in the U.S. at today’s Summit at the White House.  Modern day slavery in all its forms, both here at home &amp; around the world, must be confronted and stopped. https://t.co/tlM5e80HNR","date":"Fri Jan 31 20:18:11 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"House Democrats: ladies and gentlemen of the jury our case is compelling and overwhelming.   Also House Democrats: ladies and gentlemen of the jury could you help us out and call some more witnesses?","date":"Fri Jan 31 15:36:17 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news.  Human trafficking is a large and growing problem. Right here in Alabama, Interstate 20/59 is a major trafficking corridor.  https://t.co/Baz4eVVeCm","date":"Fri Jan 31 14:47:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What also stands out about this growth is that it's being seen across the country.  In the past, even when the economy was good, states like Alabama were sometimes left behind.  This Trump economy is lifting everyone up, from every walk of life.  Thank you @realDonaldTrump","date":"Thu Jan 30 16:16:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When you make it on the @rickandbubba show, you know you've really made it!   Welcome to our state @SecretaryCarson   You will be in the 4th District later and I know you will love our people. I wish I could be there with you.","date":"Thu Jan 30 15:35:50 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wishing @GovernorKayIvey a speedy recovery from her fall.  I'm sure her Alabama State of the Union speech will soar, even with a broken wing. 😀","date":"Wed Jan 29 22:54:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"These are the future farmers who will be helping to feed Alabama and America.  They will also be the next generation of drivers of the huge economic impact farming has in our state.  The future looks bright!","date":"Wed Jan 29 18:11:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This new trade deal is long overdue.  Trade is important to our economy, but going forward we must have deals that use this new USMCA as a model so that that the U.S. doesn't get the short end of the stick. Thank you @realDonaldTrump for your leadership on this issue.","date":"Wed Jan 29 15:59:37 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear of Willis' passing.  I know he will be missed by his friends, family and the city of Muscle Shoals.  https://t.co/0FOjh8fT35","date":"Wed Jan 29 15:20:06 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"If Democrats wanted witnesses, they had the chance.  They could have brought all they wanted to the bunker underneath the Capitol during their secret hearings. It's not so much @realDonaldTrump that's on trial here, it's the Democrats hypocrisy.","date":"Wed Jan 29 14:11:21 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Stark contrast:  @realDonaldTrump is looking to the future.   When Democrats wake up every morning it's still 2016.","date":"Tue Jan 28 20:58:22 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This absolutely breaks my heart.","date":"Tue Jan 28 19:53:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I remember this well.   One of our staffers who works in the Jasper District Office got stranded on his way home.","date":"Tue Jan 28 15:13:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today we remember the crew of the Space Shuttle Challenger STS-51L.  As we strive to return America to greatness in Space, we must remember the pioneers who came before and the sacrifice they made. @NASA_Astronauts https://t.co/8OD956n9pT","date":"Tue Jan 28 14:06:02 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Such a sad and tragic story.  I’m praying for the victims and their families.  https://t.co/M1WI4fnKZU","date":"Mon Jan 27 18:22:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations!","date":"Fri Jan 24 22:04:39 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"United Launch Alliance is doing so many great things in space and employing so many people in North Alabama. Thank you @ulalaunch for the tour of your Decatur facility. https://t.co/zCbUsbzwvF","date":"Fri Jan 24 01:42:59 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to @blueorigin for giving @RepKayGranger and myself a tour of their new North Alabama facility.  Blue Origin is at the forefront helping America retake its place as the world's space leader and North Alabama is going to be vital to that mission. https://t.co/bGhbWGdtK0","date":"Thu Jan 23 22:19:04 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news from President Trump &amp; Secretary Azar.  On this 47th anniversary of Roe v. Wade, this decision from the Administration sends a strong message that Planned Parenthood‘s abortion business should not receive taxpayer funds.  #abortionisnothealthcare","date":"Wed Jan 22 21:30:01 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Guin Elementary School!   It was an honor to present them their National Blue Ribbon award.  This is a school filled with wonderful students and teachers. https://t.co/6FsViH6R8w","date":"Tue Jan 21 16:55:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Aderholt gets update on Northwest Alabama Regional Airport https://t.co/P089nFt8kv via @timesdaily","date":"Tue Jan 21 12:42:35 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I hope we will all take a moment today to think about the America Dr. King dreamed of, a country that lived up to its values &amp; where every citizen can have hope, justice and equal opportunities. America is better because of Dr. King and his courage to stand up for what is right. https://t.co/BczxweOEQJ","date":"Mon Jan 20 16:23:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Yesterday, the Semiquincentennial Commission delivered our Report to the President to @VP Pence. Tasked w/ planning the 250th anniversary of our founding, I am grateful to be a part of this milestone in our nation's history!\n\nOfficial White House Photo by D. Myles Cullen https://t.co/MjfDdRK5YH","date":"Fri Jan 17 16:43:33 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @GovernorKayIvey for once again being one of the most popular governors in America.  https://t.co/SP42UQlzwz","date":"Thu Jan 16 23:07:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As we celebrate #ReligiousFreedomDay, I want to take a moment to applaud @realDonaldTrump for his commitment to protecting our fundamental right to freely worship in peace. This right should never be taken for granted.","date":"Thu Jan 16 21:57:45 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"#USMCA is one step closer to being signed into law. \n\nYet another promise made and kept by @realDonaldTrump.","date":"Thu Jan 16 17:26:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, I spoke on the House floor on behalf of the millions of babies aborted since Roe v. Wade. I am unapologetically pro-life, pro-child and pro-family. I pray that we soon see the day that Roe v. Wade is overturned and the sanctity of life is returned to our nation. https://t.co/i26eBRgC4r","date":"Thu Jan 16 17:25:38 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is excellent news! Investing in infrastructure is a key element in building stronger communities across Alabama. Thank you @GovernorKayIvey for your commitment to investing in the future of our great state.","date":"Thu Jan 16 15:50:21 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Speaker Pelosi insisted impeachment was urgent for our national security, yet she waited almost four weeks to transmit the articles to the Senate.\n\n The managers the Speaker has named further proves the truth—this impeachment is and always has been purely partisan and political.","date":"Wed Jan 15 16:00:36 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"https://t.co/LGHu4bEp6F","date":"Tue Jan 14 20:45:12 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm sure students in Arab are busy working on their new rover as well.  I enjoyed introducing @JimBridenstine to these \"moon buggy\" students back in August. https://t.co/6VFsZzRk0p","date":"Tue Jan 14 16:57:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to see @FLOTUS @realDonaldTrump and @SteveScalise on TV during the game tonight! https://t.co/Vg6RsS9FjP","date":"Tue Jan 14 02:16:40 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations!  There are so many smart and innovative students across the 4th District. \n https://t.co/VqRcwaJUi0","date":"Mon Jan 13 14:30:00 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for Lawrence County.  State and local leaders continue to do a fantastic job ensuring this powerful economy reaches every corner of Alabama. https://t.co/4bRGJi52W9","date":"Sun Jan 12 19:01:47 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Freedom protestors in Hong Kong helped Taiwan’s voters see the real nature of Communist China’s rule. Congrats President Tsai Ing-wen on a great victory!","date":"Sun Jan 12 18:47:54 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thrilled to see Taiwan’s President, Tsai Ing-wen re-elected in a landslide.  She will fight to protect Taiwan’s independence and freedom from Communist China’s bullying.  https://t.co/OmJTG2eIa5","date":"Sun Jan 12 18:47:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Damage at Brindlee Mountain Primary is significant. Worse than this picture indicates. Fortunately, no one was hurt. https://t.co/okQxi2MAOz","date":"Sat Jan 11 21:51:58 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No one should be a victim of #humantrafficking. Wear blue and share your photo on Jan. 11 to raise awareness of this crime. Learn more about @DHSBlueCampaign’s #WearBlueDay: https://t.co/gIyqtbyZdI","date":"Sat Jan 11 13:55:25 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Visit this link for tips to follow to ensure your family is prepared:\nLink to this url -&gt; https://t.co/uez4E9Gszv","date":"Fri Jan 10 16:36:56 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Severe weather is expected across Alabama tomorrow with potential for tornadoes. Be sure to stay updated and have an emergency preparedness plan in place.\nLink to this url -&gt; https://t.co/lm9MEwzfac","date":"Fri Jan 10 16:36:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What a great story about such a sad situation.  But, I know every word of this article to be true. This is \"just how people in Winfield are.\"  https://t.co/VvwtTkwbSN","date":"Thu Jan 09 20:28:18 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you law enforcement from the 4th District of Alabama and across our nation for everything you do.  You are greatly appreciated.  #lawenforcementappreciationday https://t.co/1z96TVcB7x via @YouTube","date":"Thu Jan 09 15:35:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm thankful to hear that @GovernorKayIvey had a great doctor's report and is considered cured. Let's keep the Governor and her team in our prayers for continued healing.","date":"Wed Jan 08 21:37:44 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Democrats continue to waste valuable time with unfounded impeachment proceedings &amp; now unnecessary restrictions on the President’s authority to protect our nation.  We should be focused on the economy, strengthen our military &amp; maintaining American leadership in the world.","date":"Wed Jan 08 21:13:42 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As noted in today’s briefing from the Administration, the existing authorizations allow the POTUS to take necessary action to protect our troops already in Iraq. Both the drone strike and the troop and munitions movements are covered by that principle.","date":"Wed Jan 08 21:12:16 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@NASA_SLS @NASA_Marshall @BoeingSpace SLS is the largest rocket stage ever built and the first exploration-class rocket built since the Apollo program.  Proud to fund this important national asset in the CJS Appropriations bill!","date":"Wed Jan 08 19:54:57 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I thought the address @realDonaldTrump gave to the nation was both strong and appropriate.  No one wants war, but that decision ultimately is in the hands of the Iranian regime.","date":"Wed Jan 08 17:02:32 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The new Toyota-Mazda plant will soon begin hiring up to 3,000 people for their new facility in North Alabama. I believe this is just the beginning of this type of economic growth in our part of the state. https://t.co/xyUqbwXRaI","date":"Wed Jan 08 16:02:10 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is a great idea by Boaz Police.  Thank you for making this available so people can safety dispose of unused medicines.  Boaz Police open 24-7 drug drop box https://t.co/1vVMQzfg7A via @whnt","date":"Wed Jan 08 15:57:50 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our prayers are with the President, his national security team, and our brave men and women in uniform.","date":"Wed Jan 08 02:02:29 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Qassem Soleimani was a terrorist. He is no longer and he will never kill another American military member or citizen.  @realDonaldTrump took the decisive action that Soleimani’s evil required.","date":"Fri Jan 03 04:01:20 +0000 2020","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Hamilton High School in Marion County provided the ornaments that are on the Alabama tree on the White House grounds this year. https://t.co/UqnibjKeiD","date":"Mon Dec 23 18:59:22 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you @RAINN for the support.  I look forward to continuing to partner together on these important issues. https://t.co/nJZrhmWupF","date":"Fri Dec 20 20:02:34 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"More great news for Alabama!  @realDonaldTrump 's economic policies continue to deliver for Alabama.","date":"Fri Dec 20 16:35:58 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news and long over due.","date":"Fri Dec 20 16:02:30 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For over a year, @HouseGOP has asked Democrat leadership to put their politics aside and bring #USMCA to the floor. I'm glad they've finally brought this long-awaited deal up for a vote.\n\nIt's a great day for Alabama &amp; I look forward to voting yes! #USMCANow","date":"Thu Dec 19 17:42:26 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Trump &amp; @USTradeRep Lighthizer promised to re-balance &amp; modernize the outdated NAFTA agreement with a high-standard trade deal. I applaud them in enhancing relations with two of our largest trade partners.\n\n#USMCA is yet another promise made &amp; kept by @realDonaldTrump.","date":"Thu Dec 19 17:42:25 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, I will vote yes on @realDonaldTrump 's United States-Mexico-Canada Agreement. #USMCA opens new market access for Alabama &amp; U.S. poultry producers, and is expected to increase agricultural exports.","date":"Thu Dec 19 17:42:25 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"#USMCA is also estimated to increase U.S. production of automotive parts and employment in the sector. These are huge wins for two of Alabama's biggest industries.","date":"Thu Dec 19 17:42:25 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I think George Bernard Shaw summed up what the Democrats impeachment will ultimately be for them: \"There are two tragedies in life. One is to lose your heart's desire. The other is to gain it.”  It's what they've wanted all along, now they have it and it may cost them dearly.","date":"Thu Dec 19 15:55:02 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@realDonaldTrump The people of Alabama's 4th Congressional District gave President Trump his highest vote percentage in the country, 80.3 percent. They continue to support him today, and so does their Congressman!","date":"Thu Dec 19 01:27:51 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I voted no on impeachment. It isn’t @realDonaldTrump  who has abused his power.  It is my colleagues on the other side of the aisle who are abusing one of the most powerful tools entrusted to Congress in the Constitution for their own purposes. https://t.co/LkvaLKe9Iq","date":"Thu Dec 19 01:27:09 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Grateful for the Trump administration and their commitment to lowering drug prices in the U.S. It's unfortunate that Democrat leadership chose to pursue partisan solutions over real solutions for the American people.","date":"Wed Dec 18 21:04:54 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was my honor to do what I could to move this legislation through Congress.  It's vitally important that the thousands of sexual assault victims in our country get justice as soon as possible. @RAINN","date":"Wed Dec 18 16:38:52 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Proud that @LeidosInc recognized the outstanding national defense and space work done by Dynetics in Alabama. Look forward to their continued good work as a subsidiary of Leidos","date":"Wed Dec 18 00:23:50 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was proud to get increased funding for this important research:   Alabama-based tornado study gets budget doubled in 2020 https://t.co/QIXZI3poHk","date":"Tue Dec 17 22:14:46 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m very sorry to hear of the loss of life and injuries Monday evening in Lawrence County. My office stands ready to provide assistance to local officials in anyway we can. Please join me in praying for all those impacted.","date":"Tue Dec 17 03:12:24 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Every untested rape kit is a victim denied justice.\n \nEvery tested rape kit is a victim’s hope for justice. \n\nThere are thousands of rooms like these across the country.\n$102 million in FY20 funding exclusively for the Debbie Smith DNA Backlog Grant Program. https://t.co/9G3ejgLOOA","date":"Tue Dec 17 01:37:21 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In the 2020 Federal Budget these efforts we’ve started right here in Alabama are continued.  They maintain Marshall’s role and also help us stay on course to achieve President Trump’s space goals. https://t.co/6uc00P2v3u","date":"Mon Dec 16 22:34:40 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Doing all that reveals any changes needed in the handling process and thereby protects the real rocket – which is now ready to begin its voyage to Stennis for testing and then to Florida for “stacking” in the VAB. https://t.co/hCVTG2qX88","date":"Mon Dec 16 22:34:39 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Why is a replica made? Because it allows engineers to place the replica in and out of the barges and test stands and the vehicle assembly building (VAB) in Florida.","date":"Mon Dec 16 22:34:37 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Three years ago, construction on NASA’s full-size SLS core mockup began in Alabama. In Cordova, G&amp;G Steel plant was responsible for the final welding and assembly for the mockup. Upon its completion, the core was sent to Mississippi in August for lift testing. https://t.co/83uvYT7yIr","date":"Mon Dec 16 22:34:37 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy 200th Alabama!   Alabama at 200: Influence on American Entertainment https://t.co/tCEow7Nn3J via @YouTube","date":"Fri Dec 13 18:56:51 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"1127.   That’s how many days it’s been since @realDonaldTrump won Election Day 2016 and Democrats continue to try and overturn the results.  These impeachment charges are so political, not even all their members will be able to stomach voting for them.","date":"Tue Dec 10 14:18:18 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"NASA administrator @JimBridenstine  took time today at Artemis Day here in New Orleans to talk about the importance of @NASA_SLS and its impact on @NASA_Marshall and North Alabama. https://t.co/4XFePg52H5","date":"Mon Dec 09 17:18:29 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This American Hero spent part of his early life in Snead in Blount County.  My sincere condolences to his family, some of whom are still in Blount County. https://t.co/fyF76LloPY","date":"Sun Dec 08 19:19:03 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear of the death of this officer.  We can never show enough gratitude for the men and women who put their lives on the line for us everyday.  May God bless this family.","date":"Sat Dec 07 00:56:35 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@FUN927 Thanks for the great coverage.","date":"Fri Dec 06 23:38:46 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Please join me in praying for the law enforcement officer shot this afternoon in Huntsville, the officers family and fellow officers.  #ThinBlueLine","date":"Fri Dec 06 23:34:47 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Doug Kennedy Selected For the ASHOF – https://t.co/PtJL2Q4ZT5 https://t.co/CmsYp7TmUW","date":"Fri Dec 06 14:41:35 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We are one step closer to closing the ‘digital divide’ that isolates so many parts of rural America. Proud to have led the effort in Congress to bring high-speed broadband infrastructure to rural communities in North Alabama.","date":"Thu Dec 05 19:58:12 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Democrats have decided to move forward with impeachment to appease their base and try to overturn an election, not because their “evidence” of hearsay warrants it.","date":"Thu Dec 05 14:22:09 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today's impeachment report is filled with the same content we all heard from the hearings, more of the same hearsay, hyperbole and hot air.  It's time to leave the results of the 2016 election where they belong, back in 2016.","date":"Tue Dec 03 21:34:43 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Very sorry to hear of the passing of Auburn legend and former Samford Coach Pat Sullivan. He was and will forever be a part of our state’s rich football history. https://t.co/EEXSkOHSJ2","date":"Sun Dec 01 19:08:30 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Something to be very thankful for this Thanksgiving:  US abortion hits record low since Roe v Wade: Rates fell 24% in 10 years, CDC report reveals   | Daily Mail Online https://t.co/wECNlRIZa4","date":"Thu Nov 28 01:59:59 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is the lowest unemployment numbers in our state's 200 years of history.  Alabama is directly benefiting from the @realDonaldTrump economy and the economic leadership of @GovernorKayIvey","date":"Tue Nov 19 18:53:46 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for poultry farmers in Alabama! Lifting the unwarranted trade ban opens a huge market, potentially worth more than $1 billion every year.","date":"Thu Nov 14 15:07:22 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"“Being pro-life means not just pro-birth but being interested in the welfare of that child during their entire formative years.” \n\nThank you, @heritagefoundation, for allowing me to speak about the value of adoption in our society in honor of National Adoption Month. https://t.co/5kGGqvW3k5","date":"Wed Nov 13 16:24:27 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to @realDonaldTrump for the ride to Tuscaloosa.  What an honor!  And Roll Tide! https://t.co/vwEJKOKeiW","date":"Sat Nov 09 20:02:05 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This afternoon I delivered the letter below to Speaker Pelosi calling on her to release the full transcripts of all depositions in the impeachment inquiry, not just the portions they want to selectively leak.   “Democracy Dies in Darkness” https://t.co/q646JlplnQ","date":"Mon Nov 04 22:25:19 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is my statement on today's Democrat impeachment inquiry vote.  I voted no! This is what the Democrats have wanted since @realDonaldTrump was elected and has been their sole focus.\n\nhttps://t.co/Z2ABcKOTwu","date":"Thu Oct 31 16:43:27 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was my pleasure to welcome Sergeant Major of the Army, Michael Grinston (@16thSma) to my office this afternoon. Sergeant Grinston is a native of Jasper, AL, which I am proud to represent. Thank you for your service to our nation, you make all of us back at home so proud! https://t.co/H74rGbtFv3","date":"Tue Oct 29 18:16:50 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The death of Abu Bakr al-Baghdadi is the culmination of this effort and will help to save American lives.","date":"Sun Oct 27 14:01:20 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"When @realDonaldTrump took office in 2017, ISIS was still a very serious threat &amp; our efforts to eradicate the group were not getting the job done.  But he gave our military the authority and tools to get the job done.","date":"Sun Oct 27 14:00:45 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This impeachment process is literally being conducted in the basement of the Capitol, behind closed doors, to keep you from seeing what is taking place. It is a mockery! #StopTheSchiffShow https://t.co/9QXM1tc2Pm via @YouTube","date":"Wed Oct 23 02:04:44 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congrats on an important milestone! @SierraNevCorp Dream Chaser® will launch on @ulalaunch #VulcanCentaur in 2021. These missions will enhance NASA’s ability to deliver and return cargo from the ISS—up to 5500kg (12,125 pounds) in one trip!”","date":"Mon Oct 21 20:57:30 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to @JimBridenstine for the invitation to watch the historic all female space walk from @NASA headquarters.  Astronauts @Astro_Jessica &amp; @Astro_Christina are replacing a power controller on the @Space_Station https://t.co/UMwLCqeENA","date":"Fri Oct 18 12:10:24 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I believe Redstone Arsenal is the best choice to host U.S. Space Command. With the Army Space &amp; Missile Defense Command and other related agencies already located at Redstone &amp; with the low cost of living in North Alabama, it's the perfect choice. @EsperDoD @DeptofDefense","date":"Thu Sep 26 20:23:45 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"On the air this afternoon with @jeff_poor on @WVNN.  Jeff is in Washington this week. We are talking supporting President Trump and building the border wall. https://t.co/JVdHW9WjtM","date":"Thu Sep 26 19:22:36 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is my statement in response to Speaker Pelosi’s decision on impeachment: https://t.co/DnBIoMAFDG","date":"Tue Sep 24 21:12:12 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Please join me in sending our prayers and best wishes to @GovernorKayIvey for a complete and speedy recovery. https://t.co/j5jEdnE8N0","date":"Thu Sep 19 21:40:31 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Excited to be in Courtland this morning for the groundbreaking on @LockheedMartin new Hypersonic Programs facility.  This will bring new jobs to Lawrence County and bring increased security to our nation. https://t.co/5aTb62Ko8O","date":"Mon Sep 16 15:29:31 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"None of us alive then will ever forget that day, nor should we.  We will never forget the death, the destruction and the brutal images.  But we should also never forget those among us who rose up that day and became heroes for the ages. https://t.co/QS0ET6X9LA via @YouTube","date":"Wed Sep 11 03:17:06 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We will be having hearings today on this important issue. It's time to end infanticide! #EndInfanticide https://t.co/jveH8spjOJ","date":"Tue Sep 10 14:07:16 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A number of counties in the 4th District are eligible for this assistance.","date":"Mon Sep 09 19:27:46 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m a day late but happy National Radio Day!  I’m in studio this morning with Archie Anderson at WRAB.  @ALBroadcasters #NationalRadioDay https://t.co/WNcdpWnZl9","date":"Wed Aug 21 15:48:14 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"NASA boss visits Alabama school seeking brainpower for future space projects @JimBridenstine  https://t.co/FxuhJW4JXX","date":"Sun Aug 18 12:24:58 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I can’t express my thanks enough for @JimBridenstine coming to visit with students today @ArabHighSchool   I know they loved it and appreciated it. https://t.co/HyBmgKla1R","date":"Fri Aug 16 15:02:52 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Seth Maddox for winning the Microsoft PowerPoint WORLD Championship in New York!  Seth just graduated from Geraldine High School in DeKalb County and will soon be headed to @AuburnTigers https://t.co/RZcvhrGsWy","date":"Wed Jul 31 18:20:33 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"American iron and steel provides for the backbone of our economy - literally. \n\nProud of my “Buy American” provisions in annual appropriations bills - language that has now been adopted by @realDonaldTrump ‘s White House for infrastructure spending.\n\nhttps://t.co/43Ad85Emw2","date":"Mon Jul 29 11:30:29 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What an honor to be with @TheRealBuzz on this 50th Anniversary of Apollo 11.  @JimBridenstine #Apollo50th https://t.co/8HdzMRyDeh","date":"Sat Jul 20 22:36:34 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This is great news for Gadsden, Etowah County and Northeast Alabama:   Auto supplier Motus Integrated Technologies taps Alabama for new plant https://t.co/D63GF9h9ht","date":"Tue Jul 16 20:49:54 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama’s Apollo Legacy.  50 years ago today, as the world was watching, Walter Cronkite reminded everyone of the important role Alabama played in getting us to the moon. @NASA_Marshall @RocketCenterUSA @whnt https://t.co/ePYWCp3r9Y","date":"Tue Jul 16 12:05:13 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The “Salute to America” was fantastic.  Happy 243rd America!  #Salute2America https://t.co/RWZNIHQrNW","date":"Thu Jul 04 23:53:07 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m so sorry to hear this news about Rod and his wife. The ability to do radio and make action on the field come alive for those listening is an under-appreciated talent and Rod was a master of the art. Saturdays in the fall will never be the same.  #WarEagle","date":"Sun May 26 04:51:24 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My family and I are praying for the Bramblett family tonight and I ask that you please join me.","date":"Sun May 26 02:56:59 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Proudly built on American soil! ULA built  #AtlasV for #Starliner in their 1.6 million square foot manufacturing facility in Decatur, Alabama. It started from raw materials and soon will launch American astronauts to the @Space_Station. https://t.co/MoeqW8EvjT","date":"Thu May 23 18:16:35 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Redstone Arsenal being named to the short list to be headquarters for the U.S. Space Force is great for North Alabama but more importantly for America and our national security.   Redstone would be an excellent choice.","date":"Wed May 15 19:55:51 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It's National Travel &amp; Tourism Week and there are few areas with as much to see and do as Alabama's 4th Congressional District. It's also unbelievably beautiful.  #TravelMatters #nttw19 https://t.co/9yT8Z6tWSC","date":"Thu May 09 18:04:53 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I asked for the House to consider a bill that protects infants born alive during abortions.  And once again, Democrats refused. We must end infanticide! https://t.co/oz155owqBV","date":"Wed May 01 19:34:49 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We Will Never Forget 2011 Tornado Anniversary Memorial https://t.co/LHX3V8jp9N via @YouTube","date":"Sat Apr 27 12:37:23 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Glad to see that the 50th Bassmaster Classic will be on the best bass lake in America, Lake Guntersville! https://t.co/h79ZMmuJTe","date":"Mon Apr 22 20:05:16 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Below is a link to my statement on the release of the full Mueller Report:   https://t.co/643yHyDXW4","date":"Thu Apr 18 15:50:15 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s time to end infanticide.  #EndInfanticide https://t.co/NGoA3VBoQu","date":"Tue Apr 02 16:53:48 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Caroline really enjoyed teaming up with @SecondLady Karen Pence and other Congressional spouses to make care packages for our military members.","date":"Fri Mar 29 12:23:13 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Here is a very comprehensive story @WVTM13 did on our opioid summit we had Wednesday in the Shoals: State of Addiction: Special meeting on opioid crisis held in the Shoals, ... https://t.co/wLWKLRFmnp via @YouTube","date":"Thu Mar 21 15:42:36 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My office is hosting community partners this morning to find solutions to the opioid epidemic ravaging our state. https://t.co/YSqG93VRNy","date":"Wed Mar 20 15:13:26 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am deeply saddened about the storms in our state Sunday and the lives those storms took.   I ask you to please join me in praying for the families of those who were killed, those who were hurt and those who had their homes and lives destroyed.","date":"Mon Mar 04 22:13:04 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is not a corner of our state that has not benefited from Senator Shelby’s service in the United States Senate.   I wish him many more days of service to our state and to our nation ahead!","date":"Sun Mar 03 19:08:56 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I want to congratulate @SenShelby on becoming Alabama’s longest serving senator.  Almost 12 thousand days in the United States Senate is remarkable in and of itself, but the impact Senator Shelby has had on Alabama during this time makes it even more so.","date":"Sun Mar 03 19:08:32 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"80% of Americans believe late term abortions are wrong:  Senate Dems block 'born alive' protection bill after Trump admin partially defunds Planned Parenthood - Yellowhammer News | Yellowhammer News https://t.co/S5KgLuAY82","date":"Tue Feb 26 14:14:17 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Suppliers from nearly every state in the nation came to DC to support @NASA_SLS and @NASA_Orion , the exploration systems which will take us back to the Moon and beyond.  @NASA @NASA_Marshall https://t.co/RT3LjfU7ck","date":"Thu Feb 14 13:41:23 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Mrs. Easterwood did a great job!","date":"Wed Feb 13 13:47:28 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the @aafiron on their great debut showing!  1-0! https://t.co/74k3rt1FOP","date":"Sun Feb 10 23:50:12 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Democrats’ new ‘Green Deal’ will provide a living wage to those “unwilling to work.”  This is not what we should want our children to aspire to grow up and become, “unwilling to work.”  But this plan encourages just that.","date":"Thu Feb 07 22:58:33 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This pretty much speaks for itself.  The @realDonaldTrump speech was not just well received by most in the chamber but across the country. The same poll showed 72% agree with his immigration plan, so I say to my colleagues, let’s get to it! https://t.co/01bhGXBdYm","date":"Wed Feb 06 12:23:38 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I'm glad to see that the @USDA is reining in abuse of SNAP benefit waivers that allowed able bodied individuals with no children, to receive benefits without having to work. If you are able to work &amp; have no dependents, you should be working as a requirement for those benefits.","date":"Fri Feb 01 20:53:43 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I joined President Trump in the Oval Office as he signed an executive order that will strengthen \"Buy American\" provisions that I have championed.  Government funded infrastructure projects being built with American tax dollars should be built with American made products. https://t.co/AMiiCi9fBg","date":"Thu Jan 31 19:57:32 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@FUN927 Congratulations Michael!","date":"Mon Jan 28 17:52:58 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"In the rush to claim victory to deny initial funding for Border Security I wonder if the Democrats will remember their pledge to negotiate w/the White House to address what is a very real problem?\n\nThree weeks is not long enough to take a victory lap AND negotiate a solution...","date":"Sat Jan 26 14:29:11 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Let the countdown to liftoff begin! Proud to see @ULAlaunch move forward on the #VulcanCentaur with engine supplier @BlueOrigin right here in Alabama. #MadeinAlabama https://t.co/YlSw8c5iWY","date":"Fri Jan 25 15:48:13 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"For far too long, foreign countries have levied significantly higher tariffs on the U.S. ⁦@realDonaldTrump⁩ understands these types of acts are unjust. The U.S. Reciprocal Trade Act would provide the President leverage to lower their unfair tariffs. https://t.co/qqQZrDG7IA","date":"Thu Jan 24 20:36:25 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning, 214 Democrats denied furloughed DHS employees immediate pay. Democrats continue to use the suffering of our public servants as a political tool to keep them away from the negotiating table. For the third time now, Democrats prove they aren’t looking for solutions.","date":"Thu Jan 24 15:57:24 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was great being on this morning with @AunieLindenberg and with @ScottBeason.  We talked about the shutdown, the SOTU and what’s it like working with some of the new members of Congress. https://t.co/DOzpgVzOUL","date":"Wed Jan 23 14:00:35 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The President is offering solutions to the shutdown and continues to show a spirit of negotiation. This is in sharp contrast to Congressional Democrats who reject ideas before they’ve even heard them.","date":"Sat Jan 19 21:38:52 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, thousands of Americans joined together to mark the 46th anniversary of a terrible moment in American history – Roe V Wade. We mourn the loss of 60 million unborn children since 1973.  We must continue to fight for these children who do not have a voice of their own. https://t.co/bZi4p5G1Gi","date":"Fri Jan 18 19:53:49 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @realDonaldTrump plans are a comprehensive response to a growing threat.  I support his plan for additional GBI interceptors\nand for developing assets in space.","date":"Thu Jan 17 20:44:02 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A nice picture from this morning as Marshall County Judge Mitch Floyd was sworn in by his son with his daughter holding the Bible. https://t.co/BpKR8sV4ga","date":"Mon Jan 14 20:21:37 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @GovernorKayIvey on her inauguration to a full term as our governor. https://t.co/QRyDCiBERH","date":"Mon Jan 14 16:55:31 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Tonight, @realDonaldTrump made clear to the nation the immediate humanitarian crisis that faces our southern border. I share the President’s concerns and fully support funding for the border wall. Read my full statement here:\nhttps://t.co/GCXmQZqN2I","date":"Wed Jan 09 03:23:01 +0000 2019","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Merry Christmas! https://t.co/fuuXpiIAXE","date":"Tue Dec 25 16:04:27 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Apollo 8 50th Anniversary!  Merry Christmas!   @NASA_Marshall @nasa https://t.co/JObMkc4CMc","date":"Mon Dec 24 12:58:11 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@JohnHMerrill Thank you for filling in for me tonight, John ...wouldn’t want to miss a vote to support building @realDonaldTrump Border Wall!","date":"Fri Dec 21 02:54:23 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Tonight the House voted to stand with President Trump, approving the money he requested to secure our southern border.  An open borders policy is not putting our nation’s best interests at the forefront.","date":"Fri Dec 21 01:32:02 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the Gilley brothers from Ballplay. Their Christmas display won the Great Christmas Light Fight on ABC and $50,000! https://t.co/mn9Kdg44wG","date":"Tue Dec 18 02:17:37 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Good advice https://t.co/59Z1TnT0Ro","date":"Sun Dec 16 20:53:45 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Such a great event as I joined @SecretarySonny to announced the @USDA new ReConnect Program which will connect rural areas that currently have insufficient broadband service. I worked with my colleagues to secure $600 million to fund this program. https://t.co/mnztJdwhun","date":"Thu Dec 13 20:27:34 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I was proud to vote today for the Farm Bill.  It was a vote for both farmers and consumers.  There is not a single person that farming does not impact.  Farming Feeds (and clothes) Alabama and America.","date":"Wed Dec 12 21:34:34 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to the Fyffe Red Devils, 2A State Champs!","date":"Fri Dec 07 23:37:20 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m proud to announce that Cullman will receive a $14 million grant to finally finish the 4-laning of Highway 157 through the city. This is vital not only for economic growth but the hospital is right in the middle of the congestion on this highway. https://t.co/SYEOPLX5PT","date":"Fri Dec 07 16:11:01 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud this new flexibility.  This is exactly what I have been working toward for the past five years. The old rules, put in place during the previous Administration,  drove the cost of the food up, while pushing participation down.","date":"Thu Dec 06 17:47:09 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Go Albertville!     How an Alabama company is getting President George H.W. Bush to his final resting place https://t.co/uDAYbPEfEI","date":"Tue Dec 04 22:35:06 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"RIP 41 https://t.co/rHD8Mm74Rf","date":"Mon Dec 03 16:44:19 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"RTR!  Congratulations to @AlabamaFTBL   Another great game with the Bulldogs.  That could have been the actual National Championship game right there.  SEC! SEC! SEC!","date":"Sun Dec 02 00:56:50 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m very sorry to hear of the passing of former President George H.W. Bush. He was not only our 41st President, but a hero of WWII who was the epitome of the Greatest Generation.","date":"Sat Dec 01 05:12:01 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I would like to congratulate @RepKayGranger on winning  Ranking Member for Appropriations. We were elected the same year and know that she is a solid Member who has the experience that seniority brings to solve complex problems.","date":"Thu Nov 29 21:08:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Snowy morning in Washington. https://t.co/Bi0dDQWU5U","date":"Thu Nov 15 14:54:10 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Praying for these players.    5 Oakman High School football players hospitalized after locker room wall collapse https://t.co/GBsAoPl7d7","date":"Sat Nov 10 01:08:51 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Always great to be on with @MikeDubberlyGDA on Good Day Alabama. https://t.co/xkCyjPVmof","date":"Thu Nov 08 13:41:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I Voted stickers are good, but I Voted cookies are even better.  #GoVote #ElectionDay2018 https://t.co/IecIs9DqIP","date":"Tue Nov 06 22:14:14 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Such a great honor to be asked to speak at today’s Cullman County Veterans Day event.  The men and women who have served our country in the armed forces have our utmost respect and admiration.  Thank you all for your service. https://t.co/XXvFmp7weF","date":"Sat Nov 03 15:01:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thank you for inviting me tonight to be the keynote speaker at the East Alabama Regional Planning and Development Council. This organization and the ones like it across Alabama are unsung heroes in improving quality of life across our state. https://t.co/A3i7YbUS6Y","date":"Fri Nov 02 01:51:55 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Wallace State is helping to improve lives and grow economic opportunities. Thank you for inviting my staff to today’s Investment Luncheon.  @wallacestate https://t.co/jw5RqnipSp","date":"Wed Oct 31 18:05:36 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to my friend and ⁦@CullmanEMA⁩ director Phyllis Little.  Local Cullman EMA’s Little wins prestigious 2018 IAEM-USA Clayton R. Christopher Memorial Award | The Cullman Tribune https://t.co/skRQMsRb1b","date":"Wed Oct 31 13:39:02 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My sincere condolences for the lives lost today at the synagogue in Pittsburgh.  I offer my prayers to the families of those who have been lost. “God is our refuge and strength, a very present help in trouble.” psalm 46:1.","date":"Sat Oct 27 20:03:37 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to Dr. Lavender and everyone @gadsdenstate for the tour today and update on the new science center. https://t.co/NltpErYvD5","date":"Sat Oct 20 20:11:20 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"From time to time we like to put an upbeat video together to show off Alabama's 4th District and our work for the district. Here is a look at 2018 so far, with some musical help from the great Drake White, who is a Hokes Bluff native.   https://t.co/5ARqtW3nL6","date":"Fri Oct 19 20:17:29 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last year my office helped secure $2 million in grants for fire departments across the Fourth Congressional District.  They put their lives at risk to save life and property.  Thank you for your service. https://t.co/iPIgKsMxTZ","date":"Fri Oct 19 03:27:59 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I enjoyed speaking tonight to the Etowah Country Fire Association banquet.  These are the people you will see on some of the worst days of your life, but we are so very thankful they are there. https://t.co/MFBATh5yJY","date":"Fri Oct 19 03:26:48 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What a blessing and great experience visiting the Eagles Wings day-hab facility in Coker today. Wonderful people. https://t.co/E3QB6nA3Ls","date":"Wed Oct 17 20:41:44 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Speaking today to student leaders from both Auburn and Alabama inside Bryant-Denny stadium.  #betterrelationsday https://t.co/NlAR4LgTgl","date":"Wed Oct 17 17:36:09 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to meet with @BamaCRs tonight in Tuscaloosa. https://t.co/gDH19nUL69","date":"Wed Oct 17 01:42:17 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama is home to some of the most dedicated and hardworking people- farmers. Agriculture is the backbone of our state and on #NationalFarmersDay, Alabama and our nation, thank all farmers for their tireless work. https://t.co/QqNV5jxFBJ","date":"Fri Oct 12 16:34:21 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"First the temperature finally feels like fall and then a trailer load of pumpkins pulls up outside our Cullman office! #fall #pumpkins #cullman https://t.co/TbgZRBQVzx","date":"Thu Oct 11 18:30:29 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Always a great time attending the Marshall County RSVP volunteer appreciation event. A great group of people doing so much great work in the community. https://t.co/721hu4IzwG","date":"Wed Oct 10 18:27:15 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The combined bands from Geraldine and Sylvania High Schools in DeKalb County performed on the steps of the Lincoln Memorial this morning.  And let me just say, they did a fantastic job!  Everyone was impressed! https://t.co/INQ3bKP9JE","date":"Sun Oct 07 15:34:20 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am pleased to see that it looks as if Judge Kavanaugh will be confirmed to the Supreme Court.  He has served as a federal judge for more than a decade with honor and I believe he will bring that same integrity to our nation’s highest court.","date":"Fri Oct 05 20:30:01 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We landed a man on the moon in 1969, one of America’s greatest moments. It was also the last time the unemployment rate was this low.  We are also planning to return to the moon &amp; on to Mars.  #MAGA. It’s more than just a hashtag. ⁦@realDonaldTrump⁩  https://t.co/LZqbawz266","date":"Fri Oct 05 13:07:32 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’d like to welcome @BetsyDeVosED to Tuscaloosa and the wonderful @RiseSchool https://t.co/ilemjcsN75","date":"Thu Oct 04 12:59:48 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s always great to meet with the @cullmanchamber during their annual fly-in to Washington. A great group of folks. https://t.co/nQOhCvqFcW","date":"Wed Oct 03 19:44:17 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"President Eisenhower created NASA on this day in 1958, 60 years ago.  And while NASA might be six decades old, it continues to innovate and lead the world, keeping America first and foremost in space exploration.  Happy Birthday @NASA    @NASA_Marshall  @NASA_SLS https://t.co/naiJUDvtjR","date":"Mon Oct 01 14:28:47 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today is National VFW Day. And I can’t think of anyone better to honor on this day than Walter Dempster, former State Commander V.F.W. Arab Post 6226. Dempster, a Marine who served in Vietnam, passed away earlier this week. #nationalvfwday https://t.co/LvxoboF5Vz","date":"Sat Sep 29 14:07:00 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Ridiculous. \n\nThe Senate should not delay the confirmation of Kavanaugh another day.","date":"Fri Sep 28 19:34:05 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"No better place than Alabama to build engines and rockets!","date":"Thu Sep 27 21:19:07 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @ulalaunch &amp; @blueorigin on their rocket engine agreement.  The Vulcan Centaur will combine ULA’s advanced manufacturing &amp; 100% success-record with Blue Origin’s bold &amp; responsible innovations in propulsion, specifically the LOX/LNG BE-4 engine.","date":"Thu Sep 27 21:18:54 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The @uscensusbureau has released data showing the median household income has increased 5.1% since 2016 in Alabama’s 4th Congressional District. Thanks to pro-growth policies like the #TaxCutsandJobsAct our economy is booming and poised to get even stronger. https://t.co/zp8qyolroI","date":"Thu Sep 27 18:36:19 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Yesterday, I was honored to be recognized as a ‘Guardian of Small Business’ by @NFIB. Alabama is home to more than 380,000 small businesses and I’m proud to support them as they continue to help grow our booming economy. https://t.co/Np94U6rIgH","date":"Thu Sep 27 14:51:15 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I enjoyed meeting with Cullman native and Interim Chancellor of the University of Alabama System, Fess St. John, this morning. Chancellor St. John and I are committed to partnering with industries around the state to provide students more workforce opportunities upon graduation. https://t.co/OlV8BMuNT3","date":"Wed Sep 26 16:30:07 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"ICYMI: Last night a bipartisan group of congressional leaders announced an agreement on comprehensive legislation to combat the opioid crisis. I applaud the leaders for their work and look forward to passing this vital piece of legislation.","date":"Wed Sep 26 14:04:20 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This evening I had the best time co-hosting the Catfish Farmers of America’s Catfish Fry with the Catfish Farmers of America. Alabama is home to the best catfish and I’m proud to support our local farmers. https://t.co/9wENRCWXjr","date":"Wed Sep 26 00:33:38 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Our office was proud to be able to have an American flag flown over the United States Capitol at the request of students at Fairview Elementary in Cullman County. https://t.co/WCk6Ehtn4P","date":"Tue Sep 25 15:03:45 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks for sharing this.  It’s great!!","date":"Sun Sep 23 00:08:54 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As we continue to battle the ongoing opioid epidemic, I am announcing today that more than one million dollars will be going to health care facilities that serve the 4th District, specifically to combat opioid addiction.  We will win this war! #OpioidEpidemic https://t.co/2R5LL6TNC0","date":"Fri Sep 21 16:33:14 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I am proud to work with President Trump in fulfilling his mission to support rural America. These funds invest in jobs that help drive rural Alabama and provide a good quality of life.\nhttps://t.co/vpC2R1S5om","date":"Thu Sep 20 18:26:38 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great being on Good Day Alabama on @WBRCnews with @MikeDubberlyGDA talking about the issues of the day. https://t.co/HrV53IuPo7","date":"Thu Sep 20 12:55:57 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"A further sign that the economy is back on track and growing under President @realDonaldTrump is the record low in unemployment and increased wage growth. More are on the way as @UPS just announced they are scheduled to hire 100,000 seasonal workers for good paying jobs.","date":"Wed Sep 19 19:57:36 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to @ulalaunch on the 130th successful launch of the Delta II rocket Saturday, carrying NASA’s ICESat2 satellite (built by @northropgrumman ).  An unmatched record of successful flights. https://t.co/Y62pGzqsmj","date":"Mon Sep 17 19:12:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Congratulations to Jody Singer on being appointed director of the @NASA_Marshall As a manager of SLS, &amp; formerly team leader for the Space Shuttle Columbia Return to Flight activities, Jody has the experience &amp; the know-how to put safety first &amp; to keep big programs on schedule. https://t.co/muftWVKkfl","date":"Thu Sep 13 18:37:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As folks in the Carolinas brace themselves for Hurricane #Florence, crews from @AlabamaPower &amp; other electric co-ops &amp; utilities are on stand-by as they prepare to restore power to those effected. I applaud their work &amp; stand with my fellow Alabamians ready to lend a helping hand","date":"Wed Sep 12 20:20:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There will be a job fair in Vernon this Friday at the city complex. Mayor Crawford asked that we share this and spread the word about these potential opportunities. https://t.co/emc8VJyE5e","date":"Tue Sep 11 22:11:27 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"None of us who experienced that day will ever forget it.  #911Anniversary #WeWillNeverForget https://t.co/ffLx9crWiH","date":"Tue Sep 11 16:14:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Worth following this thread today and on every September 11th ... #NeverForget","date":"Tue Sep 11 12:31:58 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud my colleagues’ efforts and look forward to continuing this commitment to the American people.","date":"Mon Sep 10 20:12:43 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, the @HouseAppropsGOP filed its first “minibus” funding bill. For the first time in 10 years, Congress will send more than one funding bill to the President’s desk before the end of the fiscal year- proving the return of “regular order”.","date":"Mon Sep 10 20:12:42 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was such a wonderful experience celebrating Patriots Day with the American Legion in Hackleburg. Thank you for the invitation. https://t.co/2jFwAN7fyG","date":"Sat Sep 08 18:03:35 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I always enjoy attending the NACOLG annual fish fry.  NACOLG makes a difference in people’s lives everyday. https://t.co/uA6uvKSSP2","date":"Fri Aug 31 12:53:18 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Securing $600 million for rural broadband wasn’t the end of our mission, but just the beginning. Today we are talking about the next steps to bring broadband to all of Alabama. @GovernorKayIvey @MacDistrict25 @ALConservative https://t.co/ABV04BJPEN","date":"Wed Aug 29 20:08:37 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I met with constituents and local leaders this morning at Kelly’s Kitchen in Rainsville.  Great conversation and great food. https://t.co/icGIwiMJFu","date":"Wed Aug 29 14:38:35 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The strength of the American economy, and the American consumer, comes with a lot of negotiating power.  Power that has too often not been used, to the detriment of American workers.  Those days are over.","date":"Mon Aug 27 17:33:12 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"All throughout the 2016 campaign, Democrats laughed at the idea we could renegotiate our trade deals.  With this important step towards a new NAFTA deal, President @realDonaldTrump has once again proven these critics wrong.","date":"Mon Aug 27 17:33:12 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I would also be remiss not to mention his unwavering support for making sure we have the strongest military in the world. His life was dedicated to public service.","date":"Sun Aug 26 03:22:11 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’m sorry to hear of the death of Senator John McCain.  He and so many other American military personnel survived an existence as a POW in Vietnam that most of us could never imagine.  My prayers to his family during this difficult time.","date":"Sun Aug 26 00:43:11 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Sara Lang, a freshman at Alabama, has won the Congressional Award’s bronze medal for her service to her community. This is not an easy award to achieve. We think she might be the first ever from the 4th District. Congratulations Sara. https://t.co/1hgUOqbPVw","date":"Sat Aug 25 12:26:19 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Best of luck to all of Alabama’s Fourth Congressional District’s high school football teams as they kickoff the new football season tonight! I especially want to wish the @AHS_Rams luck as they host their first home game in their new stadium tonight. #RamNation https://t.co/Wr00Xvugtm","date":"Fri Aug 24 21:02:44 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I was honored to receive the Champion Award by the Boys and Girls Club of Alabama. https://t.co/v8ocRt1v2s","date":"Fri Aug 24 17:37:11 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Since it’s completion, Interstate 22 has proved that Alabama’s Fourth Congressional District is open for business. \nhttps://t.co/L4fDHRILYN","date":"Fri Aug 24 15:14:22 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning Carbon Hill received some great news! Carbon Hill will be home to the next Rolling T Truck Stop on Interstate 22. The project will lead to a dozen new jobs and the expansion of future commerce in the area. https://t.co/I0gfja3eYR","date":"Fri Aug 24 15:14:21 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was great being in studio today with @DonDaileyAPT for an interview for @CapitolJournal. A small portion will air tomorrow night and will run in its entirety August 31 at 8pm on @APTV https://t.co/NNKY5AAOCs","date":"Thu Aug 23 20:59:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I remain focused on the positives this administration has delivered on economic growth, rolling back overreaching government regulations and acting like the super-power we are.","date":"Thu Aug 23 14:01:01 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Many on the left want to jump on these Cohen and Manafort cases as if it is also an automatic conviction of the President. The reality is that we don’t know what impact, if any, this will have on the President. They are just grasping at anything.","date":"Thu Aug 23 14:00:46 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I applaud these changes. They will protect the environment while also protecting Alabama jobs. The Obama era rules were overreaching and job killing. https://t.co/27QHbxgQw4","date":"Tue Aug 21 20:10:52 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It’s always fun to get to drop by WRAB in Arab and visit with Archie Anderson, especially during “America’s Favorite Program,” the Helping Hand. I hope I can do it again soon. https://t.co/gqLTymm2vI","date":"Mon Aug 20 15:47:38 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama and the 4th District are open for business. More Alabamians are working and making more than they have in 11 years. No doubt we are #BetterOffNow due to our Republican pro-growth agenda. Thanks, but you can keep your socialism.","date":"Fri Aug 17 19:55:04 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Two of the top five counties in Alabama with record low unemployment are right here in the 4th District. Cullman County, where we just recently attended another business expansion at Royal Technologies, and Marshall County.  Cullman is at 3.5% and Marshall 3.7% https://t.co/ri2ai6OJMW","date":"Fri Aug 17 19:50:13 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Good morning Oakman!  Just one of the many great communities in the 4th District. https://t.co/3EP8Vv4Za7","date":"Fri Aug 17 14:13:22 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The music world has lost a legend in Aretha Franklin.  One of her most famous song, RESPECT, was recorded right here in the 4th District on February 14, 1967. And what a Valentine gift it was. Her voice was one of the many that gave richly to the Muscle Shoals Music. https://t.co/dgx8rv4lpm","date":"Thu Aug 16 14:30:30 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"There is not a country on earth that has done more good for more people than America. This country most definitely has been great, and thanks to President Trump, we are going to be great again.  https://t.co/f1CwKNzeUV","date":"Wed Aug 15 22:04:36 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Fourth Congressional District is the largest poultry producing district in Alabama. I’m thrilled to know that Koch Foods is further investing in our community and our hard working people of the District.","date":"Wed Aug 15 18:00:26 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This Summer I had the privilege to work alongside these young leaders who recently completed their internships in my D.C. office. I greatly appreciate their work and the dedication these outstanding, young Alabamians did on behalf of the 4th Congressional District. https://t.co/2iiNnQgUro","date":"Tue Aug 14 15:46:13 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The Black Sea Area Support Team is serving in Romania - a long way from home and loved ones. While we couldn’t send black-eyed peas, collard greens or sweet tea, we did send an Alabama state flag to let them how much they are appreciated. May God bless them and the USA! https://t.co/bcJJEFet0r","date":"Thu Aug 09 20:01:32 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It was my pleasure to help honor Judge Horton.","date":"Fri Aug 03 20:57:10 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Need proof that the tax cuts Congress passed is working? Ask the 1.5 million people that have new jobs since it passed.  Economy is on pace to hit 3% annual growth as businesses expand and create jobs...what a difference a new president can make @realdonaldtrump #MAGA","date":"Fri Aug 03 14:02:40 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Pastor Brunson’s imprisonment is a clear example of how Turkey continues to move in the wrong direction. I applaud @realDonaldTrump to stand-up against Christian persecution.","date":"Wed Aug 01 18:33:21 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The American economy continues to thrive because of @POTUS’ pro-growth policies. Alabama is #BetterOffNow because of President Trump. #MAGA","date":"Fri Jul 27 13:21:45 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today I spoke about the importance of religious belief at ⁦⁦@Heritage⁩. The American pastor wrongfully detained in Turkey &amp; recent efforts to ban faith-based groups from adoption services shows now more than ever we must protect such an important right for our democracy. https://t.co/YpU34cNEhu","date":"Thu Jul 26 19:54:48 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today the @HouseAppropsGOP passed its 12th and final appropriations bill for Fiscal Year 2019, the Homeland Security funding bill. The bill includes $5 billion for new border wall construction and security. I am proud to help @POTUS keep his promise to build the Wall. https://t.co/9jXeydl8dY","date":"Wed Jul 25 21:50:06 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Alabama’s 4th District knows football better than any other district. Thanks to a local artist, Aaron Sullivan, students at Cullman’s Parkside Elementary School will be “kicking off” their school year ready to learn.\n\nCountdown to @AlabamaFTBL: 38 days https://t.co/kgw0PNT4pC","date":"Wed Jul 25 14:42:07 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I have always supported Alabama farmers. That’s why I support @POTUS’ decision today to stand by our nation’s farmers who are suffering from unjust and illegal trade retaliation. Read my full statement here:\nhttps://t.co/jQ4mDPDgjH","date":"Tue Jul 24 21:49:17 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy to meet @al_ffa officers this morning. It’s always good to hear from our young leaders in agriculture. #NextGenAg https://t.co/WRsgWfbuA7","date":"Tue Jul 24 15:07:01 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today, I attended the @WhiteHouse’s ‘Made in America’ exhibit featuring @redlandcotton from Moulton, AL. Alabama small businesses and American manufactures are making a strong comeback and Alabama is helping lead the charge. #MadeInAmerica https://t.co/rbB6qwtPAe","date":"Mon Jul 23 19:26:23 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Red Land Cotton Sheets, based in Alabama and right here in the 4th District , will represent all of us today at a Made in America event at the White House.  Proud to have this great company in Lawrence County. https://t.co/4dVWR8aXWe","date":"Mon Jul 23 13:31:48 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Stay weather aware this evening and overnight.  There could be severe weather across North Alabama, including some tornadoes. https://t.co/LySfIdG3Qr","date":"Fri Jul 20 18:22:42 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning I met with the Guatemalan Ambassador, Manuel Espina, to discuss joint international efforts to combat human trafficking, drug smuggling, and illegal immigration. Security begins at home. https://t.co/uSlj2dLxwO","date":"Tue Jul 17 20:06:47 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I commend the work of @POTUS and @SecPompeo as they work to bring home the remains of thousands of Americans held since the Korean War. I applaud the continuation of diplomacy following @realDonaldTrump’s Singapore Summit. https://t.co/T3EHVwaTHW","date":"Sun Jul 15 17:34:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Spoke to @JasonCalvi of @EWTN’s @EWTNNewsNightly about the amendment I offered protecting religious organizations, such as ⁦@CCharitiesUSA⁩ and @Bethany, from being excluded from providing adoption and foster care services because of their sincerely held religious beliefs. https://t.co/imuABPILdY","date":"Fri Jul 13 15:03:52 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"As a Christian and a father, I am proud to have passed this amendment. Read my full statement here: \nhttps://t.co/IXECp6Pant","date":"Wed Jul 11 19:46:54 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Today my colleagues and I of the @HouseAppropsGOP passed my amendment which prohibits the discrimination of child welfare providers based on religious beliefs or moral convictions.","date":"Wed Jul 11 19:46:53 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@RepChuck is a stalwart in Congress for protecting religious freedoms. I’m always glad to have him on my fighting side on any issue - particularly his help in passing this one! https://t.co/eS2rE09Jnw","date":"Wed Jul 11 17:26:50 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning I was happy to join the Osborne family, from Albertville, AL, on a tour of the @uscapitol. I look forward to welcoming many more families of Alabama’s Fourth Congressional District to our nation’s capital. https://t.co/GjTQjCKPdx","date":"Wed Jul 11 16:53:22 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It warms my heart to know they have promised to continue to serve and are planning to return to their missionary work in Haiti. https://t.co/bEOnK5S0NU","date":"Tue Jul 10 23:52:43 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"It brings me great joy to know the missionaries of Russellville First Baptist Church have landed back in the U.S. safe &amp; sound. While serving those less fortunate &amp; spreading the good word of the gospel, the group was caught in worrisome protests.","date":"Tue Jul 10 23:52:41 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great to meet Peyton West, of Brookwood, Alabama, who is in town attending the Youth Legislative Training Conference hosted by the @AACS_DC. Thankful for your service to Congress during your week-long conference. https://t.co/EKNQGlkwF4","date":"Tue Jul 10 22:30:30 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My colleagues in the Senate should get to work immediately to forego all of the August Recess in order to confirm his nomination. #SCOTUS Read my statement below: \nhttps://t.co/IhiK0ciJah","date":"Tue Jul 10 01:43:51 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"@POTUS has delivered on his promise to nominate a candidate who is immensely qualified and will serve as an honorable guardian and interpreter of the United States Constitution.","date":"Tue Jul 10 01:43:51 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"The best things to come out of Louisiana are gumbo and the current House Majority Whip. Alabama is, of course, home to the birthplace of Mardi Gras and the 2018 College Football Champions. Roll Tide! https://t.co/jmZsOp2Av0","date":"Mon Jul 09 19:35:25 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"From Northport to Muscle Shoals and Cullman to Henagar, Alabamians of the 4th Congressional District will be able to celebrate Independence Day with millions of Americans. Check out @waff48 to see how best to commemorate the birth of our nation.\nhttps://t.co/Ii90mDpzui","date":"Tue Jul 03 16:15:35 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Always grateful to help out a fellow Alabamian, and Representative, @RepTerriSewell. Thanks for the 4th of July cupcakes in return! https://t.co/ogL0my6jlG","date":"Fri Jun 29 17:13:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"About 6 months ago, @POTUS signed the #TaxCutsandJobsAct putting money back into the pockets of taxpayers. Today, @USDA stated the new tax code will ease the burden on farmers across the nation allowing them to further boost the economy and put more food on American tables. https://t.co/FaQlQPcwEZ","date":"Thu Jun 28 21:48:30 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to the @60PlusAssoc for presenting me the Guardian of Seniors’ Rights award. I am proud to advocate for saving Social Security and Medicare for today’s seniors while strengthening it for future generations. https://t.co/5JjmntolBS","date":"Thu Jun 28 14:43:36 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"While Justice Kennedy proudly served the American people, I look forward to @POTUS nominating an honorable and well-qualified jurist. I encourage the U.S. Senate to not wait but to act quickly to confirm the President’s eventual nominee before the new Supreme Court term begins.","date":"Wed Jun 27 20:07:48 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning I spoke to the Joint Select Committee on Budget &amp; Appropriations Process Reform on how Congress can get back to regular order and away from continuing resolutions and omnibus appropriations bills- it starts with the U.S. Senate getting away from their filibuster rule https://t.co/ffQjJCMdy1","date":"Wed Jun 27 15:51:39 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"“Had a great working lunch with President Trump today to discuss the way forward on Appropriations so that we can fund the border wall as well as avoid another huge Omnibus” @realdonaldtrump #Appropriations https://t.co/Bf6BVANLGG","date":"Tue Jun 26 19:50:02 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Two great rulings today from SCOTUS. The court struck down the California law that forced pro-life groups to advertise abortion. And the court upheld the power Congress gave the President to limit travel to America to protect national security.","date":"Tue Jun 26 16:08:29 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"My heart breaks for the family of Steve Marshall upon hearing of the passing of his wife Bridgette. I ask you to join me in lifting him, their daughter, family and friends in prayer at this tremendously difficult time.","date":"Sun Jun 24 17:42:14 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Reporter tracks down “face” of border separation, exposes child was not separated and “asylum seeking” mother simply wanted economic opportunity.\n\nProblem is that this does not fit narrative being told by DC...but is by far the typical case at the border.\n https://t.co/NQX4dVz5yK","date":"Fri Jun 22 11:11:55 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This afternoon I was honored with the Association of State Correctional Administrators’s National Leadership Award. Public safety and the continued support for our nation’s correctional officers remains an important part in prison reform. https://t.co/QCVuINOuzN","date":"Tue Jun 19 23:16:08 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Last week, I had the opportunity to sit and answer questions from a young, creative, aspiring journalist. I wish Brilyn, of @TruthGazetteAL, the best with an already successful career in journalism. Watch the interviews here: https://t.co/x4Cf9tCUsi https://t.co/cPBbU6wCqJ","date":"Tue Jun 19 14:54:16 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"What an honor it was to meet with Buzz Aldrin (the second man on the moon) at today’s National Space Council meeting at The White House. https://t.co/eOXCCjOwrM","date":"Mon Jun 18 19:02:11 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy Birthday, @realDonaldTrump. It’s an honor to work along side you as we strive to Make America Great Again. https://t.co/tSkdbNFpIo","date":"Thu Jun 14 14:17:47 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Thanks to the @Alabama4H members who took time out of their busy schedule for a meeting today. These members are exemplary leaders of a younger generation. https://t.co/UYdzeV2IPU","date":"Wed Jun 13 20:48:45 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Honored to speak to Alabama’s high school juniors and seniors participating in this year’s annual @ALRuralElectric Youth Tour. The expansion and security of rural electrification and rural broadband will provide limitless opportunities for our nation’s students and economies. https://t.co/bTRV399vyu","date":"Tue Jun 12 16:17:10 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Reports indicate the meeting between President Trump and Kim Jong Un was very positive. I’m optimistic and continue to pray for a diplomatic solution to denuclearizing the Korean Peninsula.","date":"Tue Jun 12 02:09:30 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Tonight I, and many other Republican colleagues in the House, cut $15 billion in expired spending accounts - the largest rescission of government spending in history. I will continue to work with @POTUS to get our fiscal house in order.","date":"Fri Jun 08 02:43:24 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Great news! Tonight the House will vote on legislation rescinding nearly $15 billion and returning it to the American taxpayer. https://t.co/QTMhIsqGCP","date":"Thu Jun 07 20:49:36 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"Happy Birthday to our @VP and my friend, Mike Pence. You serve as an excellent example of leadership. I look forward to many more years of friendship and working to make America great again. https://t.co/3wJf3z2oNU","date":"Thu Jun 07 14:22:53 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"We’re live. Tune in: https://t.co/BTEXjGUjQ3","date":"Wed Jun 06 15:13:05 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"This morning I had the pleasure of showing families from Tuscaloosa, Tuscumbia, and Rainbow City one of the best views of Washington, D.C. It’s wonderful meeting families who call Alabama’s Fourth Congressional District their home. https://t.co/ww5nmH97rX","date":"Tue May 29 15:27:47 +0000 2018","user_id":"76452765"},{"handle":"Robert_Aderholt","text":"I’ll be calling in to @TheDaleJackson Show this morning. TUNE IN: https://t.co/GaTenrWmuA","date":"Thu May 24 13:04:48 +0000 2018","user_id":"76452765"}]