[{"handle":"RoyBlunt","text":"The world's biggest sporting event is coming to the heart of America – #KCMO will be one of the host cities for @FIFAWorldCup 2026!","date":"Thu Jun 16 21:35:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@USArmy birthday goes rolling along - thanks for including me in the celebration! #army247 #armybday https://t.co/yCaEOcMYbU","date":"Wed Jun 15 23:08:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks to the @KCHBA for meeting with me today to discuss issues they're currently facing, including workforce shortages and supply chain problems. https://t.co/4DJaf9AJE1","date":"Wed Jun 15 22:14:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Proud to join @SenJohnThune &amp; GOP Senate leadership in introducing a bill to help ensure a level playing field, increase accountability, and protect voters’ access to information. https://t.co/DhnlbtQo25","date":"Wed Jun 15 20:40:27 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s hard to have truly fair elections when large email platforms are deciding which messages can easily reach voters and which get buried in a spam folder.","date":"Wed Jun 15 20:40:27 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy 247th birthday to the U.S. Army! Thank you to all of the brave soldiers who protect our country every day.","date":"Tue Jun 14 20:10:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden economy is a disaster.\n\nInflation has hit a new 40-year high of 8.6%, costing households an extra $635 a month.\n\nThe national average price for a gallon of regular gas reached $5.00 yesterday and continues to climb.\n\nReal wages are down 3%.","date":"Fri Jun 10 18:08:38 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Senators Margaret Chase Smith and Barbara Mikulski more than earned their place in the history books. I hope that seeing these names in the U.S. Capitol will inspire future generations of women to follow their lead and leave their mark on Congress. https://t.co/BSu0QeUG0u","date":"Fri Jun 10 15:15:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m proud of the progress we’ve made to establish community-based mental health &amp; addiction treatment &amp; will continue to build upon that work.","date":"Fri Jun 10 14:19:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m very honored to receive this recognition &amp; grateful for @NationalCouncil’s partnership as we continue our efforts toward treating mental health like all other health.","date":"Fri Jun 10 14:19:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden, illegal border crossings are hitting record highs. It is long past time for the administration to be honest with the American people about the crisis it’s created at the southern border and to finally do something about it. https://t.co/NEqLhjeWOs","date":"Thu Jun 09 20:52:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Johnny Isakson worked tirelessly to get things done, especially for his fellow veterans. Naming the @deptvetaffairs Atlanta Regional Office after him would be a fitting way to honor his innumerable contributions to veterans, Georgia, and our country. https://t.co/AaZhSsrWfa","date":"Thu Jun 09 15:57:53 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I questioned industry leaders from @GlobalBTA, @iflymia, and @USTravel about how COVID pre-departure testing requirements are hampering the recovery of the travel &amp; tourism industry. It’s time to end the mandates and get travel &amp; tourism back to full speed. https://t.co/O72quDEHOa","date":"Wed Jun 08 22:16:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Ouch, that hurt. To fill up it used to cost me about $35, now it’s $62.”\n\n“Another driver, Chris, said he can’t even fill up his entire tank anymore. ‘I put in there what I think I need and I go from there,’ Chris said.”\n\nhttps://t.co/3JxmEwWX4z","date":"Wed Jun 08 16:15:03 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From the gas pump to the grocery store, hardworking Americans’ wallets are pinched from inflation. \n\nDemocrats’ reckless spending is hurting families.","date":"Wed Jun 08 14:06:58 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I discussed the tragedy in Uvalde, Texas, and the importance of expanding access to mental health care. https://t.co/vVBtuxZpFR","date":"Tue Jun 07 22:01:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"A great stop for families and visitors in the Springfield area, congratulations to everyone on the Wonders of Wildlife team.","date":"Mon Jun 06 19:43:59 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"HHS “reported that those who received care at [CCBHCs] had 63.2% fewer emergency department visits for behavioral health issues, had a 40.7% decrease in homelessness and spent 60.3% less time in correctional facilities.” https://t.co/Tx8PmSqxs4","date":"Mon Jun 06 13:34:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@JoplinGlobe editorial highlights the impact of community-based mental and behavioral health clinics &amp; the need to continue expanding efforts to get more people the care they need.","date":"Mon Jun 06 13:34:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you, @SenStabenow, for being a terrific partner in changing the way we view and treat mental health.","date":"Tue May 31 16:39:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We know Certified Community Behavioral Health Clinics get people the care they need, when they need it.\n\nThat's why it’s more important than ever that we expand this program nationwide.\n\nMore from my op-ed with my friend @SenStabenow:\nhttps://t.co/4VEMMfIwA1","date":"Tue May 31 15:59:44 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The freedom we have as Americans is not guaranteed. It must be secured from one generation to the next.\n\nOn Memorial Day, we remember our service members who made the ultimate sacrifice, giving their lives to secure our freedom. https://t.co/VoLNoI71rF","date":"Mon May 30 13:09:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"As we honor our fallen and reflect on their courage and sacrifice on Memorial Day, please take a moment to read this piece on what @OperBenjamin’s mission means to the families of these heroes. https://t.co/Hju1A0fp2c","date":"Fri May 27 20:18:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Because of that, he was buried in France with a grave marker bearing the Christian cross. @OperBenjamin is a nonprofit that works with the @usabmc to replace grave markers of Jewish service members, like Albert, with the Star of David.","date":"Fri May 27 20:18:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thousands of Jewish service members gave their lives in WW II, including Albert Belmont from Kansas City. As Albert’s daughter explains, “a common practice for Jewish soldiers during World War II was to hide their religious identities for fear of retribution.”","date":"Fri May 27 20:18:12 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The current shortage of baby formula is unacceptable, and we need to hold the @US_FDA accountable. This week, I joined 21 of my colleagues in a letter to @DrCaliff_FDA demanding answers on these shortages, which are hurting young families across Missouri https://t.co/Inobt0oQXG","date":"Thu May 19 19:27:55 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Across Missouri, parents searching for baby formula are finding empty shelves and out-of-stock notices. The Biden administration could’ve taken action months ago to get ahead of this crisis. https://t.co/lxG91H5FJQ","date":"Tue May 17 23:31:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Establishing a pattern of significant funding increases for NIH has been one of my top priorities &amp; I will do everything I can to ensure the resources are in place to continue critical health research programs. https://t.co/9cKGQ4QVfu","date":"Tue May 17 22:21:43 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden budget includes cuts to several NIH institutes and programs, like the Undiagnosed Diseases Network, that will have devastating consequences for patients and families.","date":"Tue May 17 22:21:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m especially grateful to Mitchell’s mother, Michele, and all of the tireless advocates who have raised awareness around the vital role medical research plays in giving hope to families battling rare diseases.","date":"Tue May 17 22:21:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"At an appropriations hearing today, I shared the story of Mitchell Herndon, from Affton, who passed away at the age of 19 after losing his battle with a previously unknown disease that was diagnosed at Washington University in St. Louis, a UDN clinical site.","date":"Tue May 17 22:21:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We owe an incredible amount of gratitude to those who have fought for the freedoms we hold dear, and we should all take a moment to reflect on the sacrifices these heroes and their families have made to defend our nation. https://t.co/KJ2xWTUuCB","date":"Tue May 17 21:07:33 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, the Senate unanimously passed my resolution with Sen. Hawley to designate May 1st as Silver Star Service Banner Day.","date":"Tue May 17 21:07:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Freeburg this afternoon to discuss the critical need to expand broadband to every corner of our state. Ending the digital divide will boost economic growth and improve the quality of life in towns and cities across Missouri. https://t.co/OERVT5ZaNe","date":"Sun May 15 00:44:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to be in Maries County today to talk with community leaders about rural broadband. The pandemic underscored just how important it is to ensure every Missourian has access to broadband and the opportunities it provides. https://t.co/kMWZDqndI5","date":"Sat May 14 22:33:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Proud of the cutting-edge research coming out of @WUSTLMed. Met today with @WashUChancellor and Dean Perlmutter to talk about the latest work by the McDonnell Genome Institute and #WashUMed’s recent grant, which will provide resources to conduct clinical &amp; translational research. https://t.co/77r3iemoKs","date":"Sat May 14 00:49:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to be a part of the ceremonial groundbreaking for a new Sensitive Compartmented Information Facility at the Globe Building. This state-of-the-art security facility will strengthen St. Louis’s role as a leader in geospatial intelligence. https://t.co/lJujQkFeo9","date":"Fri May 13 23:26:43 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I questioned representatives from @WFP, @AfDB_Group, and @mercycorps about the impact of Putin’s war against Ukraine on global food supply and food prices. https://t.co/nlzvPX2H7G","date":"Thu May 12 21:15:36 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m grateful for all the NRCS, North Central MO Regional Water Commission, Locust Creek Watershed District, &amp; other stakeholders have done to get us to this point. I’m committed to doing everything I can to ensure the federal resources are in place to complete the project.","date":"Thu May 12 18:59:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The East Locust Creek Reservoir will go a long way toward addressing the severe water shortages that have disrupted businesses and daily life in North Central MO.","date":"Thu May 12 18:59:53 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great news on the East Locust Creek Reservoir - @USDA_NRCS has signed a record of decision marking a huge step forward for the project: https://t.co/lkUbjYM99M","date":"Thu May 12 18:59:53 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is not “transitory.” Inflation is here to stay – and Americans are paying the price.","date":"Wed May 11 20:53:49 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Hardworking Americans have been squeezed by inflation for more than a year. \n\nhttps://t.co/o2CrwFu1d2","date":"Wed May 11 18:05:52 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Terrific to see @HonorFlightOZ back in D.C., visiting the memorials dedicated to their service. Thank you for all you’ve done for our grateful nation. https://t.co/BX7oQ6MaK5","date":"Wed May 11 16:50:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Inflation soars 8.3% in April, hovering near 40-year high” https://t.co/xBzEDVsZsP","date":"Wed May 11 16:03:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"As co-chair of the Senate Law Enforcement Caucus, thank you for your service and the sacrifices you and your family make every day. #PoliceWeek","date":"Wed May 11 14:44:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every time a law enforcement officer reports for work, they don't know what dangers they may face. We owe these brave men and women a deep debt of gratitude for putting others’ safety above their own. https://t.co/zVdQ97bRSE","date":"Wed May 11 14:44:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I asked @SecVilsack for an update on the @USDA_ERS &amp; @USDA_NIFA relocation to #KCMO &amp; discussed with him the administration’s efforts to address the threat to global food supply caused by Putin’s invasion of Ukraine. https://t.co/ubTvrw09ER","date":"Tue May 10 21:04:33 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Gallup poll ⤵️​\n\"Americans are more likely today than they were a year ago to report being 'very' or 'moderately worried' about several aspects of their finances\"\nhttps://t.co/Ls35GbRSkf","date":"Tue May 10 18:52:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today I questioned @SecArmy &amp; @ArmyChiefStaff on\n•The need to restock U.S. weapons stockpiles\n•The impact of Army end strength cuts on military installations, including @fortleonardwood\n•How lessons learned from Russia’s invasion of Ukraine will inform future weapons systems https://t.co/8KlYYtxnUH","date":"Tue May 10 18:05:48 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Gas prices hit a NEW record high – $4.37 per gallon","date":"Tue May 10 16:53:58 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"It was great to welcome the Central Missouri Honor Flight to D.C. today. The memorials are testaments to their courage and sacrifice. Thank you for your service. https://t.co/tvIDPUtOlr","date":"Mon May 09 20:21:12 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden administration has continued overreaching COVID-19 mandates while lifting the Title 42 public health emergency order at the southern border. They can’t have it both ways. My statement at this week’s Labor/HHS hearing: https://t.co/5ltlBmqY0o","date":"Fri May 06 21:12:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From the crisis at the border, to sky high inflation &amp; energy prices, to contradictory COVID policies, the Biden administration agenda is taking us in the wrong direction. They need to change course. https://t.co/G7WYDtm5PL","date":"Thu May 05 21:59:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ “spend, spend, spend” policies are hurting America’s small businesses ⤵️\n\"Asked in March about expected business conditions over the next six months, a 48-year record high said they would be 'worse' than when they filled out the survey.\" https://t.co/kTBy0vTZ3d","date":"Thu May 05 19:10:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"At yesterday’s Defense Appropriations Subcommittee hearing, I questioned @SecDef &amp; @thejointstaff Chairman General Mark Milley about inflation impacting the defense budget, aid to Ukraine, and future defense challenges. https://t.co/Y8Qn31y2kT","date":"Wed May 04 21:26:55 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"May is #MentalHealthAwarenessMonth. In recent years, we’ve made incredible progress in treating mental health like all other health. There is more work to be done but momentum is on our side.","date":"Wed May 04 20:44:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Small businesses are the backbone of our workforce in Missouri and across the country. During my time in Congress, I've been proud to back legislation that helps small businesses grow and create jobs. #SmallBusinessWeek https://t.co/rlY886HxHh","date":"Wed May 04 17:34:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the past 7 years, I’ve been proud to support a nearly 40% increase for @theNCI research. Maintaining a pattern of increased federal investment in medical research is how we'll tailor effective treatments to each patient and find new cures.","date":"Tue May 03 21:38:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"May is Brain Cancer Awareness Month. Today, @NBTStweets rallied brain cancer advocates from Missouri and across the country to share why they are part of #head2hill &amp; to make the case for cancer research funding.","date":"Tue May 03 21:38:12 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Putin’s ongoing invasion of Ukraine is a major threat to global food supply. Ukraine produces a significant amount of the world's wheat, corn, and sunflower oil, and current disruptions to exports and planting are driving up costs and increasing food insecurity around the world. https://t.co/WxeHJN0qYt","date":"Tue May 03 21:24:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri’s travel &amp; tourism industry supports hundreds of thousands of jobs and contributes billions to our economy. I’ll keep advocating for policies that will help bring more visitors to attractions, restaurants, &amp; hotels in MO &amp; nationwide. The #FutureOfTravel is now. #NTTW22","date":"Mon May 02 19:52:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"May is #MilitaryAppreciationMonth. We could not be the free country we are without the countless sacrifices our servicemembers, and their families, have made on our behalf. Thank you to our Soldiers, Airmen, Marines, and Sailors for all you have done to keep our nation safe. https://t.co/KDlpuQCZQr","date":"Mon May 02 19:02:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/gyS2TXhRtc","date":"Mon May 02 17:06:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This weekend, @USMC Sgt. Johanny Rosario Pichardo, one of 13 Marines killed in the attack outside the Kabul airport, received a posthumous degree from @ColumbiaColg. Sgt. Pichardo’s patriotism, dedication to helping others, and courage will not be forgotten.","date":"Mon May 02 17:06:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I partnered with Sen. @TimKaine and @RepCleaver on a bill directing the @USTreasury to mint a coin to commemorate the Centennial of Negro Leagues Baseball. This bill was signed into law in 2020.https://t.co/Wtk4XGWoc4","date":"Fri Apr 29 14:18:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always great to see @NLBMPrez. It’s been an exciting week for the Negro Leagues Baseball Museum – the @USTreasury commemorative coins celebrating the impact of the Negro Leagues on American culture and honoring the leagues’ players went on sale. https://t.co/pQOahYmogt","date":"Fri Apr 29 14:18:07 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, we visited the Carol Coe Bridge of Opportunity together to talk about her mom’s incredible legacy and the future of the 18th and Vine District. https://t.co/uPaP6IKtAz","date":"Fri Apr 29 00:17:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Carol Coe was a fierce advocate for the KC community and it was an honor to call her a good friend. I’ve been fortunate to have her daughter, Ailey, on my team for several years.","date":"Fri Apr 29 00:17:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to speak at the Agricultural Business Council of Kansas City Luncheon today. As the son of dairy farmers, I’ve worked to ensure Missouri farmers and ranchers have the tools they need to feed and fuel the world. https://t.co/Kt6TnmjdO6","date":"Thu Apr 28 22:42:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Met with Esther George, president and CEO of the Federal Reserve Bank of Kansas City, to tour the bank and see the newly-minted Negro Leagues Baseball Coins. https://t.co/mn4rTN6uct","date":"Thu Apr 28 20:02:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today’s GDP report “marked the worst performance since the spring of 2020, when the U.S. economy was still deep in the throes of the COVID-induced recession.” https://t.co/gp8kiOtY81","date":"Thu Apr 28 18:25:48 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to be a part of @CapitolHistory’s event celebrating the 200th birthday of President Ulysses S Grant – one of our greatest presidents.\n\nhttps://t.co/RDsG1mr2mZ https://t.co/bU4x3cY2Yi","date":"Tue Apr 26 22:58:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"First Democrats said their spending spree wouldn’t cause inflation. Then they said it’s just temporary. Now that it’s clearly here to stay, they claim more spending is the answer.\n\nWith three strikes on an issue this big, you should be out. https://t.co/6HRXhbwrM9","date":"Tue Apr 26 22:23:25 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation was at 1.4% when President Biden took office. Thanks in large part to Democrats’ reckless spending, it has soared to a 40-year-high of 8.5%. https://t.co/03zq9Axej9","date":"Tue Apr 26 22:22:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, Sen. Hawley and I introduced a resolution to honor Corporal Cooper, Officer Reed, and Officer Burns. We are grateful they answered the call to serve and we owe a deep debt of gratitude to their families. https://t.co/i0JMEExyyN","date":"Tue Apr 26 22:11:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Exciting to see the newly struck coins commemorating the 100th anniversary of the Negro Leagues. https://t.co/yOSs08hu1c","date":"Tue Apr 26 20:53:44 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The South Loop Link Project “will transform downtown by connecting the Central Business District with the Crossroads Art District by creating a cap over I-670.”\nhttps://t.co/BkSzRQOHH1","date":"Tue Apr 26 20:13:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to see @KCIAirport’s latest development on the new terminal. When it opens, the new terminal is set to be the largest all-glass boarding bridge operator in the U.S. https://t.co/b7Z0aNA4DS","date":"Tue Apr 26 16:44:34 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In recent weeks, three of Missouri’s finest lost their lives in the line of duty. I'm introducing a resolution with Senator Hawley to honor these heroes, whose selfless dedication is a powerful testament to their courage and character. https://t.co/0gK4nFVTem","date":"Mon Apr 25 20:20:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, I joined @PamelaBrownCNN to share insights from my recent congressional delegation trip to Europe and the Ukrainian border &amp; spoke about the impact of the war on China's future territorial ambitions. https://t.co/ldrBfpDW7S","date":"Mon Apr 25 20:05:56 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, I met with leadership from @UMKCMedSchool &amp; the School of Dentistry. We talked about their plans to provide greater access to care for more Missourians &amp; expand graduating class sizes, which would provide more physicians and dentists throughout our state. https://t.co/vEKUSjQA9O","date":"Fri Apr 22 18:01:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Kansas City is already a great place to live, work, and visit, and the South Loop Link project will make it even better.","date":"Fri Apr 22 17:24:53 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Exciting announcement today on the South Loop Link Project – the proposal would create a 5.5 acre site on the south side of KC’s Central Business District. This project would prioritize park space, spur investment, and put KC in a terrific spot for continued growth. https://t.co/ERSVuW9ie3","date":"Fri Apr 22 17:22:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last night, I joined @BretBaier to share insights from my congressional delegation trip to Europe and the Ukrainian border last week. https://t.co/Bed1YOL26o","date":"Tue Apr 19 18:07:57 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"More than a year ago, Larry Summers, economic adviser to Presidents Clinton &amp; Obama, warned that Democrats' reckless spending spree could “set off inflationary pressures of a kind we have not seen in a generation.”\nHe was right ➡️ inflation hit a new 40-year high in March.","date":"Mon Apr 18 21:01:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Appreciated the opportunity to visit with Missouri servicemembers in Poland. I’m grateful for the important work they’re doing, and for all of the military men and women who are away from their families serving our country. https://t.co/14dvgDKjQr","date":"Mon Apr 18 18:08:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wishing you and your family a happy Easter https://t.co/Me3ufcq5Re","date":"Sun Apr 17 12:02:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act would help preserve our nation’s wildlife for generations by funding conservation efforts. Last week, this landmark legislation passed out of committee – one step closer to the finish line. Let’s get this bipartisan bill signed into law.","date":"Thu Apr 14 21:24:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Almost a year ago, the Biden administration claimed inflation was “transitory.” This week, inflation reached yet another record high.","date":"Thu Apr 14 20:42:34 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act is now one step closer to becoming law. My bipartisan bill with Sen. @MartinHeinrich would make the largest, most significant investment in wildlife and habitat conservation in a generation. https://t.co/wB8ykjGaKN","date":"Thu Apr 14 19:21:30 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Nearly a year ago: Democrats claimed inflation was “transitory.” \n\nNow: “Inflation surges 8.5% in March, hitting a new 40-year high”\n\nhttps://t.co/UpcnyFw5mC","date":"Thu Apr 14 15:12:02 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, GOP members of the Senate Intel Committee urged the Biden administration to increase intelligence sharing with Ukraine. https://t.co/PCcKAFdRun","date":"Wed Apr 13 18:20:37 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"First responders face incredibly dangerous &amp; stressful situations every day. As a mental health advocate &amp; co-chair of the Senate Law Enforcement Caucus, I was proud to help introduce this bill to establish mental health programs tailored to the unique needs of first responders. https://t.co/ZRzLzSEAVb","date":"Fri Apr 08 20:03:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"A critical piece of environmental legislation, championed by U.S. Sens. Roy Blunt, R-Mo., and Martin Heinrich, D-N.M., came 'one huge step closer' to changing the way Missouri and other states protect wildlife.\"\nhttps://t.co/qxd3ALEzbX","date":"Fri Apr 08 19:02:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KFVSNews: Senator Blunt, colleagues introduce bill to help first responders with stress caused by intense work\nhttps://t.co/ZWb7ajca7Z","date":"Fri Apr 08 17:53:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I joined @SenJohnThune &amp; 9 of our GOP Senate colleagues in sending a letter to the WH pressing the president on his administration’s attempt to use the financial regulatory system to advance an extreme environmental agenda, putting the ag industry at risk https://t.co/ayfksjR3zE","date":"Fri Apr 08 16:48:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America's Wildlife Act, landmark conservation legislation, is one step closer to becoming law.\n\nMy bill with Sen. @MartinHeinrich would be the most significant investment in wildlife conservation in a generation.\nhttps://t.co/wB8ykjGaKN","date":"Fri Apr 08 15:08:55 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m encouraged by the strong, bipartisan, and growing support for the Recovering America’s Wildlife Act. Great to see it pass out of the EPW Committee today, and I look forward to working with my colleagues to get this bill to the president’s desk. https://t.co/wB8ykjGaKN","date":"Thu Apr 07 21:33:07 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Since Sen. @MartinHeinrich and I introduced #RAWA, it has gained great momentum:\n▶️32 bipartisan sponsors and cosponsors\n▶️Backed by over 60 Tribes and 1,500 organizations\nNow our bill is out of committee &amp; closer to becoming law","date":"Thu Apr 07 20:53:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨Recovering America’s Wildlife Act passes out of committee 🚨\n#RAWA would establish a new program – the Wildlife Conservation and Restoration Program – within the @USFWS to promote voluntary conservation efforts to restore and protect at-risk, threatened, or endangered species.","date":"Thu Apr 07 20:13:04 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great news, EPW advanced #RAWA! Sen. @MartinHeinrich &amp; I introduced this bill that would\n✅Boost our economy\n✅Create more outdoor recreation opportunities\n✅Conserve our natural heritage for future generations","date":"Thu Apr 07 18:54:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Recovering America’s Wildlife Act would invest in proactive, on-the-ground conservation work led by states, territories, and Tribal nations to support the long-term health of fish and wildlife habitat all across America.","date":"Thu Apr 07 14:02:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We can better protect our land, waterways, &amp; wildlife by encouraging states, territories, &amp; Tribes to make significant contributions to voluntary conservation efforts. #RAWA would help preserve our nation’s wildlife for future generations.","date":"Thu Apr 07 13:41:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America's Wildlife Act would be the most significant investment in wildlife conservation in a generation. Here’s what that would mean for Missouri and across the country:\n\nhttps://t.co/gAweO8Hlck","date":"Wed Apr 06 22:07:14 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always enjoy getting a chance to meet with students from Missouri and talk about the incredible history of our Capitol. https://t.co/t3sgKXgPeZ","date":"Wed Apr 06 21:39:38 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act would help preserve our nation’s wildlife for generations by funding conservation efforts for more than 12,000 species of wildlife and plants in need of assistance.","date":"Wed Apr 06 21:32:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats' misguided economic policies are hurting Americans.\n\n\"While inflation is rising everywhere, price hikes are particularly devastating to lower-income households with already tight budgets.\"\n\nhttps://t.co/2pf5h4b5Cp","date":"Wed Apr 06 20:59:04 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Passing on our natural heritage and traditions like hunting, fishing, and wildlife watching to our kids means we need to protect and restore wildlife now. https://t.co/pNx1O7mpOX","date":"Wed Apr 06 19:43:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act I introduced with Sen. @MartinHeinrich has significant bipartisan support – because #RAWA offers a constructive path forward to protect America’s fish and wildlife habitat.","date":"Wed Apr 06 19:08:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to see @VisitKC this morning at @USTravel’s conference. It’s an exciting time for tourism in KC – from the NFL Draft to hopefully the World Cup https://t.co/e5uIpyzNV1","date":"Wed Apr 06 18:37:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"America’s travel industry creates jobs, grows businesses, and bolsters our economy. Thank you to @USTravel for being a terrific partner over the years in our efforts to strengthen America’s travel industry. https://t.co/RTculJDDv0","date":"Wed Apr 06 18:37:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri has some of the best hunting, fishing, and outdoor recreation in the country. We owe it to our kids and their kids to recover our wildlife. #RAWA would do just that.","date":"Wed Apr 06 18:22:57 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Joined @SquawkCNBC to discuss the latest on Ukraine, the crisis at the southern border, COVID funding, &amp; inflation. https://t.co/8a1oZUsHQi","date":"Wed Apr 06 17:48:49 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you, @SenCapito, for supporting the Recovering America's Wildlife Act. This bill would be the largest, most significant investment in wildlife conservation in a generation.","date":"Wed Apr 06 16:28:52 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to @SenatorCarper for all your support in bringing the Recovering America’s Wildlife Act in front of the Committee on Environment &amp; Public Works. Its strong bipartisan backing demonstrates how vital protecting &amp; conserving our natural heritage is across the country.","date":"Wed Apr 06 15:31:53 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ “spend, spend, spend” policies are the problem, not the solution to record-high inflation.","date":"Tue Apr 05 22:32:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Protecting and restoring wildlife habitat is critical if we want to pass on traditions like hunting, fishing, and wildlife watching. The Recovering America’s Wildlife Act makes historic investments for future generations.","date":"Tue Apr 05 21:55:18 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The impact of Democrats' reckless spending ⤵️\n\"American consumers are starting to cut costs on mainstays from toothpaste to baby formula as inflation hits a swath of the economy that had thus far proven resistant to substantial price increases.\" https://t.co/MsLQOfQQOl","date":"Tue Apr 05 20:16:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with @NBWA members from Missouri and discuss how we can work together to further strengthen Missouri’s beer industry, which supports thousands of jobs and contributes billions of dollars to our state’s economy. https://t.co/EVR7KYpJek","date":"Tue Apr 05 17:30:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last year, Dems forced through a partisan, $1.9T spending bill when our economy was well on the way to recovery. Even liberal economists warned it would fuel inflation and it has, sticking Americans with higher costs on the things they need every day. https://t.co/GRa1Uckfw4","date":"Sun Apr 03 17:26:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"While I will vote no on Judge Jackson’s confirmation, I believe her historic nomination is a proud moment for our country. More from my interview on @ThisWeekABC with @GStephanopoulos: https://t.co/GRa1Uc2EEw","date":"Sun Apr 03 15:26:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"There is no doubt Judge Ketanji Brown Jackson is well qualified to serve on the Supreme Court. However, her judicial philosophy is not one I can support.","date":"Sun Apr 03 15:26:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"With every Supreme Court nomination, I look at two things: (1) is the nominee qualified; and (2) are they guided by a judicial philosophy that a judge ought to apply the law and the Constitution as they are written.","date":"Sun Apr 03 15:26:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks to the @HCCGKC for meeting with me today. We spoke about a number of topics, including growing opportunities for Hispanic-owned businesses. https://t.co/bVxVdsayhM","date":"Thu Mar 31 21:03:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“An inflation gauge that is closely monitored by the Federal Reserve jumped 6.4% in February compared with a year ago, with sharply higher prices for food, gasoline and other necessities squeezing Americans’ finances.” https://t.co/fRqXaZ3WMP","date":"Thu Mar 31 20:13:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always great to see Mayor Weir and discuss how we can work together to advance Independence’s infrastructure priorities. https://t.co/foDIYoWlhl","date":"Thu Mar 31 20:02:52 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Blunt: “Give Ukraine what they need, when they need it”\nhttps://t.co/sdvDgzdmjW","date":"Thu Mar 31 18:12:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I sat down today with Col. Rayfield from @KC_USACE to discuss the Lower Missouri Risk Resiliency Study and how Congress can support vital flood control and navigation projects. https://t.co/II7S7qUoRI","date":"Wed Mar 30 22:34:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation and high gas prices are hurting hardworking Americans. President Biden’s proposed budget would continue Democrats’ spending spree – causing more problems instead of solving them.","date":"Wed Mar 30 21:44:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with @NAICC1978 this morning to talk about the future of agriculture and their legislative priorities. https://t.co/q6Tg8Sbr7H","date":"Wed Mar 30 21:21:03 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a strong advocate for NATO and the Baltics, I urge my colleagues to support this bill and other efforts to further unify the U.S. and our allies against authoritarian nations that seek to undermine democracy around the world. https://t.co/pMw3LZU1B3","date":"Wed Mar 30 21:06:50 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I helped introduce a bipartisan bill to enhance our nation’s military and economic ties with the Baltics, strengthening our steadfast defensive military commitment to them at this critical moment.","date":"Wed Mar 30 21:06:50 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was honored to host American Friends of Lubavitch in the Kennedy Caucus Room this morning and commend Chabad for all they do to strengthen Jewish life in the U.S. and worldwide. https://t.co/ks2S6PGcMA","date":"Wed Mar 30 19:11:33 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The commitment of Johnny Morris and Bass Pro Shops to preserving wildlife for generations to learn from and enjoy has had a profound impact not only in Missouri but across our country. Congratulations to the Bass Pro family on 50 terrific years. https://t.co/D5jvLegkRn","date":"Wed Mar 30 17:11:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @ABC17News: Sen. Roy Blunt talks broadband and economy at local bakery in Boonville \nhttps://t.co/2gL7INatNs","date":"Tue Mar 29 21:59:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to see @GovParsonMO and @FirstLadyTeresa today and share all the Missouri history we’re lucky to have in the office. Of course, no tour is complete without visiting the room where President Truman worked when he served in the Senate and as vice president. https://t.co/5yw6zKfFnk","date":"Tue Mar 29 21:32:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Ukraine’s resistance against Vladimir Putin’s invasion has been incredible. They are sending a clear message to the world that freedom is absolutely worth fighting for. The U.S. needs to quickly get Ukraine what it needs to defend itself. https://t.co/ODmLzk4vIP","date":"Tue Mar 29 20:52:17 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Rural Americans need a broadband connection to access the same opportunities as Americans living in urban areas. Rural broadband has also become essential to modern agriculture, enabling farmers and ranchers to become more efficient, economical, and environmentally friendly.","date":"Sat Mar 26 17:44:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Tipton today to speak with Como Connect, the local energy cooperative, about the critical need to expand access to broadband. During the pandemic, we saw how high speed internet is more important than ever, especially for rural areas. https://t.co/cqO6Ung14m","date":"Sat Mar 26 17:44:50 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with Morgan County Farm Bureau members and community leaders. At our roundtable, we talked about how inflation and the rising costs of energy and ag inputs are impacting farmers and ranchers https://t.co/EtWyTdB00m","date":"Sat Mar 26 16:58:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation hit a 40-year high in February and prices have jumped since last year on almost everything.","date":"Sat Mar 26 16:58:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to join @MOStateAg Forum again to talk about policies impacting Missouri farmers and ranchers. From expanding access to broadband to investing in ag research, I've made enacting policies that will help the #MOag community thrive a top priority during my time in Congress. https://t.co/8iOeOUIRjB","date":"Sat Mar 26 13:07:34 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In Missouri, CCBHCs are:\n✔️Improving access to care\n✔️Reducing hospital and ER visits\n✔️Providing mental &amp; behavioral health support to local law enforcement","date":"Fri Mar 25 18:26:37 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@SenStabenow and I spoke on the floor this week to urge our colleagues to support our legislation to expand the Excellence in Mental Health Act nationwide.","date":"Fri Mar 25 18:26:36 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri and Michigan are both participating in the Excellence program which, combined with additional grant funding, has brought community-based mental and behavioral health care to around 1.5 million Americans.","date":"Fri Mar 25 18:26:36 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Giving every state the opportunity to participate in the Excellence program will build on that success and help more people get the care they need faster and closer to home. https://t.co/upuZSWi2Ze","date":"Fri Mar 25 18:26:36 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KQ2: UMKC to receive $15.5 million to improve rural health care access\nhttps://t.co/Y72J2D737O","date":"Fri Mar 25 17:37:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to see Brooks Miller and Dr. Pfannenstiel from @JordanValleyCHC. Their mission to provide more access to quality, affordable care has made a tremendous impact on Missourians. I’m proud to support their important work during my time in Congress. https://t.co/Tk7L87Ifgg","date":"Thu Mar 24 20:36:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to all those participating 👏 Investing in the next generation of ag leaders is how Missouri agriculture will continue to thrive","date":"Wed Mar 23 21:47:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"There are about 300 Ukrainian children who are waiting to join their American adoptive families or host families.","date":"Wed Mar 23 21:24:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I led a bipartisan group of my colleagues in urging @SecBlinken to take immediate action to unite these children with adoptive or host families in the U.S. \n\nhttps://t.co/lBP2VVTqKm","date":"Wed Mar 23 21:24:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always terrific to see Joe Pierle from @MOPrimaryCare and @TheBrentMcGinty from @MissouriBHC. I’m grateful for their partnership as we work to expand access to health care to more Missourians and treat behavioral and mental health like physical health. https://t.co/GyloRRNARX","date":"Wed Mar 23 21:09:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m grateful to have had the opportunity to hear her insight and perspective over the years.","date":"Wed Mar 23 19:59:02 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"She was incredibly involved in the Truman Scholarship Program and that sometimes led to a discussion of her working at the Rolla Daily News when her husband was stationed at Fort Leonard Wood.","date":"Wed Mar 23 19:59:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Only a couple of years ago, I was able to see how much she was respected by her former foreign minister colleagues when I spoke to them at a meeting they had at the Truman Library in Kansas City.","date":"Wed Mar 23 19:59:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Secretary Albright broke barriers and made a difference. After serving as Secretary of State, she continued to be an important voice in our foreign policy discussions.","date":"Wed Mar 23 19:59:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"#ALZ affects not only the person who has it but also their caregivers &amp; loved ones. During my time in Congress, I’ve prioritized research funding to #EndALZ. I met today with @alzassociation leadership to discuss how we can keep this momentum going toward new treatments &amp; a cure. https://t.co/ZX6oM48wBS","date":"Wed Mar 23 17:57:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to see Gary Porter from the Missouri Corn Growers Association to talk about their legislative priorities https://t.co/JL9r4x2b7L","date":"Wed Mar 23 15:50:25 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden admin needs to provide details on how it spent the $1.9T Democrats passed last year. Unspent funds from that bill should be repurposed to meet urgent COVID-related priorities. https://t.co/bTsMYV6mnh https://t.co/fkCosjYFtQ","date":"Tue Mar 22 22:12:17 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @NewsPressNow: With funding bill, dream of new C-130 takes flight https://t.co/A72WyZDJi3","date":"Tue Mar 22 20:18:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Agriculture is vital to the U.S. leading the way in an increasingly global economy. As the son of dairy farmers, I’m proud to support the men and women who move us forward.","date":"Tue Mar 22 18:50:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"On National #AgDay, thank you to all the Missouri farmers, ranchers, and producers who feed and fuel the world every day. https://t.co/NFFnPap8dz","date":"Tue Mar 22 17:19:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Maintaining safe, reliable, and efficient bus service in the St. Louis area is essential for people to get where they need to go. Glad that @USDOT is investing over $4 million in grant funding to help improve the local transit system: https://t.co/4gRljrAAZX","date":"Mon Mar 21 19:54:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri has lost another hero. Dustin Brandhorst rushed toward danger to keep others safe. I’m grateful for his service and thinking of his family and fellow firefighters.\nhttps://t.co/oyCkAteQSS","date":"Sat Mar 19 20:04:38 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Some of my favorite stories as Republican Whip in the House are about Don Young. Nobody represented their state better or with more determination than Don Young represented Alaska.","date":"Sat Mar 19 02:08:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Grateful for Officer Rick Hirshey’s service to the people of Joplin and wishing him a safe recovery. https://t.co/AYbitZuGxp","date":"Thu Mar 17 17:45:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Abby and I send our deepest condolences to his family and the Bonne Terre Police Department. Our thoughts are also with Corporal Garrett Worley who was injured and remains hospitalized.","date":"Thu Mar 17 16:13:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, Bonne Terre Police Officer Lane Burns tragically lost his life in the line of duty. Officer Burns’ fiancé said he loved being a police officer and he loved the department. Officer Burns lived a life of service and purpose in protecting those around him.","date":"Thu Mar 17 16:13:21 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri is the 4th largest producer of rice in the United States. Had a great discussion with members of the Rice Producers Association yesterday about ways to support growers across our state and ensure Missouri remains a leader in rice production. https://t.co/WtLGKYxkli","date":"Wed Mar 16 21:11:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Enjoyed visiting with Dr. Brian Henry and talking about the importance of Impact Aid, which has helped the Waynesville school district provide more opportunities for students to pursue a college or career of their choice. https://t.co/pSGIJTZLN3","date":"Wed Mar 16 20:45:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Fort Leonard Wood is incredibly important to our state, and it plays a key role in our nation’s defense. Enjoyed speaking with Major General Jim Bonner about making sure service members at FLW have the training and resources they need to carry out their mission. https://t.co/OxVgP1z1Pw","date":"Wed Mar 16 20:20:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"More daylight at the end of the day is better. Great to see that the Senate passed legislation to make Daylight Saving Time permanent, an important step to finally end the cycle of springing forward or falling back. #LockTheClock","date":"Wed Mar 16 19:54:38 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to meet with Mayor Tishaura Jones this week to discuss a wide range of issues important to #STL, including funding for NGA West, improving Lambert Int’l Airport, and ensuring access to safe drinking water. https://t.co/71IGC9s4eQ","date":"Wed Mar 16 19:24:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We had a good discussion on her background and judicial philosophy. I look forward to closely following her confirmation hearings and considering her nomination. https://t.co/rjX5dH0yFx","date":"Wed Mar 16 15:38:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I appreciated the opportunity to visit with Judge Ketanji Brown Jackson and congratulate her on her historic nomination to the Supreme Court. https://t.co/KlFNNWm9SC","date":"Wed Mar 16 15:38:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Relaxing sanctions on Iran – the world’s number-one state sponsor of terrorism - would be a dangerous mistake. This week, 49 Senate Republicans made it clear to the Biden admin: an Iran agreement without broad Congressional support will not survive. https://t.co/QiVJy2PPQd","date":"Tue Mar 15 13:23:30 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"At today’s Intel hearing, I questioned @CIA Director Burns, @FBI Director Wray &amp; @ODNIgov Director Haines about the China-Russia relationship &amp; China’s effort to obtain biodata. https://t.co/pKJOn9T7Vh","date":"Thu Mar 10 23:49:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"There is nothing more selfless, more heroic, and more honorable. We are grateful they answered the call to serve and we are forever indebted to their families.","date":"Thu Mar 10 23:26:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Abby and I are praying for Joplin Police Officer Jake Reed’s wife and family, his fellow officers, and the entire Joplin community. Officer Reed and Corporal Benjamin Cooper rushed toward danger, never hesitating to put the safety of others ahead of their own.","date":"Thu Mar 10 23:26:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I joined @SenatorWicker and 30 of our Senate colleagues in a letter to the Biden administration calling for an end to COVID-19 travel restrictions and mask mandates\nhttps://t.co/IagRhdevvf","date":"Thu Mar 10 21:38:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m also glad the legislation makes significant investments in Missouri’s world class ag research institutions as they work to develop new tools to help farmers lead the way in a global economy. https://t.co/EwGQtmrwap","date":"Thu Mar 10 20:02:27 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"A top priority for many businesses, local officials, and farmers in our state is the critical need to strengthen our infrastructure network, from roads and waterways to bridges and airports.","date":"Thu Mar 10 20:02:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"That’s why I’m pleased the FY22 funding legislation makes investments that will not only help modernize our infrastructure in the immediate future, but also create a stronger foundation for businesses in our state to compete and succeed for generations to come.","date":"Thu Mar 10 20:02:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"National average price of gas is $4.318 – the highest since 2008.\n\nInflation rate is at 7.9% – the highest in 40 years.\n\nAmericans are seeing their hard-earned paychecks rapidly disappear.","date":"Thu Mar 10 19:38:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Inflation rose 7.9% in February, as food and energy costs push prices to highest in more than 40 years” https://t.co/tloRL7nxpn","date":"Thu Mar 10 16:26:36 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The bill increases support for the investigation, treatment, and prosecution of child abuse cases. It supports improved coordination between local, state, and federal law enforcement to better combat major drug-trafficking organizations.","date":"Wed Mar 09 23:14:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We are grateful for all of the law enforcement officers and first responders, and their families, who face danger every day to keep others safe. https://t.co/8er9ihBNok","date":"Wed Mar 09 23:14:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s government funding bill invests in programs and policies to support police and fire departments, including grant programs that help departments purchase equipment, conduct training, and hire personnel.","date":"Wed Mar 09 23:14:42 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"With the surge in violent crime across the nation, it is more important than ever to ensure law enforcement personnel have the resources they need to keep our communities safe.","date":"Wed Mar 09 23:14:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"One of the most important responsibilities of the Congress is to ensure our military has the resources it needs to address the national security threats we face.","date":"Wed Mar 09 20:55:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s defense, military construction, and Veterans Affairs funding bills include investments that will strengthen MO’s role in our national defense, maintain the U.S. military’s strategic edge, and help keep our promises to veterans. https://t.co/mhmnvjp0LD","date":"Wed Mar 09 20:55:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Finally, this year’s bill continues to support the full range of pathways to college and to well-paying careers. This includes investments in career and technical education and the 5th consecutive increase in the maximum Pell Grant award. https://t.co/mUVgsPgXfx","date":"Wed Mar 09 19:10:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The pandemic has taken a huge toll on students’ education &amp; mental health. With students facing several months of learning loss, and historically underserved groups falling even further behind, the investments in this year’s education funding bill are more important than ever.","date":"Wed Mar 09 19:10:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Second, it prioritizes programs that provide the most flexibility to families, schools, and local school districts to decide how to best use limited resources.","date":"Wed Mar 09 19:10:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The bill continues to address one of the greatest challenges we’ve seen during the pandemic by increasing funding for Head Start and child care, building on the more than doubling of funding for the Child Care and Development Block Grant in recent years.","date":"Wed Mar 09 19:10:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’ll continue to be a strong advocate for programs that help prepare people for the jobs they need to get ahead.\nhttps://t.co/iq8LdUa0eP","date":"Wed Mar 09 17:49:07 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m proud to announce that the FY22 Labor/HHS bill includes funding for programs that have significantly benefited our state, whether it’s connecting veterans with employers through HIRE Vets or preparing workers for good-paying jobs through the Apprenticeship Program.","date":"Wed Mar 09 17:49:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday was a tragic reminder of the danger law enforcement officers face every time they report for duty. Corporal Benjamin Cooper made the ultimate sacrifice protecting the people of Joplin and we are forever grateful for his service.","date":"Wed Mar 09 17:06:49 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Abby and I are thinking of Corporal Cooper’s wife and daughters, loved ones, and the Joplin Police Department, especially the two officers who remain hospitalized. https://t.co/y6TPlnGrtT","date":"Wed Mar 09 17:06:49 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"To keep the momentum going, we need to continue a pattern of predictable increases in NIH funding. It’s one of the most important investments we can make. https://t.co/yp9RYeOM5k","date":"Wed Mar 09 16:53:12 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Initiatives like Operation Warp Speed and RADx allowed researchers to get more vaccines, therapeutics, and tests into the pipeline and accelerated the approval process while maintaining the highest safety and efficacy standards.","date":"Wed Mar 09 16:53:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We are on the verge of new medical breakthroughs, like precision medicine, that have the potential to fundamentally transform healthcare delivery in this country. And we've made tremendous progress toward treating mental health like all other health, but there is more work ahead.","date":"Wed Mar 09 16:53:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the past two years, researchers were able to develop multiple safe and effective vaccines, therapeutics, and tests for the novel COVID-19 virus faster than many thought possible. Our response benefited from federal agencies like NIH becoming a more active partner in R&amp;D.","date":"Wed Mar 09 16:53:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Now is the time to leverage the lessons we’ve learned and apply that knowledge to find new treatments and cures for diseases that impact millions of Americans.","date":"Wed Mar 09 16:53:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The bill includes critical funding to help the U.S. remain a leader in life-saving medical research. It supports research and development for new treatments and cures for the nation’s most costly and deadly diseases, like cancer, Alzheimer’s, and more.","date":"Wed Mar 09 16:53:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s Labor/HHS funding provides the 7th major, consecutive @NIH funding increase, bringing the total increase to just over 50% during my time as the top Republican on the subcommittee.","date":"Wed Mar 09 16:53:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"A sad day for the Joplin Police Department and the City of Joplin. I’ll continue monitoring this situation as we learn more. Thinking of the officers' families, loved ones, and colleagues. https://t.co/b0Dl56GcMu","date":"Tue Mar 08 22:27:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"For example, they are obstructing the sale of a MO-based, family-owned business based on the mistaken assumption that the company doesn’t face competition from Internet giants like Amazon and other big box retailers.","date":"Thu Mar 03 21:51:25 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s totally inaccurate, it’s insulting to rural Missourians, and it puts local jobs at risk. More here: https://t.co/2EYcwKgVk4","date":"Thu Mar 03 21:51:25 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today I announced that I’m putting a hold on the nomination of Alvaro Bedoya to serve on the Federal Trade Commission. The FTC has not been responsive to concerns I’ve raised about their failure to recognize the competitive pressures faced by rural businesses.","date":"Thu Mar 03 21:51:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last week, @SenStabenow and I received the Excellence in Mental Health Award from @MissouriBHC. I appreciate @SenStabenow and @thebrentmcginty’s leadership on this issue, and I look forward to continuing our work to help people get quality, affordable care close to home.","date":"Thu Mar 03 17:33:57 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Nearly one in five Americans are living with a diagnosable, and almost always treatable, mental health issue. During my time in the Senate, one of my top priorities has been improving and expanding access to mental and behavioral health treatment. https://t.co/6YIxugffBp","date":"Thu Mar 03 17:33:57 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to receive @MPUAOnline Public Service award. Thank you for your partnership during my time in Congress and your dedication to strengthening communities across Missouri. https://t.co/niojPyJ0Jy","date":"Wed Mar 02 20:51:04 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with @MissouriSoybean Association this morning to discuss their legislative priorities, like extending the biodiesel tax credit. https://t.co/VbsS2ZoanY","date":"Wed Mar 02 19:50:10 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"#TheHillALZ LIVE: Discussing why research is critical to #EndALZ https://t.co/h8Nyj76luQ","date":"Wed Mar 02 19:23:28 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to see Mark Gordon and members of the @MOBroadcasters today. Thank you for the update on all the work you’re doing to make sure Missourians in every part of our state have local information that’s important to them https://t.co/XQBmpdNstg","date":"Tue Mar 01 21:48:21 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@139AW plays a significant role in providing for a strong national defense &amp; it is critical, now more than ever, that we continue investing in Rosecrans.  https://t.co/NOEp5P5bwo","date":"Tue Mar 01 20:58:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I met with Missouri rice growers this morning to talk about their legislative priorities, including farm bill programs and rolling back the harmful WOTUS rule. https://t.co/vZeWP7JRAE","date":"Tue Mar 01 20:23:37 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @1310kzrg: Blunt introduces legislation to ban use of facial recognition technology at IRS\nhttps://t.co/XAtuxGyHIk","date":"Tue Mar 01 17:57:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@SenJeffMerkley and I have introduced legislation to protect taxpayers’ privacy and security by permanently banning the IRS from using biometric recognition technology https://t.co/enowl4G5gs","date":"Mon Feb 28 21:06:37 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"His tireless efforts for those who defend us and his incredible outreach to African nations that others often ignore will be two of the great hallmarks of his service. I look forward to his continued leadership this Congress.","date":"Fri Feb 25 22:05:25 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"No one has worked harder in support of the American military than Jim Inhofe.","date":"Fri Feb 25 22:05:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to speak this morning at @WilliamJewell’s convocation ceremony. William Jewell has a long history of educating innovators and thought leaders and I know today's students will carry on that proud legacy. https://t.co/cxrtahwULQ","date":"Fri Feb 25 21:16:12 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"For almost eight decades, Western Europe has been a united force with U.S. leadership. It’s important that our newest NATO allies understand our steadfast defensive military commitment to them at this critical moment.","date":"Thu Feb 24 18:19:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"That includes crippling economic sanctions and direct support for Ukraine. A failure to act forcefully will only embolden Russia and other authoritarian nations that seek to undermine peace and democracy around the world.","date":"Thu Feb 24 18:19:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vladimir Putin’s invasion of Ukraine is an assault against democracy and a destabilizing threat to all of Europe with worldwide ramifications. Our adversaries and allies alike are watching how we respond. We must work with our allied nations to hold Russia accountable.","date":"Thu Feb 24 18:19:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, @DeltaRegional announced it will invest $2.3 million to help improve the quality of life and boost jobs across Missouri. I’ll keep supporting DRA’s important work to ensure our rural communities have the resources they need to compete &amp; succeed https://t.co/kiqk3GOmo6","date":"Wed Feb 23 21:05:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, I spoke to the Missouri House of Representatives about the significant progress our state has made on important issues like expanding rural broadband, increasing access to mental health services, and modernizing our infrastructure. https://t.co/Z3HcwSihgP","date":"Wed Feb 23 20:34:52 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Had a great talk with local leaders in Hermann about the importance of transportation infrastructure and rural broadband. Missouri’s greatest competitive advantage is where we live. By investing in rural development and waterways, we’ll strengthen that advantage for years to come https://t.co/32fxKr3D8w","date":"Wed Feb 23 19:09:58 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Heading to the Missouri Capitol to address the House of Representatives at 10 am. Tune in here: https://t.co/ssqSFskGY8","date":"Wed Feb 23 15:57:39 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Surging inflation is likely costing hardworking Americans an extra $276 a month https://t.co/8KwN3n78Ig","date":"Wed Feb 16 19:36:52 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The average U.S. household is spending an additional $276 a month because of inflation that is rising at its fastest rate in 40 years, a new economic analysis showed.” https://t.co/lcvpj20EO1","date":"Tue Feb 15 23:37:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I joined @SenatorRisch to introduce the #NYETAct to provide much-needed support to Ukraine and to hold Russia accountable before an invasion takes place. https://t.co/azENIebz0d","date":"Tue Feb 15 23:07:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is hurting Americans ⤵️\n“Wholesale prices accelerated again in January as strong consumer demand and pandemic-related supply-chain snarls continued to fuel the highest inflation in decades.”\nhttps://t.co/j9BypFpns5","date":"Tue Feb 15 22:41:20 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I met with Missouri county commissioners today to talk about funding from the bipartisan Infrastructure Investment and Jobs Act that will help improve the safety and reliability of our state’s roads, highways, ports, waterways, and airports. https://t.co/nUcpnxt7dc","date":"Tue Feb 15 20:48:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ misguided policies have led to a 40-year high inflation rate.\n\nhttps://t.co/dOALJYxQbj","date":"Tue Feb 15 18:44:58 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every day, first responders put our needs ahead of their own. I had the opportunity today to thank the first responders of Warrenton Fire Protection District for all they’ve done, and continue to do, to keep their community safe. https://t.co/l86ERnXEOO","date":"Sat Feb 12 20:16:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Winfield this morning to meet with U.S. Army Corps of Engineers and get an update on Lock and Dam #25. Last month, USACE announced that $732 million will be used to modernize Lock and Dam #25 – including construction of a new 1,200 foot lock. https://t.co/7FQhNkOimK","date":"Sat Feb 12 18:16:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"With more than 100,000 lives lost to drug overdoses in the last year, it is shocking to believe that HHS would allow U.S. taxpayer funding to be used for such an expense. Read our full letter: https://t.co/kAbmxYrKbC","date":"Thu Feb 10 23:04:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"For more than 30 years, Congress has passed annual funding bills explicitly prohibiting federal funds from being used to purchase needles or syringes for injection of any illegal drug.","date":"Thu Feb 10 23:04:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":".@SenatorCollins, @Sen_JoeManchin, and I are seeking answers about an HHS policy that could allow taxpayer dollars to be used for purchasing and distributing drug paraphernalia – like needles and pipes for using crack cocaine, crystal meth, and heroin.","date":"Thu Feb 10 23:04:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"@TimShriver @SpecialOlympics .@SpecialOlympics is an organization my family and I care deeply about. @TimShriver, it's been an honor to work together to support Special Olympics’ mission and all of the incredible athletes who continue to inspire us all with their strength and determination.","date":"Thu Feb 10 21:26:33 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"There is an alarming shortage of police officers across our country. We owe so much to our law enforcement officers for the difficult, dangerous, and demanding work they do to keep communities safe. https://t.co/zBDNjMcqsV","date":"Thu Feb 10 19:32:18 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I questioned @GigiBSohnFCC about previously undisclosed info re: the Locast settlement and more https://t.co/dOgbnJ8p3h","date":"Wed Feb 09 22:07:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet today with Missouri college presidents &amp; deans. As a former university president, I know how difficult that job can be. Thank you for all you do for your students, it’s an honor to work together to put higher ed within reach for more Missourians. https://t.co/2aIEq0pXZq","date":"Tue Feb 08 23:02:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"There's an alarming number of officer vacancies at police departments across the U.S.\n \nPolice officers face dangerous situations &amp; serious challenges every day. Now, departments are struggling w/ staffing shortages caused by record-high departures &amp; difficulty filling positions. https://t.co/QNU1QdX4eT","date":"Tue Feb 08 22:51:35 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I had a terrific conversation today with presidents of community colleges around Missouri. We talked about how vital year-round Pell Grants are to help more people realize their dream of a higher ed diploma &amp; how apprenticeships can lead to great career opportunities. https://t.co/A6Vkc2oUyy","date":"Tue Feb 08 22:44:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Raising the maximum Pell Grant award, reinstating Pell year-round, and investing in TRIO programs have all helped non-traditional students complete their program or degree and graduate with less debt.","date":"Tue Feb 08 21:54:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"As the first person in my family to graduate from college, I was honored to receive the Henry Paley Award from @NAICUtweets. Getting my diploma opened many doors for me &amp; throughout my time in Congress, I’ve worked to keep those doors open for more first generation students. https://t.co/Uv9dzROAyT","date":"Tue Feb 08 21:54:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Homeownership is an important financial building block. My legislation with @SenatorHassan would help make homeownership a reality for more hardworking Americans by expanding mortgage interest tax relief and making it permanent. https://t.co/VYszLGhz86","date":"Mon Feb 07 22:37:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is the predictable result of the Biden administration abandoning effective border control strategies put in place under the previous administration, like halting construction of physical barriers and ending the “Remain in Mexico” policy.","date":"Thu Feb 03 20:50:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The situation on the southern border is out of control. More than 2 million people were apprehended trying to cross the border last year – nearly four times the amount encountered in the previous year. https://t.co/iLhEiIR1Mq","date":"Thu Feb 03 20:50:20 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The NLBM does a terrific job of telling the stories of the baseball players who broke down the barriers of segregation. Always top of my list of places to go in KC.","date":"Wed Feb 02 22:54:59 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are seeing skyrocketing prices at the grocery store and the gas pump.\n\nBut instead of working to fix these problems, Democrats are doubling down on their misguided policies that got us here in the first place.","date":"Wed Feb 02 21:39:55 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Surging inflation. \nEmpty store shelves. \nHigh gas prices. \n\nThese are just some of the problems we’re currently facing. But Democrats are still pushing their reckless tax-and-spend spree – which would cause more problems, not solve them.","date":"Wed Feb 02 17:34:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In March, Democrats passed a partisan $1.9 trillion spending bill despite the economic recovery that was already well underway. \n \nDemocrats continue to push their reckless tax-and-spend spree that would cause more harm to American families. https://t.co/0C6ZzjtSBy","date":"Tue Feb 01 22:28:03 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In just one year of the Biden administration’s misguided policies, Americans are facing the highest inflation in 40 years. Yet, instead of addressing this serious problem, Democrats are once again pushing their reckless tax-and-spend spree.","date":"Tue Feb 01 22:13:55 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Operation Warp Speed delivered three safe &amp; effective COVID-19 vaccines in record time because of its innovative approach. Now is the time to build upon that success. https://t.co/RxmX3Ofp6q","date":"Tue Feb 01 19:40:20 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This month, we celebrate the countless contributions African Americans have made to our country. #BlackHistoryMonth https://t.co/qUsxuknSPz","date":"Tue Feb 01 17:16:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"As an election official for 20 years, I know the diversity of our election system is one of its greatest strengths. Forcing a one-size-fits-all approach on more than 10,000 jurisdictions across the country would make the system less secure. https://t.co/ocdf1byDFo","date":"Thu Jan 27 19:48:27 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was at the Greene County Courthouse today talking about the recent Senate debate on election legislation. Last week, Senate Democrats failed to pass a 735-page partisan election bill that would have federalized our election system.","date":"Thu Jan 27 19:47:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"On this day, men, women, and children were liberated from the horrors at Auschwitz-Birkenau. Today, on International #HolocaustRemembranceDay, we honor and #WeRemember the victims and survivors of the Holocaust. https://t.co/GscF8cOr6u","date":"Thu Jan 27 19:05:22 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, @JerryMoran and I led 14 Republican senators in demanding @HHSgov reverse its biased, partial, and unjust national liver allocation policy. https://t.co/nzOvoFkZ60","date":"Tue Jan 25 20:04:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"With 29 years on the job, @CityofFestus Fire Department Chief Kevin Cremer was dedicated to protecting the communities he served. Thinking of his wife, children, grandchildren, and the Festus Fire Department during this difficult time. https://t.co/1DYLevdUgJ","date":"Mon Jan 24 22:36:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, Democrats failed to impose their one-size-fits-all federal takeover of our election system. This partisan power grab wouldn’t have helped secure our elections.https://t.co/AJSV3xIP1d","date":"Fri Jan 21 21:31:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"❌Highest inflation in 40 years\n❌Broken supply chain\n❌Empty store shelves\n❌Rising costs\n❌Lackluster jobs reports\n\nWe’re just one year into the Biden administration…","date":"Fri Jan 21 20:22:03 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every person deserves a chance to thrive. Every human life must be valued and protected.\n\nThank you to all those marching today to defend the unborn. I'm proud to support you. https://t.co/f1JZivNXaW","date":"Fri Jan 21 18:33:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"But their latest attempt to federalize elections was never about voting rights. It was about permanently stacking the deck in their favor at the expense of fair and secure elections – the foundation of our democracy.","date":"Thu Jan 20 04:01:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This evening, I delivered my closing argument against Democrats' federal takeover of elections and their shameful attempt to break the rules to ram this misguided bill through the Senate. Both efforts ultimately failed. That’s good news for Americans. https://t.co/DfW4hfevkm","date":"Thu Jan 20 04:01:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have tried and failed over the past 20 years to pass massive, partisan elections legislation. The policies don’t change, only the false arguments used to justify them.","date":"Thu Jan 20 04:01:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This time, Democrats falsely claimed states are cracking down on voting rights. They aren’t. They’re making it easier to vote than ever.","date":"Thu Jan 20 04:01:08 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"On the Senate floor speaking in opposition to Democrats' election takeover proposals. We must reject this partisan power grab and get back to the bipartisan cooperation that for so long previously defined the Senate.","date":"Thu Jan 20 01:11:39 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are attempting to impose a federal takeover of elections and force a one-size-fits-all approach on every single one of the more than 10,000 voting jurisdictions in this country.\n\nThis will make our election system less secure.","date":"Thu Jan 20 00:29:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats keep repeating their false claims that state legislatures are passing restrictive voting laws. Here’s the truth: state legislatures are making it easier than ever to vote.","date":"Thu Jan 20 00:07:43 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have, over the past 20+ years, repeatedly invented new justifications to push for a partisan, federal takeover of elections. Their current effort is nothing new. https://t.co/t0TR0s5orB","date":"Wed Jan 19 22:02:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Our election system should not be turned upside down because one political party thinks legislation would give it an electoral advantage.","date":"Wed Jan 19 21:47:07 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposals have nothing to do with the right to vote and everything to do with the kinds of rules they think will help Democrats win future elections.\n\nEven Senator Schumer admitted it. \n\n https://t.co/pF1mtbwOgG","date":"Wed Jan 19 20:04:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"For 20 years, I served as an election official. I know firsthand that the diversity of our election system is its strength – making it virtually impossible to rig a nationwide election.\n\nDemocrats' federal election takeover proposals would undermine this.","date":"Wed Jan 19 18:06:34 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ push to break the Senate has nothing to do with voting rights. It is a one-party power grab.","date":"Wed Jan 19 17:12:20 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Missouri is among the states that will benefit most from these investments”\nhttps://t.co/eW2HfE8UwA","date":"Tue Jan 18 21:34:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, Democrats will attempt to break the Senate to ram through their federal takeover of elections.\n\nThey're not only trying to keep themselves in power, they’re trying to pave the way to force their entire radical, unpopular agenda on the American people.","date":"Tue Jan 18 20:10:11 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Dr. Martin Luther King Jr. continues to be an inspiration for all Americans. His voice was one of the most influential of the 20th century and his tireless pursuit of justice forever changed our nation’s history.","date":"Mon Jan 17 13:08:07 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to Dr. LaTonia Collins Smith, Chairwoman of the Dr. Martin Luther King, Jr. Statewide Celebration Commission, and all of the community leaders who were recognized at today’s program. I look forward to your continued advice.","date":"Sat Jan 15 23:21:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Dr. Henry Givens was an accomplished educator, inspirational leader, and great friend. I could not be more honored and humbled to receive the Dr. Henry Givens Legacy Award from the #MLK Missouri State Commission. https://t.co/ndeTJlzb8j","date":"Sat Jan 15 23:21:40 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Bringing together the NGA, academic institutions like @WUSTL and @HarrisStowe, and commercial industry will continue advancing St. Louis’ position as a global GEOINT hub.","date":"Fri Jan 14 21:19:02 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always good to be back at @SLU_Official &amp; talk about their exciting work with @NGA_GEOINT to train the next generation of geospatial-intelligence leaders. https://t.co/KfqCZPDn6e","date":"Fri Jan 14 21:19:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to @MidAmTransplant for the lifesaving work you do to promote and improve the organ donation and transplantation process.","date":"Fri Jan 14 18:19:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’ve fought this misguided organ allocation policy, which hurts states in the South &amp; Midwest, including MO. Recently-released emails show clear bias &amp; collusion in the process behind the changes that were made to the national liver allocation system. @HHSgov has to take action.","date":"Fri Jan 14 18:19:31 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Touring @MidAmTransplant &amp; meeting with their leadership to discuss how the Organ Procurement and Transplantation Network’s organ allocation policies have negatively impacted them. https://t.co/fl2SIZ1x2I","date":"Fri Jan 14 18:19:30 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Saddened by the passing of @STLFireDept Firefighter Benjamin Polson. Every time a firefighter responds to a call, they put others’ safety ahead of their own without hesitation. Thinking of Firefighter Polson’s family, loved ones, and all STL firefighters during this tragic time.","date":"Thu Jan 13 23:49:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I went on Fox News to discuss:\n▶ Democrats’ attempt to federalize elections\n▶ The Supreme Court’s recent decision on vaccine mandates\n▶ Record high inflation levels hurting working families https://t.co/ZzKBOtLIql","date":"Thu Jan 13 23:43:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats keep pushing the false narrative that it's harder to vote to justify their federal takeover of elections. This is nothing more than a blatant power grab by Democrats to control Washington.","date":"Thu Jan 13 22:00:03 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"And this is after just one year of President Biden’s misguided policies…\n“Inflation surges 7% in December, highest rate in 40 years” https://t.co/WZEHHOXbA4","date":"Thu Jan 13 18:48:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are claiming their elections takeover is about voting rights. This is just not true. Their proposals have nothing to do with voting rights and everything to do with stacking the deck to keep themselves in power. https://t.co/Nr0nJbJLz2","date":"Thu Jan 13 16:29:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"FACTS: GA has more early voting days than Delaware and New York. Arizona, Florida and Georgia have no-excuse absentee balloting, New York and Delaware do not.","date":"Wed Jan 12 22:25:02 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"So what is this push really about?  It is nothing but a transparent power grab designed to permanently reshape elections to Democrats’ advantage. But don’t take my word for it…","date":"Wed Jan 12 22:25:02 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Dems are pushing the false narrative that states are cracking down on voting rights. The truth is that GOP-led states have made it easier to vote by expanding early voting, maintaining ballot drop boxes, and replacing subjective signature verification with objective voter ID.","date":"Wed Jan 12 22:25:01 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Springfield police officers have become better trained to be able to spot the signs of a mental health crisis. People detained after a call for service could be re-routed to the unit to get treatment faster\"\nhttps://t.co/Ho9CPd9IIJ","date":"Wed Jan 12 21:52:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Just 1 year into President Biden’s term:\n👎Inflation is at its highest since 1982\n👎Consumer price index increased 7%","date":"Wed Jan 12 21:02:49 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are willing to break the Senate just so they can push their unpopular, extreme agenda.","date":"Wed Jan 12 20:58:39 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy ➡️ “Inflation plowed ahead at its fastest 12-month pace in nearly 40 years during December”\nhttps://t.co/hqmqW3VXAk","date":"Wed Jan 12 19:42:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @Missourinet: Sen. Blunt wants answers from education secretary on how taxpayer dollars are being used to help keep schools open https://t.co/8yIA22Fsfr","date":"Wed Jan 12 18:55:13 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposals aren’t about voting rights. \n\nThey’re about Democrats wanting to stack the deck to keep themselves in power.","date":"Wed Jan 12 17:32:30 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Let’s also not forget that many Republican states, like Arizona, Florida and Georgia, had already implemented no-excuse absentee voting.","date":"Wed Jan 12 16:04:18 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The bottom line is that Democrats’ proposals have nothing to do with the right to vote, and everything to do with the kinds of rules they think will help them win future elections.","date":"Wed Jan 12 16:04:18 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The truth is that state legislatures are making voting easier than ever. Many states, including Georgia and Florida, now include specific provisions in state law that allow for the use of drop boxes, where no drop box provisions existed before.","date":"Wed Jan 12 16:04:17 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"States like Iowa and Georgia implemented more early voting days than even the Democrats would require in their so-called Freedom to Vote Act. In fact, these states have more days of early voting than many states with Democrat-led state legislatures, like New York &amp; Connecticut.","date":"Wed Jan 12 16:04:17 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Georgia’s previous deadline was shorter than the U.S. Postal Service recommendation. Georgia also removed a subjective signature verification requirement and replaced it with an objective voter ID requirement.","date":"Wed Jan 12 16:04:17 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have repeatedly claimed that state legislatures are passing restrictive voting laws. So what would these laws actually do? 🧵","date":"Wed Jan 12 16:04:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In Utah, the state legislature determined that it was a good idea to remove dead people from the voter rolls. In Georgia, the state legislature adjusted their mail-in ballot deadline to ensure voters who requested a mail-in ballot got their ballots with enough time to cast them.","date":"Wed Jan 12 16:04:16 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats' election takeover proposals would:\n❌Undermine state voter ID laws\n❌Require states to allow ballot harvesting (which creates an enormous potential for fraud)\n❌Turn the Federal Election Commission into a partisan tool of the party in power https://t.co/42EMOeSAhb","date":"Tue Jan 11 23:33:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Senate Republicans will continue pushing back on Democrats’ transparent power grab and the dishonest arguments they’re using to permanently reshape elections to their advantage.","date":"Tue Jan 11 22:29:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"2) Many Republican-led states have more early voting days, more drop boxes and easier access to mail-in ballots than Democrat-led states like New York and Delaware","date":"Tue Jan 11 22:29:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"1) States are looking at pandemic-related changes and making permanent many of the things they’ve done to make it easier to vote now than it was before the nationwide health emergency.","date":"Tue Jan 11 22:29:05 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"One of those false narratives is the notion that Republican-led states are making it harder to vote. Here are the facts…","date":"Tue Jan 11 22:29:05 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From one election cycle to the next, Democrats have reinvented their justification for federalizing elections. The policies don’t change, only the false narratives used to defend them. https://t.co/hmI4PLvZYY","date":"Tue Jan 11 22:28:26 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Senate Democrats want to change the long-standing rules of the Senate to make it easier to push their radical agenda: \n▶️Packing the Supreme Court\n▶️Defunding the police\n▶️Bankrupting the heartland with the Green New Deal\n▶️Opening borders, amnesty &amp; voting for illegal immigrants","date":"Tue Jan 11 21:36:45 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposals have 𝐧𝐨𝐭𝐡𝐢𝐧𝐠 to do with the right to vote, and everything to do with the kinds of rules they think will keep them in power. https://t.co/srPAsTojun","date":"Tue Jan 11 20:14:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"81% of Americans support state voter ID laws. \n\nDemocrats' election takeover proposals would undermine these laws.","date":"Tue Jan 11 19:55:19 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Let’s be clear. \n\nDemocrats’ proposals are NOT about voting rights.\n\nIt’s about Democrats wanting to keep themselves in power.","date":"Tue Jan 11 18:53:24 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"LIVE: Talking about Senate Democrats’ blatant elections power grab","date":"Tue Jan 11 17:02:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨Happening soon🚨 My @SenateGOP colleagues &amp; I will be talking about Democrats’ push to break the Senate &amp; take over elections","date":"Tue Jan 11 16:47:51 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats' election bills have nothing to do with the right to vote and everything to do with the kinds of rules Democrats think would help them win future elections.","date":"Tue Jan 11 16:02:32 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"In 2016, President Obama acknowledged that the diversity of state-run election procedures is our system’s strength. A federal takeover of the election system – like the one Democrats are pushing – would make our elections less secure.","date":"Tue Jan 11 13:58:09 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Dems are pushing their election takeover proposal to stack the deck &amp; keep themselves in power. This blatant power grab would:\n❌Undermine state voter ID laws \n❌Force states to legalize ballot harvesting\n❌Turn the FEC into a partisan body \n❌Give public funds to campaigns","date":"Mon Jan 10 22:25:46 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy (after just one year):\n👎Rising costs\n👎Dismal jobs reports\n👎Higher prices at the pump\n👎Broken supply chain\n\nBut the administration continues to push policies that will only make this situation worse for Americans.","date":"Fri Jan 07 21:21:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @1310kzrg: Blunt presses Biden Admin for answers on COVID-19 testing shortage https://t.co/3MEzMJgrVU","date":"Fri Jan 07 20:18:38 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you @RepCleaver for your partnership on this effort, glad to see it’s a home run","date":"Fri Jan 07 19:23:41 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Another big miss for the Biden White House ➡️ “The U.S. economy added less than 200,000 jobs in December, way under expectations of more than 400,000”\nhttps://t.co/7pFUq3ryhy","date":"Fri Jan 07 17:15:54 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is clearly not about a lack of funding, but a more fundamental lack of strategy, lack of priority, and failure to anticipate the ongoing testing needs by the administration.","date":"Fri Jan 07 17:02:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is a wakeup call. I hope the administration wakes up.","date":"Fri Jan 07 17:02:06 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden administration received more than $80 billion in funding to ensure every American has access to COVID-19 tests. They failed to deliver, leaving people waiting in long lines or unable to find tests in store. https://t.co/o55Ns2Mvhq","date":"Fri Jan 07 17:01:47 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"An exciting week for @NLBMuseumKC! The commemorative coins honor the players whose love of the game forever changed our country. Profits from the sale of the coins will help the museum preserve and share this special piece of our history. https://t.co/L9e4dHQGeX","date":"Fri Jan 07 16:20:34 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Just one year of Democrats in control:\n▶️ Skyrocketing costs\n▶️ Soaring inflation\n▶️ Broken supply chain\n▶️Higher gas prices","date":"Tue Jan 04 23:32:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Results from a CNBC/Change Research poll show 60% of respondents said they disapprove of Biden’s handling of the economy as he nears the conclusion of his first year in office.\"\nhttps://t.co/Q6xgAxhQbV","date":"Tue Jan 04 23:03:00 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"I spoke with @MarthaMacCallum today on the Biden administration’s failure to ensure Americans have access to COVID-19 tests, the White House’s lack of guidelines to schools, and more. Watch here ⤵️ https://t.co/bNgMOK9abH","date":"Tue Jan 04 22:42:37 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Newly-released emails evidence collusion and bias in rewriting of nation’s liver allocation policy https://t.co/IqblMMmXEB","date":"Tue Jan 04 20:27:15 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the last 2 years, Congress has provided more than $80 billion for the administration to improve &amp; expand COVID-19 testing capabilities. Congress, and the American people, need to know the administration’s strategy &amp; how @HHSgov is using taxpayer funding.","date":"Tue Jan 04 17:12:05 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/mn9hhB99fV","date":"Tue Jan 04 17:12:05 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"It is unclear why we are facing the dire test shortage we are today. It does not appear to be because of lack of funding, but a more fundamental lack of strategy and a failure to anticipate future testing needs by the administration.","date":"Mon Jan 03 19:21:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the last two years, Congress has provided the administration more than $82 billion specifically for COVID-19 testing, with flexibility to allocate additional funds if necessary.","date":"Mon Jan 03 19:21:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, @SenatorBurr and I called on the administration to provide a detailed strategy on how it plans to get this testing crisis under control. Making sure every American can easily and quickly take a COVID-19 test is critical to fighting this pandemic. https://t.co/2DiOff0Hte","date":"Mon Jan 03 19:21:23 +0000 2022","user_id":"21269970"},{"handle":"RoyBlunt","text":"We knew the process was unfair, but we learned last week that it’s even worse than that. Newly-released emails, made public under a court order, show the process was deliberately designed to deny patients in the Midwest &amp; South their fair chance at a lifesaving liver transplant.","date":"Tue Dec 28 18:18:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We've repeatedly challenged the process by which the changes came about. The organization that oversees liver allocations, UNOS, overruled transplant experts, excluded certain comments from the deliberations &amp; arrived at a significantly different outcome than they had previously.","date":"Tue Dec 28 18:18:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In an oped in today’s @KCStar, Sen. @JerryMoran and I share what was in those emails and why they leave no room for doubt that the current policy must be overturned. https://t.co/6dqDxaLYCa","date":"Tue Dec 28 18:18:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the past 3 years, Sen. @JerryMoran and I have fought changes to the national liver allocation policy that benefitted certain states at the expense of patients in the South and Midwest, including where we live.","date":"Tue Dec 28 18:18:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless tax-and-spend spree relies on budget gimmicks to hide the true cost of the bill – which could add an estimated $3 trillion to the deficit over the next 10 years. \nhttps://t.co/eAPap2DTcB","date":"Sun Dec 26 19:30:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Putting more money into the economy at a time when the economy is already overheated is just a bad idea. https://t.co/eAPap2VuBb","date":"Sun Dec 26 18:15:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Joined @MikeEmanuelFox on @FoxNewsSunday today to talk about Democrats’ reckless tax-and-spend spree &amp; how it would add to the economic challenges families are facing https://t.co/eAPap2VuBb","date":"Sun Dec 26 17:11:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’d also like to thank their families and loved ones. It’s hard to be away from the people you love, especially during the holidays. We owe so many of our blessings to the countless sacrifices they make every day.","date":"Sat Dec 25 15:08:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As we celebrate the holidays, I want to say a special thank you to our service members at home and overseas. We owe them a deep debt of gratitude for all they do, every single day, to protect our country. https://t.co/jjVSPqZa9A","date":"Sat Dec 25 15:08:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wishing you and your loved ones a very Merry Christmas! https://t.co/zWFDInHf9M","date":"Sat Dec 25 14:00:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Saddened by the tragic news out of Boone County. @BooneCountyFire Assistant Chief Bryant Gladney dedicated his life to serving his community. My thoughts are with his family and fellow firefighters.","date":"Wed Dec 22 19:16:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Department of Health and Human Services must immediately reverse its implementation of the misguided liver allocation policy. https://t.co/IqblMMmXEB","date":"Tue Dec 21 21:31:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The changes favored certain states at the expense of states in the South and Midwest, which are predicted to see a substantial decrease in organ availability.","date":"Tue Dec 21 21:31:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"After reviewing emails that were just released between UNOS and organ procurement organizations and transplant hospitals, we now know that there was a pattern of collusion prior to the changes in the liver allocation policy being announced.","date":"Tue Dec 21 21:31:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Sen. @JerryMoran and I have repeatedly said the process and policy for determining liver allocations needs to be made fairly and transparently. Neither UNOS nor the Department of Health and Human Services have lived up to this standard.","date":"Tue Dec 21 21:31:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The emails further include profane and disparaging comments about people living in the South, demonstrating a clear bias against these areas in the policymaking process.","date":"Tue Dec 21 21:31:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We knew that UNOS overruled the expert Liver and Intestine Committee, excluded certain public comments in the deliberations, and arrived at an outcome that was radically different from the decision previously reached.","date":"Tue Dec 21 21:31:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Three years ago, the United Network for Organ Sharing made major, misguided changes to the national liver allocation policy. Since that time, Sen. @JerryMoran and I have repeatedly raised the alarm about the new policy and the deeply flawed process by which it came about.","date":"Tue Dec 21 21:31:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks to a recent appeals court ruling against UNOS, we have now learned that the process was more than just fundamentally flawed – it was deliberately designed to deny people in the South and Midwest a fair chance at a lifesaving liver transplant.","date":"Tue Dec 21 21:31:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Johnny Isakson liked to help people and liked to get things done. I was always impressed by his habit of often addressing groups he was speaking to as, \"my friends and future friends.\" He was a skilled politician, a great public servant, and a great friend.","date":"Sun Dec 19 16:19:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Certainly had my vote, congratulations!","date":"Fri Dec 17 20:58:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act I introduced with @MartinHeinrich would make the largest, most significant investment in wildlife and habitat conservation in a generation. https://t.co/OeoxG9diU8","date":"Fri Dec 17 18:44:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"RAWA is supported by over 1,500 organizations representing state fish and wildlife agencies, industry associations and businesses, conservation groups, and sportsmen and women.","date":"Fri Dec 17 18:44:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act would make the largest, most significant investment in wildlife and habitat conservation in a generation. https://t.co/A8fwLSxgx3","date":"Wed Dec 15 21:01:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless tax-and-spend spree could\n❌Cost up to $4.9 trillion\n❌Increase the deficit by $3 trillion\nInflation just hit a 40-year high. We’re already paying higher prices at the grocery store and gas pump. We cannot afford this.","date":"Wed Dec 15 20:01:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations, @DiscoveryCenter! Happy to see your team recognized for all the good work you do for Missouri’s kids","date":"Wed Dec 15 16:51:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"CBO reports Democrats’ spending spree could cost nearly $5 trillion. We’re already facing soaring costs as inflation hits a 40-year high. But Democrats would stick hardworking Americans with the bill for their liberal wish list.","date":"Tue Dec 14 23:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Wholesale prices measure rose 9.6% in November from a year ago, the fastest pace on record” https://t.co/XEcGaHksUE","date":"Tue Dec 14 22:15:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"CBO showed Democrats’ massive spending spree could cost up to $4.9 trillion AND increase the deficit by $3 trillion.\n\nYet they’re still pushing it…","date":"Tue Dec 14 21:22:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Despite Democrats’ claims, inflation is NOT transitory. It’s here to stay. https://t.co/iexV5I9hPP","date":"Tue Dec 14 19:30:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is surging with no end in sight. The last thing we need is another reckless spending spree – but that’s exactly what Democrats are pushing.","date":"Tue Dec 14 17:35:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@DiscoveryCenter is a truly unique &amp; valuable resource for students, parents, &amp; educators from around our state &amp; beyond. I've visited with my family many times &amp; I’m glad to see them being recognized for their hard work &amp; look forward to seeing them bring home the STOP Award","date":"Mon Dec 13 23:01:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"👀","date":"Mon Dec 13 22:46:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"But Democrats repeatedly claimed it would cost $0…","date":"Mon Dec 13 22:32:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"@MDC_online RAWA would provide $1.3 billion in dedicated annual funding, including an estimated $20+ million for Missouri","date":"Mon Dec 13 22:09:33 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I had a great time traveling across Missouri last month with @MDC_Online Director Sara Parker Pauley to highlight the Recovering America’s Wildlife Act and the impact it would have on conservation efforts. https://t.co/mqZMoYK6nl","date":"Mon Dec 13 22:09:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy: \n❌Inflation is here to stay\n❌Soaring costs\n❌Empty shelves\n\nYet Democrats are still pushing their reckless spending spree – even after CBO showed it could cost up to $4.9T &amp; increase the deficit by $3 trillion.","date":"Mon Dec 13 21:52:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“U.S. consumers see short-term inflation rising at twice pace of wage gains, survey shows”\nhttps://t.co/F3UFElawTk","date":"Mon Dec 13 20:28:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy birthday, @NationalGuard! Thank you for all you do to keep us safe 🇺🇸 #Guard385 https://t.co/tLrq3uwzSc","date":"Mon Dec 13 19:30:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is hurting Americans. But Democrats are still trying to pass their reckless spending spree, which will only make inflation worse.","date":"Fri Dec 10 22:17:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s indefensible that Democrats’ tax-and-spend spree would give the wealthiest Americans $230 billion in tax cuts. https://t.co/mLw1QUqdsb","date":"Fri Dec 10 20:39:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"With inflation at a near 40-year high, the last thing Missouri families can afford is another massive, reckless spending bill. https://t.co/e4wGA94yTP","date":"Fri Dec 10 19:01:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨🚨🚨","date":"Fri Dec 10 17:11:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"6.8% inflation is the worst in almost 40 years – and Democrats want to respond with more reckless spending. Inflation is out of control under Democrats’ watch. https://t.co/aLqwY8JRRu","date":"Fri Dec 10 15:49:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless spending spree would do nothing to help hardworking Americans who are already facing skyrocketing costs and inflation. We cannot afford this.","date":"Thu Dec 09 20:10:35 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"After Congress passed 5 bipartisan COVID relief bills last year, Democrats broke that model to force through their spending without a single Republican vote – and they’re sticking Missouri families with the bill. https://t.co/a8UxOwgqMx","date":"Thu Dec 09 18:01:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to @MDC_Online Director Sara Parker Pauley for your testimony on the impact the Recovering America’s Wildlife Act would have on conservation efforts. Always appreciate your vast knowledge &amp; dedication to preserving our state’s wildlife for generations to come.","date":"Wed Dec 08 18:38:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America's Wildlife Act would be the most significant investment in wildlife conservation in a generation. Today, I testified at a hearing to highlight how important it would be to conservation efforts in Missouri &amp; across the nation. https://t.co/gAweO8Hlck","date":"Wed Dec 08 18:38:36 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Spoke with @TeamCavuto today about the Democrats’ reckless spending spree. Democrats claim their bill to “transform” American society will cost $0. We know this isn’t true. https://t.co/vPFgl6xihq","date":"Tue Dec 07 23:08:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I encourage all who are eligible to receive a vaccine to consider doing so, but it is not the role of the federal government to force that decision on Americans. https://t.co/Vj5eaUK090","date":"Tue Dec 07 22:32:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden administration’s vaccine mandate will have a harmful impact on U.S. employers, adding to the labor force and supply chain challenges that are already roiling the economy. https://t.co/xRwyYZ5NNF","date":"Tue Dec 07 22:32:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“As prices creep higher for food, gasoline and other necessities, nearly half of U.S. households say they are feeling the financial strain, according to a Gallup survey released Thursday.” https://t.co/EbTILFUQxT","date":"Tue Dec 07 22:17:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At a time when hardworking Americans are facing skyrocketing prices, growing inflation, and empty store shelves, Democrats are pushing another massive, reckless spending spree – and sticking Americans with the bill.","date":"Tue Dec 07 20:50:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to Tracy Reynolds – the Kirksville native has been named the 2021 United States Navy Active Duty Outstanding Career Judge Advocate. Thank you for your service, Tracy. https://t.co/6wTgUvGo8d","date":"Tue Dec 07 18:30:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"80 years ago today, Pearl Harbor was attacked and 2,403 Americans lost their lives. Today, we remember those who made the ultimate sacrifice that day and reflect on the bravery displayed by our Greatest Generation.","date":"Tue Dec 07 16:16:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KY3: Sen. Roy Blunt, NAMI celebrate new Springfield facility aiming to improve mental health access across the Ozarks\nhttps://t.co/xIM8QdAgqK","date":"Mon Dec 06 22:28:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is hitting Americans’ right in their wallets. But Democrats are doubling down on their misguided policies that got us to this point in the first place. We cannot afford Democrats’ massive, reckless spending spree.","date":"Mon Dec 06 21:16:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“As prices creep higher for food, gasoline and other necessities, nearly half of U.S. households say they are feeling the financial strain, according to a Gallup survey released Thursday.” https://t.co/EbTILFUQxT","date":"Mon Dec 06 20:05:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From Kansas City to Cooperstown, Buck O’Neil was a larger-than-life legend whose legacy and impact extended well beyond the baseball diamond. This is an incredible moment for Buck O’Neil’s family, Kansas City, and the Negro Leagues Baseball Museum. https://t.co/T21UrZLWWo","date":"Mon Dec 06 17:21:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"For decades, Missouri Republicans considered Bob Dole as our third United States Senator. His quick wit and his keen understanding of America’s role in the world were always part of any conversation you had with him. A great life, well lived.","date":"Sun Dec 05 18:46:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@NAMICommunicate does important work, both here in southwest Missouri &amp; across the country. Thank you for all you do to make sure people are getting the help and care they need.","date":"Fri Dec 03 23:42:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Since 2014, my friend @SenStabenow &amp; I have been working together on our Excellence in Mental Health bill, which established Certified Community Behavioral Health Clinics. Our program has since expanded to 10 states, and over 40 states have CCBHC clinics.","date":"Fri Dec 03 23:42:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to be part of today’s ribbon cutting ceremony for National Alliance on Mental Illness Southwest Missouri’s new facility. One of my top legislative priorities has been creating more access to mental health care for Missourians. https://t.co/0wmv31AB2K","date":"Fri Dec 03 23:42:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats passed a $1.9 trillion bill in March without a single Republican vote. We now have inflation at a 30-year high and consumer confidence at a 10-year low. Pouring trillions more into the economy will only make things worse. https://t.co/iyT8pfB6Ke","date":"Fri Dec 03 21:31:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ economy: \n❌Dismal jobs report\n❌Empty shelves\n❌Soaring inflation that’s here to stay\n❌Increased costs at the grocery store &amp; the gas pump\n\nTheir reckless spending spree would only make things worse.","date":"Fri Dec 03 20:32:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, I spoke on the floor to break down the true cost of Democrats’ reckless tax-and-spend spree. When you take out all the budget gimmicks, independent analysis puts the real cost at $4.8 trillion, much higher than the $1.7 trillion Democrats claim. https://t.co/iyT8pfjvSG","date":"Fri Dec 03 19:35:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"To a cast a vote in the @FTC, you ought to actually be on the commission. This zombie voting completely ignores the important role of the Senate in the confirmation process, and it’s totally inconsistent with how federal agencies should operate. https://t.co/h5BPsfveZk","date":"Fri Dec 03 19:07:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Another miss for Democrats’ misguided economic policies ➡️ “Job growth disappoints in November, with a gain of just 210,000”\nhttps://t.co/mIahkgoJjV","date":"Fri Dec 03 16:57:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Making Newtonia Battlefield a part of the NPS has long been a priority for the local community, which has spent years – and significant resources – to preserve the site.","date":"Thu Dec 02 22:49:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a former history teacher, I’m proud to support efforts to help ensure future generations can visit the battlefield and learn more about its unique history. https://t.co/kpR7XoDerd","date":"Thu Dec 02 22:49:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I introduced legislation, along with @HawleyMO and @USRepLong, that would add elements of Newtonia Battlefield to Wilson’s Creek National Battlefield, a unit of the National Park Service.","date":"Thu Dec 02 22:49:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"71% of Americans living in households making less than $40,000 a year say that inflation has caused their family financial hardship.\nhttps://t.co/zesGGZ5gDD","date":"Thu Dec 02 22:14:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, @SenAmyKlobuchar and I introduced a bill to help children living in institutional care by promoting strong child welfare systems abroad &amp; addressing unnecessary hurdles to international adoptions to the US. More here: https://t.co/3FPpmFFHUH","date":"Thu Dec 02 21:09:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every child deserves a permanent, safe, loving home no matter where they are born. Unfortunately, millions of children around the world are growing up in institutional care because there is little or no support system in place to help them stay in families.","date":"Thu Dec 02 21:09:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is still a terrible idea and an unprecedented invasion of Americans’ privacy.\n@NYTimes headline ➡️ Janet Yellen still supports making banks give the I.R.S. new customer data.\nhttps://t.co/8EuyReMX2k","date":"Thu Dec 02 20:41:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are hurting because of increased prices on their groceries, utilities, and gas. But Democrats are still ignoring Americans’ concerns and trying to ram their reckless spending spree through Congress. We cannot afford this.","date":"Thu Dec 02 18:47:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"As Americans sail into peak holiday shopping season and winter temperatures bring bigger heating bills to much of the country, nearly half of U.S. adults already report that price increases are causing them financial hardship.\" https://t.co/zesGGZmS2d","date":"Thu Dec 02 17:36:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Office Antonio Valentine led a life of service to others, first to our country in the Air Force and then to the people of St. Louis County. Thinking of Officer Valentine’s family and colleagues during this time. His dedication to protecting others will not be forgotten.","date":"Thu Dec 02 16:08:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"77% of Americans are concerned about inflation. Democrats are ignoring these concerns to push a reckless bill that spends trillions on far-left policies that will push prices up even more.","date":"Wed Dec 01 22:04:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"A majority of Americans (51 percent) also say they’re worried they 'won’t be able to afford what they need during the holidays due to inflation,' while 45 percent say they’re worried they 'won’t be able to get what they need' due to shortages.\" https://t.co/rLQdGgC4ki","date":"Wed Dec 01 21:27:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Winter is almost here &amp; temperatures are already dropping. Thanks to the Biden administration’s energy policies, home heating prices are expected to soar – as Americans are already facing rising costs at the grocery store and gas pump.","date":"Wed Dec 01 20:49:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless spending spree would do nothing to help Americans who are already facing skyrocketing costs for gas and groceries. But it does include tax cuts for the wealthiest Americans. https://t.co/w8VC6h289s","date":"Wed Dec 01 20:19:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden, Americans are paying more:\nTo get groceries for their families\nTo heat their homes\nTo put gas in their cars","date":"Wed Dec 01 19:58:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Hardworking Americans are getting hit right in their wallets because of inflation. But Democrats are doubling down on their misguided policies that led to this historic inflation in the first place.","date":"Wed Dec 01 19:13:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This holiday season, hardworking families are facing soaring costs, and Democrats' reckless tax-and-spend spree will only add to the strain. https://t.co/TIPPgn0LhA","date":"Mon Nov 29 22:07:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Gas prices are hitting Americans right in their wallets, up to $3.39 per gallon this week. Yet Democrats are still pushing a reckless tax-and-spend spree full of far-left energy policies that will drive up costs for American families.","date":"Mon Nov 29 21:42:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden:\n▶️ Gas prices are up\n▶️ Home heating costs are rising\n▶️ And inflation is here to stay","date":"Mon Nov 29 20:38:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are already paying more to heat their homes, fill up the gas tank, and buy groceries. We cannot afford the higher taxes and greater debt that Democrats’ spending spree will bring.","date":"Mon Nov 29 20:02:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wishing you and your family a happy and healthy Thanksgiving! Please join me in thanking the men &amp; women in uniform who are spending the holiday away from their families to keep us safe. https://t.co/nBYKvkMRK1","date":"Thu Nov 25 13:00:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, @HawleyMO and I sent a letter to the VA demanding answers on how veterans in long-term care facilities will be impacted by the federal COVID vaccine mandate and what, if any, plan is in place to protect them. https://t.co/WPDSnEPWpI","date":"Tue Nov 23 22:07:36 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s Thanksgiving will be the most expensive in the holiday’s history. On top of that, Missourians will be paying more to even get to the Thanksgiving table. https://t.co/8wOOwLdnJB","date":"Mon Nov 22 19:19:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I visited @KUMedCenter with Sen. @JerryMoran. During our discussion, we spoke about how @NIH's RADx initiative – which expedited the development of quick, accurate COVID tests – created an innovative approach to medical research that we can apply to other health challenges https://t.co/Oak0P9gryg","date":"Mon Nov 22 18:32:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"See you at Thanksgiving","date":"Mon Nov 22 17:56:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are struggling with higher prices at the grocery store and gas pump. To make matters worse, they’ll also see their utility bills skyrocket this winter thanks to the Biden administration’s far-left energy policies. https://t.co/ULIjc2KDVx","date":"Fri Nov 19 19:33:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Jared risked his life to save others, and we are forever indebted to him and to all of our fallen service members and Gold Star families for their sacrifice.","date":"Thu Nov 18 22:45:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, the Senate unanimously passed legislation to award the Congressional Gold Medal to the 13 service members, including @USMC Lance Corporal Jared Schmitz of Wentzville, Missouri, who were killed in the attack outside the Kabul airport in August.","date":"Thu Nov 18 22:45:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The @FarmBureau’s annual Thanksgiving survey shows costs for Thanksgiving dinner are up 14% compared to last year – and turkey is up 24% https://t.co/a7lEOGdFtk","date":"Thu Nov 18 22:34:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"But Democrats are ignoring these concerns &amp; continuing to push their reckless spending spree.","date":"Thu Nov 18 22:02:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We've been facing skyrocketing costs at the gas pump &amp; the grocery store for months now. Former Obama admin economists are warning against throwing more money into government programs and risking even higher inflation.","date":"Thu Nov 18 22:02:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is at a 30-year high. Americans are already feeling the strain. Democrats’ massive spending spree will only make it worse.","date":"Thu Nov 18 20:58:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today is #RuralHealthDay. Please join me in thanking all the health care professionals serving rural areas across the country for all they have done, and continue to do, to keep their communities safe during COVID.","date":"Thu Nov 18 20:09:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s Thanksgiving is already expected to be the most expensive meal in its history. If Democrats’ pass their reckless tax-and-spend spree, the skyrocketing food costs and ongoing supply chain issues families are facing right now will only get worse. https://t.co/PExol1FIla","date":"Thu Nov 18 19:12:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"LIVE ⤵️\nTalking about the increased costs of gas &amp; utilities for Americans as we head into winter","date":"Thu Nov 18 16:57:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @Fox2Now: West Florissant’s Ferguson stretch to transform with $18.2 million grant\nhttps://t.co/mbABSjCDgN","date":"Thu Nov 18 16:28:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ spending spree would not only mean higher taxes and more debt, it’s also packed with Democrats’ special interests – like tax breaks for e-bikes and trial lawyers https://t.co/nyrA5PfQ1l","date":"Wed Nov 17 23:03:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks to inflation and the supply chain crisis, this year’s Thanksgiving dinner will gobble up more money than ever.","date":"Wed Nov 17 22:56:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year’s Thanksgiving is going to be the most expensive meal in its history. And with average gas prices above $3 per gallon, it’s also going to cost more for Americans to even get to the dinner table.","date":"Wed Nov 17 22:40:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Not every day you get to meet with a person who has been to space 🚀 It was great to chat with Astronaut Michael Hopkins this afternoon. Astronaut Hopkins, who grew up in Richland, recently served as Commander of the SpaceX Crew Dragon and has completed 5 spacewalks. https://t.co/bia6kIWVzz","date":"Wed Nov 17 21:50:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"If Democrats pass their reckless tax-and-spend bill, the U.S. will have “the highest combined federal and state top tax rate among major nations.” https://t.co/TMPYnf58hM","date":"Wed Nov 17 21:41:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨 🚨 🚨","date":"Wed Nov 17 19:58:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"❌Inflation is here to stay\n❌Higher prices at the gas pump\n❌Skyrocketing costs for groceries\n\nAnother spending spree will only add to the strain on hardworking families.","date":"Wed Nov 17 18:43:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As an adoptive parent myself, I’m proud to introduce this resolution with @SenAmyKlobuchar recognizing November as National Adoption Month. I hope it will encourage more Americans to consider expanding their families through the gift of adoption. https://t.co/uhQJqA8MZH","date":"Wed Nov 17 16:02:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy ⤵️\n“The consumer price index surged 6.2% from a year ago in October, the most since December 1990.”\nhttps://t.co/9tNaxcHxTZ","date":"Tue Nov 16 23:15:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden, Americans are paying more for\n▶️ Groceries\n▶️ Gas\n▶️ Utilities","date":"Tue Nov 16 16:29:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Investing in transportation infrastructure is one of the most important things we can do to create a stronger foundation for economic growth and improve the quality of life for families.","date":"Tue Nov 16 16:01:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"These projects are great examples of how public-private partnerships can support improvements that will have a significant impact - from making STL a more attractive place to start &amp; grow a business, to connecting people with work &amp; education opportunities and promoting tourism.","date":"Tue Nov 16 16:01:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great news for #STL – Brickline Greenway and West Florissant Avenue Great Streets projects receive total of more than $33 million in RAISE Grant funding https://t.co/dx7A6kdOaZ","date":"Tue Nov 16 16:01:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last month, inflation hit a 31-year high. American families are already hurting from skyrocketing costs. But Democrats insist on spending trillions of dollars more in their reckless tax-and-spend spree. This will only make things worse for Americans.","date":"Mon Nov 15 21:07:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The Recovering America’s Wildlife Act would provide more than $20 million to the Missouri Department of Conservation, which could then finance local projects.” https://t.co/1gXBgn7AQg","date":"Mon Nov 15 19:07:27 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to the Paris FFA – they were named the top chapter in the nation at the @NationalFFA Convention last month. https://t.co/4b9vYs8Ooa","date":"Mon Nov 15 17:47:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We are forever indebted to Jared and his family, and to all of our fallen service members and Gold Star families, for their sacrifice.","date":"Thu Nov 11 20:33:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, in St. Charles, we honored and remembered Lance Corporal Jared Schmitz. Jared did what only the bravest and most extraordinary Americans do. He risked his life to save others. https://t.co/2d3qQEUt7x","date":"Thu Nov 11 20:33:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s an honor to be at @MissouriState today to celebrate our veterans &amp; military families, who understand better than anyone the importance of this day. We owe our freedom &amp; safety to those in uniform &amp; we owe a debt of gratitude for the sacrifices military families make for us. https://t.co/31dd3Ogq1x","date":"Thu Nov 11 16:35:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"America has the best military in the world because of the brave men and women who answered the call to serve. Please join me in thanking our veterans in Missouri and across the country for their courage, their sacrifice, and their service. https://t.co/ohjZrCFydx","date":"Thu Nov 11 13:00:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Appleton City this afternoon to tour Ellett Memorial Hospital and discuss rural health care and their COVID response. To the health care professionals at Ellet Memorial Hospital, thank you for all you have done, &amp; continue to do, to keep your community safe during COVID. https://t.co/rG1WHfYXNB","date":"Wed Nov 10 22:32:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Negro Leagues Baseball Museum is always top of my list of places to go when I’m in KC. The museum celebrates &amp; preserves the rich legacy of the Negro Leagues, which was home to some of our most iconic players – Jackie Robinson, Satchel Paige, Buck O’Neil, just to name a few.","date":"Wed Nov 10 21:46:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Negro Leagues had an indelible impact on the history of sports and our nation as these players broke down the barriers of segregation. This museum does a terrific job telling their stories.","date":"Wed Nov 10 21:46:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The coin comes at no cost to taxpayers. After @USTreasury has recouped all of its costs for designing and minting the coins, funds will be distributed to the Negro Leagues Baseball Museum.","date":"Wed Nov 10 21:46:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today was an exciting day as @NLBMPrez unveiled the design for the Negro Leagues Baseball Centennial Commemorative Coin. My bill with @RepCleaver, which became law last year, directed the @USTreasury to mint a coin to commemorate the centennial of Negro Leagues Baseball. https://t.co/2eiJjGts7F","date":"Wed Nov 10 21:46:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy ➡️ “Prices climbed 6.2 percent in October compared to last year, the largest increase in 30 years, as inflation strains economy”\nhttps://t.co/zQVnTyhqvi","date":"Wed Nov 10 19:50:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy 246th birthday, @USMC 🇺🇸 Grateful to the brave men and women who keep us safe at home and overseas. https://t.co/8fffBuXyd0","date":"Wed Nov 10 16:50:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The National Defense Authorization Act has been a bipartisan endeavor for 6 decades. Now, when keeping our nation secure is more important than ever, we need to bring #FY22NDAA to the Senate floor and pass this bill. https://t.co/LUPU6STOKI","date":"Tue Nov 09 21:13:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@DiscoveryCenter is a truly unique and valuable resource for students, parents, and educators from around our state and beyond. I’m glad to see them being recognized for their hard work and look forward to seeing them bring home the STOP Award.","date":"Tue Nov 09 19:29:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to Palmyra High School’s floriculture team, they earned first place at the @NationalFFA Convention. And congratulations to several members of the team who also won individually: Ji Yong Ni, Evan Nierman, Tim Wellman, and Augustine Mahsman https://t.co/tPCuw6TD4H","date":"Tue Nov 09 19:05:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Essential ingredients might not be the only things absent from Thanksgiving dinner this year. Guests traveling will be faced with car rental and gas prices the highest they have been in seven years.\" https://t.co/v494LCHk34","date":"Tue Nov 09 16:45:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act would help preserve our nation’s wildlife for generations by funding conservation efforts for more than 12,000 species of wildlife and plants in need of assistance. https://t.co/Hkc85Zrfk0","date":"Tue Nov 09 00:10:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KOAMFox14: U.S. Senator Blunt promotes conservation legislation in Asbury\nhttps://t.co/TPDeCGGA33","date":"Mon Nov 08 20:34:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My bipartisan Recovering America’s Wildlife Act “would make the largest, most significant investment in wildlife and habitat conservation in a generation.” https://t.co/Psmq5maTJg","date":"Mon Nov 08 19:21:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Federal agencies have kept workers out of the office and failed to provide plans to get them back to in-person work. It’s resulting in huge delays for government services.","date":"Fri Nov 05 20:54:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I joined several of my Senate colleagues in pressing federal agencies for answers on when employees will be back in the office https://t.co/452RUBtKZX","date":"Fri Nov 05 20:54:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I continue hearing  from constituents about how the mounting backlogs are impacting everything from VA and Social Security benefits to passports and tax refunds.","date":"Fri Nov 05 20:54:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This legislation would boost Missouri’s outdoor recreation economy, which:\n✅Supports 93,000 jobs in our state\n✅Contributes $7.4 billion to the local economy","date":"Fri Nov 05 20:08:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Met with @GovParsonMO &amp; @BassProShops Founder &amp; CEO Johnny Morris at @WOWAquarium. With more than 1.5 miles of trails through habitats, @WOWAquarium is an immersive educational experience. We spoke about my Recovering America's Wildlife Act and what it would mean for Missouri. https://t.co/uL50eP2FXD","date":"Fri Nov 05 20:07:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In the proposal, Missouri is estimated to receive just over $20 million annually –  compared to $1 million we currently receive in current federal funding sources.","date":"Fri Nov 05 17:59:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In Asbury this morning to check out the Wah-Sha-She Prairie. @MDC_Online manages the area, which is a nearly level upland prairie with high plant diversity and many species of birds and insects. https://t.co/0OfCvgWebT","date":"Fri Nov 05 17:59:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under my bipartisan Recovering America’s Wildlife Act, our natural heritage, including places like the Wah-Sha-She Prairie, would be conserved for future generations to learn from &amp; enjoy.","date":"Fri Nov 05 17:59:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Dave Haubein, an audubon certified cattle producer, told us about how the strategies he uses on his family's land have benefitted his crops, his cattle, and even local birds.","date":"Fri Nov 05 17:59:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/pNx1O7mpOX","date":"Fri Nov 05 16:50:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Sen. @MartinHeinrich &amp; I recently introduced the Recovering America’s Wildlife Act. This bill would establish the Wildlife Conservation and Restoration within @USFWS to promote voluntary conservation efforts to restore and protect at-risk, threatened, or endangered species.","date":"Fri Nov 05 16:50:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to Dr. Mark Mills for speaking with us today and sharing your expertise and valuable insights from your research at @MissouriWestern.","date":"Fri Nov 05 16:50:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Starting my day with @MDC_Online Director Sara Parker Pauley, we visited the French Bottom Access on the Missouri River, outside the Remington Nature Center in St. Joe. The Remington Nature Center is a great place to learn about nature and the importance of conservation. https://t.co/qQMjGxxD34","date":"Fri Nov 05 16:50:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It is the absolute wrong approach to getting more people vaccinated and I will continue working with my colleagues to stop it. https://t.co/hkpSKOGzgW","date":"Thu Nov 04 19:57:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I have been vaccinated and I have encouraged everyone who is eligible to receive a vaccine to consider doing so. However, I also believe it is an individual choice and I am opposed to President Biden’s vaccine mandate.","date":"Thu Nov 04 19:57:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I've heard from employers around MO who are having huge challenges hiring &amp; retaining workers. Given the significant labor force and supply chain problems we’re facing, the last thing our economy needs is to lose more workers b/c of this misguided, costly &amp; unworkable mandate.","date":"Thu Nov 04 19:57:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are paying more to buy groceries, get gas, and to heat their homes. But Democrats still continue to push the same misguided policies that led to these increased costs in the first place.","date":"Thu Nov 04 18:52:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"#FY22NDAA will: \n🇺🇸 Take care of our troops\n🇺🇸 Maintain our military supremacy\n🇺🇸 Accelerate innovation\n🇺🇸 Prioritize cybersecurity\n🇺🇸 Protect our freedom\n\nIt's time to continue the NDAA's six-decade-long tradition of bipartisanship and bring this to the Senate floor. https://t.co/0EVXxmi2VX","date":"Thu Nov 04 17:07:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We’re already dealing with record-high inflation &amp; paying more for everyday items. We cannot afford the higher taxes &amp; greater debt that Democrats’ reckless tax-and-spend spree will cause.","date":"Thu Nov 04 14:44:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden’s economy, Americans are paying more to:\n❌Buy groceries\n❌Heat their homes\n❌Fill their gas tanks\n\nDemocrats’ misguided policies are already hurting Americans. Their reckless tax-and-spend spree will only make things worse.","date":"Tue Nov 02 21:53:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Illegal border crossings and fentanyl seizures have skyrocketed under the Biden administration. This crisis will grow bigger by the day if Democrats continue to ignore the dire situation at our southern border. https://t.co/8EziLEtvdO","date":"Tue Nov 02 21:28:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"During the decade we served together in the House, Dennis Moore was always looking for ways to work together.","date":"Tue Nov 02 21:14:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I also saw him many times when he would come by and visit in the Senate office as he and his family talked about the challenges of Alzheimer’s. Watching their courage as they dealt with this challenge was inspirational.","date":"Tue Nov 02 21:14:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ massive tax-and-spend spree would mean:\n▶️More taxes\n▶️More debt \n▶️More government \n\nWe cannot afford this.","date":"Tue Nov 02 18:29:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"November is National Adoption Month. As an adoptive dad, I know just how rewarding it is to give a child the loving home they deserve. We should be making it easier for more kids to find safe &amp; caring homes and ensure adoptive families have the support they need. https://t.co/UPITlruDpL","date":"Tue Nov 02 15:50:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Higher taxes &amp; more debt. That’s what Americans can expect if the Democrats ram their massive tax-and-spend spree through Congress.","date":"Fri Oct 29 13:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Soaring costs.\nMore expensive heating bills.\nInflation. \nGas prices at a 7-year high.\n\nDemocrats’ policies are already hurting Americans. This reckless tax-and-spend spree will make things worse.","date":"Thu Oct 28 22:22:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under Democrats’ proposal, if you spend or earn around $28 a day, the IRS could spy on your bank account. This clear invasion of privacy should alarm every law-abiding American.","date":"Thu Oct 28 21:41:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you, Louis, for your service and for representing us at Nationals","date":"Thu Oct 28 21:29:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happening Monday: Cape Girardeau County Public Health Center will administer Moderna and Johnson &amp; Johnson COVID-19 booster shots to eligible people https://t.co/upmfImr5Dt","date":"Thu Oct 28 20:18:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy ➡️ “The U.S. economy grew at a 2% annualized pace in the third quarter, its slowest increase since the end of the 2020 recession.” https://t.co/thnglV1YIO","date":"Thu Oct 28 17:28:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Do you spend $28 a day? Under Democrats’ proposal, the IRS would be allowed to snoop on your bank account.","date":"Thu Oct 28 14:05:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy: \n▶️ Skyrocketing prices  \n▶️ Gas prices at their highest since 2014\n▶️ Thanksgiving dinner costs at an all-time high\n▶️ And Sec. Yellen says inflation will be around for awhile","date":"Wed Oct 27 21:53:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Prohibiting IRS Financial Surveillance Act \"would prevent the Internal Revenue Service (IRS) from implementing the Democrats’ plan to give the agency access to Americans’ transaction information.\"\nhttps://t.co/Q60oEeLVik","date":"Wed Oct 27 19:24:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KQ2: MWSU holds vaccine clinic following J&amp;J, Moderna booster shot approval https://t.co/cdEu8VUdGE","date":"Wed Oct 27 17:33:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ plan to spy on the bank accounts of nearly every American to help pay for their reckless tax-and-spend spree is a huge violation of privacy and poses a major risk to data security. https://t.co/xFl0uenSeg","date":"Tue Oct 26 21:57:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless tax-and-spend spree would leave hardworking Americans with greater debt and higher taxes.","date":"Tue Oct 26 21:10:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposal would give the IRS the power to snoop into Americans’ bank accounts.\n\nThis invasion of privacy reaches an absurd level of government overreach &amp; should alarm every American.","date":"Tue Oct 26 19:35:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Thanksgiving 2021 is shaping up to be the most expensive meal in the history of the holiday.”\nhttps://t.co/MIYeKDLkZw","date":"Tue Oct 26 17:42:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, on the National Day of the Deployed, we recognize and honor all service members deployed around the globe to protect our freedom and keep us safe. Thank you also to the families of deployed service members for the countless sacrifices you make for us. 🇺🇸 https://t.co/nztnp0xQad","date":"Tue Oct 26 16:08:35 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposal to vastly expand the reach of the IRS to help pay for their misguided tax-and-spend spree is a terrible idea – and should alarm every law-abiding American. https://t.co/By2cDp3eta","date":"Mon Oct 25 21:23:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Empty shelves. \nGas prices at a 7-year high. \nIncreased prices at the grocery store.\n\nDemocrats’ reckless tax-and-spend spree will do *nothing* to help Americans during this economic crisis.","date":"Mon Oct 25 20:50:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨🚨🚨\nThere is not one state in the U.S. that has an average gas price below $3 per gallon.\nhttps://t.co/0CkBy12a44","date":"Mon Oct 25 19:40:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“What they’re really doing is working hard to pack $4 trillion in new programs into a $2 trillion disguise that sounds less radical than it is.” https://t.co/A2uZoWcwT3","date":"Fri Oct 22 18:14:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under the Democrats’ proposal, the IRS could spy on Americans’ individual transactions.\n\nThis is an extreme invasion of privacy.","date":"Fri Oct 22 18:02:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Empty shelves. \nRising costs.\nGas prices at a 7-year-high. \n\nPresident Biden’s economic crisis is costing American families. https://t.co/6rSuI80ETZ","date":"Fri Oct 22 16:25:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My friend @SenStabenow has been an incredible advocate for mental health. Her tireless work to expand access to mental health care has changed lives and it's an honor to work with her on this significant effort","date":"Fri Oct 22 15:20:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always great to catch up with @MayorLucasKC and discuss how we can continue working together to advance KCMO’s priorities. It’s an exciting time for Kansas City. https://t.co/dQm4iVSEEU","date":"Wed Oct 20 22:03:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Soaring prices for everyday items. \nHighest gas prices since 2014. \nInflation. \nThis is President Biden’s economy.","date":"Wed Oct 20 22:02:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday was an exciting day for our state, the future of medical research, and all those whose lives will be changed by the breakthroughs made at NextGen https://t.co/gSs4SXax8g","date":"Wed Oct 20 20:14:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KSMU: Blunt visits rural areas to advocate for broadband expansion and vaccines https://t.co/k37AOQYVR7","date":"Wed Oct 20 19:04:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with Jeff Boyer from McCarthy HITT and Jason Klumb to talk about the latest construction on the new NGA West HQ. The new NGA West will further MO’s role as a hub for geospatial innovation, create jobs, advance STEM education, and help keep our country safe. https://t.co/uq9XfNfKBy","date":"Wed Oct 20 18:21:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/kQMdz9ESVy","date":"Tue Oct 19 21:13:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"During my time in Congress, ensuring medical researchers have the resources they need to do their critical work has been a top priority &amp; will remain so until I leave.","date":"Tue Oct 19 21:12:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At a pivotal time for medical research, this state-of-the-art facility will house top researchers working to discover new treatments &amp; cures.","date":"Tue Oct 19 21:12:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Precision medicine has the potential to completely transform health care delivery &amp; Missouri is a national leader in the field. I was proud to be a part of the opening of the @Mizzou NextGen Precision Health building today. https://t.co/v3DUvOrEz7","date":"Tue Oct 19 21:12:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Sat down with Farmington Chamber for a roundtable discussion on jobs &amp; our economy. With inflation, skyrocketing prices, and last week’s dismal jobs report, it’s a difficult time for American workers &amp; Main Street businesses. https://t.co/k3e4k4gSjZ","date":"Thu Oct 14 20:48:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We need to put policies in place that will help our economy recover &amp; grow our workforce. But Democrats are only interested in ramming a massive, reckless tax-and-spend bill through Congress.","date":"Thu Oct 14 20:48:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Toured @PurcellTire Headquarters in Potosi this afternoon. Opened in 1936 in Washington, MO, Purcell Tire has expanded to 14 states and more than 1,000 employees. https://t.co/ebxid6OLT8","date":"Thu Oct 14 20:37:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Salem to meet with South Central Ozark Development Partnership and discuss the difficulties workers and small businesses are facing right now. Instead of policies that will help get our economy back on track, Democrats are focused on their reckless tax-and-spend spree.","date":"Thu Oct 14 20:29:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Cuba this afternoon to meet with local leaders for a roundtable conversation. We discussed the issues affecting Missouri – the ongoing opioid epidemic, soaring inflation, and the need for policies that get Americans back to work. https://t.co/DjHguKTLHM","date":"Thu Oct 14 20:17:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Checked out the progress of @TexasMemorial’s new surgical center. Good to meet with CEO Chris Strickland, Foundation Director Jeff Gettys, and Jay Gentry to discuss how we can work together to improve rural health care. https://t.co/58yrXoeSmv","date":"Thu Oct 14 18:32:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Started my day at the @MissouriState Mountain Grove campus. We toured the Fruit Experiment Station &amp; discussed how their researchers are working to advance Missouri’s fruit crop industry. https://t.co/VdiATf88QU","date":"Thu Oct 14 18:17:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is an exciting time to be in STEM &amp; I’m proud MSU is leading the way to educate the next generation of the American workforce. I’ll continue to advocate for federal funding for this significant project. Thank you, President @ClifSmart &amp; Dean @TSJahnke, for all you do for MSU","date":"Wed Oct 13 22:23:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to be back at @MissouriState to hear about the terrific opportunities for students at the @CNASatMSU – from the Temple Hall renovation plan to the expansion of the state-of-the-art Ozarks Health and Life Science Center. https://t.co/WTrh12yEpx","date":"Wed Oct 13 22:23:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/adeLdlO7YG","date":"Wed Oct 13 21:26:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act \"would deliver about $20 million a year in boosted funding for 'conservation opportunity areas' across the Show Me State, where the outdoor industry supports about 100,000 jobs and generates more than $12 billion in annual economic impact.\"","date":"Wed Oct 13 21:26:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Speaker Pelosi confirmed: Democrats’ proposal to allow the IRS to snoop around your bank account WILL be included in Democrats’ reconciliation bill. This invasion of privacy should alarm every law-abiding American. https://t.co/DtTsYfCaQ2","date":"Wed Oct 13 19:42:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering Americas Wildlife Act \"would represent the largest, most significant investment in wildlife and habitat conservation in a generation.\" https://t.co/JBfjnCHYUo","date":"Wed Oct 13 17:51:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy birthday, @USNavy 🇺🇸 Thankful for the brave men and women who protect us at home and overseas","date":"Wed Oct 13 16:42:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Because of the pandemic, we’ve seen firsthand just how critical telehealth is. My TREAT Act builds on this to ensure more Americans have access to health care. https://t.co/YEwnWsffwK","date":"Tue Oct 12 21:20:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My bipartisan Recovering America’s Wildlife Act \"would mean millions of dollars more for projects to protect vulnerable species in Missouri.\"\nhttps://t.co/FQCVQI7o3s","date":"Tue Oct 12 18:50:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, on #NationalFarmersDay, thank you to all the Missouri farmers who are feeding and fueling the world. https://t.co/GHFyBsksar","date":"Tue Oct 12 16:26:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Only 194,000 jobs were added in September -  despite the expected 500,000. \n\nInstead of more reckless spending, we need policies that get Americans back to work and get our economy back on track.","date":"Fri Oct 08 22:04:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Telehealth has been a lifeline for many people throughout the pandemic. At a Commerce Committee hearing this week, I asked the panel to weigh in on how we can make telehealth more accessible: https://t.co/ijVh2BjScJ","date":"Fri Oct 08 21:38:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy.","date":"Fri Oct 08 17:13:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The U.S. economy created jobs at a much slower-than-expected pace in September, a pessimistic sign about the state of the economy.”\n\nThis is unacceptable. But sadly it’s become the status quo under the Biden administration. \nhttps://t.co/SFO32s1Jha","date":"Fri Oct 08 17:13:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wildlife and habitat preservation are important to states across the nation. Missouri is no exception, with some of the best hunting, fishing, and outdoor recreation in the country.","date":"Fri Oct 08 14:38:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m encouraged by the strong, bipartisan, and growing support for the Recovering America’s Wildlife Act &amp; hope to see it considered by the EPW Committee soon. https://t.co/rfTaxqXCHk","date":"Fri Oct 08 14:38:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My statement on the debt limit vote: https://t.co/OsSxGPqszx","date":"Fri Oct 08 01:05:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to Fulton Middle School Principal Beth Houf for being recognized as the 2022 National Principal of the Year https://t.co/kxnrROkUYf","date":"Thu Oct 07 20:54:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are feeling the pinch at the pump – gas prices are the highest they’ve been since 2014.  https://t.co/psnQStlhIV","date":"Thu Oct 07 18:56:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KQ2: @MissouriWestern announces partnership with Family Guidance Center to address mental health\nhttps://t.co/dP09kVqecv","date":"Thu Oct 07 18:16:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"An exciting day decades in the making for Southwest Missouri &amp; Northwest Arkansas – the I-49 Missouri-Arkansas Connector Project is complete. This interstate project will increase safety, improve the quality of life, and strengthen local economies. https://t.co/FqPmcF5gwe","date":"Wed Oct 06 22:04:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats' $3.5 trillion tax-and-spending spree is: \n⚪Reckless\n⚪Massive\n⚪Extreme\n🔘All of the above","date":"Wed Oct 06 21:46:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"But no one is preventing Democrats from doing their job. The Democrats can pass anything they want in the House. In the Senate they have 50 votes, plus the Vice President, to pass anything budget related through reconciliation.\" https://t.co/WjIpq97gQg","date":"Wed Oct 06 19:50:35 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ proposal would enable the IRS to monitor what goes in and out of Americans’ bank accounts. This would be an unprecedented invasion of privacy. https://t.co/ezT3ThClDY","date":"Tue Oct 05 21:26:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Democrats’ reckless tax-and-spend spree will hurt American families.","date":"Tue Oct 05 20:54:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"On your next trip to the ATM, imagine that Uncle Sam is looking over your shoulder. As if your annual tax filing wasn’t invasive enough, the Biden Administration would like a look at your checking account.\"\nhttps://t.co/ezT3ThClDY","date":"Tue Oct 05 19:02:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"💯 more","date":"Tue Oct 05 17:43:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have packed radical, far-left policies into their massive tax-and-spend spree – and expect American taxpayers to pay for their extreme agenda.","date":"Tue Oct 05 16:08:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@NIHDirector Dr. Collins is the only presidentially appointed @NIH Director to serve more than one administration – a testament to the confidence &amp; respect he garnered on both sides of the aisle.\nMy full statement on Dr. Collins' announcement: https://t.co/MyBgFAZQBk","date":"Tue Oct 05 14:00:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At a time when inflation is at a 30-year high, Democrats are pushing a massive, reckless tax-and-spend spree that’ll leave American families with higher taxes and more debt.","date":"Mon Oct 04 20:48:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations, Coach.","date":"Mon Oct 04 19:44:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“All of these measures have moved from signaling price stability to signaling sharp accelerations in underlying inflation.” https://t.co/S9zzNBefWX","date":"Mon Oct 04 18:19:36 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It was great to be in St. Louis today for a first-hand look at the progress being made on the new @NGA_GEOINT West facility. I appreciate the hard work by local, state, and federal officials to make sure the NGA – and the thousands of jobs it supports – remain in St. Louis. https://t.co/pJWS6P1R1A","date":"Fri Oct 01 21:49:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’ll keep working to ensure the agency has the resources it needs to carry out its mission, and I look forward to seeing the New NGA West facility in St. Louis when it’s completed. https://t.co/RGtxhObz4W","date":"Fri Oct 01 19:24:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, the Senate passed a resolution I helped introduce to recognize the 25th anniversary of @NGA_GEOINT. I appreciate all that the NGA &amp; its team of intelligence professionals in #MO &amp; across the globe have done, and continue to do, to keep us safe.","date":"Fri Oct 01 19:24:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Recovering America’s Wildlife Act “focuses on collaborative solutions that save species before they need emergency protections, while also accelerating the recovery of threatened and endangered species.” https://t.co/e29r05vrUo","date":"Fri Oct 01 19:04:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy 95th birthday to the Historic Gillioz Theatre https://t.co/jJ1gob2wVI","date":"Fri Oct 01 18:48:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, seven #MO Community Mental Health Centers received a total of $25 million in grant funding. I’m glad these centers will have additional support to provide timely, affordable, and high-quality care to people in need. https://t.co/8bfx8ZpLLB","date":"Thu Sep 30 18:14:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a longtime advocate for improving mental health care, I’m very concerned with the significant increase in Americans who are struggling with substance use, depression, anxiety, and other mental &amp; behavioral health challenges during the pandemic.","date":"Thu Sep 30 18:14:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless tax-and-spend spree would hurt middle-class Americans. https://t.co/bWaLFYUKw0","date":"Wed Sep 29 21:39:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In Missouri, the beer industry isn’t just a big part of our economy, it’s a big part of our history. Thank you to the @beerinstitute for this award &amp; thank you to all the farmers, brewers, bottlers, drivers, distributers &amp; retailers who pushed through the pandemic's challenges. https://t.co/frfJxZCerG","date":"Wed Sep 29 19:45:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Hardworking Americans should not be stuck with the bill for Democrats’ massive, reckless tax-and-spend spree.","date":"Wed Sep 29 19:06:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Important details about the Pfizer booster shot ⤵️","date":"Wed Sep 29 16:03:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Democrats’ $3.5 trillion tax-and-spend spree is 67% higher than the $2.1 trillion spent by all 50 states combined in 2019. Let that sink in. https://t.co/oyWKEKM9qa","date":"Tue Sep 28 21:17:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"👎Inflation is up.\n👎Americans are paying higher prices for everyday items.\n👎Small businesses are struggling to recover from the pandemic.\n\nBut Democrats still think it’s a good idea to push another massive tax-and-spend spree and stick Americans with the bill.","date":"Tue Sep 28 19:34:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“If the White House thinks these programs are worth the cost, it could make that case. Instead the political situation is apparently so desperate that it’s resorting to deception that is transparently ludicrous.” https://t.co/5JygThhv6f","date":"Tue Sep 28 17:15:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Hardworking Americans cannot afford a $3.5 trillion bill to pay for Democrats’ reckless, extreme tax-and-spend spree.","date":"Tue Sep 28 16:06:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Get the facts. Talk to your doctor. Consider getting vaccinated.","date":"Mon Sep 27 20:55:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"An analysis by the nonpartisan Joint Committee on Taxation shows Democrats’ proposed corporate tax hikes would disproportionately harm American workers, retirees, &amp; small businesses. https://t.co/wUyAkGP0bh","date":"Mon Sep 27 18:52:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to see @SuperSamHeroes youth ambassadors today from Fulton. Thanks for all your work fighting for pediatric cancer patients and survivors. This has been a longtime priority for me and I’ll continue doing all I can to support your lifesaving work. https://t.co/kshqMPWRce","date":"Fri Sep 24 20:36:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From the gas pump to the grocery store, Americans are paying increased prices for everyday items. Democrats’ plan to spend another $3.5 trillion is not going to help hardworking Americans. https://t.co/QLNUFcLRRy","date":"Fri Sep 24 20:13:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Families are already facing historic inflation. Democrats’ reckless tax-and-spend spree will only make this worse. https://t.co/AHkXJLLgB3","date":"Fri Sep 24 19:24:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"No better way to honor Sen. Johnny Isakson’s mark on the Senate than to carry on this bipartisan – &amp; delicious – tradition. The members of the Senate may not always see eye to eye, but we should always find ways to work together for the people we serve, just as Johnny always did.","date":"Fri Sep 24 18:21:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans deserve more details on how the administration will use vaccines to combat COVID-19 with clear and concise plans that put science ahead of politics. https://t.co/SxkxLJRTgu","date":"Fri Sep 24 18:12:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"These heroes did what only the bravest and most extraordinary Americans do: risked their safety to protect and defend our country and the values we stand for.","date":"Fri Sep 24 14:26:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We must do our part, every day, to live a life worthy of their sacrifice – never taking for granted the freedom and security we have because they answered the call to serve. https://t.co/HOvXRPxArR","date":"Fri Sep 24 14:26:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, the Senate passed a resolution I helped introduce to honor Lance Corporal Jared Schmitz and all of the Missouri service members who made the ultimate sacrifice in Afghanistan","date":"Fri Sep 24 14:26:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Let me be clear: I will not support raising the debt limit to pay for the Democrats’ $3.5 trillion dollar partisan wish list that raises taxes on hardworking Americans. https://t.co/VaPhhWShcP","date":"Thu Sep 23 20:06:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I was humbled to be named an Honorary Officer of the Order of Australia. Thank you to Prime Minister @ScottMorrisonMP and Ambassador @A_Sinodinos for all you’ve done, and continue to do, to strengthen the close and enduring friendship between our nations. https://t.co/OlSSg2O1nC","date":"Wed Sep 22 22:12:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Here’s how President Biden &amp; congressional Democrats are planning to pay for their radical, far-left agenda:\nhttps://t.co/ejTTFORGML","date":"Wed Sep 22 21:02:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @RiponAdvance: Ulysses S. Grant honored under bipartisan Wagner, Blunt resolution\nhttps://t.co/UZRcVVIzHx","date":"Wed Sep 22 17:15:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Let me be clear – Democrats pushing yet another massive tax-and-spend spree does NOT help hardworking Americans. https://t.co/SnkZOsFEaQ","date":"Wed Sep 22 15:35:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are sticking American taxpayers with the bill for their $3.5 trillion partisan spending spree. https://t.co/ejTTFORGML","date":"Tue Sep 21 22:03:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are using their reckless tax-and-spend spree to push their extreme, far-left agenda. This would mean higher taxes and more debt for hardworking Americans.","date":"Tue Sep 21 21:11:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to all the Missouri schools recognized today as National Blue Ribbon Schools for 2021!\n\nBloomfield MS\nDelta Woods MS\nFrancis Howell MS\nNorth Kirkwood MS\nSkyline MS\nWydown MS\nMansfield Jr. High School\nWilson's Creek 5-6 Intermediate School\nhttps://t.co/mLDIQojT1x","date":"Tue Sep 21 19:58:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ reckless tax-and-spend spree will mean higher taxes and more debt for Americans. We can’t afford this.","date":"Mon Sep 20 22:25:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are facing rising prices at the grocery store and gas pump. The last thing they need is another tax-and-spend spree. Yet Democrats are still trying to push this $3.5 trillion plan through Congress.","date":"Mon Sep 20 22:06:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"More than 93,000 lives were lost due to an overdose last year. The pandemic has made recovery even more difficult for those who are struggling. To everyone struggling with a mental health or substance use disorder, know that recovery is possible. \n📞1-800-662-HELP #RecoveryMonth","date":"Mon Sep 20 21:23:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are using their massive and reckless tax-and-spend spree to ram extreme, hyper-partisan policies through the Senate. Who will pay for this spree? American taxpayers.","date":"Mon Sep 20 19:08:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/IMqSTSwrrK","date":"Fri Sep 17 17:11:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As we approach the bicentennial of Grant’s birth early next year, this is a fitting moment to reflect on his fight for a more perfect Union, and honor his legacy and the legacy of all of the service members who have fought for this nation and the values we stand for.","date":"Fri Sep 17 17:11:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today at @usgrantnps, @RepAnnWagner &amp; I announced the introduction of a bill to honor Ulysses S. Grant &amp; his efforts to preserve our Union. Our bill requests President Biden posthumously promote Grant to General of the Armies of the United States, the @USArmy's highest rank. https://t.co/yztwzGNJVA","date":"Fri Sep 17 17:11:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Add to that the challenges of inflation, and it’s clear Democrats’ misguided policies are hurting the economy. We need to change course. https://t.co/U8BebczDt8","date":"Thu Sep 16 18:09:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"According to @NFIB, half of small business owners say they’re having trouble filling job vacancies. Governors of both parties realize we should not incentivize people to stay home when we have more open jobs than Americans looking for work.","date":"Thu Sep 16 18:09:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Republicans warned that Democrats’ enhanced unemployment benefits would make it harder to get people back into the workforce. That’s exactly what has happened. https://t.co/xH2EcVp1HS","date":"Thu Sep 16 18:08:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Officer Blaize Madrid-Evans bravely answered the call to serve and keep the people of Independence safe. Thinking of his family, friends, and the Independence Police Department during this terrible time.","date":"Thu Sep 16 12:18:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"We’re old enough to remember a time - earlier this year - when 5.3% consumer-price inflation was considered high...Nowadays when price rises hit that pace, as they did in August, everyone’s supposed to relax because that means inflation is moderating\" https://t.co/NybOpu6DsE","date":"Wed Sep 15 19:25:35 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Blunt, Hawley introduce resolution honoring Missouri service members who lost their lives in Afghanistan https://t.co/SvFxiyH3PE via @KTTSNews","date":"Wed Sep 15 17:42:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Americans spent more on taxes in 2020 than they did on food, clothing, healthcare and entertainment combined, according to newly released data from the Bureau of Labor Statistics.\" https://t.co/X4lWHl9Aid","date":"Tue Sep 14 21:29:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Our state’s greatest competitive advantage is where we live. By investing in rural development and waterways, we’ll strengthen that advantage for years to come. https://t.co/G4RMLVQ5op","date":"Tue Sep 14 19:27:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Definitely a person you should know https://t.co/ydvFuhrPB1","date":"Tue Sep 14 16:14:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My statement on the 20th anniversary of the September 11, 2001 terrorist attacks https://t.co/s8hDcIahZI https://t.co/k25n6TZ2R3","date":"Sat Sep 11 13:26:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It is a solemn reminder that our freedom is not guaranteed, it must be secured with each generation. Thank you to @FlagsofValorSTL for all you do for our service members, veterans, and their families. https://t.co/PrV6SLGgIJ","date":"Fri Sep 10 21:05:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"If you visit Art Hill in #STL today through the weekend, you will see thousands of American flags honoring those who lost their lives on 9/11 and our service members who made the ultimate sacrifice to combat terrorism and keep America safe.","date":"Fri Sep 10 21:05:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Baseball giants were inducted into the Hall of Fame this week. But there’s another giant who should be in Cooperstown, too.\n\nCurt Flood’s legendary baseball career: \n⚾2 World Series pennants\n⚾7 consecutive Golden Gloves\n⚾Three-time All Star\n\nCurt Flood belongs in Cooperstown.","date":"Thu Sep 09 16:46:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A powerful tribute to a true American hero.","date":"Thu Sep 09 15:02:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Saddened by the loss of @USNavy Hospital Corpsman 3rd Class Bailey J. Tucker from St. Louis. My thoughts are with his family, friends, and fellow sailors. https://t.co/RNcjfYFd4P","date":"Mon Sep 06 19:34:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Nearly 30% of PRF funds remain unspent, despite the challenges providers &amp; hospitals are facing due to increased expenses, delayed elective procedures, lost revenues and the costs associated with vaccinating Americans.","date":"Thu Sep 02 20:58:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I, along with @LeaderMcConnell, @SenatorBurr, @SenShelby, and @MikeCrapo, have sent a letter to @SecBecerra pressing the administration to quickly distribute PRF funds to support those on the frontlines of this pandemic. https://t.co/9dslrmSyPk","date":"Thu Sep 02 20:58:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Hospitals and health care providers have been stretched to the breaking point as they battle the surge of COVID-19 infections. Congress created the Provider Relief Fund to directly support their response efforts, yet the Biden administration has not distributed any PRF funding.","date":"Thu Sep 02 20:58:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to these brave and women. Thanks for all you have done, and continue to do, to keep our communities safe.","date":"Thu Sep 02 18:38:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, MO-based groups received $365 million in New Markets Tax Credit allocations to support economic development projects in underserved areas.","date":"Thu Sep 02 18:01:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"With yesterday's announcement, we’ll continue to see new investments that will expand opportunity and improve the quality of life in areas that need it most.","date":"Thu Sep 02 18:01:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In our state, NMTC tax credits have benefited a range of projects in communities large and small – from a social services center in St. Louis to a tech hub in Cape Girardeau.","date":"Thu Sep 02 18:01:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"@SenatorCardin and I have worked together to champion the NMTC program in the Senate and will continue our efforts to make it permanent. https://t.co/p9LgpWy88q","date":"Thu Sep 02 18:01:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I am deeply honored. This future-focused, state-of-the-art facility will give students the opportunity to work alongside medical researchers in developing new treatments for the most costly and deadly diseases.","date":"Thu Sep 02 17:58:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Lance Corporal Jared Schmitz lost his life as he bravely and selflessly worked to save others. He is a hero – to our state, our country, and all the people he helped get to safety. My gratitude and prayers are with his family and fellow Marines. https://t.co/KNsxHbWpTj","date":"Fri Aug 27 20:06:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, the United States tragically lost a number of U.S. service members in the attacks outside of the Kabul airport. I am praying for their families, for those who were injured, and for the safety of all of our troops, allies, and Afghan partners who are in harm’s way.","date":"Thu Aug 26 18:18:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"What we are seeing is the result of a poor plan poorly executed. The Biden administration must use every resource it has available to get Americans and our allies to safety.","date":"Thu Aug 26 18:18:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A very happy 100th birthday to a member of the greatest generation – Charlie Kohler","date":"Wed Aug 25 19:59:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/F5cV5KJpqd","date":"Wed Aug 25 19:38:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"People who live &amp; work along Missouri's inland waterways have faced costly &amp; dangerous flooding for too long. I met with Mayor Collier &amp; the levee board about how I can help ensure they have support at the federal/state/local level to repair infrastructure &amp; prevent future damage","date":"Wed Aug 25 19:38:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @MissouriTimes: Inside Missouri officials’ fight against the federal ‘death tax’ https://t.co/yhuFDXzStU","date":"Wed Aug 25 16:49:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Little Otter Creek Lake Project is a great example of how federal, state, and local partners can work together to create something that has a positive impact for decades to come. \n\nhttps://t.co/C9eUijOPyn","date":"Wed Aug 25 15:29:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The Missouri location will allow [@Esri]  to collaborate with startups in St. Louis’ thriving geospatial technology sector.” https://t.co/2LaU3Oih4c","date":"Mon Aug 23 21:34:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Carol Coe’s mark on Kansas City and its people will not be forgotten.","date":"Mon Aug 23 20:29:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Please consider getting vaccinated.","date":"Mon Aug 23 19:22:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @NodawayNews: Senator Blunt visits Northwest’s Ag Learning Center https://t.co/TkMkQfXRsO","date":"Mon Aug 23 18:18:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The pandemic showed us that broadband isn’t a luxury, it’s an essential. \nWe need to continue our push to bring high-speed broadband to every part of our state. https://t.co/S7wGKIT1Cx","date":"Fri Aug 20 20:23:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Just over 2 years ago, I toured the construction of the @Missouri_NG AVCRAD facility. Today, we officially cut the ribbon for this innovative site that will support #MOGuard priorities &amp; strengthen our military readiness. https://t.co/lfBLvxmwRn","date":"Fri Aug 20 17:23:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"During the pandemic, we learned just how critical a reliable broadband connection is. Closing the digital divide has been a priority for me for years and I’ll continue working to provide more Missourians with access to broadband. https://t.co/T1JYjy3aZ7","date":"Fri Aug 20 15:34:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Access to broadband is not a luxury. It’s an essential connection. https://t.co/pDaNParSDm","date":"Thu Aug 19 22:21:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @kq2: Senator Blunt touts progress on visit to Little Otter Creek in Caldwell County https://t.co/07Gh1DYRlY","date":"Thu Aug 19 21:08:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Blunt joined Boone County leaders in a discussion on broadband access Wednesday afternoon, gathering feedback from educators and providers on the effort to strengthen Missouri’s network.\"\nhttps://t.co/cOwlrdFNhZ","date":"Thu Aug 19 19:47:05 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s good to be back at @MOStateFair talking with @MOFarmBureau about the opportunities Missouri’s farmers &amp; ranchers have right now. In Washington, I’m focused on making sure they have the tools they need to not only compete, but lead the way in a global economy. #MOStateFair https://t.co/HPuDc4P17v","date":"Thu Aug 19 18:38:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I'm also committed to fighting Democrats’ proposed changes to the death tax that would significantly raise taxes on Missouri family farms &amp; ranches to help pay for their reckless, massive tax-and-spend spree.","date":"Thu Aug 19 18:38:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always great to stop at the @MOStateFair Fire House &amp; spend time with our volunteer firefighters. Thank you for all you do for us","date":"Thu Aug 19 17:44:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Broadband affects nearly every Missourian – from the student working on their homework to a farmer planning their crops. I’ve been a strong advocate for expanding broadband for years &amp; will continue working to secure resources to bring broadband to every corner of our state.","date":"Wed Aug 18 21:44:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I joined a roundtable w/ Boone Co Commissioner Janet Thompson &amp; local leaders to talk about a very important topic: expanding access to broadband. To close the digital divide, we need to know where broadband is available, at what level &amp; which areas remain completely unserved. https://t.co/jsL83g6JkO","date":"Wed Aug 18 21:44:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is a priority I’ll continue working toward as I finish my final term in the Senate. Thank you to the Mizzou Legislative Network of the @MizzouAlumni Association for this award. #MIZ 🐯\n📷: Schaefer Photography https://t.co/SnLCIf0TFa","date":"Wed Aug 18 19:47:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It was an honor to receive @Mizzou’s Geyer Award alongside Mary Anne McCollum. As the first in my family to graduate from college, I know how important it is to put #highered within reach for more students. I've worked to expand access to higher ed during my time in Congress","date":"Wed Aug 18 19:47:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I sat down with @COMOChamber members to talk about the top concerns of Columbia’s #smallbiz community and how we can work together to support Columbia’s workforce. https://t.co/gnwkT2bc3K","date":"Wed Aug 18 17:41:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I met w/ @BooneHealth CEO Troy Greer to discuss the hospital’s fight against COVID.\n\nA very big thank you to all the health care professionals at @BooneHealth for all you’ve done, and are continuing to do, for us.\n\nVaccines are how we end this. Please consider getting vaccinated.","date":"Wed Aug 18 16:34:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to chat with @CMUniv President Dr. Drake this afternoon. Thanks for all you’re doing for CMU, go Eagles 🦅 https://t.co/SP3nPjqTJp","date":"Tue Aug 17 21:51:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Brunswick this afternoon to participate in a roundtable w/ the L-246 Brunswick Levee Board &amp; city officials. MO is a national transportation hub &amp; to take full economic advantage of where we live, we need to prioritize flood control &amp; navigation of our inland waterways. https://t.co/ZtEb6FdCDm","date":"Tue Aug 17 20:29:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I started today touring the Little Otter Creek Lake site &amp; getting a project update. The 344-acre reservoir will provide a reliable water supply for about 10,000 people, along with flood control &amp; recreation. Over the last several years, I've worked to secure $16M for the project https://t.co/VMjUPddvo9","date":"Tue Aug 17 18:34:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Terrific to check out the @NWMOState Agricultural Learning Center. This center in Maryville will support our strong #MOAg community for generations to come and help ensure Missouri farmers &amp; ranchers have the tools they need to feed and fuel the world. https://t.co/tuz1tP5W2r","date":"Tue Aug 17 17:39:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It was good to meet @MissouriWestern President Dr. Elizabeth Kennedy. We discussed Missouri Western’s new initiatives and how the university is navigating through the pandemic. https://t.co/6vaZBi63zh","date":"Tue Aug 17 16:15:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In Washington, I’m focused on making sure our farmers, ranchers, and businesses have the tools they need to not only compete but lead the way in a global economy.\nhttps://t.co/PWr3VExUIC","date":"Tue Aug 17 15:24:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I am grateful to all of the U.S. military, intelligence, and diplomatic personnel who have served in Afghanistan. We will always honor the sacrifices that they and their families have made.","date":"Mon Aug 16 20:40:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The U.S. could have maintained a limited presence that provided stability in Afghanistan and protected our national security interests. This chaotic withdrawal will, in my view, prove to be a major mistake.","date":"Mon Aug 16 20:40:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The most important thing President Biden &amp; his admin have to do now is get the Afghan people who stood by our side to safety. They risked their lives for our nation &amp; we can’t abandon them. Failing to provide for their safety will be something our country regrets for a long time.","date":"Mon Aug 16 20:40:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The catastrophe that has unfolded in Afghanistan was an unforced error. We are now faced with a devastating collapse of our intelligence gathering capabilities while terrorists regain a foothold to launch attacks against the United States and our allies.","date":"Mon Aug 16 20:40:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Consumer prices rose 5.4% over the last 12 months. That’s two months in a row, after a 5% annual increase in May.\"\nhttps://t.co/YwYCUnYfrt","date":"Thu Aug 12 17:13:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨 @MOStateFair will be partnering with local health officials to provide COVID vaccines, details here: https://t.co/LKJnk1lOkS","date":"Wed Aug 11 21:23:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats rammed their reckless tax-and-spend plan through the Senate. \n\nThis plan reads like a progressive wish list and will mean more taxes and more debt for Americans.","date":"Wed Aug 11 18:57:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ tax-and-spend spree will stick Americans with higher taxes and more debt. We can’t afford this.\n\n https://t.co/RzRxw71GHd","date":"Tue Aug 10 20:40:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"On this date, two centuries ago, Missouri entered the Union as its 24th state.\n\nAnd you can’t talk about American history without talking about Missouri history – especially the men and women whose achievements helped shape who we are today, and where we are today. #Missouri200 https://t.co/KOpq1BPuri","date":"Tue Aug 10 18:49:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, Democrats will try to ram their reckless tax-and-spend spree through the Senate. Who will pay for this? Every American.","date":"Tue Aug 10 15:58:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Location is one of our greatest competitive advantages in Missouri. The investments in this bill will help us maintain that advantage and improve the quality of life for families, businesses, and farmers. https://t.co/oe2opmIJMm","date":"Tue Aug 10 15:53:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The legislation authorizes more than $8 billion to help our state improve the safety and reliability of our roads and highways. And, it focuses resources toward ending the digital divide that has left nearly one-third of rural Missourians without access to broadband.","date":"Tue Aug 10 15:53:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a national transportation hub, Missouri is among the states that will benefit the most from the targeted investments in the bipartisan infrastructure bill.","date":"Tue Aug 10 15:53:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri has so many achievements over the past 200 years to think about and commemorate. #Missouri200 #MissouriBicentennial https://t.co/QffS8RiFvO","date":"Tue Aug 10 15:09:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"$3,500,000,000,000 of liberal wish list policies – and Democrats are sticking Americans with the bill","date":"Tue Aug 10 14:16:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, we celebrate 200 years of Missouri statehood.\n \nOur bicentennial is a time to celebrate the significant contributions Missouri has made to the United States and to the world.\n \nWith our remarkable past, Missouri has a bright future ahead of us.\n \nHappy 200 years, Missouri! https://t.co/F6XfE5EhPK","date":"Tue Aug 10 12:00:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ $3.5 trillion plan will mean higher taxes and more debt. We can’t afford this reckless spending.","date":"Mon Aug 09 22:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Get the facts.\nTalk to your doctor.\nConsider getting vaccinated. \n\nhttps://t.co/uGkunE5IME","date":"Mon Aug 09 21:33:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s inflation is hurting American families. \n\nhttps://t.co/W3T272rSIX","date":"Mon Aug 09 20:26:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri’s turning the big 2-0-0 tomorrow!","date":"Mon Aug 09 19:58:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Who is going to pay for Democrats’ reckless tax-and-spending spree? Everyone. \n\n https://t.co/RzRxw71GHd","date":"Mon Aug 09 19:24:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID shots are easily accessible across our state. Go to https://t.co/uOkOp2rZ5t to a location near you.","date":"Mon Aug 09 16:51:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines were developed following all the applicable requirements. They went through rigorous testing involving tens of thousands of Americans.\n\nLike millions of Missourians, I’m vaccinated.\n\nVaccines are how we get back to normal. They’re safe, accessible, and effective.","date":"Fri Aug 06 19:47:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Get the facts on COVID vaccines. Talk to your doctor. Consider getting vaccinated. \n\nhttps://t.co/uGkunE5IME","date":"Fri Aug 06 16:00:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are already getting hit in the wallets because of inflation. Democrats’ reckless tax-and-spend spree will only make this worse for taxpayers.","date":"Thu Aug 05 22:32:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Community health centers provide greater access to affordable, quality care for Missourians. Today, I met with @JordanValleyCHC to discuss COVID’s impact &amp; how vaccines will end this pandemic. https://t.co/xaKwjjDwPb","date":"Thu Aug 05 21:52:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Honored to be part of the signing ceremony awarding Congressional Gold Medals to the @CapitolPolice and @DCPoliceDept and law enforcement who defended the @USCapitol on Jan 6","date":"Thu Aug 05 21:10:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"YMCAs do so much to strengthen our communities. Glad to meet this morning with Patty, Devontae, and Katie to discuss how we can work together to support Missouri kids. https://t.co/Ru7qLpzjNZ","date":"Thu Aug 05 19:08:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vaccines are safe and effective. They’re how we end this pandemic. Please consider getting vaccinated.","date":"Thu Aug 05 18:11:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vaccines are how we stop COVID &amp; get back to our normal lives. They’re safe, effective, and accessible. https://t.co/SRiMIdaNaU","date":"Wed Aug 04 22:01:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"With the recent rise in inflation, Democrats’ continued push for a massive tax-and-spend spree is reckless.","date":"Wed Aug 04 20:27:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy 231st birthday, @USCG! Thank you for keeping America safe https://t.co/eyr8p1H2k0","date":"Wed Aug 04 18:01:27 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Nixa’s own Courtney Frerichs is bringing home silver! Congratulations, @CourtFrerichs8 🥈🇺🇸","date":"Wed Aug 04 17:22:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, the Senate unanimously passed a bipartisan bill awarding Congressional Gold Medals to the law enforcement officers who bravely defended the Capitol on January 6th. https://t.co/ZC04gY7PiW","date":"Wed Aug 04 16:34:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines were developed following all the applicable requirements. They went through rigorous testing involving tens of thousands of Americans.\n\nLike millions of Missourians, I’m vaccinated. Here’s how to find a vaccine location near you: https://t.co/VJyUusuCMY","date":"Tue Aug 03 22:23:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Tax.\n\nSpend.\n\nTax.\n\nSpend.\n\nEven though Americans are hurting from inflation &amp; skyrocketing prices for everyday items, Democrats are doubling down on their failed economic policies with a massive tax-and-spend spree.","date":"Tue Aug 03 21:53:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vaccines are how we finish the fight against COVID. They’re safe, effective, and free. Please consider getting vaccinated.","date":"Tue Aug 03 21:27:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was proud to join @SenAmyKlobuchar on the Senate floor to secure unanimous support for the bill, which I hope sends a clear message to law enforcement officers that we're united in our appreciation of all they do to keep us safe. https://t.co/6enzmu33vT","date":"Tue Aug 03 20:24:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, the Senate passed legislation awarding congressional gold medals to the law enforcement officers who defended the Capitol on January 6th, sending the bill to the president’s desk. https://t.co/vkCsNvrir3","date":"Tue Aug 03 20:24:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to #KCMO’s @ChrisNilsen2🥈🇺🇸","date":"Tue Aug 03 19:56:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At a time when Americans are feeling the pinch at the grocery store and the gas pump, Democrats are pushing a massive tax-and-spend spree – and sticking taxpayers with the bill.","date":"Mon Aug 02 23:24:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Because of vaccines, we have a pathway out of this pandemic. COVID vaccines are safe, effective, and accessible. Please consider getting vaccinated. https://t.co/VJyUusuCMY","date":"Mon Aug 02 22:56:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Soaring inflation. Skyrocketing prices for everyday items. \n\nDemocrats’ solution? Continue their reckless tax-and-spend spree that’s hurting American families.","date":"Mon Aug 02 21:58:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missouri's bicentennial is a time to celebrate the significant contributions our state has made to the United States and to the world. To understand the history of America, you need to understand the history of Missouri. https://t.co/GwJvjaa2dV","date":"Mon Aug 02 21:02:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vaccines have ended infectious diseases in the past and we can have the same result against COVID. The COVID vaccines were developed following all the applicable requirements and were approved after rigorous testing.\n\nI got my shot, I hope you'll consider getting yours.","date":"Mon Aug 02 19:44:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Researchers worked tirelessly to create vaccines to fight a once-in-a-century pandemic. They’re safe, they’re effective, and they’re free. Use this helpful resource to find a vaccine location near you: https://t.co/VJyUusuCMY","date":"Mon Aug 02 18:39:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Being vaccinated means protecting the people you love, the community where you live, and yourself. Please consider getting the shot.","date":"Wed Jul 28 21:38:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Many Americans are struggling to make ends meet because of rising inflation. Now, Senate Democrats want to raise taxes on middle-class families to pay for their reckless tax-and-spend spree. https://t.co/aqe250JqXK","date":"Wed Jul 28 20:36:24 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines are free and accessible around our state. Click here to find a vaccine site near you: https://t.co/VJyUusuCMY","date":"Wed Jul 28 20:11:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Kole from Monett is a husband and a father to two young kids. He was in the hospital very sick with COVID. Sharing his experience, he said:\n\"I just remember sitting in the hospital and just thinking to myself, you could have avoided this.’\" https://t.co/ipxEn00rDk","date":"Wed Jul 28 19:48:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"❌ Rising inflation.\n❌ Increased prices for everyday items. \n\nOn top of all of this, Democrats are doubling down on their failed economic policies and pushing for a massive tax-and-spend spree. And sticking American taxpayers with the bill.","date":"Wed Jul 28 18:27:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"”I just remember sitting in the hospital, and just thinking to myself, ‘you could have avoided this, you could have made the smart decision to get a vaccine,’” said Eden. https://t.co/fGNjDdw7tc","date":"Wed Jul 28 17:41:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines are safe, effective, and free. Like millions of Missourians, I’m vaccinated against COVID.\n\nPlease consider getting vaccinated today.","date":"Wed Jul 28 16:37:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Got to check out the new, all-electric F-150 Lightning and E-Transit cargo today outside of the Capitol. Thank you to the Missouri Ford workers who are building the E-Transit cargo 🇺🇸They’re driving American innovation forward https://t.co/3GrXi597pe","date":"Tue Jul 27 22:00:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Had my daughter been vaccinated, I think she would still be here with us.\"\n\nA heartbreaking story that has happened to too many families. Please consider getting the vaccine. https://t.co/B2iB8Vz2na","date":"Tue Jul 27 21:33:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today I shared stories from Missourians who have become seriously ill or lost families members to COVID &amp; are encouraging others to get vaccinated. I hope everyone will consider what they have to say.\n\nHelpful resource to find a vaccine location near you: https://t.co/VJyUusuCMY https://t.co/raIZST1bd2","date":"Tue Jul 27 20:55:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Under a bill cosponsored by U.S. Sen. Roy Blunt, state departments of conservation would be in line for a new funding source to protect land where plants and animals could prosper.\"\nhttps://t.co/wzTIgptESk","date":"Tue Jul 27 20:06:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"There are so many places across #MO where you can see and experience our state and nation’s history, from the Gateway Arch in St. Louis to the Negro Leagues Baseball Museum in Kansas City.","date":"Tue Jul 27 17:41:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I joined my MO congressional colleagues in introducing a resolution marking Missouri’s bicentennial https://t.co/NXJ29mQauM","date":"Tue Jul 27 17:41:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This year, we’re celebrating Missouri’s bicentennial. You can’t talk about American history without talking about Missouri history – especially the men and women whose achievements helped shape who we are and where we are today.","date":"Tue Jul 27 17:41:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to be back at @NGA_GEOINT West for another exciting milestone – the launch of Moonshot Labs 🚀 NGA’s first-ever dedicated unclassified innovation space will be a hub for cutting edge advancements to keep our country safe #NGAinSTL https://t.co/4skPSnGJS2","date":"Fri Jul 23 23:40:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, I checked out the DOT Foods Innovation showcase happening at America’s Center. Good to chat with people about their products &amp; what they’re working on https://t.co/BMzpjGYPmG","date":"Fri Jul 23 21:19:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ massive tax-and-spend spree would increase the burdens American families are already experiencing because of inflation.\n\n https://t.co/Otslh4MliX","date":"Thu Jul 22 22:28:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"I lost a couple a people to the COVID. Plus, that Delta variant is here, so I got the shot,\" said 67-year-old Glenn Snowden.\n\nhttps://t.co/t9GcKnk5o1","date":"Thu Jul 22 21:40:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ tax increases would: \n\n▶️ have a devastating impact on family-run farms, ranches, and small businesses\n\n▶️ impose a double death tax by eliminating the “stepped-up basis” https://t.co/82IwZ4auNQ","date":"Thu Jul 22 21:00:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are paying: \n📈7.5% more for whole milk\n📈 45% more for gas\n📈 45% more for used cars\n\nWe can’t afford Democrats’ reckless tax-and-spend spree","date":"Thu Jul 22 18:33:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Senator Roy Blunt is working across the aisle on a bill to allocate nearly $1.4 billion/year to local wildlife preservation efforts across the country.\"\nRecovering America’s Wildlife Act is estimated to send $21M+ to the MO Dept of Conservation each year\nhttps://t.co/XEs6eWwEXk","date":"Thu Jul 22 17:21:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The sooner we know a cyberattack has occurred, the sooner we can evaluate the threat, repair the damage, and respond to a direct attack on our critical infrastructure https://t.co/6EkLBrhQlZ","date":"Wed Jul 21 22:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are doubling down on their failed economic policies with a massive, reckless tax-and-spend spree. And American taxpayers will be stuck footing the bill.","date":"Wed Jul 21 21:47:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"@SenatorHagerty Shocker: Former history teacher can’t pass up the chance to talk about history. Great to meet your family!","date":"Wed Jul 21 21:16:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are seeing: \n❌Increased prices for everyday items\n❌Inflation that’s expected to last for awhile\n\nDemocrats’ solution is a massive tax-and-spend spree.","date":"Wed Jul 21 21:09:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ $3.5 trillion plan is nothing more than a tax-and-spend spree – the last thing Americans need as they face skyrocketing prices and surging inflation. \n\n https://t.co/Otslh4uKrp","date":"Wed Jul 21 20:09:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"To reiterate…","date":"Wed Jul 21 19:57:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This is heartbreaking. Vaccines are how we save lives. Please consider getting a vaccine. \nhttps://t.co/fygIFwyrbu","date":"Wed Jul 21 18:50:17 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Senate Democrats are pushing a vote on an infrastructure bill that \n1.) has not been written yet\n2.) could upend bipartisan negotiations toward a final agreement https://t.co/RcJRaY4vSL","date":"Tue Jul 20 22:02:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Protecting and restoring wildlife habitat is absolutely essential if we want to pass on our natural heritage and traditions like hunting, fishing, and wildlife watching to our kids. The Recovering America’s Wildlife Act makes historic investments to #RecoverOurWildlife. #RAWA","date":"Tue Jul 20 21:17:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, Sen. @MartinHeinrich &amp; I introduced the Recovering America’s Wildlife Act, which makes the largest, most significant investment in wildlife &amp; habitat conservation in a generation.\n\nWe owe it to our kids and their kids to #RecoverOurWildlife. #RAWA https://t.co/pNx1O7mpOX","date":"Tue Jul 20 20:41:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Americans are seeing increased costs for everyday items &amp; feeling the squeeze caused by President Biden’s inflation.\n\nBut Democrats’ response is to go on another reckless tax-and-spend spree.","date":"Tue Jul 20 19:48:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines are safe and effective. They’re also how we end this pandemic and return to normal. I received my shot, I hope you’ll get yours. https://t.co/gg2vIeLsJ0","date":"Tue Jul 20 15:51:27 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under Democrats’ watch, inflation has skyrocketed &amp; prices for items we use every day, like whole milk and gas, are climbing. https://t.co/W3T272rSIX","date":"Mon Jul 19 21:52:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are continuing their irresponsible tax-and-spend spree – and American families are paying the price. https://t.co/HOV8mKKs2E","date":"Mon Jul 19 21:30:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From gas to groceries, prices are soaring. Inflation is hitting hardworking Americans. But Democrats’ solution is to double down on their failed economic policies – a reckless taxing and spending spree.","date":"Mon Jul 19 20:48:36 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Compared to one year ago, in June, Americans paid more for:\nGasoline – ⬆️ 45%\nWhole Milk – ⬆️ 7.5%\nAirfare – ⬆️ 25%\n\nAnd Treasury Secretary Yellen said last week that rapid inflation will be around for “several more months.”","date":"Mon Jul 19 18:37:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ failed tax and spend policies are hitting Americans in their wallets, causing inflation to surge and prices to soar.","date":"Fri Jul 16 20:55:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to @LUBlueTigers' graduates of the LU Law Enforcement Training Academy. Best of luck in your careers &amp; thank you for all you’ll do to protect your communities. https://t.co/vEJJxRp0cQ","date":"Fri Jul 16 18:08:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Surging inflation is hurting American families.\n\nIn June:\nGasoline ⬆️ 45%\nWhole Milk ⬆️ 7.5%\nAirfare ⬆️ 25%\n\nDemocrats’ solution? Continue their spending spree.","date":"Fri Jul 16 16:59:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ costly policies are fueling inflation, holding back the economy, and continuing to hurt American families. The Democrats’ belief that spending without limit won’t cause any problems is outrageous. https://t.co/gy3uO3ZHBb","date":"Thu Jul 15 19:56:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"👀Spotted Weston, MO on this list of the 10 best small towns in the Midwest \nhttps://t.co/8BBGBLgEEG","date":"Wed Jul 14 22:08:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At an Appropriations hearing today, I questioned @USDOL @SecMartyWalsh regarding unemployment challenges small businesses are facing, expanding workforce training opportunities, and the importance of lowering barriers to #milspouse employment. https://t.co/aRyMkdYEBs","date":"Wed Jul 14 21:50:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines are safe, effective, and free. Vaccines are the way out of this pandemic. https://t.co/d3YmWsaDfQ","date":"Wed Jul 14 21:46:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Glad to see OMB isn’t moving forward with a proposed change to the federal definition of “city.” This proposal could have negatively impacted federal funding in Missouri communities like St. Joe, Cape Girardeau, Joplin, and Jeff City. https://t.co/QgYcPcNSZE","date":"Wed Jul 14 20:49:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ inflation is hurting Americans. \n\n“The consumer price index increased 5.4% from a year earlier, the largest jump since August 2008.” \n\nhttps://t.co/HOV8mKKs2E","date":"Wed Jul 14 19:32:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From cars to groceries, prices for everyday goods and services have soared under President Biden. https://t.co/bncQ2KEZrQ","date":"Wed Jul 14 18:14:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"78 years ago on this day, the George Washington Carver National Monument was established to honor George Washington Carver’s significant contributions to science. https://t.co/PVUC2M5kC6","date":"Wed Jul 14 16:44:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"American consumers are paying higher prices. Inflation surged in June. \n\nPresident Biden’s economic policies are hurting Americans.  \nhttps://t.co/52L5TOb2iW","date":"Tue Jul 13 22:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Proud of Joseph Diener and Dominic Viet for their quick thinking and selfless actions https://t.co/HxsnmakjpB","date":"Tue Jul 13 21:45:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Vaccines are the key to finishing the fight against COVID and saving lives. \n\nI’ve been vaccinated, and I encourage everyone to get vaccinated as well. https://t.co/zG2NbkqUe3","date":"Tue Jul 13 21:34:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"Inflation surged in June at its fastest pace in nearly 13 years...The consumer price index increased 5.4% from a year earlier, the largest jump since August 2008.\" https://t.co/HOV8mKKs2E","date":"Tue Jul 13 18:58:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to meet with @MOFarmBureau President @JGarrettHawkins today. We covered a lot of ground in our meeting, talking about improving Missouri’s infrastructure and fighting unnecessary regulations that are hurting Missouri farmers. https://t.co/678g4keiGq","date":"Tue Jul 13 16:21:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today as we celebrate the birth of our nation and the values we hold as Americans, we honor the brave service members who preserve and protect our freedom. Happy Fourth of July 🇺🇸 https://t.co/6S4h4h86U1","date":"Sun Jul 04 13:22:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It's as simple as this: If Curt Flood’s letter is in the Hall of Fame, Curt Flood should be there, too. https://t.co/FanjM5fViA","date":"Fri Jul 02 16:29:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This week, I joined a bipartisan group of my colleagues in sending a letter to U.S. Trade Representative Ambassador Katherine Tai to highlight the importance of reconvening trade agreement talks with Taiwan - our tenth largest trading partner. https://t.co/5lbyIySENq","date":"Fri Jul 02 13:52:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Hannibal yesterday to talk about the importance of providing more Missourians with reliable, affordable, high speed internet &amp; how the tourism industry in Missouri is bouncing back https://t.co/TYVjbCp9Kw","date":"Thu Jul 01 20:53:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID-19 research &amp; development efforts have transformed how we fund science. We’ve shown that in times of crisis we have the capability to find solutions at an extraordinary speed. Now is the time for ARPA-H.\nhttps://t.co/q0CChxvkNu","date":"Thu Jul 01 20:27:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Had a great discussion yesterday in Moscow Mills on\n▶️ Making it easier for families to adopt &amp; provide more kids with loving, safe, &amp; permanent homes\n▶️ Treating mental health just like physical health\n▶️ Expanding access to affordable, high speed internet to more Missourians https://t.co/6QFGIjqTQV","date":"Thu Jul 01 19:44:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Stopped at Uncle Ray’s Potato Chip Factory in Montgomery City for a tour. Uncle Ray’s opened their facility in Montgomery County this year and they are already planning to expand it. They’ll also soon be sourcing their potatoes from the Cape Girardeau area. https://t.co/1LxQBbm87R","date":"Thu Jul 01 19:00:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Discussed tourism, transportation, and broadband in Hannibal yesterday. From @WGEM: https://t.co/BOnINUQgH0","date":"Thu Jul 01 17:06:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, I visited ThermAvant Technologies in Columbia to talk about the innovative research and development they’re doing, and the opportunities and challenges facing Missouri businesses as the economy recovers https://t.co/6CVh4z8w2N","date":"Thu Jul 01 16:30:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’ve cosponsored a bill to make sure we have a full understanding of COVID's impact on travel and tourism to help us ensure we have the right policies in place to support a full recovery.","date":"Thu Jul 01 13:05:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you, Moberly Area Chamber of Commerce, for inviting me to your tourism roundtable yesterday. COVID deeply affected Missourians whose livelihoods depend on the tourism industry. https://t.co/6y7f9nWsPb","date":"Thu Jul 01 13:05:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This afternoon, I was a part of a roundtable discussion at Macon Electric Coop with community leaders to talk about improving our infrastructure and expanding access to rural broadband for more Missourians. https://t.co/BvlReb2tmV","date":"Wed Jun 30 20:08:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I visited Chinn Feed Mill to meet w/ Kathy, @MOFarmBureau Pres @JGarrettHawkins &amp; @MissouriFFA. COVID created many challenges for  #MOag community, we discussed how I can support their efforts to ensure Missouri's farmers &amp; ranchers come out of the pandemic stronger than before https://t.co/txJYFrK6Ml","date":"Wed Jun 30 19:28:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to be back at Lakeside Casting Solutions, next year will be 20 years since they first opened. I toured their facility &amp; spoke with President Chuck Mudd about returning to business as usual. Now is the time we must continue to support small businesses &amp; their workers. https://t.co/nIzom1uq2u","date":"Wed Jun 30 19:16:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"What if we could do for cancer, Alzheimer’s disease, ALS, or the next infectious disease what we did for COVID-19? What would it take?\n\nI believe the answer is ARPA-H. \n\nhttps://t.co/q0CChxvkNu","date":"Wed Jun 30 19:13:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to check out the new Hannibal Visitor Center that opened its doors in May, tourism is Hannibal's 2nd largest industry. During the pandemic, the tourism industry faced many challenges. Very glad to hear tourism numbers in Hannibal have been up this spring 👍 @GoHannibalMO https://t.co/1RqBYW3L2y","date":"Wed Jun 30 19:00:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to meet with the Mark Twain Regional Council of  Governments, we talked about getting more Missourians vaccinated and back into the workforce. We also discussed the latest on providing more Missourians with access to high-speed internet &amp; strengthening infrastructure. https://t.co/ZTbItkgPPI","date":"Wed Jun 30 16:34:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Through the expertise &amp; leadership at @NIH, its nationwide community of researchers, &amp; partnerships w/ the private sector, we were able to respond quickly to COVID. Now it’s time to apply the lessons learned during the pandemic to eradicate other diseases https://t.co/q0CChxdJVW","date":"Wed Jun 30 16:23:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, I was in Moscow Mills to meet w/ Divine Nest &amp; community leaders. Every child deserves a loving, safe, &amp; permanent home. As an adoptive dad, I’ve made it a legislative priority to make it easier for more families to adopt &amp; ensure they receive the support they need. https://t.co/2fZPLRtQ7P","date":"Wed Jun 30 14:52:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s inflation is hitting Americans right in their wallets ⤵️\n\"Companies across the country are considering hiking prices to offset the surging costs of things like raw materials, energy and transportation.\"\nhttps://t.co/HzyGKGQtiY","date":"Tue Jun 29 18:53:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thankful for the @KCPolice officers who are being recognized this evening for their acts of bravery and service to their community https://t.co/UrN5J93six","date":"Tue Jun 29 17:07:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@TrumanLibrary is back open on July 2, check out a few of the new exhibits that share President Truman’s life story &amp; his legacy","date":"Mon Jun 28 20:47:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In the last few years, we’ve made great strides in treating mental health just like we do our physical health. My bill with @SenStabenow will build on that progress to help more Americans get the help they need \n\nhttps://t.co/x6HU13KZTv","date":"Mon Jun 28 18:55:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Nixa native Courtney Frerichs is heading to Tokyo to represent Team USA 🇺🇸 Good luck, Courtney https://t.co/lUa6YfWz6a","date":"Mon Jun 28 16:59:33 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Terrific news from @WUSTL this morning on COVID vaccines: \n\n\"A study from researchers at @WUSTLmed, published June 28 in the journal Nature, has found evidence that the immune response to such vaccines is both strong and potentially long-lasting.\"\n\nhttps://t.co/0nuPQ6yL0p","date":"Mon Jun 28 15:40:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Always happy to chat with the next generation of Missouri ag leaders","date":"Thu Jun 24 21:05:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Each year, I have the honor of nominating Missourians to our U.S. Military Service Academies. Congratulations to these young men and women who accepted appointments. I know you’ll make our state proud. \n\nhttps://t.co/4vYYK36XMZ","date":"Thu Jun 24 20:58:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks to Certified Community Behavioral Health Clinics, millions of Americans have access to quality mental and behavioral health care near where they live.\n\nMy bill with @SenStabenow would further expand this vital access to even more Americans.\n\nhttps://t.co/G2XP7nSiq6","date":"Thu Jun 24 20:19:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to meet yesterday w/ @RideKCTransit &amp; talk about all they’re doing to provide cleaner, more energy efficient transit service. This week, @USDOT announced KC Area Transportation Authority will receive a $3.3M grant to add more low- or no-emission buses/transit vehicles https://t.co/e2qLIdot5a","date":"Thu Jun 24 17:19:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"People who received services at Certified Community Behavioral Health Clinics:\n\n▶️ Had 63.2% fewer emergency department visits\n▶️ Spent 60.3% less time in jails\n▶️ Saw a 40.7% decrease in homelessness\n\nhttps://t.co/x6HU142Bi5","date":"Thu Jun 24 16:24:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last week, @SenStabenow and I introduced our Excellence in Mental Health Act to access to expand high-quality mental health &amp; addiction services across the country https://t.co/x6HU142Bi5","date":"Wed Jun 23 20:51:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden and Democrats’ “spend, spend, spend” policies, our economic recovery is stalling and it’s hurting American families. \nhttps://t.co/y3Ea6LGn6v","date":"Wed Jun 23 18:12:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, all 50 Senate Democrats voted to stack the deck in elections to keep themselves in power. I voted to stop their blatant power grab that would have federalized the election system and made elections less secure.\n\n https://t.co/QwdYX2IH9N","date":"Wed Jun 23 16:57:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ S.1 would prohibit states from enacting reasonable election security measures that have been upheld by our courts. It would make it easier for fraud to happen and harder to detect it. https://t.co/LDtQlJf3E0","date":"Tue Jun 22 21:41:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 was written by one party acting alone.\n\nS.1 was steered through Congress by one party acting alone.\n\nThe danger of such extreme changes being made by such tiny, partisan congressional majorities should be clear to everyone.","date":"Tue Jun 22 21:27:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 isn’t about reform. It’s about ensuring Democrats keep a tight grasp on power. https://t.co/rVE2gKLtV8","date":"Tue Jun 22 20:59:28 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ so-called “election reform” bill would require unlimited ballot harvesting – a practice that most states outlaw because it creates the risk of fraud, where harvesters can either fake ballots or deceive voters, especially the elderly.","date":"Tue Jun 22 19:43:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats believe S.1 will give them a partisan advantage in elections. This bill is nothing more than a power grab. \n\nAnd they’re willing to permanently change the U.S. Senate over it.","date":"Tue Jun 22 17:30:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"It’s pretty clear. S.1 is nothing more than Democrats’ attempt to take over the election system &amp; stack the deck to keep themselves permanently in the majority.\n\nThis isn’t “election reform.”","date":"Tue Jun 22 15:17:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ S.1 is a blatant attempt to maintain a one-party rule in Washington. S.1 prioritizes power over the will of American voters.","date":"Mon Jun 21 23:13:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 would make it easier to cheat and harder to detect. \n\nThis 800+ page bill does *nothing* to keep our elections secure.","date":"Mon Jun 21 22:36:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 makes election fraud easier to commit and harder to detect by:\n\n❌Requiring unlimited ballot harvesting\n❌Undermining overwhelmingly popular voter ID laws\n❌Making it more difficult to maintain accurate voter lists","date":"Mon Jun 21 22:04:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A federal takeover of the election system would make our elections less secure and more chaotic. https://t.co/pDVZ7ZE3K8","date":"Mon Jun 21 21:46:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a former election official, I know our election system is strong because it's diverse.\n\nDemocrats' S.1 would force a single, partisan view of elections on 10,000+ jurisdictions across the country – taking control away from state &amp; local officials who are closest to voters.","date":"Mon Jun 21 20:49:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Terrific news for the thousands of people who travel over the Missouri River every day https://t.co/s5U5QCLhPY","date":"Mon Jun 21 18:23:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is not about voting rights or election reform.\n\nIt’s about giving Democrats an electoral advantage to remain in power.","date":"Mon Jun 21 16:28:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"On this day in 1865, Union troops in Galveston brought news of emancipation to the southern states. Today, we celebrate this day as #Juneteenth","date":"Sat Jun 19 12:15:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The strength of our election system is its diversity. Democrats’ S.1 would put Washington bureaucrats in charge of our country’s 10,000+ jurisdictions, taking control away from state and local officials who are closest to voters.","date":"Thu Jun 17 23:04:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is not about voting rights. It’s a politically motivated federal takeover of the election system that would make elections more chaotic and less secure. https://t.co/01fO1Go0yM","date":"Thu Jun 17 21:47:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is a solution in search of a problem.","date":"Thu Jun 17 20:46:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"For more than 25 years, Firefighter Heard kept St. Louisans safe. Keeping his family and @STLFireDept in my prayers","date":"Thu Jun 17 19:47:55 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is a blatant power grab to take over our election system &amp; maintain one-party rule. It’s not about voting rights or election reform.\n\nIt’s about Democrats keeping themselves in power. https://t.co/bhO2vMp8vB","date":"Thu Jun 17 19:24:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This isn’t about election reform. This isn’t about voting rights.\n\nIt’s about Democrats wanting to keep themselves in power.","date":"Thu Jun 17 18:23:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"LIVE \n\nGet the facts on Democrats’ election takeover bill ⤵","date":"Thu Jun 17 16:11:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are working to take over our elections with a bill that\n\n❌Guts state voter ID laws\n❌Requires ballot harvesting\n❌Mandates ballot drop boxes\n\nThese are just a few of the worst policies in this election takeover effort.\n\nBut Democrats are calling it “election reform.”","date":"Thu Jun 17 16:04:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ so-called “election reform” bill is anything but. It’s a partisan power grab to tip the scales in favor of Democrats.\n\nTODAY AT 12:15 I'm joining with @SenateGOP colleagues to talk about the extreme policies that will create chaos &amp; do nothing to secure our elections","date":"Thu Jun 17 15:33:38 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is an extreme, partisan attempt to take over our election system so Democrats can keep their power. Even Speaker Pelosi admits it.\n\nWhen asked about maintaining a Democrat majority in the House, Speaker Pelosi said “we would be better if we can pass H.R.1 and S.1.”","date":"Wed Jun 16 22:59:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under President Biden: \nInflation is soaring ⬆️\nDeficit is widening ⬆️\nConsumer prices are on the rise ⬆️\n\nYet, Democrats are doubling down on their failed economic policies – and hardworking Americans are paying the price.","date":"Wed Jun 16 22:28:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, @SenStabenow &amp; I introduced legislation to help change the way mental &amp; behavioral health are treated in our country. Our bill will expand quality mental health &amp; addiction services to help even more Americans access the support they need. https://t.co/GRgLAfr9By","date":"Wed Jun 16 22:12:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ 800+ page election bill has nothing to do with voting rights. It's a politically-driven federal takeover of the election system. S.1 is chock full of bad policies that will make it easier to cheat &amp; harder to detect. More from my floor remarks⤵️ https://t.co/GLUnjYHlY0","date":"Wed Jun 16 21:52:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Happy 200th birthday to Columbia! https://t.co/3llqTqyN21","date":"Wed Jun 16 20:41:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economic policies at work: “Producer prices climb 6.6% in May on annual basis, largest 12-month increase on record” https://t.co/qY4FmkgmSC","date":"Wed Jun 16 18:20:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KTTNRadio: Lawmakers introduce bill to improve housing services for survivors of human trafficking\nhttps://t.co/okMSBWuoqK","date":"Wed Jun 16 17:45:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The Labor Department’s consumer price index surged 5% year-over-year in May, the largest increase since August 2008” https://t.co/bRuzVramYX","date":"Tue Jun 15 22:23:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to Ballwin native Tyler Downs! He’ll be representing Team USA in the Summer Olympics 🇺🇸","date":"Tue Jun 15 22:09:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden administration continues to mishandle the border crisis, resulting in a 21-year high of illegal border crossings this May.\n\nThere are 13 times as many unaccompanied children coming to the border compared to last year &amp; substantially more than any year in recent history https://t.co/IpthcgFMlz","date":"Tue Jun 15 22:06:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Our election system is strong because it's diverse.\n\nBut S.1 would allow Washington bureaucrats to force their single, partisan view of elections on more than 10,000 jurisdictions across the country – taking control away from state and local officials who are closest to voters.","date":"Tue Jun 15 21:39:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I urge all of our colleagues to support this bipartisan bill that will help change the way mental and behavioral health are treated in our nation. https://t.co/GRgLAfIL08","date":"Tue Jun 15 19:44:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Although we’ve nearly defeated this pandemic, our nation continues to face a significant mental and behavioral health crisis. Studies have shown that, over the last year, more Americans have struggled with anxiety, depression, suicidal thoughts, and substance use.","date":"Tue Jun 15 19:44:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We can help more people get the care they need by expanding Certified Community Behavioral Health Clinics, which serve nearly 1.5 million Americans and have a proven record of increasing access to care, reducing hospitalizations, and decreasing emergency room visits.","date":"Tue Jun 15 19:44:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is full of misguided policies that would create chaos in our election system &amp; erode voter confidence in elections.\n\nNot to mention it would permanently tip the scales in favor of Democrats... \n\nhttps://t.co/ZzknHRKYfj","date":"Tue Jun 15 19:08:27 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“U.S. small-business confidence edged lower last month, the first decline in four months” https://t.co/pmZDHkkuvZ","date":"Tue Jun 15 16:33:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Right now, we’re seeing the biggest surge in inflation in nearly 13 years. These rising prices are hurting hardworking families &amp; hindering our economic recovery.","date":"Mon Jun 14 22:02:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great news for #STL ➡️ Last week, @USDOL approved St. Louis Agency on Training &amp; Employment’s Youth Build Grant. This grant will create more opportunities for young St. Louisans and help them succeed in the workforce","date":"Mon Jun 14 21:31:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Last week, my colleagues &amp; I introduced bipartisan legislation to give greater flexibility to @USDA’s Summer Food Service Program. This flexibility would help ensure kids have access to nutritious meals all year round. https://t.co/hyo5lI8hVC","date":"Mon Jun 14 19:20:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This announcement is good news for semiconductor manufacturing and will create steady, good-paying, high-tech jobs for Missourians. https://t.co/DVqZMxEnTj","date":"Mon Jun 14 18:11:52 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A very happy birthday to the men &amp; women serving at @FortLeonardWood and all our @USArmy soldiers 🇺🇸 https://t.co/rGcYhsVWUJ","date":"Mon Jun 14 16:31:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Rehoming is an unacceptable practice that puts children at increased risk of abuse and exploitation. By classifying rehoming as child abuse, child welfare authorities will have an important tool to keep kids safe. https://t.co/mSKedWtOPR","date":"Fri Jun 11 18:21:44 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The federal govt’s rigid, one-size-fits-all approach to child hunger simply isn’t doing enough to solve the problem. Hunger-Free Summer for Kids Act will give food banks &amp; other organizations the flexibility they need to ensure students have year-round access to nutritious meals","date":"Fri Jun 11 15:27:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"https://t.co/ykaq0yenTK","date":"Fri Jun 11 15:27:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 makes election fraud easier to commit and harder to detect by:\n\n❌Allowing unlimited ballot harvesting\n\n❌Undermining overwhelmingly popular voter ID laws\n\n❌Making it more difficult to maintain accurate voter lists","date":"Thu Jun 10 20:55:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A poll by Rasmussen Reports found 75% of Americans believe photo identification should be presented before voting - including 60% of Democrats.\n\nBut S.1 would gut overwhelmingly popular state voter ID laws","date":"Thu Jun 10 20:11:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Inflation is surging under President Biden\n“U.S. consumer prices continued to climb strongly in May, surging 5% from a year ago to reach the highest annual inflation rate in nearly 13 years.”\nhttps://t.co/RGznOvjj1M","date":"Thu Jun 10 19:03:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Many Americans living with kidney disease aren’t able to afford or access treatments and specialty care that could significantly impact their health and quality of life. My bill with @SenatorCardin will ensure that more patients can get the care they need https://t.co/QdipILWNLk","date":"Wed Jun 09 20:06:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My bill with @SenBobCasey would provide $1.2 billion to rural bridges &amp; bring much-needed repairs to off-system bridges. Currently, about 58% of Missouri’s bridges are off-system https://t.co/3FSQVB2Zve","date":"Wed Jun 09 18:38:53 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Antisemitism is surging in the U.S. &amp; worldwide, endangering Jewish communities. We need to take action. That's why I'm joining @SenJackyRosen &amp; @SenatorLankford in the relaunch of the Senate Bipartisan Task Force for Combating Antisemitism.","date":"Wed Jun 09 16:41:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Must-watch ➡️ @USNavy, @Boeing execute historic mid-air refueling with drone made in #STL 🇺🇲\nhttps://t.co/1vsOoLSlvn","date":"Wed Jun 09 16:07:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Repairing and upgrading our transportation network is especially important in Missouri, where location is a top competitive advantage. This week, I introduced a bill w/ @SenBobCasey to provide much-needed support to off-system bridges throughout Missouri: https://t.co/ODlP9XRudu","date":"Wed Jun 09 13:53:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Let’s call it what it is. S.1 is NOT about voting rights. It’s an extreme partisan power grab by Democrats to keep themselves in power.","date":"Tue Jun 08 21:58:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We need to move quickly to implement the recommendations in the bipartisan report on the security, planning, and response failures related to January 6th. https://t.co/wMkXIs3yrP","date":"Tue Jun 08 21:35:26 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Our election system is strong because it is diverse. But S.1 would impose a one-size-fits-all approach on our elections, which would throw our election system into chaos and make our elections less secure. https://t.co/ol8VV8VftO","date":"Tue Jun 08 18:51:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We owe it to the brave men and women who responded that day to do everything we can to prevent an attack like this from ever happening again, and in every instance ensure that the @CapitolPolice have the training and equipment that they need. https://t.co/qyCyO240m9","date":"Tue Jun 08 15:55:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"These recommendations are based on an extensive fact-finding effort that included interviews w/ key decision makers, firsthand accounts from law enforcement personnel &amp; the review of thousands of documents. Our focus now should be on immediately implementing these recommendations","date":"Tue Jun 08 15:55:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the past 5 months, our committees have worked together in a bipartisan way to thoroughly investigate the intelligence and security failures prior to and on January 6, and to develop recommendations to address them.","date":"Tue Jun 08 15:55:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations to Marquette High School, Richards R-V School District, and Woodridge Middle School for qualifying for the National Finals of the 2021 @RocketContest &amp; earning a chance to compete for the title of National Champion. Good luck at #TARC2021","date":"Mon Jun 07 21:40:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have crammed a ton of misguided policies into S.1. These policies would NOT make our elections more secure. But they would secure Democrats’ grasp on power. https://t.co/tdvmtVLWQO","date":"Mon Jun 07 21:23:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In his time in the Oval Office, President Truman made significant, consequential decisions on ending World War II and navigating the immediate recovery.\n\nIt’s an honor to work in the former Senate office of a Missourian I greatly admire. https://t.co/niiWus8rJr","date":"Mon Jun 07 20:22:59 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"June is Alzheimer’s &amp; Brain Awareness Month. Every 65 seconds, someone in the U.S. develops Alzheimer’s.\n\nResearch is critical in the fight to #EndALZ, that’s why I've been a strong supporter for increased resources to find new treatments &amp; a cure. https://t.co/5ks7ozDHDl","date":"Mon Jun 07 18:22:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @JoplinGlobe: Wilson’s Creek Battlefield opens after extensive renovations https://t.co/w5JtbhQE3e","date":"Mon Jun 07 16:13:21 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Was on @MeetThePress this morning to talk U.S. cybersecurity &amp; Russia-backed hacking, the upcoming bipartisan report on the January 6th investigation, and voting legislation. https://t.co/muBjtVDC4V https://t.co/8IuyekbrhP","date":"Sun Jun 06 15:24:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @41ActionNews: Sen. Roy Blunt receives Harry S. Truman Public Service Award https://t.co/HTuIkE0z97","date":"Fri Jun 04 22:08:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good luck to all the @SOMissouri athletes participating in the summer games tomorrow! https://t.co/veScqmpdcY","date":"Fri Jun 04 20:12:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Super Hornets are an integral part of our national defense. Keeping the Super Hornets rolling off the assembly line is critical to retaining thousands of jobs in Missouri and bolstering our military advantage. https://t.co/PCGkjLNX5O","date":"Fri Jun 04 19:16:07 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to Mayor @WeirIndep4 for your kind introduction and thank you to my good friend (and also a Truman Public Service Award recipient) @RepCleaver for providing the benediction.","date":"Fri Jun 04 17:04:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Incredibly honored to receive the Harry S. Truman Public Service Award. During his time in the White House, Truman made significant decisions that shaped our country for decades. It's an honor to go to work every day for Missourians in Truman's former Senate office. https://t.co/izaVbr7ZF3","date":"Fri Jun 04 17:04:10 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"10 yrs ago, I spoke at the Wentworth Military Academy’s commencement. Before its closure, Wentworth was the oldest military academy west of the Mississippi. Yesterday, I visited their museum, which honors notable alumni like Gen. Mark Welsh, the 20th Chief of Staff of @USAirForce https://t.co/1B9VL3n1xT","date":"Fri Jun 04 15:48:47 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Toured Dallas County Tech Center’s new facility yesterday. The center gives students the hands-on experience they need to successfully enter the workforce. Vocational training programs like this are significant for preparing students for in-demand, good-paying jobs. https://t.co/9Td8YuSYYB","date":"Fri Jun 04 12:54:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Marshall this afternoon to meet with the Chamber of Commerce to discuss the importance of broadband as well as COVID’s impact on small businesses and the local workforce. https://t.co/rTgE1QhDpb","date":"Thu Jun 03 23:58:11 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Visited Lucas Oil Speedway – one of the most famous racing facilities in the U.S. It’s also a popular tourist attraction for our state. This afternoon, I toured Lucas Oil and discussed how the pandemic has impacted bringing visitors to the speedway. https://t.co/20UcIw4ig5","date":"Thu Jun 03 22:04:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The recent rise in acts of hatred and violence against Jewish people, businesses, community centers, and places of worship in the U.S. and across the world is completely unacceptable.","date":"Thu Jun 03 19:32:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I’m proud to join more than 50 senators – Republicans and Democrats – in condemning the harassment, abuse, and violence we have seen spreading in our communities. I will always stand with the Jewish community and do my part to defeat antisemitism. https://t.co/Xj5opMdges","date":"Thu Jun 03 19:32:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We all need to come together – public officials, religious leaders, and society as a whole – to show our support for people of the Jewish faith all across the world.","date":"Thu Jun 03 19:32:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Glad I had the chance to talk with @BurrellCenter’s chief of staff @DeeKingSGF_MO. Very proud of all Burrell Center has done to promote &amp; improve access to behavioral health services. I’ll continue to do all I can in Washington to support their lifesaving work. https://t.co/okwiOjMkzk","date":"Thu Jun 03 19:18:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Kicked off my day at Good Morning Springfield. Always great to see @CityofSGF Mayor McClure and talk about the region’s priorities with the Springfield Chamber of Commerce https://t.co/w25M1cbRyM","date":"Thu Jun 03 16:29:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thanks for the tour of Ozarks CHC’s Dade County Dental Clinic today. Ozarks Community Health Center also provides greater access to behavioral health services, including school-based programs. Treating mental health like we do our physical health is vital for people of all ages.","date":"Thu Jun 03 00:06:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to meet health care workers at Ozarks Community Health Center. CHCs provide affordable care close to home, especially in underserved areas. Over the past year, they’ve done an incredible job meeting an unprecedented challenge. Thank you for all you've done &amp; continue to do https://t.co/evPLjnDkg0","date":"Thu Jun 03 00:06:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I was in Mt. Vernon this afternoon to check out MARCO’s plant. Last year, thanks to the #PaycheckProtectionProgram, MARCO was able to keep their business operating and workers on the payroll. https://t.co/aXyt6IljBF","date":"Wed Jun 02 22:31:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Good to be back in Christian County. Today, I toured the White River Marine Group facility - the world’s largest builder of fishing and recreational boats by volume. https://t.co/eVG7zjBoPi","date":"Wed Jun 02 22:12:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The freedom we have as Americans is not guaranteed, it must be secured from one generation to the next.\n \nMemorial Day is a day we recognize and honor our service members who made the ultimate sacrifice, giving their lives to secure our freedom. https://t.co/90aZOvZWwA","date":"Mon May 31 13:00:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Great to be a part of today’s ribbon cutting ceremony for Wilson's Creek National Battlefield's new visitor center. The center is now open after undergoing renovations to enhance visitor experience and add more exhibits https://t.co/cJPfw746kz","date":"Fri May 28 18:34:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, @SenCapito, @SenToomey, @SenJohnBarrasso &amp; I released our infrastructure counteroffer. Our proposal focuses on improving core infrastructure like roads, bridges, airports, ports &amp; broadband. https://t.co/Xie3b32Fqa","date":"Fri May 28 17:33:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Our Republican Roadmap to a robust infrastructure package includes: \n\n🚗 $506B for roads, bridges, and major projects\n🚢$22B for ports &amp; waterways\n✈️$56B for airports\n🚰$72B for water infrastructure\n💻$65B for broadband","date":"Thu May 27 19:38:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I urge President Biden and our Democrat colleagues to support it https://t.co/GB49DX1Cim","date":"Thu May 27 19:20:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Infrastructure has traditionally been a bipartisan effort &amp; one of the most important priorities for Congress. Our counteroffer finds common ground where we can work together to pass a historically significant infrastructure package.","date":"Thu May 27 19:20:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The proposal reflects President Biden’s feedback to us during our Oval Office meeting and deserves bipartisan support. https://t.co/GB49DX1Cim","date":"Thu May 27 16:31:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This morning, @SenCapito, @SenToomey, @SenJohnBarrasso and I released our infrastructure counteroffer that focuses on core infrastructure investments – like roads, bridges, ports, airports, and broadband. https://t.co/oU84ai7iQr","date":"Thu May 27 16:31:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Big news for @CityofSedalia – construction connecting  Sedalia Rail Industrial Park to Union Pacific’s rail line is done thanks to @USDOT BUILD grant I was proud to support. B/c of this, Sedalia &amp; the region are well-positioned to take advantage of greater economic opportunities","date":"Wed May 26 22:08:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In #KCMO, you can get a COVID vaccine at\n▶️31st &amp; Prospect\n▶️Bruce R. Watkins Cultural Center\n▶️Kansas City Health Department\n\nDetails here ⤵️","date":"Wed May 26 21:51:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID vaccines are free and available to all Missourians who want to be vaccinated","date":"Wed May 26 21:49:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"I look forward to working w/ my colleagues, NIH leaders &amp; the Biden administration to move forward on ARPA-H. Combined w/ the great work that’s underway at all of the NIH institutes, this new institute will lead to more cost-saving/lifesaving breakthroughs https://t.co/i1MdlIZ4v4","date":"Wed May 26 21:36:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the last year, with Operation Warp Speed and the RADx initiative, we’ve seen the value of having the federal government become more of an active partner in research and development, instead of just a sponsor. ARPA-H would build on those successful efforts.","date":"Wed May 26 21:36:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, I announced my support for a new institute at @NIH, ARPA-H, which would utilize public-private partnerships to dramatically accelerate the development and approval of new treatments and technologies.","date":"Wed May 26 21:36:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @Fox4KC: World War I Museum to host several events ahead of Memorial Day weekend https://t.co/I2cg14oqhm","date":"Wed May 26 20:47:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you and likewise, @SenStabenow! Always grateful for your partnership in helping more Americans access mental health services.","date":"Wed May 26 18:23:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"President Biden’s economy:\nGas⬆️\nMilk⬆️\nInflation⬆️ https://t.co/k1jy8LG4DA","date":"Wed May 26 17:50:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The administration has to be more realistic about the level of spending they’re proposing and what it will mean for families and our economy.","date":"Tue May 25 22:07:48 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The Biden administration has proposed $7.1 trillion in spending in less than four months in office. That amounts to an extra $56,000 from every household in America, on top of the $223,000 they are already on the hook for to cover the existing national debt. https://t.co/ozsqVtXRDd","date":"Tue May 25 22:07:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@SDCAttractions is defending their current ranking as the #1 Amusement Park, vote here to keep that title in Missouri https://t.co/fCVUu5oli2","date":"Tue May 25 20:54:50 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @Forbes: 83% Of Americans Are Belt Tightening Due To Inflation Pressures\nhttps://t.co/sJxhy8oFEE","date":"Tue May 25 18:45:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"People across Missouri are rightly concerned about the kind of government overreach and political targeting we’ve seen from the IRS in the past. This bill will prevent any administration from using the IRS as a political weapon against Americans. https://t.co/XKYPeria8x","date":"Tue May 25 15:37:14 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The people of Joplin showed the country the power of faith and community. They demonstrated the strength and resilience that make us proud to be Missourians.","date":"Sat May 22 15:13:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As we take time to remember the victims of this tragedy, I hope we will also reflect on the incredible job the Joplin community has done to recover, rebuild, and emerge from this crisis even stronger than they were before.","date":"Sat May 22 15:13:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"When the tornado struck Joplin on May 22, 2011, there were first responders who rushed to provide aid, volunteers who worked tirelessly to help their neighbors, and friends and family who were there for one another as they mourned the loss of life and destruction.","date":"Sat May 22 15:13:09 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every Missourian who wants a COVID vaccine can get one. To find a location closest to you, go to https://t.co/recZSGl73k","date":"Fri May 21 16:40:04 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Rick Stream has done a great job as co-director of the St. Louis County Board of Elections and will be a tremendous asset to the EAC advisory board.","date":"Thu May 20 18:30:43 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a former election official for two decades, I know that the strength of our election system is its diversity. Allowing Washington bureaucrats to impose a one-size-fits-all approach to our elections will NOT keep our elections secure. https://t.co/TIDGv9IQAE","date":"Thu May 20 18:20:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@semissourian: the burger joint “is one of many area restaurants that have reduced their hours recently because of lack of staff. … Many restaurateurs point fingers to the pandemic-era unemployment programs the federal government doled out to states.” https://t.co/POqWFxXbH4","date":"Thu May 20 17:31:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@kytv: “Businesses in Branson, Mo. face labor shortages as busy tourist season begins.” https://t.co/ckLTq819ND","date":"Thu May 20 17:31:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@KOMUnews: “Mid-Missouri employers struggle to find help” https://t.co/e7tjt9GjHT","date":"Thu May 20 17:31:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@fox4kc: “Many of the businesses that struggled to stay open last year are now struggling to find enough employees to keep places open in 2021.” https://t.co/VOcH7raJer","date":"Thu May 20 17:31:40 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":".@Fox2Now: ‘Business is here, but I can’t hire anyone,’ Mary Ann’s Tea Room announces closure https://t.co/hO5MjjTQ1i","date":"Thu May 20 17:31:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, I spoke on the Senate floor to share what I’m hearing from small businesses in Missouri: bad federal policy is making it nearly impossible to find the workers they need to get back up and running. Here’s more…","date":"Thu May 20 17:31:39 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Senate Democrats managed to fit plenty of bad policies into S.1. No surprise – these policies are designed to keep them in power. https://t.co/ZzknHRKYfj","date":"Thu May 20 16:50:06 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 makes election fraud easier to commit and harder to detect. https://t.co/CCT4f3P67x","date":"Thu May 20 16:25:25 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Over the past year, small businesses have had to fight their way through the worst public health crisis in a century. They shouldn’t have to fight a federal policy that is preventing them from getting back to full speed. https://t.co/co3Hv7lSj4","date":"Wed May 19 20:56:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"That’s because of a misguided federal unemployment policy that creates a disincentive for people to get back into the workforce. Today, I spoke on the Senate floor to share a few examples of what we’re seeing in Missouri and around the country.","date":"Wed May 19 20:56:58 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"When I was back home in MO this past weekend, there were help wanted signs everywhere. Small businesses across our state say they can’t find workers – forcing them to cut back on hours, turn away customers, and even close their doors. https://t.co/SZA48c1Q0R","date":"Wed May 19 20:56:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"From @KQ2: Teens get their first “shot” at COVID vaccine at clinic\nhttps://t.co/D9Pom3Qdyy","date":"Wed May 19 20:53:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“By helping other veterans &amp; community members, that helped me. Now, every day I get to do it, that keeps me going.”\n\nThank you, Lynn Rolf, for your service to our country and all you’re doing to support veterans. https://t.co/hf3pfgSsGa","date":"Wed May 19 20:24:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As a former election official for two decades, I know elections are best run by state and local officials who are closest to – and most importantly, accountable to – voters.\n\nS.1 would put Washington bureaucrats, not local election officials, in charge of our election system.","date":"Wed May 19 19:59:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"My bipartisan bill with @SenAmyKlobuchar will give the Secretary of State a valuable resource to develop &amp; implement policies that promote intercountry adoption, making it easier for loving families to adopt a child. https://t.co/muGjZuovpt","date":"Wed May 19 19:38:16 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Rehoming is a traumatizing practice that puts children at higher risk of exploitation and abuse. My legislation with @SenAmyKlobuchar would classify rehoming as child abuse and provide child welfare authorities with an important tool to keep kids safe. https://t.co/NrNxBT0Jwm","date":"Wed May 19 18:14:34 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨Missouri veterans🚨\nThis portal helps you access resources &amp; tools for employment, healthcare, mental health, and more","date":"Wed May 19 17:41:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you for all @NIH has done to get us to this point in finishing the fight against COVID","date":"Wed May 19 17:16:45 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are pressing forward with S.1 under the guise of “voting reform.”\n\nBut this bill is anything but voting reform. \n\nMore from @KarlRove: https://t.co/LahDNz9MhF https://t.co/0ED6Ed1BMl","date":"Wed May 19 16:13:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We should be focused on making it easier to vote and harder to cheat. Democrats’ S.1 makes it easier to cheat and harder to detect. https://t.co/ZzknHRKYfj","date":"Wed May 19 13:54:03 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"\"It's OK to reach out for help. The conversations are hard and it takes a lot of courage for a parent to say 'my child needs help.' That's what we are here to do — to help normalize that because that is a very normal thing to experience.\" https://t.co/TL6b7rwiIx","date":"Tue May 18 20:56:36 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats are pressing forward with S.1 under the guise of “election reform.” But this legislation is anything *but* election reform. This bill isn't about protecting American voters. It's about protecting Democrat politicians' hold on power. https://t.co/MjQrKTGyoA","date":"Tue May 18 19:00:35 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you, @NIHDirector &amp; @NIH COVID researchers, for giving us a terrific tour &amp; presentation of their latest work to save lives. Because of NIH's ingenuity &amp; drive, we're on the edge of finishing the fight against COVID &amp; on a faster timeline than we thought possible a year ago https://t.co/2dKBAbzA1T","date":"Tue May 18 17:22:33 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday, the Senate passed a resolution I cosponsored to honor National Foster Care Month. As co-chair of the Congressional Coalition on Adoption, I’m committed to improving the adoption process and supporting the more than 400,000 children in our nation’s foster care system.","date":"Tue May 18 16:10:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Investing in medical research has been a top priority for me. During my time as chair of the appropriations subcommittee that funds @NIH, I worked with my colleagues to provide 6 consecutive increases for NIH research. Ultimately, we boosted NIH’s funding by $12.85B – nearly 43%.","date":"Mon May 17 21:17:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Toured @NIH today with a bipartisan group of senators. \n\nNIH research is leading to the discovery of new treatments and cures that will change and save lives. \n\nTheir network of researchers around the U.S. has also been critical to our response efforts during the pandemic. https://t.co/76UK7bXkyV","date":"Mon May 17 21:17:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"COVID-19 vaccines are FREE, available in Missouri, and many locations no longer require appointments. Go to https://t.co/cmhXshx9eH to learn more","date":"Mon May 17 17:01:54 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to our armed forces service members and veterans for your bravery &amp; sacrifice so that we may enjoy the freedoms we do. #ArmedForcesDay https://t.co/vUK9BEJdqa","date":"Sat May 15 17:35:29 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"If you haven’t already, you can still vote @WOWAquarium for America’s Best Aquarium","date":"Fri May 14 20:22:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to the brave men and women of the @CapitolPolice and law enforcement officers around Missouri and across our country. Every time you put on your uniform, you put yourselves in harm’s way to keep us safe. We owe you a deep debt of gratitude.\n\n https://t.co/CdWszLGPPQ","date":"Fri May 14 19:48:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Missourians of all ages should prioritize mental health and treat mental health just like they do their physical health. \n\nTerrific to see this partnership to increase access to support &amp; resources for Missouri students https://t.co/HEimxEXTbQ","date":"Fri May 14 17:35:27 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The bill’s name—'For the People’—is misleading. It’s designed to protect not American voters but Democratic politicians’ hold on power.” https://t.co/3Au8P8WF9s","date":"Thu May 13 23:36:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“The measure would gut voter-ID requirements while allowing partisan operatives to collect and submit an unlimited number of ballots, a practice called “ballot harvesting” that most states outlaw.”","date":"Thu May 13 23:36:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"More from @KarlRove: “If the 817-page power grab passes, Washington would dictate how states run elections, even though the Constitution reserves that power to the states.”","date":"Thu May 13 23:36:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“S.1 would also prohibit states from cleaning registration rolls by removing people who haven’t voted for years and failed to return a postage-paid card affirming they’re still at that address—even if the Postal Service says they’ve moved and didn’t leave a forwarding address.”","date":"Thu May 13 23:36:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 would put Washington bureaucrats – not local election officials – in charge of elections in more than 10,000 jurisdictions across the country. This single, partisan view of elections will NOT keep our elections secure.","date":"Thu May 13 21:44:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 would be a \n👎One-size-fits-all\n👎Federal takeover of our election system","date":"Thu May 13 21:16:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to all our law enforcement officers who are on the front lines keeping our communities safe. We owe them, and their families, a deep debt of gratitude for the sacrifices they make for us. #PoliceWeek https://t.co/LKYJG5zc5g","date":"Thu May 13 20:16:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Thank you to @CityofIndepMO for the Harry S. Truman Public Service Award. I’m honored to receive an award named for a Missourian I greatly admire. I have the good fortune to work in Truman’s old office &amp; I always enjoy getting to share its history w/ Missourians who come to DC","date":"Thu May 13 17:25:15 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Yesterday’s Rules markup made it very clear – Democrats’ S.1 is NOT about securing our elections. It’s an extreme partisan power grab. https://t.co/XQPVfEgc6m","date":"Wed May 12 21:39:46 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Congratulations, Madeline Mills, on being named the 2021 Missouri state champion for Poetry Out Loud","date":"Wed May 12 21:20:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Simply put – S.1 is bad policy.\n\nJust a few of the extreme policies in this 800+ page bill:\n❌Guts overwhelmingly popular state voter ID laws\n\n❌Allows unlimited ballot harvesting\n\n❌Restricts states’ ability to maintain accurate voter rolls\n\n❌Provides gov funding for campaigns","date":"Wed May 12 19:48:32 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wishing a very happy 100th birthday to Harriet Daniels https://t.co/r2dV77Hmcg","date":"Wed May 12 18:39:41 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"A federal takeover of elections would force a Washington, DC one-size-fits-all approach on every voting precinct in every state before the next election — an approach that would cause chaos on Election Day and erode trust in our election system. https://t.co/cL2klGoyFs","date":"Wed May 12 16:34:49 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"This isn’t about reform. This is about ensuring Democrats keep a tight grasp on power – and they’re willing to permanently change the U.S. Senate to get it done.","date":"Tue May 11 23:04:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"The strength of our election system is its diversity. But S.1 would put impose a one-size-fits-all policy dictated by Washington bureaucrats on every election jurisdiction in this country.","date":"Tue May 11 22:28:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"We should be focused on making it easier to vote and harder to cheat.\n\nS.1 would make it easier to cheat and harder to detect.","date":"Tue May 11 21:55:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is NOT ‘for the people.’ It’s for Democratic politicians who are trying to rewrite election law in their favor. It’s nothing but a clear power grab.","date":"Tue May 11 21:29:12 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Imposes Costly, Burdensome Mandates on States: S.1 requires election officials to take on burdensome/costly changes to their election systems. Even if states have adopted some “reforms” in S.1, they'd have to make changes to their systems to comply with S.1 before next election","date":"Tue May 11 21:16:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Federalizes Redistricting: S.1 would put in place 1 set of federal rules for redrawing congressional districts, which has traditionally been a role for each state. If someone doesn’t like the commission's work, S.1 provides multiple opportunities for fed courts to draw the maps","date":"Tue May 11 21:16:20 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Creates a Partisan FEC: S.1 gets rid of the bipartisan makeup of the Federal Election Commission – giving the party in power an advantage in seats and the ability to control the commission’s agenda.","date":"Tue May 11 21:16:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Chills Free Speech: S.1 chills speech through cumbersome and misleading donor disclosures and allows the IRS to look at a group’s ideology when considering whether or not to grant it tax exempt status.","date":"Tue May 11 21:16:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Restricts States’ Ability to Maintain Accurate Voter Rolls: S.1 would restrict states’ ability to remove inaccurate and duplicate registrations from voter rolls.","date":"Tue May 11 21:16:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Provides Government Funding for Campaigns: $6 of fed gov't money would be sent to political candidates for every $1 they raise from small donors. This provision could essentially force Americans to fund candidates they don’t agree with &amp; support attack ads against those they do.","date":"Tue May 11 21:16:19 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Mandates Ballot Drop Boxes: Combined w/ unlimited ballot harvesting, drop boxes boost risk of fraud by allowing people other than the voter to drop off marked ballots outside of the view of election officials/poll workers &amp; increase the risk of ballots being stolen or destroyed.","date":"Tue May 11 21:16:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Allows Unlimited Ballot Harvesting: S.1 allows paid campaign operatives to collect ballots. Ballot harvesting is prohibited or limited in some states because it creates the risk of fraud, where harvesters either fake ballots or deceive voters, especially the elderly","date":"Tue May 11 21:16:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Guts Overwhelmingly Popular State Voter ID Laws: S.1 would render state voter ID laws meaningless by requiring states to allow affidavits in lieu of identification.","date":"Tue May 11 21:16:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"In 800+ pages, Democrats managed to pack a slew of bad policies that would send our election system into chaos and undermine Americans' faith in the system.\nHere are some of the worst policies in this hyperpartisan bill 🧵","date":"Tue May 11 21:16:18 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Speaker Pelosi saying the quiet part out loud:\n\nWhen asked about maintaining a Democrat majority in the House, Speaker Pelosi recently said “we would be better if we can pass H.R.1 and S.1.” 🤔","date":"Tue May 11 20:24:08 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats have said that S.1 is necessary to increase voting rights, particularly for minorities.\n\nBut overall turnout in the 2020 election was 66% – the highest share of eligible voters since 1900.\n\nAnd most states had their highest turnout in 40 years.","date":"Tue May 11 19:11:31 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 makes election fraud easier to commit and harder to detect by: \n❌Allowing unlimited ballot harvesting\n❌Undermining overwhelmingly popular voter ID laws\n❌Making it more difficult to maintain accurate voter lists","date":"Tue May 11 18:00:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 would force a single, partisan view of elections on more than 10,000 jurisdictions across the country.\n\nThis extreme bill would take control away from state and local officials who are closest to voters and let bureaucrats in Washington make the rules.","date":"Tue May 11 17:18:13 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Under S.1, a sitting U.S. Senator would be entitled to as much as $80 million in public funds to run campaign ads. That means you could be forced to pay for ads promoting a candidate you don’t support. I offered an amendment to strike this provision from S.1. Dems voted it down. https://t.co/0qZQdlznBQ","date":"Tue May 11 16:14:57 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 is NOT about voting rights.\n\nIt is a politically-motivated federal takeover of the election system that would make elections more chaotic and less secure.","date":"Tue May 11 15:12:51 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"S.1 tips the scales in favor of Democrats by politicizing the Federal Election Commission, pouring federal funds into campaigns &amp; chilling free speech.\n\nNo wonder they're pushing so hard to pass the bill that they’re considering permanently changing the Senate to do it.","date":"Tue May 11 14:28:42 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"As the top Republican on the committee, I will be challenging Democrats to defend numerous provisions in S.1 that voters overwhelmingly oppose.","date":"Tue May 11 14:02:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Today, the Senate Rules Committee will consider S.1 – Democrats’ sweeping election bill that would give Washington control over how states and localities run elections. https://t.co/4s5qlrIzda","date":"Tue May 11 14:02:22 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"One of the great strengths of our election system is its diversity. Democrats' sweeping S.1 bill would force a single, partisan view of elections on more than 10,000 jurisdictions across the country.","date":"Mon May 10 21:13:23 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Democrats’ so-called “election reform” bill is nothing more than a partisan takeover of our election system. https://t.co/tWPo7DB1A7","date":"Mon May 10 18:12:30 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"When law enforcement officers report for work, they put the safety of others ahead of their own.\n\nTheir families do not know what dangerous situations their loved ones are in at any moment.\n\nTo our LEOs &amp; their families, thank you for the sacrifices you make for us. #PoliceWeek https://t.co/9hd1vTIChx","date":"Mon May 10 16:17:37 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Wishing all the wonderful moms a very happy #MothersDay https://t.co/bzK2edxPFR","date":"Sun May 09 16:31:56 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"“Religious freedom, one of the most basic human rights for all people, has historically been an area of sincere bipartisan support and agreement in American foreign policy.\" https://t.co/H7UEX2LQy3","date":"Thu May 06 21:59:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"At their training facilities, apprentices gain the hands-on skills they need to prepare for good-paying careers. I believe apprenticeships build a strong foundation for success in the workforce.","date":"Thu May 06 20:46:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"During my time as chair of the approps subcommittee that funds @USDOL programs, I led efforts to improve &amp; expand apprenticeship &amp; job training programs. In FY2016, we began funding the apprenticeship program at $90M. Since that time, the program has more than doubled to $185M","date":"Thu May 06 20:46:01 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Toured the Plumbers &amp; Pipefitters Local 562 Training Center today to see their new facility.\n\nLocal 562 has grown to 4500 members who serve the plumbing &amp; mechanical industry in 67 counties in Eastern Missouri.\n\nThey also have 3 educational centers throughout the region. https://t.co/nclJmJv3YY","date":"Thu May 06 20:46:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Throughout the pandemic, nurses have been working around the clock to take care of those who are sick and to keep us safe and healthy. Please take a moment to thank our health care heroes on #NationalNursesDay. https://t.co/4bbRywjnwv","date":"Thu May 06 18:11:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"#ServiceShoutout to @AmeriCorps Volunteers in SWMO 🎉AmeriCorps volunteers helped Joplin recover from the tornado in 2011 &amp; since then have continued to serve SWMO - from organizing clothing donations to working with Toys for Tots &amp; even doing minor home repairs for the elderly","date":"Thu May 06 17:30:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"#ServiceShoutout to @CollegeBoundSTL 🎉 Thank you to all their volunteers who are helping more Missourians realize their dream of #highered. I was the first in my family to graduate from college, I know just how important a support system is to help you earn your diploma","date":"Thu May 06 17:00:02 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"#ServiceShoutout to @AmeriCorpsSTL 🎉They've stepped up to boost public health initiatives of our local, state, &amp; national partners - including supporting 3 mass vaccination sites and processing 2,700 COVID-19 tests. 📷 @AmeriCorpsSTL https://t.co/rmwLEoGchD","date":"Thu May 06 16:30:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"#ServiceShoutout to @CityYearKC 🎉KCMO is lucky to have @CityYear in their community. In the last year, @CityYearKC supported students by providing more tools to help them succeed &amp; live up to City Year’s motto – #makebetterhappen https://t.co/CSkYXKTBuW","date":"Thu May 06 16:05:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"🚨Attn: Missouri veterans &amp; service members 🚨","date":"Wed May 05 19:01:00 +0000 2021","user_id":"21269970"},{"handle":"RoyBlunt","text":"Every Missourian who wants a vaccine should have access to get one.","date":"Wed May 05 18:08:55 +0000 2021","user_id":"21269970"}]