[{"handle":"SenatorBurr","text":"My statement on the passing of Marc Basnight, who led the North Carolina Senate for nearly two decades: https://t.co/wu8iwEL455","date":"Tue Dec 29 02:30:52 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"On Tuesday @ 9:30 AM, Senate Intel will hold its nomination hearing for the Director of National Intelligence.\n \nWhile attendance will be limited due to current public health guidelines, the hearing will be livestreamed here: https://t.co/VR7Uboyvcw","date":"Fri May 01 21:34:52 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"I want to wish a blessed Ramadan to all who will be observing a month of fasting and prayer. https://t.co/6VJLtaeT3P","date":"Thu Apr 23 23:57:17 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"With the 2020 presidential election approaching, it’s more important than ever that we remain vigilant against the threat of interference from hostile foreign actors.","date":"Tue Apr 21 16:26:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"One of the ICA’s most important conclusions was that Russia’s aggressive interference efforts should be considered ‘the new normal.’\n \nThat warning has been borne out, as Russia and its imitators increasingly use information warfare to sow societal chaos and discord.","date":"Tue Apr 21 16:26:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"In reviewing the ICA, the Senate Intelligence Committee looked at two key questions:\n \n▪️Did the final product meet the initial task given by the President\n▪️Was the analysis supported by the intelligence presented?\n \nWe found the ICA met both criteria.","date":"Tue Apr 21 16:26:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, the Senate Intel Committee released the fourth and penultimate volume in our bipartisan Russia investigation, which examines the 2017 Intelligence Community Assessment that identified Russian election interference: https://t.co/qFa0yKEfZU","date":"Tue Apr 21 16:26:24 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you did not file a 2018 or 2019 tax return but do have dependents, register with the IRS by *Wednesday, 4/22 @ 12PM ET* to make sure you automatically receive an additional $500 per eligible child when you receive your $1,200 Economic Impact Payment. https://t.co/A8cpki1gyH","date":"Tue Apr 21 00:22:33 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Until then, you can #FindYourPark (virtually) from the safety of your own home. 2/2 https://t.co/FyUtG7NLoF","date":"Mon Apr 20 19:11:07 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"#NationalParksWeek is a chance for us to celebrate the beauty of our country and the benefits of smart conservation. While some of our national parks are sadly closed today, they’ll all be waiting for us when the time is right to go out and enjoy the great outdoors. 1/2","date":"Mon Apr 20 19:11:06 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"“He is not here; he has risen, just as he said. Come and see the place where he lay.”\n\nMatthew 28:6\n\nWishing everyone a beautiful #EasterSunday, as even in difficult times we celebrate the hope we have through Christ’s resurrection. https://t.co/FPPCJzSpjl","date":"Sun Apr 12 16:03:21 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"I hope everyone has a happy and blessed #GoodFriday. https://t.co/Uczb7TkRKo","date":"Fri Apr 10 16:09:58 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"This is exactly how the #PaycheckProtectionProgram is supposed to work.\n \nSmall businesses like @bittyandbeaus and their employees are part of the glue that hold our communities together. https://t.co/kcvKuEgjMc","date":"Thu Apr 09 00:07:34 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"While families and friends may not be able to physically gather this year, faith will always be an important part of how we come together.  \n\nBrooke and I wish everyone celebrating a Happy Passover. https://t.co/Qr8shtzJ79","date":"Wed Apr 08 21:00:12 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"You can apply for a #PaycheckProtectionProgram loan for your small business at your local SBA-approved bank.\n \nFor more information and the latest guidance on approved lenders, visit https://t.co/xFnMrXzVxU. https://t.co/YRUa2tapyh","date":"Tue Apr 07 14:12:14 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #PaycheckProtectionProgram is an inclusive program for more than just traditional small businesses. Non-profits, veterans groups, the self-employed, and independent contractors may all be eligible if they meet @SBAgov requirements. Check out more here: https://t.co/K2knJ7YVdP https://t.co/67bcUeJnhn","date":"Mon Apr 06 20:25:21 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: Right now, small businesses can apply for new loans through the #PaycheckProtectionProgram.\n \nThese @SBAgov forgivable loans will help #smallbiz keep employees on payroll and provide vital cash-flow assistance as we combat #coronavirus. https://t.co/KvviU13oJA","date":"Mon Apr 06 18:09:32 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you operate a small businesses or other eligible organization and are struggling under the current #COVID19 crisis, I strongly recommend learning more about the #PayrollProtectionProgram and other available options from @SBAgov. 3/3\n \nhttps://t.co/sA7ayhSygQ","date":"Mon Apr 06 14:25:15 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Right now, small businesses can apply for loans that can be forgiven in full if the employer maintains a full payroll over eight weeks and uses the loan for payroll and other essential expenses like rent, mortgage, or utilities. 2/3","date":"Mon Apr 06 14:25:14 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"America’s more than 30 million small businesses are the backbone of our economy, but right now they are facing unprecedented pressure and uncertainty. The #PaycheckProtectionProgram is a tool created to help small businesses stay afloat and keep their employees on payroll. 1/3","date":"Mon Apr 06 14:25:13 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Tom Coburn was among my closest and dearest friends and I will greatly miss him. Everyone who knew Tom knew he juggled many roles – physician, public servant, husband, and father – but was, above all, a devoted Christian. 1/2","date":"Sat Mar 28 17:23:11 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The passion and intention Tom brought to his work was always a reflection of the faith that sustained him. I hope that same faith provides comfort to the Coburn family during this difficult time. My family’s prayers are with them as we mourn this loss. 2/2","date":"Sat Mar 28 17:23:11 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Without wasting any additional time, the House should take up and pass this bill as quickly as possible, so Congress can deliver critical relief to anxious American families, workers, and businesses. 3/3","date":"Thu Mar 26 04:04:11 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Doctors, nurses, small businesses, &amp; families are facing unprecedented strain &amp; need immediate resources to weather the current storm. Tonight, the Senate passed a historic emergency relief bill to help Americans as we continue to combat coronavirus. 1/3 https://t.co/puufRh1QAp","date":"Thu Mar 26 04:04:10 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"This bill will provide immediate liquidity to struggling businesses and families, help stabilize our nation’s key industries, and expand unemployment insurance.\n\nMost importantly, it supports the brave health care workers and first responders fighting the #COVID19 outbreak. 2/3","date":"Thu Mar 26 04:04:10 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Here is the letter I've submitted to the Senate Ethics Committee following my conversation with the Chairman this morning:\nhttps://t.co/kISUhYrX7t https://t.co/boEaR4G8f8","date":"Fri Mar 20 15:56:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement in response to reports about recent financial disclosures: https://t.co/J4kye5a4ok","date":"Fri Mar 20 14:28:58 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The message I shared with my constituents is the one public health officials urged all of us to heed as coronavirus spread increased:\n \nBe prepared. 7/","date":"Thu Mar 19 22:27:49 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"COVID-19 is a rapidly evolving situation. To know if we’ve been successful in stemming it, we have to keep an accurate accounting of our nation’s response.\n \nPurposefully misleading listeners for the sake of a “narrative,” like NPR has done, makes us less safe. 8/","date":"Thu Mar 19 22:27:49 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"In a press conference on Feb. 26, the President and public health officials urged schools, hospitals, businesses, and families to begin making plans for potential closures, social distancing, and telework: https://t.co/uZCJ51Sy6F 6/ https://t.co/AB19KKfjCb","date":"Thu Mar 19 22:27:48 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Like most members of Congress, I address our state society every year. \n\nThat a good thing. That’s what we should be doing. \n\nMeeting constituents and talking to them about the work we’re doing in D.C. is an important part of our job, especially in times of uncertainty. 4/","date":"Thu Mar 19 22:27:47 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Unfortunately, NPR’s journalistic malpractice has raised concerns that Americans weren’t warned about the significant steps we may have to take to stop the coronavirus threat. \n\nThat’s not true. \n\nFrom Feb. 25 ➡️ https://t.co/MV6UHiIIgG 5/ https://t.co/ef1hI35X2a","date":"Thu Mar 19 22:27:47 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Every state has a state society. They aren’t “secretive” or “high-dollar donor” organizations. They’re great civic institutions that bring people in D.C. together for events, receptions, and lunches.\n\nAnd they’re open to anyone who wants to get involved. 3/","date":"Thu Mar 19 22:27:47 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"In a tabloid-style hit piece today, NPR knowingly and irresponsibly misrepresented a speech I gave last month about the coronavirus threat. \n\nLet me set the record straight. 1/","date":"Thu Mar 19 22:27:46 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"This lunch was hosted on Feb. 27 by the North Carolina State Society. It was publicly advertised and widely attended. \n\nNPR knew, but did not report, that attendees also included many non-members, bipartisan congressional staff, and representatives from the governor’s office. 2/","date":"Thu Mar 19 22:27:46 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"As #COVID19 continues to develop, we have 2 critical goals: slow the virus’ spread &amp; provide immediate, targeted relief to those impacted. Today, I voted for the 2nd relief package to help families &amp; small businesses during this unprecedented challenge. https://t.co/4hIuKMLCZQ","date":"Wed Mar 18 22:02:00 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"NC officials are working day and night to keep our communities safe.\n \nYesterday, the @CDCgov awarded NC $13.8 million to help #StopTheSpread of #COVID19. This funding will help increase our ability to test, identify, and track coronavirus cases throughout the state. https://t.co/Ij1qJnrPlR","date":"Tue Mar 17 19:49:33 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The @WhiteHouse Coronavirus Task Force has issued new guidelines to help slow the spread of #COVID19.\n \nThe next 15 days are absolutely critical for us to #flattenthecurve.\n \nThis only works if we all do our part. https://t.co/TXXi6c1EiT","date":"Mon Mar 16 22:03:46 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"If we want to stop the spread of coronavirus, it’s imperative that low-risk individuals, as well as those that are high-risk, take the following commonsense steps: \n \n☑️Wash your hands with soap and water.\n☑️Avoid touching your face.\n☑️Avoid crowds and large social gatherings.","date":"Sun Mar 15 19:45:23 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Here is a great visual that explains why social distancing is such an important and effective tool to help us #flattenthecurve and slow the spread of COVID-19: https://t.co/0R7b224kBW","date":"Sun Mar 15 19:45:23 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The US is a leader in medical innovation, but we must improve drug affordability. That's why Sen. @MikeCrapo and I introduced the Lower Costs, More Cures Act, which brings together strong solutions to tackle high costs without imposing price controls. https://t.co/J2ALRHsuQi","date":"Wed Mar 11 18:05:38 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"With today's announcement, make sure you’re staying up-to-date on #COVID19 recommendations from the @CDCgov  and @ncdhhs. I will continue to work with @NC_Governor and state and local public health officials to ensure they have the resources they need to keep NC communities safe.","date":"Tue Mar 10 19:56:31 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Our legislation will modernize the approval process at the FDA to allow diagnostic test developers to keep pace with today’s medical advancements, create tests that discover disease more quickly, and ensure Americans can rely on test results.\n\nRead More ⬇️ https://t.co/uyrlfGxyYH","date":"Thu Mar 05 19:17:27 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"As the number and complexity of diagnostic tests grow in the U.S., it’s essential we have a regulatory framework that supports innovation and prepares us for the next generation of products.\n \nThat’s why today I am introducing the VALID Act with @SenatorBennet. https://t.co/P70yYH6WFB","date":"Thu Mar 05 19:17:26 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the first reported case of coronavirus in North Carolina: https://t.co/v1zZ8SlG26","date":"Tue Mar 03 23:47:30 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"https://t.co/V8zBVWoP7x","date":"Sat Feb 29 00:10:26 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks to @NOAAFisheries for working with us to allocate over $7.7 million in disaster relief for North Carolina fisheries. \n\nRead more ⬇","date":"Fri Feb 28 17:54:13 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to have supported 2 bills to bring the U.S. more in line with public opinion &amp; international norms when it comes to protecting life.\n \nIt’s unfortunate Senate Dems chose to block medical care for babies born alive &amp; a 20-week limit that’s standard in the rest of the world.","date":"Tue Feb 25 22:23:57 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"IP theft, corporate sabotage, and market manipulation are part of Huawei's core ethos and reflected in every aspect of how it conducts business. Today's announcement by the @EDNYnews is important in combatting Huawei's state-directed, criminal enterprise. https://t.co/2rMGFYwnIY","date":"Thu Feb 13 19:13:12 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Walter Jones had a lasting impact on NC and this country. He was a dedicated public servant who practiced a steadfast commitment to his principles. I can think of no better way to recognize his legacy than by dedicating the Walter B. Jones Jr. Post Office in his hometown.","date":"Mon Feb 10 21:58:31 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congress built a strong emergency response framework, designed to be flexible and innovative, so we are not only ready to face the coronavirus today, but new public health threats in the future.\n \nRead more: https://t.co/eH344TuPUQ","date":"Fri Feb 07 20:29:59 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"We must continue building on the lessons of 2016 and make sure we have strong response options at the ready.\n\nI hope this Committee’s bipartisan report will help further the public’s understanding of the threats we face and the current Administration’s ability to respond to them.","date":"Thu Feb 06 14:40:15 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Many of their concerns were understandable. In navigating them, however, Obama officials made decisions that limited their options, including preventing internal information-sharing and siloing cyber and geopolitical threats.","date":"Thu Feb 06 14:40:14 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thankfully, today we are in a better position to identify foreign interference efforts and address vulnerabilities Russia and other hostile foreign actors may seek to exploit.","date":"Thu Feb 06 14:40:14 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Frozen by ‘paralysis of analysis,’ hamstrung by constraints both real and perceived, Obama officials debated courses of action in response to Russian election interference without truly taking one.","date":"Thu Feb 06 14:40:14 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"After discovering the existence, if not the full scope, of Russia’s election interference efforts, the Obama Administration struggled to determine an appropriate response.\n \nNEW -&gt; Read the 3rd chapter in Senate Intel’s bipartisan Russia investigation: https://t.co/JWKKjDKb1f","date":"Thu Feb 06 14:40:13 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today I voted to acquit President Trump on both articles of impeachment.\n \nHere is my full statement: https://t.co/GSNMPn5lUy","date":"Wed Feb 05 21:50:38 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Simply put: Americans are in a better position today than they were 4 years ago thanks to the work of this Administration.","date":"Wed Feb 05 03:32:24 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"President Trump's address tonight underscored his commitment to delivering commonsense reforms that energize our economy, empower American workers, shape our judiciary, and more. https://t.co/BacTMtR53n","date":"Wed Feb 05 03:32:23 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today: \n\n✅ Americans have more economic opportunities than ever before\n✅ The Trump Administration has negotiated 4 trade deals in the last year\n✅ More than a fifth of the federal judiciary - 187 qualified judges - have been appointed and confirmed","date":"Wed Feb 05 03:32:23 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m deeply troubled by the U.K.'s decision to allow Huawei to build components of its 5G network.\n\nThe risks Huawei poses are well-documented and impossible to ignore. Once the door is opened, they may also prove impossible to contain. 1/2","date":"Tue Jan 28 22:13:32 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"While the U.S. must consider its own security and economic priorities, I’m committed to working with U.S. officials, the U.K., and other allies as we move forward, including by supporting the development of credible alternatives to Huawei. 2/2\n\nMORE: https://t.co/sKxN4KP0bs","date":"Tue Jan 28 22:13:32 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #2019nCoV outbreak is just one example of why we need to stay vigilant against public health threats.\n\nThe Pandemic and All-Hazards Preparedness and Advancing Innovation Act, signed into law last year, will keep America prepared to respond with innovative countermeasures.","date":"Mon Jan 27 21:48:32 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"We will #NeverForget the horrific atrocities committed during the Holocaust.\n\nOn #HolocaustRemembranceDay, we remember those who were liberated from Auschwitz on this day, and we honor the memory of the millions more who were brutally killed. https://t.co/rz9LPnzM1D","date":"Mon Jan 27 16:42:16 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Glad @USDOT is doing something about this. Too many people are fraudulently claiming disability needs to bring any variety of animals on a flight. It’s not fair to those who do need trained service dogs, other passengers, or the airlines. https://t.co/jay0u8LGmW","date":"Thu Jan 23 22:59:26 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"New profile pic. https://t.co/mvArg4RNar","date":"Wed Jan 22 14:25:54 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today we celebrate the legacy of Dr. Martin Luther King, Jr.\n \nDr. King’s life’s work was the undaunted pursuit of justice, fairness, and equality.\n \nIt’s work that we strive to continue today, and that we can honor by serving our communities. #MLKDay https://t.co/TA7tuoulKp","date":"Mon Jan 20 13:31:00 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congress's passage of the USMCA is long-awaited and welcome news for NC's farmers and manufacturers.\n \nNC small businesses owners, workers, and farmers rely on free and fair trade to grow their operations, provide for their families, and create more jobs. https://t.co/6oA3SEPdUm","date":"Thu Jan 16 17:56:53 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"I was proud to support this landmark trade deal, and I applaud President Trump for negotiating a deal that puts America's and NC's interests first. https://t.co/DJ4rn5t9fI","date":"Thu Jan 16 17:56:53 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"More great news for NC: The Army Corps of Engineers announced an additional $15M investment in river basin and beach studies throughout Eastern NC.\n \nThese studies will give us valuable information on better preventing and mitigating future storm damage.\n \nhttps://t.co/4dhAu0Tkpc","date":"Tue Jan 14 20:49:34 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Army Corps of Engineers just announced another $281M to reduce storm damage in NC.\n \nSo far in 2020:\n💲237M to Surf City/N. Topsail Beach\n💲44.5M to Carteret County\n💲39.6M to Princeville\n \nThese projects will go a long way in protecting Eastern NC communities.","date":"Mon Jan 13 19:46:30 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great story from @ap on the nearly $40M going to Princeville, N.C. to elevate highways and install new levees after recent devastating hurricanes: https://t.co/PMGs8uYvVc","date":"Fri Jan 10 20:05:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"I toured Princeville with Mayor Jones after Hurricane Matthew. It was clear then we needed better infrastructure in place to reduce future storm damage. The Army Corps’ announcement that this is finally happening is very welcome news. https://t.co/rhPXNjBskX","date":"Fri Jan 10 20:05:25 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Army Corps of Engineers just announced nearly $40M going to Princeville to elevate highways and install levees after recent hurricanes.\n \nI’m glad to see the Administration is prioritizing this critical project: https://t.co/IBH26HlCH7","date":"Thu Jan 09 23:28:58 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #LawEnforcementAppreciationDay, I want to extend my deepest thanks to all our men and women in law enforcement for their continued commitment to keeping our communities and families safe. https://t.co/dSl9yNbZ2i","date":"Thu Jan 09 20:14:26 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Iran and the Iranian people can now turn away from Soleimani’s murderous adventurism, redirect the Quds Force’s money into Iran’s economy, bring home the troops Soleimani sent abroad, and move forward toward building a more peaceful region. 4/4","date":"Fri Jan 03 18:58:31 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Soleimani is also responsible in part for Iran’s current economic strife, as he put his violent campaigns and the enrichment of the corrupt Quds Force ahead of the interests of the Iranian people. 3/4","date":"Fri Jan 03 18:58:31 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Qassem Soleimani was the personification of a state sponsor of terrorism. \n\nAt his direction, hundreds of American servicemen were killed and thousands more injured. \n\nAt his urging, U.S. allies were attacked repeatedly and undermined by Iran’s Quds Force and their proxies. 1/4","date":"Fri Jan 03 18:58:30 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"Under Soleimani, Iran has become the single most destabilizing force in the Middle East and an exporter of tyranny throughout the region. \n\nThe blood of hundreds of thousands of innocent Iraqis, Yemenis, Syrians, Israelis, and countless others is on his hands. 2/4","date":"Fri Jan 03 18:58:30 +0000 2020","user_id":"21157904"},{"handle":"SenatorBurr","text":"“Then the angel said to them, ‘Do not be afraid, for behold, I bring you good tidings of great joy which will be to all people. For there is born to you this day in the city of David a Savior, who is Christ the Lord.’”\n \nLuke 2:10-11","date":"Wed Dec 25 12:00:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Toured Princeville and Tarboro yesterday. Flood waters have subsided but there's much work to do. Thanks to Princeville Mayor Bobbie Jones. https://t.co/Iv02q89KJH","date":"Tue Oct 25 14:40:28 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"From me and mine, to you and yours! https://t.co/HotWwX3vxA","date":"Tue Dec 24 20:00:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy Hanukkah! Brooke and I wish everyone celebrating a blessed holiday season. https://t.co/APwgVrxcKT","date":"Sun Dec 22 19:01:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"And North Carolinians continue to benefit from a pro-growth tax system. Over the past year, average personal income in N.C. increased by more than 5%. 2/2","date":"Fri Dec 20 17:47:42 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"It’s been nearly 2 years since President Trump’s tax reform package became law.\n \nThat’s 2 years that Americans have been able to keep more of their hard-earned paychecks, provide for their families and their future, and participate in our growing economy.  1/2 https://t.co/GqsLIYZJdJ","date":"Fri Dec 20 17:47:41 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate just approved another $425 million to strengthen election security ahead of the 2020 elections.\n \nThat makes $805 million sent to states for election security improvements since 2016.⬇️\nhttps://t.co/S0HURKnT57","date":"Thu Dec 19 22:24:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"This funding is important - not only because it gives states more resources, but because it reflects an increased focus on protecting our election infrastructure. I’m proud of the role the Senate Intel Committee has played in highlighting this critical issue.","date":"Thu Dec 19 22:24:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Earlier this year, Congress renewed #PAHPA to ensure America remains vigilant against the public health threats we face in the 21st century\n \nI’m proud that the emergency response framework we helped build more than a decade ago is stronger than ever. 2/2","date":"Thu Dec 19 20:07:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2006, Sen. Ted Kennedy and I worked across the aisle to craft a bill that would strengthen America’s defenses against pandemics and bioterrorism.\n \nToday is the 13th anniversary of the Pandemic and All-Hazards Preparedness Act (#PAHPA) being signed into law. 1/2","date":"Thu Dec 19 20:07:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#WrightBrothersDay commemorates the first successful flight of a manned, engine-powered aircraft – and the two men who changed history at Kitty Hawk, N.C. with their persistence and ingenuity. North Carolina will always be proud to be #FirstInFlight. https://t.co/L7xU5UEf3V","date":"Tue Dec 17 21:07:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate just passed a significant boost for our Armed Forces. The #FY20NDAA will:\n \n✔️Invest in our Intel Community\n✔️Rebuild NC military bases damaged by hurricanes\n✔️Modernize our military readiness programs\n✔️Provide a 3.1% pay raise to our troops\n \nhttps://t.co/4bBisGbnA8 https://t.co/L2DNYrodQR","date":"Tue Dec 17 20:27:21 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great news: HELP Committee just passed my bipartisan bill to help states meet work requirements for child care employees to better safeguard our children.\n \nNext step: The Senate floor.\n \nFind out more about this commonsense legislation here: https://t.co/Hkjm7NZfmT","date":"Thu Dec 12 20:36:13 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I was deeply saddened this week by the news about Pete Frates.\n \nPete was a leader, a fighter, and a fierce advocate for #ALS research. He was also a beloved husband, father, and son.\n \nHis legacy will live on as we continue fighting for a cure for this devastating disease.","date":"Wed Dec 11 17:36:43 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Inspector Horowitz’s report is long and detailed, and I’m reviewing it carefully. I look forward to releasing the Senate Intelligence Committee’s counterintelligence report, which will have more to say on these topics.","date":"Mon Dec 09 22:21:48 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Even now, 78 years later, December 7, 1941 is still a date that lives in infamy.\n \nFollowing the attack on Pearl Harbor, a generation of Americans rose to meet the challenge of their time: to defend freedom from tyranny and win the war that came to them. https://t.co/6fpmNxCpd2","date":"Sat Dec 07 14:33:28 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"https://t.co/PO5lTQQBtp","date":"Thu Dec 05 21:16:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate just confirmed a brilliant legal scholar and dedicated public servant to the bench. Richard Myers is well-qualified, widely respected, and an excellent choice for the Eastern District of North Carolina. https://t.co/z1aDGOBT26","date":"Thu Dec 05 17:36:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m speaking on the Senate floor now about why we should confirm Professor Richard Myers as a federal judge for the Eastern District of North Carolina.\n \nTune in here: https://t.co/bUaGrc9Wf1","date":"Thu Dec 05 16:52:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Glad to be part of this bipartisan effort to help preserve America’s HBCUs.\n \nThe number one concern for HBCUs is unpredictable funding, but this amendment provides certainty for many years to come.","date":"Thu Dec 05 15:07:20 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On International Day of Persons with Disabilities, we’re reminded that promoting disability rights is critical not only for Americans here at home, but for millions all over the world. Everyone deserves respect and equal treatment under the law. #IDPWD","date":"Wed Dec 04 02:00:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wishing everyone a Happy Thanksgiving! As we spend time with our families, let’s remember to send our thanks and our prayers to the members of our armed forces who can’t be with their loved ones today. https://t.co/uAU1S023TV","date":"Thu Nov 28 13:43:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Every 65 seconds another American will develop Alzheimer’s disease.\n \nAs we continue to fight for a cure to this terrible disease, November is an opportunity to raise awareness of the impact it has on sufferers, caregivers, and families. #AlzheimersDiseaseAwarenessMonth","date":"Tue Nov 26 16:02:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Had a great time joining Charlotte &amp; other friends in celebrating 5 years of the #ABLEAct!\n\nThat’s 5 years that young people with disabilities have been able to save money without losing the benefits they need. https://t.co/Lz58nQgxOl","date":"Thu Nov 21 17:43:25 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy birthday, North Carolina! From the mountains to the sea, you’ll always be the place I’m proud to call home. #NC230\n \n🌲            🌲         🌊🌊🌊\n🌲🌲       🌲      🌊 \n🌲   🌲    🌲     🌊\n🌲       🌲🌲     🌊 \n🌲            🌲        🌊🌊🌊","date":"Thu Nov 21 13:31:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"It is rather for us to be here dedicated to the great task remaining before us—that from these honored dead we take increased devotion to that cause for which they here gave the last full measure of devotion—\" 6/7","date":"Tue Nov 19 16:29:18 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"that we here highly resolve that these dead shall not have died in vain—that this nation, under God, shall have a new birth of freedom, and that government of the people, by the people, for the people, shall not perish from the earth.\"\n \n-A. Lincoln\n#GettysburgAddress 7/7","date":"Tue Nov 19 16:29:18 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced.\" 5/7","date":"Tue Nov 19 16:29:17 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"It is altogether fitting and proper that we should do this. But, in a larger sense, we cannot dedicate, we cannot consecrate—we cannot hallow—this ground. The brave men, living and dead, who struggled here, have consecrated it far above our poor power to add or detract.\" 4/7","date":"Tue Nov 19 16:29:17 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"We have come to dedicate a portion of that field, as a final resting-place for those who here gave their lives, that that nation might live.\" 3/7","date":"Tue Nov 19 16:29:16 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Fourscore and seven years ago our fathers brought forth, on this continent, a new nation, conceived in liberty, and dedicated to the proposition that all men are created equal.\" 1/7","date":"Tue Nov 19 16:29:16 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived, and so dedicated, can long endure. We are met on a great battle-field of that war.\" 2/7","date":"Tue Nov 19 16:29:16 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"What began as the remembrance of the end of #WWI is today an important opportunity to honor all of America’s proud veterans.\n\nThis #VeteransDay, Brooke and I send our sincerest thanks to all who have served our great country.","date":"Mon Nov 11 16:00:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"For 244 years, the United States Marines have answered the call to duty with honor, bravery, and valor.\n \nHappy Birthday, @USMC! #SemperFi https://t.co/nCERrvSUhu","date":"Sun Nov 10 15:22:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"30 years ago today – after President Reagan famously charged Gorbachev to “Tear down this wall!” - the Berlin Wall fell, signaling the beginning of the end of the Cold War.\n \nA piece of the wall now lies at the President’s feet in the Capitol. A tribute to his enduring legacy. https://t.co/zLVctJH6vn","date":"Sat Nov 09 18:19:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Read the Senate Intelligence Committee’s complete findings on Russia’s efforts against U.S. election infrastructure ➡️ https://t.co/mE6G2bziO7\n \nAnd our 2nd volume on Russia’s use of social media ➡️ https://t.co/dOmE5qTsys","date":"Wed Nov 06 02:08:37 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"One of the biggest shortcomings we identified after 2016 was the lack of communication between federal agencies and states when it comes to election security. This coordinated offense speaks to the lessons we’ve learned and the significant progress we’ve made since then.","date":"Wed Nov 06 02:08:37 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"@juliuspeppers_ Absolutely. DM me and we’ll set it up.\n \nI played D1 football myself (one of only a few former players in the Senate), so I’m also thinking about this as a former athlete — albeit one of the 99% who never went pro.","date":"Fri Nov 01 20:33:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, @senjudiciary advanced Prof. Richard Myers' nomination to serve on NC's Eastern District Court. \n \nIf you haven't heard Prof. Myers' story, you should. He's a brilliant legal mind, the epitome of the American Dream, and a historic choice for NC. \n \nhttps://t.co/GTLIk3gHJK","date":"Thu Oct 31 21:40:25 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"If college athletes are going to make money off their likenesses while in school, their scholarships should be treated like income. I’ll be introducing legislation that subjects scholarships given to athletes who choose to “cash in” to income taxes.","date":"Tue Oct 29 19:28:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Brooke and I are deeply saddened by the sudden and untimely loss of Kay Hagan. Our prayers are with her family. \n\nMy full statement: https://t.co/Byc1Fw4Z8R","date":"Mon Oct 28 17:10:23 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"ISIS fighters should take note that their leader died in a hole, miles away from them, in what he thought was a safe haven. The message is clear. There is no safe haven. 2/2","date":"Sun Oct 27 16:54:49 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The U.S. raid against Abu Bakr al-Baghdadi marks an important milestone in the campaign against remaining ISIS leadership. The world is safer without al-Baghdadi in it. 1/2","date":"Sun Oct 27 16:54:49 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"At great risk, the Montagnards provided critical intelligence and fought alongside our military during the Vietnam War.\nToday, North Carolina is home to the largest Montagnard community outside of Vietnam. I'm honored to recognize their heroic contributions and our historic bond.","date":"Wed Oct 23 17:02:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"People and families fighting debilitating diseases like ALS face unexpected challenges. There are steps we can take today to help address some of those burdens, starting with removing penalties for early retirement withdrawals for those with terminal illnesses.","date":"Mon Oct 21 21:28:41 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations to @NCState alum @Astro_Christina for participating in the first-ever #AllWomanSpacewalk!\n\nChristina and @Astro_Jessica have made the country proud, and I hope they will inspire kids everywhere to get involved in STEM programs. \n\nhttps://t.co/AdoCiJSoDH","date":"Fri Oct 18 19:37:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great to see @wnct9 shine a light on Disability Employment Awareness Month. We championed the #ABLEAct so more disabled Americans can pursue jobs that let them use their talents and gives them a sense of purpose. https://t.co/GiIKmxbXhA","date":"Fri Oct 18 13:47:09 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Very saddened to learn of the passing of Elijah Cummings. My thoughts today are with his family and his many, many friends who will feel this loss deeply.","date":"Thu Oct 17 13:56:36 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"It's clear that if America's networks are not secure, the American people are not secure. That’s why I’m working to prioritize solutions that ensure our nation’s cyber infrastructure is safe, resilient, and cutting-edge. 2/2","date":"Wed Oct 16 13:59:30 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Throughout my time as Chairman of Senate Intel, folks have asked me what I think America’s top 5 national security priorities are in the 21st Century.\n \nThe answer is easy. Numbers 1-5 are all cybersecurity. #CybersecurityMonth 1/2","date":"Wed Oct 16 13:59:30 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I hope the @LittleLeague Softball World Series Champion Rowan County All-Stars enjoy their visit to The White House today! North Carolina’s proud of these awesome athletes.\n \n#LLWS 🥎\n \nhttps://t.co/YaKoUoyrBc","date":"Fri Oct 11 14:47:47 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on Turkey's recent actions in Syria: https://t.co/Hu61MtyPId","date":"Thu Oct 10 14:40:37 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wishing an easy and meaningful fast to all those observing Yom Kippur today. https://t.co/inRHZzxzRK","date":"Tue Oct 08 21:00:35 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Social media companies, federal agencies, law enforcement, and Congress must work together to address these challenges, and I am grateful for the cooperation our Committee has gotten from both the Intelligence Community and the tech industry. 4/","date":"Tue Oct 08 16:53:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Any solution has to balance America’s national security interests with our constitutionally-protected right to free speech. 3/","date":"Tue Oct 08 16:53:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"My hope is that by continuing to shine a light on this issue, we will encourage more Americans to use social media responsibly, as discerning and informed consumers. 5/","date":"Tue Oct 08 16:53:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"By flooding social media with false reports, conspiracy theories, and trolls, and by exploiting existing divisions, Russia is trying to breed distrust of our democratic institutions and our fellow Americans.\n \nAnd other adversaries are following suit. 2/","date":"Tue Oct 08 16:53:55 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Russia is waging an information warfare campaign against the U.S. that didn’t start and didn’t end with the 2016 election. Their goal is to sow societal discord and erode confidence in the machinery of government.\n \nRead the new Senate Intel report here: https://t.co/4avncSiWWu","date":"Tue Oct 08 16:53:55 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I want to wish everyone celebrating Rosh Hashanah today a peaceful and sweet new year. https://t.co/8xAbRkU322","date":"Sun Sep 29 19:14:07 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I hope National Public Lands Day reminds my Senate colleagues that we still need to secure permanent funding for the Land and Water Conservation Fund, which is critical for preserving America’s parks and outdoor recreation sites for future generations. #LWCF","date":"Fri Sep 27 17:20:24 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Tomorrow is National Public Lands Day. I hope everyone uses this day to experience the wonder of America's best idea. To celebrate, volunteer in your community or visit one of America's beautiful national parks for free.\n \nClick here to #FindYourPark:\nhttps://t.co/BoS3ro4ao2","date":"Fri Sep 27 17:20:23 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"@nielslesniewski @StevenTDennis I got 99 problems but socks ain’t one.","date":"Thu Sep 26 16:09:53 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the appointment of Robert C. O'Brien to serve as National Security Advisor: https://t.co/7AhJ9deRU7","date":"Wed Sep 18 18:32:09 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On this day, 232 years ago, our Founders signed the Constitution to protect the American ideals of individual liberty, freedom, and self-government, ensuring our nation would be governed by “We the People.” #ConstitutionDay https://t.co/h7bbOMaRjz","date":"Tue Sep 17 14:12:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On Sunday, the Falivenas completed their journey in Atlanta with the @Braves. Larry’s determination to make a difference in the face of his diagnoses is an inspiration. It’s people like him – who refuse to give up the fight - who continue pushing us towards a cure for #ALS https://t.co/8i3spxKoD2","date":"Fri Sep 13 15:57:30 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"When Larry Falivena ( @lfchallengeals ) from Apex, NC was diagnosed with ALS, he and his family decided they were going to challenge the disease by embarking on the \"Iron Horse Tour.\"\n\nThe goal: visit all 30 @MLB ballparks in the country and raise awareness for ALS.","date":"Fri Sep 13 15:57:28 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Touring the damage at the Outer Banks this past weekend, you couldn’t miss all the lineman hard at work getting power restored.\n \nThank you to the first responders, volunteers, and @NCDOT for their incredible efforts helping folks in the aftermath of #HurricaneDorian. https://t.co/u4P2hxMYXK","date":"Thu Sep 12 14:35:04 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I was honored to introduce @UNC_Law Professor Richard Myers at @senjudiciary today.\n\nNominated to serve as a federal judge for the Eastern District of NC, Prof. Myers is well-regarded, well-qualified, and I have faith in his ability to do the right thing every day in his service. https://t.co/TqQvlundJT","date":"Wed Sep 11 16:27:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"After the tragedy of #September11th, Americans came together to support their neighbors, serve their country, and defend our freedoms.\n \nWe will #NeverForget the thousands of innocent lives lost that day, and we will never stop working to keep America safe. https://t.co/GZ2wErToYt","date":"Wed Sep 11 12:42:24 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolinians are encouraged to prepare for #HurricaneDorian and comply with local officials’ recommendations. Follow @NCEmergency, @FEMARegion4, and @RedCrossENC for important safety updates, and click below for additional resources. https://t.co/tIlNoZQrEF","date":"Wed Sep 04 14:51:04 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm proud to have recommended Professor Myers to serve as a judge for the Eastern District of North Carolina. \n\nHe does bring diversity to the federal bench – as well as scholarship and legal brilliance. 🧐","date":"Thu Aug 15 14:39:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Love @bittyandbeaus! Great coffee for a great cause.","date":"Wed Aug 07 15:07:08 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The shootings in El Paso and Dayton are acts of pure evil. We mourn the lives tragically lost, and my prayers are with the victims, their families, and the first responders who rushed to help.","date":"Sun Aug 04 17:04:29 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Since President Trump took office, the Senate has confirmed:\n\n0⃣2⃣ Supreme Court Justices\n4⃣3⃣ Appellate Court Judges \n9⃣9⃣ District Court Judges\n\nThat’s 144 strong, qualified judges confirmed to the federal bench to preserve the rule of law and uphold our Constitution.","date":"Fri Aug 02 17:31:50 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#OnThisDay in 1914, #WWI began. It was called the \"war to end all wars,\" but in many ways the first World War was the beginning, not the end, of the struggle for freedom and human rights that has shaped the last century.","date":"Mon Jul 29 03:00:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Twenty-nine years ago, the Americans with Disabilities Act was signed into law, improving the lives of millions. \n \nWe’ve built on the #ADA with laws like the #ABLEAct, which is helping people with disabilities save for their future and reach their full potential.","date":"Fri Jul 26 20:01:47 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"3/ There has been great progress to improve our election security over the last three years, in part thanks to the Senate Intel Committee's efforts, and it's a testament to what we can accomplish when we give people the opportunity to be part of the solution.","date":"Thu Jul 25 18:46:46 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"2/ Since 2016, we've learned much more about the nature of Russia's cyber activities and better understand the real and urgent threat they pose.","date":"Thu Jul 25 18:46:46 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"1/ Today, the Senate Intelligence Committee released its report on election security - the first volume in our bipartisan investigation into Russian interference attempts in the 2016 U.S. elections. Read it here: https://t.co/g65A6048Gz","date":"Thu Jul 25 18:46:46 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#TeamBurr had a great crop of interns this summer working to help us serve the people of North Carolina while they learned more about government and the legislative process! #NationalInternDay https://t.co/3bbjv7Etdw","date":"Thu Jul 25 18:02:11 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"👇","date":"Wed Jul 24 18:13:43 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, I voted once again to reauthorize the 9/11 Victims Compensation Fund.\n \nWe will never forget the brave police officers, fire fighters, and first responders who answered the call to duty when our nation needed them most.","date":"Tue Jul 23 19:51:51 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"“That’s one small step for man, one giant leap for mankind.” \n\nHalf a century ago, Neil Armstrong etched these words into history in the first moon landing. \n\nToday, let’s use the inspiration of #Apollo50th to motivate us to reach even greater heights through American innovation. https://t.co/Mf6Z5jWObi","date":"Sat Jul 20 13:00:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Brooke and I are wishing our good friend @SenatorIsakson a quick and full recovery.\n\nWe’re thinking about you, Johnny, and I’m looking forward to having you back at work soon!","date":"Thu Jul 18 15:24:12 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Last week, @WSJopinion took issue with the permanent funding of the Land &amp; Water Conservation Fund.\n\nAs a reminder, let's check how much #LWCF – which guarantees the promise of our #NationalParks for ALL future generations – costs the American taxpayer: https://t.co/L5ZkiU62WK","date":"Mon Jul 15 12:45:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The pro move is actually no socks.","date":"Thu Jul 11 17:28:36 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"These great advocates from @JDRF prove that you’re never too young to make a difference. \n\nThanks for taking the time to meet with me to discuss ways to improve treatment and care for those with Type 1 diabetes. https://t.co/chUp6Tb3Ml","date":"Wed Jul 10 21:41:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Brooke and I are wishing everyone a Happy #FourthofJuly! We’re grateful for our nation, for our freedoms, and for the men and women who serve every day to defend them. https://t.co/d5bQefmAAk","date":"Thu Jul 04 14:00:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"After the IG’s devastating report, I led a bill to prohibit the IRS Commissioner from continuing this unacceptable practice. I'm happy to say it was signed into law as part of the #TaxpayerFirstAct, the most significant IRS reform in nearly two decades. 3/3","date":"Tue Jul 02 17:36:24 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2016, the IRS told Congress they weren’t rehiring problem employees, so I asked the Inspector General to investigate. \n\nGuess what the IG found: https://t.co/aEbHhGfoMr 2/3 https://t.co/fXkd6wSESD","date":"Tue Jul 02 17:36:23 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Most Americans agree: Government employees fired for misconduct should not be rehired. However, that's not always the case at the IRS. The agency has a long history of rehiring employees who were previously terminated for offenses like fraud and falsification of documents. 1/3","date":"Tue Jul 02 17:36:22 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Intel Authorization Act advances the IC’s mission of deterring foreign adversaries, strengthening our election security, protecting our technology supply chains, and building a capable workforce: https://t.co/G8qwOCB3WU","date":"Thu Jun 27 20:58:55 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate just passed the Intel Authorization Act as part of #NDAA. This is a significant investment in the men and women of our IC and the work they do to keep our nation safe: https://t.co/G8qwOCB3WU","date":"Thu Jun 27 19:23:04 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m headed to the Senate floor to discuss the importance of including the Intelligence Authorization Act in this year’s #NDAA. \n\nTune in ➡️ https://t.co/CVk01diVAF","date":"Tue Jun 25 20:30:46 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Pandemic and All-Hazards Preparedness and Advancing Innovation Act is now law. \n\nThis will ensure our nation is prepared against the ever-growing variety of public health threats, including diseases, biological attacks, and natural disasters. \n\nMore: https://t.co/VQsCi6CRte","date":"Mon Jun 24 23:10:35 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Catawba and the Lumbee deserve fair consideration by North Carolina on the merits. The stakes are too high. https://t.co/PGdpfBwjwg","date":"Wed Jun 19 18:53:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"For years, the Eastern Band of Cherokee Indians have demonstrated their willingness to disenfranchise other tribes in order to protect their own lucrative gaming monopoly. Read my op-ed here: https://t.co/PGdpfBwjwg","date":"Wed Jun 19 14:05:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy Father’s Day!\n\nMy children and grandchildren are my pride and joy, and I know the lessons we impart to the next generation are our most important legacy. https://t.co/oDe3T93xEC","date":"Sun Jun 16 13:04:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy Flag Day and happy 244th birthday United States Army. \n\nTo the millions of veterans and current men and women in uniform, thank you for your service. https://t.co/PgjLbHvCvC","date":"Fri Jun 14 21:00:01 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":".@NatParkTrust &amp; @nature_org are terrific organizations that not only preserve the great outdoors, but invest in future generations to foster conservation stewardship. I was honored to receive the Bruce Vento award and Nature’s Advocate award for my work to make #LWCF permanent. https://t.co/g8WW46Emjn","date":"Fri Jun 14 18:58:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today would have been President George H.W. Bush’s 95th birthday. He was one of America’s greatest public servants, and though he’s no longer with us, his words continue to inspire. https://t.co/KpWeNYseND","date":"Wed Jun 12 13:41:37 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Love seeing North Carolina’s #STEM students put their skills to work. Congratulations, y’all.","date":"Tue Jun 11 12:54:21 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2009, Brooke and I visited Normandy, where we met many veterans who fought on #DDay. It was an honor to thank them and pay our respects to the fallen.\n\nWe remain forever humbled by the legacy of the Greatest Generation. https://t.co/FIl6X7CKil","date":"Thu Jun 06 14:44:34 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #DDay75, we remember the ordinary men who didn’t set out to make history, but to fulfill their duty and return home. Their unwavering commitment to victory secured freedom for millions, and reminds us that liberty requires defending. https://t.co/jCrqDnGDrT","date":"Thu Jun 06 14:44:34 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Gen. Dwight D. Eisenhower to Allied troops, 75 years ago today: “The eyes of the world are upon you.” \n\n#DDay75 https://t.co/3XAoOPx9En","date":"Thu Jun 06 11:30:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I've talked a lot about why it's so important we renew the Pandemic and All-Hazards Preparedness Act, but maybe I should I just tell people to watch #TheHotZone. @NatGeoChannel certainly gets the point across! https://t.co/43zVsIwmhe","date":"Tue Jun 04 21:25:18 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great news- the House just voted to reauthorize #PAHPA. This bipartisan bill ensures America’s defenses are ready for the public health threats of the 21st century. Learn how this legislation strengthens our preparedness &amp; response capabilities here:\n\nhttps://t.co/cEasBUaqkw","date":"Tue Jun 04 19:27:57 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Disaster relief funding is finally headed to the President’s desk. I’m pleased NC families, small businesses, &amp; our military bases, including Camp Lejeune, will now have the resources needed to rebuild &amp; recover from #HurricaneFlorence.","date":"Mon Jun 03 23:08:11 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Disaster relief was needlessly delayed again last week. It is unacceptable that political grandstanding has kept families from getting the help they badly need. Let’s get disaster relief to the President’s desk immediately.","date":"Mon Jun 03 17:29:40 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m saddened by the passing of my friend and former colleague Thad Cochran. Thad was a true statesmen who loved his home state of Mississippi and his country, and who dedicated his life to serving them both. \n\nMy prayers today are with his family.\n\nhttps://t.co/Q83q4CUTnG","date":"Thu May 30 16:34:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"This #MemorialDay, as we gather with our family and friends, we remember America’s fallen heroes and pay tribute to the ultimate sacrifice they made for our country. https://t.co/79ggidCdOw","date":"Mon May 27 14:01:27 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"As 5G networks become a reality, it’s critical we get them right. I appreciate @AjitPaiFCC working with Sprint and T-Mobile to make sure rural areas will be widely connected under 5G and that America continues to lead on this next frontier.","date":"Fri May 24 21:00:25 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"This funding will help thousands of NC families still recovering from #HurricaneFlorence. \n\nIt will help rebuild Camp Lejeune &amp; other military bases, providing hundreds of millions of dollars for repairs. \n\nAnd it will help make sure we are prepared when the next storm hits. 2/2","date":"Thu May 23 22:06:28 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"After months of stonewalling from Congressional Democrats, I am glad the Senate has finally passed critical disaster relief funding that Americans across the country desperately need. 1/2 https://t.co/C0fe5jtQyK","date":"Thu May 23 22:06:28 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Robocalls: Everyone gets them, no one likes them. Today, the Senate took a significant step to fight these unwanted, intrusive calls by passing the TRACED Act, which:\n\n✔️Enhances FCC's enforcement against illegal robocallers\n✔️Cracks down on caller ID spoofing","date":"Thu May 23 17:33:12 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Was honored to kick off @nature_org's Land &amp; Water Conservation Fund celebration tonight! Kudos to the many folks there who helped us make #LWCF permanent, so future generations will benefit.\n \nBut the fight doesn’t end there. Next up: permanent funding. https://t.co/aI3gEPNm2r","date":"Wed May 22 00:06:04 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good news: @HUDgov announced NC will receive $336.5 million for Hurricane Florence recovery efforts. This is a step in the right direction, but I remain committed to making sure we prioritize more long-term disaster relief for North Carolinians and our military bases.","date":"Tue May 14 19:30:47 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was terrific meeting with @NCEmergency yesterday. They’re a great resource to help you and your family create an emergency plan and get important, up-to-date information during a natural disaster. #HurricanePreparednessWeek https://t.co/abdrPQiBJo","date":"Wed May 08 19:00:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"This week is #HurricanePreparednessWeek. N.C. has seen some devastating natural disasters in the last few years, including #HurricaneFlorence, so I urge everyone to take hurricane threats seriously and to make an emergency plan now.","date":"Wed May 08 16:36:24 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"But the most important thing is making imaging research a reality for patients. Last night’s showcase featured N.C. researchers from @DukeU, @UNC, and @WakeForest (go Deacs!), as well as others from around the country, who are working on just that. 4/4","date":"Wed May 01 22:36:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Nearly 20 years later, NIBIB boasts 230 employees and supports more than 800 active research grants. Because of it, we’re seeing advancements in nanotechnology, leveraging 3-D printing, and exploring the use of AI. Imaging is at the cutting edge of medicine. 3/4","date":"Wed May 01 22:36:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2000, @NIH and Congress started the National Institute of Biomedical Imaging &amp; Bioengineering with a clear goal: create a place where biotech, engineering, and research come together to accelerate the future of medical imaging technology.  2/4","date":"Wed May 01 22:36:44 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was an honor to speak at @AcadRad’s 10th Anniversary Showcase and see the great work being done by their researchers with support from @NIH’s National Institute of Biomedical Imaging and Bioengineering. \n \nHere’s why research agencies like NIBIB are so important. 1/4 https://t.co/gJrV6ygiCJ","date":"Wed May 01 22:36:42 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"STARTING NOW: The Senate Intelligence Committee’s open hearing on the nomination of Dr. Christopher Scolese to serve as Director of the National Reconnaissance Office (NRO). https://t.co/3jQChEXmGE","date":"Wed May 01 12:52:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Awful news out of @UNCCharlotte. As law enforcement officials and first responders work to secure the area, I urge everyone to follow their instructions and stay safe: https://t.co/6vLClmSXr1","date":"Tue Apr 30 23:17:46 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"https://t.co/kHrLbJLyNt","date":"Thu Apr 18 15:41:12 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"This #TaxDay, we have a booming economy, higher wages, and more opportunities for North Carolinians. Just this past year:\n✔️The U.S. economy created 3.2 million jobs\n✔️Unemployment dropped to 3.9% - the lowest in decades\n✔️Median household income hit an all-time high https://t.co/oquDCQncTx","date":"Mon Apr 15 19:38:40 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Mr. Assange engaged in a conspiracy to steal classified information, putting millions of lives at risk all over the world.  Hopefully, he will now face justice. 2/2","date":"Thu Apr 11 16:27:29 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Under the guise of transparency, Julian Assange and Wikileaks have effectively acted as an arm of the Russian intelligence services for years. 1/2","date":"Thu Apr 11 16:27:28 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Praying for the victims of the terrible blast in Durham yesterday and grateful for those working around the clock to help restore safety. https://t.co/AX2hAortmw","date":"Thu Apr 11 15:49:58 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#LWCF is finally permanent. Now we have to make sure it has the resources necessary to continue its important conservation efforts. Read more here: https://t.co/syDsC2AQs6","date":"Tue Apr 09 21:37:47 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #GoldStarWivesDay, we remember that our servicemen and women are not the only ones who make grave sacrifices for our country. The courage and strength of surviving military spouses deserves our recognition, honor, and gratitude.","date":"Fri Apr 05 20:36:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Nearly 40,000 U.S. veterans are homeless and 1.4 million are at risk of becoming homeless. I’ve reintroduced the Homeless Veterans Prevention Act to remove some of the common barriers preventing homeless vets from accessing the help they need. https://t.co/xaePMCCrXj","date":"Tue Apr 02 20:42:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’ll be joining @DukeSanford TONIGHT at 6pm to discuss my experience serving North Carolinians and the important issues we are working on in Congress. WATCH LIVE: https://t.co/OXLOmc1YhV","date":"Mon Apr 01 21:15:11 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #GreenNewDeal is unworkable, unachievable, and unaffordable. It would eliminate entire industries, hurting middle-class and working families the most. It’s a shame Senate Dems voted “present” today instead of taking a stand on their own party’s extreme proposal.","date":"Tue Mar 26 21:50:45 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"In the coming weeks and months, the Senate Intelligence Committee will complete its remaining interviews and issue its reports on Russia’s attempts to interfere in our U.S. elections. 2/2","date":"Sun Mar 24 22:10:41 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I appreciate the Attorney General’s quick turnaround in sharing his summary of the Special Counsel’s report. AG Barr should release as much of the report as possible, without jeopardizing U.S. intelligence sources and methods or ongoing Department of Justice prosecutions. 1/2","date":"Sun Mar 24 22:10:40 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I trust Special Counsel Mueller has conducted a fair and thorough investigation, and I look forward to reviewing his report.","date":"Fri Mar 22 21:57:47 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"My prayers are with the victims of today’s horrific attack. An attack on a mosque, or any place of worship, is an evil and despicable act. America stands united with New Zealand in condemning it.","date":"Fri Mar 15 19:34:12 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"https://t.co/NrL0wivg8f","date":"Thu Mar 14 19:51:56 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"As we celebrate #NationalAgricultureDay, I want to thank all the North Carolina farmers and producers who make our ag industry one of the most diverse in the nation. https://t.co/fUPOtKXDke","date":"Thu Mar 14 16:24:08 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today is a great day! President Trump signed into law a bipartisan lands package making #LWCF permanent. I am glad to see #LWCF finally cross the finish line. Now it can continue its important conservation work with certainty, benefiting future generations https://t.co/ui4bjep767","date":"Tue Mar 12 21:26:22 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"President Trump was right to walk away from the table in Hanoi. If North Korea wants to discuss sanctions relief, it must be ready to show verifiable progress toward denuclearization and stop its human rights atrocities. Anything less would be a bad deal.","date":"Fri Mar 01 22:00:05 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud of my staff for participating in this year’s #ACECFC step challenge! Go Team Burr! https://t.co/fFTCwQJb5V","date":"Fri Feb 15 20:09:30 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On an overwhelming, bipartisan vote of 92-8, the Senate votes to #SaveLWCF. My full statement here: https://t.co/DVVFU1SxiE https://t.co/LrxGwqSAff","date":"Tue Feb 12 22:55:08 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#LWCF is a program that matters. It makes a difference. And it operates at NO COST to taxpayers. Voting to protect it is the right thing to do. 4/4","date":"Tue Feb 12 21:16:39 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"I want to thank my colleagues, @SenCoryGardner, @SteveDaines, @SenatorCantwell, @SenatorBennet and many others, who helped lead the charge to #SaveLWCF and to preserve America’s amazing natural treasures. 3/4","date":"Tue Feb 12 21:16:39 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Big News: The Senate is about to vote to #SaveLWCF, America’s most successful conservation program, as part of the #LandsPackage2019. Today’s vote will provide the certainty necessary for #LWCF to carry out important long-term efforts. 1/4","date":"Tue Feb 12 21:16:38 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today’s vote has been a long time in the making. We knew three years ago that #LWCF (founded in 1965) would expire in Sept. 2018, but despite strong bipartisan support, Congress was slow to act. I am glad we’re finally fixing that. 2/4","date":"Tue Feb 12 21:16:38 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"@RepWalterJones and I came to Washington together in 1995. Having worked alongside him for nearly 25 years, I can tell you without hesitation that he left North Carolina, Congress, and our country better places than he found them. 1/2","date":"Mon Feb 11 01:10:49 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Walter will be remembered as a man of strong principles, willing to take an unpopular stand when necessary. He was a hard-working and faithful public servant, and he will be sorely missed. Our prayers are with his family – may he rest in peace. 2/2","date":"Mon Feb 11 01:10:49 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Saddened to hear of the passing of my friend and former colleague @JohnDingell. John was a true legend in the House, and anyone who worked with him learned a great deal in the process.","date":"Fri Feb 08 15:03:34 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you @SecElaineChao &amp; @USDOTFRA Administrator Batory for this needed investment in NC’s and America’s infrastructure. These improvements mark the next step toward high-speed rail between Raleigh and Richmond, helping bring our transportation system into the 21st century. 2/2","date":"Wed Feb 06 22:34:33 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":".@USDOTFRA announced a crucial $10 million grant to @NCDOT yesterday, providing several needed railway upgrades, highway improvements, and traffic alleviation near Raleigh, NC. 1/2","date":"Wed Feb 06 22:34:32 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy birthday to one of the greatest presidents in our nation’s history, Ronald Reagan!","date":"Wed Feb 06 21:28:39 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Our economy is booming, our job market is flourishing, and millions of Americans now get to keep more of their hard-earned paychecks each week. My full statement on tonight’s #SOTU here: https://t.co/VFZFqiYbjs","date":"Wed Feb 06 04:03:06 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":".@NatlParkService announced yesterday that two more North Carolina battlefields will be preserved for future generations thanks to #LWCF. This is yet another example of why we have to #SaveLWCF - so it can continue its important conservation work. https://t.co/cvQ4KeceV3","date":"Tue Feb 05 15:00:09 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"304k more jobs in January with private-sector wages rising 3.2% over the last year, according to @BLS_Gov. Continued growth and success thanks to the #TaxCutsandJobsAct https://t.co/nJj8Td9XZK","date":"Fri Feb 01 20:44:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"As #BlackHistoryMonth begins, let’s honor the brave young men whose decision to sit down at the Woolworth’s lunch counter in Greensboro, NC inspired a sit-in movement across the South. #OnThisDay in 1960.","date":"Fri Feb 01 19:46:33 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Our enemies are going to keep finding new ways of attacking us that exploit the openness of our society, and slip through the seams in a national security architecture designed for the Cold War. We can’t afford to get complacent.\n\nFull statement here: https://t.co/0fM03TyiFD","date":"Tue Jan 29 15:08:54 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"STARTING NOW: #WorldwideThreats hearing at Senate Intel Committee. Tune in live: https://t.co/plW1fe44j6","date":"Tue Jan 29 14:34:59 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel’s #WorldwideThreats hearing is an important opportunity for the American people to hear what the intel community is doing to meet the global threats facing our nation. Watch live @ 9:30am ET: https://t.co/plW1fe44j6","date":"Tue Jan 29 12:15:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"2/Huawei is a global bad actor operating at the behest of the Chinese government and intelligence services. It seeks to undermine legitimate competition, while subverting laws and democratic institutions.","date":"Mon Jan 28 22:55:53 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"3/These indictments should send a clear message that the U.S. will not tolerate pernicious and illegitimate behavior that threatens our economic and national security.","date":"Mon Jan 28 22:55:53 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"1/I am encouraged by @TheJusticeDept actions against Huawei, which detail the company’s brazen efforts to steal corporate trade secrets, commit fraud, and obstruct justice.","date":"Mon Jan 28 22:55:52 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Reminder ➡️ Tomorrow @ 9:30am, Senate Intel will hear from @ODNIGov Dan Coats, @FBI Dir. Christopher Wray, @CIA Dir. Gina Haspel and others. Stream it live here: https://t.co/plW1fe44j6 #WorldwideThreats","date":"Mon Jan 28 20:02:27 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #InternationalHolocaustRemembranceDay, we pay tribute to the nearly six million Jews, Poles, Slavs, and others who were tragically murdered out of hate. May God bless their souls, and may we never forget their story. https://t.co/KWHcYrgIkd","date":"Sun Jan 27 12:30:00 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel will hold its annual Worldwide Threats hearing next Tues. @ 9:30 a.m. Heads of @ODNIgov, @FBI, @CIA, @NSAGov among those testifying: https://t.co/YdkcaTx6CW","date":"Wed Jan 23 21:45:59 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"Dr. Martin Luther King Jr.’s compassion and persistence as the leader of the civil rights movement inspired generations of leaders around the world. Today, we remember his legacy and strive to carry on his work. #MLKDay https://t.co/x1FDof9eyG","date":"Mon Jan 21 14:22:27 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"With the 46th Annual March for Life this weekend, @SenThomTillis and I welcomed hundreds of North Carolinians to Washington. Great to see so many marching for such an important cause: the protection and sanctity of every human life. https://t.co/0qu2XIzJqb","date":"Fri Jan 18 20:33:36 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"The attack in Syria is a disturbing reminder that ISIS has not stopped its attacks on America and our allies. The servicemembers we lost today made the ultimate sacrifice for their country and my prayers are with their families.","date":"Wed Jan 16 23:07:33 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"On the Senate Floor now to talk about about @US_FDA’s public health priorities. Watch live here ➡️ https://t.co/p5ZUKRkMdL","date":"Wed Jan 16 20:51:19 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#HappyNewYear! I’m looking forward to 2019 and getting back to work on behalf of North Carolina. It is an honor to represent our great state in the U.S. Senate. https://t.co/mK6yGaZffF","date":"Tue Jan 01 18:41:10 +0000 2019","user_id":"21157904"},{"handle":"SenatorBurr","text":"#MerryChristmas everyone - Brooke and I want to wish you all a safe and happy holiday with your friends and loved ones, God bless. https://t.co/r59tz1tQ9w","date":"Tue Dec 25 13:07:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"It has been my great honor to work with Secretary Mattis on some of the most pressing national security challenges facing America. I thank him for his lifetime of service to our great nation, and wish him all the best in his future endeavors. https://t.co/j1qPoz3Xez","date":"Fri Dec 21 00:06:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"2/While @USTreasury has made great strides, this deal will require constant monitoring to ensure that neither Mr. Deripaska nor the Russian gov't violate the terms. Full statement here: https://t.co/bJdm7DBBai","date":"Wed Dec 19 22:40:44 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"1/Today’s @USTreasury announcement, which comes as a result of negotiated changes to the En+ corporate structure, does not change the fact that Mr. Deripaska and his companies work at Vladimir Putin’s behest &amp; operate as de facto representatives of the Russian government.","date":"Wed Dec 19 22:40:44 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Confirms Vice Adm. Joseph Maguire to National Counterterrorism Center. My statement here: https://t.co/7x2cv07Auf https://t.co/IBrblqSL1w","date":"Wed Dec 19 18:26:53 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#OnThisDay: 115 years ago, Orville and Wilbur Wright took to the air in the first-ever controlled, powered flight at present-day Kill Devil Hills, NC. The world changed forever thanks to the ingenuity and bravery of the #WrightBrothers. #FirstinFlight https://t.co/mnKqcXi41H","date":"Mon Dec 17 20:17:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"NEW: Third-Party Expert Reports Shed Light on Internet Research Agency’s Social Media Tactics ➡️ https://t.co/0nPzK5jLmF","date":"Mon Dec 17 17:11:21 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The deadline for #HurricaneFlorence aid applications has been extended to December 19th at 11:59pm. To learn more, visit https://t.co/eAoVZ7nbro or call 800-621-3362 or 800-462-7585 (TTY). https://t.co/Vhg9cotXB9","date":"Thu Dec 13 21:34:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#OnThisDay: In 1789, the North Carolina General Assembly approved the charter for the University of North Carolina, establishing America’s first public university. Happy Birthday to the @UNC_System! https://t.co/w1DjQQOPld","date":"Tue Dec 11 18:56:16 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"For those affected by #HurricaneFlorence, Thursday, December 13th is the deadline to register for @FEMA or @SBAgov assistance. Visit https://t.co/ejRZ3L4E1N or call 800-621-3362 to find out more. https://t.co/orkSKXWvR9","date":"Mon Dec 10 19:04:53 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolina wins big with this @USDOT investment in our state’s future.","date":"Thu Dec 06 20:00:30 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, we honored Pres. George H.W. Bush in the U.S. Capitol Rotunda. Following in the tradition of great presidents before him, the 41st President will lie in state at the cathedral of our democracy. We thank him for his incredible service, and may he rest in peace. https://t.co/wISLMZjE49","date":"Mon Dec 03 22:50:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy birthday to the #QueenCity! Two and a half centuries looks good on you, Charlotte. https://t.co/9aT1pr3FU1","date":"Mon Dec 03 16:14:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"A must-read from National Intelligence Director Dan Coats, detailing Russia’s INF treaty violations and the critical choice America faces: https://t.co/UTDGeSFprN","date":"Mon Dec 03 15:46:08 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"George H.W. Bush was the last of the Greatest Generation to serve as president, and his legacy reflects the values learned through hardship and war: integrity, humility, and honor. https://t.co/ZcH6p77qKf","date":"Sat Dec 01 16:17:41 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m about to join Senator @MarkWarner and Senator @JohnCornyn at the Texas National Security Forum. Thanks to @UTAustin, the @StraussCenter, and the @ClementsCenter for the invite. Watch here live! https://t.co/unGkF3iiur","date":"Fri Nov 30 16:55:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My staff reminded me it’s my birthday today. Who do you think has more miles, The Thing or… you know what, on second thought, don’t answer that… https://t.co/nntbgEZaz6","date":"Fri Nov 30 15:02:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Michael Cohen’s indictment and guilty plea is once again an example that you cannot lie to Congress without consequences. It should be no surprise that Mr. Cohen has had in his possession for months a letter requesting return visits to the Committee. https://t.co/3kTc7hBnnC","date":"Thu Nov 29 19:52:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This year’s #NationalChristmasTree comes from Newland, NC! For local grower Larry Smith, having a tree at the @WhiteHouse has been a lifelong dream:  https://t.co/tplnSBrx4w","date":"Wed Nov 28 13:03:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Just like you, Skippy!","date":"Tue Nov 27 22:17:40 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #CapitolChristmasTree arrived in DC today. It’s a little big for the living room, but fits great on the @USCapitol lawn.","date":"Mon Nov 26 22:02:18 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"It’s #SmallBusinessSaturday, folks! Don’t forget to support our friends, neighbors and communities and #ShopSmall.","date":"Sat Nov 24 17:36:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Small businesses make up the core of our nation’s economy and support 1.6 million North Carolinians, nearly half of our state’s private sector employees. #SmallBusinessSaturday #ShopSmall","date":"Sat Nov 24 17:36:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"As folks across the state spend time with loved ones, I want to wish everyone a safe, peaceful, and #HappyThanksgiving. https://t.co/NkN5NOPX7x","date":"Thu Nov 22 12:25:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#HurricaneFlorence, #HurricaneMichael, and the #CaliforniaWildfires left untold damage in their wake. As folks return home, the tax relief legislation I introduced will give individuals and businesses crucial tools to recover and rebuild: https://t.co/ezItmRBUv4","date":"Wed Nov 21 13:23:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"229 years ago today, North Carolina ratified the U.S. Constitution to become the nation’s 12th State. Here’s to the land of the long leaf pine! #NCBday #OTD https://t.co/mGrpP3itRE","date":"Wed Nov 21 12:01:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you’re one of the thousands still recovering from the devastating natural disasters this year, the bipartisan tax relief legislation I introduced will help you save your hard-earned money and get back on your feet. https://t.co/ezItmRBUv4 https://t.co/DuL0Lmq8DI","date":"Mon Nov 19 19:15:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations to my friend and long-time colleague, @SenOrrinHatch. An honor well-deserved.","date":"Fri Nov 16 20:15:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to be leading a bipartisan group of Senators working to provide much needed tax relief for victims of recent hurricanes and wildfires. Our bill will help lessen the burden for those still struggling to rebuild their lives and livelihoods: https://t.co/ezItmRBUv4","date":"Fri Nov 16 16:44:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see North Carolinians who are still recovering from #HurricaneFlorence step up to help folks affected by the terrible #CaliforniaWildfires. https://t.co/bbJbmlpkBc","date":"Tue Nov 13 20:45:08 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #ArmisticeDay100, we remember the courage &amp; sacrifice of those lost in #WWI. And we thank all our nation’s veterans who helped protect American freedoms: https://t.co/1lRlDB5BXj #VeteransDay","date":"Sun Nov 11 19:16:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy 243rd birthday to the @USMC! With 45% of the Marines Corps based in North Carolina, I’m proud to represent some of our bravest men and women in uniform, including those at @Camp_Lejeune and @MCASCPPA. #SemperFi! https://t.co/nHWW9Ols8l","date":"Sat Nov 10 13:49:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Jeff Sessions has a long and distinguished record of public service. I want to thank him for his work on behalf of the American people as the nation’s top law enforcement officer, and I wish him all the best.","date":"Wed Nov 07 22:11:13 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolinians now have until Thursday, December 13th, 2018 to register for disaster assistance to recover from #HurricaneFlorence. Go to https://t.co/eAoVZ7nbro to learn more.","date":"Thu Nov 01 18:41:21 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Acts of terrorism, whether foreign or domestic, are cowardly and will not be tolerated. I want to thank state and federal law enforcement officials for their swift response to today’s threats. We must find those responsible and hold them accountable.","date":"Wed Oct 24 20:56:35 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm incredibly grateful that Pastor Brunson has finally been released from his long and unjust detainment in Turkey. Our prayers are with Pastor Brunson and his family as they celebrate his return and recover from this brutal ordeal: https://t.co/QOzUMMk3sM","date":"Fri Oct 12 18:24:09 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"It is deeply disappointing that this confirmation process has been marred by unnecessary delays and bitter personal attacks. The Senate’s constitutional responsibility is to provide advice and consent to the President, and today the Senate fulfilled that responsibility.","date":"Sat Oct 06 20:19:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Justice Kavanaugh has proven himself to be a fair, serious and qualified jurist, who will continue his distinguished record of service on the U.S. Supreme Court.","date":"Sat Oct 06 20:19:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The landmark opioid legislation passed today will support recovery centers, bolster law enforcement efforts, and encourage new forms of prevention and treatment to help combat the #opioidcrisis: https://t.co/mOgKt7sTlM","date":"Wed Oct 03 20:01:31 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you were affected by #HurricaneFlorence, go to https://t.co/eAoVZ7nbro to see if you’re eligible for individual or public assistance from @FEMA. https://t.co/jd7ukVU3T1","date":"Wed Oct 03 16:48:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congress just passed $1.14 billion in much-needed disaster relief for North Carolina. The road to recovery will be long, but we won’t stop till the job is done. https://t.co/UoAIrhB4DD","date":"Wed Oct 03 16:48:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I won’t quit until we renew the #LWCF. That’s a promise. #SaveLWCF https://t.co/XFfJzKEqYw","date":"Fri Sep 28 16:57:33 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"All the way to California, folks in Santa Barbara Co. benefit from #LWCF funding. From their Channel Islands National Park to their Shoreline Park or ball fields and beaches - #LWCF keeps America’s great outdoors available for everyone to enjoy. #SaveLWCF https://t.co/ZTrUJ3hFz1","date":"Thu Sep 27 12:59:59 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The @PostandCourier in Charleston, SC makes the important point that projects include “boardwalks on Folly Beach, …the Patriots Point golf course in Mount Pleasant, and Sunrise Park on James Island.” #SaveLWCF https://t.co/SQJ3WwDtaR","date":"Thu Sep 27 12:59:59 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In Nevada, #LWCF programs can range from large projects like the Lake Mead National Recreation Area to the Baily Fishing Pond, as small as one acre, writes a fan in the @RGJ. #SaveLWCF https://t.co/I1Q2WGdL7u","date":"Thu Sep 27 12:59:59 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Folks in Minnesota write in the @DuluthNews that the Boundary Waters Canoe Area Wilderness access needs to be preserved, and #LWCF dollars can make that possible. #SaveLWCF https://t.co/LD6aLrEuWH","date":"Thu Sep 27 12:59:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In Connecticut, members of the Audubon Society write in the @HartfordCourant about Hammonasset Beach and Bluff Point State Parks made possible by the #LWCF. #SaveLWCF https://t.co/Xqndwj1XUo","date":"Thu Sep 27 12:59:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The @BangorDailyNews notes Maine has nearly 740,000 acres maintained by #LWCF’s Forest Legacy program - more than another other state: https://t.co/qdcW5mFsF3","date":"Thu Sep 27 12:59:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Land and Water Conservation Fund is just days from expiring. Newspapers and voters across the country agree: we have to act now to #SaveLWCF. From Maine to Minnesota, Connecticut to California - #LWCF preserves public lands for the public to enjoy.","date":"Thu Sep 27 12:59:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you take away one thing about the #LWCF, it should be this: it costs ZERO taxpayer money. #SaveLWCF https://t.co/zKtp07sMAz","date":"Wed Sep 26 19:30:13 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’ll be speaking on the Senate floor this afternoon with Senator @SteveDaines and @SenCoryGardner about the importance of #LWCF. You can watch live here: https://t.co/n0AeFZkglV","date":"Wed Sep 26 18:41:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on Judge Kavanaugh: https://t.co/WyLzJucmF5","date":"Tue Sep 25 21:09:12 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"At no cost to the American taxpayer, #LWCF preserves public lands across the country and in nearly every congressional district. This is a no-brainer - we need to renew this vital program before it expires on Sept. 30. #SaveLWCF","date":"Mon Sep 24 18:04:03 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you to the incredible men and women of our armed forces who didn't hesitate to come to the aid of their neighbors and friends in #HurricaneFlorence's wake. Without them, the damage and lives lost could’ve been so much worse. @FtBraggNC @Camp_Lejeune https://t.co/PGviTIAjiO","date":"Mon Sep 24 16:42:39 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Army Pfc. William H. Jones of Nash County, one of North Carolina’s sons MIA from the Korean War, was among the heroes recently returned to the United States. We welcome him home and owe him and his family a debt of gratitude for his service. #POWMIADay https://t.co/od9jZ3U7mc","date":"Fri Sep 21 19:19:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Tomorrow @NatlParkService hosts the 25th Annual #NationalPublicLandsDay, offering free admission at all national parks across the country. It’s programs like #LWCF that make many of these parks possible! Learn more here: https://t.co/DKYzV6qWK9","date":"Fri Sep 21 19:06:01 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"New report from @CommerceGov finds outdoor recreation accounts for more than $400 billion in economic activity. Another reason we need to #SaveLWCF before it expires this month: https://t.co/eHD3IBs8wg","date":"Thu Sep 20 19:47:53 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, I visited Cherry Point @MCASCPPA w/@SenThomTillis and @realDonaldTrump. I continue to be impressed by the level of cooperation between fed, state, and local recovery efforts following #HurricaneFlorence. For those who need help, visit https://t.co/eAoVZ7nbro for more info. https://t.co/glR98CnWpE","date":"Wed Sep 19 20:29:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Operating at no cost to the taxpayer, #LWCF is by far our most successful conservation program. Not just because it preserves our beautiful outdoors for the next generation, but because it helps protect our communities today. #SaveLWCF","date":"Tue Sep 18 21:54:39 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"After #HurricaneSandy, wetlands like the LWCF-funded Cape May National Wildlife Refuge in New Jersey saved an estimated $650 million in damages. #LWCF funds create beautiful spaces that double as critical infrastructure. #SaveLWCF","date":"Tue Sep 18 21:54:38 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"For instance, the natural green spaces and parks that wind through Charlotte aren't just there for their looks. The Four Mile Creek Greenway also absorbs rain drainage, slowing it down and doubling as a flood control. #SaveLWCF","date":"Tue Sep 18 21:54:38 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"With just 12 days left before the Land and Water Conservation Fund expires, I am as committed as ever to making sure Congress reauthorizes America's most successful conservation program. #SaveLWCF","date":"Tue Sep 18 21:54:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolinians have more on their minds today than recreation, as we contend with the terrible damage inflicted by #HurricaneFlorence. But #LWCF is critical for building the infrastructure communities need to minimize floods and heavy rains. #SaveLWCF","date":"Tue Sep 18 21:54:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#IRS has extended tax filing deadlines for victims of #HurricaneFlorence in key counties. Find out if you qualify for tax relief here ➡️ https://t.co/bRSTp6Asf3","date":"Tue Sep 18 16:19:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you have a speech disability or hearing loss and you use a text phone, dial 1-800-462-7585 to apply for federal disaster assistance after #HurricaneFlorence.","date":"Sat Sep 15 15:04:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#HurricaneFlorence major disaster declaration applies to Beaufort, Brunswick, Carteret, Craven, New Hanover, Onslow, Pamlico, and Pender Counties. If you’re in one of those counties, apply for assistance at https://t.co/ejRZ3L4E1N or call 1-800-621-3362.","date":"Sat Sep 15 15:04:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":".@realDonaldTrump granted North Carolina’s request for a major disaster declaration following #HurricaneFlorence, so federal aid can get to the people who need it most faster. https://t.co/KaqgY9HceB","date":"Sat Sep 15 15:04:09 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I joined @SenThomTillis and the rest of the North Carolina congressional delegation in asking @realDonaldTrump for an expedited major disaster declaration in the wake of #HurricaneFlorence. As the storm continues, stay safe and listen to local officials. https://t.co/KaqgY9HceB","date":"Fri Sep 14 19:45:28 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"As #HurricaneFlorence approaches the coast, please call 2-1-1 if you need assistance or visit @RedCross's website here for information on open shelters. Stay safe.\nhttps://t.co/ffD4jupuzN","date":"Thu Sep 13 20:14:06 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This morning, I spoke to @BillHemmer from @FoxNews about #HurricaneFlorence. My message: Listen to the evacuation notices and heed their warnings. https://t.co/vPsUgoaPSI","date":"Wed Sep 12 20:12:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Important information for Veterans in the path of #HurricaneFlorence:\nVeterans Disaster Response Line: 1-800-507-4571\nVA Health Resource Center - Pharmacy Customer Care: 1-866-400-1243   \nhttps://t.co/fBmdsdDHzv","date":"Wed Sep 12 19:41:15 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Executive Order signed today by @realDonaldTrump strengthens our ability to quickly and appropriately hold responsible anyone who interferes in our elections. https://t.co/bX7niwZ3n1","date":"Wed Sep 12 19:32:07 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Median household income is the highest it's ever been - more than $61,000. The #TaxCutsandJobsAct continues to benefit millions of American households and families. https://t.co/kbP0ar10Cs","date":"Wed Sep 12 17:17:42 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Coming Up: I’ll be on @FoxNews shortly to discuss North Carolina’s preparations and response to #HurricaneFlorence. https://t.co/m5DVHvwCpS","date":"Wed Sep 12 13:44:12 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If a mandatory evacuation has been issued for your town, please comply and listen to local officials. Get updates by downloading the Ready NC app or checking https://t.co/iwXuZvUKxT #HurricaneFlorence","date":"Tue Sep 11 20:56:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#HurricaneFlorence threatens to be a serious and dangerous weather event for North Carolina. I want to thank @realDonaldTrump for approving @NC_Governor Cooper's request for an Emergency Declaration, which mobilizes federal assistance to support state and local response efforts.","date":"Tue Sep 11 20:56:18 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Now is the time to prepare. Make sure you have emergency supplies in your home: bottled water, battery-powered flashlights, phone chargers and extra cash. Have an emergency communications plan with your family and know what the evacuation route is in your area. #HurricaneFlorence","date":"Tue Sep 11 20:56:18 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Call 2-1-1 for North Carolina's State Emergency Response Team. They have access to real time information on shelters, evacuation routes, and can help you find food, meal sites, water, and other recovery and rebuilding resources. #HurricaneFlorence https://t.co/ixPWKwHi0y","date":"Tue Sep 11 17:02:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today we remember the nearly 3,000 innocent lives lost in the terrorist attacks on Sept. 11, 2001. We will never forget the tragedy of that day. And we will never stop fighting to protect American freedom. #NeverForget #September11 https://t.co/xsGcoBeY7Z","date":"Tue Sep 11 13:14:18 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"We're encouraging North Carolinians to be prepared for #HurricaneFlorence and to comply with any evacuation recommendations or mandates. Click here for statewide resources and preparedness tips: https://t.co/a2nk8y2tJW","date":"Mon Sep 10 22:06:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"As #HurricaneFlorence approaches off the coast, make sure you have the latest updates, evacuation information and safety tips. Follow @NCEmergency and @FEMA, and visit https://t.co/NiNFvgyVnA for more.","date":"Mon Sep 10 18:07:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In August, the U.S. job market added 201,000 jobs and wages rose at the highest rate in nearly a decade, 2.9 percent. The numbers don't lie - the #TaxCutsandJobsAct is working. https://t.co/VJIyBDTUFn","date":"Fri Sep 07 18:30:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Working together, I am confident we can find a path forward to face down those who seek to use social media to sow discord and weaken our democracy. Thank you to @Twitter's @Jack Dorsey and @Facebook's Sheryl Sandberg for joining the Committee today to work towards a solution. https://t.co/FNeaaStUaA","date":"Wed Sep 05 21:53:22 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"We now know how vulnerable social media is to misuse and the threat that poses to our democracy. We’ve identified the problem - now it’s time to identify the solution. Read my full opening statement here: https://t.co/1rG1iyvDPT","date":"Wed Sep 05 13:42:45 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am disappointed that @Google’s  senior leadership chose not to be a part of today’s hearing. Our discussion will be a productive one and will help determine how we address a serious national security risk.","date":"Wed Sep 05 13:36:31 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intel Committee hears from @Facebook COO Sheryl Sandberg and @Twitter CEO Jack Dorsey on foreign influence operations' use of social media platforms. Watch here live: https://t.co/TzLY6hKDvz","date":"Wed Sep 05 13:35:22 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today @ 9:30am, the Senate Intel Committee will hear from @Facebook &amp; @Twitter execs on social media platforms' use in foreign influence operations. You can watch it live here ➡️ https://t.co/TzLY6hKDvz","date":"Wed Sep 05 11:39:14 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The economy grew at 4.2 percent last quarter - the best in nearly four years. There's no doubt that the #TaxCutsandJobsAct continues to benefit millions of Americans and spur economic growth. https://t.co/hwr8QUjJyY","date":"Wed Aug 29 15:50:06 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am glad the Senate has finally confirmed Isabel Patelunas as the @USTreasury’s new Asst. Secretary for Intelligence &amp; Analysis. As America faces new and growing threats, it is critical that our intelligence positions are fully staffed with capable and qualified public servants.","date":"Tue Aug 28 21:32:22 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"John will be remembered as he hoped to be remembered: as a man who served his country with honor. Brooke and send our prayers to Cindy and the entire McCain family. https://t.co/FCpgcmp4eL","date":"Sun Aug 26 01:10:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am deeply saddened by the passing of my friend and colleague, John McCain. John was a true patriot, who placed his duty to his family and his country above all else. He faced this battle with the courage that defined his career and the grace that comes from a life well-lived.","date":"Sun Aug 26 01:10:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I said I’d go down to the Senate floor every day until Congress acts to #SaveLWCF - and I’m keeping that promise. You can watch live here: https://t.co/STSngiB0eW","date":"Thu Aug 23 19:17:40 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Here’s my promise to my colleagues: I’ll keep demanding a vote on the Senate floor - day after day - until we do what the American people want and #SaveLWCF.","date":"Wed Aug 22 18:23:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#LWCF has support from Republicans and Democrats, in the Senate and in the House. Americans support the program and want it to continue. Yet for some reason, the Senate still refuses to take up this issue.","date":"Wed Aug 22 18:23:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Conservation programs, like #LWCF, plan generations ahead and need security to do their work effectively. This solution provides that, while ensuring Congress is still in the driver’s seat.","date":"Wed Aug 22 18:23:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This bill is a bipartisan compromise. It would permanently reauthorize #LWCF, but give Congress the chance to hold a vote of disapproval every 3 years. If the disapproval vote passes, it ends authorization.","date":"Wed Aug 22 18:23:24 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, I asked the Senate to take up a bill to permanently reauthorize the Land and Water Conservation Fund before it expires next month. #LWCF is critical for preserving our national parks and waters for future generations - and uses NO taxpayer funds. https://t.co/TLGrsLlDbc","date":"Wed Aug 22 18:23:24 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"WATCH: Senator Burr Live on Senate Floor Pushing for #LWCF Vote https://t.co/EwMA9cTYEI","date":"Wed Aug 22 16:06:15 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senator @MarkWarner and I released the following statement today on Michael Cohen’s testimony before the Senate Intelligence Committee: https://t.co/0UyEP21qkI","date":"Tue Aug 21 20:50:32 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on former @CIA Director John Brennan’s recent comments: https://t.co/r5Cy3VYmRF","date":"Thu Aug 16 20:55:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":".@SenBobCasey and I wrote this weekend about how we can get more Americans with disabilities working. They are more than willing and ready - and the ABLE Act can help. https://t.co/yGZBN6ueRe","date":"Tue Aug 14 18:25:20 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The number of emotional support animals has spiked in the last year and @Delta has had 6 incidents with dog bites in the last 60 days. Enough is enough. We need to protect veterans and others with disabilities and their fellow passengers at the same time. https://t.co/n903DdwCwj","date":"Wed Aug 08 19:11:07 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The @HBCUCaucus #DiversityInTech Summit aims to improve recruitment and retention of #HBCU graduates looking to enter tech. As home to more HBCUs than any other state, North Carolina is the perfect place to hold today’s inaugural summit! https://t.co/ToaVK6CZHF","date":"Wed Aug 08 18:22:23 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Foreign influence ops using social media -&amp; our own rights &amp; freedoms- to weaken us from within represents an intolerable assault on the democratic foundation this republic was built on. We cannot afford ineffective half-measures, let alone doing nothing. https://t.co/QmEEvtufOV","date":"Wed Aug 01 14:11:51 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intel Committee holds open hearing on foreign influence operations’ use of social media platforms. Watch live here: https://t.co/ZiAhiLQ6Zk","date":"Wed Aug 01 13:38:46 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Looking forward to discussing the issue further at tomorrow’s Senate Intelligence Committee hearing, featuring third-party social media experts. Live streaming Wed. @ 9:30am here: https://t.co/ZiAhiLQ6Zk","date":"Tue Jul 31 18:43:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am glad to see that Facebook is taking a much-needed step toward limiting the use of their platform by foreign influence campaigns. The goal of these operations is to sow discord, distrust, and division. https://t.co/Fzwr1QFfG0","date":"Tue Jul 31 18:43:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The U.S. economy grew at 4.1 percent from April to June, the fastest rate in nearly 4 years. More signs that “the second-longest expansion on record isn’t yet running out of fuel.\" https://t.co/9MAIwonYE9 #TaxCutsandJobsAct","date":"Mon Jul 30 16:19:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Yesterday, I honored C.D. “Dick” Spangler on the Senate floor. He was a great North Carolinian and former President of the @UNC_System. Our prayers are with his wife of 58 years, Meredith, and his family. https://t.co/mXiqLVKp57 https://t.co/MWIIJOd80Y","date":"Fri Jul 27 13:39:46 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I joined Sen. @MarkWarner today to thank the brave men and women of the US Intel Community. Every day, Intel professionals risk their lives to keep our homeland safe. They do so without credit or thanks, but knowing their work is vital for our defense. https://t.co/KRGSMnh8T9","date":"Thu Jul 26 21:34:47 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senator Burr on the Senate floor calling on Congress to #SaveLWCF, America's most successful conservation program: https://t.co/UtlA7jUDu6","date":"Thu Jul 26 15:35:44 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"VADM Maguire and Ms. McCarthy are two highly qualified candidates who have committed their lives to service. I’m confident their leadership of NCTC &amp; State Dept’s INR will benefit the Intel Community and the defense of our country. https://t.co/2KEw0vMzgt","date":"Wed Jul 25 18:33:22 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s Senate Intelligence Committee Hearing: https://t.co/9EdXgd68qG","date":"Wed Jul 25 13:50:27 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"LIVE NOW: Senate Intel confirmation hearing for 2 key Intel positions: Dir. of National Counterterrorism Center and Asst. Sect of State for Intel &amp; Research: https://t.co/KVIxqApG3i","date":"Wed Jul 25 13:43:40 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"“In nearly every congressional district, #LWCF helped set up… playgrounds, sports fields, picnic sites, community recreation centers and hiking trails. The Grand Canyon, the Appalachian Trail and Central Park have all benefited.” #SaveLWCF https://t.co/Xhv3K8VfmD https://t.co/T8JURlJdJP","date":"Tue Jul 24 14:45:09 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"New study in WI finds the Land and Water Conservation Fund is popular with folks of every political party - 86% support our nation’s most important conservation program. Yet another reason Congress should #SaveLWCF! https://t.co/zzduWvvZLX","date":"Mon Jul 23 19:58:59 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolina added 13k jobs last month, and more than 100k in the last year for a low jobless rate of 4.2 percent. These numbers mean real money in the pockets of real North Carolinians. https://t.co/CgMHHZK0TF","date":"Mon Jul 23 17:09:32 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congrats to @SpecialOlympics on its 50th Anniversary this year! In 1968, six North Carolinians participated in the 1st @SpecialOlympics in Chicago. Now, there are 40,000 Special Olympians in NC alone. I wish everyone in this year's Games the best of luck, and go @SONC_BeAFan! https://t.co/PtYwrdziQD","date":"Fri Jul 20 16:38:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Next Wed. @ 9:30 ➡️ Senate Intel to hold open confirmation hearing for 2 key Intel positions: Dir. of National Counterterrorism Center and Asst. Sect of State for Intel &amp; Research: https://t.co/KVIxqApG3i","date":"Fri Jul 20 15:09:12 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Jobless claims are the lowest in nearly a half-century. And with unemployment rates at historic lows, too, the signs keep pointing toward the strongest economy in decades thanks to the #TaxCutsandJobsAct. https://t.co/efd5UCN2Vc","date":"Thu Jul 19 15:41:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Vladimir Putin is not our friend and never has been. Nor does he want to be our friend. His regime’s actions prove it. https://t.co/W95VPf9T8Y","date":"Mon Jul 16 19:04:35 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In most workplaces in America, failing to do your job means you lose your job. This bill ensures the IRS can hold high-level officials accountable in the same way, and it's long overdue. https://t.co/PSnFzD2c7R","date":"Fri Jul 13 17:02:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Civil rights crimes like Emmett Till’s brutal murder are exactly the reason @RepJohnLewis and I authored legislation to encourage @TheJusticeDept to reinvestigate these cold cases. Every American has a right to justice, none more so than Emmett Till. https://t.co/aCO48l47vv","date":"Thu Jul 12 16:08:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"As a co-chair of the International Conservation Caucus, I'm proud to support this effort to share U.S. conservation expertise with our partners in South Africa. The DELTA Act will facilitate information sharing to help local authorities better protect the Okavango River Delta.","date":"Wed Jul 11 20:46:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This unique watershed is home to some of the world's most endangered species and is continuously at risk from poachers and traffickers. Thanks to @SenRobPortman and @SenatorTomUdall for their leadership on the DELTA Act. You can find more info here: https://t.co/wlT4AzUH4U","date":"Wed Jul 11 20:46:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pardon me, I'm kin to Aaron Burr, sir. https://t.co/8f8bsJhhmr","date":"Wed Jul 11 19:40:36 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This is a great development for veterans suffering from cancer, allowing those who need it most to get cutting-edge treatment and care. I applaud the @DeptVetAffairs and @theNCI for working together on this important partnership. https://t.co/2vt0POWHwb","date":"Tue Jul 10 20:56:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In nominating Brett Kavanaugh to the Supreme Court, President Trump has put forth a highly qualified and respected candidate committed to the rule of law: https://t.co/zb07RLoBVn https://t.co/kHFiFQfKxV","date":"Tue Jul 10 01:36:18 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great news for American workers and families! 600k people reentered the workforce with 215k new jobs available. Wages are up by 2.7 percent, and we just finished a likely 2nd-straight Quarter of 4+ percent economic growth. https://t.co/1A3ZqRla4w #TaxCutsandJobsAct","date":"Fri Jul 06 15:45:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I want to wish everyone a Happy #4thofJuly and #IndependenceDay. Hopefully, everyone can spend time with friends and family today, and celebrate the freedom and liberty our Founding Fathers fought and died to declare 242 years ago. (And be careful with those fireworks!) https://t.co/zl9cHkSfJA","date":"Wed Jul 04 11:01:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you @SecretaryZinke for following through on @Interior commitments made many years ago. More than 70yrs after the govt agreed to compensate Swain Co. for flooded roads, it's finally making good on its promise. https://t.co/VG8f4ivsUi","date":"Tue Jul 03 18:23:34 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Small businesses have almost never been more optimistic or confident about their future thanks to the #TaxCutsandJobsAct. According to @NFIB, pay-raises and plans to expand businesses are at 45-year highs: https://t.co/kzM01408S7","date":"Thu Jun 28 19:07:51 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Six months after the #TaxCutsandJobsAct became law and our economy is booming! In Jan, @SenThomTillis &amp; I wrote that workers would see more $$ in their paychecks, easier tax filings &amp; a nearly doubled standard deduction: https://t.co/YFaHiWHgnS","date":"Thu Jun 28 17:37:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I want to thank Justice Kennedy for 43 years of service on the federal bench. The Senate will now do its job: https://t.co/rNWeunVNl4 https://t.co/GZDyU6o0ZJ","date":"Wed Jun 27 21:05:29 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"“The Senate Intelligence Committee took action Tuesday on its latest effort to bolster election security against threats from Russian and other adversaries, and also to improve the broken security clearance process.” https://t.co/A7y1DSHon2","date":"Wed Jun 27 17:32:42 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Roughly 1 in 10 Afghanistan war veterans, 1 in 5 Iraq war veterans, and nearly 1 in 3 Vietnam war veterans suffer from #PTSD. Know the signs, and let’s serve those who have served us. #PTSDAwarenessMonth https://t.co/w7Et10TnPs","date":"Wed Jun 27 15:57:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you or someone you know might be suffering from #PTSD, it’s never too late to get treatment. Learn more about the signs of #PTSD and your options here: https://t.co/n9EJFL44a4 #PTSDAwarenessMonth","date":"Wed Jun 27 15:04:14 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":".@GOPHELP just passed one of the country’s most important jobs training bills. 6mo after the #TaxCutsandJobsAct was signed into law, there are more jobs available than people to fill them. Programs like Perkins help train folks for the jobs they need: https://t.co/gL3m7IFTmN","date":"Tue Jun 26 23:33:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Security clearance reforms in the Intel Authorization Act will help deter internal threats while building an agile workforce. With more than 700K unresolved cases, the security clearance backlog must be addressed.","date":"Tue Jun 26 21:07:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"IAA also contains election security measures to protect our free and fair voting process from interference from foreign actors. Read more about Senate Intel’s election security efforts here: https://t.co/Ns0Ei0JU18","date":"Tue Jun 26 21:07:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, the Senate Intel Committee unanimously passed the 2019 Intel Authorization Act. This bipartisan bill provides the resources, personnel and Congressional oversight the IC needs to carry out its job. https://t.co/MCs9hE73Vl","date":"Tue Jun 26 21:07:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"We have a responsibility to preserve America’s beautiful landscapes so future generations can enjoy the same great outdoors we have today. Let’s work together to #SaveLWCF.","date":"Fri Jun 22 15:21:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Oh and by the way, did I mention the Land and Water Conservation Fund costs taxpayers nothing? Just in case I forgot to point that out. #SaveLWCF https://t.co/YaOqkPPIGe","date":"Fri Jun 22 15:21:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#LWCF is almost entirely funded by royalties from offshore drilling leases. That means revenue from one public resource is going to support thousands more natural resources across the country - and it costs taxpayers nothing. #SaveLWCF","date":"Fri Jun 22 15:21:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today marks 100 days until the Land and Water Conservation Fund expires. Let’s remind my colleagues here in Congress about the important work #LWCF does to preserve and maintain our beautiful public lands and parks! #SaveLWCF","date":"Fri Jun 22 15:21:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"#LWCF is one of our nation’s most successful conservation programs. By the numbers, #LWCF has… \n✔️ Operated for 52 years\n✔️ Completed more than 42,000 recreation projects \n✔️ Helped all 50 states\n✔️ Cost federal taxpayers $0","date":"Fri Jun 22 15:21:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Loved getting the chance to meet students from @CharlotteLatin in Washington to compete against teams from across the country in @eCYBERMISSION 2018. Good luck to Team ElectroHawks! #eCYBER18 https://t.co/WFqtGYH3PH","date":"Thu Jun 21 21:14:08 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Met some outstanding young folks from North Carolina today. Congratulations! https://t.co/G8dUzPyL62","date":"Thu Jun 21 15:41:07 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s open Senate Intel Hearing: https://t.co/MulPoiIUVX","date":"Wed Jun 20 15:05:38 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW - Senate Intel Hearing on policy response to Russian interference in the 2016 U.S. Elections. Live Streaming Here: https://t.co/82UzMCwzu3","date":"Wed Jun 20 15:05:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I just spoke on the importance of the Land and Water Conservation Fund, and in case I forgot to mention it, this program cost the American public a grand total of ZERO taxpayer dollars. #SaveLWCF https://t.co/fGKChO6Jov","date":"Wed Jun 20 13:49:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"NEW TIME - Senate Intelligence Committee hearing on policy response to Russian interference in U.S. elections will now start at 10:45am. Watch live here: https://t.co/82UzMCwzu3","date":"Wed Jun 20 13:04:14 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER -&gt; Tomorrow @ 9:30am, I’m joining a press conference with @SenatorCantwell, @SteveDaines, @SenatorTester, @SenBennetCO and @SenCoryGardner. We’re calling on Congress to #SaveLWCF: https://t.co/EyOKQAXFTx","date":"Tue Jun 19 21:42:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to introduce LTG Miller in his confirmation hearing to be the Commander for @NATO and U.S. forces in Afghanistan. Soldiers are taught to follow leaders, and Scott Miller is a tremendous leader. He is the right man at the right time to carry out our mission in Afghanistan. https://t.co/bdGCvxd2Q9","date":"Tue Jun 19 15:42:12 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Every June, we recognize #PTSDAwarenessMonth. Too many of our nation's veterans return home with invisible scars and battles they continue to fight. It's our job to continue raising awareness and assist when we can. Know the signs and learn how to help at https://t.co/ejtYdPBYiY.","date":"Mon Jun 18 19:37:35 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks to @USDOT and @FAAnews! This money will go towards much-needed improvements for North Carolina's infrastructure in the years to come. https://t.co/XvcuPNWkCh","date":"Thu Jun 14 21:15:23 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Some of the Army's best call @FtBraggNC home. Happy 243rd Birthday to the #USArmy! #ArmyBDay https://t.co/HiNyKz4YQd","date":"Thu Jun 14 20:31:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy #FlagDay, let 'em fly! 🇺🇸🇺🇸🇺🇸 https://t.co/wfNtDFA0Hn","date":"Thu Jun 14 19:39:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The economy continues to improve as jobless claims reach a 44-year low, and unemployment is down to an 18-year low. The #TaxCutsandJobsAct seems to be working out pretty well for most Americans. https://t.co/1YKp0x4iDR","date":"Thu Jun 14 18:50:30 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Kayla McKeon is an inspiring advocate for Americans with disabilities across the country. The ABLE to Work Act, which passed in last year’s #TaxCutsandJobsAct, allows more people like Kayla to work at a job they love and save for their future: https://t.co/dxFraKQjrw","date":"Tue Jun 12 19:49:03 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Sad to hear about Rosie, the 43-year-old western lowland gorilla at the @NCZoo, passing today. One of just eight gorillas in the @NCZoo, she will be missed by everyone there and everyone who came to visit. https://t.co/0fIV9KZPnk","date":"Mon Jun 11 20:18:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"So glad to see Lumberton native and 24-year Army veteran Troy Sutton reunited with his sweet pup, Ali. Wishing both of them the best on a well-deserved retirement! https://t.co/rsK90BCFJ0","date":"Thu Jun 07 17:58:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The $147M infrastructure grant announced yesterday will help bring U.S. 70 up to freeway standards, widen parts of I-95, and lay fiber optic cables to bring high-speed internet to Eastern NC. Via @FayObserver: https://t.co/PdAfPSQXFJ","date":"Wed Jun 06 20:08:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"269 North Carolinians now rest in peace at the American Cemetery in Normandy. They are joined by more than 9,000 fellow soldiers, sailors, airmen and coast guardsmen who gave the ultimate sacrifice for freedom. Today, we thank them and their families for their service. #DDay https://t.co/86o0tJkwr2","date":"Wed Jun 06 13:52:34 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today we honor the brave heroes who fought in #DDay 74 years ago. Those who sacrificed their lives that day were part of a generation of Americans who fought to preserve liberty and freedom across the globe in WWII. We will remain forever in their debt. https://t.co/YEDbUECEKr","date":"Wed Jun 06 13:52:33 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"6.7 million jobs available, a 3.8 percent unemployment rate, and an expected 3 percent economic growth rate are all signs that the #TaxCutsandJobsAct is delivering results for the American people. https://t.co/RCvzJPRYIX","date":"Tue Jun 05 21:20:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"On top of that, this will help lay 300 miles of broadband backbone in Eastern NC to provide internet service to rural areas in need. Thanks to @SecElaineChao and @USDOT for their hard work for the people of North Carolina.","date":"Tue Jun 05 19:16:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"New infrastructure improvements will better connect vital military bases - @FortBraggNC, Cherry Point @MCASCPPA, @Camp_Lejeune and Seymour Johnson AFB @SJAFB - with the rest of NC for reliable access.","date":"Tue Jun 05 19:16:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to have worked with @SenThomTillis to secure more than $147 million to update and widen North Carolina’s vital highway corridors. This will help decrease congestion, increase emergency preparedness and boost local economies:   https://t.co/d1viswYHTy","date":"Tue Jun 05 19:16:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, we remember all those who have sacrificed their lives to keep our country safe. America owes a lasting debt to the courageous men and women who have been willing to defend our freedoms at any cost. I join a grateful nation as we thank them and celebrate #MemorialDay. https://t.co/Lpd1YlFkuT","date":"Mon May 28 11:41:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations to the @WakeMTennis Demon Deacons on their 2018 @NCAATennis National Championship! #GoDeacs https://t.co/tFLoNO0xB9","date":"Wed May 23 13:42:30 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Vice Chairman @MarkWarner and I released the following statements regarding today's Senate Intelligence Committee closed hearing to complete its review of the Intelligence Community Assessment (ICA) on “Assessing Russian Activities and Intentions in Recent US Elections”: https://t.co/AK6vgim8Ly","date":"Wed May 16 16:01:09 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Vice Chairman @MarkWarner and I released the following statements following the Senate Intelligence Committee's favorable vote to report Acting @CIA Director Gina Haspel to the full Senate to be @CIA Director: https://t.co/u7Cm77WUq4","date":"Wed May 16 13:34:07 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s nomination hearing to consider William R. Evanina to be the Director of the National Counterintelligence and Security Center, Office of the Director of National Intelligence: https://t.co/wnDOU9jpdq","date":"Tue May 15 13:31:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intel Comm. holding an OPEN hearing to consider the nomination of William R. Evanina to be Dir. of the National Counterintelligence and Security Center, Office of the Dir. of National Intelligence. Opening stmts and streaming here: https://t.co/3YFP14OXbu","date":"Tue May 15 13:31:29 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: Senate Intelligence Committee will hold an OPEN hearing @ 9:30 A.M. to consider the nomination of William R. Evanina to be Dir. of the National Counterintelligence and Security Center, Office of the Dir. of National Intelligence. Watch live here: https://t.co/3YFP14OXbu","date":"Tue May 15 09:04:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, I join our nation in thanking military spouses across the country for the sacrifices they make to support the men and women of our armed forces. #MilitarySpouseAppreciationDay","date":"Fri May 11 21:17:44 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy belated birthday, Philip! North Carolina and the country thanks you for your service! https://t.co/LBkmlVHbHL","date":"Fri May 11 14:07:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today's Senate Intel Committee nomination hearing for @CIA Acting Director Haspel to be @CIA Director: https://t.co/wasXEa7dvP","date":"Wed May 09 13:38:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: The Senate Intelligence Committee's OPEN confirmation hearing for @CIA Acting Director Haspel to be @CIA Director has begun. Follow here for live streaming, opening remarks, and witness testimony: https://t.co/UG9QuawrA3","date":"Wed May 09 13:37:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: The Senate Intelligence Committee will hold an OPEN confirmation hearing for @CIA Acting Director Haspel to be @CIA Director this morning @ 9:30am. Additional information and live streaming can be found here: https://t.co/UG9QuawrA3","date":"Wed May 09 09:01:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senator @MarkWarner, @SenatorCollins, Senator @MartinHeinrich, @SenatorLankford, and I released the following statement on the summary of our findings and recommendations: https://t.co/RgcIGzPDri","date":"Tue May 08 23:23:44 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, the Senate Intelligence Committee released our unclassified summary of the 1st installment of our Russia Report, including updated recommendations on election security and findings regarding Russian targeting of election infrastructure-Find it here: https://t.co/6zFV2XAEnY","date":"Tue May 08 23:23:43 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m honored to be giving the commencement address this morning @UNCPembroke at 9:00am. You can follow along with the ceremony live here: https://t.co/Op51MGBD9h","date":"Sat May 05 11:00:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I hope everyone enjoyed a great #TakeOurDaughtersandSonstoWorkDay! It's experiences like seeing your Mom or Dad hard at work that can inspire a child for the rest of their lives. Thanks to the @TODASTW Foundation for all their hard work! https://t.co/XcnTkyWMlu","date":"Thu Apr 26 20:15:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on @CIA Director Mike Pompeo's confirmation to be Secretary of State: https://t.co/6fcXOLGSQd","date":"Thu Apr 26 18:38:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to introduce legislation that will protect the ability of individuals &amp; veterans with disabilities to travel with their trained service animals, help clearly define ‘service animal’, &amp; establish penalties for those falsely claiming disability needs. https://t.co/ew5jMys3FA","date":"Wed Apr 25 20:52:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":".@SenThomTillis and I wrote in the @fayobserver on the benefits of tax reform as we filed our taxes a last time under the old, outdated code. Nxt yr, the standard deduction and child tax credit will nearly double, so you keep more of your hard-earned cash. https://t.co/VzrEEMfcIR","date":"Tue Apr 24 20:38:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Director Pompeo is eminently qualified to be our nation's top diplomat. I hope my colleagues will join me in supporting him to continue to serve his country as he has in the U.S. Army, the House of Representatives, and the CIA: with honor and distinction. https://t.co/LMvr7XCeFv","date":"Mon Apr 23 19:26:42 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Land and Water Conservation Fund is a win for people, wildlife, and local economies across the country. Here’s why it needs to be reauthorized via the @Asheville Citizen-Times https://t.co/I54R72aT8I","date":"Mon Apr 23 16:10:13 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee will hold an OPEN confirmation hearing for the Deputy Director of the Central Intelligence Agency, Gina Haspel, to become the CIA Director on Wednesday, May 9, 2018, at 9:30 am.","date":"Thu Apr 19 13:15:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m deeply saddened to hear of Barbara Bush’s passing tonight. There was never any question as to who was the strength, wisdom and wit of the Bush family. She leaves behind a dutiful family and a grateful nation.","date":"Wed Apr 18 02:10:09 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #IndividualMandate was repealed, finally doing away with one of the worst parts of #ObamaCare that made people pay for insurance they didn't want or couldn't afford. #TaxCutsandJobsAct #TaxDay https://t.co/iY0Eu3mGxt","date":"Tue Apr 17 16:00:21 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"At the end of the day, many Americans will pay fewer taxes as a result of the #TaxCutsandJobsAct. You know how to spend your money better than bureaucrats in Washington. The new tax code reflects that. #TaxDay https://t.co/ASykgHs2Bj","date":"Tue Apr 17 16:00:21 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #TaxCutsandJobsAct also doubled the child tax credit, helping families across the country as they raise the next generation. #TaxDay https://t.co/YZ6Rz9lsJ7","date":"Tue Apr 17 16:00:20 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today on #TaxDay, this will be the last time you have fill out your taxes under the old, onerous system that was too complicated and took too much of your hard-earned money. #TaxCutsandJobsAct https://t.co/YxuqTpFpST","date":"Tue Apr 17 16:00:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #TaxCutsandJobsAct simplified the code for the vast majority of Americans who take the standard deduction by doubling it for individuals and families. #TaxDay https://t.co/J1o3o7mnee","date":"Tue Apr 17 16:00:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The President last night again sent a strong message to Assad that he can’t use chemical weapons with impunity, and that responsible nations will never let these barbaric acts go unpunished.","date":"Sat Apr 14 14:54:49 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to join @PattyMurray on legislation allowing military medics to transfer field experience toward grad degree credit to become Physician Assistants. Medics would be able to get their post-service cert. to become a PA in 1/4 the time under current law. https://t.co/hGfGEekrrL","date":"Fri Apr 13 15:32:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Honored to introduce @CIA Dir. Pompeo in his confirmation hearing to be Secretary of State. If there's ever one where you put politics aside, here it is. When we look for our future leaders, we look for the best, brightest, &amp; most committed. Mike Pompeo is that kind of leader. https://t.co/M4vpFY04VM","date":"Thu Apr 12 16:24:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My deepest condolences are with the family of First Lt. Phillips, as well as the families of the three other Marines who lost their lives in service to their country. (2/2) https://t.co/uYjSwmPLxd","date":"Fri Apr 06 14:45:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m terribly saddened to hear of the accident that took First Lt. Samuel D. Phillips’ life, along with three other brave Marines, this Tuesday. It’s always a tragedy to lose one of North Carolina’s native sons, especially when he was so young. (1/2) https://t.co/uYjSwmPLxd","date":"Fri Apr 06 14:45:36 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #WorldAutismAwarnessDay, I'm proud to have championed legislation like #AvontesLaw and the #ABLEtoWorkAct to make sure individuals with disabilities always have the same opportunities as everyone else to live their lives to the fullest. #LightItUpBlue","date":"Mon Apr 02 22:02:39 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Our democracy is under attack by foreign actors seeking to destablize our country. @SenatorLankford and @SenKamalaHarris' Secure Elections Act will bolster cybersecurity for 2018 elections &amp; has provisions to ensure threat info is promptly shared w/states. https://t.co/VNbOdKVZsp https://t.co/z49mHbbra0","date":"Thu Mar 22 18:36:47 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s Senate Intelligence Committee hearing on election security: https://t.co/AVCjc2Fn0E","date":"Wed Mar 21 13:35:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intelligence Comittee hearing on election security. Stream Live Here: https://t.co/LS0NSuKjGC","date":"Wed Mar 21 13:35:20 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today’s open Senate Intelligence Committee hearing on election security will still begin at 9:30am. Witness list and live streaming here: https://t.co/LS0NSuKjGC","date":"Wed Mar 21 12:01:13 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Watch live here: Senate Intelligence Committee’s press conference on election security starting soon https://t.co/INLO7w4dbL","date":"Tue Mar 20 16:10:19 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee has made available its initial recommendations on election security after investigating Russian attempts to target election infrastructure during the 2016 U.S. elections. More here: https://t.co/lc4qkK9iOe","date":"Tue Mar 20 15:50:16 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"More details here: https://t.co/TPa25zV6UN","date":"Mon Mar 19 20:02:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Tomorrow at 12:15pm, Sen. @MarkWarner and I will hold a press conference previewing the Committee's findings and recommendations on threats to election infrastructure. @SenatorCollins, Sen. @MartinHeinrich, @SenatorLankford, @SenKamalaHarris and members of Senate Intel to attend.","date":"Mon Mar 19 20:02:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intel Comm. will hold an open hearing on election security this Wed., Mar. 21st at 9:30am. Witnesses include @DHSgov Sec. Nielsen, Fmr. @DHSgov Sec. Johnson, and numerous representatives from federal and state election agencies. Details here: https://t.co/1FDoArJOjv","date":"Mon Mar 19 19:06:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck to @UNC_Basketball going up against @LipscombMBB! Joining 5 other North Carolina schools in #NCAAMarchMadness #GoHeels #CarolinaSZN https://t.co/9Ft9sVuEed","date":"Fri Mar 16 18:34:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck tonight to @DavidsonMBB going against @KentuckyMBB in the #NCAAMarchMadness They join 5 other schools representing North Carolina #GoWildcats #YouKnowWhichOnes #CatsAreWild https://t.co/wedXcjkXb9","date":"Thu Mar 15 22:58:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck today to @NCState against @SetonHallMBB! So Proud to see the @PackMensBball join 5 other North Carolina schools in the #NCAAMarchMadness #GoPackGo https://t.co/5YetTeW567","date":"Thu Mar 15 20:09:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck to @DukeMBB as they take on @IonaGaelsMBB today! They're one of 6 schools representing North Carolina in this year's #NCAAMarchMadness #GoDuke https://t.co/12YgQdukY4","date":"Thu Mar 15 18:36:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck to @UNCGBasketball today as they take on @ZagMBB! They're one of 6 North Carolina schools playing in #NCAAMarchMadness #GoSpartans https://t.co/2eFpT0dYYS","date":"Thu Mar 15 17:21:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"This reckless &amp; hostile act violates every int'l and diplomatic norm. The Kremlin may deny &amp; spread misinformation through its propaganda machine, but we know the truth. We must come together as a global community &amp; stand against Russia and the malicious actions of Putin's regime","date":"Thu Mar 15 17:10:34 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senator @MarkWarner and I stand with our British allies and the rest of the civilized world in denouncing the brazen and brutal chemical attack carried out against the UK. It has become clear that Russia is behind this effort to kill innocent civilians with a banned nerve agent.","date":"Thu Mar 15 17:10:33 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s open Senate Intelligence Committee confirmation hearing for Lt. Gen. Nakasone to be Director of @NSAGov: https://t.co/csRHhTJNl7","date":"Thu Mar 15 14:04:37 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intellignce Committee OPEN confirmation hearing for Lt. Gen. Nakasone to be Director of @NSAGov. Watch live here: https://t.co/TYsyvndavI","date":"Thu Mar 15 14:03:58 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: The Senate Intelligence Committee will hold an OPEN nomination hearing this morning at 10:00am for Lt. Gen. Nakasone to be Director of the National Security Agency. Live Streaming Here: https://t.co/TYsyvndavI","date":"Thu Mar 15 12:40:40 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck tonight to @NCCU! They're the 1st of 6 schools representing North Carolina in #NCAAMarchMadness #GoEagles https://t.co/NvBWIDwLpe","date":"Wed Mar 14 22:31:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, we celebrate #NationalK9VeteransDay and all of the brave dogs who have served their country. We are forever in debt to man's best friend.   https://t.co/tp5VcoWftm","date":"Tue Mar 13 18:59:05 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Gina Haspel has the right experience and judgement to lead one of our nation's most critical agencies. The Senate Intel Comm. will continue its positive relationship with CIA under her leadership, and I look forward to supporting her confirmation. https://t.co/Z1LDcvbwjY https://t.co/E52U9eORzY","date":"Tue Mar 13 15:45:25 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Next week, the Senate Intelligence Committee will hold an open hearing at 10am on Thursday, March 15 on the confirmation of Lieutenant General Paul Nakasone to be the National Security Agency Director. More details here:   https://t.co/PohfLsgE0Q","date":"Fri Mar 09 17:07:57 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"We've got to fix this for the sake of national security. 700,000 people waiting for security clearances for years is too much and too long. https://t.co/576lbKeEly","date":"Thu Mar 08 15:17:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s Senate Intelligence Committee hearing on security clearance reform: https://t.co/OopFu7AJ41","date":"Wed Mar 07 14:35:26 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW: Senate Intelligence Committee holding an open hearing on the security clearance process and reform. Witness opening statements and live streaming here: https://t.co/STJpjLFwLP","date":"Wed Mar 07 14:35:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: The Senate Intel Committee will hold an open hearing this morning at 9:30am regarding the security clearance process both in government and industry. Live Streaming here: https://t.co/4Cv3cFOyE1","date":"Wed Mar 07 10:03:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee will hold an open hearing on Wed., March 7th at 9:30am regarding the security clearance process for both government and industry. More details here: https://t.co/7YnMHMvu1r","date":"Mon Mar 05 16:46:22 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Rev. Billy Graham will lie in honor today in the U.S. Capitol Rotunda, a fitting tribute to this great man of faith who counseled a dozen presidents and brought God's grace to millions across the world. Follow along here to watch the ceremony: https://t.co/uSJqyuCiZ6","date":"Wed Feb 28 15:50:27 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations to the @TeamUSA Women's Hockey Team! Way to bring home the Gold! #GoTeamUSA #Gold https://t.co/FEpEH0QrQo","date":"Thu Feb 22 18:24:27 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My staff and I are getting our steps in for the American Council on Exercise’s Congressional Fitness Challenge! #ACECFC @acefitness https://t.co/s1YcGooNqs","date":"Sat Feb 17 19:14:31 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm speaking at a @BPC_Bipartisan event this morning on the importance of our nation's biodefense preparedness. As the original author of the main bioterror defense law, this issue is close to home. Looking forward to the discussion. https://t.co/PK2sXpLPgg","date":"Wed Feb 14 10:35:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement for today’s Senate Intelligence Committee hearing on World Wide Threats:\nhttps://t.co/J5v87vjFe4","date":"Tue Feb 13 14:41:16 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"HAPPENING NOW - Senate Intelligence Committee Hearing on World Wide Threats -  Witness Opening Statements and Live Streaming Here : https://t.co/3Au6BeoxDc","date":"Tue Feb 13 14:33:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: Senate Intelligence Committee hearing this morning at 9:30AM on World Wide Threats, including testimony from the Directors of CIA, FBI, NSA, DNI, DIA, and NGIA. Stream here live @CSPAN: https://t.co/ARG6lcdWzC","date":"Tue Feb 13 11:30:01 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"So proud to see these North Carolinians represent @TeamUSA! Heather Bergsma and Kimani Griffin are competing in speed skating, and Bobby Sanguinetti is suiting up for the men's hockey team. #PyeongChang2018 #GoTeamUSA https://t.co/cuMCIXCZfH","date":"Mon Feb 12 19:44:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: The Senate Intelligence Committee will hold an open hearing tomorrow morning at 9:30am on World Wide Threats facing the U.S. and our allies. The heads of CIA, NSA, FBI, DNI, DIA, and NGIA will testify. Follow here to stream live: https://t.co/3Au6Be6WLE","date":"Mon Feb 12 16:18:43 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The @NewsObserver admitted through clenched teeth that I am “measured”, “cautious” and “deliberate” but it’s clear that I cannot earn unanimous praise from the editorial boards of N.C.’s two major papers outside of changing my party affiliation to Democrat https://t.co/GwewAFe5Rp","date":"Mon Feb 12 14:29:54 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"On top of money provided for disaster relief, this bill includes money that will allow affected communities to rebuild &amp; begin projects to lessen the effects of future storms. @SenThomTillis &amp; I are committed to ensuring NC has the resources it needs. https://t.co/2F1LtQLsxO","date":"Thu Feb 08 18:45:20 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee will hold its annual World Wide Threats hearing Tues., Feb. 13 at 9:30am. @FBI Director Wray, @CIA Director Pompeo, @NSAGov Director Rogers, @ODNIgov Director Coats, @DefenseIntel Director Ashley, and @NGA_GEOINT Director Cardillo will testify.","date":"Wed Feb 07 20:01:50 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @WNCT9 - Senator Richard Burr leads the effort to reauthorize the Pandemic and All-Hazards Preparedness Act, a critical pandemic and bio-terror defense law: https://t.co/FaFzBUvU3x","date":"Tue Feb 06 22:32:07 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I couldn’t be happier to welcome my second granddaughter, Virginia Brooke, to the family. Mother and baby are healthy and happy. Grandpa over the moon. 🌙","date":"Sun Feb 04 17:11:52 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm leading the Senate's effort to renew a critical pandemic and bio-terror defense law. Read more here from @dcexaminer:\nhttps://t.co/qtDC3A0UEj","date":"Tue Jan 30 20:43:53 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"So proud to see @ncatsuaggies in the final 8 HBCUs representing North Carolina at the 16th Annual Honda Battle of the Bands! If you don’t want to miss it, you can watch here at 3pm #NCAT #HBOB https://t.co/ett9KVgzU0","date":"Sat Jan 27 19:33:54 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"After review, the Senate Intelligence Committee has posted Google, Facebook, and Twitter’s responses to Questions for the Record, available here: https://t.co/EW5kaugVa7","date":"Thu Jan 25 22:01:56 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm proud to support #SchoolChoiceWeek so parents and students can choose which school is best for them, and I look forward to working to expand these policies for North Carolina and the Country. @SchoolChoiceWk @GOPHelp","date":"Wed Jan 24 16:11:54 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"@GOPHELP @SenAlexander @SenatorIsakson @PattyMurray My opening remarks for today’s @GOPHELP hearing here: https://t.co/yS2pYWqDRq","date":"Tue Jan 23 15:08:43 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"REMINDER: I'll be chairing the 2nd @GOPHelp Committee hearing this morning at 10am examining our nation's preparedness and response capabilities to 21st century public health threats. Stream the hearing live here: https://t.co/ACv7qBAebL https://t.co/yQDERcRJFr","date":"Tue Jan 23 13:30:23 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"@SenThomTillis and I aren't the only ones noticing the benefits of #TaxReform, thousands of employees in North Carolina are too. \n\nOur Op-Ed via @theobserver: Tax Cuts Are Paying Off in N.C. Already https://t.co/YFaHiWHgnS","date":"Fri Jan 19 14:50:48 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Committee open hearing is starting, stream live here: https://t.co/NJhK0QU5Cq","date":"Wed Jan 17 16:30:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"@GOPHELP @CDCgov @US_FDA @HHSGov My prepared remarks for today’s @GOPHELP hearing: https://t.co/rtgk7SAyze","date":"Wed Jan 17 15:05:04 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m chairing a @GOPHELP Committee hearing on 21st century public health threats and our ability to respond. Follow here live with @CDCGov Dir. of Public Health Prep. &amp; Response, @US_FDA Administrator, and @HHSGov Asst. Sec. for Prep. &amp; Response: https://t.co/SsMCxKh9If","date":"Wed Jan 17 14:55:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Reminder: Senate Intel Committee will hold an open confirmation hearing today for the Intelligence Community Inspector General and DNI General Counsel nominees. Follow here for witness statements and live streaming starting at 11:30am: https://t.co/NJhK0QU5Cq","date":"Wed Jan 17 12:00:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m very pleased to see the Senate move forward on the consideration of FISA. As I said earlier: “Section 702 is the single most important national security tool we have in the United States.” https://t.co/Da2zIIfqem","date":"Wed Jan 17 00:14:11 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m speaking on the Senate floor this evening ahead of the Senate’s consideration of FISA, follow along here: https://t.co/DPX6xUwRW4","date":"Tue Jan 16 22:21:45 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'll be leading a @GOPHELP Committee hearing tomorrow morning at 10am to examine our nation’s preparedness and response to 21st Century public health threats. Follow here for more info and to stream live: https://t.co/SsMCxKyL6P","date":"Tue Jan 16 19:23:41 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, we honor Dr. Martin Luther King, Jr. for his tireless efforts in the Civil Rights Movement. I join the rest of the nation in expressing the deepest gratitude for his sacrifices. I know we have work yet to be done and the light of his leadership still shows the way. #MLKDay","date":"Mon Jan 15 15:00:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee will hold an open confirmation hearing for Michael Atkinson, Intel. Community Inspector General nominee, and Jason Klitenic, DNI General Counsel nominee, next Wed., Jan. 17th. Follow here for more info: https://t.co/NJhK0RbH10","date":"Fri Jan 12 19:08:32 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"In today's @WSJ, an Anti-Terror Victory in Congress. Looking forward to passing this critical intelligence tool in the Senate next week: https://t.co/mdoHTfmoTv","date":"Fri Jan 12 15:22:51 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am pleased by the House passage of legislation to reauthorize Sec. 702 of FISA. These authorities are critical to the Intel Community’s understanding of terrorists, cyber criminals, and foreign intel services. I look forward to Senate consideration of this important legislation","date":"Thu Jan 11 17:32:02 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great news folks - you can follow me on @Instagram with the same handle, @SenatorBurr. Follow along there for more photos and fewer socks. https://t.co/naoOKMn7iv …","date":"Wed Jan 10 23:02:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Officers put their lives on the line on a daily basis to protect our communities. I’m always deeply grateful for their service and their sacrifice. #LawEnforcementAppreciationDay https://t.co/94cbcVPz97","date":"Tue Jan 09 21:35:40 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"It's a new year, and in the @NFL playoffs, that means everyone is 0-0. The @Panthers take on the @Saints in the Wild Card today on the road to #SuperBowlLII, and I know they're ready to make a run. #KeepPounding #GoPanthers https://t.co/JywUKQ2eJH","date":"Sun Jan 07 21:32:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Glad to see @SecArmy sworn in yesterday to assume his duties as the 23rd Secretary of the Army. I look forward to working with him to maintain North Carolina’s strong and positive influence on our nation’s defense capabilities. https://t.co/wCLqN6pdRe","date":"Sat Jan 06 14:12:17 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"Stay safe tonight and tomorrow, North Carolina. You can get weather alerts and closure notifications here @FayObserver: https://t.co/qNlFGMgEsC","date":"Wed Jan 03 23:15:00 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"On Fusion GPS’ @NYTimes op-ed: Our investigation is not complete.  However, given that Fusion seems to have more to say, if Mr. Simpson and Mr. Fritsch would like to return to the Committee for an open hearing, we will certainly entertain such an event.","date":"Wed Jan 03 20:07:47 +0000 2018","user_id":"21157904"},{"handle":"SenatorBurr","text":"With @WakeForest taking on @TAMU in Charlotte, NC today, I think you know where my allegiances lie. #GoDeacs #BeattheAggies @BelkBowl  https://t.co/3zCK00EdhR https://t.co/Y3pgHwaSSo","date":"Fri Dec 29 17:30:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wishing a very Merry Christmas to everyone!","date":"Mon Dec 25 18:03:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Families across the country and at every income level will reap the benefits of #TaxReform. https://t.co/I47C7mJ4WL","date":"Sun Dec 24 20:17:23 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to have Kevin and Avonte's Law pass the Senate unanimously last night. This bill authorizes key programs to help families of patients with Autism and Alzheimer's reunite in tragic cases where they wander from their caregivers. My statement below: https://t.co/u2rXPrtn1W","date":"Fri Dec 22 16:37:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations to @UNCWBBCoach Sylvia Hatchell on her 1,000th win! She joins just 4 other @NCAA College Basketball Coaches in history to win 1,000 games. Thank you for your dedication to @UNC's student-athletes for more than 30 years. #Hatchell1k https://t.co/DOnqD0BLEg","date":"Wed Dec 20 18:58:33 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"From my hometown paper: Winston-Salem @JournalNow: Tax Bill Would Enhance Savings Options for Parents of Disabled Children https://t.co/1Tez95YU0h","date":"Wed Dec 20 13:56:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"So proud of Amy Wright's @bittyandbeaus Coffee Shop of Wilmington, NC - Amy is your 2017 @CNNHeroes of the Year! I've been there a number of times, and I'm thrilled for her and her family, congratulations! https://t.co/wR9cVpAMvR","date":"Mon Dec 18 14:44:04 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"During my talk last week in North Carolina, I also had the chance to speak about the importance of reauthorizing the Foreign Intelligence Surveillance Act (FISA), which \"is absolutely essential to fulfill our obligations\" of keeping America safe. https://t.co/09OnWzpEaF","date":"Fri Dec 15 15:28:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I sat down in North Carolina last week to talk about of number of issues, including the #TaxReform currently under consideration - \"We want people to invest in the future\" https://t.co/nvxcbUBLKG","date":"Thu Dec 14 19:58:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Very pleased to see #NDAA signed into law today. This bill gives our troops the pay increase they deserve and provides nearly $300 million in funding for North Carolina's military bases at Camp Lejeune, Cherry Point, and Seymour Johnson Air Force Base. https://t.co/uhZh3x3cma","date":"Tue Dec 12 21:46:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The alternative minimum tax is unfair and adds unnecessary complexity to our tax code.  It must be repealed to bring tax relief to the millions of Americans who need it. https://t.co/3UL1Os0dWx","date":"Fri Dec 08 18:52:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"76 years ago today the U.S. was attacked at #PearlHarbor, in what Pres. Roosevelt described as \"a date which will live in infamy.” Today, we remember those who sacrificed their lives defending our nation, and honor their memory by continuing to strive for American liberty. https://t.co/RgHDuqDFdp","date":"Thu Dec 07 17:07:58 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Glad to see @EPA taking seriously the issue of dangerous chemicals like GenX in an effort to ensure folks across the country have clean and safe drinking water. https://t.co/X5jToPW4bh","date":"Thu Dec 07 13:53:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This problem isn’t new, but I don’t think we’ve kept Russia focused as the threat. There was once a time where 70% of folks working in the intelligence community were educated in Russian, that's not the case today as you can well imagine. https://t.co/BhmP8kpbQx","date":"Wed Dec 06 21:58:55 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm speaking live now with @SangerNYT at the @CFR_org https://t.co/YDJltDpOis https://t.co/tmC2zYJTd1","date":"Wed Dec 06 17:51:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"I'm very encouraged to see Kirstjen Nielsen confirmed today to be the Secretary of @DHSgov... I look forward to working with her in the coming years to keep America and her citizens safe as we face an increasingly large and troubling range of threats.”\nhttps://t.co/NbxF5oyYS2 https://t.co/hFfmBFGBsS","date":"Tue Dec 05 22:18:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #TaxCutsandJobsAct doubles the standard deduction, doubles the child tax credit, and lowers rates across the board. The time for #TaxReform is now. https://t.co/NTcm84Bkqy","date":"Thu Nov 30 22:20:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"America will see real economic growth with the #TaxCutsandJobsAct. Nearly a million more jobs and close to 4% economic growth is not something we can afford to pass up. #TaxReform https://t.co/NVCmYnTOjG","date":"Thu Nov 30 22:10:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The numbers are cut and dry, lower- and middle-income individuals will play less federal taxes under the #TaxCutsandJobsAct. We have to give these families the relief they so desperately need. #TaxReform https://t.co/RQJmkKAygK","date":"Thu Nov 30 22:00:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Had a great talk with His Majesty King Abdullah II of Jordan and several other members of the Senate Intelligence Committee yesterday afternoon. https://t.co/0ToPBQVYm0","date":"Thu Nov 30 21:10:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Looks like someone decorated The Thing for my birthday. Maybe these decorations will help hold it together for another year. Plus, I sure do appreciate the snack. It might be a long one in the Capitol tonight. https://t.co/Tzqjfu2mPV","date":"Thu Nov 30 16:38:10 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"After 48 long days and overwhelming poll results, The Thing finally got some sunshine yesterday. She really enjoyed the fresh air. https://t.co/XzzqH5puDi","date":"Wed Nov 29 18:28:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I've introduced legislation, along with Senators @KamalaHarris, @AmyKlobuchar, and @RepSpeier, that would make sharing explicit content without the consent of those involved a federal crime. Enough is enough. \n\nhttps://t.co/2sZmMJwPoS","date":"Tue Nov 28 20:05:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #TaxCutsandJobsAct brings relief to all income levels - via @IBDeditorials: The Latest Tax Cut Lie: The Senate Bill Will Hurt The Poor https://t.co/xgyCmMzKK9","date":"Tue Nov 28 18:24:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @TheHill: Multiple State Treasurers Agree - Congress Should Pass Commonsense ABLE to Work Act to Empower Individuals with Disabilities https://t.co/qbfba5gnJP","date":"Tue Nov 28 17:04:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"@GOPSenFinance The average family of four will see a $2,200 per year tax cut, which represents a nearly 60 PERCENT reduction. These savings are vital to getting Americans back on their feet and getting the economy growing again. #TaxCutsandJobsAct #TaxReform https://t.co/tNjki9gMhl","date":"Mon Nov 27 21:16:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"@GOPSenFinance Individuals and families in literally every income bracket will receive relief under the #TaxCutsandJobsAct and by doubling the standard deduction, the zero tax bracket is expanded, reducing or eliminating federal income taxes for millions of Americans. #TaxReform https://t.co/mbezYpQMpA","date":"Mon Nov 27 21:07:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm excited to get back to work this week on the Senate's historic opportunity to reform our tax code. The #TaxCutsandJobsAct will bring relief to millions of middle-class Americans who deserve to keep more of their hard-earned dollars. #TaxReform @GOPSenFinance","date":"Mon Nov 27 20:57:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m thankful today for our country’s service members serving all across the world, away from their families, keeping America safe. We wouldn’t be able to celebrate today without their incredible sacrifices. Happy Thanksgiving to all! #HappyThanksgiving2017","date":"Thu Nov 23 14:48:09 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy 228th Birthday to the State of North Carolina! On November 21,1789, North Carolina ratified the Constitution and joined the Union. I, for one, am glad they did. https://t.co/ql2rln5wQi","date":"Tue Nov 21 19:29:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"So proud to see TEN North Carolina Universities make the list of @MilitaryTimes' 218 Best Colleges of 2018. Very thankful for all of the great universities throughout our State!\n\nhttps://t.co/lHghHi59fh","date":"Tue Nov 21 17:38:04 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"@SenatorBurr, @McCaskillOffice Aim to Close Health Care Law Loophole with Bipartisan Bill: \n\nhttps://t.co/45RcEhjgGt https://t.co/qsoD4UPtNQ","date":"Mon Nov 20 21:26:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm excited by @GOPSenFinance's progress last night by passing the #TaxCutsAndJobsAct. This bill is a historic opportunity to help Americans across the country save their hard-earned money. \n\nhttps://t.co/5RGW5OQQib https://t.co/XlVEDepviK","date":"Fri Nov 17 18:44:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @WashTimes: GOP Senators: Dems Can Help Us Make Individual Tax Cuts Permanent\nhttps://t.co/1B4frw1k3M","date":"Wed Nov 15 19:37:10 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"A great sign to see @NFIB endorsing the Senate's modified tax legislation:\nhttps://t.co/Ht1s5PBQBt https://t.co/O3NWB5ZxVJ","date":"Wed Nov 15 19:35:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"It’s been a few weeks since I’ve driven The Thing. Should I take her for a spin today?","date":"Wed Nov 15 13:38:55 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolinians are the winners with the Senate's #TaxReform legislation. The numbers are cut and dry. @GOPSenFinance #TaxCutsAndJobsAct https://t.co/Qr5PBxPZJB","date":"Tue Nov 14 16:27:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @TheHill: Analysis: All Income Groups Would See Tax Cuts Under Senate Bill\nhttps://t.co/DDk06xc9cd","date":"Mon Nov 13 17:46:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @Politico: Middle Class Biggest Winners in Senate Tax Plan, Study Says\nhttps://t.co/eUN4tZ1WpM","date":"Mon Nov 13 17:26:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"According to the @TaxFoundation, North Carolina adds more than 27,000 jobs and the average middle-income family saves roughly $2,300. #TaxReform\nhttps://t.co/mmGEkIkUKB","date":"Mon Nov 13 17:05:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This Veterans Day, we pause to thank the approximately 20 million men and women who have served in our armed forces, from every corner of America and every service branch. Today, I join a grateful nation when I say \"thank you\" to our veterans and their families. https://t.co/0daSPworf4","date":"Sat Nov 11 15:00:04 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy 242nd Birthday to the U.S. Marine Corps! Thank you to all the Marines who have served. I couldn't be prouder of this Marine, our Defense Fellow who has been with us this year. After 24 years, Jason has been selected as a Master Gunnery Sergeant. Congratulations! #SemperFi https://t.co/ZJrjvnAesY","date":"Fri Nov 10 14:00:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I was a day ahead, but I was ready for #NationalScrappleDay with this tie: https://t.co/lMowwrAXdl","date":"Thu Nov 09 17:30:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"#TBT to the Halloween Dog Costume Contest. I don't care what anyone says, #TeamBurr pups Daenerys and John Snow were the winners in my book. https://t.co/MCPQ9k8utv","date":"Thu Nov 09 15:33:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @NSJNews: Ground broken for veterans life center in Butner - Senator Richard Burr: “Global War on Terror veterans have seen the worst of humanity. Initiatives like this ... create as many new opportunities for them as we could ever imagine.” https://t.co/3OzdVgM7Ne","date":"Wed Nov 08 15:37:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Senate Dems should be ashamed. Let's move the President's nominees so our government can fully function.\" (3/3)","date":"Tue Nov 07 20:52:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Since position was created, Senate has approved it by voice vote...longer Def. Dept. waits for full staff, more our military suffers..(2/3)","date":"Tue Nov 07 20:51:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Senate Dems, still reeling from their 2016 loss, are forcing roll call votes on qualified nominees like Gibson...(1/3)","date":"Tue Nov 07 20:50:19 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement after today's first-ever roll call vote for the Dep. Chief Mgmt. Off. of Dept. of Def., John Gibson: https://t.co/6K8viTHzxZ)","date":"Tue Nov 07 20:49:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"One of North Carolina's own has been nominated as one of the Top 10 @CNNHeroes of 2017! Couldn't be prouder of them! https://t.co/DOvM15bz9B","date":"Tue Nov 07 14:00:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Praying for those affected in today’s unspeakable tragedy at the First Baptist Church in Sutherland Springs, TX.","date":"Sun Nov 05 21:42:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"So glad to have some young folks from New Bern, NC stop by yesterday! https://t.co/PD1aAHqtdD","date":"Fri Nov 03 18:10:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Honored to have Axel meet with my staff yesterday. A very good boy indeed, he's retired from @ATFHQ after completing 200+ high-risk missions https://t.co/wTZepQAXdO","date":"Fri Nov 03 14:34:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Here are the images I presented in the Senate Intel hearing:\nhttps://t.co/xvrjrEFL5o https://t.co/zYkBnz6881","date":"Wed Nov 01 14:15:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Social media platforms' actions need to catch up with their responsibilities.\"","date":"Wed Nov 01 13:48:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Even more troubling is the likelihood these pltfms are still being used today to spread lies, provoke conflict, &amp; drive Americans apart...\"","date":"Wed Nov 01 13:48:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"More galling, they used American-made social media pltfms invented in connection w/1st Amdmt. freedoms that define a democratic society...","date":"Wed Nov 01 13:47:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"\"Agents of a hostile foreign power reached into the US w/our social media pltfms, conducted an Info Op. intended to divide our society...","date":"Wed Nov 01 13:47:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement from today's Senate Intelligence Committee hearing: https://t.co/lk5DB5mCFt","date":"Wed Nov 01 13:45:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Follow here for Senate Intel's hearing with social media companies starting soon: https://t.co/EW5kaugVa7","date":"Wed Nov 01 13:30:16 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m praying for the victims in today’s tragic event in Manhattan.","date":"Tue Oct 31 21:28:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Tmrw @ 9:30am, @MarkWarner and I will lead Senate Intel in open session with social media companies. Follow here: https://t.co/EW5kaugVa7 https://t.co/AXa8xGCGgQ","date":"Tue Oct 31 19:48:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel confirmation hearing for Mr. Demers to be Dept. of Justice Asst. Att. Gen., Natl. Sec. Div. Watch here: https://t.co/xXHgbJfbvx","date":"Tue Oct 31 13:37:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel confirmation hearing tmrw - John Demers to be Justice Dept's Asst. Att. Gen., Natl Sec Div. More here: https://t.co/g11Y7XukBl","date":"Mon Oct 30 20:42:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to work with @SenAngusKing on this important legislation. https://t.co/y2PO7QEpDB","date":"Fri Oct 27 15:46:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Advisory: Senate Intel to Hold Confirmation Hearing for Justice Dept’s Asst. Attorney General, National Security Division, on Tues, Oct. 31. https://t.co/ObOxxu6gFY","date":"Fri Oct 27 14:04:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @CBSNews: Senate Intel to hear from Facebook, Twitter and Google on election interference\nhttps://t.co/od00KB5vKV","date":"Wed Oct 25 19:52:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel to hold open hearing with social media companies next week. More info below: https://t.co/Vst7jcBUAX","date":"Wed Oct 25 18:57:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"How can it return if mine never went away? #ThinkAboutIt\nhttps://t.co/Qu4wNgqpxT","date":"Wed Oct 25 17:34:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Encouraged to see @USTreasury taking action against ISIS and Al-Qaeda: https://t.co/tzUWowoL6a","date":"Wed Oct 25 16:18:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The FISA Amendments Reauthorization Act passed the Senate Intel Committee this afternoon. More here: https://t.co/NDcaGEQKF6","date":"Tue Oct 24 21:27:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great meeting advocate Charlotte Woodward yesterday. These are the folks who inspire me every day. @NDSS https://t.co/qVi27poZw9","date":"Tue Oct 24 15:49:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I've heard the same thing in North Carolina. Excited to get to work in the @GOPSenFinance Committee on #TaxReform. https://t.co/7PWYL07Qsm","date":"Mon Oct 23 19:34:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you're in the Charlotte area, get your severe weather updates here and stay safe this evening:\nhttps://t.co/Oo7csJ5Uc8","date":"Mon Oct 23 18:24:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"For the folks who can't make it to Washington for a visit, sign up for my weekly updates here: https://t.co/4x2EaP4IID https://t.co/tWIK5RiC6Z","date":"Sat Oct 21 15:05:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"In this week's newsletter, I talk about the Senate's progress on reforming our broken tax code. Read more here: https://t.co/I6nPqijeje https://t.co/vyC5x2cHdF","date":"Sat Oct 21 15:00:04 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to continue fighting for the Land and Water Conservation Fund! #LWCF https://t.co/ZjzWWij4Gt","date":"Fri Oct 20 18:45:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intelligence Committee has postponed the open hearing with Michael Cohen. Our statement here: https://t.co/MT682noSWt","date":"Fri Oct 20 16:07:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on last night's vote to get tax reform started:\n\nhttps://t.co/jYztV1g2yb","date":"Fri Oct 20 16:01:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"@frankthorp You’ve got some egg on your face, Fake News Frank. Here I am with socks! https://t.co/bPqD3Xu3ZI","date":"Thu Oct 19 18:48:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pleased to see Tom Farr approved by the @SenJudiciary Committee, and I'm looking forward to his confirmation by the full Senate.","date":"Thu Oct 19 15:55:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Watch our Senate Intelligence Committee hearing for CIA Inspector General nominee Chris Sharpley on @cspan: https://t.co/CJwR9sGRcq","date":"Tue Oct 17 18:39:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel hearing tomorrow for @CIA Inspector General nominee Christopher Sharpley. Follow along here: https://t.co/O1Vq6kdH7K https://t.co/dqKlQ4KmjO","date":"Mon Oct 16 20:18:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Looking forward to getting to work on this when I return to Washington next week. https://t.co/32HdwTmYxL","date":"Fri Oct 13 18:36:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great visit w/@FoodBankerEC in Elizabeth City, NC yesterday. Thank you to Liz Reasoner, the Food Bank of Albemarle Director, and her staff! https://t.co/um0eWP785v","date":"Fri Oct 13 16:17:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Big game tonight for the @Panthers vs. @Eagles. Let's make it 5-1! #KeepPounding  \n\nhttps://t.co/dKEkeY2nSr","date":"Fri Oct 13 00:15:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Advisory: Senate Intel to Hold Confirmation Hearing Next Week for CIA Inspector General Nominee Christopher Sharpley https://t.co/yknjPHC2mf https://t.co/7gPuaIVvyd","date":"Thu Oct 12 20:32:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Kirstjen Nielsen is an excellent choice to lead @DHSgov. She is well-suited to tackle the complex threats our country faces on a daily basis","date":"Thu Oct 12 14:41:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"... the @UNC Coastal Studies Institute, and the North Banks @Rotary Club. Great seeing everyone, hope to be back soon! (2/2) https://t.co/KSSMwmLEJ0","date":"Wed Oct 11 17:26:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Busy day in North Carolina yesterday! I stopped by @DareCountyEM, the Alligator River National Wildlife Refuge Center... (1/2) https://t.co/0BfAqqBNkB","date":"Wed Oct 11 17:25:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Spring Internship app deadline is November 17th. Get your apps in for a great semester in Washington! Info here:\nhttps://t.co/0RqGPngNev https://t.co/84z3fuwKYm","date":"Wed Oct 11 17:12:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pleased to see Bobby Higdon sworn in today. I know he'll serve the people of North Carolina's Eastern District well. https://t.co/VBmwUU0PLQ","date":"Tue Oct 10 19:41:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m terribly saddened by the loss of three of @FortBraggNC’s finest. I am praying for their families and fellow service members.","date":"Fri Oct 06 20:42:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Advocating for the Land And Water Conservation Fund outside the Capitol this morning. #SaveLWCF https://t.co/n9msP5cqxK","date":"Thu Oct 05 13:51:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"An update on the Senate Intelligence Committee’s investigation into Russian interference in the 2016 elections: https://t.co/iG1ompQJRw","date":"Wed Oct 04 16:31:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Watch Senate Intelligence Committee's Press Conference today at 12:15pm on @CSPAN here: https://t.co/zahXirnzJO","date":"Wed Oct 04 15:42:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"ICYMI: @MarkWarner and I will brief on the status of Senate Intel Committee's Russia inquiry tomorrow at 12:15pm. https://t.co/YFoieUiUHS https://t.co/rkIfiPDB1w","date":"Tue Oct 03 20:38:16 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the tragic events in Las Vegas: https://t.co/50RaBFTzp5","date":"Mon Oct 02 19:51:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Advisory - Senate Intel Leaders to Hold Press Conference Next Week: https://t.co/NClVrsw9i2","date":"Fri Sep 29 15:23:49 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Some of our bravest men and women are still fighting invisible battles. If you know veterans who need help, #BeThere https://t.co/9TAXv8lBCi","date":"Thu Sep 28 19:42:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"So glad to have you back, Rep. @SteveScalise. Your unbelievable spirit was missed, looking forward to working with you again.","date":"Thu Sep 28 15:18:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the tax reform framework released today: https://t.co/3Zqy36Vz7l","date":"Wed Sep 27 21:19:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was great having students from Gospel Light Christian School in Winston-Salem, NC at the office today. Come back any time! https://t.co/m3FfgPz8Vr","date":"Tue Sep 26 20:55:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see @SecretaryZinke's commitment to this program, with $2.3 million going to North Carolina. https://t.co/e9a2doTj33","date":"Mon Sep 25 19:15:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"North Carolina - please stay safe and listen to your local authorities. Follow @NCEmergency Management here: https://t.co/1vqxNs5Lst","date":"Mon Sep 25 15:56:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Praying for Puerto Rico and those affected by #HurricaneMaria. Fellow North Carolinians – follow here for updates: https://t.co/jJdfz8MOeM","date":"Wed Sep 20 22:30:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Read my Op-Ed in the Wilmington @StarNewsOnline on vital FDA reforms here: https://t.co/c3V7njkJMt","date":"Wed Sep 20 20:32:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, I introduced Thomas Farr to be the U.S. District Judge for the Eastern District of North Carolina in the @SenJudiciary Committee: https://t.co/gykQhd4ydN","date":"Wed Sep 20 15:21:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My and @MarkWarner's statement on postponing today's interview with Michael Cohen: https://t.co/nq6q9ofruG https://t.co/dlMQETBAPi","date":"Tue Sep 19 16:14:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy 70th Birthday to the @USAirForce. Proud to have Seymour Johnson Air Force Base call North Carolina home. @SJAFB #AFBday https://t.co/rM6GjLPvnQ","date":"Mon Sep 18 21:12:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @FoxNews - Senators to Tillerson: Expel Cuban diplomats, consider US embassy closure over attacks https://t.co/36GPPGPtRh","date":"Fri Sep 15 20:34:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Raleigh, Greensboro &amp; Charlotte submitted plans in 2016 to become leaders in civil tech. They deserve another shot. https://t.co/KnlY9MWTgw https://t.co/1KMjnOTpnv","date":"Fri Sep 15 18:11:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the tragedy at Fort Bragg yesterday: https://t.co/Hyx6H46j9Z","date":"Fri Sep 15 16:00:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Praying for the U.S. Army Special Operations Command soldiers injured today @FtBraggNC. Will follow closely: \nhttps://t.co/u9mDZicoyz","date":"Thu Sep 14 18:01:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I recently reintroduced the Boost Saving for College Act w/ @SenBobCasey &amp; @lisamurkowski. More here from @MyFox8: https://t.co/roR39L5S07 https://t.co/dBWKsj7zR5","date":"Thu Sep 14 15:07:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"to continue to advocate on behalf of all of our nation’s military assets in North Carolina.” 9/9 https://t.co/FY8h2wd7KT","date":"Wed Sep 13 21:38:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I appreciate all of the hard work by Secretary Wilson and the citizens of Goldsboro, and I am honored to have the opportunity... 8/9 https://t.co/28iUrSokPV","date":"Wed Sep 13 21:38:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"as the capable Airmen of Seymour Johnson are celebrating the 75th anniversary of the 4th Fighter wing this September... 7/9 https://t.co/hBYr5wY2lQ","date":"Wed Sep 13 21:37:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"for the maintenance and operation of the KC-46As. This final decision could not be more timely... 6/9 https://t.co/tfB13jb3Gb","date":"Wed Sep 13 21:37:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"our Senate colleagues, committees of jurisdiction, and the citizens of Goldsboro to advocate for the necessary funding required... 5/9 https://t.co/VVxjV4lqGc","date":"Wed Sep 13 21:37:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"a prolonged amount of time in the air for use in either logistical or combat operations. For years, I have worked with Senator Tillis... 4/9 https://t.co/EKJxmrdWG1","date":"Wed Sep 13 21:36:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"a prolonged amount of time in the air for use in either logistical or combat operations. For years, I have worked with Senator Tillis... 4/9 https://t.co/EKJxmrdWG1","date":"Wed Sep 13 21:36:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The 12 new KC-46A aircraft will serve as a vital tool for our military, providing fixed-wing aircraft w/ mid-air refueling capabilities..3/9 https://t.co/DB4ZhrsRVN","date":"Wed Sep 13 21:35:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Yesterday, I was notified by the Air Force Secretary of the decision to base KC-46A Pegasus Air Refueling Sqd. @ Seymour Johnson AFB... 2/9 https://t.co/ryVyzUKrYD","date":"Wed Sep 13 21:35:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My Statement on the Stationing of New Tankers at Seymour Johnson Air Force Base (1/9) https://t.co/y7SKIoZpAT","date":"Wed Sep 13 21:35:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @WashTimes: Senators Demand Congress Stop IRS from Hiring Tax Cheats https://t.co/QwcpuAlMsO","date":"Tue Sep 12 14:19:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"As #Irma heads north, keep this in mind: https://t.co/FdkfQa2ciu","date":"Mon Sep 11 20:29:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good resource for NC residents: https://t.co/drpLnJKjPq","date":"Mon Sep 11 20:27:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @BV: Our bill increases the credit's value from 35% to 50% of total child-care expenses for the lowest earners. https://t.co/cBDfARNEZp https://t.co/LhtdCQ8BVz","date":"Mon Sep 11 19:07:16 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @BV Bloomberg View: Congress Should Give Families More Credit https://t.co/cBDfARNEZp https://t.co/DYsbBwsKQs","date":"Mon Sep 11 19:06:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Bloomberg Editorial Board endorses my bill w/ @SenAngusKing to expand the Childcare Tax Credit program https://t.co/cBDfARNEZp","date":"Mon Sep 11 19:05:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My advice for North Carolinians facing Hurricane Irma - listen to the authorities, have a plan, and stay safe. Follow more here @NCEmergency https://t.co/dHebHI28Lp","date":"Sat Sep 09 20:16:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I intro'd Leanna George from Benson, NC @GOPSenFinance hearing on Children's Health Insurance Program. Full Hearing: https://t.co/pNkCmVlBdx https://t.co/E5QJcuAI4V","date":"Thu Sep 07 17:52:28 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"In @GOPHELP hearing, experts agreed, states-not Fed gvt-need more control over healthcare markets to deliver better services to individuals. https://t.co/TGDhwXNmhp","date":"Wed Sep 06 20:18:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm asking questions next at the @GOPHELP Hearing on stabilizing premiums and health insurance markets. Watch here: https://t.co/EaYLtmeCbW","date":"Wed Sep 06 15:45:40 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Follow along with updates on #HurricanIrma here and stay safe!\nhttps://t.co/f1bbGN7SlN","date":"Tue Sep 05 23:00:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see more North Carolinians joining the effort to help Texas search and rescue operations. Godspeed. https://t.co/5d3KMZXsi6","date":"Thu Aug 31 23:00:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proposals and finally bringing relief to the millions of Americans who desperately need it.\" 6/6 https://t.co/p47Xao5kfh","date":"Wed Aug 30 20:33:58 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Be the envy of the world when it comes to opportunity. I look forward to getting to work in the Finance Committee on the President’s 5/6 https://t.co/O8hXD7KPQk","date":"Wed Aug 30 20:33:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Everyone, and allowing individuals to save money and time filing their taxes. These commonsense solutions will allow our nation to again 4/6 https://t.co/X5c6d1Q0y3","date":"Wed Aug 30 20:33:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Out of the pockets of hard-working families. I have advocated for years in Congress for simplifying our tax code, lowering rates for... 3/6 https://t.co/Xu9N9zmUmd","date":"Wed Aug 30 20:33:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Americans have suffered for far too long under an increasingly complicated and burdensome system that suppresses growth and takes money 2/6 https://t.co/4JIzE8GV00","date":"Wed Aug 30 20:33:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Americans have suffered for far too long under an increasingly complicated and burdensome system that suppresses growth and takes money 2/6 https://t.co/4JIzE8GV00","date":"Wed Aug 30 20:33:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on President's remarks on tax reform: \"I’m pleased by the President’s first steps forward in reforming our broken tax code..1/6","date":"Wed Aug 30 20:32:40 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy birthday to my good friend and fellow North Carolina Senator, @SenThomTillis. It's a pleasure to work with my friend Skippy every day. https://t.co/lJhKoMSFF3","date":"Wed Aug 30 17:43:21 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see the brave men &amp; women of NC's @Camp_Lejeune ready to help those in need suffering from Hurricane Harvey https://t.co/eJW5YTWwq6","date":"Wed Aug 30 16:16:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great speaking w/the Charlotte Economics Club recently, always appreciate the opportunity to speak to North Carolinians on important issues. https://t.co/VRNnGC7RxW","date":"Tue Aug 29 20:30:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m thankful to have joined w/ so many others in working to enact this law as a part of Emmett Till's legacy (4/4) https://t.co/obAf6CP47q https://t.co/sdVTWPFLKL","date":"Mon Aug 28 20:37:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Last year, Obama signed into law a bill that will uncover the truth about murders committed against African Americans (3/4) https://t.co/hMcsOAZpyz","date":"Mon Aug 28 20:36:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Emmett was not the only one killed during the Civil Rights era whose killers were never found. (2/4) https://t.co/1QSF7B9EkU","date":"Mon Aug 28 20:35:28 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"62 yrs ago today, Emmett Till was the victim of a brutal racist act. I am thinking of him today and reflecting on the loss of his life (1/4) https://t.co/DP8gDl8QJ3","date":"Mon Aug 28 20:34:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"It's a rematch for the U.S. @LittleLeague Championship. TX vs. NC - Winner takes on the world. Go Greenville! #LLWS https://t.co/HnBsYniI0l","date":"Sat Aug 26 19:15:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Keeping Texas in my prayers today for everyone in the path of #HurricaneHarvey - Please listen to local authorities and stay safe.","date":"Fri Aug 25 20:30:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to have these brave warriors call Fort Bragg and North Carolina home. https://t.co/yfvTcPMHsc","date":"Fri Aug 25 18:42:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was great stopping by West Jefferson recently to tour an aerospace manufacturing plant. Thanks for having me! https://t.co/usPAnWkFht","date":"Thu Aug 24 23:00:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck tonight to the NC @LittleLeague World Series team against the SW Texans. Go Greenville! #LLWS2017 https://t.co/HnBsYnAjoV","date":"Wed Aug 23 23:20:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"SE Region NC @LittleLeague World Series team is 1st in US #LLWS history w/consecutive no-hitters! Keep it up on Wed! https://t.co/FcAfpcAmk7","date":"Mon Aug 21 22:30:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Hope everyone enjoys the #SolarEclipse2017 Follow along with the @NASA broadcast here and stay safe! https://t.co/4IdCs11omW","date":"Mon Aug 21 16:16:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see a NC team represent the SE Region in the 2017 @LittleLeague World Series. Good luck tonight! #LLWS https://t.co/bf89sW50e2","date":"Fri Aug 18 23:30:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the terror attacks in Spain: https://t.co/mR78ehI6xW","date":"Fri Aug 18 17:05:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Spoke w/ NC Gang Investigators Association @InfoNCGIA in Winston-Salem yesterday. Thankful for their work to protect our communities. #NCGIA https://t.co/SF0Ofh03BI","date":"Thu Aug 17 20:29:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"ICYMI: Talked to @WXII yesterday about my committee’s Russia investigation timeline https://t.co/ANN3zPTEsV","date":"Tue Aug 15 20:35:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"ICYMI: Talked to @WXII yesterday about tragic events in Charlottesville https://t.co/dS3xS7tYpQ","date":"Tue Aug 15 20:34:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"ICYMI: Talked to @WXII about awarding Bronze Star, Purple Heart to Sergeant Ronnie Whitlow https://t.co/XHAxLATbDu","date":"Tue Aug 15 20:33:13 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I spoke about developments in North Korea recently with the @JournalPatriot. More here: https://t.co/YiJPOfX5Gx https://t.co/73wlF9uvAr","date":"Tue Aug 15 19:27:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Honored to finally present Sgt. Whitlow the medals he earned in Vietnam. Joining him are family and fellow members of the Yanceyville VFW. https://t.co/CocBQ3ymol","date":"Mon Aug 14 20:39:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on Saturday's events in Charlottesville, Virginia: https://t.co/lyjrkiJkwr","date":"Mon Aug 14 20:01:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Spoke with one of my local North Carolina stations about #NorthKorea https://t.co/GQHL91RLyP","date":"Thu Aug 10 19:59:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Talked about #NorthKorea with one of my local North Carolina stations: https://t.co/EmujxYcjxH","date":"Thu Aug 10 19:57:49 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Excited to see the @Panthers start their march back to the Super Bowl tonight! #PanthersNation #KeepPounding https://t.co/2LRZXaE94t","date":"Wed Aug 09 23:20:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Great tour of an important manufacturing facility in North Wilkesboro. Good to see NC manufacturing continuing to thrive. https://t.co/G2Bn3K7Yp6","date":"Wed Aug 09 20:50:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pleased to see U.N. Sec. Council firmly sanction North Korea. They cannot continue to threaten with impunity. https://t.co/pSruLrNoYb","date":"Tue Aug 08 20:40:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Excited to see 10 NC institutions named to Princeton Review’s Best 382 Colleges: 2018 Edition. Keep up the good work!https://t.co/dCRQ32Q7xH","date":"Fri Aug 04 20:18:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Honored to see my former staff members continuing their service to the country by serving our nation’s veterans https://t.co/kQA2wEaa0m","date":"Thu Aug 03 20:01:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @salisburypost: Federal Inspection Finds Many Areas for Improvement at Salisbury VA https://t.co/49cqDehWKc","date":"Thu Aug 03 16:06:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"via @WBTV_News: New Report Finds More Problems at Salisbury VA Medical Center https://t.co/kDCvoHqXsM","date":"Thu Aug 03 16:05:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The start of football in North Carolina has me nostalgic for the early morning smell of fresh grass in August #letsplay https://t.co/ApWG2eus7g","date":"Tue Aug 01 20:01:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @Forbes - Watchdog Report: IRS Continues To Rehire Problem Employees https://t.co/sUY10D5cj0","date":"Tue Aug 01 14:33:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @DailyCaller: IRS Continues To Hire Employees With Performance Problems https://t.co/TOKJ3gMam6","date":"Fri Jul 28 20:06:33 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @dcexaminer: Richard Burr Proposes Bill to Stop IRS from Rehiring Fired Workers https://t.co/jAh7CKuWEO","date":"Fri Jul 28 18:40:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Via @dcexaminer Inspector General: IRS is Still Hiring Employees it Fired for Misconduct https://t.co/7KU4gL2iMG","date":"Thu Jul 27 20:58:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The American people learned today, despite denials to Congress, IRS continues a wholly unacceptable practice of rehiring known bad actors. https://t.co/c8aDOSEdgm","date":"Thu Jul 27 14:59:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This is precisely why Americans don’t trust DC with their taxpayer $$. Koskinen cannot leave fast enough for me. https://t.co/x1jwaVhQrZ","date":"Thu Jul 27 14:34:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"#TBT Koskinen told me in 2016 “We do not hire people with prior performance issues.” https://t.co/CttAGQM53S Today’s report shows otherwise.","date":"Thu Jul 27 14:29:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"If you got fired for doing these things, would your employer hire you again? The IRS would! https://t.co/x1jwaVhQrZ https://t.co/3lnwTvjaML","date":"Thu Jul 27 14:25:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today - IRS watchdog found new examples of IRS rehiring employees previously fired for dodging taxes, lying, more  https://t.co/x1jwaVhQrZ","date":"Thu Jul 27 14:23:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Always a pleasure to meet with North Carolinians while they’re in Washington - Thank you for stopping by the office! https://t.co/2AddSxnlpl","date":"Wed Jul 26 20:21:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Glad to proceed to fixing our nation’s failing healthcare system. Look forward to amdmt process, all Senators will have their say. https://t.co/d1UXHonGIH","date":"Tue Jul 25 20:29:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pleased to move Susan Gordon, as Deputy @ODNIgov, through the cmte hearing last week. Let's keep getting intel officials through the Senate. https://t.co/cVTJSMj3aK","date":"Mon Jul 24 21:17:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm praying for my very good friend but let's remember: no one is tougher than @SenJohnMcCain https://t.co/hEJMJ6ls51","date":"Thu Jul 20 16:12:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Written testimony from the witnesses is up: https://t.co/xLXgUJCZx4","date":"Wed Jul 19 13:17:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Getting ready for several confirmations for key intelligence posts this morning in Senate Intel. Watch live here: https://t.co/xLXgUJCZx4","date":"Wed Jul 19 13:12:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Gaveling in for the confirmation hearing of 3 key intelligence posts this morning. https://t.co/EzCccavLjO","date":"Wed Jul 19 13:08:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Completely unacceptable: “… at current rate, it will take 11 years, 4 months to fill all Trump administration spots” https://t.co/ErkFBKw2lb","date":"Tue Jul 18 15:30:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Relieved to see my friend and former colleague @kayhagan's health is continuing to improve. Will keep praying for her and her family.","date":"Mon Jul 17 21:13:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to see North Carolina’s own @DrinkCheerwine represented at the WH for the Made in America showcase! https://t.co/LmcLhGQ5Y0","date":"Mon Jul 17 19:48:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Pleased with the President's nomination of Robert Higdon to serve at US Attorney. Statement w/ @SenThomTillis here: https://t.co/vQmOlQbYSB","date":"Fri Jul 14 19:24:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Next Week: Senate Intel holds confirmation hearing for 3 nominees (Susan Gordon, Robert Stortch &amp; Isabel Patelunas) https://t.co/niMW74DmK8","date":"Fri Jul 14 15:51:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@SenThomTillis &amp; I are pleased to support nomination of Tom Farr to Eastern District of NC. I supported him in 2006 &amp; continue to do so.","date":"Thu Jul 13 19:43:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"#tbt to having some fun behind the scenes w/ DHS Under Secretary for I&amp;A David Glawe's sweet kids a few weeks ago cc @MarkWarner https://t.co/qylsBo6P4e","date":"Thu Jul 13 17:57:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Stopped by the Speaker's Balcony to catch up with some constituents on Capitol Hill this week. A great view from the People's House. https://t.co/5e0teO8YW2","date":"Thu Jun 29 17:14:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Statements for the record for today's witnesses are up: https://t.co/8NMJ0K05yM","date":"Wed Jun 28 14:24:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Opening statement for today's second hearing here: https://t.co/GcsRDdSt3s","date":"Wed Jun 28 14:07:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Who wouldn't? #longlivethething https://t.co/xBZoPSyOt6","date":"Tue Jun 27 23:56:09 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Two open SSCI hearings back to back on Wednesday AM: Confirmation hearing at 8:30 am, Russian Intervention in European Elections at 10 am.","date":"Mon Jun 26 20:58:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wednesday: Senate Intel Committee Holds Confirmation Hearing for DHS Under Secretary for Intelligence and Analysis  https://t.co/7mw3bPfkTj","date":"Mon Jun 26 20:55:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the health care discussion draft https://t.co/L4VSigqIFM","date":"Thu Jun 22 18:56:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"You’re looking good Skippy! https://t.co/WjPrmZQOHr","date":"Wed Jun 21 18:25:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Prepared remarks from the experts testifying before the Intel Cmte today: https://t.co/qRlfaWeFz1","date":"Wed Jun 21 13:51:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Preview of my opening remarks https://t.co/dAUlN3sCyd","date":"Wed Jun 21 13:32:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Disaster preparedness &amp; recovery infrastructure is critically important for NC. Glad the Senate confirmed NC native Brock Long to lead FEMA. https://t.co/BclEvXOpqe","date":"Tue Jun 20 19:22:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Always wonderful to visit with NC families. Thanks for stopping by the Capitol. https://t.co/YIrrdaPXvM","date":"Tue Jun 20 18:58:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"We had a constructive meeting with the Special Counsel today and we look forward to future engagements. https://t.co/E9KnHIapCJ","date":"Wed Jun 14 19:16:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Praying for the shooting victims. Thankful for the men &amp; women of law enforcement who put their lives on the line to keep everyone safe.","date":"Wed Jun 14 14:17:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Prepared remarks from Attorney General Jeff Sessions https://t.co/VFz3beYRki","date":"Tue Jun 13 19:22:19 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement https://t.co/sE3Y1Dcgli","date":"Tue Jun 13 19:02:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My prepared remarks https://t.co/zspUqft0in","date":"Tue Jun 13 18:43:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Attorney General Sessions to Testify at Senate Intel Committee Tomorrow https://t.co/EQEj71mhT2","date":"Mon Jun 12 15:11:21 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I got my card back. Thanks for the help. Glad I made sure y’all didn’t see my PIN. https://t.co/OrVF5iYpbq","date":"Thu Jun 08 21:12:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening remarks https://t.co/wj4DnH1Nmz","date":"Thu Jun 08 14:25:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My prepared remarks https://t.co/wykpFCu6Dh","date":"Thu Jun 08 14:08:58 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Former FBI Director Comey will testify before the Senate Intel Cmte tomorrow. https://t.co/P46leIT8DK","date":"Wed Jun 07 17:59:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Releases Comey Written Statement for the Record https://t.co/vG6CkNTrdq","date":"Wed Jun 07 17:57:33 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Prepared statement for the record from Intelligence Community leaders Coats, Rogers, Rosenstein, &amp; McCabe\nhttps://t.co/NaTrHisvii","date":"Wed Jun 07 14:49:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Committee hearing is in progress. Watch my opening remarks: https://t.co/Ws4mnSLxaA","date":"Wed Jun 07 14:22:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"A rare sighting of me with socks. #SockFactory #MadeInNC https://t.co/PEZoAbbOeU","date":"Fri Jun 02 16:34:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Committee to Hold FISA Hearing Next Week https://t.co/iyVbur5wdd","date":"Fri Jun 02 16:11:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Former FBI Director Comey to Testify at Senate Intel Committee Next Week\nhttps://t.co/KeouwiEvO0 https://t.co/49f8YVcu7W","date":"Thu Jun 01 17:05:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I wear this every day to remind me of the bravest Americans who have sacrificed for our great country. Thank you every day. #MemorialDay https://t.co/viB3f2Kx8Y","date":"Mon May 29 13:17:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"NC Air Guard keeps me on time and safe. Thanks guys. https://t.co/8qPws2hNX5","date":"Sun May 28 13:46:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks for the heads up. I'm heading outside to move it now. https://t.co/jZqe2NLFsq","date":"Thu May 25 20:55:40 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to meet with students and parents from Resurrection Lutheran School in Cary. Enjoy your visit to DC! https://t.co/01V6Q7AhUk","date":"Thu May 25 17:06:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My prayers are with the victims of the horrific attack in #Manchester.","date":"Tue May 23 17:09:28 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"We will vigorously pursue Gen. Flynn’s testimony and his production of any and all pertinent materials pursuant to the Cmte’s authorities.","date":"Mon May 22 21:20:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"We are disappointed he has chosen to disregard the Committee’s subpoena request for documents relevant and necessary to our investigation.","date":"Mon May 22 21:19:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"While we recognize General Flynn’s constitutional right to invoke the Fifth Amendment","date":"Mon May 22 21:19:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement with @MarkWarner on Flynn’s refusal to comply with SSCI’s subpoena https://t.co/6CB5toc2DF https://t.co/Q0HsUPw7DI","date":"Mon May 22 21:14:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Former FBI Director Comey Agrees to Testify in Open Session at Senate Intel Committee https://t.co/j7hhq839Oy","date":"Fri May 19 23:44:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"To the extent any deconfliction is required, we will engage with Dir. Mueller &amp;our expectation is that he will engage with the Cmte as well.","date":"Thu May 18 00:28:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Select Committee on Intelligence will continue its own investigation","date":"Thu May 18 00:26:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"and will provide some certainty for the American people that the investigation will proceed fairly and free of political influence.","date":"Thu May 18 00:24:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The appointment of former FBI Dir.&amp;respected lawyer Robert Mueller as special counsel for the Russia investigation is a positive development","date":"Thu May 18 00:23:10 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"7th graders from Wilmington checking out one of the Capitol’s historic attractions. Thanks for stopping by! #LongLiveTheThing https://t.co/476kcgsnzR","date":"Wed May 17 20:48:16 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Notification: Senate Intel Committee Seeks Additional Information from Comey, McCabe https://t.co/B53E6wu9Ej","date":"Wed May 17 17:00:40 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My thoughts and prayers are with @SenThomTillis and I wish him a speedy recovery.","date":"Wed May 17 13:02:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to participate in a manufacturing education event at a North Carolina bus company in Archdale today. https://t.co/QNaaKoOnra","date":"Fri May 12 21:09:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks for stopping by our DC office @vccskings! 1 of 6 NC teams competing in the 2017 Team America Rocketry Challenge National Finals! https://t.co/OCj45ytvmI","date":"Fri May 12 20:33:41 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Corolla wild horses are a treasure. Working with @SenThomTillis and @RepWalterJones to protect them. https://t.co/KRovizqMbF","date":"Thu May 11 19:26:19 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Prepared remarks from Director of National Intelligence Dan Coats https://t.co/i49tl9HMvc","date":"Thu May 11 14:24:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intelligence Committee open Worldwide Threats hearing beginning now https://t.co/4oKywkAdcn https://t.co/CjHl75Hfbo","date":"Thu May 11 14:12:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My prepared remarks https://t.co/Zdyr5VIELc","date":"Thu May 11 14:08:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Intelligence community leaders testify before an open hearing of Senate Intel Cmte this morning. WATCH LIVE @ 10am https://t.co/4oKywkAdcn","date":"Thu May 11 13:36:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Committee Subpoenas Former National Security Advisor Flynn for Documents Regarding Russia Probe https://t.co/VCDb1NxtU4","date":"Wed May 10 22:24:49 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to work with @Sen_JoeManchin &amp; @SenAngusKing on a student loan law that is saving families billions https://t.co/EO7DKuWufp","date":"Wed May 10 19:23:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Former FBI Director Comey has been invited by the Committee to meet in closed session on Tuesday.","date":"Wed May 10 18:30:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Updated witness list for open Intel Cmte World Wide Threats Hearing hearing tomorrow https://t.co/FF96X7JKN8 https://t.co/mbHSiFzLjS","date":"Wed May 10 17:25:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Acting FBI Director Andrew McCabe will testify before an open hearing of the Senate Intel Cmte tomorrow.","date":"Wed May 10 17:23:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"His dismissal, I believe, is a loss for the Bureau and the nation.","date":"Tue May 09 23:53:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Dir. Comey has been more forthcoming w/ information than any FBI Director I can recall in my tenure on the congressional intel committees.","date":"Tue May 09 23:52:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"In my interactions w/ the Director and w/ the Bureau under his leadership, he &amp; the FBI have always been straightforward with our Committee.","date":"Tue May 09 23:51:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"His dismissal further confuses an already difficult investigation by the Committee.","date":"Tue May 09 23:50:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I have found Director Comey to be a public servant of the highest order.","date":"Tue May 09 23:50:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am troubled by the timing and reasoning of Director Comey’s termination.","date":"Tue May 09 23:48:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the dismissal of FBI Director Comey https://t.co/ovoe34xajZ https://t.co/1hB0QveczE","date":"Tue May 09 23:47:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of FDA commissioner Dr. Gottlieb https://t.co/zEmO5YpqhK","date":"Tue May 09 21:35:16 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement with Vice Chair @MarkWarner on Carter Page’s participation in SSCI investigation https://t.co/O9riFYRwHb","date":"Fri May 05 18:06:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intelligence Committee to Hold World Wide Threats Hearing Next Week https://t.co/FF96X7JKN8","date":"Fri May 05 16:20:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Reintroduced legislation to federally recognize the Lumbee with @reppittenger today. This is long overdue. https://t.co/WaDEqD9OBM https://t.co/bsVJ755Tg3","date":"Thu May 04 19:56:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you @SenatorStrange for cosponsoring my motor sports protection bill. The @EPA should leave race car enthusiasts alone. https://t.co/tyXhpyrbTt","date":"Tue May 02 20:09:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Sharing a little US history with students from @butnerstemes elementary. https://t.co/j2cs954v1h","date":"Thu Apr 27 18:00:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The SMASH Act will give communities the support they need to fight the mosquitos that spread the Zika virus. https://t.co/JyxJelolA0","date":"Thu Apr 27 17:00:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate passed a resolution recognizing @UNC_Basketball. Congrats on six national championships! https://t.co/ilXawYSviX https://t.co/CEZZmW8b9k","date":"Wed Apr 26 18:05:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I know Secretary Perdue will work to promote policies that help our farmers and rural communities thrive.","date":"Mon Apr 24 22:07:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Agriculture is a vital part of North Carolina’s economy.","date":"Mon Apr 24 22:07:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m pleased the Senate confirmed Sonny Perdue to lead the Department of Agriculture.","date":"Mon Apr 24 22:06:49 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Had the opportunity to participate in a dedication ceremony for the new senior center in Reidsville today. https://t.co/mUoExlDolf","date":"Fri Apr 21 19:51:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel confirmation hearing for CIA General Counsel set for Wednesday https://t.co/N5WRIhMAHC …","date":"Fri Apr 21 18:05:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to visit with NC seniors at Wakefield Spring in Raleigh this week. https://t.co/iIn0gdVcnL","date":"Thu Apr 20 20:47:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"GOOD NEWS: @POTUS signed my bill that improves Charlotte area weather radar into law #CLTwx https://t.co/wKBaR36HDC","date":"Wed Apr 19 15:35:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Stopped by @FtBraggNC this morning. Thank you to the men and women who sacrifice to keep our nation safe. https://t.co/ELdqCQA3AV","date":"Tue Apr 18 20:42:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I congratulate Justice #Gorsuch on his confirmation &amp; I thank him for answering the call to serve this great nation. #SCOTUS https://t.co/DEvG7zXWZ1","date":"Fri Apr 07 16:07:55 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Justice #Gorsuch will serve the American people well as a defender of the Constitution. #SCOTUS https://t.co/1jOc9WKv6I","date":"Fri Apr 07 16:07:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Neil #Gorsuch is a trusted mainstream jurist who is ready to shoulder the incredible responsibility of serving on #SCOTUS https://t.co/OOWr3mgodb","date":"Fri Apr 07 16:06:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Justice Neil Gorsuch #SCOTUS https://t.co/ZKypFZ6Eyx","date":"Fri Apr 07 16:05:22 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The United States is once again asserting its leadership responsibility in eliminating genocide.","date":"Fri Apr 07 13:58:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am encouraged that the President decided to take action.","date":"Fri Apr 07 13:58:12 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This week, Bashar al-Assad once again committed genocide against the Syrian people with the one of the most horrific weapons known to man.","date":"Fri Apr 07 13:57:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The United States has always been a global leader in fighting genocide.","date":"Fri Apr 07 13:57:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the Syria military strikes https://t.co/azoCk5g0W0","date":"Fri Apr 07 13:56:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks @NDSS for the Champion of Change award. Proud to continue our work helping people with Down syndrome reach their full potential #ABLE https://t.co/OJyBm5fkwj","date":"Wed Apr 05 17:36:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@sarahartweir: At the table: The importance of advocating for #ABLE https://t.co/v1vFBzaZMZ","date":"Wed Apr 05 15:47:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today we honor the families of service members who gave their lives for our country. #GoldStarWivesDay https://t.co/MkCMcFLppQ","date":"Wed Apr 05 15:16:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"TAR HEELS! Congrats @UNC_Basketball #nationalchampionship 🐑🏀","date":"Tue Apr 04 03:42:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck @unc_basketball! #finalfour #getintoit 🐑 🏀","date":"Sat Apr 01 23:01:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intelligence open hearing continues at 2pm. Watch it live: https://t.co/1Vo1u1NxJY","date":"Thu Mar 30 17:33:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Preview of my opening remarks: https://t.co/nXJKe3ZZ9T","date":"Thu Mar 30 14:10:59 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intelligence open hearing starts at 10am. Watch it live: https://t.co/qnvcihOuul","date":"Thu Mar 30 13:37:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@CNN: Senate intelligence leaders: 20 people to be questioned, first hearing Thursday https://t.co/t7Xuj5x8NO","date":"Wed Mar 29 21:36:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to meet your family. I hope you enjoyed your visit to DC. https://t.co/89AbLE2ABm","date":"Wed Mar 29 20:39:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@WWAY: Janey Ensminger Act introduced to provide care to toxic tap water victims https://t.co/pBBdyjP3uE","date":"Wed Mar 29 16:14:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Holding a press conference with Intel Vice Chair @MarkWarner at 2:30 today. Watch it live: https://t.co/ML12WM7nP3","date":"Wed Mar 29 15:34:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Intro’d Janey Ensminger Act w/ @SenBillNelson @marcorubio&amp; @SenThomTillis so Lejeune vets can get the care they need https://t.co/pOXvhWnCo4","date":"Wed Mar 29 15:11:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Joint statement w/ @MarkWarner on Jared Kushner’s voluntary\nparticipation in SSCI investigation https://t.co/0cvQFzomdq https://t.co/AgT21e91a6","date":"Mon Mar 27 18:51:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congrats to @UNC_Basketball! Headed to the #finalfour","date":"Mon Mar 27 01:04:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Good luck @unc_basketball! Last ACC team standing #sweet16 #getintoit","date":"Fri Mar 24 22:59:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy #NationalPuppyDay https://t.co/0gy9B5Do8e","date":"Thu Mar 23 20:34:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to work on bipartisan policies that give students and families better options to save for higher education https://t.co/MrYCiwFZAX","date":"Thu Mar 23 18:09:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Together we must continue to face down terrorism and track down those who inspire these brutal attacks.","date":"Wed Mar 22 20:38:28 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I will continue to track the events &amp; to ensure that our Intelligence Community is providing all requested support to our friends in the UK.","date":"Wed Mar 22 20:37:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My thoughts and prayers go out to all those affected by the senseless acts of violence in London.","date":"Wed Mar 22 20:37:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the attack in London https://t.co/ezamL5Q4H9","date":"Wed Mar 22 20:37:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Please avoid the area both for your safety and so firefighters can do their jobs. https://t.co/6AoDxiEdoH","date":"Mon Mar 20 15:43:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@HurdOnTheHill @BetoORourke glad y'all made it in time for votes. Let me know if you need a ride back to Texas. https://t.co/zIW8boShrX","date":"Thu Mar 16 14:16:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of @SenDanCoats to be Director of National Intelligence https://t.co/65g2whLbqF","date":"Wed Mar 15 18:51:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to support @SenDanCoats to serve as Director of National Intelligence. https://t.co/kOx1f7Iy2f","date":"Wed Mar 15 17:37:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Lejeune vets are getting care and support for diseases caused by toxic water. Proud to work w/ vets on this issue. https://t.co/J4XaeP86iX","date":"Tue Mar 14 17:44:53 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy #K9VeteransDay to our heroes with four legs #MilitaryMonday https://t.co/q9pIoISRjF","date":"Mon Mar 13 17:05:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Proud to have two NC teams competing in the ACC semifinals tonight @UNC_Basketball @DukeMBB  #ACCTourney","date":"Fri Mar 10 18:31:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"He will draw on his deep knowledge of the issues to help the Intel Community address the wide range of challenges to national security.","date":"Thu Mar 09 20:15:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am confident @SenDanCoats will be an excellent Director of National Intelligence.","date":"Thu Mar 09 20:13:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m pleased the Intel Cmte reported out our former colleague @SenDanCoats &amp; I look forward to supporting his nomination on the Senate floor.","date":"Thu Mar 09 20:13:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Hopeful we can pass this legislation again in the Senate &amp; I look forward to working w/ @reppittenger to get it passed in the House. #cltwx","date":"Wed Mar 08 21:12:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"We have made a lot of progress on this issue, but the weather radar covering the Charlotte area is still dangerously deficient. #cltwx","date":"Wed Mar 08 21:11:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Working on leg w/ @SenatorCantwell @SenThomTillis &amp; @reppittenger to identify solutions for inadequate weather radar https://t.co/wP8V9WOdb8","date":"Wed Mar 08 21:09:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"#RepealAndReplace #Obamacare w/ solutions that make health insurance more affordable &amp; give families more control over their own health care","date":"Tue Mar 07 15:36:45 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I look forward to working with my colleagues to fulfill our promise to the American people to #RepealAndReplace #Obamacare","date":"Tue Mar 07 15:33:55 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"House plan is a good first step toward providing relief from the broken promises, costly mandates, &amp; gov bureaucracy created by #Obamacare","date":"Tue Mar 07 15:33:21 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the House GOP #RepealAndReplace American Healthcare Act https://t.co/DYo3q94vFB","date":"Tue Mar 07 15:31:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Unacceptable that a significant percentage of veterans are still waiting more than 30 days for VA appointments https://t.co/9pvXoqNjJA","date":"Fri Mar 03 21:12:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Dr. Carson will look at housing policy with fresh eyes move forward with programs that will help communities thrive.","date":"Thu Mar 02 16:02:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I have no doubts about Dr. Carson’s commitment to serving this nation.","date":"Thu Mar 02 16:02:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation Dr. Ben Carson to serve as HUD Secretary https://t.co/7RxQsk3fNA","date":"Thu Mar 02 16:02:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"@lennie_129 Here it is on my website: https://t.co/O2W7njoQdc","date":"Wed Mar 01 17:27:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I look forward to working with @RepRyanZinke to ensure that #LWCF will continue to preserve NC’s natural treasures for future generations.","date":"Wed Mar 01 16:14:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m proud to support @RepRyanZinke. He is an excellent choice to lead the Department of Interior.","date":"Wed Mar 01 16:13:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Interior Secretary @RepRyanZinke https://t.co/yflIUmBpd1","date":"Wed Mar 01 16:13:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Coats pledges to work with lawmakers on probe into Russia https://t.co/vQ8DJwoiOa","date":"Tue Feb 28 22:11:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you @SenDanCoats again for being here, for your years of service to our country, and I look forward to your testimony.","date":"Tue Feb 28 19:19:34 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@SenDanCoats, you have been asked to lead the Intelligence Community at a time of profound threat and challenge.","date":"Tue Feb 28 19:16:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Those of us who had the good fortune to work with Dan know the depth of his commitment to the Intelligence Community and its workforce.","date":"Tue Feb 28 19:14:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@SenDanCoats comes to us with more than 34 years of honorable service in the House, the Senate, and as US Ambassador to Germany.","date":"Tue Feb 28 19:13:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Intel Cmte hearing on the nomination of @SenDanCoats to be Director of National Intelligence starts at 2:00pm https://t.co/o1IY6HFkT1","date":"Tue Feb 28 18:36:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Commerce Secretary Wilbur Ross https://t.co/0rc1rplOx7","date":"Tue Feb 28 00:35:40 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The #ABLE Act is an example of what we can do when the cause is right. https://t.co/fmIn0Elrxq","date":"Thu Feb 16 17:35:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Investigation of Trump, Flynn and Russia Moving Forward https://t.co/VgUiv7hCBi","date":"Wed Feb 15 21:27:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Encouraging @SenateDems have allowed a swift vote on @Linda_McMahon, I’m hopeful we can continue bipartisan cooperation on nominees.","date":"Tue Feb 14 17:01:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Her real world experience will be incredibly valuable as she serves our nation by leading the Small Business Administration.","date":"Tue Feb 14 17:00:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@Linda_McMahon was born in NC and grew a small business into a thriving entertainment enterprise; she exemplifies the American dream.","date":"Tue Feb 14 16:59:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Small Business Administrator @Linda_McMahon https://t.co/4r3tKAN7xk","date":"Tue Feb 14 16:57:59 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I hope that Dr. Shulkin embraces the accountability authority to ensure that all VA employees are working for our nation’s veterans.","date":"Tue Feb 14 01:03:25 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This includes improving the Veterans Choice Program and making it permanent so that veterans never have to wait for health care.","date":"Tue Feb 14 01:02:51 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I look forward to working with Dr. Shulkin to ensure our veterans receive the world-class health care that they were promised &amp; have earned.","date":"Tue Feb 14 01:02:35 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Veterans Affairs Secretary Shulkin https://t.co/C1dLHkGDmc","date":"Tue Feb 14 01:02:09 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Treasury Sec. is an essential member of the economic team and I look forward to working with him to get our economy back on track.","date":"Tue Feb 14 00:44:41 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Americans have been struggling under a stagnant economy for too long.","date":"Tue Feb 14 00:43:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am also pleased that @stevenmnuchin1 has committed to cleaning up abuses at the IRS.","date":"Tue Feb 14 00:43:27 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"As a member of @GOPSenFinance, I questioned @stevenmnuchin1 at his confirmation hearing and I am confident in his qualifications.","date":"Tue Feb 14 00:43:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Treasury Secretary Mnuchin https://t.co/NRVvwwPNdN","date":"Tue Feb 14 00:42:12 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to join officials from across the country to talk about how the #ABLE act is changing lives for the better. https://t.co/sJ0wrctKUj","date":"Mon Feb 13 20:56:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you Jerry Ensminger for all you have done to fight for Camp Lejeune veterans https://t.co/Jiy4XzSH5h","date":"Fri Feb 10 18:43:03 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of @RepTomPrice to serve as Secretary of Health and Human Services https://t.co/JZHQbSFHTk","date":"Fri Feb 10 14:19:01 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Attempts by Senate Democrats to stall nominees only distract from the struggles of NC families seeking the best education for their children","date":"Tue Feb 07 17:40:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Betsy DeVos has dedicated her life to improving education, so I am glad she will continue to fight for all children as Sec of Education.","date":"Tue Feb 07 17:39:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Betsy DeVos to Serve as Secretary of Education https://t.co/bnDF06p6Dm","date":"Tue Feb 07 17:39:09 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’ll be rooting for this puppy named Burr in the #PuppyBowl. Not a member of my family, but looks like a very good dog. https://t.co/tNjderIE8Q","date":"Fri Feb 03 19:47:28 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on CIA Director Pompeo’s selection of Gina Haspel for Deputy Director of the CIA https://t.co/3naViG0MMN","date":"Thu Feb 02 20:00:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"At this critical time, I am confident Rex Tillerson has the experience to rise to the challenge.","date":"Wed Feb 01 20:37:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"As our nation's top diplomat, the Secretary of State will be in charge of leading U.S. diplomatic efforts around the world.","date":"Wed Feb 01 20:36:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m glad the Senate was able to come together and confirm Rex Tillerson to serve as Secretary of State.","date":"Wed Feb 01 20:36:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of Rex Tillerson to serve as Secretary of State https://t.co/aJIMxSPJZe","date":"Wed Feb 01 20:35:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Democrats should stop running side shows and honor the results of the 2016 election.","date":"Wed Feb 01 16:11:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I was pleased to vote at @GOPSenFinance today, and look forward to a full Senate vote for him to lead HHS.","date":"Wed Feb 01 16:10:38 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I know that @RepTomPrice is well prepared to lead this important agency at this critical time for our nation’s health care system.","date":"Wed Feb 01 16:10:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on @GOPSenFinance vote on @RepTomPrice to lead Health and Human Services Dept. https://t.co/sMHQpL4rvm","date":"Wed Feb 01 16:09:42 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Let’s get leaders for our government in place quickly, as has been the practice with every President to date.","date":"Wed Feb 01 15:56:23 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"It’s time for the Democrats to stop their shameless grandstanding","date":"Wed Feb 01 15:55:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@stevenmnuchin1's credentials are self-evident proof that he is more than qualified to lead the Department of Treasury.","date":"Wed Feb 01 15:55:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@stevenmnuchin1 proceeds today to a full Senate vote on his confirmation.","date":"Wed Feb 01 15:54:48 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Even though the Democrats are throwing everything but the kitchen sink at President Trump’s nominees","date":"Wed Feb 01 15:54:18 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on @GOPSenFinance vote on @stevenmnuchin1 to head Treasury Dept. https://t.co/mXnkhAGVNF","date":"Wed Feb 01 15:48:46 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I am hopeful that the Senate will come together and swiftly confirm Judge Gorsuch. #SCOTUS","date":"Wed Feb 01 01:23:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Now that the American people have spoken, and the President has nominated a mainstream jurist #SCOTUS","date":"Wed Feb 01 01:22:31 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Minority Leader @SenSchumer has repeatedly expressed his desire to have nine Justices serving on the Supreme Court. #SCOTUS","date":"Wed Feb 01 01:21:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Gorsuch is a judge who will continue to operate in accordance with the rule of law and respect for the Constitution. #SCOTUS","date":"Wed Feb 01 01:21:17 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2006, the Senate confirmed him without opposition to serve on the U.S. Court of Appeals for the 10th Circuit. #SCOTUS","date":"Wed Feb 01 01:20:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I applaud President Trump’s selection of Judge Neil Gorsuch to serve on the Supreme Court. #SCOTUS","date":"Wed Feb 01 01:20:32 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the nomination of Judge Neil Gorsuch #SCOTUS https://t.co/kBLWuIIBU3","date":"Wed Feb 01 01:19:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I support her nomination and will work with her to ensure that every child in America receives a world-class education. #DeVos","date":"Tue Jan 31 19:07:56 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I believe @BetsyDeVos is committed to helping our children succeed academically.","date":"Tue Jan 31 19:07:26 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Too much time has passed where children have received a poor education that simply does not stack up. #DeVos","date":"Tue Jan 31 19:07:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@BetsyDeVos is going to put our children first.","date":"Tue Jan 31 19:06:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on @GOPHELP vote on @BetsyDeVos https://t.co/MIkAOHRboW","date":"Tue Jan 31 19:06:19 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@ElaineChao has the drive and the determination to usher in a new era of infrastructure renewal.","date":"Tue Jan 31 18:30:57 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@ElaineChao is an experienced public servant and I am delighted that Congress will have the opportunity to work with her again.","date":"Tue Jan 31 18:30:13 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the confirmation of @ElaineChao to serve as Transportation Secretary https://t.co/i3GirB8VZ0","date":"Tue Jan 31 18:29:47 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"This is an important day for the families of children with disabilities #ABLE https://t.co/sMh0v5k42v","date":"Thu Jan 26 18:59:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Her pledge to support Israel, our closest ally in the region, will rebuild a critical relationship.","date":"Tue Jan 24 23:15:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"She is well prepared to engage w/ world leaders &amp; craft solutions to the world’s most difficult humanitarian crises and political conflicts.","date":"Tue Jan 24 23:15:10 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@nikkihaley will bring a fresh perspective to the United Nations.","date":"Tue Jan 24 23:13:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"NC deserves better than #Obamacare’s broken promises. @RepTomPrice is committed to fixing health care. https://t.co/aR8h1CppRb","date":"Tue Jan 24 19:58:36 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I know he will ensure that the CIA is well positioned to reinforce our national security in the coming years.","date":"Tue Jan 24 01:23:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"He is well equipped to handle the demands of CIA Director.","date":"Tue Jan 24 01:23:14 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"While I’m disappointed Senate democrats insisted on delaying his vote, I’m pleased he is in place and ready to help keep our country safe.","date":"Tue Jan 24 01:22:23 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today, the Senate voted overwhelmingly to confirm Rep. Mike Pompeo to be the next Director of the Central Intelligence Agency.","date":"Tue Jan 24 01:21:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thank you @POTUS for taking steps to give Americans relief from the harmful damage of Obamacare as Congress works to repeal and replace.","date":"Sat Jan 21 18:45:07 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the delay of a vote on Pompeo to lead CIA https://t.co/m8AmSF7tcp","date":"Fri Jan 20 23:53:00 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate confirms Gen. Kelly to be Secretary of Homeland Security. Critical member of the national security team.","date":"Fri Jan 20 23:16:12 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate just confirmed Gen. Mattis to be Secretary of Defense. Very important for @POTUS to have national security team in place on day one.","date":"Fri Jan 20 22:53:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The peaceful transition of power is one of America's greatest traditions. Congratulations @POTUS 🇺🇸 #Inauguration","date":"Fri Jan 20 22:20:52 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I joined @marthamaccallum live from from the national mall tonight to discuss the presidential transition and the intelligence community. https://t.co/STiOidTSlA","date":"Fri Jan 20 01:05:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Going live with @marthamaccallum in a few minutes. Tune in on @FoxNews. https://t.co/yo544OkGwJ","date":"Fri Jan 20 00:25:02 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Treasury nominee Mnuchin commits to my plan to clean up IRS misconduct https://t.co/qRt0VxxdPF https://t.co/2bGuqMt5VJ","date":"Thu Jan 19 22:05:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@BetsyDeVos is the person we need for this job and I am proud to support her nomination. #DeVosConfirmation","date":"Wed Jan 18 19:03:29 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Her commitment to improving education and expanding opportunity for our students is unmatched. #DeVosConfirmation","date":"Wed Jan 18 19:02:54 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m glad that we had a lively discussion with @BetsyDeVos about her vision for the Department of Education. #DeVosConfirmation","date":"Wed Jan 18 19:02:24 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@TB_Times: Editorial: VA finally helps Lejeune vets https://t.co/lxXoW76f5N","date":"Tue Jan 17 20:03:12 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Dept. of Veterans Affairs announces compensation for Lejeune veterans affected by tainted water https://t.co/DNahc8InuT","date":"Fri Jan 13 14:52:13 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The hearing is relocating to Dirksen 106.","date":"Thu Jan 12 15:35:15 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"10AM TODAY Intel Cmte confirmation hearing for @RepMikePompeo to be CIA Director. Watch it LIVE https://t.co/8EVB8rf6xE https://t.co/N66b6fJNOz","date":"Thu Jan 12 14:04:30 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":".@CBSNews: FBI Director Comey: Agency requested access to DNC servers https://t.co/1G0xqy7WaM","date":"Tue Jan 10 22:47:43 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Burr: Did the FBI ask for access to dnc servers? \nComey: yes","date":"Tue Jan 10 18:26:08 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement https://t.co/MBXvYsR8xx","date":"Tue Jan 10 18:11:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My opening statement here: https://t.co/MBXvYsR8xx","date":"Tue Jan 10 18:11:39 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m leading an open Intel Committee hearing on Russian Intelligence Activities at 1pm. Watch it live on Facebook https://t.co/8EVB8rf6xE https://t.co/eNZC8Tcq4N","date":"Tue Jan 10 17:41:05 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’ve seen first-hand Sen. Coats deep understanding of the Intelligence Community and he is a fine choice.","date":"Sat Jan 07 17:52:37 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"His years of honorable service in Congress, the U.S. Army and his time as Ambassador have proven his dedication to the American people.","date":"Sat Jan 07 17:52:11 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Dan’s experience as a valued member of the Senate Intelligence Committee will help guide him as the next Director of National Intelligence.","date":"Sat Jan 07 17:51:50 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"I’m pleased to hear the President-elect has nominated my colleague and friend Dan Coats to be the next head of our Intelligence Community.","date":"Sat Jan 07 17:51:20 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the Intelligence Community report on Russian actions\nhttps://t.co/gpTsiE1Sd3 https://t.co/mJ04xSiJnM","date":"Fri Jan 06 23:00:23 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate Intel Committee will hold an open hearing on Tuesday on Russian intelligence activities https://t.co/JPqenJGtK9","date":"Fri Jan 06 14:11:55 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"There is snow in the forecast, but it is never too cold to drive the Thing❄️☃️  #NoRoofNoProblem #LongLiveTheThing https://t.co/trG549l76K","date":"Thu Jan 05 18:26:12 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"My granddaughter warmed hearts when she stole the show at the Senate swearing-in ceremony yesterday. https://t.co/XknXbFhEKU","date":"Wed Jan 04 19:02:41 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Senate Intel Committee will hold a hearing on the nomination of @RepMikePompeo to be Director of the CIA on Jan 11th https://t.co/VePzMUPea7","date":"Wed Jan 04 18:46:44 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"The Senate swearing in ceremony starts at NOON. Tune in to @cspan to watch it live: https://t.co/7GYmfpo5O7","date":"Tue Jan 03 16:47:06 +0000 2017","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wishing everyone a happy and safe holiday! https://t.co/aRcpkRRLF1","date":"Sun Dec 25 14:27:01 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"No Senators were harmed. \nhttps://t.co/28KMv62vh0 https://t.co/Or9GWf32Z9","date":"Tue Dec 20 17:58:13 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"You are a top notch reporter @cameronkentwxii. I will miss watching your broadcast on @WXII, enjoy your well-earned retirement.","date":"Fri Dec 16 22:14:58 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on the Senate Intel Committee review of Russian intelligence: https://t.co/8nMzTDNhnK","date":"Fri Dec 16 17:32:44 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was a privilege to work with Alvin Sykes on the Emmett Till Unsolved Civil Rights Reauthorization Act https://t.co/ztwrrxAGgb","date":"Tue Dec 13 19:09:15 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Splitting up siblings is wrong. Read my op-ed on foster care reform ---&gt;\nhttps://t.co/WxdkFHmAq3","date":"Thu Dec 08 18:10:52 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Remembering Jimmy V this week. A great coach and leader on and off the court. #dontevergiveup https://t.co/Y108JAqAfB","date":"Thu Dec 08 16:34:01 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"#Cures supports those on the front lines of discovering, developing, delivering, and defining quality health care for years to come.","date":"Wed Dec 07 20:49:32 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"While our work on these issues will never be done, the #Cures bill offers great hope to so many.","date":"Wed Dec 07 20:49:13 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"This bill will spur the innovation that will save lives &amp; prepare us for the serious health care challenges &amp; threats we face. #Cures","date":"Wed Dec 07 20:48:50 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"As we usher in a new era of medical discovery, we seize the opportunity to better serve Americans battling devastating diseases. #Cures","date":"Wed Dec 07 20:48:17 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"#Cures sends the unequivocal message that the United States has never been more serious about leading the world in medical innovation.","date":"Wed Dec 07 20:47:38 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"More than 2,000 service members lost their lives at #PearlHarbor. Today we remember their sacrifice. https://t.co/rnYzoRC7ty","date":"Wed Dec 07 17:01:57 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"I look forward to supporting his nomination and ensuring its consideration without delay.","date":"Tue Dec 06 21:33:05 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"His intellectual rigor, honorable service, &amp; outstanding judgment make him a natural fit to lead one of our nation’s most treasured assets.","date":"Tue Dec 06 21:32:11 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":".@RepMikePompeo and I had a productive and engaging conversation today as we discussed his nomination to be the next Director of the CIA.","date":"Tue Dec 06 21:31:45 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"My bill to improve weather radar over Charlotte passed the Senate. Next stop is the US House cc: @reppittenger https://t.co/w4W08rsrfY https://t.co/oYtTaGemLr","date":"Fri Dec 02 19:33:36 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congrats to @SenThomTillis and the rest of the freshman class! It was a privilege to work with these dedicated public servants. https://t.co/EpbZVoKPTE","date":"Fri Dec 02 15:40:35 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"We must continue to hold Iran accountable for their threats against America and our allies.","date":"Thu Dec 01 22:10:56 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Iran remains the number one state sponsor of terrorism, and we cannot allow this regime to grow stronger under President Obama.","date":"Thu Dec 01 22:10:27 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Today the Republican led Senate voted to reauthorize sanctions against Iran through 2026.","date":"Thu Dec 01 22:10:11 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"It was an honor to serve with Rep. Coble. This is a wonderful way to remember his dedication to the people of NC. https://t.co/Ca8MJsNeU1","date":"Thu Dec 01 18:39:39 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"On #WAD2016 we affirm our commitment to defeat HIV/AIDS and give hope to those fighting this devastating disease around the world.","date":"Thu Dec 01 15:39:32 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Thanks for the birthday wishes Skippy! https://t.co/tkojYr5p9m","date":"Wed Nov 30 19:41:55 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Wonderful to join @ChrisMurphyCT and @SenGillibrand for the quarterly @WestPoint_USMA Board of Visitors meeting today. https://t.co/q4a8sYaf0m","date":"Wed Nov 30 19:09:00 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"🍻🍻🍻 https://t.co/Lyx7QdLSwB","date":"Wed Nov 30 16:46:58 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy Thanksgiving! https://t.co/yi62hLeACR","date":"Thu Nov 24 14:37:00 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"This is great news for Eastern NC https://t.co/AkBWHgkCrB","date":"Tue Nov 22 18:44:20 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Those of us who know Jim know he has been looking forward to his retirement for some time, and we wish him all the best.","date":"Thu Nov 17 17:53:23 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"And successfully managed the intelligence community enterprise.","date":"Thu Nov 17 17:53:02 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Amidst evolving challenges from our adversaries, Jim has continued to reinforce our intelligence relationships with our allies.","date":"Thu Nov 17 17:52:43 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Jim’s depth of experience gave him the unique ability to fully understand the range of challenges to our national security.","date":"Thu Nov 17 17:52:21 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"I thank him for his service to our nation.","date":"Thu Nov 17 17:51:55 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Director Clapper has served our country honorably and with distinction in every capacity requested of him.","date":"Thu Nov 17 17:51:38 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"My statement on Jim Clapper’s retirement announcement https://t.co/NC7IbQcxbW","date":"Thu Nov 17 17:51:17 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Come see the #CapitolDome for yourself! My office can give you a tour of the Capitol. Email Tours@Burr.Senate.gov for info. https://t.co/KpVcEZzqMe","date":"Thu Nov 17 16:09:32 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Congratulations @SpeakerRyan! https://t.co/VnDdS1jOSt","date":"Tue Nov 15 20:01:10 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy #VeteransDay to all who have served and all those who continue to serve in our military. Thank you for keeping us safe. https://t.co/xvqVv0BZD1","date":"Fri Nov 11 14:43:00 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"Happy 241st Birthday to the United States Marine Corps! @USMC #HappyBirthdayMarines https://t.co/I6v9ftWY3F","date":"Thu Nov 10 15:09:38 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm looking forward to working with president-elect @realDonaldTrump to build a brighter future for our children and grandchildren.","date":"Wed Nov 09 16:05:12 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"I'm saddened to hear of the passing of Warren Judge. He was a friend and I will miss him, as will many in the Outer Banks community.","date":"Sun Nov 06 23:23:01 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"It’s clear that #Obamacare is not working. I will work to replace this disaster with patient-centered reforms: https://t.co/ZMA726ciiO","date":"Fri Nov 04 17:00:23 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"In 2014, I worked with @SenatorBarb to write and pass our bipartisan Child Care and Development Block Grant Act:\nhttps://t.co/jYwNuZwR6M","date":"Fri Nov 04 16:00:19 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"A great privilege of serving NC in the Senate is helping build stronger families by strengthening early child care.\nhttps://t.co/jYwNuZwR6M","date":"Fri Nov 04 14:55:00 +0000 2016","user_id":"21157904"},{"handle":"SenatorBurr","text":"#TBT to meeting these youngsters from Hope on Wheels -- a great organization working to find a cure for childhood cancer: https://t.co/O6E6DvN0kR","date":"Thu Nov 03 17:40:09 +0000 2016","user_id":"21157904"}]