[{"handle":"SenatorRisch","text":"It was a pleasure to meet with teachers from Swan Valley Elementary School during their visit to Washington, D.C.\n\nIt’s always good to see Idahoans in our nation’s capital. https://t.co/fZbowwhy5m","date":"Thu Jun 16 19:57:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"May saw a record-setting 239,416 migrant encounters at the southern border. \n \nIt’s unsafe. It’s unsustainable. \n \n@POTUS, secure the border now.","date":"Thu Jun 16 17:45:16 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Biden Administration continues to break the wrong kind of records.","date":"Thu Jun 16 14:54:55 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Actively managing our forests guards against catastrophic wildfire, protects water quality, provides fish and wildlife habitat, and supports rural economies. I commend @GovernorLittle for leading this initiative.\n\nHealthy forests and a healthy Idaho go hand-in-hand.","date":"Wed Jun 15 20:58:30 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As a proud cosponsor of the Ocean Shipping Reform Act, I’m pleased to see it pass the House.\n \nOnce signed into law, this bill will help relieve supply chain slowdowns at our nation’s ports, cut shipping costs &amp; lower prices for consumers – a big win for the American people.","date":"Wed Jun 15 18:59:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"No more begging other countries for help. Increase lease sales, open up federal lands, and unleash the potential of American energy.","date":"Wed Jun 15 16:11:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For 247 years, the men and women of the United States Army have stood ready to protect us from threats from abroad. \n\nThanks to them, we are free. \n\nToday, and every day, we owe our heroes a debt of gratitude. #Army247 https://t.co/8CNKp94PIQ","date":"Tue Jun 14 21:21:10 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"$5.00 gas is not an accident.","date":"Tue Jun 14 18:54:53 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Throughout his campaign, the President railed against fossil fuels. His first day in office, the assault on domestic energy production began.\n\n$5.00 gas didn’t happen by accident – the administration’s policies got us here.","date":"Tue Jun 14 18:54:53 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Freedom, hope, and opportunity. There’s no place else I’d rather live. #FlagDay https://t.co/QkzZWeuHGx","date":"Tue Jun 14 16:32:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Days in Idaho’s Swan Valley.","date":"Tue Jun 14 16:06:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The historic number of encounters at the southern border can in part be attributed to the dangerous \"catch and release\" loophole that enables violent criminals to disappear into our communities.\n \nI’m proud to join @JimInhofe in introducing this common sense legislation. https://t.co/G0XZZgjL2Z","date":"Mon Jun 13 20:51:58 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you to the Coeur d’Alene Police Department and Kootenai County Sheriff’s Office for keeping the community safe.\n\nhttps://t.co/ecgibgh0kb","date":"Mon Jun 13 18:00:39 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Spud Kings” has a nice ring to it. Congratulations on a new era of hockey in eastern Idaho!","date":"Fri Jun 10 19:33:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/GOG7ZvtP8H","date":"Fri Jun 10 16:43:33 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Not even two years ago, the federal government completed a multi-year study of the lower Snake River dams. The findings were resounding: the dams should not be breached.\n\nThe results of an unscientific &amp; politically-motivated review of cherry-picked information do not concern me.","date":"Fri Jun 10 16:38:36 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Beyond his career as a decorated cyclist, Parker Paul is known in the Magic Valley for his big smile and desire to help his community.\n \nThese two medals bring his career medal count to ten – congratulations, Parker!\n\nhttps://t.co/nUcc1sWHUO","date":"Thu Jun 09 19:40:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A refusal to address record-high gas prices is a refusal to help millions of struggling Americans.","date":"Thu Jun 09 17:02:38 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s not every day your child is born at a boat check station, but sometimes you have to work with what you’ve got.\n \nA truly incredible story that exemplifies the kindness of our people and the can-do attitude of our state. #Idahome\n\nhttps://t.co/Q1psPMwuQg","date":"Wed Jun 08 21:11:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The President's Title 42 announcement in April served as the catalyst for migrants throughout Mexico, the Northern Triangle, and beyond.\n \nThese images are a direct result of the administration’s weak border policy and clouded messaging.","date":"Wed Jun 08 19:03:39 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Everything” would have included increasing lease sales and expanding domestic drilling operations.","date":"Wed Jun 08 15:46:36 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Instead of tackling the root cause of rising prices, the administration has shelled out handouts that have only contributed to the problem.\n \nEconomic solutions should rein in out-of-control spending, not expand the government even further.","date":"Tue Jun 07 20:23:08 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/9ObxA96FxV","date":"Tue Jun 07 16:33:10 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since 1927, the Cox family has preserved their family tradition of making &amp; selling honey. Their work is a testament to the treasures of Idaho’s agricultural industry.\n \nCongratulations to Cox’s Honey &amp; its employees on being the Idaho Small Business of the Month for June 2022! https://t.co/dp2wQcK40n","date":"Tue Jun 07 16:33:09 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On June 6, 1944, young men from around the world stormed the beaches of Normandy and secured one of the most pivotal military victories in history. Nearly 80 years later, we honor their bravery and remember those who made the ultimate sacrifice in the name of freedom. #DDay https://t.co/xL4V1UVOHc","date":"Mon Jun 06 20:11:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’ve never seen a gas station charge more than $5.00 per gallon in Idaho. Today, that changed.\n \nThe President should hold lease sales, approve drilling permits &amp; stop blocking private energy investments. It's the only way we'll see relief at the pump.","date":"Mon Jun 06 17:24:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to the @LCWarriors men’s baseball team on another incredible run in the @NAIAWorldSeries.","date":"Fri Jun 03 19:56:08 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My friend @SenJohnBarrasso is spot on.\n \nSince taking control of Washington, Democrats have actively worked to dismantle our oil and gas infrastructure.\nhttps://t.co/XUhC79xmKq","date":"Fri Jun 03 16:17:59 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Glad to see Hollywood has finally “Lost that Loving Feeling” for the Chinese Communist Party.\n\nhttps://t.co/hbkg23ZMKO","date":"Thu Jun 02 16:01:58 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We cannot keep paying this much for gas. \n \nMr. President, hold lease sales, approve drilling permits, and stop blocking private energy investments. That is the only way we will see relief at the pump.","date":"Wed Jun 01 16:58:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There goes my vacation to Siberia.","date":"Wed Jun 01 14:26:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The job is almost finished. \n \nGood luck to the @LCWarriors men’s baseball team as they look to take the next step toward their 20th @NAIAWorldSeries title tonight against Southeastern in Lewiston.","date":"Tue May 31 20:06:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, we come together to honor the men and women who have given their lives for our nation and stand alongside the loved ones they left behind. Because of their sacrifice, we are free.\n \nHappy Memorial Day, and God Bless America. 🇺🇸 https://t.co/8MMT73COFh","date":"Mon May 30 12:43:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I've long pushed for reform at the WHO – and still have serious concerns over its mishandling of the Covid-19 pandemic.\n\nThe Chinese Communist Party’s malign influence over the WHO must end. Full stop.\n\nThe @WHO should look inward before placing mandates on countries like the US.","date":"Tue May 24 19:11:41 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration claims the border is closed. But last month, 234,088 illegal immigrants were encountered at our southern border &amp; most were entered into the U.S. immigration system.","date":"Tue May 24 15:42:48 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"March saw the most illegal immigrants at the southern border in 22 years. April just broke that record.\n\nThe administration must fulfill its responsibility to the American people &amp; secure the U.S.-Mexico border.","date":"Tue May 24 15:42:48 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Americans continue to see record gas prices. \n \nThe solution? American-made energy. https://t.co/EreLujXij2","date":"Mon May 23 19:49:42 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This poll from @CBSNews is telling of the sentiment across the country.\n \nAmericans are genuinely frustrated &amp; feel the President is not working for them. https://t.co/7TK0aV92D7","date":"Mon May 23 17:16:45 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/IfYkesidwy","date":"Fri May 20 18:02:07 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since day one, President Biden has failed to take full advantage of America’s abundant energy supply. This inaction has resulted in record prices at the pump.\n\nThe Lease Now &amp; ONSHORE Acts unleash our nation’s greatest assets &amp; will help America become energy independent. https://t.co/ksbtwqracv","date":"Fri May 20 18:02:07 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Without #Title42, the National Border Patrol Council predicts over 200,000 migrants will be released into the United States next month – a surge unlike any we’ve seen.\n \nThe administration cannot in good conscience allow Title 42 to end.","date":"Thu May 19 19:13:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Ten straight days of record prices at the pump.\n \nTen straight days of the Biden administration doing little to help Americans.\n \nLivelihoods are at stake. Mr. President, increase lease sales, roll back regulations &amp; unleash the potential of American energy.","date":"Thu May 19 16:13:35 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over 70 years ago, Army Private First Class Kenneth L. Bridger was declared MIA. Last night, he was finally reunited with his family in Twin Falls. \nhttps://t.co/5rKDXPHneA","date":"Wed May 18 21:34:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The numbers speak for themselves. Title 42 must remain in place.","date":"Wed May 18 19:29:44 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Unelected bureaucrats should not serve as the arbiters of truth. This is a major victory for free speech.","date":"Wed May 18 16:29:40 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Instead of increasing energy production here at home, our President is turning to #Venezuela – an authoritarian regime with a history of egregious human rights violations.\n \nWe should be producing oil here at home, not begging autocracies for bailouts.","date":"Wed May 18 16:05:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"An Idaho man broke a Guinness World Record this past weekend for running the Famous Idaho Potato Marathon at Lucky Peak State Park in 111 t-shirts.\n \nDavid Rush has broken more than 200 world records, all to promote STEM education – quite the story.\n\nhttps://t.co/2xtTjNYIxc","date":"Tue May 17 21:03:54 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Pushing an ideological green agenda will not help Americans fill their gas tanks.\n \nIncreasing domestic energy production will.","date":"Tue May 17 16:14:59 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’ve joined @SenBillCassidy in calling on the Biden administration to work with Congress to develop a plan to combat the national rise in crime and tackle the crisis at the southern border.\n \nAmericans deserve to feel safe in their communities.","date":"Mon May 16 21:01:36 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, we proudly #BackTheBlue.","date":"Mon May 16 18:52:53 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In just two days, Idahoans raised over $50,000 for @IdahoFallsFire. Well done, Idaho Falls!\n\nhttps://t.co/6jiFPf6q4v","date":"Fri May 13 20:33:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This has been a long time in the making. \n\nI’m glad to see this initial shipment of fresh Idaho potatoes granted access to Mexico, but this needs to be the first step of many to secure the meaningful market access Idaho potato farmers were promised 15 years ago.","date":"Fri May 13 17:23:51 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last night, Vicki &amp; I had the opportunity to share one of my family recipes with our colleagues at the 40th @MarchofDimes Gourmet Gala.\n \nI’m pleased to report that Grandma Risch’s Schaum Tortes – a traditional German dessert – were a hit. https://t.co/58g2pwESXL","date":"Thu May 12 19:37:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"8.3% inflation yesterday. 11% producer inflation today. \n\nThe numbers don’t lie. \n\nThe President’s claim that his administration's policies are helping to ease inflation could not be more off base.","date":"Thu May 12 15:22:08 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Idahome","date":"Wed May 11 21:11:32 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Each day, police officers across #Idaho ensure the Gem State remains a safe and prosperous place to live, work, and play.\n \nThank you to the thousands of law enforcement officers who so selflessly serve and protect our communities. #NationalPoliceWeek https://t.co/nHFv5WKdDg","date":"Wed May 11 19:12:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"While inflation sits at an 8.3% national average, prices in Mountain West states like Idaho are up 9.8%. Our region needs relief now.\n\nWe simply cannot leave rural America behind.","date":"Wed May 11 17:36:19 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our Constitution is the world’s greatest arbiter of free speech. The administration’s “disinformation board” is not just unconstitutional, it is a threat to our democracy.","date":"Tue May 10 20:34:48 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"At the end of the day, the only thing that can reel in inflation is sound economic policy and kitchen-table budgeting.\n \nInflation will continue rising until the administration lives within its means.","date":"Tue May 10 17:07:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If President Biden was serious about lowering energy and fuel costs for families he would empower domestic oil, gas, and mineral production today.","date":"Tue May 10 16:18:57 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Gorgeous.","date":"Tue May 10 15:05:15 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Boise native &amp; three-time Olympic gold medalist Kristin Armstrong on this prestigious nomination to the U.S. Olympic &amp; Paralympic Hall of Fame!","date":"Mon May 09 21:36:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Amid skyrocketing inflation, surging crime &amp; an unprecedented border crisis, Senate Democrats want to legalize abortions up until the moment of birth. \n \nDemocrats should focus on the everyday challenges facing the American people instead.","date":"Mon May 09 18:57:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today is the day and there are plenty of ways to show your support for Idaho’s small businesses:\n \n🛍️Stop by a local shop\n🎁Buy a gift card to use later\n🍽️Dine-in or take-out\n⭐Leave a review\n \nDrop your #SupportLocalGems story below. ⬇️ https://t.co/V6vPMYVfRe","date":"Fri May 06 21:25:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This week I cosponsored a resolution recognizing #SmallBusinessWeek &amp; honoring the small business owners that keep our economy thriving.\n\nThis includes @SBAgov’s Idaho Small Businessperson of the Year, Marcella Medor &amp; her team at MarCom in Idaho Falls. We are lucky to have them! https://t.co/03MQWZ5xdw","date":"Fri May 06 17:36:44 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to @IdahoGives on a successful campaign. In just four days, Idahoans raised over $3,500,000 for nonprofits throughout the state.\n \nIdaho truly holds a different heart.","date":"Fri May 06 15:51:31 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s official – today is #SupportLocalGems day in Idaho!\n \nI’d like to thank @GovernorLittle for his unwavering support of the Support Local Gems initiative &amp; for being a champion for Idaho’s small business community. We look forward to seeing you all out today! https://t.co/bcm2fy06ld","date":"Fri May 06 14:51:32 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tomorrow is the day and there are plenty of ways to show #Idaho’s local businesses what they mean to you! \n\nHow do you plan to #SupportLocalGems? https://t.co/AdyXFSnSTe","date":"Thu May 05 20:42:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What do small businesses mean to Idaho? Everything.\n \nI encourage everyone to join me in showing love to the local shops and restaurants that make our state such a great place to live.\n \nTomorrow, get out and #SupportLocalGems. https://t.co/JHohGiOQzJ","date":"Thu May 05 16:04:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, small business is big business.\n \nOn May 6th, show support for the local shops &amp; restaurants that make the Gem State thrive. #SupportLocalGems. https://t.co/mzvRI95KIi","date":"Wed May 04 21:33:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Administration has created a \"Disinformation Board\" in the name of protecting the US from threats. However, the real threat to our democracy is giving unelected bureaucrats the power to chill free speech.\n\nThis will not stand.\n\nMy @SenateGOP colleagues &amp; I are fighting back.","date":"Wed May 04 18:49:22 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s small businesses have always been there for us. Now, it’s time for us to be there for them.\n\nOn Friday, stop by one of the many small businesses that give our state its character &amp; strong sense of community. Together, we can all #SupportLocalGems. https://t.co/0dCjxiXba8","date":"Wed May 04 16:37:39 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From supply chain slowdowns to labor shortages, #Idaho’s small businesses continue to face challenges that threaten their very existence.\n\nWithout us, they cannot survive.\n\nOn Friday, get out and support the small businesses that make our communities so vibrant. #SupportLocalGems https://t.co/FZfzRnMEQI","date":"Tue May 03 20:31:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I honestly had no idea @SenatorMenendez could sing like that.","date":"Tue May 03 19:27:12 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on the leaked Supreme Court decision draft. https://t.co/f6ncqebyG5","date":"Tue May 03 17:47:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#SupportLocalGems is back &amp; there are plenty of ways to support your local businesses! https://t.co/zwf5obqIb2","date":"Mon May 02 22:53:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/IBA4R8CIjC","date":"Mon May 02 15:54:50 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In partnership with @IdahoCommerce, I am excited to announce the return of Support Local Gems, an all-day initiative encouraging Idahoans to shop local &amp; show love to the small businesses that make #Idaho thrive.\n \nOn Friday, May 6th, #SupportLocalGems. https://t.co/eSR20i8hof","date":"Mon May 02 15:34:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Working forests are a source of clean air, wildlife habitat, recreation &amp; products we use every day. Conservation &amp; active forest management go hand in hand &amp; Idaho has been a leader in just that. I'm proud to introduce this resolution w/ @SenAngusKing  to celebrate Arbor Day. https://t.co/PqGkp80fzm","date":"Fri Apr 29 19:14:51 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"BIG NEWS\n \nToday, my MAPLand Act was signed into law by the President. \n\nDigitizing America’s public land records is long overdue &amp; I’m proud to say this law will make enjoying the great outdoors infinitely easier for all our public land users.","date":"Fri Apr 29 17:13:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This week, the Senate passed @SenAngusKing &amp; my MAPLand Act to digitize our country’s public land records, making it easier than ever for outdoorsmen &amp; women to explore &amp; recreate on our country's vast public lands.\n\nNext stop: the President’s desk.","date":"Fri Apr 08 14:31:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to this legislation, alerts for missing or endangered individuals will reach Idaho’s communities sooner and save more families from heartbreak – a truly bittersweet moment.\n \nMichael Vaughan will never be forgotten.","date":"Thu Apr 28 17:22:55 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, following a strong showing at regional championships in Nampa, the Buhl High School robotics team made their way to Houston to compete against teams from around the world at the @FIRSTweets Robotics World Championships.\n \nCongratulation on this great feat! https://t.co/B2m52fPJgJ","date":"Wed Apr 27 21:27:05 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This \"plan\" is nothing more than an unserious proposal full of finger pointing and empty promises.\n \nDo not be fooled – this border crisis is driven by the Administration’s poor messaging and failures of enforcement. https://t.co/CHM7HgG95y","date":"Wed Apr 27 17:28:33 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you for your service, Pepper. You’ve been a good boy. https://t.co/GtwvCHmqnc","date":"Wed Apr 27 15:40:38 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Biden Administration cannot continue to bow to the demands of the left, especially when national security is at risk. Title 42 must remain in place.\n\nThis ruling out of Louisiana is encouraging &amp; a step in the right direction to secure our southern border.","date":"Tue Apr 26 17:19:22 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to this new partnership between @Battelle &amp; CEI, eastern Idahoans will have even greater opportunities to not only make a living, but to help change the world.","date":"Mon Apr 25 18:31:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A lack of management has turned our National Forests into a source of carbon instead of a solution to it.\n \nIf @POTUS was serious about improving forest health, he’d equip land managers with the tools for rapid &amp; aggressive management, not a tape to measure the size of the trees.","date":"Mon Apr 25 14:30:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Orrin Hatch was a giant in Utah politics. He was a statesman in the truest sense of the word. Most importantly, he was a great man &amp; friend. Vicki &amp; I are deeply saddened to hear of Orrin’s passing, and our prayers are with the entire Hatch family.","date":"Sun Apr 24 01:41:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m pleased the Idaho delegation was able to secure this SRS funding for Idaho’s rural counties, but more needs to be done. The government has an obligation to the communities that count on the SRS program &amp; we owe it to them to find a lasting solution.\n\nhttps://t.co/2DfgLCOPSs","date":"Thu Apr 21 18:41:37 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, Kootenai County Fire &amp; Rescue broke ground on their newest fire station. This facility will expand emergency services for thousands of residents, reducing response times by 66% &amp; making the region safer for North Idaho’s families. https://t.co/M3czEtq6NO","date":"Wed Apr 20 19:01:07 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Not quite. The trillions of dollars in reckless spending this administration has championed has caused prices to skyrocket. https://t.co/rRg2sJm3tL","date":"Wed Apr 20 15:57:31 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The spirit of giving is alive and well at @IdahoStateU. This money will go toward student scholarships, providing Idahoans with expanded access to higher education – well done! \n\nhttps://t.co/ecxxh21cgx","date":"Tue Apr 19 20:02:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/c59bqg67zH","date":"Tue Apr 19 16:41:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last year, Title 42 was used more than 1 million times to quickly expel individuals who crossed the border illegally. Repealing it during another predicted record year will leave our @CBP officers vulnerable &amp; stretched thin. \n\nI've joined @JerryMoran in demanding answers.","date":"Tue Apr 19 16:41:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"He is risen!\n \nHappy Easter to all, and God bless.","date":"Sun Apr 17 15:22:51 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For God so loved the world that he gave his one and only Son, that whoever believes in Him shall not perish but have eternal life.\n \nJohn 3:16 https://t.co/By3Rcv7OVR","date":"Fri Apr 15 16:15:13 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m pleased to see Idaho join the effort to preserve Title 42. A sovereign nation cannot exist without a secure border.","date":"Wed Apr 13 21:16:23 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Biden Administration announced it will repeal Title 42 at the southern border (because COVID-19 is over) while extending the transportation mask mandate for Americans (because COVID-19 isn’t over).","date":"Wed Apr 13 17:11:15 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"At 9 feet, 11 inches, this truly is the catch of a lifetime. Congratulations, Tyler!","date":"Mon Apr 11 22:17:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"That's why I’ve joined @marcorubio in introducing legislation to extend Title 42 until 2025.\n\nhttps://t.co/BNHru46sRl","date":"Mon Apr 11 18:17:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is what happens when you fail to enforce immigration policies. The administration's decision to end Title 42 doesn’t only take a crucial tool away from our @CBP officers, it encourages people to cross our border illegally.","date":"Mon Apr 11 18:17:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In addition to serving their wood-fired pizza, Malvagio's owners Svitlana &amp; Matthew have donated proceeds from sales to humanitarian efforts in #Ukraine – helping millions in need.\n\nCongratulations to Malvagio’s in Coeur d'Alene on being named the #SmallBusiness of the Month! https://t.co/hTym0sxXeO","date":"Fri Apr 08 19:51:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In February, Sheriff Donahue came into my office &amp; detailed the rise in deaths caused by fentanyl coming from our southern border.\n\nIt’s only getting worse. \n\nPresident Biden must secure the border before more innocent lives are lost.","date":"Fri Apr 08 17:13:50 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/IEdkDHTGGV","date":"Fri Apr 08 14:31:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This week, the Senate passed @SenAngusKing &amp; my MAPLand Act to digitize our country’s public land records, making it easier than ever for outdoorsmen &amp; women to explore &amp; recreate on our country's vast public lands.\n\nNext stop: the President’s desk.","date":"Fri Apr 08 14:31:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"After careful deliberation, I cannot provide my consent to Judge Jackson’s nomination to the Supreme Court.\n \nFull statement here: https://t.co/LhpBtWhODW","date":"Thu Apr 07 17:03:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This legislation will ease supply-chain slowdowns by providing expanded access to shipping containers for Idaho’s ag producers at west coast ports. \n\nI am encouraged to see it pass the Senate.\nhttps://t.co/YLh34wFyCE","date":"Wed Apr 06 21:23:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Preserving Title 42 is a bipartisan issue. \n\nThe Biden Administration should walk back its decision to end this crucial program before it does irreversible damage to our country.","date":"Wed Apr 06 19:14:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is precisely why we must secure our southern border – border security is national security.","date":"Wed Apr 06 16:34:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As we pay tribute to the service &amp; sacrifice of our fallen servicemembers, we hold in our hearts the spouses who shoulder the price paid for the defense of the freedoms &amp; liberties we enjoy every day.\n \nTo the #GoldStarSpouses of Idaho – thank you. America stands with you. https://t.co/g0e3slJlMW","date":"Tue Apr 05 21:37:45 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho has been on the leading edge of cutting red tape, but federal regulations continue to have far-reaching effects on small businesses &amp; taxpayers. DC should follow Idaho’s lead in reducing costly regulations with this effective one-in, two-out rule.\nhttps://t.co/EqhTBFicjM","date":"Tue Apr 05 19:46:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America's economy has the potential to boom again, but only if we let it.\n\nI’ve introduced the Reducing Regulatory Burdens Act to rein in the administration’s overreach &amp; protect our nation from burdensome federal regulations &amp; mandates.\n\nhttps://t.co/oeabmFKHI0","date":"Tue Apr 05 19:46:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"You’re lucky I wasn’t there. https://t.co/LkPzLjBs9y","date":"Tue Apr 05 17:45:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Title 42 is the most important policy responsible for deterring illegal immigrants from entering the country. Revoking it not only takes a critical tool away from our @CBP officers – it sends a message that our border is wide open. \n \nPresident Biden must secure the border now. https://t.co/0nErMXQJ9s","date":"Tue Apr 05 16:17:06 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In just two years, a boy from Idaho raised nearly $2,000 for @IdahoHumane running a lemonade stand – he’s only nine. Well done, Ben!","date":"Mon Apr 04 20:34:57 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since 1992, Larry Gebert has been a mainstay in living rooms throughout southern Idaho. Today, it is with a heavy heart we say goodbye.\n\nVicki &amp; my prayers are with Larry’s family &amp; friends during this difficult time. He will be missed.","date":"Sat Apr 02 23:23:31 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration began their assault on American energy the day they took office &amp; gas prices have been rising ever since. https://t.co/YQaKGA5170","date":"Thu Mar 31 18:04:30 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our strategic oil reserves shouldn’t be used for political games. The President’s decision to use more than a quarter of our oil reserves to fix his self-made crisis is nothing short of irresponsible.","date":"Thu Mar 31 18:04:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This afternoon I’ll be joining @johnrobertsfox on @AmericaRpts to discuss #Russia’s war on #Ukraine – tune in!\n \n📺 1pm ET on @FoxNews","date":"Thu Mar 31 16:30:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Gorgeous. #Idaho","date":"Thu Mar 31 15:19:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Ed Pulaski is remembered in Idaho not just as the inventor of an important tool but a hero of the Big Burn who saved the lives of dozens of firefighters.","date":"Wed Mar 30 20:39:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Title 42 must remain in place – plain and simple.","date":"Wed Mar 30 16:45:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Not everyone who lost his life in Vietnam died there. Not everyone who came home from Vietnam ever left there.”\n\nToday, we remember the more than 2 million Americans who so bravely answered the call to serve our nation.\n\nWe owe them a debt of gratitude. #VietnamVeteransDay https://t.co/43NfwnVsUz","date":"Tue Mar 29 21:31:38 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden is touting his $5.8 trillion budget as a money-saver. However, it is plagued with wasteful spending on left-wing programs &amp; budget gimmicks that do not honestly account for its cost.\n \nThis is no bargain. This is another ticking inflation time bomb.","date":"Tue Mar 29 19:07:54 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the past month, #Russia has found out just how committed the people of #Ukraine are to the preservation of freedom. Just like our American patriots in 1776, the Ukrainian people are not only fighting for their future, but for generations to come.\n \nTruly awe-inspiring. https://t.co/YWoa2KHMGa","date":"Tue Mar 29 16:26:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Ronald Reagan brought the Soviet Union crumbling down without ever firing a shot. We can do the same by arming #Ukraine to defend its sovereignty so that freedom &amp; democracy can flourish &amp; prevail for decades to come.\n\nMy op-ed in @TheIdahoPress:\n\nhttps://t.co/ZYE4Az6Fx9","date":"Mon Mar 28 20:13:39 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, we run state government like a family runs its household budget. We live within our means, save for rainy days &amp; pay our debts down.\n \nKitchen-table budgeting has been key to Idaho's success &amp; the federal government would be wise to take a page out of our book.","date":"Mon Mar 28 17:03:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In concert with #NationalAgWeek, I’ve joined @SenJoniErnst &amp; @SenTinaSmith in calling for today to be designated as “National Women in Agriculture Day\" to recognize the role of our country's female ag producers.\n\nHowever, I am a bit partial to my favorite woman in ag. https://t.co/4ubORfgAHW","date":"Thu Mar 24 20:12:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Read more. ⬇️\n\nhttps://t.co/vmhspAL6nZ","date":"Thu Mar 24 18:08:16 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Supply-chain snags &amp; labor issues continue to affect our economy. That’s why I’ve introduced the PLUS Act w/ @MikeCrapo &amp; @SenRickScott to protect local businesses by making it an unfair labor practice for unions to employ slowdown tactics &amp; block modernization efforts at ports. https://t.co/vrknUiXVk4","date":"Thu Mar 24 18:08:15 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A nation is only as strong as its people &amp; the people of #Ukraine are demonstrating just that.","date":"Thu Mar 24 15:57:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure to meet with @CloseUp_DC students from Camas County High School to talk about their experience in our nation’s capital &amp; answer their questions about the challenges facing our country.  \n\nAlways good to see fellow Idahoans in DC. https://t.co/JyGaXxLrDD","date":"Wed Mar 23 19:55:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Instead of shoring up our oil &amp; natural gas production capabilities, the administration began the short-sighted process of dismantling our energy infrastructure on day one.\n \nIt didn’t have to be this way.\n\nhttps://t.co/wzl88LQP6J","date":"Wed Mar 23 17:35:54 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Rising fuel prices are putting our nation's food security at risk.\n\nIt’s time to ramp up domestic energy production &amp; provide relief to America's farmers. We must remember that food doesn’t just come from the grocery store.\n\nhttps://t.co/8oaX1IuVBb","date":"Tue Mar 22 19:23:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From sunup to sundown, Idaho’s farmers &amp; ranchers work hard to feed the world. It’s not just what we do – it’s who we are. \n\nFrom this rancher, happy #NationalAgDay to Idaho’s ag community! https://t.co/mXnNSWAvhE","date":"Tue Mar 22 16:21:08 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/B9DgiMv1M1","date":"Mon Mar 21 19:03:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Chubbuck Elementary’s Tiffany Lemos &amp; Highland High’s Dane Beorchia on receiving Milken Educator Awards for their excellence &amp; innovation in education.\n\nTiffany &amp; Dane were also surprised with a $25,000 check from @Milken – watch the moment they found out. ⬇","date":"Mon Mar 21 19:03:23 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/L71aH73Gkl","date":"Mon Mar 21 19:03:23 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Interested in applying to one of our nation’s service academies? Stop by one of my academy days to hear academy liaisons, cadets, and midshipmen talk about the nomination process and what it means to attend a U.S. Service Academy. https://t.co/gIZFo5d7tj","date":"Fri Mar 18 19:15:09 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Projecting weakness to #Russia has been our biggest mistake so far. Now, it’s happening with #Iran.\n \nWe must be forward-leaning.\n \nAmerican strength will not provoke our enemies. American weakness will. https://t.co/DhNekmhUh1","date":"Thu Mar 17 19:05:38 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I may be a Vandal, but I still know how to support the Broncos. Good luck to @BroncoSportsMBB as they tip-off in the NCAA Tournament! #MarchMadness","date":"Thu Mar 17 15:32:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Ukrainian President is right in calling for a no-fly zone over #Ukraine. \n\nPresident Zelensky should declare a no-fly zone &amp; the US should provide him with the military equipment he needs to enforce it. https://t.co/AFcz2tvXTD","date":"Wed Mar 16 18:36:28 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Mexico is costing American spud farmers $150,000,000 each year by not fulfilling its side of the bargain. That's why @CongMikeSimpson &amp; I are pressing @SecVilsack to prioritize getting Idaho potatoes into Mexico as our farmers were promised over seven years ago. https://t.co/bIMajEQ6W4","date":"Wed Mar 16 17:32:55 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🚨Happening now.🚨","date":"Wed Mar 16 16:02:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This afternoon, I’ll be joining @senrobportman &amp; my Republican colleagues in a press conference to discuss #Russia’s war on #Ukraine.\n \nTune in to @SenateGOP at 12pm ET to watch.","date":"Wed Mar 16 14:56:12 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My Republican colleagues &amp; I have been hearing from law-abiding gun owners about letters they’ve received from @ATFHQ making blanketed threats toward them for legally purchasing firearm accessories.\n\nLast week, @MikeCrapo &amp; I joined @SenMikeLee in demanding answers.","date":"Tue Mar 15 21:33:33 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Just two days ago, #Iran fired missiles toward a United States consulate in Iraq. The Biden Administration is living in an alternate universe if they think signing a nuclear deal with Iran will change their behavior. https://t.co/inepegDBsv","date":"Tue Mar 15 18:15:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Ukrainians need military equipment &amp; they need it NOW.","date":"Tue Mar 15 16:11:57 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Eagle’s Dani Aravich &amp; the Wood River Valley’s Jake Adicoff, Sam Wood &amp; Jesse Keefe on their runs in the 2022 Paralympics! Jake &amp; Sam won gold in cross-country while Dani &amp; Jesse had strong finishes in Nordic &amp; alpine skiing. Well done! https://t.co/bhCAduAXZG","date":"Mon Mar 14 21:26:25 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My @SenateGOP colleagues &amp; I urge the administration, our Democrat colleagues &amp; the international community to learn the lessons of the very recent past. An #Iran agreement that does not have strong bipartisan support in Congress will not survive.\n\nFull statement. ⬇","date":"Mon Mar 14 15:52:06 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the past few weeks, Idahoans have shown an outpouring of support for the Ukrainian people. \n \nI’m proud to be an Idahoan &amp; I am proud to stand with #Ukraine. 🇺🇦","date":"Fri Mar 11 15:59:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For the past two weeks, the world has marveled at the unity &amp; resilience displayed by the Ukrainian people, but they cannot keep this up forever. The US must provide Ukraine with the military supplies they need.\n \nIt’s one thing to say we have resolve. We must show it, too.","date":"Thu Mar 10 18:30:57 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Iran &amp; #Russia are negotiating the #IranDeal &amp; they won’t even let the Americans in the room. Our people are out in the hall looking through a keyhole.\n \nThis is insane.\n \nWe should walk. https://t.co/Jrkmbo5fih","date":"Thu Mar 10 16:12:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Valor K9 Academy in Horseshoe Bend on being named the Idaho Small Business of the Month!\n\nSince its founding, US Air Force veterans Amy &amp; Justin Pishner have grown their business six fold, positively impacting their community along the way.","date":"Thu Mar 10 00:08:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/3b92hSFdeX","date":"Thu Mar 10 00:08:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy birthday to Idaho’s own @RepRussFulcher! Thanks for all you do for the people of ID-01. https://t.co/DeqRjIqkXu","date":"Wed Mar 09 21:30:06 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Rising gas prices far predate our ban on Russian oil. This is a direct consequence of the administration’s decision to dismantle our country’s existing energy infrastructure and forgo American energy independence.\n \nWe need reliable energy now.","date":"Wed Mar 09 18:20:10 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I applaud the administration’s move to ban the import of Russian oil yesterday – this is a step in the right direction. Now, we must replace it with American oil.\n \nWe are better off selling to our friends than buying from our adversaries.","date":"Wed Mar 09 15:20:37 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This isn’t my entire staff, but it’s a majority. #InternationalWomensDay https://t.co/afjlK5FtBV","date":"Tue Mar 08 22:14:45 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats are so fixated with their Green New Deal that they are willing to overlook egregious human rights violations in #Iran and #Venezuela to achieve it.\n \nWe should expand domestic energy production, not run from one autocracy to another.","date":"Tue Mar 08 19:34:54 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I was proud to work with @MikeCrapo to secure a 3-year SRS reauthorization &amp; ensure the program works correctly for Idaho's counties.\n \nNext stop: the President's desk.\nhttps://t.co/WOPmG3ZIx2","date":"Mon Mar 07 22:46:09 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Instability in global markets is causing gas prices to surge. \n\nIt’s time to unleash American-made energy &amp; deliver affordable, reliable energy to the American people.\n \nhttps://t.co/AzMWCHEabb","date":"Mon Mar 07 19:28:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Pray for the people of Ukraine.","date":"Mon Mar 07 17:33:52 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#GoVandals","date":"Fri Mar 04 20:26:35 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On March 4, 1863, President Lincoln signed an act creating the Idaho Territory – the rest is history. Happy #IdahoDay to the great people of the Gem State! https://t.co/fpoxalbNv4","date":"Fri Mar 04 18:04:40 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Proud to see the progress the @uidaho students have made on this project. It’s always great to see my alma mater making a real-world impact – you could say I’m over the moon. \nhttps://t.co/HArd2kWSFd","date":"Thu Mar 03 21:49:55 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden’s cancelation of the Keystone Pipeline killed thousands of jobs &amp; left us dependent on foreign oil. Now as #Putin wages a deadly war on #Ukraine, the U.S. is still importing 650,000 barrels of Russian oil every single day.\n\nAmerica needs energy independence now.","date":"Thu Mar 03 19:06:38 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Putin has shown that he will not be deterred without further action from the West.\n \nIt’s time we drop the hammer and completely shut down the Russian economy and do more to support the Ukrainian defenses. https://t.co/d5aik8EHIf","date":"Thu Mar 03 16:55:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Outsourcing energy production is not only costly to the American people, it emboldens our adversaries &amp; creates a national security threat. It’s time to bring back American-made energy.","date":"Wed Mar 02 22:49:41 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🚨 Happening now. 🚨","date":"Wed Mar 02 19:01:40 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"They know their freedom is worth fighting for. The people of #Ukraine will not be easily deterred.","date":"Wed Mar 02 17:49:54 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This afternoon, I am leading a press conference to discuss Russia’s unprovoked war on #Ukraine. \n\nTune in to C-SPAN or @SenateGOP at 2pm ET.","date":"Wed Mar 02 16:00:23 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on President Biden’s State of the Union Address. https://t.co/bePL7h0KWd","date":"Wed Mar 02 03:21:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m pleased to cosponsor @SenJohnBarrasso’s Senate Resolution commemorating this history &amp; designating today as Yellowstone National Park Day. More here:\nhttps://t.co/y8kSdFW44r","date":"Tue Mar 01 22:06:41 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On this day in 1872, Ulysses S. Grant established Yellowstone as America’s first national park. Today, Yellowstone continues to inspire awe in millions of visitors each year. \n \nHappy 150th birthday to @YellowstoneNPS! #Yellowstone150","date":"Tue Mar 01 22:06:40 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🇺🇸🇺🇦","date":"Tue Mar 01 18:37:52 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Remarkable courage. The Ukrainian people have shown that freedom is worth fighting for.\n \nThe people of the free world stand with #Ukraine. 🇺🇦","date":"Tue Mar 01 15:08:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Senate internships are an excellent opportunity for Idaho’s young leaders to witness our democracy in action &amp; gain firsthand experience in public policymaking.\n\nIf you or someone you know is interested, visit https://t.co/k77bOXYZe6 for more info. https://t.co/gBxEHQNzUs","date":"Mon Feb 28 23:20:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"While #Ukraine is under attack, Senate Democrats are prioritizing a vote on a disastrous postal reform package &amp; a partisan abortion bill.\n\nI'm calling on Leader Schumer to take up my #NYETAct to provide urgently needed support for Ukraine &amp; hold #Russia accountable.","date":"Mon Feb 28 17:36:05 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure to address the Idaho State Legislature in Boise with my fellow U.S. Senator @MikeCrapo. \n\nIt’s always good to be home. https://t.co/4LdpJpoqHQ","date":"Wed Feb 23 21:23:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In 1922, Con Paulos’ grandfather Gus opened his family’s original Chevrolet franchise in Magna, Utah. In 1979 Con relocated the dealership to Jerome, Idaho, where it remains open for business today.\n \nCongratulations to Con Paulos Chevrolet on 100 years of business! https://t.co/pdBsnbxskR","date":"Wed Feb 23 18:33:22 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on #Russia’s aggression toward #Ukraine.","date":"Tue Feb 22 17:20:44 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Presidents Day to all &amp; God bless America. 🇺🇸 https://t.co/ovOWTaznIC","date":"Mon Feb 21 18:25:53 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Sun Valley’s own Hilary Knight on her silver medal finish with @usahockey. Throughout the games, Hilary became the second all-time leading goal scorer &amp; most capped player for the women’s team in Olympic history, solidifying herself as one of the game’s greats.","date":"Thu Feb 17 18:06:58 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"They don’t call him “Mad Dog” Mike Crapo for no reason.","date":"Thu Feb 17 15:29:46 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho dairy: fueling @TeamUSA. 🥛","date":"Wed Feb 16 21:35:17 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats’ proposed gas tax holiday is nothing but a political play.\n\nIf they genuinely cared about what Americans are paying at the pump, they wouldn’t have spent the last year dismantling our country’s domestic energy production.","date":"Wed Feb 16 18:19:04 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’ve known Brad for quite some time now. Over the years, he has been a great colleague, confidant, and a close friend. \n\nHappy birthday to Idaho’s very own, @GovernorLittle! https://t.co/nSl9mgDrlG","date":"Tue Feb 15 22:31:41 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Keystone jobs report was due Sunday. I never received it.\n\nIt's time the administration took responsibility for the thousands of high-paying jobs &amp; estimated $800 million in wages that were erased when it canceled the pipeline.\n\nMy letter to @ENERGY Secretary Granholm. ⬇ https://t.co/a4QdoEly6T","date":"Tue Feb 15 18:16:49 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Idaho is the second-most producing sugarbeet state in the country, making up over 20% of the domestic market. Thanks to Idaho’s sugarbeet farmers, love is in the air this #ValentinesDay.","date":"Mon Feb 14 21:23:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Keystone jobs report was due yesterday. I still have not received it.","date":"Mon Feb 14 17:06:22 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Hailey’s Chase Josey &amp; Meridian’s Andrew Blaser on their fantastic runs in the 2022 Winter #Olympics.\n \nChase finished 7th in the men’s halfpipe &amp; Andrew finished in 21st in the men’s skeleton with a top speed of 76.2 MPH. You’ve both made Idaho proud! https://t.co/tJQYsQdRfQ","date":"Fri Feb 11 19:18:26 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What better gift for that special someone in your life? 🥔","date":"Thu Feb 10 21:19:09 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In July, the president &amp; his experts claimed that inflation was temporary. Today, consumer prices hit another 40-year high. \n\nThe Biden Administration’s economic policy is failing the American people.","date":"Thu Feb 10 14:55:58 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"With this move, the Biden Administration is signifying that lawful immigration, protecting Americans, and securing our homeland are no longer its priorities.","date":"Wed Feb 09 20:59:03 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Great pictures, and thanks for the photobomb, coach! https://t.co/FKK8X7YtVb","date":"Wed Feb 09 17:39:58 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This policy tramples U.S. immigration law and threatens our national security. That is why I’ll be joining @MarcoRubio to put an end to this madness.","date":"Wed Feb 09 15:53:04 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Fentanyl overdoses are now the leading cause of death for people ages 18-45.\n \nThat’s ahead of COVID, cancer, heart disease &amp; automobile crashes.\n \nAmericans are dying every day. It’s time to secure the US-Mexico border &amp; end this crisis.\n\nhttps://t.co/aa7vbBHmZq","date":"Tue Feb 08 21:40:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, my report on the Biden Administration’s disastrous withdrawal from Afghanistan revealed nearly 9,000 Americans were left behind — far more than the White House claimed.\n \nThis is a failure of duty &amp; the US will have to deal with the fallout for years to come.","date":"Mon Feb 07 17:38:09 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thinking of taking a family vacation this year? Yellowstone National Park will begin taking campground reservations for 2022 starting February 14th – it’s never too early to book!","date":"Fri Feb 04 21:47:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As many as 60K jobs were lost because of Keystone’s cancelation. Meanwhile, Russia continues to build its Nord Stream 2 pipeline.\n\nThe Defending Keystone Jobs Act I intro'd yesterday would require the administration to report just how many jobs were erased.https://t.co/uIUWbLs7zR","date":"Thu Jun 10 15:16:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As the 2022 Winter Olympics get underway, I’d like to extend my best wishes to the @TeamUSA athletes representing Idaho.\n\nChase Josey (Hailey, ID) - Halfpipe 🏂\nHilary Knight (Sun Valley, ID) - Hockey 🏒\nAndrew Blaser (Meridian, ID) - Skeleton 🛷\n\nMake Idaho proud! https://t.co/LcGt1zcjTY","date":"Fri Feb 04 16:57:14 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There’s real motivation among the mining industry &amp; conservation community to remedy the environmental challenges created by long-abandoned mines. That's why I’ve introduced the Good Samaritan Act with @MartinHeinrich to allow this important work to go unimpeded.","date":"Thu Feb 03 20:56:37 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/nCrM73U33S","date":"Thu Feb 03 20:56:37 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure to meet with Idaho State Rep. Marco Erickson &amp; Community Youth in Action representatives from Idaho Falls. CYA works to empower our youth through action &amp; service to build healthy communities throughout southeastern Idaho.\n\nIt is truly the Lord’s work. https://t.co/m1MXY6rnsS","date":"Thu Feb 03 18:04:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The US is reliant on countries like #China for 35 minerals crucial to our economy &amp; defense capabilities. Not only is this a supply-chain concern, it's a national security concern.\n \nWe must prioritize developing domestic deposits &amp; improving our production of #criticalminerals.","date":"Wed Feb 02 22:25:45 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Redox Bio-Nutrients on being named the February Small Business of the Month! \n\nRedox's groundbreaking developments in soil treatment solutions have a real impact on the world &amp; they are a prime example of Idaho’s global reach.\nhttps://t.co/R1AF1AvK8M","date":"Wed Feb 02 19:12:16 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday, the US national debt surpassed $30,000,000,000,000.\n \nThis uncontrollable spending threatens our future generations. Like hardworking Idahoans, the federal government must prioritize, budget &amp; stop recklessly swiping the credit card.","date":"Wed Feb 02 16:58:32 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Hilary is one of three Idahoans who will represent @TeamUSA in the Winter Olympics. Idaho will be watching closely as U.S. women’s hockey goes for gold.","date":"Tue Feb 01 19:08:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Coach is spot on. \n \nFarm expenses rose at an alarming rate in 2021 &amp; Idaho’s farmers &amp; ranchers are feeling the squeeze. It’s crucial we fight this record inflation &amp; stop punishing the people putting food on our tables. https://t.co/vjalND9wsA","date":"Tue Feb 01 16:40:56 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This year’s Winter Olympics is being held in a high-risk &amp; potentially dangerous political environment – please be careful, and be aware.\n\nMy latest op-ed w/ @NikkiHaley. ⬇️","date":"Mon Jan 31 22:18:10 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you to the men &amp; women of the @IDNationalGuard for once again stepping up to help keep Idahoans safe &amp; healthy during these challenging times.","date":"Mon Jan 31 20:36:57 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s hardworking families simply cannot afford this.","date":"Fri Jan 28 20:10:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On the 77th International #HolocaustRemembranceDay, we remember the millions of lives that were lost during one of the darkest times in human history. We must never forget the tragedies of the Holocaust &amp; work to stomp out antisemitism &amp; hate where it takes root. #WeRemember https://t.co/ouNJGEoOdr","date":"Thu Jan 27 20:53:04 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Senate internships provide Idaho’s rising leaders with firsthand experience in public policymaking &amp; a front-row seat to view our democracy in action.\n\nI’m glad to welcome my Spring 2022 interns &amp; I am confident they will serve #Idaho well. https://t.co/VB3ubNBpGy","date":"Wed Jan 26 21:38:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The current situation in #Ukraine is a different ball game than when Putin invaded Crimea in 2014. The world is fired up about this.\n\nThe United States stands with Ukraine. 🇺🇸 🇺🇦 https://t.co/A8IU2JTMvq","date":"Wed Jan 26 18:54:56 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🚨The 2022 tax season begins today.🚨 \n\nThis year, the IRS is recommending Americans file electronically to avoid delays. For more information &amp; frequently asked questions, visit https://t.co/o7rjLlFCHU.","date":"Mon Jan 24 18:51:02 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There is an unprecedented crisis at the US-Mexico border. That’s why I joined @SenRickScott &amp; 100+ of my Republican colleagues in requesting an investigation into the administration’s failures at the southern border.\n\nThe American people deserve answers.\nhttps://t.co/Bv7nPO7SQ8","date":"Fri Jan 21 21:05:34 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, thousands of Americans from around the country will arrive in Washington, D.C. to #MarchForLife &amp; advocate for those who cannot yet speak. This is #WhyWeMarch. https://t.co/HPofo3tGwc","date":"Fri Jan 21 18:33:05 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@john_c_wagner is right.\n \nNuclear power is vital to U.S. energy and national security. The United States must act with urgency and be bold on #nuclear now.","date":"Thu Jan 20 21:39:28 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As we approach the 2022 @March_for_Life, I am pleased to receive another A+ rating from @SBAList. Life is our most basic right &amp; I will continue to fight for the unborn in the U.S. Senate. https://t.co/u90emPXtE2","date":"Thu Jan 20 19:37:19 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@JimInhofe and I will be leading a press conference with our @SenateForeign and @SASCGOP colleagues to address the ongoing situation in Ukraine and the United States’ response. \n\nTune in. ⬇️","date":"Wed Jan 19 16:02:10 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I don’t agree with Chuck Schumer very often, but I am in complete agreement with his previous statements on the filibuster.\n\n https://t.co/fQeUZAeQTI","date":"Tue Jan 18 21:56:30 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to strong leadership at the state &amp; local levels, Idaho remained open throughout the pandemic. The results? The fastest job recovery in the country &amp; the largest budget surplus in state history.","date":"Tue Jan 18 19:08:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we celebrate the life of the great Reverend Doctor Martin Luther King, Jr. Dr. King showed us that we are better together than apart &amp; the legacy he left behind will never be forgotten. https://t.co/EqPH6RkDIT","date":"Mon Jan 17 16:27:11 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tax season is right around the corner.\n \nAs you prepare to file your taxes this year, the IRS is recommending you do so online to avoid delays. To learn more, visit https://t.co/o7rjLlFCHU.","date":"Fri Jan 14 00:03:00 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The same people trying to blow up the filibuster gave all sorts of flowery speeches just a few years ago about what a wonderful tool it is &amp; how it should never go away.\n \nThis is a self-control issue – just because you have the power to do something doesn’t mean you ought to.","date":"Thu Jan 13 16:10:42 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Just a week into the Horse Boss Challenge, Payton Woodward of Ashton endured an injury that would sideline her from riding for more than a year. Less than a month later, she was honored as the competition’s winner.\n\nA true story of grit &amp; perseverance.\nhttps://t.co/LvUhjWxI4R","date":"Wed Jan 12 22:44:32 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From Moscow, Idaho to the International Space Station, the next generation of @uidaho students continue to impress. Congratulations!","date":"Wed Jan 12 18:25:08 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Prices are rising at the fastest rate in 40 years &amp; working families are struggling to afford basic necessities. The reckless spending must stop.","date":"Wed Jan 12 15:53:24 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This afternoon, @GovernorLittle laid out his “Leading Idaho” plan to increase prosperity &amp; continue building on a year of record-breaking success. The State of the State is strong.\n \nWell done, Governor Little.","date":"Mon Jan 10 23:01:01 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I am pleased to announce Jacobs Lumber Company in Kamiah as the January #SmallBusiness of the Month.\n\nAn excellent example of how small businesses make the wheels turn in Idaho, Jacobs Lumber Company is working to house the next generation of Idahoans.\nhttps://t.co/GmPuqF7tZo","date":"Mon Jan 10 19:32:12 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’ll be like I never left Idaho.","date":"Mon Jan 03 21:46:18 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; I were saddened to learn of the passing of our friends Don &amp; Beverly Burtenshaw over the holidays. Don &amp; Beverly were our close friends, trusted confidants &amp; most importantly, good people who loved their home state of Idaho. They will be missed.\nhttps://t.co/qoty9qj9jj","date":"Mon Jan 03 19:38:29 +0000 2022","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and I wish everyone a safe and healthy holiday as you celebrate with your loved ones. \n\nMerry Christmas and God bless! https://t.co/3fZIIclWzI","date":"Sat Dec 25 16:16:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Christmas is right around the corner – what better way to spread the holiday spirit than to #SupportLocalGems? This season, #shopsmall &amp; make a small business’ day. https://t.co/0DIeb2lZ7K","date":"Tue Dec 21 23:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Welcome, coach! #GoVandals","date":"Tue Dec 21 19:14:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This weekend, as you finish up your holiday shopping, show your support and stop at one of the small businesses that make our state so special. No contribution to Idaho’s #smallbusiness community is too big or too small. #SupportLocalGems https://t.co/kX7peouWWc","date":"Fri Dec 17 23:25:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It makes things worse, in fact.","date":"Thu Dec 16 18:10:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats tried to put a 50-pound plan into a 10-pound bag, and it didn't work. That's not a recipe for getting things done.","date":"Thu Dec 16 14:25:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses are the backbone of Idaho’s economy, but this year has been tough for them. From supply chain issues to rising inflation, there are new challenges they must work to overcome in order to survive.\n\nThis holiday season, join me in our effort to #SupportLocalGems. https://t.co/jboAfQRyFj","date":"Wed Dec 15 22:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The average American household will have to spend roughly $3,500 more to keep up with inflation this year.\n \nDemocrats’ reckless tax-and-spend package stands to only make things worse. (Via Penn Wharton @BudgetModel)","date":"Wed Dec 15 20:07:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The FY 2022 NDAA ensures our military has the resources it needs to defend the country, provides servicemembers with a well-deserved pay raise, and strengthens U.S. preparedness in the face of mounting provocations from adversaries. I’m proud to support it. https://t.co/PXSJfm7L1J","date":"Wed Dec 15 17:21:48 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"November inflation was up 6.8%. Now, producer prices are up 9.6%.\n \nEconomic indicators are telling us to pump the breaks on government spending, yet Democrats continue to ignore them to satisfy an arbitrary deadline.","date":"Tue Dec 14 21:14:21 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The best gift the Biden administration could give the American people is to accept responsibility for its policies that are harming small businesses and families, then get to work on making things right.\n\nMy op-ed in @IdahoStateJ:\n\nhttps://t.co/qRvvagN4o0","date":"Tue Dec 14 19:11:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses don’t have the same resources to weather inflation &amp; supply chain crises as the big-box stores. This holiday season, stop by your favorite local shop &amp; support Idaho’s #smallbusiness community. \n\nThere are many ways to #SupportLocalGems. https://t.co/4Hw1J9wvJG","date":"Mon Dec 13 22:37:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Sunsetting programs you fully intend to reauthorize to lower cost projections is the oldest budget gimmick in the book.\n \nDemocrats are misrepresenting the true cost of their Build Back Better plan.","date":"Mon Dec 13 19:51:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For 385 years, the @USNationalGuard has stood ready to protect Americans from domestic threats &amp; support missions abroad. Thank you to our nation's guardsmen &amp; women – including the thousands of Idahoans serving in the @IDNationalGuard #Guard385 https://t.co/yEi7rRflVD","date":"Mon Dec 13 18:54:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This holiday season, don’t forget to show love to the local shops that make #Idaho’s communities so vibrant. \n\nMake a small business’ day &amp; #SupportLocalGems. https://t.co/3RV9dQmqNP","date":"Fri Dec 10 22:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last time inflation was this high, M*A*S*H &amp; Three’s Company were still on television.","date":"Fri Dec 10 18:23:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/6S2rranGdf","date":"Thu Dec 09 17:43:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses in Idaho have struggled to get meaningful answers on their EIDL applications from the SBA, which is why I've introduced the Streamlining EIDL Act with @SenatorHick to require the SBA to address their backlog &amp; provide timely responses to the program's applicants. https://t.co/SU8iJAoBl5","date":"Thu Dec 09 17:32:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on today’s vote to overturn the Biden administration’s vaccine mandate for private businesses: https://t.co/RahI6gMEQ6","date":"Thu Dec 09 01:28:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Access to clean drinking water is important for all communities.\n\nThat's why I joined @SenMarkKelly in introducing legislation that will help ensure rural communities throughout Idaho have access to modernized water treatment systems they need.\nhttps://t.co/APulRjo8np","date":"Wed Dec 08 21:35:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Americans are feeling the pressures of rising prices. The last thing they need is the Build Back Better inflation bomb.\n \nDemocrats need to pump the brakes on this reckless slush fund before they make it worse.","date":"Wed Dec 08 19:17:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden’s invite list to his Summit for Democracy has some head-scratchers. Inviting countries with questionable human rights records &amp; even more questionable democratic processes waters down the whole point of the summit.\n\nhttps://t.co/wWHiwSqO3t","date":"Wed Dec 08 16:26:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"80 years ago, our nation lost 2,403 souls on a day which will live in infamy.\n \nThis #PearlHarborRemembranceDay, we remember &amp; honor the brave Americans who sacrificed their lives protecting the very freedoms we are so blessed to enjoy today. https://t.co/f0U8SvPSYr","date":"Tue Dec 07 22:07:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure to speak at the @Heritage Foundation about the importance of nuclear deterrence in the international community. Thank you for having me! https://t.co/7OD2tt5623","date":"Tue Dec 07 19:57:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Under Republicans’ Tax Cuts &amp; Jobs Act, Americans making between $15,000 and $50,000 saw an average tax cut of 16 to 26 percent.\n\nDemocrats’ Build Back Better plan will award billions in tax deductions to the wealthy.\n\nLet’s not confuse which party has working families’ backs.","date":"Mon Dec 06 18:03:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Bob Dole was an American hero &amp; an exceptional human being. He will be missed. https://t.co/PrJkPOS2vX","date":"Mon Dec 06 15:17:45 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s #smallbusiness community is facing supply chain issues, rising inflation &amp; more. As you do your holiday shopping this weekend, remember to stop by a local retailer &amp; give back to one of the small businesses that give our state its sense of identity. #SupportLocalGems https://t.co/6FCXvhle3n","date":"Fri Dec 03 23:39:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday, @IdahoCommerce &amp; I launched the second annual #SupportLocalGems: All Season Long initiative. From dining at your favorite restaurant to purchasing a gift card from a local shop, there are many ways to support Idaho’s #smallbusiness community. https://t.co/Uf6ROqP5i7","date":"Thu Dec 02 23:03:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Breaking our country’s laws should not be rewarded – plain and simple.","date":"Thu Dec 02 20:34:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Lower-income families are experiencing the hardships of the Biden inflation tax &amp; Americans are concerned that this is just the beginning.","date":"Thu Dec 02 17:58:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Christmas tree lighting ceremony at the U.S. Capitol is one of the greatest traditions in Washington, D.C. The holiday season is truly upon us. https://t.co/ypBZ0wpowd","date":"Wed Dec 01 22:56:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🎁 It’s back! 🎁\n\nToday, @IdahoCommerce &amp; I are pleased to announce the return of the 2nd annual #SupportLocalGems: All Season Long initiative. Idaho’s small businesses give our communities a sense of identity &amp; we encourage you to give back to the gems that serve us every day! https://t.co/I1jp0oZeOb","date":"Wed Dec 01 19:11:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There are many ways to support small businesses. Find out how you can #SupportLocalGems: \n\nhttps://t.co/KdSQbvrJ38","date":"Wed Dec 01 19:11:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation isn’t transitory &amp; Americans are feeling the pressures of rising prices.","date":"Tue Nov 30 22:17:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’ve had the opportunity to meet with Enes to discuss #humanrights violations around the world. He is a bright young man who understands right from wrong &amp; I could not be happier for him. Congratulations, @EnesFreedom. 🇺🇸","date":"Tue Nov 30 18:41:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The United States is 1 of just 7 countries – including China &amp; North Korea – that allows elective abortions past 20 weeks. This is wrong.\n \nI pray our Supreme Court Justices make the right decision &amp; choose life. #ModernizeOurLaw\n\nhttps://t.co/YAaok7jbOc","date":"Tue Nov 30 16:35:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation is your unwanted guest this holiday season &amp; Democrats’ #BuildBackBroke plan will secure its place at the table year-round. \n\nThis is the wrong policy at the wrong time.","date":"Mon Nov 29 23:01:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In times of hardship, Idahoans stick together. A touching segment from @KTVB.","date":"Mon Nov 29 18:20:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idahoans are set apart by our self-reliance and our deep sense of community, especially during difficult times. I hope you’ll join me this #SmallBusinessSaturday – and through the holiday season – in supporting the Idaho small businesses that serve us every day. #SupportLocalGems https://t.co/zrsUwefruC","date":"Sat Nov 27 15:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From my family to yours, have a wonderful Thanksgiving, and God bless. https://t.co/fFfS4zYlEx","date":"Thu Nov 25 16:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, my Senate colleagues and I passed a bill to award the Congressional Gold Medal to the 13 heroes that were lost during the United States’ evacuation from Afghanistan. These men &amp; women represent America’s best &amp; they will not soon be forgotten.\nhttps://t.co/v3gNeGgwFY","date":"Wed Nov 24 20:07:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Insanity.","date":"Tue Nov 23 20:55:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden is actively obstructing domestic production &amp; is asking foreign producers to bail him out. \n\nReleasing a few days’ worth of oil into markets is not a “solution.” \n\nLet’s not lose sight of what caused gas prices to reach these levels.","date":"Tue Nov 23 17:08:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to sound conservative principles &amp; strong leadership from state officials like @GovernorLittle, Idaho continues to see economic prosperity &amp; is home to one of the most business-friendly climates in the country.\n\nLeaders in DC would be wise to take a page out of our book.","date":"Mon Nov 22 21:47:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Regulating a ditch as if it’s a major river would be laughable were it not for its crippling effect on Idaho’s farmers, ranchers &amp; landowners.\n\nThe Navigable Waters Protection rule signaled a restoration of common sense. This reversal will be devastating to our rural communities.","date":"Mon Nov 22 19:25:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is consistently ranked one of the best places to do business &amp; the success of our local gems is a testament to just that.\n\nhttps://t.co/BJdIjgiPul","date":"Thu Nov 18 20:06:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Republicans saw the signs of inflation, but Democrats brushed it off &amp; proceeded with their reckless spending agenda. Now, they claim their $1.75T social welfare package will reduce inflation. \n\nWhy would we listen to them again?","date":"Thu Nov 18 18:29:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This #NationalAdoptionMonth, I’m proud to join @RoyBlunt &amp; my Senate colleagues in introducing this resolution to honor those doing heaven’s work. Of all the blessings in life, there are none greater than family.","date":"Wed Nov 17 22:42:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From cost of travel to the price of turkey to heating your home, spending time with loved ones will cost more than ever this holiday season because of the Biden Administration’s tax-and-spend policies. https://t.co/Bu0JlLisDm","date":"Wed Nov 17 20:33:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation is crushing American families &amp; the President’s team doesn’t seem to care.","date":"Wed Nov 17 17:10:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It wouldn’t be Thanksgiving in the Treasure Valley without Kevin dressing up as a turkey.","date":"Wed Nov 17 16:26:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was good to see @INL Director @john_c_wagner during his visit to Washington, D.C. \n\nJohn took over as lab director in 2020 &amp; has carried on the Idaho National Lab’s mission to develop clean nuclear energy &amp; secure our critical infrastructure with proactive #cybersecurity. https://t.co/a9OF8EibNx","date":"Tue Nov 16 22:40:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on @POTUS meeting w/ President Xi:","date":"Tue Nov 16 18:43:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The more details Americans learn about the President’s Build Back Better bill, the more unpopular it becomes. It’s time for Democrats to pull their reckless spending spree before it does irreversible damage to our country’s economy.","date":"Tue Nov 16 17:03:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From the gas pump to the grocery store, Americans are experiencing the highest prices in 30 years. The last thing an overheated economy needs is more fuel for the fire.\n \nThis is the wrong bill at the wrong time.\n\nhttps://t.co/44JglxEzK1","date":"Mon Nov 15 21:34:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Words cannot capture the bravery &amp; selflessness of our men &amp; women in uniform.\n \nFrom the @SenateGOP, happy #VeteransDay to the nearly 20 million Americans – including 120,000+ Idahoans – who have so honorably answered the call to serve our country.\n\n https://t.co/x0uQ0Xm6bu","date":"Thu Nov 11 16:49:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For 246 years, the U.S. Marines have charged head-on into the unknown to protect our freedoms &amp; keep America safe from threats abroad. Today, we celebrate their bravery &amp; courage. #SemperFi","date":"Wed Nov 10 20:18:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We are seeing the highest levels of inflation in 30 years, yet Democrats insist on pushing their reckless spending spree through Congress. Americans cannot afford Democrats’ $1.75T inflation bomb.","date":"Wed Nov 10 16:42:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Jack Buell has been a strong advocate for North Idaho for decades. He served as Benewah County Commissioner from 1974 through 2020, Idaho’s longest-serving county commissioner.\n\nI was honored to recognize Jack’s leadership in the Congressional Record. Thank you, Jack! https://t.co/fetPssRCbY","date":"Tue Nov 09 20:20:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"All the best to the men &amp; women of the Idaho National Guard as they depart to Southwest Asia to support Operation Spartan Shield. Idaho stands with you &amp; we look forward to your safe return at the conclusion of this 12-month mission. God bless you all.\n\n📸: @IDArmyNationalG https://t.co/GY2eHuUpQN","date":"Mon Nov 08 22:11:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Criminal cartels are trafficking people &amp; deadly drugs across our southern border because the administration refuses to act.\n\nThe administration must step up &amp; address this crisis.","date":"Mon Nov 08 19:16:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Even with inflation at a 30-year high, Democrats still insist on pushing through their reckless social spending plan.\n \nNow is not the time to pass legislation that will raise costs &amp; burden American families.","date":"Thu Nov 04 18:41:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Rewarding illegal immigrants with hundreds of thousands of taxpayer dollars will only incentivize more illegal immigration &amp; increase the flow of illegal drugs across the border &amp; into states like Idaho. \n\nWe cannot allow this administration to pay people to break our laws.","date":"Thu Nov 04 16:14:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I had the opportunity to sit down with Fifty Flowers owner &amp; CEO Liza Roeser (@TheFlowerCEO) to discuss the challenges facing small businesses owners in Idaho.\n \nIt’s always good to see a fellow Idahoan in Washington, D.C. https://t.co/goPD56Y3j7","date":"Wed Nov 03 20:30:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The egregious federal overreach exhibited by the President's vaccine mandate unfairly burdens businesses &amp; endangers individual liberties. Getting vaccinated is a decision the federal government cannot make. Individuals must make this decision themselves.\nhttps://t.co/yQPA127MeN","date":"Wed Nov 03 18:14:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Florence’s Exquisite Chocolates &amp; its employees on being named the Idaho Small Business of the Month! \nhttps://t.co/c3ZtaCGTae","date":"Wed Nov 03 15:03:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since 1981, Florence’s Exquisite Chocolates has been a mainstay of downtown Rexburg. Having earned praise from former President Ronald Reagan, it has become a household name in Eastern Idaho &amp; beyond. https://t.co/sWqN9qx6gn","date":"Wed Nov 03 15:03:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and I are deeply saddened to hear of the news of Jean’s passing. Our prayers are with the Rounds family and their loved ones as they navigate this difficult time.","date":"Tue Nov 02 22:22:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Costs are skyrocketing &amp; working families are paying the price for the Biden administration’s inflation tax.","date":"Tue Nov 02 18:16:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Criminal cartels are taking advantage of the administration’s border policies. They are making millions of dollars every day trafficking deadly drugs across the southern border &amp; into states like Idaho.","date":"Tue Nov 02 14:31:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s small businesses are responsible for so much of the success the Gem State has experienced over the past decade. I’m proud to have helped to secure this grant that will help Idaho’s underserved small businesses continue to grow &amp; thrive. \n\nhttps://t.co/COpoaGQUAu","date":"Mon Nov 01 17:55:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Ever wondered what it’s like to live &amp; work in our nation’s capital? Internships on Capitol Hill are a great way to find out!\n \nThe deadline to apply for Winter 2022 internships in my DC office is Monday, November 1st. Those interested can apply here: https://t.co/k77bOXYZe6. https://t.co/LRWHOndOB0","date":"Fri Oct 29 21:03:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Military suicides have increased by 15%. This is a crisis that cannot be ignored.\n\nThat’s why I've joined @SenJoniErnst in introducing legislation to press the Pentagon to improve suicide prevention efforts &amp; ensure our servicemembers have the support they've rightfully earned. https://t.co/jpSv2wmNZs","date":"Fri Oct 29 18:20:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Biden administration wants to pay people who illegally crossed the border during the Trump administration $450,000 per person. This is insanity.\n\nhttps://t.co/ymt7rCS4yn","date":"Fri Oct 29 15:29:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In only nine months, this administration’s miscalculations have weakened our allies, emboldened our adversaries &amp; left Americans less safe. The administration must be accountable for its decisions &amp; it must do better.\n \nMy op-ed in @twinfallstn:\nhttps://t.co/xkA7BRjHRR","date":"Thu Oct 28 18:28:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The price tag of Democrats’ reckless tax-and-spend package may be lower, but the same socialist Green New Deal provisions remain. \n \nAmerica is in the midst of an energy crisis – now is not the time to abandon domestic production in favor of climate pipedreams.","date":"Thu Oct 28 15:47:31 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Despite a record-breaking surge in immigration, the administration continues to make it easier for people to enter and remain in the country illegally. This madness must stop now.","date":"Wed Oct 27 20:39:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America has been battling record-high inflation and an invasion of our southern border. Now, we’re facing an energy crisis.\n \nThe common denominator? The decisions being made by the current administration.","date":"Wed Oct 27 18:20:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Dishonoring America’s founding documents with “trigger warnings” to appease Democrats’ woke agenda is not only unacceptable – it’s downright shameful.\n \nThat’s why I’ve teamed up with @RogerMarshallMD and @RepDanCrenshaw to put an end to this madness.","date":"Wed Oct 27 15:26:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@INL continues to demonstrate why they are the nation’s flagship national laboratory. \n\nCongratulations on these prestigious awards!","date":"Tue Oct 26 20:54:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s businesses are feeling the squeeze of the supply chain crisis, resulting in empty shelves &amp; rising prices. Idahoans are struggling to make ends meet &amp; those in charge are nowhere to be found.\n \nYet another self-manufactured crisis the administration needs to address.","date":"Tue Oct 26 17:00:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We are #BoiseStrong.","date":"Tue Oct 26 14:40:58 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on today's events at the Boise Towne Square Mall: https://t.co/2avgf5OBzY","date":"Tue Oct 26 02:26:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I am monitoring the situation at the Boise Towne Square Mall. Vicki and my prayers are with all those involved, including our heroic law enforcement officers and first responders at the scene.","date":"Mon Oct 25 22:10:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"No one wants to see the use of nuclear weapons ever again. However, endorsing a sole purpose doctrine and surrendering our nuclear capabilities before the rest of the world agrees to do so will only destabilize the international system.\n \nMy op-ed in @defense_news:","date":"Mon Oct 25 17:54:06 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"During #NuclearSciWeek, find out how @INL is leveraging its unique capabilities &amp; talented workforce to solve some of our nation’s most pressing energy &amp; national security challenges:\n\nhttps://t.co/GTClogPF8j","date":"Fri Oct 22 21:33:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Ever wonder where the epicenter of nuclear research is? Look no further than Idaho – the birthplace of nuclear energy!\n \n#Nuclear is a clean, reliable source of energy that makes up more than half of America’s renewables &amp; provides the economy with valuable high-paying jobs. https://t.co/fRlfrzhtJZ","date":"Fri Oct 22 21:33:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For far too long, forest management has been handled with a one-size-fits-all approach. Thank you @EnergyGOP for holding a hearing on my FIRESHEDS Act, which will give states greater flexibility to target &amp; treat high risk hazardous fuels. https://t.co/KnpWste5PM","date":"Fri Oct 22 19:01:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Stacie Lawlor of Timberlake Junior High &amp; Jorge Pulleiro formerly of Wood River Middle School on being named the 2020 &amp; 2021 Idaho Teachers of the Year. Educators play a vital role in the lives of future generations &amp; Stacie &amp; Jorge are examples of just that. https://t.co/Xx1Z428LQs","date":"Fri Oct 22 16:22:31 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The entire Risch team gives special thanks to his radiation therapists Nicole, Trina &amp; Madison (pictured above), Dr. Smith &amp; the St. Luke’s Cancer Center staff for taking such good care of him over the last eight weeks. We all look forward to having him back in the saddle soon!","date":"Thu Oct 21 21:19:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My Idaho Chief of Staff &amp; longtime friend John Insinger just completed his cancer radiation therapy at @StLukesHealth Cancer Center under the care of Dr. Stephen Smith. https://t.co/fMdr6qVXHV","date":"Thu Oct 21 21:19:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The crisis at the southern border is the worst we’ve ever seen.\n\nhttps://t.co/RkX5FNsYo8","date":"Thu Oct 21 17:46:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Check out this fly-through of @uidaho’s newest facility: \n\nhttps://t.co/Mwd1TYG7mt","date":"Thu Oct 21 15:29:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"During #NationalForestProductsWeek, I’d be remiss not to highlight the new @Idaho_Central Arena. A first-of-its-kind engineered wood mass-timber facility, the ICCU Arena shows the continued growth of the timber industry in America.\n \nThis is innovation done the Idaho way. https://t.co/Tt934ncCHA","date":"Thu Oct 21 15:29:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s wildland firefighters risk their lives every fire season to protect ours. I’m proud to be a part of this bipartisan resolution honoring the frontline heroes who work to keep our communities safe.","date":"Wed Oct 20 21:23:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation is taxation.","date":"Wed Oct 20 18:06:47 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The IRS already knows how much money you make. How you spend your hard-earned money is none of their business. \n\nThis proposed reporting requirement is yet another example of an egregious overreach by this administration.","date":"Wed Oct 20 14:58:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats’ proposal requiring the IRS to collect even more bank account information from Americans is radical &amp; one of the most significant privacy invasions in American history.","date":"Tue Oct 19 15:03:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If it costs $0, then it wouldn’t have to be “paid for.”\n \nThe administration is misleading Americans about the real cost of their reckless spending plan.","date":"Mon Oct 18 20:03:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is experiencing the consequences of the administration’s failures at the U.S.-Mexico border. \n\nThe numbers speak for themselves.","date":"Mon Oct 18 15:28:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Idaho's healthcare workers are doing the Lord's work.\n \nTo our heroes on the front lines who are putting in grueling hours to care for those who are ill, I send my heartfelt thanks.","date":"Thu Oct 14 19:09:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, @IdahoStateU student Sasha Heyneman courageously put others ahead of herself &amp; saved the life of a stranger. Her heroism is truly a touching display of humanity.","date":"Wed Oct 13 20:03:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation under the Biden administration continues to surge, which means you: \n\n📈 Pay more\n📉 Save less\n\nAmericans cannot continue to bear the burden of the Democrats' inflation tax.","date":"Wed Oct 13 17:34:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From barley to spuds, Idaho is fortunate to have one of the strongest agriculture sectors in America. This would not be possible without the hardworking men &amp; women who drive the Gem State’s #ag production.  \n\nHappy #NationalFarmersDay to all of Idaho’s farmers!","date":"Tue Oct 12 21:33:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats may have confirmed Tracy Stone-Manning to lead the Bureau of Land Management, but make no mistake, her history of eco-terrorism &amp; perjury will continue to define her legacy. https://t.co/81675rJMGB","date":"Tue Oct 12 19:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The ribbon cutting of the @Idaho_Central arena represents a dedication to investing in our state’s institutions. Congratulations on the new arena @uidaho! \n \nOnce a Vandal, always a Vandal.","date":"Tue Oct 12 17:36:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure to sit down with the Mayor’s Youth Advisory Council of Caldwell this week to talk about the issues affecting the next generation of Idahoans.\n \nI left them with one final piece of wisdom: be kind to one another. https://t.co/sMH8L79AqV","date":"Fri Oct 08 20:26:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Iconic.","date":"Fri Oct 08 18:23:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The estimate was 500,000. Once again, the administration misses the mark.","date":"Fri Oct 08 14:21:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on tonight’s vote to temporarily raise the debt ceiling: https://t.co/z0lbqeFKFi","date":"Fri Oct 08 00:43:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Did the Biden administration improperly release thousands of migrants into the US? I sent a letter with @JohnCornyn to DHS Secretary Mayorkas seeking answers on this issue. https://t.co/BWa6OMItn5","date":"Thu Oct 07 19:28:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Service organizations play an important role in our communities &amp; the Idaho Falls @Rotary Club is an example of just that. \n\nhttps://t.co/GQt0Tn6K2I","date":"Thu Oct 07 17:22:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to fellow @uidaho alum &amp; St. Maries’ own Tom Mueller (@lrocket) on this distinct honor!\n\nhttps://t.co/K6XAdXghvK","date":"Wed Oct 06 22:20:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The numbers are astonishing. \n\nThe Biden administration’s unwillingness to handle this self-manufactured crisis is baffling. \n\nWell done @GovernorLittle for stepping up.","date":"Wed Oct 06 20:15:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Reckless government spending has consequences &amp; hardworking Americans bear the brunt.","date":"Wed Oct 06 16:44:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"These Western principles provide a commonsense outline of how we can conserve our natural environment &amp; our western way of life alike.\n \nI’m proud to be a part of this proposal that allows conservation to work in tandem with our agricultural &amp; natural resource industries.","date":"Wed Oct 06 14:23:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/upPXgJMy2h","date":"Tue Oct 05 21:52:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Nestled in the hills of Wallace, City Limits Brew Pub serves up quality food &amp; in-house craft beer that has established the restaurant as a Silver Valley favorite.   \n\nCongratulations to City Limits Brew Pub &amp; its employees on being named the Idaho Small Business of the Month! https://t.co/GP05mlfsCV","date":"Tue Oct 05 21:52:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration thinks they can spend trillions in a calendar year with no economic consequences. Hardworking American families cannot afford the Democrat-imposed inflation tax. \n\nRepublicans will not take part in making it worse.","date":"Tue Oct 05 18:35:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Customs and Border Patrol has apprehended more than 1.3 million illegal migrants at the southern border this calendar year. 400,000 more are on their way.","date":"Tue Oct 05 14:31:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A tax increase for some. An inflation bomb for all.","date":"Mon Oct 04 19:57:42 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation is crippling working families &amp; Democrats in Washington are ignoring it.\n \nWhy?\n \nBecause it doesn’t affect them.","date":"Mon Oct 04 17:05:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is open for business!","date":"Fri Oct 01 19:51:21 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The consequences of the Biden administration’s failure to secure the southern border reach far beyond the border states. Thank you to @GovernorLittle &amp; Idaho’s law enforcement officers for calling attention to this crisis.\n\nhttps://t.co/ogbKM0X3A8","date":"Fri Oct 01 15:06:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If this is the person Democrats &amp; the President of the United States want to be remembered as the legacy of this administration – a perjurer, an eco-terrorist, a person who participated in a conspiracy to kill people working in the forest – then here she is, Tracy Stone-Manning. https://t.co/l0rYD0TFov","date":"Thu Sep 30 23:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our friends, our neighbors &amp; innocent men &amp; women. \n \nThat’s who Tracy Stone-Manning &amp; her friends targeted in the Clearwater National Forest tree-spiking operation. Her nomination should never have made it this far &amp; I'm calling on my colleagues to vote no on her nomination. https://t.co/81UlXKHET5","date":"Thu Sep 30 21:25:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Lying to the United States Senate is a crime. If she is comfortable lying to the federal government—and the American people—under penalty of perjury, how can we trust her to lead a powerful bureaucracy?”\n\nTree-spiking investigator on Tracy Stone-Manning:","date":"Thu Sep 30 19:34:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This grant from @NSF is a smart investment. Great news! @uidaho","date":"Thu Sep 30 17:35:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The headlines speak for themselves. https://t.co/4So5RKDb3J","date":"Thu Sep 30 16:00:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was great to sit down for an in-person interview with NewsTalk 107.9’s Neal Larson this morning in Washington, D.C.\n \nThanks for coming out, Neal! https://t.co/AUJnLmb5so","date":"Thu Sep 30 15:00:31 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Proud to see my alma mater @uidaho be a leader in showcasing Idaho forest products &amp; #MassTimber with this one-of-a-kind arena. Go Vandals!","date":"Wed Sep 29 22:22:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tracy Stone-Manning:\n \n❌ Conspired w/ eco-terrorists\n❌ Threatened federal employees\n❌ Lied to Congress\n \nThis is the person the President nominated to lead @BLMNational. Confirming her would be a huge mistake. I urge my Democrat colleagues to vote no.","date":"Wed Sep 29 17:00:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Radical policies &amp; government handouts. A lot of them. \nhttps://t.co/i1ZVl7nsxd","date":"Wed Sep 29 15:13:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"That is why @RogerMarshallMD, @RepDanCrenshaw &amp; I have introduced the National Treasures Act. This legislation will bar the National Archives and Record Administration from mislabeling our founding documents.\n\nhttps://t.co/Gd9Rc0mO2A","date":"Tue Sep 28 19:50:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our Constitution, Bill of Rights, and Declaration of Independence are among the most magnificent documents ever written – dishonoring them with \"trigger warnings\" to appease Democrats’ woke agenda is a serious miscalculation. https://t.co/9lhu2o0vh1","date":"Tue Sep 28 19:50:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Proud to see the continued growth &amp; success of one of the Idaho Small Businesses of the Month. Keep up the good work, @CF3DPrinting!","date":"Tue Sep 28 17:47:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Looks like ski season is going to start early in Idaho!","date":"Tue Sep 28 16:47:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We continue to see the grave implications of the haphazard withdrawal from Afghanistan, which is why I’ve introduced the #Afghanistan Counterterrorism, Oversight &amp; Accountability Act to address the Biden Administration’s shortfalls &amp; rebuild the United States’ credibility.","date":"Tue Sep 28 15:04:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If Democrats want to raise the debt ceiling to proceed with their irresponsible tax-and-spend spree, then they will have to do it themselves. Republicans will not assist in jeopardizing America’s economic future.","date":"Mon Sep 27 22:41:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"At the cost of forcing through radical priorities, basic legislation has fallen by the wayside under Democrats’ watch. With the White House, Senate &amp; House controlled by Democrats, this last-minute scramble falls on them.","date":"Mon Sep 27 19:35:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What started as a crisis has turned into a full-blown disaster. It’s time for the Biden administration to acknowledge its failures, work with Republicans to reinstate effective border measures &amp; put national security first.\n \nMy op-ed in @TheIdahoPress:\nhttps://t.co/i13z6pcfuY","date":"Mon Sep 27 16:14:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"$3.5T may be the sticker price of the Democrats’ reconciliation package, but the numbers go far beyond what they’re advertising. \n\nhttps://t.co/gJkQDQkqmg","date":"Fri Sep 24 20:08:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats have the White House, Senate and House – if they want to increase the debt ceiling to proceed with their reckless tax-and-spend spree, then they will have to do it themselves.\n \nThe @SenateGOP will not assist in jeopardizing America’s economic future.","date":"Thu Sep 23 18:53:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We are at a breaking point. The administration cannot continue to ignore this border crisis. https://t.co/lVQUsBWBbc","date":"Thu Sep 23 15:48:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There are cartels smuggling people &amp; deadly drugs into our country, but the Biden administration is directing @CBP &amp; @ICEgov agents to go after refrigerant smugglers.\n \nThis is deflecting from the real issue. https://t.co/3lEC63n090","date":"Thu Sep 23 15:25:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats have been so focused on implementing their radical policy agenda that basic legislation has fallen by the wayside.","date":"Wed Sep 22 21:42:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Raising taxes on producers who employ millions of Americans is a recipe for disaster. \nhttps://t.co/hAMjKDouYJ","date":"Wed Sep 22 20:49:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was great to see my friend and former Idaho Governor Butch Otter in Washington, D.C. this morning.\n\nThanks for making it out, Butch! https://t.co/4JGF3QYQ5D","date":"Wed Sep 22 17:52:32 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Every major foreign policy issue this administration touches turns to ash. The Biden administration must do better if they want the U.S. to remain the leader of the free world.\n \nMy op-ed in @dcexaminer:\n\nhttps://t.co/nrZpaRI9Hn","date":"Wed Sep 22 15:06:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration’s unwillingness to address the ongoing situation at the southern border has caused a humanitarian &amp; national security crisis. \n\nI applaud @GovernorLittle for holding the White House accountable.","date":"Tue Sep 21 19:17:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This humanitarian crisis is a direct result of the Biden Administration’s policy failures &amp; rhetoric. Conditions at our southern border continue to deteriorate &amp; it’s past time the administration steps up &amp; resolves the crisis they created.","date":"Tue Sep 21 15:27:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and I are saddened to hear the news of Louise McClure’s passing. Louise was a sophisticated woman and a loving and steadfast partner to former Idaho Senator Jim McClure for over 60 years. Her love of Idaho and its people was unmatched, and her legacy will carry on.","date":"Mon Sep 20 22:04:03 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It makes me proud to see @uidaho forestry students practice active forest management – something I have been advocating for years. Very well done!\nhttps://t.co/dt1LoKaYQo","date":"Mon Sep 20 18:57:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The debacle in Afghanistan is an interagency failure &amp; we must hear from all relevant officials in order to hold the right people accountable.\n\nhttps://t.co/CKobuwhEed","date":"Mon Sep 20 16:34:48 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I was honored to attend the Pocatello temple dedication for the Church of Jesus Christ of Latter-day Saints today. https://t.co/MU2IUhRAE2","date":"Fri Sep 17 22:35:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today our thoughts are with the 358 Idahoans &amp; 80,000+ Americans held POW &amp; MIA.\n \nWe will never forget our nation’s POW/MIA &amp; their loved ones. https://t.co/KR8htxE1gg","date":"Fri Sep 17 16:08:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy birthday to my friend &amp; colleague @ChuckGrassley!","date":"Fri Sep 17 13:52:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, I welcomed three interns to my Washington, D.C. office. These young professionals are well-prepared to serve in this role &amp; I am confident they will do an excellent job.\n\n🔗https://t.co/L1149gQycx https://t.co/FLSSthufw1","date":"Thu Sep 16 21:46:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration claims to have evacuated 6,000+ American citizens from #Afghanistan, yet the number of Americans they said were on the ground far exceeds that number.\n \nWhat happened to the rest of them? https://t.co/gTKQn998Oy","date":"Thu Sep 16 18:40:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It is unfortunate to see this kind of censorship of lifesaving information.","date":"Thu Sep 16 15:56:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Wishing a peaceful Yom Kippur &amp; an easy fast to all those observing this High Holiday. #GmarChatimaTova https://t.co/vLu8siRgzl","date":"Wed Sep 15 21:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"These men &amp; women made the ultimate sacrifice for our country. Their legacies will not be forgotten.","date":"Wed Sep 15 18:59:47 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"While the administration pats themselves on the back, the question must be asked: who was a part of the decision-making process that led up to the disastrous withdrawal from #Afghanistan? https://t.co/znzwJejthz","date":"Wed Sep 15 17:07:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was a pleasure. Thanks for having me on!","date":"Wed Sep 15 13:52:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Somebody in the White House is making these decisions. Who is it?\n\nhttps://t.co/oAfa1heKQa","date":"Tue Sep 14 21:36:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The American people want to know who is responsible for the disastrous withdrawal from #Afghanistan. https://t.co/aBf08hHavW","date":"Tue Sep 14 18:11:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🚨Happening now🚨","date":"Tue Sep 14 14:14:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Given that countless businesses are still reeling from the economic impacts of the pandemic, it is imprudent to raise taxes on the very entities needed to power our recovery.”\n \nA great piece from @TheHillOpinion:","date":"Mon Sep 13 21:22:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Terrorism is as real today as it was in 2001. We must have an effective counterterrorism capability that will prevent terrorists from planning new attacks against the US &amp; our partners.\n\nJust because the war is over doesn’t mean the battle is won.\nhttps://t.co/YDP38I6jrV","date":"Mon Sep 13 18:34:42 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It was great to be back at the @uidaho forestry camp on Payette Lake. What memories come back as I stand here in front of the bell that called us for dinner.\n\nThanks to Gary Thompson for bringing me up to speed about how they have expanded the program since I’ve been here. https://t.co/3MENNObBt7","date":"Fri Sep 10 22:03:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is the largest annual producer price index increase since the early days of the Obama administration.\n\nhttps://t.co/XbA41MjpLg","date":"Fri Sep 10 18:30:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The #BidenBorderCrisis continues.","date":"Wed Sep 08 22:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The record-high inflation we are seeing is a result of the administration’s policies &amp; it is disingenuous to claim otherwise.\n\nhttps://t.co/V133KnRBGw","date":"Wed Sep 08 19:14:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Obama-Biden #WOTUS Rule is a perfect example of harmful federal overreach that would place burdensome regulations on #ag producers in Idaho &amp; nationwide. A return to this misguided rule would be a disaster.\n\nhttps://t.co/zzLmNc5qJM","date":"Tue Sep 07 21:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our @CBP officers deserve better.","date":"Tue Sep 07 19:02:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Terrorism is as real today as it was on September 11th, and as we confront a new reality in which it again rules Afghanistan, the dangers to America will only grow.\n\nhttps://t.co/8ccuE3hZuZ","date":"Tue Sep 07 17:15:56 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Looks fantastic!","date":"Fri Sep 03 22:33:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Once again, the administration misses the mark – this jobs report is disappointing to say the least. \nhttps://t.co/UErd30g9Bq","date":"Fri Sep 03 20:04:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"One of the most important functions of a congressional office is to assist our constituents when they need help.\n\nMy staff worked successfully to get EVERY single Idahoan out of Afghanistan. I’m relieved our fellow Idahoans are safe &amp; I could not be prouder of my incredible team.","date":"Fri Sep 03 15:08:06 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"76 years ago, Imperial Japan formally surrendered aboard the USS Missouri, marking the end of World War II. Thanks to the brave American &amp; Allied soldiers serving in the Pacific theater, the world was made a safer place. https://t.co/X2lve2vgfA","date":"Thu Sep 02 20:20:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to the Pocatello rail port, Idaho will have increased market access around the world. A big win for Idaho’s #ag producers!  \n\nhttps://t.co/onXoCnYiuY","date":"Thu Sep 02 17:40:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Amid the chaos that has unfolded in #Afghanistan, the sacrifice of the millions of servicemembers who served in the region has not been forgotten. These men &amp; women served with honor &amp; America owes them all a debt of gratitude.","date":"Thu Sep 02 14:41:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Alexander Davis Men’s Clothing on being named the Idaho Small Business of the Month! \n\nA mainstay in downtown Boise since 1891, @ADMensClothing embodies the longstanding tradition of #SmallBusiness in Idaho. https://t.co/34idJQUO7m","date":"Wed Sep 01 20:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There is *still* a crisis at the southern border &amp; people’s lives are at risk.\n\nhttps://t.co/quAnTsu70F","date":"Wed Sep 01 17:15:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"More than 2 million veterans served during the Global War on Terrorism, including more than 800K in Afghanistan. These service members deserve the support they need.\n \nI joined my Senate colleagues in requesting the VA accelerate its efforts to provide resources to those in need.","date":"Wed Sep 01 15:25:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Time &amp; time again, the Idaho National Lab demonstrates why they are an industry leader &amp; America’s flagship national laboratory. Congratulations to @John_c_wagner &amp; everyone at @INL on these prestigious nominations!","date":"Tue Aug 31 20:17:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Eagle’s own Kate Shoemaker &amp; @USequestrian on taking home bronze at the Paralympic Games! This is Kate’s first medal &amp; Idaho could not be prouder.","date":"Tue Aug 31 17:25:56 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden &amp; his team’s disastrous withdrawal over the last several weeks has failed to guarantee America’s safety &amp; left countless Americans, close Afghan partners &amp; other allies to an unknown and dangerous fate.\n \nThis rushed &amp; chaotic withdrawal did not have to happen.","date":"Tue Aug 31 15:25:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Meridian native Kory Puderbaugh &amp; @usawchrugby on taking home silver at this year’s Paralympic Games!","date":"Mon Aug 30 17:26:48 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This loss continues to weigh heavy on my heart. These brave men &amp; women truly represent America’s finest. \n\nGod bless our fallen servicemembers &amp; may their souls rest in His kingdom for eternity.","date":"Mon Aug 30 15:52:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since arriving in the United States as a young boy, Kory “Spiggy” Puderbaugh has called #Idaho home. Now, he’s set to participate in his second Paralympic Games.\n \nGood luck to Kory &amp; all of @TeamUSA as they compete in this year’s @Paralympics. https://t.co/gdhm0FllCw","date":"Tue Aug 24 15:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, ten Idahoans were presented with the Gem State’s highest honor for their exceptional courage &amp; bravery while protecting the public.\n \nCongratulations to the first responders on receiving the Idaho Medal of Honor.  \n\nhttps://t.co/bTkCVlAz0B","date":"Mon Aug 23 15:51:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thousands of American citizens are desperately trying to get out of #Afghanistan. The administration‘s failure to ensure the safety of Americans &amp; our allies is unacceptable.","date":"Fri Aug 20 19:37:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"At 19 years old, Hugh Mayes enlisted with the @USArmy Air Corps &amp; served as a nose gunner on a B-24 Liberator. Nearly 79 years later, his sights are still on the sky.\n \nStories like Hugh’s remind us all what it means to serve.\nhttps://t.co/vpAxIt0tRY","date":"Fri Aug 20 15:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to coach Alexander &amp; the @Ifbandits on back-to-back @AmericanLegion World Series Championships!","date":"Thu Aug 19 18:06:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There is currently a bomb threat at the Library of Congress.\n\nI am praying for the safety of the FBI agents, DC Metro Police officers &amp; Capitol Police officers who are on the scene.","date":"Thu Aug 19 15:45:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Biden administration’s failure to develop a plan to withdraw from Afghanistan will have lasting consequences. This rushed &amp; political decision will allow Afghanistan to serve as a future platform for terrorist attacks against the United States &amp; our partners.","date":"Thu Aug 19 13:17:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This outcome has failed to guarantee America’s safety.\nhttps://t.co/RCJ1bKE8kL","date":"Thu Aug 19 13:17:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"While Democrats enact inflationary economic policies that will never affect them, hardworking Americans making an honest living are trying their best to make ends meet.\n \nFrom @WSJ: \nhttps://t.co/ya3WkOohjk","date":"Tue Aug 17 20:20:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My staff had the opportunity to present K&amp;T Steel in Twin Falls with a Congressional Record Statement honoring them as the Idaho Small Business of the Month for August.\n \nCongratulations Gary and Jamin, and thank you for all you do for the Magic Valley! https://t.co/46SgwSnYna","date":"Tue Aug 17 17:26:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"President Biden is not the first president to move toward an exit in Afghanistan, but he is the first to do so without any clear plan to protect our interests, our citizens &amp; our closest friends.\n \nThe administration must answer for this. It didn't have to be this way.","date":"Tue Aug 17 13:32:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Crime is rising in Democrat-run cities across the country. We should put our full support behind America’s law enforcement officers, not cut their funding.\n \nVirtue signaling won’t keep our communities safe – only the brave can.\nhttps://t.co/JLS5YHCSkS","date":"Mon Aug 16 17:55:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The men &amp; women who keep our communities safe deserve our support. In Idaho, we #BackTheBlue.","date":"Mon Aug 16 15:39:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Drug cartels &amp; smugglers see the chaos at the US-Mexico border as an invitation. These are the consequences of the #BidenBorderCrisis.","date":"Fri Aug 13 21:35:06 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Liberals in Washington, D.C. may not notice higher prices at the gas pump &amp; grocery store, but Idahoans do.\n\nhttps://t.co/YrccHqFCC2","date":"Fri Aug 13 17:54:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s no surprise that Tracy Stone-Manning is trying to hide from her past – most criminals do. \n\nSurely, there is a qualified nominee to lead the Bureau of Land Management who hasn’t conspired with eco-terrorists.\nhttps://t.co/HEGgi4VZ0l","date":"Thu Aug 12 20:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The cause? Out-of-control spending &amp; restrictive policies driving up the cost of energy. \n\nAmericans can't afford to keep footing the bill for the administration's mistakes. \n\nhttps://t.co/uRTrfmLOVi","date":"Thu Aug 12 16:23:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Battling #wildfire requires an all-hands-on-deck approach. Thank you to the @RedCross for all they are doing to support Idaho’s wildland firefighters &amp; Pacific NW communities. @RedCrossIdaho","date":"Thu Aug 12 14:16:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The federal government cannot continue spending at current levels – it’s unsustainable.\n \nIf Democrats want to raise the debt ceiling so they can continue their reckless spending, they’ll have to do it alone.\n\nhttps://t.co/1MMwG9ezuh","date":"Wed Aug 11 20:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On this week’s Ruthless Podcast, @MikeCrapo breaks down the bad tax provisions in Democrats’ reckless $3.5 trillion tax-and-spend agenda.\n \nGive it a listen. 👇","date":"Wed Aug 11 17:11:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats have laid out their vision for America: they want to transition the United States from a capitalist country to a socialist one. Today, they voted to turn their socialist rhetoric into reality. \n \nMy statement: https://t.co/IrEiMdTtw6","date":"Wed Aug 11 13:26:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For the past six hours, Republicans have offered amendments to push back on Democrats’ reckless $3.5 trillion tax-and-spend spree. \n\nThe @SenateGOP will continue fighting this liberal wish-list.","date":"Tue Aug 10 23:32:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Higher taxes. Higher inflation. Higher cost of living. \n\nDemocrats’ $3,500,000,000 tax-and-spend spree will be paid for by hardworking Americans &amp; generations to come.","date":"Tue Aug 10 20:02:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Careless. Wasteful. Senseless.","date":"Tue Aug 10 18:39:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Senators had two choices: this $550B package with no tax increases, or allow Dems to increase the $550B to $2.5T, raise taxes &amp; pile it onto their $3.5T social spending spree. On behalf of Idaho, I chose to support the investment in hard infrastructure.\n\nMy statement: https://t.co/He7LJYHv8V","date":"Tue Aug 10 16:19:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration’s rhetoric doesn’t match up with their actions. They claim they have a strategy for addressing the crisis at the border, yet repealed effective measures that disincentivized mass migration, giving a green light to anyone who wants to enter the US illegally.","date":"Tue Aug 10 14:08:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It is unacceptable to allow the fire season to become a year-round risk when we have tools at our disposal to reduce &amp; prevent fires. Our forests are burning, and there’s no time to waste.\n \nMy op-ed w/ @RepWesterman:\n\nhttps://t.co/HczvEReW8t","date":"Mon Aug 09 19:11:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Great scenes from the War Bonnet Round Up – a longstanding Idaho tradition!","date":"Fri Aug 06 17:35:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today I presented my personal office interns with certificates congratulating them on completing their summer session on Capitol Hill. I’m proud of this group of young people &amp; I look forward to seeing what they accomplish as they take their next steps in life. https://t.co/fnyh9ZamA3","date":"Thu Aug 05 21:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America needs a Versatile Test Reactor for advanced #nuclear testing to help us become self-sufficient in modernizing our clean-energy sector.\n \nLuckily, @INL is leading the charge in developing a VTR","date":"Thu Aug 05 18:59:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/p7GKkj8faZ","date":"Thu Aug 05 16:27:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Two years after collaborating with eco-terrorists, the administration’s pick to lead the Bureau of Land Management, Tracy Stone-Manning, was an editor on an edition of Earth First! Journal that openly mocked the federal investigation into the tree-spiking plot she aided. https://t.co/SYIClCjYBg","date":"Thu Aug 05 16:27:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"With jobless claims remaining high, the administration must reexamine their policies holding the economy back &amp; prioritize getting Americans back to work.","date":"Thu Aug 05 16:00:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to K&amp;T Steel on being named the Idaho #SmallBusiness of the Month!\n \nFor over six decades, they have been a key manufacturer in southern Idaho &amp; their impact extends throughout the Magic Valley community.\n\n🔗https://t.co/DFhm4HIRSy https://t.co/l4pnlHK9tW","date":"Wed Aug 04 22:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is concerning: a nominee should know to disclose an appearance on a Chinese Communist Party news outlet.\n\nThe nomination of David Chipman to lead ATF continues to raise questions that need answers. \nhttps://t.co/Tyw5QeoKn5","date":"Wed Aug 04 18:53:56 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"U.S. authorities have encountered more than 1,111,000 migrants at the southern border since January. \n \nThis is a national security crisis, a public health crisis, and a humanitarian crisis.\n \nThe administration needs to step up and address the #BorderCrisis they created.","date":"Wed Aug 04 16:49:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For 231 years, the US Coast Guard has defended our shores &amp; kept Americans safe from external threats. Thank you to the Coast Guardsmen, past &amp; present, who have served in the @USCG.\n \nToday &amp; every day, America stands with you. #SemperParatus #AlwaysReady https://t.co/YDEo3pO45p","date":"Wed Aug 04 14:21:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A national security crisis, a human rights crisis &amp; now a growing public health crisis. The #bordercrisis needs to be handled &amp; the administration is doing just the opposite.\n\nhttps://t.co/3Ud66z46US","date":"Tue Aug 03 22:14:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Bureau of Land Management employees should not be asked to follow a director who broke the trust of the people they serve.\n\nTracy Stone-Manning’s nomination continues to raise concerns. The President should withdraw her nomination.\n\nhttps://t.co/jNyvxi2vMU","date":"Tue Aug 03 20:04:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This partisan reckless tax-and-spend spree will be paid for by the American people.\nhttps://t.co/x8tgBwh2G7","date":"Tue Aug 03 16:58:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"\"It's not unheard of for Idaho's average price to be 20 or 30 cents higher than the national average, but 61 cents is a big gap by any standard.\"\n \nIdahoans are feeling the squeeze of soaring gas prices.","date":"Tue Aug 03 14:23:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Conspiring w/ eco-terrorists &amp; threatening @forestservice employees, loggers &amp; mill workers are heinous acts that don’t fade with time. \n\nTracy Stone-Manning is unfit to lead @BLMNational. My @EnergyGOP colleagues &amp; I will continue to fight this nomination.https://t.co/R5gFMgDYkX","date":"Mon Aug 02 21:12:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to strong leadership &amp; well-implemented economic policy, Idahoans will once again see historic tax relief this week.","date":"Mon Aug 02 17:30:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As each day passes, it becomes clearer that Tracy Stone-Manning is unfit to lead the Bureau of Land Management.\n \nHer nomination is an insult to the hardworking people at @BLMNational &amp; her confirmation will be a stain on this administration.\n\nhttps://t.co/Wt1FdhYJml","date":"Fri Jul 30 15:04:06 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Whenever I visit a small business around Idaho, I ask them, “What is the greatest challenge you face?” Now almost unanimously, the response is, “We cannot find enough people to work.”\n \nMy op-ed in @twinfallstn:\n\nhttps://t.co/WMg4Vih8RR","date":"Thu Jul 29 21:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our wildland firefighters are working tirelessly to contain wildfires threatening Idaho’s communities. \n\nThese heroes need our support.","date":"Thu Jul 29 18:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Eco-terrorists spiked trees across the West with the intent of injuring or killing people in the timber industry. \n\nThe TSM Act will clear our forests of these heinous acts and prevent any further harm coming to those who use and protect our forests.\n\nhttps://t.co/HeH1qJcckk","date":"Thu Jul 29 16:01:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we remember the more than 100,000 Americans who were killed &amp; wounded in the Korean War.\n \nTheir sacrifice serves as a reminder: freedom is not free. https://t.co/Mn03GgSy6X","date":"Tue Jul 27 23:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tracy Stone-Manning colluded with eco-terrorists &amp; lied to Congress. \n \nShe should not be before the U.S. Senate for confirmation to lead the Bureau of Land Management – she should be in front of a jury. https://t.co/LjIa2l66od","date":"Tue Jul 27 15:57:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; I are deeply saddened to hear of Mike Enzi’s passing. Mike was a giant in Wyoming politics &amp; a great senator, but more importantly, he was a good man &amp; a good friend. Our hearts &amp; our prayers are with the Enzi family.","date":"Tue Jul 27 12:34:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tonight, my personal office staff &amp; committee staff faced off in a Capitol Hill softball game. https://t.co/6YZzHSaVMg","date":"Mon Jul 26 23:11:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Inflation is here. If the administration continues with its reckless tax-and-spend spree, it will be here to stay.","date":"Mon Jul 26 21:26:31 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From the gas pump to the grocery store, Americans are paying for Democrats’ inflation. \n\nhttps://t.co/hSIXgiHQQn","date":"Mon Jul 26 18:27:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, we take rodeo very seriously. Congratulations to the young men &amp; women who represented the Gem State at the National High School Finals! \n\nhttps://t.co/mPRlOVgvSW","date":"Mon Jul 26 15:11:32 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tracy Stone-Manning, the admin’s nominee to lead @BLMNational, colluded with eco-terrorists in a tree-spiking operation &amp; perjured herself to Congress.\n \nShe should be in front of a jury – not the United States Senate.\n\nhttps://t.co/U3IJFm2EPV","date":"Fri Jul 23 21:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congress must address its reckless spending problem.\n\nThe Zero Based Budget Act will require agencies to produce a budget which clearly outlines potential cuts to reduce the growing national debt so we don’t leave future generations footing the bill.\n\nhttps://t.co/ePv0UxMd2v","date":"Fri Jul 23 17:51:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Good luck to @TeamUSA as the #Tokyo2020 Olympics get underway. \n\nThese men &amp; women are some of the best our country has to offer &amp; I know they will represent America well. 🇺🇸","date":"Fri Jul 23 14:05:03 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As unemployment numbers continue to disappoint, the administration is pushing a tax-and-spend spree that will raise costs for businesses &amp; slow economic growth.\nhttps://t.co/T2eEiqzXzi","date":"Thu Jul 22 21:04:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over a million acres are on fire across the West today. The time to slowly chip away at our forest health issues has long passed.\n \nMy FIRESHEDS Act will address this problem on a landscape scale to reduce the risk of catastrophic and uncontrollable fire.\nhttps://t.co/JLbCjdDk3H","date":"Thu Jul 22 18:20:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If the Biden administration wants to have the face &amp; the character of this administration represented by perjury, lying &amp; conspiracy, they can confirm Tracy Stone-Manning, but she would be a stain on the administration. https://t.co/FdUGoVh06Q","date":"Thu Jul 22 16:11:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tracy Stone-Manning sent a threatening letter to the Forest Service, lied to Congress &amp; put American workers in danger.\n\nShe is unfit to lead Bureau of Land Management. https://t.co/sN5eDtfqEc","date":"Thu Jul 22 13:48:45 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There is still a crisis at the southern border &amp; it’s being ignored by the administration.  \n\nhttps://t.co/iy8LRVDoiJ","date":"Wed Jul 21 21:57:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations, officers!","date":"Wed Jul 21 19:13:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This move by the administration to allow the completion of #NordStream2 demonstrates a clear double standard when it comes to pipelines. While Russia tightens its grip on Europe’s energy sector, thousands of American jobs are lost from the cancellation of Keystone XL.","date":"Wed Jul 21 18:07:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Gas prices in Idaho are up $1.20 since last year. \n\nhttps://t.co/iGMXSvV1jH","date":"Wed Jul 21 16:16:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Allen Noble was a man of great character who cared deeply for Idaho &amp; the people living there. His contributions to the business, agriculture &amp; education communities established his legacy &amp; changed the Gem State forever. He will be missed.","date":"Wed Jul 21 15:14:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Increased demand for travel &amp; mail delays are causing longer processing times for passports. \n\nIf you have an upcoming trip abroad, make sure to check if your passport is valid &amp; visit the @TravelGov website for more info. https://t.co/KP49tgJ3W8","date":"Tue Jul 20 23:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Let’s call Democrats’ $3.5 trillion budget resolution what it really is: a tax-and-spend spree funded by American taxpayers.","date":"Tue Jul 20 20:45:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I still remember standing in my driveway when Vicki came outside to tell me a man had landed on the moon.\n \nEven 52 years later, nothing comes close to American innovation.","date":"Tue Jul 20 17:08:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Despite involvement in a tree-spiking operation, the admin. continues to stand behind Tracy Stone-Manning to lead the Bureau of Land Management. \n\n@BLMNational employees need someone they can trust to make decisions regarding our public lands. Stone-Manning is not that person.","date":"Tue Jul 20 14:42:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Those most affected: small business owners &amp; hard-working Americans.\n \nInflation is spiking &amp; it has people concerned.","date":"Mon Jul 19 20:14:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As are Idahoans. We must get government spending under control.","date":"Mon Jul 19 16:30:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s forests are deeply intertwined in our state’s history, from our innovative timber industry to our vast recreational opportunities. \n \nFrom the only forester in the U.S. Senate, happy #NationalForestWeek! https://t.co/KuslxaRKH3","date":"Fri Jul 16 19:46:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m proud to stand with the people of #Cuba as they fight to regain their God-given rights &amp; freedoms.","date":"Fri Jul 16 16:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho has seen a 160% increase in cybersecurity jobs since 2015. @uidaho is leading the charge to educate the next generation of #cyber professionals.\n\nhttps://t.co/o2UNtcZvSq","date":"Fri Jul 16 13:35:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#Idaho: a northern border state with a southern border problem.","date":"Thu Jul 15 20:10:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"American taxpayers should not have to foot the bill for attacks on innocent life. \n \nMy Republican colleagues &amp; I will always fight for unborn life in the U.S. Senate. #HydeSavesLives https://t.co/i8RQmC910h","date":"Thu Jul 15 17:19:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Not only did Tracy Stone-Manning collaborate with eco-terrorists, she helped plan the tree-spiking operation that has my @EnergyGOP colleagues &amp; me concerned. \n \nA letter from the special agent in charge of the investigation reveals some damning information. https://t.co/ctPu6Sm0Ux","date":"Thu Jul 15 15:41:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tree spiking – hammering metal rods into tree trunks – is considered an act of eco-terrorism because it can kill loggers.\n \nThe President’s nominee to lead @BLMNational colluded with tree spikers, then misled Congress about it. https://t.co/8P9uYI0B5n","date":"Wed Jul 14 21:25:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today @EnergyGOP Republicans called on President Biden to withdraw Tracy Stone-Manning’s nomination to lead @BLMNational. \n \nStone-Manning collaborated with eco-terrorists in Idaho. She is unfit to lead America's top land management agency.","date":"Wed Jul 14 20:24:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to the leadership of @GovernorLittle &amp; industry leaders like @INL, Idaho continues to lead the charge in educating the next generation of #cyber professionals.","date":"Wed Jul 14 16:50:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Unacceptable.\n \nThe federal government cannot keep spending like this.","date":"Wed Jul 14 14:14:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, I named Emsi Burning Glass as the Idaho #SmallBusiness of the Month. @EmsiData is an analytics company working to help Idaho’s employers better understand the labor market to meet their staffing needs. \n\nCongratulations! \n\n🔗https://t.co/kfVInBN8pR https://t.co/2qWtjwmn9m","date":"Tue Jul 13 20:14:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The 2020 Navigable Waters Protection rule signaled a return to common sense. It would be senseless to go back to the Obama-Biden #WOTUS Rule.\n\nYesterday I joined @SteveDaines in sending a letter demanding answers from the @EPA.","date":"Tue Jul 13 16:17:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For the third straight month, cost of living has gone up &amp; hardworking Americans are bearing the burden. \n\nThis is the highest level of inflation we've seen in years.","date":"Tue Jul 13 13:26:21 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"After several harrowing days, this group of volunteers from Sandpoint made it safely home to the U.S.\n\nThe U.S. will continue to support the Haitian people’s quest to build a more peaceful and democratic nation.\n\nhttps://t.co/rZVdyEi6cM","date":"Mon Jul 12 22:59:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Russ is a fighter! #beatcancer","date":"Mon Jul 12 19:37:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“So here’s the real story: The Biden nominee, as an adult, joined an organization that openly perpetrated violence –”\n\nFrom @WSJOpinion:\n\nhttps://t.co/61yXrHrDhv","date":"Mon Jul 12 15:15:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Guardsman, firefighter in training, and now, semi-pro ballplayer.\n \nKolton’s example of commitment to country &amp; community is admirable.","date":"Thu Jul 08 21:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Securing the border is a matter of national security. I applaud @GovernorLittle for taking action.\n\nhttps://t.co/nKFcRwX9It","date":"Thu Jul 08 16:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idahoans haven’t seen gas prices this high since the Obama administration. \n\nThe rising cost of everyday goods is a direct result of the White House’s economic policies &amp; working-class Americans are bearing the burden. \n\nhttps://t.co/30N17uoRd1","date":"Wed Jul 07 20:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For over 70 years, @INL has been at the forefront of clean-energy innovation &amp; there are no signs of slowing down. We’re proud to have them as a part of the Gem State family.\n \nA great write-up from @IdahoFallsMag:\n\nhttps://t.co/JlNZvcbfH5","date":"Wed Jul 07 15:29:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Violent crime is on the rise &amp; it’s more important than ever we support our law enforcement officers who are working to keep our communities safe. \n\nhttps://t.co/D5gmjOoDVV","date":"Tue Jul 06 21:25:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As this heatwave continues to affect Idaho, remember to limit time spent outdoors, hydrate &amp; check in with loved ones.","date":"Tue Jul 06 18:51:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho will once again be represented in the @USNavy in the form of a Virginia-class nuclear-powered fast attack submarine – the first vessel named after the Gem State in over 100 years.","date":"Tue Jul 06 16:44:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As we celebrate #IndependenceDay with our loved ones, we remember the sacrifices of those who came before us – because of them, we are able to enjoy the many freedoms America has to offer.\n \nVicki &amp; I wish everyone a safe &amp; healthy Fourth of July. God bless! https://t.co/Qgf2ZxsUQd","date":"Sun Jul 04 15:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Birthday to the State of Idaho! On this day in 1890, the Gem State was admitted to the Union as the 43rd state. \n\nThere is no place in the world like Idaho. https://t.co/FUroK8E2xC","date":"Sat Jul 03 14:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This weekend, as you celebrate the Fourth of July, remember that fireworks are prohibited on Idaho’s public lands.","date":"Fri Jul 02 20:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Did you know nearly 85% of wildfires are caused by humans? \n \nAs you celebrate Fourth of July Weekend, remember to do so responsibly. https://t.co/FxII2OVZAA","date":"Fri Jul 02 14:56:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to the tireless work of his daughter Casey &amp; testimony from fellow service members, Bill “Rocket Man” Klobas was awarded the Purple Heart in Pocatello over half a century after sustaining injuries in Vietnam.\n \nThank you for your service to America, Bill &amp; God bless you!","date":"Thu Jul 01 23:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"One of the best parts about celebrating the Fourth of July is enjoying time outdoors with loved ones. If you choose to recreate this weekend, be sure to be mindful of your surroundings &amp; ensure all embers are extinguished. https://t.co/I7XMBYV9of","date":"Thu Jul 01 19:56:45 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Extreme heat &amp; drought conditions are causing an increased risk of #wildfire &amp; it’s important to remain vigilant.\n \nVisit the @IdahoLands website for resources for fire prevention, preparedness &amp; awareness.\n\n🔗 https://t.co/uLZhmfHtVd","date":"Thu Jul 01 17:30:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today is the last day to apply for Fall 2021 internships in my Washington, DC office.\n \nIn addition to experiencing our nation’s capital, applicants will have a front-row seat to the legislative process &amp; gain valuable experience working with the brightest political minds.","date":"Thu Jul 01 14:37:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This #wildfire season, make sure you &amp; your loved ones are #PreparedForWildfire. https://t.co/v4uCoaVTlD","date":"Wed Jun 30 21:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The President’s nominee to be Deputy Administrator of @SBAgov has been an active board member of an organization that's been vocally anti-Israel. The nomination of Dilawar Syed is concerning to say the least.\n\nToday I led a group of @SenateGOP colleagues opposing his nomination. https://t.co/EqJiDgdmPo","date":"Wed Jun 30 19:13:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, dairy isn’t just a product; it’s a way of life.\n \nAs #NationalDairyMonth comes to an end, I’d like to thank Idaho’s dairy producers for the impact they make locally, nationally &amp; around the globe. https://t.co/70pdDXjWCt","date":"Wed Jun 30 17:34:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Severe heat is causing drought conditions throughout Idaho, severely increasing the risk of #wildfire.\n \nFor up-to-date fire, air quality &amp; safety information, visit my website. #ReadyForWildfire\n \n🔗https://t.co/4pNE3x5dGr","date":"Wed Jun 30 14:33:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"When Donnelly man Keawe Michael Pestana saw his three young cousins fighting for their lives to escape the current of the Salmon River, he gave his own to save theirs.\n \nLast week, he was named a #CarnegieHero for his bravery. We can all only hope to be as brave as Keawe. https://t.co/6XdHObXebY","date":"Tue Jun 29 21:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration continues to support a nominee that colluded with eco-terrorists who aimed to maim &amp; severely injure loggers in #Idaho.\n \nShe is unfit to head @BLMNational &amp; should withdraw from consideration.\nhttps://t.co/8Hz30pbNAH","date":"Tue Jun 29 15:25:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great story about an Idaho City high schooler who put on an event for Gem State veterans. Well done, Hailey!\n\nhttps://t.co/9fdBw6OI5X","date":"Mon Jun 28 20:01:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As Idaho experiences extreme heat, remember to hydrate, limit your time spent outdoors &amp; check in with loved ones.","date":"Mon Jun 28 15:09:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On December 7th, 1941, 20 year old Carl Bradley was killed in action at Pearl Harbor. Today, nearly 80 years later, he was laid to rest in his hometown of Shelley, Idaho.\n \nThank you to everyone who came out today to commemorate Carl’s life &amp; sacrifice. He’s finally home. https://t.co/jWYAIpm2ar","date":"Sat Jun 26 22:33:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This story may have come out of North Carolina, but the trend is national.\n \nOur law enforcement officers play a crucial role in keeping our communities safe. Now more than ever, they need our support.\n\nhttps://t.co/cMXSe7iRkr","date":"Fri Jun 25 19:49:56 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Recent cyberattacks have demonstrated just how catastrophic data breaches can be &amp; have underscored the importance of securing our critical energy infrastructure.\n \nThat’s why I’ve joined @SenJackyRosen &amp; @SenJohnHoeven in introducing the Cyber Sense Act.\nhttps://t.co/6b9Mjt8T8E","date":"Fri Jun 25 15:24:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Interested in living &amp; working in Washington, DC? \n \nMy office is accepting applications for Fall 2021 internships through July 1st. If you or someone you know is interested in gaining valuable experience on Capitol Hill, visit my website:\n \n🔗https://t.co/k77bOXYZe6 https://t.co/ZkgIHr6MVx","date":"Thu Jun 24 22:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As Idaho prepares for record-high temperatures, remember to take care of yourself and those around you: \n \n-Hydrate early &amp; often\n-Limit outdoor activity\n-Check in with elderly relatives\n\nhttps://t.co/Qlj1xASacd","date":"Thu Jun 24 19:49:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"That’s easy – @IdahoStateFB. #GoBengals","date":"Thu Jun 24 18:24:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The President’s nominee to head the ATF is a gun control activist who wants to ban the most popular rifle in America for law-abiding citizens.\n \nWith views like this, David Chipman is unfit to lead @ATFHQ. https://t.co/JZvLYKU7mw","date":"Thu Jun 24 15:21:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Access to affordable prescription drugs is one of the greatest challenges facing Idahoans, particularly in rural communities.\n \nYesterday I joined @MikeCrapo in introducing the Lower Costs, More Cures Act to provide relief to families across Idaho.\n \n🔗https://t.co/wTay7tmYzP https://t.co/EzM39Yl7hT","date":"Wed Jun 23 21:46:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We need a long-term solution to build &amp; maintain a deep bench of cybersecurity professionals to address the increasing threat of cyberattacks on our nation’s critical infrastructure &amp; systems.\n \nI’m pleased to see @uidaho play its part to address this need.","date":"Wed Jun 23 20:09:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Even President Obama’s Bureau of Land Management director agrees: someone involved with eco-terrorists is not fit to lead America’s largest land management agency.\n \nTracy Stone-Manning should withdraw from consideration to lead @BLMNational. \n\nhttps://t.co/0f8j1TFphA","date":"Wed Jun 23 17:49:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m pleased to see the @CityofTwinFalls honor these ladies for their life-saving efforts. As they head off to college in the fall, the story of their heroism won’t soon be forgotten in the Magic Valley. @KMVTNews \n\nhttps://t.co/5FfWXnSBsb","date":"Wed Jun 23 13:31:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Americans deserve free &amp; fair elections – not a rigged system.\n \n#S1 is dangerous for democracy.","date":"Tue Jun 22 21:30:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#S1 would put public funds in the pockets of politicians.\n \nTaxpayers should not be forced to foot the bill for partisan political campaigns. https://t.co/5XnHkDjUOh","date":"Tue Jun 22 19:20:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#S1 would give the federal government unprecedented power.\n \nIt would legalize paid ballot harvesting &amp; undermine voter ID laws.\n \nAmericans need confidence in elections, not more doubt. https://t.co/w5YsoWpLOZ","date":"Tue Jun 22 17:02:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Best of luck to the athletes competing this weekend &amp; thank you to the first responders who will be monitoring the wellness of these fierce competitors.","date":"Tue Jun 22 14:23:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Every time I sit down with my interns, I’m amazed by the talent &amp; drive of the next generation of Idahoans – this group is no different. https://t.co/hsCgIeTb7m","date":"Mon Jun 21 21:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Compared to last year, @CBP has seized nearly double the amount of deadly fentanyl at the southern border. \n\nIt’s time for the administration to take responsibility for the border crisis.\n\nhttps://t.co/bcnooTFf67","date":"Mon Jun 21 18:44:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to @CSIEagles cowboy Russell Kay on a strong finish at the @collegerodeo National Finals!\n\nhttps://t.co/OzFLfaVKwf","date":"Mon Jun 21 16:31:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Some of my colleagues have conceded that the nominee to lead the Bureau of Land Management made a “mistake” some decades back.\n \nConspiring with tree spikers is not a mistake. https://t.co/kRRTKuq83X","date":"Thu Jun 17 19:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Unparalleled bravery from the @IdahoFallsPD &amp; @IdahoFallsFire who entered a burning home to save a wheelchair-bound woman.\n\nhttps://t.co/KmRVZUU1Om","date":"Thu Jun 17 17:11:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As one of the top milk &amp; cheese-producing states in the country, Idaho is proud of its dairy farmers.\n\nIn honor of #NationalDairyMonth, I’ve joined @RogerMarshallMD to honor our dairymen &amp; women who have dedicated their lives to feeding American families.\n\nThis glass is for you. https://t.co/Zj0zn0OYpK","date":"Thu Jun 17 14:03:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We cannot ask Bureau of Land Management employees to serve under a director who aided those who endangered the land users they work on behalf of each day.\n\nhttps://t.co/3XohU6gR5s","date":"Wed Jun 16 21:52:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tracy Stone-Manning colluded with eco-terrorists who conducted extremist operations that aimed to maim and kill Idaho’s loggers and sawmill workers.\n \nNow she’s nominated to lead the largest land management agency in America.\n\nhttps://t.co/NUyGfluMjB","date":"Wed Jun 16 21:52:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m pleased to see Idaho partner with @WGU to strengthen Idaho’s workforce &amp; expand access to higher ed.\n \nWell done, @GovernorLittle.","date":"Wed Jun 16 19:14:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s sportsmen &amp; women have the right to access adequate hearing protection without burdensome government regulations.\n \nI’m proud to support this commonsense bill allowing law-abiding gun owners to protect their hearing.","date":"Wed Jun 16 14:55:39 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m proud to have received conservative excellence awards from @ACUConservative.\n \nConservative values have made Idaho a success story. DC would be wise to take a page out of Idaho’s playbook. https://t.co/RzF2z6D5AN","date":"Tue Jun 15 23:29:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@SBAgov had months to process applications from shuttered venue operators, yet fewer than 100 grants have gone out. \n \nToday, I signed @JohnCornyn’s letter requesting transparency on this issue. https://t.co/nvjfsCoHjS","date":"Tue Jun 15 17:53:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, plans for the Keystone XL Pipeline were officially scrapped.\n\nHow many thousands of jobs were lost as a result?\n\nhttps://t.co/FYtKkFWYVC","date":"Tue Jun 15 14:05:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since 1775, the @USArmy has stood ready to protect our country – because of them, we are free.\n \nToday, and every day, we owe these heroes a debt of gratitude. https://t.co/2SLk1Djxv5","date":"Mon Jun 14 21:53:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats’ spending is sending prices surging – and consumers are footing the bill.","date":"Mon Jun 14 18:31:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We are blessed to live in the United States. Today, we reflect on the values the American flag embodies: freedom, liberty &amp; unity.\n\nHappy #FlagDay &amp; God bless America. 🇺🇸","date":"Mon Jun 14 15:53:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Obama-era WOTUS rule trampled states’ rights and risks the livelihoods of hardworking farmers &amp; ranchers.\n \nI will fight to preserve the current standards and prevent further federal overreach on Idaho’s water.\n\nhttps://t.co/5mxjeHRLq3","date":"Fri Jun 11 17:27:21 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, on their way home from prom, two Idaho teens rescued a man from a car wreck. The girls pulled the unconscious victim from the vehicle &amp; administered CPR, saving the man’s life.\n \nToday, they were honored for their heroism.\n \nA truly incredible story. https://t.co/zLqSJrMap9","date":"Fri Jun 11 13:39:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What started as a well-intentioned relief program has become rife with fraud &amp; abuse.\n \n@GovernorLittle was right to end participation in the program &amp; help Idahoans return to work.\n\nhttps://t.co/dFGgcsFzAa","date":"Thu Jun 10 18:25:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"More on the Defending Keystone Jobs Act here:\n\nhttps://t.co/pIETREmBUD","date":"Thu Jun 10 15:16:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As many as 60K jobs were lost because of Keystone’s cancelation. Meanwhile, Russia continues to build its Nord Stream 2 pipeline.\n\nThe Defending Keystone Jobs Act I intro'd yesterday would require the administration to report just how many jobs were erased.https://t.co/uIUWbLs7zR","date":"Thu Jun 10 15:16:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, a group of my @SenateGOP colleagues &amp; I introduced legislation to examine the number of jobs lost because of Keystone’s cancelation.\n\nhttps://t.co/8EVngDpw5E","date":"Wed Jun 09 17:31:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Keystone XL pipeline would have strengthened U.S. energy independence &amp; supported thousands of high-paying jobs.\n \nIt’s hard to square why the administration canceled its construction, yet waived sanctions on Russia’s Nord Stream 2 pipeline.","date":"Wed Jun 09 17:31:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This month, I am naming Rupe’s Burgers in Blackfoot as the Idaho #SmallBusiness of the Month. A mainstay in the Blackfoot community since 1987, there’s no better place to grab an American classic.\n\nhttps://t.co/KiB6U1PmQK","date":"Wed Jun 09 15:28:47 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we remember the men &amp; women who made the ultimate sacrifice defending our country. Thanks to their heroism, we are free.\n \nHappy Memorial Day &amp; God Bless America. https://t.co/ERIyUi61ub","date":"Mon May 31 15:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to state leadership &amp; @INL, Idaho is uniquely positioned to educate the next generation of #cybersecurity professionals.\n \nCongratulations to Idaho’s 2021 National #Cyber Scholars! @NCScholarship","date":"Fri May 28 13:28:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For a strong economy, we need a full workforce.\n \nI applaud @GovernorLittle’s decision to stand with Idaho’s small businesses &amp; help us get back to full strength.\nhttps://t.co/XbSxC0qU7u","date":"Thu May 27 17:12:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is now home to one of our nation’s Gold Star Families Memorials. As we pay tribute to the service &amp; sacrifice of our fallen servicemembers, we also hold in our hearts the Gold Star Families who shoulder the price paid for the defense of our freedoms.\nhttps://t.co/prB9eSSluV","date":"Thu May 27 15:04:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Gas prices are up. Commodity prices are up. Grocery prices are up.\n \nInflation is among the greatest threats to our economy &amp; additional spending will only make it worse.","date":"Wed May 26 18:51:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#OnThisDay in 2006 on my way to a visit to Eastern Idaho, I found out I would become Governor of Idaho effective immediately.\n \nIt was the honor of a lifetime to serve Idahoans in this capacity &amp; I carry that pride with me serving in the U.S. Senate. https://t.co/eZnCXOZrKF","date":"Wed May 26 14:16:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Unprecedented spending &amp; record tax hikes.\n \nA great study from @RoyBlunt’s team at @SenateRPC: https://t.co/rj6nIwNKeN https://t.co/PzzGzIYXVA","date":"Tue May 25 17:35:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to this talented &amp; deserving group of young Idahoans.\n \nWell done!","date":"Tue May 25 14:53:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"These are the real-life consequences of this administration’s excessive spending. \n\nWhen inflation causes prices to rise, working families &amp; small businesses bear the burden.\n\nhttps://t.co/OiwVXWScKk","date":"Mon May 24 16:28:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you to everyone who came out yesterday to #SupportLocalGems. Our effort was an overwhelming success &amp; it warms my heart to see Idahoans turning out to support their fellow Idahoans. \n\nAgain, from the bottom of my heart, thank you and God bless!","date":"Sat May 22 14:15:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/JIqCl1mR9F","date":"Fri May 21 21:43:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#SupportLocalGems","date":"Fri May 21 17:52:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A true hero.","date":"Fri May 21 15:34:56 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today is the day!\n \nJoin me in supporting Idaho's local gems by making a purchase from your favorite #smallbusiness – big or small, it makes a difference. #SupportLocalGems","date":"Fri May 21 14:10:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This pandemic has underscored for everyone how important small businesses are to the culture &amp; fabric of our society here in Idaho.\n \nI encourage everyone to join me on May 21st to #SupportLocalGems. Will you be joining me? https://t.co/dMhozZF1J2","date":"Thu May 20 22:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our small businesses are the lifeblood of our communities. Now it’s our turn to support them.\n\n🔗https://t.co/BmEyxiN9GY","date":"Thu May 20 18:57:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s restaurants were hit hard by the pandemic. Now, with restrictions drawn back, you can visit your favorite eatery or order food to go.\n \nEven leaving a review goes a long way! https://t.co/kkfuUkJn7a","date":"Thu May 20 18:57:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"How can you #SupportLocalGems? I’m glad you asked.\n \n🧵","date":"Thu May 20 18:57:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The best way to support Idaho’s small businesses is to go right to the source. Stop by your favorite #smallbusiness and purchase an item or a gift card to be used later. https://t.co/5WIZHteGQY","date":"Thu May 20 18:57:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The word is out!\n \nThis Friday, show your support for Idaho’s #smallbusiness community &amp; join me in shopping local in our effort to #SupportLocalGems.\nhttps://t.co/iOTenGCtBN","date":"Thu May 20 13:55:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In honor of #SupportLocalGems, I’m recognizing six small businesses as #Idaho Small Businesses of the Month.\n \nRead about how these local gems have made a lasting impact on their communities. 👇\n\nhttps://t.co/IuTSo9zRYF","date":"Wed May 19 20:18:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to leadership at the state &amp; local levels, Eastern Idaho will soon have a premier event space for community events &amp; gatherings. I am excited to see this project finally underway!","date":"Wed May 19 18:12:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🔗 https://t.co/3NVMJUNCgk","date":"Wed May 19 15:16:32 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This past year, Idaho’s small businesses have had to adapt to protect their staff &amp; stay afloat. These establishments aren’t just where we shop, they’re part of the community.\n \nThis Friday, give back &amp; stop by your favorite #smallbusiness to show your support. #SupportLocalGems https://t.co/ns9EcjgYvQ","date":"Wed May 19 15:16:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In a year full of challenges, we’ve learned that there is nothing more important than community. This Friday, we celebrate Idaho’s local communities and the small businesses that make them vibrant.\n \nOn May 21st, join me in our effort to #SupportLocalGems. https://t.co/TnV5bfJY1C","date":"Tue May 18 21:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Like Idahoans, the Gem State’s small businesses are resilient. This Friday, we come together to #SupportLocalGems.\n \n🔗 https://t.co/BmEyxiN9GY https://t.co/zJCUpQqjt5","date":"Tue May 18 15:32:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to this year’s @uidaho graduates! Once a Vandal, always a Vandal.\n\n#GoVandals","date":"Mon May 17 22:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thankfully, @INL is leading this effort through the development of Consequence-driven Cyber-informed Engineering (CCE).\nhttps://t.co/7eBnh6TMV7","date":"Mon May 17 19:18:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The #ColonialPipeline hack is a reminder of the vulnerabilities in our critical infrastructure and its impact on national security. We must improve our #cyber readiness.","date":"Mon May 17 19:18:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Visit my website to learn more about how you can support Idaho’s #smallbusiness community: https://t.co/BmEyxiN9GY","date":"Mon May 17 17:01:42 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last year, I teamed up with @IdahoCommerce to launch #SupportLocalGems to support &amp; celebrate Idaho’s small businesses.\n \nI am excited to announce that on Friday, May 21st, we are bringing the initiative back. https://t.co/W5ZWmZE8NI","date":"Mon May 17 17:00:48 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Under the current system, disaster victims in rural communities have experienced significant delays in relief funding brought on by bureaucratic red tape.\n\nI introduced the Disaster Assistance for Rural Communities Act to fix that. 👇\nhttps://t.co/L7Amw0Rrpy","date":"Fri May 14 20:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"To the 800,000+ law enforcement officers serving our country’s communities, thank you.\n#NationalPoliceWeek https://t.co/QOBOj78oEa","date":"Fri May 14 14:39:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our law enforcement officers deserve our support.\n\nIn honor of #nationalpoliceweek, I joined a group of bicameral lawmakers in introducing the Back the Blue Act.","date":"Thu May 13 20:20:42 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idahoans are just built different. Another example of the @IDNationalGuard doing our great state proud!","date":"Thu May 13 14:28:42 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Looks like the Governor has been busy:\n \n✅ Tax breaks for Idahoans\n✅ Fully-funded transportation package\n✅ Upheld #2A rights\n \nWell done, @GovernorLittle!","date":"Wed May 12 19:10:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We’re seeing the real-life consequences of the #ColonialPipelineHack.\n \nThe US can’t treat these attacks like natural disasters to be cleaned up after the fact. These are preventable. We need a comprehensive strategy to protect our infrastructure. \nhttps://t.co/tFjpxek8RQ","date":"Wed May 12 18:01:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"National Labs like @INL are the envy of the world &amp; possess unmatched R&amp;D capabilities.\n \nAny final #EndlessFrontierAct should include our labs, which I’ve made clear ahead of today’s markup.\n \nMy letter on this: https://t.co/P6AQSZ7aGd","date":"Wed May 12 15:00:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#S1 is not about voting rights. It’s a political play to federalize elections and weaponize the Federal Election Commission. https://t.co/cAxWMsMHMn","date":"Tue May 11 16:56:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses simply cannot compete with unemployment benefits that exceed $15 per hour.\n \nIt’s time to address the policies keeping workers out of the workforce.","date":"Tue May 11 15:11:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Americans are about to start feeling the fallout from the #ColonialPipeline ransomware attack.\n \nWe need to prioritize hardening our #cyber defenses &amp; creating a comprehensive US cybersecurity strategy. That begins with filling the vacant assistant secretary role at CESER.","date":"Mon May 10 22:12:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement: \nhttps://t.co/Maz06LSzLS","date":"Mon May 10 22:12:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Well done, Idaho!\n\nhttps://t.co/jaeaDmmmJc","date":"Mon May 10 15:31:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"May 14th – mark your calendars! \n\nhttps://t.co/0vkg1DdG5S","date":"Fri May 07 21:20:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If this jobs report tells us one thing, it’s this: now is *not* the time to raise taxes.","date":"Fri May 07 14:15:28 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and my prayers are with the Rigby community following this morning’s tragic events. Thank you to our law enforcement officials, first responders, and teachers for working to keep students safe.\n\nhttps://t.co/Sh1CT3orVt","date":"Thu May 06 18:30:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Throughout this pandemic, we’ve seen countless lives saved thanks to the work of Idaho’s nurses.\n \nThe sacrifices our health care workers have made over this past year are admirable &amp; we owe them a debt of gratitude. \n\nThank you.","date":"Thu May 06 14:50:39 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@ENERGY’s Office of Cybersecurity, Energy Security &amp; Emergency Response is central to U.S. national security &amp; our #cybersecurity strategy.\n \nAs said in @thehillopinion, any reduction in the Department’s #cyber resources would be a mistake.","date":"Wed May 05 14:37:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"International trade is crucial to Idaho’s economy.\n \nI applaud @GovernorLittle’s work to expand demand for Gem State exports &amp; get products to consumers around the world.  \n\nhttps://t.co/wXFldemXMr","date":"Tue May 04 20:45:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #NationalTeachersDay to Idaho’s educators! Thank you for all you do. https://t.co/GU4clpeAzD","date":"Tue May 04 17:08:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Mark Johnson has been a giant in Idaho cable news for over 20 years. Now, the Emmy award-winning broadcaster is retiring.\n \nCongratulations on a fantastic career, @Emjayktvb. I look forward to tuning in until your final broadcast in December.\n\nhttps://t.co/D0YCfamUJR","date":"Tue May 04 15:23:03 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Want to keep up with what’s happening in Washington, D.C.?\n \nSubscribe to my press releases to receive exclusive updates on my work in the U.S. Senate: https://t.co/PQnQeddyEp https://t.co/KtFavvbr0c","date":"Mon May 03 22:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you, @GovernorLittle!","date":"Mon May 03 20:00:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s a pleasure to serve alongside you.\n \nThanks, @Mike Crapo!","date":"Mon May 03 18:00:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks, Mike! \n\nIt’s been a pleasure working with you all these years.","date":"Mon May 03 15:35:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks congress_birthday_bot. I truly appreciate it…","date":"Mon May 03 13:33:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Joining @nateshelman on @KBOI670. Tune in now! https://t.co/z0SvAKbgep","date":"Fri Apr 30 23:17:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Karl Zimmerman, a WWII Veteran from Iowa, sent a pen to each US Senator made of wood from a tree in their home state. \n\nEven in retirement, our veterans continue to give back to their communities. Thank you for the gift &amp; God bless you, Karl. https://t.co/zMt3axZnBc","date":"Fri Apr 30 23:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Having a secure, defined border is important to our national security &amp; public health efforts. \n\nThis is an ill-advised decision at best.","date":"Fri Apr 30 19:41:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As an @uidaho forestry alum, I know firsthand the value &amp; beauty of Idaho’s forests.\n \n@SenAngusKing, @MikeCrapo &amp; I introduced a resolution celebrating #ArborDay &amp; recognizing the importance of #WorkingForests to conservation &amp; the economy. https://t.co/C1tWwpEsYl","date":"Fri Apr 30 19:11:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America’s adversaries continue to demonstrate they are bent on penetrating our #cyber defenses.\n \nI joined @lisamurkowski in introducing the PROTECT Act which will help utilities integrate advanced cybersecurity measures to protect our critical energy infrastructure.","date":"Fri Apr 30 14:50:45 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today marks the first day of #IdahoGives. Put on annually by @idaho_central &amp; @idahononprofits, this week-long initiative serves to raise money &amp; awareness for Idaho’s #nonprofit organizations. \n\nLearn more here ↓\nhttps://t.co/bjgNTtWVHm","date":"Thu Apr 29 18:40:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What the President did last night was lay out a comprehensive vision for how to transition our society from capitalism to socialism. We must not be swept up in this current.","date":"Thu Apr 29 13:00:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In his first 100 days in office, the President has proposed spending $6.1 trillion on unapologetically far-Left priorities through a lethal combination of deficit spending &amp; tax increases that will crush the economy &amp; jeopardize our ability to respond to future challenges.","date":"Thu Apr 29 13:00:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The President halted construction of the border wall and reinstated the disastrous Obama-era policies that have resulted in an uncontrollable wave of illegal entries. I was very disappointed the President did not lay out a workable plan to address illegal immigration. https://t.co/42JgjwXISz","date":"Thu Apr 29 13:00:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🧵The President’s first #jointaddress was notable not for what was in it, but for what he failed to adequately address:","date":"Thu Apr 29 13:00:28 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The @SenateGOP has a vision for our country that strengthens the well-being of families, local communities &amp; future generations.\n \nWell done, @SenatorTimScott!","date":"Thu Apr 29 03:29:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today’s ruling comes as welcome news for Idaho’s potato growers. \n\nI’m proud to continue advocating for the Gem State’s ag producers so people across the world can enjoy our state’s most famous product.","date":"Wed Apr 28 21:10:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"American Rescue Plan: $1.9 Trillion\nAmerican Jobs Plan: $2.7 Trillion\nAmerican Families Plan: $1.8 Trillion\n \nThat’s more than $6 Trillion in proposed spending in the administration’s first 100 days.\n\nhttps://t.co/obnIlV6UUp","date":"Wed Apr 28 16:57:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Our most basic human right is the right to life.\n \nI applaud @GovernorLittle &amp; the Idaho State Legislature for passing this bill into law to preserve unborn life &amp; protect those who cannot protect themselves.","date":"Tue Apr 27 21:57:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In 2020 alone, @INL invested over $200 million into the Gem State’s economy. \n\nThey’re more than just the nation’s flagship national laboratory, they are a part of the Idaho community.","date":"Tue Apr 27 19:41:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"If we don’t secure the border, this #bordercrisis will only continue to get worse.\nhttps://t.co/CTqXQBuizY","date":"Tue Apr 27 14:24:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week, Idaho Falls lost a great man in Tim Hopkins.\n \nTim was a man of honor &amp; sound character who, even in moments of disagreement, maintained civility and kindness. He will be missed. \n\nhttps://t.co/iXliNjWQeV","date":"Mon Apr 26 22:09:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@INL is leading the effort to fortify our critical infrastructure.\n \nBig things are happening in East Idaho.\n\nhttps://t.co/9h0RCBF1Fc","date":"Mon Apr 26 17:13:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the years #UNRWA has employed individuals affiliated with Hamas, a U.S. designated terrorist organization.\n \nThe U.S. should cease assistance to UNRWA until much-needed and meaningful reforms of the agency are secured.","date":"Mon Apr 26 15:43:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #FeelGoodFriday! \n\nhttps://t.co/nYm3GWBoU7","date":"Fri Apr 23 21:59:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America relies on countries like #China for the critical minerals needed for everything from jet engines to cell phones.\n \nPleased to join @LisaMurkowski &amp; @MikeCrapo in introducing legislation to help shore up that domestic supply chain here in the U.S.\nhttps://t.co/5iATwqKcuk","date":"Fri Apr 23 18:20:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s dairy farmers are rightfully proud of their high-quality dairy products &amp; it’s only fair that dairy terms be reserved for genuine dairy products. If it’s not milk, don’t call it milk.\n \nPleased to introduce the DAIRY PRIDE Act with @SenatorBaldwin &amp; @CongMikeSimpson.","date":"Fri Apr 23 14:37:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Earmarks encourage backroom deals that lead to wasteful spending.\n \nHappy to have joined, @SenMikeLee.","date":"Thu Apr 22 18:34:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Modernization projects including roads, bridges, railroads, waterways, broadband, clean water, etc.\n \nThis is what an infrastructure package should look like.","date":"Thu Apr 22 16:31:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"SRS payments provide education &amp; critical services in many of Idaho’s rural counties. Until the federal government returns to active forest management, I will continue to fight to reauthorize SRS and keep our timber communities whole.\n\nhttps://t.co/bw9G2DhCsJ","date":"Thu Apr 22 14:34:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is called “the Gem State” &amp; for good reason. #NationalParkWeek","date":"Wed Apr 21 21:43:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today @ENERGY lifted a ban on electric grid equipment connected to Chinese companies, giving the #CCP a prime opportunity to interfere with US critical infrastructure.\n\nIf you permit Chinese equipment on our grid, no amount of tightening our #cybersecurity will make a difference.","date":"Wed Apr 21 19:00:58 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Mark Johnson, indeed.","date":"Wed Apr 21 17:24:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the last decade, Bashar Al-Assad has inflicted enormous suffering on the Syrian people &amp; proven that he will do anything to preserve his grip on power.\n \nThe US will not tolerate these blatant &amp; continued human rights violations in #Syria.","date":"Wed Apr 21 14:05:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I support the development &amp; use of clean energy.\n \nHowever, this “#GreenNewDeal” will eliminate millions of jobs, add trillions in debt &amp; harm our businesses – large &amp; small.\n\nhttps://t.co/gexeTv3mcu","date":"Tue Apr 20 18:51:39 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I promised to bring a @SBAgov Women’s Business Center to Idaho &amp; two years ago, that promise was fulfilled. \n \nToday, @IdahoWBC is helping small businesses navigate the #COVID19 pandemic.\n\nhttps://t.co/MpAH0wxDjo","date":"Tue Apr 20 14:07:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Using #Huawei solar inverters on our electric grid would leave us vulnerable to surveillance &amp; interference from the Chinese gov't.\n\nLast year I sent @FERC a letter urging them to deny Beijing the opportunity to meddle with US energy supply.\nhttps://t.co/G2GeqSjupN\n@INL @SEL_News","date":"Fri Sep 18 15:45:17 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Hydropower &amp; #nuclear are efficient, sustainable sources of energy.\n \nIf you’re searching for an example of low-cost, clean-energy production &amp; use, look no further than Idaho &amp; @INL.","date":"Mon Apr 19 22:30:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Welcome to the Idaho airwaves, @guypbenson! #idpol","date":"Mon Apr 19 20:42:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s state &amp; local officials have worked tirelessly to balance the public safety of individuals with the needs of small businesses.\n \nAs we emerge from this pandemic, we are beginning to see the positive impacts these open-economy policies have had.","date":"Mon Apr 19 17:12:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s been two months since the Perseverance Rover landed on Mars. Thanks to the work of many, including @INL, we are already seeing the successes of American innovation.","date":"Mon Apr 19 14:46:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Another great #FeelGoodFriday piece from @NateNewsNow. \n\nhttps://t.co/pRnMAP3oMS","date":"Fri Apr 16 19:00:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Let’s be clear: this is purely a messaging tactic. \n \nThe Supreme Court has functioned with nine justices for 150+ years. Any attempt to pack the Court will be struck down by Congress.\nhttps://t.co/xf7Ncmi0LL","date":"Fri Apr 16 15:30:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"First responders play a critical role in keeping our communities safe.\n \nA great story from @EastIDNews:","date":"Thu Apr 15 21:36:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#SolarWinds is the prime example of a growing trend: more &amp; more it’s state actors who pose the greatest #cyber threat.  \n \nMy remarks on #cybersecurity from yesterday’s Senate Intelligence hearing: https://t.co/HjwuO4Lt40","date":"Thu Apr 15 17:31:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Identifying #Russia as the actor behind the #SolarWinds hack is a half-step.\n \nWe need to develop a comprehensive #cyber strategy that keeps the US ahead of its adversaries &amp; holds malign actors accountable.\n\nhttps://t.co/VeeBd6FK1Q","date":"Thu Apr 15 17:31:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As a rancher, I know just how harmful current hours of service requirements can be for our livestock haulers.\n \nThis week, I cosponsored @SenatorFischer’s HAULS Act to reform overly restrictive trucking regulations so our #ag producers can transport products safely &amp; effectively.","date":"Wed Apr 14 18:13:28 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"HAPPENING NOW: the Senate #Intel Committee is holding a hearing on the greatest national security threats facing the United States.\n \nTune into the Worldwide Threats hearing to hear from officials from @CIA, @FBI, @NSAgov &amp; more: https://t.co/Fa2yyVR7yh","date":"Wed Apr 14 14:57:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From @WSJ: “We are now becoming dangerously numb to the trillions in debt that are piling up. We need to start paying for what we spend.”\n\nhttps://t.co/zyGJHmq35F","date":"Tue Apr 13 21:15:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Strengthening our domestic semiconductor supply chain is key to expanding American innovation &amp; competing with countries like #China. \n\nAuthorizing funding for @JohnCornyn's CHIPS Act will do just that. \nhttps://t.co/mA9rKZsagu","date":"Tue Apr 13 16:44:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"U.S. Capitol Police Officer Billy Evans spent 18 years protecting the U.S. Capitol &amp; all those inside. Vicki &amp; my prayers are with Officer Evans’ family, friends, &amp; his @CapitolPolice colleagues.","date":"Tue Apr 13 14:12:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The #bordercrisis continues to affect Idahoans as illegal drugs make their way north from the US-Mexico border.\n \nIdaho is a northern border state with a southern border problem. The administration must address it.\n\nhttps://t.co/vrWE0UgRQD","date":"Mon Apr 12 17:06:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Federal mandates that undermine Americans’ #2ndAmendment rights &amp; circumvent their elected representatives in Congress erode the constitutional freedoms that make our country exceptional.\nhttps://t.co/NyK8pV98jb","date":"Thu Apr 08 16:49:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Securing our critical infrastructure against #cyberattacks is one of the most pressing national security issues facing the U.S.\n\nA strong #cybersecurity strategy must be a key component of any plan.\nhttps://t.co/elrzGO1QM6","date":"Wed Apr 07 17:33:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is a leading barley and hop production state in America. If you’re celebrating #NationalBeerDay, raise a glass to Idaho’s farmers.  \n@IDFarmBureau\nhttps://t.co/LI5Zp3JySS","date":"Wed Apr 07 14:31:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Frontline workers continue to need our support – even as we turn the corner on this pandemic. \n\nA great story from @KTVB:\n\nhttps://t.co/DqqB9TNisx","date":"Tue Apr 06 14:29:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today I am naming Dave’s Bike Shop in Idaho Falls as the Idaho #SmallBusiness of the month.\n\nA family-run operation, Dave’s recently celebrated a decade of business. Congratulations &amp; I look forward to your continued growth &amp; success!\n\nhttps://t.co/MnPcbCdeDh","date":"Mon Apr 05 16:30:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From my family to yours, have a blessed Easter! https://t.co/G28PYVEWqI","date":"Sun Apr 04 14:56:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Please keep Capitol Police &amp; first responders in your prayers while we try to understand the situation unfolding at the Capitol right now.","date":"Fri Apr 02 17:47:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Looking forward to seeing the @BigIdahoPotato hitting the road again. Keep an eye out for the @IdahoPotato truck this summer – coming to a town near you! \n\nhttps://t.co/nhBDGdbu5A","date":"Thu Apr 01 20:30:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Being able to safely navigate our public lands is important – especially in states like Idaho. \n\nI was pleased to reintroduce the MAPLand Act which will help digitize public lands &amp; expand access for Idaho’s outdoor recreators.\n\nFrom @ThePostRegister: https://t.co/VuAnShfc6k https://t.co/AxbCkV1FZC","date":"Thu Apr 01 15:13:52 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #NationalTaterDay! Go grab yourself a spud &amp; support Idaho's farming families. https://t.co/0CRN7a4fh5","date":"Wed Mar 31 17:51:54 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From #ag producers fueling their rigs to drivers filling up at the pump, Idahoans are feeling the effects of rising gas prices.\n \nThe fix? Producing domestic energy to preserve our energy independence &amp; keep costs low for consumers – this must be our focus.","date":"Wed Mar 31 15:01:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@MarcoRubio &amp; I introduced the American Innovation and Manufacturing Act to provide access to early-stage capital to small businesses who create productive, well-paying jobs for Idahoans. \n \nRead more ↓\n\nhttps://t.co/EuSykI5roE","date":"Tue Mar 30 20:06:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the weekend a group of my @SenateGOP colleagues visited our southern border to witness the #bordercrisis firsthand. \n\nWhat they saw was heartbreaking.","date":"Tue Mar 30 16:53:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#NordStream2 is not just a pipeline project to bring Russian natural gas to Germany &amp; on to Western Europe – it's a malign Russian influence project that poses a significant national security risk to the United States &amp; our allies.\n \nMy op-ed w/ @RepMcCaul:https://t.co/K3GBE0zV0U","date":"Tue Mar 30 14:28:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last week I joined @SenatorBraun in urging @SBAgov  Administrator Guzman to investigate the approval of PPP loans to Planned Parenthood affiliates.\n \nWith $2B in assets &amp; over 16K employees nationwide, they should not receive taxpayer funds meant for small businesses.","date":"Mon Mar 29 19:41:28 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we remember the millions of men &amp; women who honorably served our country in the Vietnam War.\n \nMay we never forget their sacrifice. #VietnamWarVeteransDay https://t.co/hoLCuoNYLS","date":"Mon Mar 29 16:03:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great contribution from @Idaho_Central. Well done!","date":"Fri Mar 26 17:53:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, my @SenateForeign colleagues &amp; I sent a letter to @POTUS outlining a bipartisan strategy for dealing with #Iran.\n \nDemocrats and Republicans may have tactical differences, but we are united on preventing an Iranian nuclear weapon.","date":"Thu Mar 25 20:51:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today my colleagues and I sent a bipartisan letter urging @SecGranholm to preserve @ENERGY’s #cybersecurity program.\n \nIt’s imperative we don’t move backward in protecting our critical energy infrastructure given the persistent &amp; growing threat of #cyberattacks.\n \nRead more ↓ https://t.co/z0C9rlZeJT","date":"Thu Mar 25 17:14:55 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The situation at the US-Mexico border is turning into a health crisis.\n \nFrom @nypost:\n\nhttps://t.co/Mx28jXxl0C","date":"Thu Mar 25 13:53:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What’s going on at the US-Mexico border is serious &amp; should not be taken lightly.\n\nA strong stance on border security &amp; immigration is needed to fix this #bordercrisis.","date":"Wed Mar 24 21:38:53 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#HR1 threatens our election security &amp; violates states’ constitutional right to oversee their elections.\n \nThis federal power grab does not work for Idahoans or Americans.","date":"Wed Mar 24 17:14:35 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In 2005, CJ Buck chose #Idaho as the new home of Buck Knives because of our business-friendly climate. Now, new company President, Lane Tobiassen, will join them &amp; help continue their reputation of excellence.\n \nWelcome to the @edgeofalegend family, Lane!\nhttps://t.co/0040WzNIU0","date":"Wed Mar 24 14:36:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho &amp; agriculture go hand-in-hand. It’s our lifestyle. It’s our identity.\n\nFrom this rancher, happy #NationalAgDay to all of Idaho’s ag producers. https://t.co/E188FqJzci","date":"Tue Mar 23 14:19:26 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration’s policies &amp; rhetoric are driving the surge at our southern border. We must tighten border security so we can end this #bordercrisis.\n\nhttps://t.co/iuSutnhipp","date":"Mon Mar 22 19:35:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"After dominating at regionals, the Idaho Girls 16U Tier II hockey team is headed to nationals.\n \nCongratulations ladies &amp; good luck in Denver!\n\nhttps://t.co/IZtvVykCeH","date":"Mon Mar 22 16:54:03 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great piece from my friend @MikeCrapo.\n \nThe American \"Rescue\" Plan interferes in states’ — like Idaho’s — ability to provide tax relief to its citizens to reduce the burden on working families.\n \nThis is dead wrong &amp; should not be the case. \n\nhttps://t.co/YlqE4Zi1Ja","date":"Fri Mar 19 18:20:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today I voted to oppose the nomination of Xavier Becerra to head the Department of Health &amp; Human Services.\n \nAmericans deserve a @HHSGov Secretary with healthcare experience who will protect their right to private insurance &amp; uphold pro-life values.","date":"Thu Mar 18 17:25:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@LeaderMcConnell is spot on here.\n \nThe legislative filibuster is the most important distinction between the Senate &amp; the House. Without it, the Senate would be an unrecognizable institution.\n\nhttps://t.co/G3o9NW98ct","date":"Thu Mar 18 14:07:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today I reintroduced the FAST Fix Act which will help small businesses in Idaho gain access to research and development grants to galvanize our continued economic growth and success.\n\nhttps://t.co/38TbcyfXcp","date":"Wed Mar 17 21:59:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"There's no good reason to halt construction on a nearly-completed border wall – especially during a #bordercrisis.\n \nToday, I signed on to @SenCapito’s letter to @USGAO  inquiring if the Administration violated the law with their decision.\n\nhttps://t.co/8M1HZDlkfU","date":"Wed Mar 17 18:39:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Xavier Becerra is out-of-step with Idahoans. He favors:\n \n❌Government-run healthcare.\n❌Open-border policies.\n❌Taxpayer-funded abortion.\n \nHe is the wrong choice to lead the Department of Health and Human Services.","date":"Wed Mar 17 17:11:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Under Democrats’ COVID spending plan, poorly managed states receive a windfall while fiscally responsible states like Idaho are barred from providing tax relief to its citizens.\n \n@MikeCrapo and I introduced the State Fiscal Flexibility Act to fix that. \nhttps://t.co/mImoDuu7tX","date":"Tue Mar 16 22:00:21 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Americans need more jobs, not higher taxes.\nhttps://t.co/nVrHgbczYM","date":"Tue Mar 16 19:12:59 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"People respond to incentives. The administration’s policies and rhetoric are driving the surge of migrants arriving at our southern border.\n\nTheir message: amnesty is coming. \nhttps://t.co/5bMk6Fb7dk","date":"Tue Mar 16 15:44:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I voted “no” on @RepDebHaaland's confirmation to lead @Interior due to concerns about her record, including her support for locking up land &amp; degrading multiple use.\n \nTwo-thirds of Idaho’s land is owned by the federal government &amp; Idahoans deserve a seat at the table. https://t.co/50v0QybULd","date":"Mon Mar 15 22:36:12 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho we stand with our men &amp; women in uniform.\n \nI’m pleased to see @GovernorLittle sign HB 205 into law.","date":"Mon Mar 15 18:47:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today the Senate will vote on the nomination of Rep. Haaland to be Secretary of @Interior.\n\nHer non-answers on the #KeystoneXL Pipeline remain a serious cause for concern. https://t.co/klBLwg3oZi","date":"Mon Mar 15 17:19:29 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to the 2021 @BigSkyConf Women's Basketball Champions, @HeartofaBengal!\n\n#BigSkyInBoise","date":"Fri Mar 12 20:48:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today’s @BigSkyConf Women’s Basketball Championship will be an all-Idaho event.\n \nGood luck to the University of Idaho Vandals &amp; the Idaho State Bengals!\n@VandalsWBB @HeartofaBengal https://t.co/RO28Ubz3yn","date":"Fri Mar 12 14:58:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Back to Idaho for the weekend – see you soon, Boise! https://t.co/AwRHjfADW8","date":"Thu Mar 11 22:36:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to @GovernorLittle’s leadership, Idaho ended 2020 with the strongest budget surplus on record.\n \nWhy then are responsible states like Idaho barred from providing tax relief under Democrats’ $1.9 trillion spending plan?  \n\nhttps://t.co/eSwsK07LnH","date":"Thu Mar 11 16:37:17 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is not a COVID relief bill, it’s a vehicle for pushing a liberal agenda by building reliance on government through reckless spending.\n\nMy full statement on the $1.9 trillion spending bill: https://t.co/24EBDktXoc. https://t.co/IpOEIvQACN","date":"Thu Mar 11 01:32:58 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In 2014, thousands of unaccompanied children crossed our country’s southern border &amp; it was deemed a national crisis.\n\nToday, we have more than 3,250 children in migrant facilities &amp; it's hardly talked about.\n\nWithout a doubt, this is a #bordercrisis.\n\nhttps://t.co/ab05YL9gnP","date":"Wed Mar 10 22:09:22 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Students in Idaho are safely returning to classrooms thanks to strong local leadership &amp; an understanding that in-person learning is invaluable. \n \nChildren are falling behind. It’s time for the rest of the country to follow suit &amp; get our students #backtoschool.","date":"Wed Mar 10 19:15:05 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations, Marianne! @INL is lucky to have you.","date":"Wed Mar 10 17:31:47 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, the House is set to pass the Democrats’ #COVID “relief” bill.\n \nThe US is $28 Trillion in debt and about to add nearly $2 Trillion more to that total, a 7% increase in our national debt with a single bill.\n \nMy op-ed on government spending: https://t.co/WayfA0hTgR. https://t.co/THjBNGjYNW","date":"Wed Mar 10 15:51:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Good luck, ladies! #GoVandals","date":"Tue Mar 09 17:59:25 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy birthday to my friend &amp; fellow member of the Idaho Congressional Delegation, @RepRussFulcher!\n \nIt’s been a pleasure working with you the past two years &amp; I look forward to continuing to fight for Idahoans. https://t.co/Uk5KlB0wi3","date":"Tue Mar 09 14:35:46 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Continuous Composites in Coeur d’Alene on being named the Idaho #SmallBusiness of the Month.\n \nA world-leader in 3D printing, @CF3DPrinting is an example of an Idaho small business blazing a trail to make Idaho a hub for tech innovation.\nhttps://t.co/eNh53wY7lX","date":"Tue Mar 09 00:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@RepDanCrenshaw is spot-on:\n \n\"If we want to tackle climate change, reduce emissions, and power the grid, then we need the proper mix of energy. We need to make sure that #nuclear not only stays on the grid, but grows on it.\"\n \nEach day, @INL is working to make this possible.","date":"Mon Mar 08 19:18:39 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Not only is @RoyBlunt an esteemed colleague, he is also a friend.\n \nRoy’s leadership will be greatly missed &amp; I look forward to continue working with him to fight for our constituents’ shared values.","date":"Mon Mar 08 17:12:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m blessed to have some of the brightest minds in Washington, DC on my team.\n \nHappy #InternationalWomensDay. https://t.co/wmkUcJsYeD","date":"Mon Mar 08 16:21:32 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As my @SenateForeign colleagues &amp; I have said, #China must be the number one foreign policy priority of the U.S. This move by the #CCP reinforces that.\n\nhttps://t.co/iCtVzk2EJt","date":"Fri Mar 05 22:02:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Regional economies are reopening &amp; people want to work. This month’s jobs report is an encouraging sign of what is to come.\nhttps://t.co/d1E5BdgvzQ","date":"Fri Mar 05 18:51:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Just found him. 87 down, 13 to go!","date":"Fri Mar 05 17:21:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“Why should Idaho be penalized for making hard decisions to keep our economy open and kids in school? The states that did neither are being rewarded.”\n \nLooks like we’re on the same page, @GovernorLittle: https://t.co/WayfA0hTgR.\n\nhttps://t.co/yRv99YEHsx","date":"Fri Mar 05 14:34:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Despite $1 Trillion in unspent COVID-19 aid from previous relief bills, Democrats are on the precipice of passing a $1,900,000,000,000.00 ($1.9 Trillion) COVID spending plan without a single Republican vote. \n \nMy op-ed in @CdAPressNews:\n\nhttps://t.co/WayfA0hTgR","date":"Thu Mar 04 23:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Of all the blessings in life, there are none greater than family. #NationalSonsDay https://t.co/FILNK7S1vf","date":"Thu Mar 04 21:46:04 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Having to ask a @POTUS Cabinet nominee their stance on something as consequential as the #KeystoneXL Pipeline *six* times is unacceptable.\n \nLike @SenJohnBarrasso said, we still don’t have a good answer. https://t.co/Z2BuWQdcaE","date":"Thu Mar 04 19:10:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Always great talking with @uidaho President, Scott Green. \n\nAs a University of Idaho alumni, it’s a pleasure to represent Idaho’s flagship land-grant research institution in the U.S. Senate. https://t.co/uxBZXs0yXu","date":"Thu Mar 04 17:50:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On March 4th, 1863 President Lincoln declared Idaho a U.S. Territory. Fast forward 158 years &amp; Idaho is one of the greatest states in the Union.\n \nHappy #Idaho Day! https://t.co/jesTAGAjyP","date":"Thu Mar 04 15:00:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Democrats’ $1.9 trillion bill will give $350 billion (87 times Idaho’s annual budget) to state &amp; local governments, with the largest sums going to states that rang up billions in unpaid debt long before #COVID19.\nhttps://t.co/0ykFfqKJgP","date":"Wed Mar 03 22:20:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m with @SenCapito.\n \nThe United States is $28 TRILLION in the red &amp; about to add nearly $2 trillion more to the national debt with a single bill. That’s more than $84,000 in debt for every American.\n\nhttps://t.co/iNvjz3rAtX","date":"Wed Mar 03 17:27:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Forests and Livelihoods: Sustaining People and Planet.\n\nThis year’s #WorldWildlifeDay theme is familiar to Idahoans. The Gem State’s forests offer thousands of jobs in management, recreation &amp; conservation – industries that sustain wildlife &amp; rural communities alike. https://t.co/HmSbQTWX0p","date":"Wed Mar 03 15:00:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In Idaho, we take care of our veterans.\n \nToday I had the honor to speak with members of the Idaho @VFWHQ about the challenges facing our retired servicemembers &amp; how we can work together to solve them. https://t.co/cMlbv7bjSJ","date":"Tue Mar 02 23:00:14 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #WomensHistoryMonth. Idaho was one of the first states to grant women the right to vote, blazing a trail for the women’s suffrage movement &amp; ratification of the #19thAmendment 24 years later. https://t.co/znCyCqnwQ5","date":"Tue Mar 02 15:32:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The @INL is made great by its outstanding workforce.\n \nCongratulations to all of the Lab’s employees being recognized by @ENERGY!","date":"Mon Mar 01 18:50:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@marcorubio is right.\n \nOur focus should be delivering bipartisan relief to Americans, not spending hundreds of billions of taxpayer dollars on far-Left priorities unrelated to #Covid19.","date":"Mon Mar 01 14:50:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"After several unanswered attacks against US interests, I welcome the decision to authorize airstrikes against Iranian-backed militias operating in #Syria.\n\nWe must not allow the Iranian regime to hide behind Iran-supported militias that pose threats to national security.","date":"Fri Feb 26 17:28:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Byrd rule is in place to prevent items unrelated to the budget process from making their way into budget reconciliation – this is an important ruling from the Senate Parliamentarian.\n\nhttps://t.co/2GR8xUlCbl","date":"Fri Feb 26 15:58:39 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In addition to being the flagship #nuclear lab in the US, @INL is also part of the community. Their commitment to supporting Idaho’s small businesses, cyber readiness &amp; economic development will ensure future generations of Idahoans can thrive.\nhttps://t.co/meA19EojKQ","date":"Thu Feb 25 21:42:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The @INL is the foremost leader on #nuclear energy &amp; securing the nation’s critical infrastructure. I look forward to working with @JenGranholm to advance energy innovation and promote economic growth in Idaho &amp; throughout the U.S.","date":"Thu Feb 25 17:54:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Like I asked Rep. Haaland yesterday, how can one support shutting down #KeystonePipeline jobs in the US, but permit &amp; encourage #NordStream2 pipeline jobs in Russia?","date":"Thu Feb 25 15:07:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It should not take the @Interior nominee SIX times to answer whether she supports shutting down the #KeystoneXL Pipeline &amp; why.\n \nCount them: https://t.co/fjZqK9Q8nt","date":"Wed Feb 24 18:01:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m proud to cosponsor @MikeCrapo’s Maj. Richard Star Act. This legislation will ensure active &amp; retired military personnel have expanded access to the benefits they &amp; their families have earned.","date":"Tue Feb 23 19:42:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Out of roughly 6,000 truck stops from coast to coast, America’s truckers rank Mr. Gas Travel Center in Jerome the No. 5 truck stop nationwide. No small feat for this Idaho small business!\n\nhttps://t.co/LT5My0E9fI","date":"Tue Feb 23 17:24:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"For now, #SolarWinds is considered an egregious act of espionage. If it becomes clear the actions also impact operational technology, it must be considered an attack &amp; the realm of potential responses greatly escalates.","date":"Tue Feb 23 14:31:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My #cybersecurity op-ed: \n\nhttps://t.co/Uea0W28GhR","date":"Tue Feb 23 14:31:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to former Vandal Mike Iupati on a fantastic career. From playing in the @Idaho_Vandals Kibbie Dome to being named to four Pro Bowls, Vandal Nation is proud of you!","date":"Mon Feb 22 21:43:43 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the past few weeks I’ve introduced &amp; cosponsored numerous pro-life bills.\n \nI’m honored to fight for the right to life in the United States Senate &amp; I won’t stop standing with the pro-life movement until every human life is treated with the dignity &amp; respect it deserves.","date":"Sat Feb 20 00:32:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/FNMxTNZ1ji","date":"Sat Feb 20 00:32:10 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Success – the Perseverance Rover has touched down!\n \nCongratulations to @NASA &amp; @INL on a successful mission.","date":"Thu Feb 18 20:59:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today the spacecraft carrying the Perseverance Rover completes its seven-month journey to Mars. This is a big moment for the US and for the team at @INL who helped make this possible. #CountdownToMars \n\nhttps://t.co/yLfxTAROWT","date":"Thu Feb 18 15:33:57 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to @INL, a power system developed in Idaho will be landing on Mars.\n\nhttps://t.co/VmJOJWPQwV","date":"Wed Feb 17 21:08:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The #SolarWinds hack showed us we need a comprehensive approach to #cybersecurity that keeps the U.S. a step ahead of its adversaries.\n \nMy @CNBC op-ed: \n\nhttps://t.co/Uea0W1R4Th","date":"Tue Feb 16 16:58:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #PresidentsDay Idaho! https://t.co/HPM8krO9vu","date":"Mon Feb 15 19:01:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on today's impeachment proceedings:\n\nhttps://t.co/f8AgeGTlME","date":"Sat Feb 13 22:14:16 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Encouraging news from @IdahoLabor:\n\nhttps://t.co/Jn7DoLKpfi","date":"Fri Feb 12 16:28:38 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to @INL’s @ztudor on receiving this distinct honor! Zach’s work in the defense &amp; energy sectors demonstrates a profound commitment to country &amp; I commend him for his years of service.\n\nhttps://t.co/JQwvmYUEgQ","date":"Thu Feb 11 19:16:03 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congrats to the @PoliceMeridian &amp; @AdaCoSheriff officers selected to receive the Idaho Medal of Honor. Your service to the community is exemplary &amp; I look forward to seeing you all honored at the State Capitol on May 15th. @GovernorLittle @lawrencewasden \n\nhttps://t.co/A1B3DUwQs3","date":"Thu Feb 11 14:59:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The handling of this investigation will continue to cast doubt on the WHO’s ability to undertake serious, transparent investigations when under pressure from a state party that prioritizes its reputation over public health concerns.\n \nFull statement here: https://t.co/ezrTLc99uS","date":"Wed Feb 10 16:49:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The bipartisan consensus: Preserve American jobs &amp; energy independence.","date":"Wed Feb 10 15:43:45 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #208Day.\n\nAs always, go Vandals!","date":"Mon Feb 08 20:08:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Boy Scouts of America have a strong presence in Idaho &amp; their values of hard work &amp; loyalty are woven into our state’s culture. Happy 111th birthday to the @boyscouts! https://t.co/wNtbMxfq0s","date":"Mon Feb 08 17:44:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the past few weeks, my staff assembled care packages for the United States Capitol Police to thank them for their service to our democracy and our country.\n \nI am proud of each and every one of my staff. https://t.co/Ioyi3MH9mn","date":"Fri Feb 05 22:01:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Read my full statement: \n\nhttps://t.co/R5IPxeLKjW","date":"Thu Feb 04 18:59:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; I just learned the names of the brave @IDNationalGuard soldiers killed in Tuesday night’s Black Hawk helicopter training exercise. Our prayers are with their wives &amp; children, friends &amp; loved ones &amp; fellow soldiers in the ID Nat'l Guard as they grieve this tragic loss.","date":"Thu Feb 04 18:59:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We must get serious about addressing the deficit &amp; living within our means.\n\nI’m proud to cosponsor this legislation with my colleagues @SenHydeSmith &amp; @MikeCrapo.","date":"Wed Feb 03 22:10:11 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you for keeping Idahoans safe the last 82 years – here's to 82 more. \n\n@ISPHeadquarters @Col_WillsISP","date":"Tue Feb 02 19:41:49 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Defending US critical infrastructure is one of the most pressing national security challenges of our time. Anyone looking to understand the future of #cybersecurity should start right here.\n \nCongrats to @INL’s @andybochman &amp; Sarah Freeman!\n\nhttps://t.co/AThQyDT9dQ","date":"Tue Feb 02 15:59:24 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s #ag producers rely on winter snow storms for the spring runoff that irrigates their crops. This past weekend’s weather was welcome news for our farmers – it also makes for some great pictures!","date":"Mon Feb 01 17:27:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Interested in politics? Ever wonder what it’s like working in the Nation’s Capitol?\n \nMy office is currently accepting applications for Summer 2021 internships through March 1st. You can find more info here: https://t.co/k77bOXYZe6. https://t.co/koEBNQL5tI","date":"Fri Jan 29 22:40:34 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It may look a bit different this year, but we have the same goal: Protect unborn life. #WhyWeMarch https://t.co/6TLaJgtWeM","date":"Fri Jan 29 16:12:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The administration’s move to ban mineral &amp; energy leasing on federal lands would raise our energy costs &amp; endanger American energy &amp; technology independence. Now is the time to develop our resources here at home, not diminish them.\n\nhttps://t.co/OeFd74WQuA","date":"Thu Jan 28 21:13:32 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to 44 East Boutique in Meridian on being named the Idaho Small Business of the Month for January – the first of the new year!\n \nYou make our great state proud &amp; I look forward to your continued success.\n\nhttps://t.co/MiA08rvEO0","date":"Thu Jan 28 15:49:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On #HolocaustRemembranceDay we mourn the millions of lives tragically lost during the Holocaust. May God rest their souls. #WeRemember https://t.co/3v2RcbF00M","date":"Wed Jan 27 19:46:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is the fastest growing state in the nation, yet our judiciary is still operating with the same number of judges as it did in the 1950s. \n\nIt’s time #Idaho is granted a permanent third district judge.\n\nhttps://t.co/aa0XzeF4MO","date":"Wed Jan 27 16:49:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today was @GovernorLittle's first Leadership in Nuclear Energy Commission (LINE) meeting of 2021.\n \nI was pleased to attend this virtual roundtable &amp; share ideas on the future of #cyber &amp; #nuclear #energy in Idaho. https://t.co/edjUli0NYi","date":"Wed Jan 27 16:11:18 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #NationalSpousesDay to my wife Vicki. Fifty-two years of marriage &amp; counting – here’s to many more! https://t.co/AY5orBjjnJ","date":"Tue Jan 26 23:01:15 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"These nominees represent some of Idaho's finest young people. I congratulate them on being selected &amp; wish them the very best throughout the admissions process.\n\nhttps://t.co/YJYdMpkFjU","date":"Tue Jan 26 17:41:44 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is the sad reality:\n \n\"We've got guys that haven't worked in months, and in some cases years, and to have a project of this magnitude canceled, it's going to hurt a lot of people, a lot of families, a lot of communities.\"\n\nhttps://t.co/C3cubj9GFq","date":"Mon Jan 25 23:04:13 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I had the pleasure of working with @Dr_Mark_Peters during his time at @INL. Congratulations on your new role &amp; I wish you nothing but success!","date":"Mon Jan 25 17:21:20 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Incredibly proud of these men &amp; women!","date":"Mon Jan 25 15:09:37 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On the anniversary of Roe v. Wade we remember the millions of lives lost to abortion.\n \nI am proud to have received another A+ rating from @SBAList &amp; will continue to fight for the unborn. https://t.co/1yalcjXpog","date":"Fri Jan 22 22:44:27 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The new admin has blocked construction of the #Keystone XL Pipeline. This move is flat wrong.\n \nStopping construction will terminate thousands of jobs in the middle of a pandemic &amp; leave us dependent on the likes of #OPEC and #Russia.\n\nhttps://t.co/9w5iAIRh7W","date":"Fri Jan 22 18:53:33 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As a former Commander in Chief of the Idaho National Guard, I’m humbled and thankful to all of you for your service. Thank you for being here, and God bless you. https://t.co/WRUZ1nauT0","date":"Thu Jan 21 23:41:30 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you, Capitol Police. 🇺🇸 https://t.co/ah40A7BtNu","date":"Thu Jan 21 18:32:41 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The peaceful transition of power has been the cornerstone of our democracy for 245 years. Today’s inauguration marks the enduring strength of our nation. May God bless our new President and Vice President, and God bless the United States of America. https://t.co/FaTWRLnpSI","date":"Wed Jan 20 20:04:50 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you for your service, Idaho Guardsmen!","date":"Fri Jan 15 21:59:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the past few days, my staff collected letters of thanks &amp; assorted treats from offices on Capitol Hill to be sent to each @CapitolPolice officer.\n \nThough it cannot fully express our gratitude, it serves as a token of our appreciation. Thank you. 🇺🇸 https://t.co/hHHoUkAaET","date":"Thu Jan 14 23:03:07 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Coming shortly... https://t.co/qVZZ1oWmo4","date":"Thu Jan 14 20:15:08 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This photo was taken by one of my staffers in the underground tunnels in the U.S. Capitol.\n \nI am incredibly thankful for @CapitolPolice – their dedication to protecting the Halls of Congress &amp; our democracy is nothing short of admirable. My staff &amp; I thank you for your service! https://t.co/FjWdrkfFs5","date":"Wed Jan 13 22:30:09 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Once an @INL employee, Dr. Baranwal has transformed @GovNuclear’s strategic vision to further advance #nuclear energy.\n \nI thank her for her service and wish her the best in her future endeavors.","date":"Tue Jan 12 17:02:19 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Paycheck Protection Program reopens today.\n \nIdaho’s small businesses can apply for #PPP relief by visiting the @SBAgov website: https://t.co/jl5OkofBpd. https://t.co/r6punftD0O","date":"Mon Jan 11 15:48:40 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on violence at the U.S. Capitol and today's Joint Session of Congress:\nhttps://t.co/yiQw65Xcuu","date":"Thu Jan 07 05:00:01 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This nonsense and violence needs to stop now.","date":"Wed Jan 06 21:23:23 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I am glad to see Idaho Falls resident Stephen Yates selected as president of @RadioFreeAsia. With over 25 years of experience in the public and private sectors, Mr. Yates is well qualified for this role and I wish him much success.","date":"Mon Jan 04 19:57:36 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday I was sworn in for my third term as a U.S. Senator.\n \nThank you to Idahoans for the honor of representing Idaho in the U.S. Senate. https://t.co/cOl1zqOsju","date":"Mon Jan 04 16:01:51 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"2020 presented us with many challenges, but I am optimistic &amp; full of hope going into 2021.\n \nFrom my family to yours, Happy New Year! https://t.co/YLh5wNPkzV","date":"Fri Jan 01 16:00:00 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Who’s ready for the #NewYearsEve Potato Drop? One of Idaho’s great traditions!\n\nhttps://t.co/KNloWRQqgC 🥔 https://t.co/sNfpCl7xvh","date":"Fri Jan 01 00:00:02 +0000 2021","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Regional organizations like @REDI_Eastern_ID are a reason Idaho is one of the most #smallbusiness friendly states in America.\n\nhttps://t.co/3GyEW19ZGD","date":"Mon Dec 28 16:12:39 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; I wish everyone a safe &amp; healthy holiday. Merry Christmas! https://t.co/bpxg34baKb","date":"Fri Dec 25 16:09:43 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"They also display hand-made ornaments from each state on the Christmas tree in the White House Blue Room. Well done, Abigail! https://t.co/RrBoi6AZiD","date":"Thu Dec 24 16:19:54 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Every year, the @WhiteHouse displays a tree from each state decorated by a local group. This year, Idaho’s tree was decorated by students from Mountain Home High School. https://t.co/vv8P6uepCA","date":"Thu Dec 24 16:19:52 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From @EastIDNews: A touching Secret Santa surprise for an 8-year-old cancer survivor who needs a new glass eye.\n\nhttps://t.co/Yh2mvYXuMx","date":"Wed Dec 23 23:18:49 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great story from Tyhee Elementary School in Pocatello. Regardless of age, there are always ways to spread holiday cheer. @MakeAWish_Idaho\n\nhttps://t.co/GI6CZ4TJeP","date":"Wed Dec 23 16:25:45 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What a game! @IdahoPotato","date":"Wed Dec 23 01:08:17 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Headed back home to Idaho – see you soon, Boise! https://t.co/HOKCZHKjdz","date":"Tue Dec 22 16:03:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last night, Congress passed bipartisan #COVID19 relief legislation to provide aid to those most affected by this pandemic.\n\nhttps://t.co/4ITTFmqxOK","date":"Tue Dec 22 14:32:04 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Christmas is right around the corner &amp; many of us have yet to find that perfect gift. While you shop this weekend, spread Christmas cheer &amp; buy from one of Idaho’s locally-owned businesses. #SupportLocalGems https://t.co/qEMribafo6","date":"Fri Dec 18 23:15:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This year has taught us how important health care workers are.\n \nThey need our praise. They need our support. They need our prayers.\n \nThey are truly doing heaven’s work. https://t.co/vjaQTJOyj7","date":"Thu Dec 17 23:30:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Out of roughly 40,000 agents, @TSA’s national Officer of the Year is none other than Pocatello Regional Airport’s Kimberlee Green. Congratulations Kimberlee on this great recognition &amp; achievement!\n\nhttps://t.co/pVTFPhjg85","date":"Thu Dec 17 20:06:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#SupportLocalGems is about more than supporting small business. It’s about preserving the establishments that give our local communities identity &amp; value. This holiday season, think big &amp; #shopsmall – all season long.\n\nhttps://t.co/X4AIGU2xen","date":"Thu Dec 17 16:04:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#COVID19 vaccines are arriving in #Idaho. We are not far from putting this pandemic behind us.\n\nhttps://t.co/qXOcrajOSb","date":"Wed Dec 16 15:40:39 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, @INL launched its application for 2021 grants for East Idaho’s K-12 schools. These grants are a great opportunity for students to learn more about #STEM &amp; #cybersecurity. @IdSBOE @IdahoSDE @IdahoEA @IdahoEdNews\n\nhttps://t.co/CsBqLDBWD4","date":"Wed Dec 16 01:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"ICYMI: #China is a competitor of ours economically, militarily &amp; culturally. Watch my full interview w/@BillHemmer on @FoxNews here. ⬇️ https://t.co/9JWaLvlfiP","date":"Tue Dec 15 23:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This afternoon I’ll be joining @BillHemmer at 3:15pm ET/1:15pm MT on @FoxNews to talk about #China &amp; U.S. #cybersecurity – tune in! 📺 https://t.co/dxyykp9FfV","date":"Tue Dec 15 18:45:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#OnThisDay in 1791, the US Constitution’s first 10 amendments were ratified, laying the foundation for the freedoms our country holds dear. #BillofRightsDay https://t.co/RAyZ2WECI6","date":"Tue Dec 15 16:15:56 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Need last-minute gifts?\n \nAs you wrap up your holiday shopping, remember to #SupportLocalGems by buying from one of Idaho’s locally-owned small businesses. https://t.co/NzfS0hHW1X","date":"Tue Dec 15 01:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The first doses of the #COVID19 vaccine were just administered at Madison Memorial Hospital in Rexburg.\n\nhttps://t.co/pJ2C09cfdm","date":"Mon Dec 14 19:47:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congrats to La Cabañita Mexican Restaurant in Ketchum on being named the Idaho #SmallBusiness of the Month! \n \nOwner, Rodolfo, serves some of the best Mexican cuisine in the Gem State &amp; I encourage you to stop by next time you visit the Wood River Valley.\nhttps://t.co/a2AQiVaJIv","date":"Mon Dec 14 16:08:28 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America is turning the corner on this pandemic &amp; it’s happening right before our eyes. I applaud the FDA for working swiftly to deliver this vaccine to the people.\n\nhttps://t.co/JD4hemRkg2","date":"Sat Dec 12 18:54:21 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today was my interns' final day on Capitol Hill.\n \nI couldn't be prouder of this group of young men &amp; women for their dedication to public service – especially during this challenging time. Thank you for all your work &amp; I look forward to following your careers! https://t.co/wIDxixKx2Y","date":"Fri Dec 11 23:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The FY 2021 #NDAA strengthens our national security, provides U.S. troops with a well-deserved pay raise, and secures significant wins for #Idaho. I am proud to join my colleagues in passing this legislation to protect our servicemen and women just as they protect us. https://t.co/6XuNEZqYZY","date":"Fri Dec 11 18:31:24 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"During Computer Science Education Week in Idaho, I encourage Idahoans to participate in @IdahoSTEMAC’s Hour of Code. Not only is it educational &amp; fun, but even I was able to do it!\n \nLearn more about #CSEdWeek here: https://t.co/Zbkxppis44 https://t.co/q1u0YKcF3d","date":"Fri Dec 11 00:00:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"To all those celebrating, Vicki &amp; I wish you a Happy Hanukkah! https://t.co/wEvr9NyrsR","date":"Thu Dec 10 21:01:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"America’s small businesses desperately need another round of #PPP.\n \nMy remarks from today’s @SmallBizCmte hearing: ⬇️ https://t.co/HGdPoqN7DG","date":"Thu Dec 10 17:10:18 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Even during these challenging times, the holiday spirit prevails. This holiday season, choose kindness &amp; generosity.  \n \nhttps://t.co/jrdQvymiD1","date":"Wed Dec 09 23:24:05 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday we kicked off Support Local Gems: All Season Long – a holiday season-long initiative that aims to give back to Idaho’s small businesses that have done so much for us.\n\nLearn how you can #SupportLocalGems all season long: https://t.co/3NVMJUNCgk https://t.co/dWHa6P6mIo","date":"Wed Dec 09 16:54:04 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/O8dZW4sSzr","date":"Tue Dec 08 20:16:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last spring, we launched Support Local Gems, and it was a huge success. Support Local Gems: All Season Long is an opportunity for Idahoans to once again give back to the small businesses that serve us.\n \nAs the holidays approach, shop local and #SupportLocalGems all season long. https://t.co/9onAAogChd","date":"Tue Dec 08 20:16:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s economy is powered by small businesses. Support them by taking measures to protect yourself and others when you #shopsmall this holiday season. #SupportLocalGems","date":"Tue Dec 08 16:18:22 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@MikeCrapo and I asked Congressional Leadership to fulfill its obligation to rural communities. Our communities need certainty – especially during these challenging times.\n \nCongress must fund PILT and SRS.\n\nhttps://t.co/S1LXsFmxtC","date":"Tue Dec 08 14:45:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Arrived in Washington, DC earlier today. Time to get to work. https://t.co/Jdm4DstnfE","date":"Tue Dec 08 00:54:14 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we remember the heroes who lost their lives during the #PearlHarbor attack in 1941 and salute those who answered the call to defend our great nation. #PearlHarbor79 https://t.co/UwNGDLNCOD","date":"Mon Dec 07 14:33:54 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Look at those feet move! What a play by Grant Patterson of Twin Falls High School.\n \nCongratulations on winning this week’s @NFL Way to Play High School Award!","date":"Fri Dec 04 16:04:09 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This evening the @NatlParkService will host the 98th National Christmas Tree Lighting Ceremony. Tune in at 3pm MT for the virtual ceremony – a spectacular holiday tradition!\n\nhttps://t.co/CEIN6iG36B","date":"Thu Dec 03 21:18:34 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday, the Idaho Women’s Business Center unveiled their fourth location in Moscow.\n \nThis new center will provide Northern Idaho’s female entrepreneurs with resources to help start, run &amp; grow their businesses. Congratulations to @Diane_bevan &amp; the entire @IdahoWBC team! https://t.co/hKL3OmaPCY","date":"Thu Dec 03 16:30:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"You will be missed, @SenAlexander.\n \nMy friend Lamar has dedicated his life to public service &amp; is a shining example of what it means to serve the American people. Vicki &amp; I wish him &amp; Honey all the best in this new chapter in their lives.","date":"Wed Dec 02 17:43:46 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is great news for the world.\n\nThe US is currently on track to approve a safe &amp; effective #vaccine that will eradicate this pandemic &amp; return us to normal.\n\nhttps://t.co/YtP0gMY9FY","date":"Wed Dec 02 16:16:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On #GivingTuesday, help those in need by making a charitable contribution to a local food bank, nonprofit or shelter in your area. #IdahoGives https://t.co/YYk0zzdOQO","date":"Tue Dec 01 22:21:08 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Businesses in Nez Perce County are now eligible for City of Lewiston Small Business Grants. This money can be used for:\n \n✅ Rent &amp; Utilities\n✅ Equipment &amp; Inventory\n✅ PPE\n \nTo apply, visit the @LewistonCity website: https://t.co/yUDoJ1owwe.\n\nhttps://t.co/cuDSJo1WjA","date":"Tue Dec 01 18:46:18 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s healthcare workers deserve our support.\n \nThat’s why @MikeCrapo, @CongMikeSimpson, @RepRussFulcher &amp; I sent a letter urging @USDA to approve funds to support Idaho’s rural hospitals.\n\nhttps://t.co/g5d29wqSnG","date":"Tue Dec 01 14:58:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Over the last year I have worked with @MLB leadership to ensure their affiliation w/ @ifchukars meets the needs of the Idaho Falls community – this partnership will help continue their 80 year legacy in Idaho Falls. Congratulations!\n\nhttps://t.co/s3oMTcDAeY","date":"Mon Nov 30 23:07:14 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"On #CyberMonday, show Idaho #smallbusiness you care &amp; #SupportLocalGems. #ShopSmall\n\nhttps://t.co/JQ41IMfxhO https://t.co/CK6z4EafTg","date":"Mon Nov 30 17:22:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is great news.\n \nMultiple COVID-19 vaccines are in the final stages of development – a testament to American resolve &amp; innovation.  \n\nhttps://t.co/sLBMp8ukkS","date":"Mon Nov 30 15:39:39 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you to our small businesses &amp; everyone who came together on #SmallBusinessSaturday to #SupportLocalGems. https://t.co/oXqxw6Z0fv","date":"Sun Nov 29 00:15:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today is the day! \n\nOn #SmallBusinessSaturday, show Idaho’s small businesses you care by buying local, getting take-out, writing a review, or saying thank you for all that they do to make our communities thrive. #SupportLocalGems https://t.co/0xvuRLgTuM","date":"Sat Nov 28 16:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tomorrow, you can #SupportLocalGems by: \n\n#SmallBusinessSaturday https://t.co/lWHTKiWjAM","date":"Fri Nov 27 20:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tomorrow is #SmallBusinessSaturday.\n\nIdaho’s small business owners need our help. Tomorrow, #SupportLocalGems &amp; show your favorite locally-owned business you care by safely shopping in-person or online.","date":"Fri Nov 27 17:03:07 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As #NativeAmericanHeritageMonth comes to a close, we celebrate the culture of Idaho’s Native communities who enrich the quality and character of our great state. https://t.co/tCYtXyeNvI","date":"Fri Nov 27 14:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Thanksgiving to all. https://t.co/Gqvs1pFqcY","date":"Thu Nov 26 19:03:55 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Despite this year’s challenges, we have a lot to be thankful for in the United States.\n \nFrom my family to yours, Happy #Thanksgiving &amp; God bless! https://t.co/pT2kXOfdn0","date":"Thu Nov 26 16:00:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s small businesses still need our help. \n \nOn #SmallBusinessSaturday, let’s come together to #SupportLocalGems. https://t.co/wRKT6Vw6jM","date":"Wed Nov 25 17:00:03 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@SBAPacificNW's Jeremy Field is right. Our holiday spending – at whatever level our budget can afford – collectively makes a difference.\n\nhttps://t.co/ZiG5B4dFmt","date":"Wed Nov 25 14:51:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A reminder to #SupportLocalGems this Holiday Season.","date":"Tue Nov 24 20:04:04 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Advanced Ceramic Fibers in Idaho Falls is a leader in American innovation. I’m pleased to recognize Dr. Garnier and the Advanced Ceramic Fibers team as the #Idaho #SmallBusiness of the Month for November. https://t.co/zV4q7T63YV","date":"Mon Nov 23 19:02:45 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Brave. Dedicated. Selfless.\n \nToday, let’s pause to thank &amp; honor Idaho’s public health workers – they need our support now more than ever. #PHTYD https://t.co/ZhYFfDgxVM","date":"Mon Nov 23 15:46:31 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/mvZPD6pD9X","date":"Fri Nov 20 14:55:57 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Had the opportunity to sit down with @KTVBJoe &amp; update him on #OperationWarpSpeed.\n\nMultiple vaccines are in their final stages &amp; a network of distributors is being organized — the American recovery is around the corner. \n#idpol https://t.co/cZHoIYbEb5","date":"Thu Nov 19 23:29:12 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"More good news for @INL:\n \nThis announcement demonstrates just how important the Lab is to the future of #nuclear #energy. Having the VTR at @INL will allow American companies to perform nuclear testing here in the U.S. – another step toward energy independence. #idpol","date":"Thu Nov 19 18:58:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to @ENERGY on launching the #Cybersecurity Manufacturing Innovation Institute at @UTSA. \n \n@INL will lead the institute’s control systems cybersecurity efforts, developing technologies to protect American industry from cyberattacks. https://t.co/kgCIRwfF9b","date":"Thu Nov 19 17:37:35 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s providers &amp; residents understand the health care challenges that rural communities face – they overcome them every day. Never underestimate the #PowerOfRural.\n\nHappy #NationalRuralHealthDay!\n@NOSORH","date":"Thu Nov 19 14:45:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"What we are seeing with #OperationWarpSpeed is nothing short of historic. The private-public partnerships this administration has formed are a testament to the ingenuity and efficiency of American industry.\n\nhttps://t.co/VqlHYTHh7u","date":"Wed Nov 18 21:34:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This is a perfect example of what I’m talking about.\n \n#CCP threats and coercion of other nations are unacceptable and not the way we do business. The United States stands with our allies.\n\nhttps://t.co/k7vpOOZ1u3","date":"Wed Nov 18 18:39:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Just wrapped up my discussion with @TomTugendhat &amp; @DavidMcAllister on confronting #China. Together, the U.S. &amp; Europe must:\n \n✅ Protect intellectual property\n✅ Maintain international norms\n✅ Hold the #CCP accountable\n \nWe must keep #China in check. \n\nhttps://t.co/N9hMbPwxUC","date":"Wed Nov 18 17:23:35 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@SaintAlsHealth’s Festival of Trees kicks off tomorrow, and this year it’s all virtual.\n \nFind out how you can still enjoy this beloved Boise holiday tradition from home. ⬇️\n\nhttps://t.co/e46OdvtKjr","date":"Wed Nov 18 15:19:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; my prayers are with Senator Grassley &amp; his wife Barbara during this uncertain time. We wish you a swift &amp; full recovery &amp; look forward to seeing you back in action soon.","date":"Wed Nov 18 00:44:21 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"“A well-educated, prepared workforce – one that also includes highly-skilled veterans – is critical to maintaining U.S. leadership in scientific discovery and innovation.”\n \nGreat piece from @SecBrouillette. #STEM #Veterans","date":"Tue Nov 17 19:43:40 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tomorrow I will be discussing my report on U.S.-European cooperation on #China LIVE with my counterparts in the U.K. and EU.  \n \nRSVP to the live event ⬇","date":"Tue Nov 17 18:12:19 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is blessed to have some of the finest hiking trails in the United States. On #TakeAHikeDay, lace up your boots &amp; find a trail by you. \n\nhttps://t.co/e4UcAZ66FB","date":"Tue Nov 17 14:17:27 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations on a successful launch @NASA @SpaceX!\nFollow the #CrewDragon journey here ⬇","date":"Mon Nov 16 17:32:21 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I see it’s that time of year again, @kevinmillershow.\n \nKevin will be outside Walmart in Nampa all week collecting food donations for @BoiseRescue – stop by, say hello &amp; help support a family in need. #MillersMission\n\nhttps://t.co/fToEDI78ZM","date":"Mon Nov 16 14:38:52 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Well done @boyscouts &amp; @JustServe!\n\nhttps://t.co/tqneHs9ZVc","date":"Sat Nov 14 18:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses are the backbone of our economy. \n\nI’m fighting for Idaho’s small businesses to help us recapture our incredible economic strength. https://t.co/wd5zXzh9b4","date":"Tue Sep 22 16:38:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Great news for @ISPHeadquarters.\n \nThis grant will provide Idaho’s law enforcement with new technology to help close longstanding cold cases &amp; bring offenders to justice.\n\nhttps://t.co/pYnm2Jjc6m","date":"Fri Nov 13 15:24:21 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Idaho Sewing for Sports in Grangeville on being named the Idaho #SmallBusiness of the Month!\n \nRecently, ISS began producing PPE for hospitals throughout Idaho – another example of how #smallbiz &amp; community go hand-in-hand in #Idaho.\n\nhttps://t.co/3xh54LNTO3","date":"Thu Nov 12 18:36:14 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s true – #smallbusiness is the backbone of Idaho’s economy.\n \nAs a senior member of @SenateSmallBiz, I will continue fighting to give Idaho businesses the tools they need to get through this unprecedented time.   \n\nhttps://t.co/t6mVfuYYPx","date":"Thu Nov 12 14:56:44 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I'm humbled to stand alongside @GovernorLittle, Idaho's military leaders &amp; @RedCrossIdaho to honor our brave men &amp; women in uniform.\n\nWe are the home of the free because of the brave. https://t.co/VeMpV2qGNO","date":"Wed Nov 11 20:28:26 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Words cannot capture the courage and selflessness of our men and women in uniform.\n \nThis #VeteransDay, thank you to the more than 120,000 Idahoans who have served our great country. https://t.co/PzT2QtxHQS","date":"Wed Nov 11 17:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy 245th birthday to the Always Faithful @USMC.\n \nTo the men &amp; women who have served – past &amp; present – thank you for your service. #USMC245 \n#SemperFi #Marines https://t.co/Tn2VLO1rke","date":"Tue Nov 10 17:50:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations @uidaho. \n \nAnd as always – Go Vandals! \n\nhttps://t.co/jPrjDaJJEZ","date":"Tue Nov 10 14:43:40 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Unemployment is down. Jobs are up. Our economy is making a comeback.\n \n✅ 250,000+ Hospitality Jobs\n✅ 200,000+ Prof. Services Jobs\n✅ 75,000+ Manufacturing Jobs\n\nhttps://t.co/MQsGEFZeCk","date":"Fri Nov 06 15:10:28 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations John!","date":"Thu Nov 05 19:48:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"IDAHO FAMILIES: \n\nTomorrow is the application deadline for @GovernorLittle &amp; @IDSBOE’s Strong Families, Strong Students program. See if your family is eligible for up to $3,500 in education assistance here. ⬇️ \n\nhttps://t.co/PqO43N5ZuX","date":"Thu Nov 05 18:34:48 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"To every Idahoan who voted early or on Election Day – thank you for exercising your constitutional right.\n\nhttps://t.co/OYIWl6Jhv8","date":"Thu Nov 05 15:06:29 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Election Day! If you haven’t done so already, make sure to exercise your constitutional right and go #VOTE.\n \nCheck your polling location here ⬇\n\nhttps://t.co/FzWr2RRlAX","date":"Tue Nov 03 14:30:06 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho is uniquely positioned to be a world leader in #cybersecurity #education and workforce development. I commend @GovernorLittle for his commitment to this important endeavor &amp; for pursuing initiatives like @CyberStartUSA.\n \nLearn more here ⬇️\nhttps://t.co/3l5EKAts8P","date":"Mon Nov 02 20:03:18 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"National Veterans #SmallBusiness Week is the perfect time to reflect on the accomplishments of the hundreds of veteran-owned small businesses here in Idaho.\n \nThis week, support our community’s veterans by shopping at a locally-owned #VetBiz.","date":"Mon Nov 02 17:38:57 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"November is #MilitaryFamilyMonth. \n \nThank you to the 1,000+ active military families in Idaho &amp; all military families around the country for the role you play in keeping America safe! https://t.co/rrg2W84n7A","date":"Mon Nov 02 15:09:37 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Always good to be up North.\n\nI had a great visit in Lewiston where I met with local community members &amp; business leaders about issues affecting North Idaho. Good seeing you @GovernorLittle! https://t.co/JhgZEvnr2P","date":"Sun Nov 01 16:29:42 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today is the final day of @IdahoFoodBank’s Feed the Need campaign to help support vulnerable Idaho families through the holiday season. Find the donation drop-off center nearest you: ⬇️\n\nhttps://t.co/mmgXPLTyj1","date":"Sat Oct 31 15:10:44 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations!","date":"Fri Oct 30 17:53:43 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since 2001, @MikeCDAPress has helped make @CdAPressNews one of the most trusted news sources in the Pacific NW. \n\nCongratulations to Mike on being named @cdachamber's Citizen of the Year – an all-around great guy!\n\nhttps://t.co/k3mIahJEiK","date":"Fri Oct 30 16:08:42 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In September, I named Trinity at City Beach in Sandpoint as the Idaho Small Business of the Month. Yesterday, I was pleased to present them with a Congressional Record Statement to recognize them for their work.\n \nCongratulations, @TrinityCuisine! https://t.co/sjWdufkYtQ","date":"Fri Oct 30 13:43:57 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Water is the lifeblood of Idaho’s #ag communities. \n\nIn addition to uncovering new information on our waterways, this grant will support education &amp; workforce development in Southeast Idaho. Congratulations, @IdahoStateU!\n\nhttps://t.co/HaaodFUJaa","date":"Thu Oct 29 17:31:52 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#PPP worked. \n \nIn FY20 @SBA granted 9 million loans to small businesses. #Smallbusiness access to capital is crucial to a strong economic recovery.\n\nhttps://t.co/FbIkM2sUAO","date":"Thu Oct 29 13:56:31 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m honored to have received the Friend of Farm Bureau award from @IDFarmBureau.\n \nAs a longstanding member of the Farm Bureau, I am proud to support the Gem State’s #ag producers &amp; will continue to work for Idaho’s farmers &amp; ranchers. #idpol https://t.co/vWuhHbZuYd","date":"Wed Oct 28 16:36:56 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today we honor the first responders who serve &amp; protect our communities. Happy #NationalFirstRespondersDay &amp; thank you for your service! https://t.co/Garzhy2Ixv","date":"Wed Oct 28 13:59:14 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"#NavyDay is about service. \n \nThank you to our Naval servicemen &amp; women for the pivotal role they play in keeping America safe. https://t.co/EzQIHzWgpK","date":"Tue Oct 27 16:31:26 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/C6B0AqzTXU","date":"Tue Oct 27 13:45:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Throughout her confirmation process, Judge Barrett consistently impressed the Senate &amp; the American people with her sterling credentials and exceptional legal skills &amp; acumen.\n\nLast night I was proud to cast my vote to confirm Judge Barrett to the U.S. Supreme Court.","date":"Tue Oct 27 13:45:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Deeply respected. Highly qualified. \n\nThe Senate has confirmed Judge Amy Coney Barrett to the U.S. Supreme Court. Congratulations, Justice Barrett! #ConfirmACB https://t.co/gt80wyzBhN","date":"Tue Oct 27 00:12:11 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s almost time.\n \n#ConfirmACB https://t.co/Y51ha4fiPu","date":"Mon Oct 26 19:59:15 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today the Senate will vote to confirm Judge Amy Coney Barrett as an Associate Justice of the Supreme Court. \n\nI’m proud to be a part of this historic moment &amp; I look forward to casting my vote to #ConfirmACB.","date":"Mon Oct 26 14:00:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We are one step closer to confirming Amy Coney Barrett to the Supreme Court – history in the making. #ConfirmACB","date":"Fri Oct 23 19:48:08 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"During #NationalBusinessWomensWeek I could not be prouder of the work being done in Idaho to advance &amp; sustain our many women-owned businesses.\n\nBecause of resources like @IdahoWBC, the Gem State is one of the friendliest places for women-led small business. #NBWW","date":"Fri Oct 23 16:59:14 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This week my staff delivered letters to Fairview Elementary in Bonneville &amp; Beutler Middle School in Dayton congratulating them on being named Blue Ribbon Schools by @usedgov.\n \nCongratulations &amp; keep up the good work! https://t.co/yIll24714W","date":"Fri Oct 23 13:38:07 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Judge Barrett is an exceptional jurist. \n \nHer legal acumen speaks for itself &amp; I look forward to casting my vote to #ConfirmACB to the Supreme Court.","date":"Thu Oct 22 16:20:23 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"https://t.co/i4AEfq23Gr","date":"Thu Oct 22 14:32:29 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Any attempt by a foreign government to influence the outcome of an American election is not only illegal – it’s a direct threat to our democracy. \n \nIran &amp; Russia will be held accountable.\n\nhttps://t.co/cTuDdnkIJH","date":"Thu Oct 22 13:54:43 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"JUST ANNOUNCED: @CommerceGov has awarded a $1.2M grant to the College of Eastern Idaho to build a career &amp; technical education facility in Idaho Falls.\n \nThis funding will help equip Idahoans with advanced skills to secure in-demand jobs with local and national employers alike.","date":"Wed Oct 21 19:28:11 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Senate R’s targeted COVID-19 relief legislation would have:\n \n✅ Protected Small Businesses\n✅ Funded Schools &amp; Childcare Facilities\n✅ Stabilized Unemployment Insurance\n \nIdahoans need this relief. I will keep working to get small businesses &amp; families the assistance they need.","date":"Wed Oct 21 17:53:48 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho families could be eligible for up to $3,500 in education assistance through @GovernorLittle &amp; @IDSBOE’s “Strong Families, Strong Students” initiative.\n \nTo see if you’re eligible &amp; to apply, visit https://t.co/qla2Km8AEd.","date":"Wed Oct 21 14:16:17 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Last year I worked with @SBA to bring a Women’s Business Center to Idaho. \n\nToday, @IdahoWBC opens a brand-new location in Idaho Falls to serve women #smallbiz owners across Eastern Idaho. https://t.co/PETCW75BAs","date":"Tue Oct 20 17:31:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Foreign adversaries are actively working to infiltrate our nation’s electric grid.\n\nThe @INL is a world leader in #cybersecurity research with the capabilities to ensure bad actors like these are unsuccessful in their attempts to disrupt our way of life.\n\nhttps://t.co/soT3f83A6w","date":"Tue Oct 20 15:46:39 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Learn more here: https://t.co/Y9klLwfbY3","date":"Tue Oct 20 14:15:23 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s timber industry contributes over $2B to our state’s economy &amp; provides 31,000+ jobs.\n \nThis National #ForestProductsWeek, thank you to the foresters, loggers, truck drivers, mill workers &amp; others who manage, harvest &amp; process this renewable resource that we use every day. https://t.co/NAKSCQqJT1","date":"Tue Oct 20 14:15:23 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today, I named Advanced Ceramic Fibers in Idaho Falls the Idaho #SmallBusiness of the Month. They are a great example of small business-driven innovation right here in Idaho.\n\nhttps://t.co/jidbI5FrHu","date":"Mon Oct 19 20:02:35 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It’s #NuclearScienceWeek! I’m honored to represent the @INL, our nation’s flagship #nuclear energy laboratory.\n \nFor 70 years, the lab has embodied the traits that built our nation: scientific achievement, the pursuit of knowledge, and curiosity. #idpol","date":"Mon Oct 19 17:12:36 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"This week I met with Emma in Pocatello on the @IdahoStateU campus. Emma is a remarkable young woman with a strong passion for helping her struggling peers – something we can all learn from. \n\nhttps://t.co/uq6tVXbf4h","date":"Sat Oct 17 15:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"From research to row crops, Idaho agriculture feeds the world. \n\nOn #WorldFoodDay, our farmers and ranchers can be proud of the important role they play in America &amp; around the world.\n\nhttps://t.co/9gcnuMXjKG","date":"Fri Oct 16 15:00:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Great catching up with @nateshelman in the @KBOI670 studio yesterday. We covered a lot of ground and had a good time doing it. Thanks for having me!","date":"Thu Oct 15 17:28:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@ENERGY researchers won 38 of 100 @RD100awards in 2020 validating the critical role our national labs play in technological innovation. As co-chair of the Senate National Laboratories Caucus I’m proud to advocate for these institutions, including the talented team at @INL. #STEM","date":"Wed Oct 14 16:51:37 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Had a great day in Pocatello yesterday meeting with local business leaders &amp; the community’s veterans about issues affecting the people of SE Idaho. #idpol https://t.co/F1468VTPUr","date":"Wed Oct 14 13:34:23 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In August, I named Maag Prescription &amp; Medical Supply the Idaho Small Business of the Month. \n\nToday, I presented them with the Congressional Record Statement of recognition.\n\nCongratulations &amp; thank you for 70 years of service to Southeast Idaho! https://t.co/WLwHysAnu6","date":"Tue Oct 13 20:30:40 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Monday was #NationalFarmersDay. \nFriday is #WorldFoodDay.\nToday, thank Idaho’s #ag community for feeding the world. https://t.co/T1YInhm4xP","date":"Tue Oct 13 18:02:57 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In 1775, the U.S. Navy was founded with only two ships &amp; 80 crew members. \n\nToday, it is one of the most respected branches of military in the world. Happy 245th birthday to @USNavy! #Navy245 https://t.co/dS2fjzsvOO","date":"Tue Oct 13 13:43:12 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I have every confidence that the Senate will confirm Judge Amy Coney Barrett to the Supreme Court. \n \nWatch my full interview with @TeamCavuto this morning here: https://t.co/3HFoPbWeep","date":"Sat Oct 10 17:58:45 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"🚨PAYCHECK PROTECTION PROGRAM UPDATE🚨:\n\nToday, @SBA &amp; @USTreasury released a simpler loan forgiveness application for #PPP loans of $50,000 or less. \n\nSee the instructions for completing the application here: https://t.co/mmQf29j2T8","date":"Fri Oct 09 18:05:34 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"As @INL expands its capabilities, it only further solidifies itself as a leader in innovation in America.\n\nhttps://t.co/BOrS7sYi3L","date":"Fri Oct 09 13:55:39 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I was honored to speak at REDI’s inaugural What’s Up Eastern Idaho! virtual event about the role of #smallbiz, farmers &amp; the @INL in Eastern Idaho’s success. \n\nEastern Idaho is growing rapidly &amp; it was a pleasure engaging with local businesses &amp; community members. https://t.co/cc8uYpFKDc","date":"Thu Oct 08 17:09:05 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thanks to a grant from @USDOL, the Idaho Workforce Development Council &amp; @IdahoBusinessEd have announced their plans for a statewide apprenticeship program.\n\nThis initiative will give Idaho’s young people more opportunities for success.\n\nhttps://t.co/AIQ94zLoIa","date":"Thu Oct 08 15:33:11 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"We need a strategy to protect Americans from future pandemics. That’s why I’m working w/ @SenatorCardin and my Foreign Relations colleagues on bipartisan legislation to prevent a pandemic like this one from ever happening again. https://t.co/y3AujHSl8G","date":"Wed Oct 07 16:33:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In #Idaho, higher education &amp; community go hand in hand.\n \nI am proud of @MakeAWish_Idaho &amp; @BroncoSports for adapting to today’s challenges and continuing to serve our community. \n\nhttps://t.co/CkKr53hz3B","date":"Wed Oct 07 13:40:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"New from @IRSnews: Thanks to the Tax Cuts &amp; Jobs Act, middle-class families have paid substantially less in taxes.\n\nSigned into law three years ago, Republican-led tax reform has helped American workers keep more of their hard-earned dollars.\n\nhttps://t.co/BlJd2M9EJg","date":"Tue Oct 06 19:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"ATTENTION IDAHOANS:\n\nThe IRS has extended the deadline to register for an Economic Impact Payment to Nov 21st. If you do not file a federal income tax return, you can register to receive your stimulus check here: \n\nhttps://t.co/9wlUQKKd39","date":"Tue Oct 06 16:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great event in Nampa yesterday honoring Idaho’s women veterans. \n\nThank you to these women, and all service members, for the sacrifices you make to keep America safe.\nhttps://t.co/bITGHvbukC","date":"Tue Oct 06 14:10:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I am pleased to see the Administration counter #China’s attempts to control the mineral supply chain.\n\nIdaho's vast cobalt &amp; rare earth deposits poise our state to be a leader in creating jobs &amp; furthering the United States’ goal of energy independence. \n\nhttps://t.co/1FqLIvaE9I","date":"Mon Oct 05 20:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Great feature from @KPVI on the August 2020 Idaho Small Business of the Month, Maag Prescription &amp; Medical Supply!","date":"Mon Oct 05 18:35:13 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"An absolutely gorgeous shot of McCall during one of the most beautiful times of year in #Idaho!","date":"Mon Oct 05 17:31:28 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy #WorldTeachersDay to the teachers who work tirelessly to educate Idaho’s students. \n \nFacing challenges never seen before, these educators embody the resilience of the American people – God bless you. https://t.co/pRZGGZZBHJ","date":"Mon Oct 05 13:47:50 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"October is #BreastCancerAwarenessMonth. \n\nThis month &amp; all year, we remember those lost to this disease, celebrate the survivors &amp; pray for those who are fighting. https://t.co/3C8yOYr1vf","date":"Sat Oct 03 15:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to @IdahoStateU on the grand opening of the Eams Advanced Technical Education &amp; Innovations Complex. \n\nThe facility’s construction was made possible in part by a $2.3M grant from @US_EDA. Congratulations!\n\nhttps://t.co/njZx3A2jYJ","date":"Fri Oct 02 21:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and my prayers are with the President and First Lady, and all Americans and Idahoans who have been impacted by COVID-19. Hoping they make a swift and full recovery.","date":"Fri Oct 02 16:31:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"I’m proud that @uidaho and @SimplotCompany have partnered with @FeedtheFuture to share Idaho's unparalleled expertise in potato cultivation to drive agriculture-led growth &amp; to end hunger around the world.\n\nIdahoans can be proud of their role in this life saving program.","date":"Thu Oct 01 20:31:04 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Always a pleasure to catch up &amp; talk about #humanrights in #Tibet with my good friend Richard Gere. \n \nHopefully we will be reunited in person soon! https://t.co/8FtugZfMDN","date":"Thu Oct 01 18:30:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A heartwarming story from @CdAPressNews.\n\nThank you to Kenny Moore of Hayden, Idaho for his decades of faithful service to our country.\n\nhttps://t.co/bpGj4i1MU9","date":"Thu Oct 01 16:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Idahoans Luke &amp; Miranda Caldwell on being named National #AdoptionAngels2020! I was proud to honor them at @CCAInstitute's virtual gala last night.\n\n@LukeCaldwell of @HGTV’s #BoiseBoys has used his platform to share how adoption has grown their loving family. https://t.co/0DEhPtUV8P","date":"Thu Oct 01 14:14:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Judge Barrett’s credentials are impressive &amp; her legal acumen was evident in my discussion w/ her. Her respect for &amp; defense of the Constitution makes her an exceptional nominee to serve on the Supreme Court.\n\nRead my entire statement, here: https://t.co/Mac8ViQ4EM https://t.co/zNIOEnWPrK","date":"Wed Sep 30 18:43:37 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Today kicks off @IdSBOE’s Virtual College Fair. For more info &amp; to register for the event, visit the @nextstepsidaho website: https://t.co/G9rgVpJfel. \n\nhttps://t.co/v9HQLOkwSI","date":"Tue Sep 29 14:25:42 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"In just a few short months, #China has: \n\n✅ Voided Hong Kong’s autonomy \n✅ Expanded internment of Uyghur Muslims\n✅ Denied the #CCP’s role in the spread of COVID-19 \n\nRead my entire op-ed from @CdAPressNews below:\nhttps://t.co/dcvyNSdDH0","date":"Mon Sep 28 13:56:54 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Judge Amy Coney Barrett for this high honor. Judge Barrett has a reputation as an exemplary jurist and Constitutionalist, and I look forward to meeting with her to learn more about her judicial philosophy.","date":"Sun Sep 27 02:26:57 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idahoans have passed down the traditions of hunting and fishing for generations. They’re pastimes I was lucky enough to share with my own kids. Happy National Hunting and Fishing Day to Idaho’s sportsmen &amp; women. https://t.co/idkja5Kwu5","date":"Sat Sep 26 15:00:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to the teachers, staff &amp; students at Fairview Elementary in Idaho Falls &amp; Beutler Middle School in Dayton on being recognized as National Blue Ribbon Schools! #idpol @IdahoSDE \n\nhttps://t.co/rVi2DRv47V","date":"Fri Sep 25 18:33:28 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Water is the lifeblood of agricultural communities and the backbone of vital industries throughout the West. \n\nI was proud to introduce legislation to reduce red tape surrounding Western water resources and am pleased to see its implementation in Idaho. \nhttps://t.co/VlkJBwvbu4","date":"Fri Sep 25 13:40:06 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Without additional relief, millions of small businesses will face permanent closure in the coming months.\n\nToday I led a letter w/ @MarcoRubio &amp; @SenJoniErnst urging Congressional Leadership to pass additional #PPP funding ASAP.\n\nhttps://t.co/MVmsOgixGP","date":"Thu Sep 24 22:20:41 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to the men &amp; women who were honored at the inaugural @cdachamber Public Safety Awards!  \n \nThank you to Idaho’s law enforcement officers &amp; first responders for helping keep our communities safe.  #idpol\n\nhttps://t.co/BNsiVQGTCz","date":"Thu Sep 24 17:30:40 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":".@CSIEagles &amp; @IDigLearning have launched a free program to help teachers &amp; parents adjust to online learning. \n\nFor more information, see this article by @twinfallstn:\n\nhttps://t.co/c3767IWlBp","date":"Thu Sep 24 15:18:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho’s small businesses are the engine that powers our state’s economy. \n\nThis year’s National Small Business Week, I’d like to recognize the resilience and courage of small businesses throughout the Gem State. https://t.co/Sk3PHm7BB2","date":"Wed Sep 23 22:46:21 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Yesterday I joined @SteveDaines in asking Congressional Leadership to take up wildfire &amp; forest management legislation this year. \n\nWe need to reform forest policies before this wildfire season becomes the standard. \n\nhttps://t.co/nEYng5xfwE","date":"Wed Sep 23 22:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Versatile Test Reactor would:\n\n✅ Establish a testing facility in the US\n✅ Create jobs in Idaho at the @INL\n✅ Expand research and development of innovative #nuclear #energy\n \nThis is a crucial step in moving forward with the project.","date":"Wed Sep 23 17:29:42 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Important announcement from @ENERGY:\n\nhttps://t.co/uhXPo2Rlfh","date":"Wed Sep 23 17:29:41 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki &amp; I offer our sincerest condolences to the family of the pilot lost in this tragedy.  \n\nPutting their lives in danger daily, this is a humbling reminder of the risks our first responders take to keep our communities safe from wildfires.","date":"Wed Sep 23 13:41:22 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Access to broadband is critical for starting and growing a business. \n\nGlad to introduce legislation w/ @SenatorShaheen that will help rural Idaho businesses access broadband &amp; bridge the #digitaldivide. \n\nhttps://t.co/KzuBBwpXOc","date":"Tue Sep 22 21:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Farmers &amp; ranchers have worked tirelessly this year to provide for the American people. Now is not the time to strip away their safety net. Support for agriculture has long been bipartisan and should not be held as a bargaining chip. #idpol @FarmBureau @BeefUSA","date":"Tue Sep 22 18:53:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Small businesses are the backbone of our economy. \n\nI’m fighting for Idaho’s small businesses to help us recapture our incredible economic strength. https://t.co/wd5zXzh9b4","date":"Tue Sep 22 16:38:25 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Tomorrow kicks off @SBA National Small Business Week. Hosting virtual conferences all week, this event is a great resource for Idaho’s small business owners.\n\nTo learn more &amp; register your small business, visit the SBA’s website: https://t.co/avQtoMdd95","date":"Mon Sep 21 13:53:51 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"A great piece from @andybochman that demonstrates why @INL is a world leader in cybersecurity and energy research to make our electric grid and critical infrastructure more resilient. Read more below:\n\nhttps://t.co/FNcFGOmrsm","date":"Sat Sep 19 19:13:16 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"My statement on the passing of Justice Ruth Bader Ginsberg. \n\nhttps://t.co/onQfexpFMo","date":"Sat Sep 19 17:17:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you @realDonaldTrump &amp; @SecretarySonny for extending the Coronavirus Food Assistance Program 2 to Idaho commodities like wheat &amp; mink while improving support for our potatoes, dairy &amp; beef. CFAP 2 opens Monday--to apply visit https://t.co/TQEQv1PHft.","date":"Fri Sep 18 19:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Using #Huawei solar inverters on our electric grid would leave us vulnerable to surveillance &amp; interference from the Chinese gov't.\n\nLast year I sent @FERC a letter urging them to deny Beijing the opportunity to meddle with US energy supply.\nhttps://t.co/G2GeqSjupN\n@INL @SEL_News","date":"Fri Sep 18 15:45:17 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"With wildfires burning hotter, faster, and more frequently than ever before, our overworked frontline firefighting teams need backup from our allies.\n\nhttps://t.co/kDzO4z2wOC","date":"Fri Sep 18 13:05:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"ATTENTION IDAHOANS: If you do not file a federal income tax return, you may still be eligible to claim an Economic Impact Payment. To see if you are eligible, visit the IRS website and keep an eye out for mail from the Internal Revenue Service. \n\nhttps://t.co/23bQbLPm3h","date":"Thu Sep 17 19:52:15 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Interested in living &amp; working in Washington, DC? \n\nMy office is currently accepting applications for Spring 2021 internships through Nov 1st. If you are interested in gaining valuable experience on Capitol Hill, visit my website: https://t.co/k77bOXYZe6","date":"Thu Sep 17 15:50:11 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Congratulations to Trinity at City Beach in Sandpoint on being named the Idaho Small Business of the Month! Founded in 2009, @TrinityCuisine serves authentic creole cuisine and has been a staple of the Sandpoint community for more than a decade. \n\nhttps://t.co/s3lAWnb72U","date":"Thu Sep 17 13:33:47 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Wildfires are devastating the West &amp; the communities that live here. The bipartisan Emergency Wildfire and Public Safety Act will help manage our public lands &amp; prevent the 2020 fire season from becoming the new normal. https://t.co/XpzSaea0xP","date":"Wed Sep 16 23:02:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Honored to receive an \"A\" rating from @SBAList on their National Pro-Life Scorecard. \n\nThe most basic right we have is the right to life, and we must never stop working to protect the unborn. #ProLife https://t.co/M2cA08YCLq","date":"Wed Sep 16 20:00:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Governors come and go, but Claudia has been a fixture in the Idaho Governor’s office through five administrations – including my own! Congratulations Claudia on 25 great years of service, and thank you for all you’ve done for Idaho.","date":"Wed Sep 16 18:02:22 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"National Public Lands Day is the largest single-day volunteer effort to restore our public lands. @BLMIdaho invites Idahoans to participate in-person or virtually to help keep Idaho beautiful. \n\nFind details to participate here: https://t.co/nQeE0c6IXq","date":"Wed Sep 16 14:31:09 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"After nearly a year of being held prisoner in #China, I am pleased to announce Jeff Harper has returned to Meridian and has been reunited with his fiancée, Victoria. I am glad to have worked with @StateDept to help make this happen.\n\nWelcome home, Jeff!\n\nhttps://t.co/435mplqurN","date":"Tue Sep 15 23:07:59 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"It is a historic day for peace in the Middle East. Proud to join @POTUS at the @WhiteHouse today as #Israel, #UAE &amp; #Bahrain chart a path to a more stable &amp; peaceful future.","date":"Tue Sep 15 17:23:53 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"The Idaho Women’s Business Center is providing tools to help women-owned businesses create sustainable, successful business strategies that can take even the toughest blows. See how @IdahoWBC is helping small businesses navigate these uncertain times.\n\nhttps://t.co/GAFeWGM6mB","date":"Tue Sep 15 14:00:01 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Vicki and I are praying for Idahoans and our western neighbors who have been evacuated due to wildfires. Stay vigilant and stay safe.","date":"Sun Sep 13 22:42:32 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"19 years ago, I stood in my living room in Boise &amp; watched in shock as the Twin Towers collapsed. Today we remember the thousands who lost their lives in the #September11 terror attacks &amp; the first responders who gave their health &amp; safety to rescue the survivors. #NeverForget https://t.co/POmb0FfhlM","date":"Fri Sep 11 14:00:45 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Senate R’s COVID relief package would have provided targeted assistance to Idaho’s workers, families &amp; businesses experiencing the greatest need. I’m disappointed our Democrat colleagues have declined this opportunity to help struggling Americans.\n\nhttps://t.co/W5RqI7Ce8e","date":"Thu Sep 10 22:09:05 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Idaho has a proven track record in species recovery. Glad to partner with @SenatorEnzi to move this important legislation forward &amp; return management decisions back to our states. Read more here: https://t.co/SWxW7bBsFq.","date":"Thu Sep 10 15:37:45 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Thank you to the firefighters and first responders keeping our families, animals, and homes safe. As wildfires continue to burn across Idaho, it’s important to have a disaster preparedness plan. For resources to prepare and protect your loved ones, visit https://t.co/4pNE3wNChR.","date":"Wed Sep 09 14:30:00 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Since Vicki and I first toured the @INL in 1975, the Lab has become an unparalleled leader in nuclear energy and national security. Sign up to explore the Lab’s world-class facilities located right here in the Gem State.","date":"Tue Sep 08 20:09:59 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Happy Labor Day! Thank you to Idaho’s essential workers who have worked hard throughout the pandemic to keep the power on, the water running, and our grocery shelves stocked. All of Idaho is deeply grateful, and may God bless you and keep you safe.","date":"Mon Sep 07 16:00:02 +0000 2020","user_id":"1096059529"},{"handle":"SenatorRisch","text":"Recently I had the opportunity to sit down with the Executive Director &amp; Statewide Outreach Director at the Idaho Women’s Business Center. The @IdahoWBC is a great resource for Idaho's women small business owners working to achieve their entrepreneurial goals. https://t.co/6DnPm1PZik","date":"Sat Sep 05 19:00:00 +0000 2020","user_id":"1096059529"}]