[{"handle":"SenatorSinema","text":"The Senate just passed our bill to expand health care for AZ veterans exposed to toxic substances during their service; it’s now one step closer to becoming law. https://t.co/o0cFXnhobA","date":"Thu Jun 16 18:58:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re continuing our work with @lisamurkowski to strengthen workplace safety for social workers and health professionals. https://t.co/87ddcDBf3u","date":"Thu Jun 16 16:38:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"I’ve known Roopali for over 10 years. She's a trusted legal expert highly regarded across the political spectrum in Arizona, known for her integrity and fairness. Glad to see the President nominate her to serve as a U.S. Judge. https://t.co/SdOl4u1VUL","date":"Wed Jun 15 21:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill to boost medical research and treatment options for Arizonans living with valvular heart disease is now one step closer to becoming law.\nhttps://t.co/8lrIkYJc0n","date":"Wed Jun 15 16:56:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our office consistently hears from Arizonans in need of information on the VA Caregivers Program.\n\nThat’s why we’re hosting a Caregivers Webinar with the VA on June 22 at 11:00 a.m. to share information on its application &amp; appeal process. Sign up to join: https://t.co/yXOjeWjF67","date":"Wed Jun 15 14:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is World Blood Donor Day. If you’re able, consider donating blood. It’s fast, easy, and saves lives. https://t.co/YmL9oxrWtH","date":"Tue Jun 14 21:37:06 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@USArmy was established #OnThisDay in 1775. Thank you for keeping our nation safe and secure for 247 years.","date":"Tue Jun 14 19:22:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our new bill will create Arizona jobs by expanding aviation opportunities in our state. https://t.co/YV2D29zlyy","date":"Tue Jun 14 16:29:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Flag Day, Arizona! 🇺🇸","date":"Tue Jun 14 16:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Last year, we teamed up with @SenMarkKelly to introduce the Grand Canyon Protection Act – ensuring the Grand Canyon remains a safe and stunning part of our state for generations to come.\n\nGlad it will be further considered by the Senate Energy and Natural Resources Committee. https://t.co/7zFSL0jFU5","date":"Mon Jun 13 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our new bill will improve the Department of Defense’s ability to protect Arizona servicemembers from sexual assault, harassment, and domestic violence. https://t.co/fIKrdcqG5N","date":"Mon Jun 13 16:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re closely tracking the #PipelineFire and newly confirmed #HaywireFire burning in the Flagstaff area. Arizonans should follow evacuation orders from @CoconinoCounty and stay up to date by visiting: https://t.co/VgiAoaRIGr.","date":"Mon Jun 13 16:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This Women Veterans Day marks the 74th anniversary of the Women's Armed Services Integration Act – allowing women to serve as members of the Army, Marine Corps, Navy, and Air Force. Today and every day, we’re thankful to the brave women who served our country. 🇺🇸","date":"Sun Jun 12 21:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Bipartisan Group of 20 Senators Announce Agreement https://t.co/YkSaBYU85g","date":"Sun Jun 12 15:39:04 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As Arizonans come together to celebrate #GreatOutdoorsMonth, let’s remember to take caution when engaging in outdoor activities in the AZ heat. ☀️ 🌵","date":"Sat Jun 11 22:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"These amazing Arizonans are raising money for a new burn center through the @ValleywiseHthF’s Courage Rising campaign – check it out: https://t.co/mOXN8GopGQ","date":"Sat Jun 11 18:57:17 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Best of luck to the eight burn survivors, clinicians, and supporters of the Arizona Burn Center at @valleywise_az who are leaving tomorrow to climb Africa’s highest peak, Mt. Kilimanjaro. All of #State48 is rooting for you! ⛰️\nhttps://t.co/d0zyIXIbJi","date":"Sat Jun 11 18:57:16 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Rose Mofford – Arizona’s first woman Governor, and a true example for what it means to work on behalf of Arizonans – was born #OnThisDay in 1922. To this day, she’s an inspiration.","date":"Fri Jun 10 19:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It’s simple: equal work deserves equal pay. On the 59th anniversary of the #EqualPayAct, we pledge to continue working to close the gender pay gap. https://t.co/u96vRtdTR8","date":"Fri Jun 10 14:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured a federal grant to improve safety at two heavily trafficked crossings in Phoenix – 43rd and Camelback and 19th and McDowell – providing more safety for residents and businesses located on either side of the tracks. https://t.co/fIKrdcqG5N","date":"Thu Jun 09 22:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #Pride Month, we call on colleagues in both parties to come together in support of the #EqualityAct to ensure members of the LGBTQIA+ community can live freely and without discrimination. Let’s get this done. https://t.co/kgQI0rABsQ","date":"Thu Jun 09 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"With extreme heat predicted across Arizona this week, take extra caution when engaging in outdoor activities.\n\nRemember to drink water, dress for the heat, and check on loved ones.\nhttps://t.co/4OSaALGnGz","date":"Thu Jun 09 14:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: @AZDHS launched a resource page to help families struggling to find baby formula. If your families or loved ones need help, visit: https://t.co/erMd4pxiPy.","date":"Wed Jun 08 16:00:05 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We are addressing AZ’s doctor shortage by increasing training opportunities in our state including at rural hospitals. https://t.co/ZgXGmYj9IK","date":"Tue Jun 07 22:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined local leaders to celebrate the opening of the long-awaited #TempeStreetcar! Honored to have secured funding to bring this project to life and expand public transit options across Arizona. 🚃 https://t.co/OJsCZPTPxW","date":"Tue Jun 07 21:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to see the Senate come together and pass our bipartisan resolution raising awareness to protect Arizona seniors from predatory scams. https://t.co/5XSnIDHMhM","date":"Tue Jun 07 18:33:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate Homeland Security Committee approved our bill to crack down on foreign adversaries trying to influence U.S. policy. https://t.co/LNbl18JTtE","date":"Tue Jun 07 15:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today marks the 78th anniversary of D-Day. We remember and honor the incredible sacrifices made on the beaches of Normandy.","date":"Mon Jun 06 17:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate Homeland Security Committee approved our bill to strengthen preparedness and response against chemical, biological, and nuclear threats. https://t.co/sQQW9GoOGb","date":"Mon Jun 06 16:24:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad our office helped secure nearly $800,000 for Tempe’s @Alphacore14 to pursue cutting-edge technologies to address our changing climate. We’ll proudly keep working to support small businesses across our state.","date":"Sun Jun 05 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$18 million in new funding for @TucsonAirport – paired with investments from our infrastructure law – will boost tourism, improve safety, and fuel jobs for Arizonans.\nhttps://t.co/ZwE47LgGE3","date":"Sun Jun 05 16:56:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This exciting partnership will pave the way to a carbon-neutral economy for Arizona by 2050, creating good paying jobs and fueling innovation and sustainable energy sources throughout our state. https://t.co/gSNJwMjMPQ","date":"Sat Jun 04 20:47:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1919, the United States Senate recognized women’s right to vote with the passage of the 19th Amendment.","date":"Sat Jun 04 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We are working with the Renal Healthcare Association, which represents independent and community-based dialysis providers, to address ongoing impacts of COVID-19 and the need for extended telehealth services. https://t.co/j6NwjySAsF","date":"Fri Jun 03 23:47:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs law Arizona and Tribal school districts can now apply for clean school buses. School districts looking to apply, visit the link below.\nhttps://t.co/ma4xI3Dc0g","date":"Fri Jun 03 18:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today we #WearOrange to honor those we’ve lost to gun violence. We’re focused on finding solutions to increase safety, protect children, and ensure no American families have to fear violence in our schools. 🧡 https://t.co/vO8ZXRTHiw","date":"Fri Jun 03 17:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We were briefed by the Southwest Border Coordination Center on its work with border communities during the current border crisis. We’ll keep working to keep AZ border communities safe, secure the border, and ensure migrants are treated fairly and humanely. https://t.co/n4SqZnUJ99 https://t.co/sOwTv8n5cs","date":"Thu Jun 02 23:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured the San Ysidro Port of Entry to see firsthand how port modernization funding in our bipartisan infrastructure law improves border security and tackles supply chain challenges. https://t.co/1pdOBhTZ8d https://t.co/yYmrVNOecg","date":"Thu Jun 02 21:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@DeptVetAffairs launched Mission Daybreak — a $20 million initiative to help develop new strategies to curb veteran suicide. If you’re interested, submit your proposal by July 8, 2022 👉https://t.co/BPRCAhrxbn.","date":"Thu Jun 02 19:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Too many Arizona families have been impacted by Alzheimer’s. This Alzheimer’s and Brain Awareness Month, we honor those suffering from this disease and pledge to continue supporting new treatments and innovations improving quality of life. 💜 #ENDALZ","date":"Thu Jun 02 17:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"When wildfires threaten our communities, firefighters put their lives on the line to keep us safe. Our bill to improve firefighters’ health benefits is one step closer to becoming law. https://t.co/bqZW9r1X7u","date":"Wed Jun 01 22:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We talked with White Mountain Apache Chairman Velasquez about our bill to complete the White Mountain Apache Rural Water System and Miner Flat Dam project. https://t.co/N6ZIZknXq4","date":"Wed Jun 01 16:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #Pride Month, Arizona! As we come together to celebrate the LGBTQIA+ community, we acknowledge there is still so much work to be done in the fight to achieve equality for all. \n\nI’ll always work to empower queer youth to live freely and without discrimination. #Proud","date":"Wed Jun 01 16:35:26 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #GlobalRunningDay, Arizona! Don’t forget to hydrate while running in #State48. ☀️\nhttps://t.co/0o9yWvbKTe","date":"Wed Jun 01 14:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We fixed the Tomato Suspension Agreement in 2019. It’s protecting Arizona farmers, jobs, and cross-border trade – keeping our economy strong. https://t.co/qTsB4MvoWh","date":"Tue May 31 21:36:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate unanimously passed our resolution to designate May 2022 as Brain Tumor Awareness Month, honoring those impacted by brain tumors like Arizona’s own Sen. John McCain. https://t.co/H0l6nqQtJJ","date":"Tue May 31 16:17:55 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: @forestservice has declared that all of the National Forests in Arizona are implementing #Stage2 fire restrictions to reduce risks of wildfires. This means:\n\n❌ No campfires and stove fires\n\n❌ No smoking\n\n❌ No open flames\n\n❌ No vehicles off Forest System roads","date":"Mon May 30 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #MemorialDay, we remember and honor the brave Arizonans who gave their lives to defend our freedoms. We’re forever grateful for your service. 🇺🇸 https://t.co/Uaq4HMxQjg","date":"Mon May 30 14:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Stop by the incredible new mural at the American Legion Post 41 in Phoenix's Grant Park neighborhood and show your appreciation for the Valley's diverse veteran community. #MilitaryAppreciationMonth 🇺🇸\nhttps://t.co/4YB2f47uNy","date":"Sun May 29 23:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s beautiful public lands and outdoor spaces are some of the best parts about living in #State48. Our new legislation boosts AZ’s outdoor recreational tourism industry, fueling job growth and recreational opportunities across our state. https://t.co/NgQtkQCBdk","date":"Sun May 29 20:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans - do you have plans to visit Washington, D.C. this summer? Our office is happy to make the most of your visit, including booking tours of the U.S. Capitol:\nhttps://t.co/BNLQ51S918.","date":"Sun May 29 16:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: if you’re searching for a new job, be on the lookout for scams trying to take advantage of your personal information.\nhttps://t.co/JOqzPO5KNY","date":"Sat May 28 23:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced the STREAM Act to strengthen Arizona’s water storage, recycling, and desalination projects, helping ensure Arizona’s water future is safe and secure.\nhttps://t.co/0LBgYj0S7t","date":"Sat May 28 17:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thankful for the perspective our Veterans Advisory Council brings as we keep working to ensure all Arizona veterans get the care and benefits they've earned. https://t.co/kxBVyEKOOw","date":"Fri May 27 19:03:45 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"All Arizonans deserve access to safe housing. We’re proud to help secure $134.6 million in housing grants for tribal communities across Arizona. https://t.co/EAzvasTJbn","date":"Fri May 27 17:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured $18 million for runway upgrades at @TucsonAirport. These funds, paired with investments from our infrastructure law, will boost tourism, improve safety, fuel jobs, and expand economic opportunities for Arizonans. https://t.co/r6RiqjmzlX","date":"Fri May 27 16:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Illegal cross-border tunnels pose a serious threat to the safety and security of Arizonans. We’re cracking down on cartels by telling CBP to identify and seal off these tunnels used to smuggle drugs, weapons, and people across our border. https://t.co/Vuzt7SAZV6","date":"Fri May 27 15:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans, ICYMI - the Farm Service Agency (@usdafsa) is offering $6 billion in emergency relief funds to farmers and ranchers impacted by natural disasters in 2020 and 2021. Find out if you’re eligible: https://t.co/YSA4qb4tPk","date":"Fri May 27 15:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re introducing bipartisan legislation to lower costs for credit unions, particularly those in rural areas, so Arizonans have access to reliable banking services. https://t.co/x3roMElgFZ","date":"Thu May 26 17:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re introducing new bipartisan legislation to provide relief for Arizona small businesses. https://t.co/zxDHe0vISQ","date":"Wed May 25 21:28:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The U.S. House and Senate Veterans’ Affairs Committees reached agreement on our bipartisan bill expanding health care access for veterans exposed to toxic substances. It’s now one step closer to becoming law. https://t.co/LafPBvrQ6o","date":"Wed May 25 18:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We are horrified and heartbroken by the senseless tragedy unfolding at Robb Elementary School in Texas and grateful to the first responders for acting swiftly. No families should ever have to fear violence in their children's schools.","date":"Tue May 24 22:37:45 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As our nation reaches a tragic milestone of 1 million Americans lost to COVID-19, we offer our condolences to the families of the deceased, and recommit ourselves to combatting this deadly virus and preventing future pandemics. https://t.co/2l4MqPAybz","date":"Tue May 24 18:41:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to be recognized in this year’s #Time100 by my dear friend and trusted partner, @lisamurkowski. Thank you for the kind words – now let’s get back to work. 💪 \nhttps://t.co/W1zzKRUalL","date":"Tue May 24 15:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The current infant formula shortage is unacceptable. Our new law is a strong first step to help Arizona families struggling to find formula, and we’ll keep working to get formula on grocery shelves quickly. https://t.co/NPg9IAUlhM","date":"Mon May 23 21:35:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to be recognized as one of the most bipartisan lawmakers in Congress. I promised to work with colleagues in both parties to do what’s right for our state – and that’s exactly what I’ll keep doing on behalf of everyday Arizonans. \nhttps://t.co/Udxs2i3cDy","date":"Mon May 23 21:25:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cracking down on foreign adversaries looking to influence U.S. policy. https://t.co/6N2thBChvP","date":"Mon May 23 18:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"ICYMI - we’re honoring the lives and legacies of Justice O’Connor and Justice Ginsburg with legislation permanently placing their statues in the U.S. Capitol: https://t.co/8LrShqLIju","date":"Sun May 22 19:14:50 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“The overwhelming support for the statues of these 2 women with very different backgrounds speaks to something missing from much of today’s politics: respect for the other… Understanding that the other point of view is not intended to ruin the country.” - Jay &amp; Scott O’Connor 👏","date":"Sun May 22 19:14:49 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ farmers and ranchers have been hit hard by increasingly frequent natural disasters. The Farm Service Agency (@usdafsa) is offering $6 billion in emergency relief funds to crop producers impacted by natural disaster events in 2020 and 2021. More:\nhttps://t.co/YSA4qb4tPk","date":"Sun May 22 16:00:02 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Arizona Restaurant Week! Today through May 29, help our state’s restaurants continue to drive our economy and recover from the pandemic. Find a place to eat near you: https://t.co/Nwpe2d7YuK.","date":"Sat May 21 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #ArmedForcesDay, we thank the brave men and women in uniform who work tirelessly to keep our nation safe and secure. #MilitaryAppreciationMonth https://t.co/LwfhYJm0fp","date":"Sat May 21 17:01:39 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to speak with students from @uarizona who are dedicating their studies and careers to keeping our nation safe and secure. Best wishes as they work towards making our state and country a safer place. https://t.co/NsX8IdRhpE","date":"Fri May 20 18:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with @SRPconnect leaders to discuss Arizona’s energy and water future. https://t.co/zs4eqn1TD7","date":"Fri May 20 16:30:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We chaired an Aviation Subcommittee hearing in Goodyear. For AZ to keep leading in aviation, we need both the infrastructure and the workforce to keep flying safe. That's why we ensured our infrastructure law includes the largest investment in air infrastructure in a generation. https://t.co/m2PiVasMin","date":"Fri May 20 16:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Increased Aid for Ukraine https://t.co/FpaESrM6HX","date":"Thu May 19 20:21:46 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on vote to debate and amend the small business aid package https://t.co/1jrqo51YQG","date":"Thu May 19 18:28:37 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona lost 21 brave law enforcement officers in 2021. The Senate approved our resolution honoring them, their families, and all of Arizona’s law enforcement community risking their lives every day to keep Arizona families safe and secure. https://t.co/EFgqWtluSz","date":"Thu May 19 15:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We saw firsthand the damage wildfires like the #TunnelFire can cause, with 31 homes lost and many more damaged in Flagstaff. Wildfires spread quickly and unpredictably – sign up for local alerts from your county: https://t.co/twJ3tzgHNR.\nhttps://t.co/U8SzLnhjEz","date":"Thu May 19 15:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're joining our Senate colleagues to call on the Administration to help Arizona families and implement a national strategy for increasing the availability of infant formula, improving the current supply chain, and protecting against future shortages. https://t.co/pS27wYIJAB","date":"Wed May 18 23:19:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our new bill builds on our bipartisan infrastructure law’s investments in Arizona’s water supply by strengthening Arizona’s water storage, recycling, and desalination projects, helping secure Arizona’s water future. https://t.co/2wBSFvpRWT","date":"Wed May 18 21:12:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with the Arizona Water Conservation District and the Arizona Department of Water Resources to receive an update on Arizona’s response to the worsening drought conditions in the Lower Colorado River Basin. https://t.co/P3oM1kK5XH https://t.co/LPtfHsMiqL","date":"Wed May 18 20:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable with Arizona clean energy industry leaders and the Arizona Technology Council to discuss the historic investments our Infrastructure Investment and Jobs law makes in clean energy and technology. https://t.co/uXLBnjlIVG https://t.co/rVYu0WsJVA","date":"Wed May 18 18:04:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We sat down with our Veterans Advisory Council to discuss our ongoing work to ensure Arizona veterans get the care and benefits they’ve earned through service to our country. https://t.co/iiBqXhxah5 https://t.co/Bi8VWz83oS","date":"Tue May 17 21:41:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to tour the United Aviate Academy and see how Arizona continues to lead the nation in aviation by investing in our pilots of tomorrow. https://t.co/N0CaI7kYAX https://t.co/jEuoAvUooZ","date":"Tue May 17 20:30:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great meeting virtually with @AARPArizona! We’re keep working to lower costs for prescription drugs while fueling innovation and ensuring Arizona seniors can keep more of their money in their pockets. https://t.co/DocSHPdlTV","date":"Tue May 17 19:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy 110th Birthday, @cityofchandler! 🌵","date":"Tue May 17 16:00:03 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our bipartisan Infrastructure Investment and Jobs Law, Arizona families will see increased access to affordable internet. https://t.co/JHHC26IXnr","date":"Mon May 16 22:39:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The current baby formula shortage is stressful for Arizona families. If you’re unable to find or afford baby formula during this challenging time, explore resources, hotlines, and support available to you. ⬇️\nhttps://t.co/0bpYWeHJPQ","date":"Mon May 16 21:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our aviation field hearing provided invaluable perspective into how we can continue partnering with aviation industry leaders and workers to ensure their needs are met and our aviation workforce remains strong. https://t.co/Oe8BCgKS3W","date":"Mon May 16 18:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #NationalCancerResearchMonth, we passed a bipartisan resolution calling for innovations in treating glioblastomas in honor of Senator John McCain. ⬇️\nhttps://t.co/DixLYKO5bE","date":"Sun May 15 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today and every day, we honor the sacrifices of law enforcement officers who lost their lives keeping Arizonans safe. #NationalPeaceOfficersMemorialDay","date":"Sun May 15 16:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs law the Yuma area will receive $82 million to repair and improve outdated water systems, helping to secure our water future.\nhttps://t.co/6q4sq4ijQj","date":"Sat May 14 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"May is #AAPIHeritageMonth. This month and every month, we stand united against anti-Asian discrimination, and celebrate the important contributions of the Asian American and Pacific Island community to our state and country.","date":"Sat May 14 15:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re chairing a Senate Aviation Subcommittee hearing in Goodyear to discuss aviation safety and workforce needs with industry leaders and workers. Watch Live: https://t.co/GuNrKiI9ut","date":"Fri May 13 18:02:45 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Such fun w/ @SenCapito and team at this morning’s @ACLINews #capchallenge - it was great to be out there together again &amp; I can’t wait for next year’s race! 🏆 https://t.co/eAxKntYRsR","date":"Thu May 12 21:47:53 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"During #PoliceWeek, we’re grateful for the service and sacrifice of AZ law enforcement. Tomorrow at 8 p.m., The National Law Enforcement Officers Memorial Fund (@NLEOMF) will honor Arizona officers who fell in the line of duty last year. Stream here: https://t.co/QWFdVspriT.","date":"Thu May 12 21:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"🏃‍♀️🏆","date":"Thu May 12 13:13:56 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #NationalSchoolNurseDay, we celebrate the amazing school nurses caring for AZ kids across our state.","date":"Wed May 11 23:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Rising prices are making everyday essentials more expensive for Arizonans. We questioned @SecYellen about getting inflation under control. https://t.co/ZFqBM1AmaD","date":"Wed May 11 16:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wildland firefighters risk their lives to keep Arizona communities safe. They should be paid fairly. https://t.co/7c43eofzNB","date":"Wed May 11 01:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable with leaders from across Yavapai County to discuss the region’s infrastructure priorities as we work to distribute funding from our bipartisan infrastructure law. https://t.co/pJOX2ImO8A https://t.co/gN3Vsqv5M5","date":"Wed May 11 00:17:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Crooks fire burned nearly 10,000 acres south of Prescott. We visited to U.S. Forest Service Prescott Fire Center to discuss fire mitigation and recovery efforts in Yavapai County, and how funds from our infrastructure law could help. https://t.co/o8hFii128F https://t.co/iV30OIOpPf","date":"Tue May 10 18:49:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re investing in Arizona’s energy future through mining education programs that will fuel jobs, clean up abandoned mines, and keep Arizona communities safe. https://t.co/7QWw5Er9J4","date":"Mon May 09 22:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We saw firsthand the damage the Tunnel Fire caused. We’re committed to implementing historic funding from our infrastructure law to help prevent and lessen the impact of future fires. https://t.co/xjUZACAXwy https://t.co/UBD2okBqYd","date":"Mon May 09 19:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ Shadow Wolves have worked to keep the Tohono O’odham Nation -- and all of Arizona -- safe and secure for decades. Now that our bipartisan bill has been signed into law, they’ll have the support and resources necessary to do their jobs.\nhttps://t.co/mSs5MWUtOu","date":"Sun May 08 23:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Mother’s Day, Arizona! 🌵","date":"Sun May 08 15:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This is awesome news! @NAU’s Access2Excellence program fully covers tuition for every Arizonan with a household income of $65,000 or less. 👏\n\nMore information: https://t.co/z3yUvuUvMr.","date":"Sat May 07 23:00:15 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@USDA expanded access to four loan guarantee programs funding job creation and infrastructure improvement in rural communities. Arizona nonprofits, tribes, and other private lenders are all encouraged to check out the details here:\nhttps://t.co/Ypelu3AA9l","date":"Sat May 07 17:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Military spouses help keep our country safe with their love and support for our brave servicemembers. Thank you for your strength and service. #MilitarySpouseAppreciationDay","date":"Fri May 06 21:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s public servants serve in our military, care for our veterans, protect our borders, and deliver critical care and resources for all Arizonans – I’m proud the Senate came together to honor them with our resolution. https://t.co/4tQwLlTb1z","date":"Fri May 06 20:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #NationalSpaceDay, Arizona! We’re hard at work making sure our state continues to lead the nation in space exploration, research, and innovation.","date":"Fri May 06 19:33:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Nurses support us during some of the toughest moments of our lives. That’s been especially true throughout the COVID-19 pandemic. On #NationalNursesDay, we celebrate the amazing Arizona nurses going above and beyond to care for our loved ones.","date":"Fri May 06 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with @SecretaryPete about how DOT will ensure Arizona receives the funding it needs for infrastructure projects from our bipartisan InfrastructureInvestment and Jobs law. https://t.co/OEmpss70QI","date":"Fri May 06 16:19:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We asked the admin how it plans to handle an influx of migrants when Title 42 ends. A sufficient plan must be in place to protect the health and safety of migrants and Arizona communities. So far we have not heard enough to have confidence in their plans. https://t.co/PDJLC53YkS","date":"Thu May 05 18:31:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Cinco de Mayo, Arizona! Today, we celebrate the countless Mexican Americans across our state who enrich Arizona’s culture and history. 🇲🇽","date":"Thu May 05 16:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"¡Feliz Cinco de Mayo, Arizona! Hoy celebramos a los mexicanos estadounidenses de nuestro estado quienes enriquecen la historia y cultura de Arizona. 🇲🇽","date":"Thu May 05 15:59:08 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona communities pay the price for the federal government’s failures to fix our broken immigration system. DHS needs to put more resources in Arizona before lifting Title 42 because every time migration surges Arizona communities are impacted. https://t.co/CoXrN6MrEQ","date":"Wed May 04 23:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re working to ensure the Hualapai Tribe’s economic and water security by delivering the Tribe’s water rights agreement which will help strengthen water systems, secure the Tribe’s water future, and create jobs. https://t.co/NMf2bRGYNA","date":"Wed May 04 23:04:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to join Arizona veterans on their flight from Phoenix to Washington honoring and celebrating their service to our country. https://t.co/X69461tSwb","date":"Wed May 04 19:33:37 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our bipartisan resolution establishing July 20 as Glioblastoma Awareness Day in honor of Sen. John McCain. https://t.co/hEUFdrwDkR","date":"Wed May 04 16:16:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to join AZ veterans on their Hero’s Welcome flight from Phoenix to DC. Grateful to @HonorFlightNet’s efforts to honor our veterans by bringing them to our nation’s capital. https://t.co/IxMvZvtZPC","date":"Wed May 04 01:25:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Draft Supreme Court Opinion https://t.co/3GYIF3YnM7","date":"Tue May 03 15:33:24 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill will allow CBP to hire more officers at our Land Ports of Entry helping strengthen our border security, continue our economic growth through legal trade and travel, and help ease the immense strain CBP officers face. https://t.co/m9jeYEhiOE","date":"Mon May 02 16:49:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #TeacherAppreciationWeek, Arizona! This week, we celebrate and thank the dedicated educators across our state.","date":"Mon May 02 15:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"May is Month of the Military Caregiver. This month, we celebrate and honor the millions of military caregivers across the U.S. who help veterans navigate day-to-day activities with a sense of independence and freedom.","date":"Sun May 01 19:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Small Business Week! Arizonans know small businesses are the backbone of our state’s economy, creating jobs and delivering critical services to local communities. This week, we encourage you to celebrate with your support and #ShopSmall: https://t.co/1v7aEN2vIe","date":"Sun May 01 15:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"I’m shocked and saddened to learn of Allister Adel’s sudden passing. Our thoughts are with her family during this incredibly difficult time — may she rest in peace.","date":"Sat Apr 30 21:33:50 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans know all too well that increasing wildfires threaten the health and safety of communities across our state. Our bipartisan infrastructure law’s historic investments in wildfire mitigation will prevent wildfires and boost recovery efforts.\nhttps://t.co/PJGr63BYKp","date":"Sat Apr 30 17:04:57 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad our bipartisan infrastructure law creates economic opportunities and reduces flooding on tribal lands by providing over $2.5 million for key local projects. More ⬇️\nhttps://t.co/qYTCrfd7xV","date":"Fri Apr 29 21:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re boosting Arizona’s outdoor recreational tourism industry, fueling job creation and expanding recreational opportunities across our state. https://t.co/l8rbnBWgrg","date":"Fri Apr 29 18:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Entrusting the Tohono O’odham Shadow Wolves with more authority to investigate and interdict illegal border activity will keep Arizona families safe and secure. \n\nOur bill reclassifying the Shadow Wolves unit as special agents is now law. ⬇️ \nhttps://t.co/YhQxUjd5VZ","date":"Thu Apr 28 21:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re now one step closer to our COMPETES Act becoming law and investing in our domestic semiconductor industry – creating high-paying jobs and helping to lower prices for electronic goods. https://t.co/wQkutggbAs","date":"Thu Apr 28 19:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On Yom HaShoah, we honor the six million Jewish lives lost during the Holocaust. #NeverAgain.","date":"Thu Apr 28 01:08:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In today’s Commerce Committee hearing we highlighted rising costs, the importance of boosting semiconductor manufacturing, and the need to increase wildfire mitigation and recovery efforts. https://t.co/3sXqdmT30Q","date":"Wed Apr 27 21:24:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce over $5 million in grants for 12 Arizona rural health centers. Rural health care organizations are lifelines for underserved communities, and this funding will provide the needed resources to keep Arizonans healthy and safe. https://t.co/Bf7nkjqQ27","date":"Wed Apr 27 16:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Current weather conditions create a dangerous environment for new wildfires to spread quickly. Let’s do our part to keep our neighbors and loved ones safe – check out the fire safety tips below. #OneLessSpark","date":"Wed Apr 27 16:31:18 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re working with colleagues in both parties to boost domestic manufacturing, reducing supply chain challenges and lowering prices for everyday Arizonans.\n\nAwesome seeing our work in action at Digital Building Components’ Fabrication Plant in Phoenix. https://t.co/fQVmBUVI3z","date":"Tue Apr 26 21:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce that our bipartisan infrastructure law will bring $10.2 million to rural Arizona communities to strengthen schools, roads, and crucial services. https://t.co/u80C6iNWzk","date":"Tue Apr 26 18:31:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona is a leader in climate science and research. We’re continuing our support for @uarizona’s work to address climate change while increasing economic opportunities. https://t.co/FO87OxmkR8","date":"Mon Apr 25 20:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our bipartisan infrastructure law more than $2.5 million will go to reducing flooding and protecting river wildlife on tribal lands in Arizona. https://t.co/WeEsdadvmz","date":"Mon Apr 25 16:27:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"After a lifetime of hard work, Arizonans count on Medicare and Social Security for a secure retirement. We’ll keep working to protect Arizona seniors' hard-earned benefits. #SocialSecurityMonth","date":"Mon Apr 25 00:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our commonsense, bipartisan bill boosts Arizona businesses by making it easier to grow and create jobs. ⬇️\nhttps://t.co/2AALaAQMZd","date":"Sun Apr 24 19:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Suicide is the second-leading cause of death for young adults in the United States. Glad @uarizona is taking steps to support AZ students’ mental health in times of crisis.\nhttps://t.co/Zq2XeAUYbs","date":"Sat Apr 23 21:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s national parks – like @PetrifiedNPS, @GrandCanyonNPS, @SaguaroNPS, and soon the Chiricahua – grow our state's economy and create AZ jobs. We're working to protect and expand them for future generations of Arizonans to enjoy. #NationalParkWeek\nhttps://t.co/iTt4svXK3w","date":"Sat Apr 23 18:15:19 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced a bipartisan resolution to honor the Ukrainian women leading efforts and risking their lives for peace, security, and a free and democratic Ukraine. https://t.co/51xXqiCQZD","date":"Fri Apr 22 22:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our nation lost a hero 18 years ago today. Pat Tillman's legacy of service, honor, and strength continues to inspire us all. #NeverStop","date":"Fri Apr 22 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs law is bringing $176M to Arizona for public transit upgrades this year. This money will fuel jobs and create economic opportunities in communities across Arizona. https://t.co/idDsT5e4wi","date":"Fri Apr 22 16:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Earth Day! Arizona is known for our stunning parks and public lands – and we’re committed to protecting them for generations to come. This #EarthDay, we're working to ensure every Arizona family has clean air to breathe and water to drink. https://t.co/5tDuzykb3T","date":"Fri Apr 22 15:04:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill permanently placing statues of Supreme Court Justices O’Connor and Ginsburg in the U.S. Capitol is now law. https://t.co/6TO3Ci3fTg","date":"Thu Apr 21 16:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: Pat’s Run is this Saturday, April 23 in Tempe! \n\nNot able to make it? Participate virtually ⬇️ https://t.co/zMFkQxMFyr","date":"Thu Apr 21 15:21:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad our bill to classify the Tohono O’odham Shadow Wolves unit as special agents is now law. Entrusting the Shadow Wolves with more authority to investigate and interdict illegal border activity will keep Arizona families safe and secure. https://t.co/z2zAbvTAZ6","date":"Wed Apr 20 20:17:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with Navajo leaders and community members about how our bipartisan Infrastructure Investment and Jobs law addresses key priorities for tribal communities. https://t.co/fC73LIrUdF https://t.co/WMLTPJCWnr","date":"Wed Apr 20 16:22:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to continue our partnership with Arizona Veterans Service Organizations as we work to hold the VA accountable, ensuring our veterans receive the care and benefits they’ve earned. https://t.co/pCWXKjkekw https://t.co/G7QQYrgArl","date":"Tue Apr 19 17:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable discussion with mayors and local leaders from Navajo, Gila, and Apache Counties to highlight the historic investments her bipartisan Infrastructure Investment and Jobs law makes in Eastern Arizona. https://t.co/6wNuecEdeu https://t.co/yjKYBIqupU","date":"Tue Apr 19 13:31:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Increasing wildfires threaten the health and safety of Arizona communities. Our bipartisan infrastructure law’s historic investments in wildfire mitigation will prevent wildfires and boost recovery efforts across our state. https://t.co/6udbTag0HL","date":"Mon Apr 18 17:48:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We visited Winslow and saw firsthand how our infrastructure law protects the community from flooding by fully funding the Winslow Levee Project. We’ll keep working with local leaders like Mayor Cano to ensure AZ receives every dollar it’s due.\nhttps://t.co/93OSgRh5Bc","date":"Sun Apr 17 22:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Easter to all Arizonans celebrating! Wishing everyone a safe and happy holiday with your families and loved ones. 💐 🐰","date":"Sun Apr 17 15:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"So glad our office was able to work with the IRS and help Andrea get the tax refund she deserves. \n\nArizonans: if you need assistance, reach out to our team 👇casework@sinema.senate.gov.\nhttps://t.co/e6TeVUppAS","date":"Sat Apr 16 21:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy National Park Week, #State48. https://t.co/L9muwtu5dQ","date":"Sat Apr 16 18:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Chag Sameach to all Arizonans celebrating #Passover!","date":"Sat Apr 16 00:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We sat down with Arizona labor leaders to highlight the historic investments our bipartisan Infrastructure Investment and Jobs law makes supporting Arizona workers and businesses. https://t.co/mmufVln4ms https://t.co/rlQnjE3jNH","date":"Fri Apr 15 16:12:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable with local mining and defense industry leaders to discuss how our bipartisan infrastructure law addresses supply chain issues and boosts production of critical minerals. https://t.co/3JwD03VLNh https://t.co/AzoD24TK2C","date":"Thu Apr 14 23:13:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Administration’s extension of public health emergency authorities proves the need to delay lifting Title 42. We’re pushing for transparency and accountability to secure the border and ensure the health and safety of AZ communities and migrants. https://t.co/t81y2GfWgU","date":"Thu Apr 14 15:54:35 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"John McCain serves as a constant source of inspiration to so many Arizonans. We’re honoring him and other Americans who have battled glioblastoma and putting our support towards finding new treatments for all brain cancers. https://t.co/uBX5ZPdDPl","date":"Wed Apr 13 20:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to count the @AZChamber as a trusted partner in fueling economic growth for our state and helping Arizonans return to normal and thrive. It was great to join their annual Update From Capitol Hill lunch.\nhttps://t.co/Zk5udCxUlo https://t.co/20BiCPOq4e","date":"Wed Apr 13 17:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to join Mayor Cano and local leaders in Winslow! We’re so glad investments from our infrastructure law will protect Arizonans from dangerous flooding by fully funding the construction of the Winslow Levee Project.\nhttps://t.co/DN7G7WHXCM https://t.co/SjiVbSF4wp","date":"Tue Apr 12 19:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1981, the Space Shuttle Columbia launched from @NASAKennedy. 🚀","date":"Tue Apr 12 19:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: @AZHousing’s Homeowners Assistance Program helps Arizona homeowners struggling to pay their mortgage and utilities. Funding is available for immediate distribution – find out if you’re eligible: https://t.co/b1gRYBdMsn.","date":"Tue Apr 12 16:40:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced a bipartisan bill to help more small and medium-sized businesses in Arizona conduct an initial public offering and create jobs.\nhttps://t.co/E0kUxP08OO","date":"Mon Apr 11 20:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: Monday, April 18 is the last day to file your 2021 taxes. File online and avoid these common mistakes for a quicker return: https://t.co/QUbI1tPAvE","date":"Sun Apr 10 20:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Caregivers help our veterans navigate day-to-day activities with a sense of independence and freedom. The @DoleFoundation launched a new program helping AZ caregivers cover unexpected expenses – check it out:\nhttps://t.co/tebzrF6VTe","date":"Sun Apr 10 17:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On Thursday, April 14, @VAVetBenefits will host a virtual International Outreach Symposium to inform members of the International Veteran Community of the VA benefits and services available to them while they are abroad. More: https://t.co/rS6y5pJ1N9","date":"Sat Apr 09 20:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great news, Arizona – the Senate came together to unanimously pass our bill making the Chiricahua National Monument in Cochise County Arizona’s fourth National Park. Check it out:\nhttps://t.co/Kgcl1jlyDL","date":"Sat Apr 09 16:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Starting this week, Arizonans enrolled in Medicare can pick up eight COVID-19 tests each month free of charge. More: https://t.co/RxiQBqenzW.","date":"Fri Apr 08 20:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"César Chávez began his legacy of service in Yuma – and spent his life championing everyday families and fighting for worker’s rights across the United States. Glad our resolution celebrating his incredible accomplishments has passed the Senate. https://t.co/9r9Nr32bNr","date":"Fri Apr 08 17:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad the Senate unanimously approved a ban on Russian oil and gas imports and stripped Russia of its preferred trade status. We must keep providing military and humanitarian assistance to Ukrainians as Russians illegal war continues. https://t.co/DDXu9AcWai","date":"Thu Apr 07 19:25:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Ending Title 42 without a firm, workable plan to protect AZ communities and migrants is a mistake. We introduced a bipartisan bill to force the Administration to work with border communities to put a comprehensive plan in place before they lift Title 42. https://t.co/mbjCqA3nMK","date":"Thu Apr 07 16:35:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Voting to Confirm the Nomination of Judge Ketanji Brown Jackson to be an Associate Justice of the U.S. Supreme Court https://t.co/gW56qH8ccz","date":"Thu Apr 07 15:44:31 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Each year our office nominates Arizona students to our nation’s Service Academies. Applications are open now – and we’re looking forward to supporting talented young Arizonans dedicated to serving our country. Interested applicants should visit https://t.co/I80mickIf2","date":"Wed Apr 06 18:27:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“Beyond MST” is a free app for survivors of military sexual assault or harassment to cope with challenges, navigate symptoms, and find hope.  #SexualAssaultAwarenessMonth","date":"Wed Apr 06 16:53:21 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our Shadow Wolves Enhancement Act to classify the Tohono O’Oodham Shadow Wolves unit as special agents, allowing them to better patrol, investigate, interdict, and secure the border. https://t.co/Ak6PJaOCrY","date":"Wed Apr 06 00:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The cost of insulin remains too high for everyday families, especially with rising prices at the grocery store and gas pump.\n\nThat's why we cosponsored legislation to cap the cost of insulin at $35 a month. https://t.co/CNhOOdR4lT","date":"Tue Apr 05 21:00:02 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to discuss some of the main issues facing the San Carlos Apache Tribe with Chairman Rambler including water delivery challenges and the need for the Bureau of Indian Affairs to construct an adequate replacement for its law enforcement facility. https://t.co/Tg9iz94lPI","date":"Tue Apr 05 18:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The US men's soccer team (@USMNT) qualified for the @FIFAWorldCup -- congratulations!  #Qatar2022 Bound 🇺🇸  ⚽️","date":"Tue Apr 05 16:00:03 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re calling on congressional leaders to provide Arizona with robust COVID relief to ensure our most vulnerable – including uninsured Arizonans – have the life-saving, critical care they need from Arizona’s health care providers. https://t.co/1bVCJEC3XN","date":"Mon Apr 04 21:16:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona leads the nation in technology and innovation, and we’ll continue partnering with local leaders to further strengthen STEM opportunities in our state and help create the jobs of the future. https://t.co/qsQc26jmq7","date":"Mon Apr 04 19:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored our team attended the 9th Annual Tuskegee Airmen Commemoration Day Celebration at @LukeAFB. We’re so grateful for your service. 🇺🇸 https://t.co/VKVrkWhOuv","date":"Mon Apr 04 19:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"April is #AutismAwarenessMonth. The Autism Society of Southern Arizona (@AutismSocietyAZ) provides resources and support for adults with autism ➡️ https://t.co/rbxvhUrENO.","date":"Sun Apr 03 20:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #NationalLibraryWeek, we’re celebrating the incredible libraries and librarians across our state! Connect with your local library to get involved. ⬇️\nhttps://t.co/srTdgcPwzq","date":"Sun Apr 03 16:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ servicemembers, veterans, and military families: don’t miss the Arizona Coalition for Military Families (@AzCoalition) 12th Annual Statewide Symposium on April 20 &amp; 21, 2022 for opportunities to connect &amp; network. Register here: https://t.co/6yXQ0zEvKs.\nhttps://t.co/1x3oFfQIyO","date":"Sat Apr 02 19:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1917, Jeannette Rankin made history as the first woman sworn into Congress.","date":"Sat Apr 02 15:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Ramadan Mubarak to all Arizonans observing Ramadan!","date":"Sat Apr 02 02:02:17 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Far too many seniors in Arizona struggle to find affordable housing, and seniors are among the most vulnerable to rising prices and rent increases. We'll keep working to ensure all seniors can access affordable housing and retire with dignity and respect. https://t.co/xpQDy2Nn3L","date":"Fri Apr 01 18:48:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@AF_Academy was founded #OnThisDay in 1954. We’re honored to nominate outstanding Arizona students each year to attend our nation’s service academies, including the U.S. Air Force Academy.\nhttps://t.co/4lWIKNauXi","date":"Fri Apr 01 15:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on President Biden’s Decision to Release Oil Reserves and Lower Gas Prices https://t.co/vprFIOATnA","date":"Thu Mar 31 22:53:13 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s social workers have served on the front lines during the pandemic caring for Arizonans at their most vulnerable. As a social worker myself, I’m proud to recognize their service with this Senate resolution. https://t.co/1n9PbxMFCA","date":"Thu Mar 31 20:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #CesarChavezDay, we honor the life and legacy of Cesar Chavez, a Yuma native who championed everyday families in AZ and across the U.S.","date":"Thu Mar 31 15:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with the @DHSgov Secretary about the administration’s Title 42 contingency plans following our letter to the President urging him not to end Title 42 without a comprehensive plan to support border communities. https://t.co/yKzPAcR1Cb","date":"Wed Mar 30 23:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement Following Briefing on Russia’s Invasion of Ukraine https://t.co/8JlaR50zoj","date":"Wed Mar 30 20:42:52 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with Yuma Sector Border Patrol Chief Clem about the situation on the border and how we can ensure they have the resources they need to secure the border and ensure migrants are treated fairly and humanely. https://t.co/t8or0kivmn","date":"Wed Mar 30 18:42:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ Shadow Wolves have worked to keep the Tohono O’odham Nation -- and all of Arizona -- safe and secure for decades. It’s time to ensure they have the support and resources necessary to do their jobs.\nhttps://t.co/7NjKketB6Q","date":"Wed Mar 30 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re pleased the IRS has heeded our call and taken action to help address its harmful tax return backlog, help Arizonans get the assistance they need, and allow Arizonans to get their hard-earned money back in their pockets. https://t.co/61gliEjFov","date":"Tue Mar 29 22:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The State Department should increase border security collaboration with Mexico and ensure the closure of illegal cross-border tunnels to prevent criminal organizations from using them to smuggle weapons and drugs. https://t.co/1ykBZQHR9o","date":"Tue Mar 29 19:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It’s #VietnamVeteransDay. We’re forever grateful to our men and women in uniform for keeping us safe and secure. 🇺🇸","date":"Tue Mar 29 19:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Justices O’Connor and Ginsburg paved the way for so many women in law and life. By permanently placing their statues in the U.S. Capitol, we’re honoring their legacy and reminding visitors that women can achieve their dreams through grit and determination. https://t.co/EhWtghp1i8","date":"Tue Mar 29 17:40:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$2.9 billion in new federal grant funding will be made available for Arizona transportation projects thanks to our bipartisan Infrastructure Investment and Jobs law.\n \nFor help accesses funding email outreach@sinema.senate.gov.\n\nhttps://t.co/HaHUsomELS","date":"Mon Mar 28 22:09:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud we passed into law key priorities to secure the border, keep Arizona communities safe, and ensure migrants are treated fairly and humanely. https://t.co/MOgF5jdu7r","date":"Mon Mar 28 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cosponsoring legislation to help blind and vision-impaired Americans afford the devices, software, or other tech that empowers them to participate more fully in daily life. https://t.co/DveeranbvZ","date":"Mon Mar 28 19:43:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal governments should have equal access to critical medical supplies during a health emergency. Our bill will guarantee Indian Health Service, Tribal health authorities, and urban Indian organizations have access to the Strategic National Stockpile. https://t.co/tdXRufi1ZW","date":"Mon Mar 28 16:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"¿Necesita ayuda? Los navegadores certificados de seguros de salud y los consejeros de solucitudes pueden asistirle en inglés y español sin cargo. Llame Cover Arizona al 800-377-3536 o visite https://t.co/r6YKpOI2Gg para recibir ayuda.","date":"Sun Mar 27 19:34:02 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonenses pueden estar en riesgo de perder su cobertura de Medicaid en los próximos meses. Recomendamos fuertemente a los arizonenses que respondan rápidamente si @AHCCCSgov se comunica con usted &amp; que verifique con el estado para asegurarse que su información esté actualizada.","date":"Sun Mar 27 19:34:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Need help? Certified health insurance navigators and application counselors can assist in both English and Spanish free-of-charge. Call Cover Arizona at 800-377-3536 or visit https://t.co/r6YKpOI2Gg for assistance.","date":"Sun Mar 27 19:30:12 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thousands of Arizonans may be at risk of losing Medicaid coverage in the coming months. We strongly encourage Arizonans to quickly respond if you are contacted by @AHCCCSgov, and to check with the state to make sure your info is updated.\nhttps://t.co/bzRbVEzctQ","date":"Sun Mar 27 19:30:11 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Reclassifying Shadow Wolves as special agents allows them to better patrol the border and keep Arizona families safe and secure. Proud to see our bipartisan bill move one step closer to becoming law.\nhttps://t.co/7NjKketB6Q","date":"Sun Mar 27 16:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ servicemembers, veterans, and military families: check out the AZ Hires Vets Job Fair on March 30, 2022.\n\nRegister here ➡️ https://t.co/KDE4wGIZ3i.","date":"Sat Mar 26 20:58:11 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Sandra Day O'Connor, the first female leader of the Arizona State Senate and the first woman appointed to the U.S. Supreme Court, was born #OnThisDay in 1930. Today, we’re celebrating Justice O’Connor’s legacy of public service and civil discourse. #WomensHistoryMonth","date":"Sat Mar 26 16:03:17 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our affordable textbooks program to reduce costs for Arizona students and families is now law. https://t.co/lVOy9uEScU","date":"Fri Mar 25 22:27:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re calling on @DHSgov and @DeptofDefense to help private, state, and local institutions shore up their cyber vulnerabilities as Russian cyber threats continue. https://t.co/xtaSE1saI5","date":"Fri Mar 25 18:35:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our Advanced Air Mobility Coordination and Leadership Act — bipartisan legislation to support the development of Advanced Air Mobility Systems, creating Arizona jobs and expanding U.S. leadership in technological development. https://t.co/nmxD3LbCdo","date":"Fri Mar 25 18:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re honoring the lives and legacies of Justice O’Connor and Justice Ginsburg with legislation permanently placing their statues in the U.S. Capitol. Check it out: \nhttps://t.co/hXP2oY3Cji","date":"Sat Jan 08 20:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #MedalOfHonorDay, Arizona! We’re requesting a state funeral to rightfully honor AZ’s Medal of Honor recipients for their bravery and selfless service. ⬇️\nhttps://t.co/HsxeQ2WL1c","date":"Fri Mar 25 17:00:02 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Abruptly ending Title 42 enforcement without a firm, workable plan in place would greatly increase the strain on Arizona border communities and nonprofits. Until the administration consults with local leaders, it's premature to change Title 42. https://t.co/Kc53jgcUIJ","date":"Thu Mar 24 21:40:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ is a leader in semiconductor manufacturing, but over the past decades, America’s chips manufacturing has fallen. We’re building on our CHIPS For America Act with new legislation to restore America’s global leadership in semiconductor manufacturing. https://t.co/U7NoZesdhE","date":"Thu Mar 24 17:38:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud that Team Sinema volunteered at the Tucson and Maricopa Veterans Stand Down with members of our Veterans Advisory Council. We’re proud to support our community partners and will continue working to ensure our veterans receive the care and benefits they’ve earned. https://t.co/5yt7rMrff3","date":"Thu Mar 24 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Madeleine Albright’s Passing https://t.co/xocfdGnqMD","date":"Wed Mar 23 20:25:56 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan resolution honoring the accomplishments of Native women – including Hopi Tribe Member Lori Ann Piestawa, who died in the Iraq War while serving in the U.S. Army – unanimously passed the U.S. Senate. https://t.co/zNfETgpDpe","date":"Wed Mar 23 18:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with the City of Flagstaff to share updates about how our Infrastructure Investment and Jobs law will strengthen wildfire prevention and rural broadband in Northern Arizona. https://t.co/ijFNeuWNTe","date":"Wed Mar 23 16:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to speak with White Mountain Apache Chairwoman Lee-Gatewood. We’re proud our bipartisan infrastructure law fully funds the Tribe’s Water Rights Settlement. https://t.co/a4IUs0vHHG https://t.co/BHJeH4eCBQ","date":"Wed Mar 23 14:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to attend the White House bill signing of our Violence Against Women Act renewal with Tribal leaders from AZ, including Pascua Yaqui Chairman Peter Yucupicio. We ensured #VAWA’s bipartisan renewal gives Tribal governments new tools to protect women and go after abusers. https://t.co/8j8WZGSaKE","date":"Tue Mar 22 22:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"At today's Senate Banking Committee hearing we spoke about current supply chain issues, rising prices, and their impact on Arizonans. https://t.co/VtLk95YkIe","date":"Tue Mar 22 21:07:49 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona veterans and their families deserve clarity from the VA. That’s why we’re calling on the VA to improve the Family Caregivers Program and better communicate as changes to the program are implemented. https://t.co/FW2qCF5idE","date":"Tue Mar 22 16:09:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill will lower the cost of a critical prescription drug by capping Arizonans’ insulin cost at $35 dollars a month. We’ll keep working to advance commonsense solutions increasing Arizona families’ and seniors’ access to affordable health care. https://t.co/o0CSCKZXkO","date":"Mon Mar 21 23:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@ArizonaMBB all the way. Keep it up! 👏 \n\n#BearDown #RunWithUs","date":"Mon Mar 21 20:16:46 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cosponsoring legislation to help boost American semiconductor manufacturing – helping to lower costs for everyday families, create good-paying jobs, and strengthen Arizona’s economy. https://t.co/H1CPeSZ9O0","date":"Mon Mar 21 20:11:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with Gila County Supervisor Woody Cline about the major investments we secured for Gila County, including $472,000 for crucial road re-pavement and $609,000 for wildfire prevention. https://t.co/FjckQIiVwt","date":"Mon Mar 21 18:25:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy World Down Syndrome Day from our friend, Sophie! #WDSD22 https://t.co/LUA1gQ7mjF","date":"Mon Mar 21 17:34:57 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Every home in AZ is eligible for a second set of 4 free at-home rapid COVID-19 tests. Testing for COVID-19 keeps loved ones safe and allows Arizonans to more quickly return to normal. Order your tests today: https://t.co/Xq0tqz1iV6","date":"Sun Mar 20 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This National Native HIV/AIDS Awareness Day, we're ensuring tribal communities have access to high-quality health care. Find resources here: https://t.co/rw5sFadg47. #NNHAAD","date":"Sun Mar 20 17:02:19 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured investments for local AZ communities to strengthen their water infrastructure, law enforcement, health care services, and more – this funding is a win for our state and for everyday Arizona families.\nhttps://t.co/wb1zts3szN","date":"Sat Mar 19 21:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #SocialWorkerMonth, Arizona! As a social worker myself, I’m proud our team of social workers works around the clock solving problems for Arizonans. Need assistance? Send us a note at casework@sinema.senate.gov.","date":"Sat Mar 19 16:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with @ValleyMetro to hear firsthand about current public transit projects under construction, thanks to historic funding from our bipartisan Infrastructure Investment and Jobs law. https://t.co/Itik1aArKd https://t.co/bcRvalnxKu","date":"Fri Mar 18 22:56:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team was honored to attend the grand opening of Pima Community College’s Veterans Center (@PCCMilVets) last week – a space for veterans and active-duty servicemembers to access resources and support to help them meet their academic goals. https://t.co/VarxghyBBq","date":"Fri Mar 18 21:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans and Americans stand with the people of Ukraine in opposition to Russia’s illegal war. We’ll continue to crack down on Russia’s illicit financing while continuing to provide humanitarian and military support to Ukraine. https://t.co/1LLoUQ6bJr","date":"Fri Mar 18 20:43:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to attend the swearing in of my friend Shalanda Young as Director of the Office of Management and Budget. She’s the right person for the job and I’m thrilled to celebrate her. https://t.co/J7Vy2LF260","date":"Fri Mar 18 18:19:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re proud to celebrate Tribal Colleges and Universities for their efforts preserving indigenous language and tribal traditions, and expanding opportunities for tribal communities across Arizona.","date":"Fri Mar 18 17:21:18 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The U.S. Senate unanimously passed our bipartisan resolution designating this week as National Tribal Colleges and Universities Week.\nhttps://t.co/x0OUTrEe8g","date":"Fri Mar 18 17:21:17 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re introducing a bipartisan bill to ensure Border Patrol agents receive fair overtime pay, bringing the Border Patrol pay system into line with other federal law enforcement agencies. https://t.co/nAd3TOAPFd","date":"Thu Mar 17 23:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with @AZHousing Director Tom Simplot about the affordable housing shortage in Arizona. We’re committed to working with colleagues in both parties to find solutions that will lower prices and address Arizona’s affordable housing shortage.\nhttps://t.co/fRh2Jz1Po0","date":"Thu Mar 17 22:16:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Housing costs continue to rise for Arizonans. We’re announcing additional Emergency Rental Assistance funding to help struggling Arizonans afford rent and prevent eviction.\nhttps://t.co/J4nDSPXzEo","date":"Thu Mar 17 19:16:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy St. Patrick’s Day, Arizona! ☘️","date":"Thu Mar 17 18:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It's got to be @ArizonaMBB all the way.\n\n@RogerMarshallMD's Jayhawks might be good this year, but don't forget Wildcats eat birds. #BearDown #RunWithUs https://t.co/bo0glMfh3U","date":"Thu Mar 17 16:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"At today’s White House bill signing ceremony, we applauded the renewal of our bipartisan Violence Against Women Act. We’re proud lawmakers came together to support survivors and strengthen programs protecting Arizona women and families. https://t.co/SAGQcIsNWm","date":"Wed Mar 16 20:08:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined @SenMarkKelly and @SecretaryPete to give remarks and answer questions from Arizona mayors and local leaders about how they can access funding from our Infrastructure Investment and Jobs law. https://t.co/qC4bUIvrhM","date":"Wed Mar 16 17:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"220 years ago today, @WestPoint_USMA was founded. #DutyHonorCountry","date":"Wed Mar 16 15:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Ukraine President Zelenskyy’s Joint Address to Congress: https://t.co/fnyt5nneHa","date":"Wed Mar 16 14:55:40 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured funding to increase health care affordability and access for Arizonans in the recent government funding bill. https://t.co/a2ebG7rk9q","date":"Tue Mar 15 22:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs law helps secure Arizona's water future – supporting our agriculture industry and strengthening economic opportunities across our state. https://t.co/Xn6knxey7i","date":"Tue Mar 15 21:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured key defense funding in the recent spending bill including critical funds to support Ukraine against Russia’s illegal, unprovoked invasion. https://t.co/xpAmK6LhhX","date":"Tue Mar 15 18:39:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Ruth Bader Ginsburg was born #OnThisDay in 1933. #RBG fought tirelessly to advance equal rights for women and girls – today, we remember her extraordinary legacy. #WomensHistoryMonth","date":"Tue Mar 15 16:45:22 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Hearing from Arizonans guides my work in the Senate. Last week's town hall with workers at Honeywell was a chance to learn new ideas from Arizonans that I will take back with me to Washington. https://t.co/P0LIMteOT0 https://t.co/zSZqd5aBeU","date":"Mon Mar 14 21:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our resolution designating March as #WomensHistoryMonth. This designation acknowledges the remarkable accomplishments of generations of women in Arizona and across the country and commemorates the undeniable role American women have played in U.S. history.","date":"Mon Mar 14 18:36:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined @CutterAviation to kickstart its $12 million hangar complex at Deer Valley Airport. Our bipartisan Infrastructure Investment and Jobs law includes historic funding for every airport in Arizona, including $3.7 million for Deer Valley. https://t.co/VxGKvyIaeU https://t.co/L7VxufjQxz","date":"Mon Mar 14 16:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"March is #WomensHistoryMonth – and we’re honoring the amazing Arizona women who defied odds, broke barriers, and left their marks on our state and country.","date":"Sun Mar 13 21:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced legislation with @SenatorCollins improving employment authorization for migrants who apply for asylum.\nhttps://t.co/jz3xpH3mRx","date":"Sun Mar 13 17:40:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad the administration agreed to our request and provided this relief to help AZ communities recover from wildfires.\nhttps://t.co/WqJM2uYUw3","date":"Sun Mar 13 00:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"ICYMI – we’re helping Arizonans navigate tax filing season. Check out our full Tax Filing Tips Webinar:\nhttps://t.co/CPiq15GEV0","date":"Sat Mar 12 22:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"110 years ago today, the @girlscouts was founded! Thank you for your work inspiring AZ girls to #BePrepared to be strong leaders.","date":"Sat Mar 12 17:27:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured full funding for @uarizona’s Near Earth Objects Surveyor Mission, protecting our planet from dangerous asteroids and meteors, boosting Arizona’s space innovation, and helping create good paying jobs. https://t.co/epgxdrr4xI","date":"Fri Mar 11 22:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Working across the aisle, we secured investments to strengthen Arizona communities' water infrastructure, law enforcement, health care services, and more in the government funding bill. https://t.co/JhNr79kw7f","date":"Fri Mar 11 21:04:41 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud that lawmakers came together and renewed the Violence Against Women Act, boosting programs to protect AZ women and families, ensure law enforcement has the tools needed to crack down on abusers, and support survivors in AZ and across the country. https://t.co/FdfTvTD1Bf","date":"Fri Mar 11 17:04:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on meeting with Supreme Court Nominee Judge Ketanji Brown Jackson https://t.co/ZYpTU39zAk","date":"Thu Mar 10 22:55:15 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"There’s a crisis on our southern border. We held a virtual meeting with government and non-profit partners to discuss solutions for ongoing border management problems. https://t.co/BnBjevFZFS","date":"Thu Mar 10 18:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Senate leadership should improve and expand the Research &amp; Development tax credit in any upcoming legislative packages to help startups and small businesses stay competitive and increase innovation. https://t.co/mxbbmPTTMy","date":"Thu Mar 10 17:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our infrastructure law makes historic investments in cities and towns across Arizona. We’re connecting Arizona mayors, county supervisors, and Tribal leaders with the administration to ensure Arizona communities get their fair share of funding.\nhttps://t.co/Dx3peaumF0","date":"Wed Mar 09 22:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to speak with @AmericanLegion National Commander Paul E. Dillard in the Senate Veterans’ Affairs Committee this week. We’ll keep working with the Legion to ensure Arizona veterans get the care and benefits they’ve earned. https://t.co/IJgL9nnyFp","date":"Wed Mar 09 18:11:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Postal Service Reform Act passed the Senate. This bill will improve @USPS efficiency and transparency for Arizonans and all Americans. \n\nWatch below for more details ⬇️\nhttps://t.co/AoNTGlqWEw","date":"Wed Mar 09 00:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cosponsoring a bipartisan bill to help keep Arizona communities safe by cleaning up abandoned mines. https://t.co/rBfAOCR9q1","date":"Tue Mar 08 19:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Just over a year ago, parts of our CHIPS For America Act became law, boosting U.S. semiconductor manufacturing. Now, we’re urging Congressional leaders to do more to address rising prices and severe supply chain issues. https://t.co/7aidViOQma","date":"Tue Mar 08 16:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy International Women’s Day! Today and everyday, I continue to be inspired by the extraordinary women who led the way and opened doors for so many women and girls in our state and across the country.","date":"Tue Mar 08 16:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great meeting with @PHXSkyHarbor Director of Aviation @cmakovsky about how PHX plans to implement the $217 million investment from our bipartisan infrastructure law. https://t.co/K58wsCfbAv https://t.co/aWRXJRfElo","date":"Mon Mar 07 23:03:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill improves @USPS, ensuring Arizonans can count on reliable mail delivery for letters, packages, medications, and more. https://t.co/ydD0a7CGVl","date":"Wed Mar 02 23:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with the Navajo County Board of Supervisors to discuss historic investments for Tribal communities in our infrastructure law, including full funding of the Winslow Levee Project. https://t.co/65oL09jTW2","date":"Mon Mar 07 19:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We questioned Fed Chair Powell about how Russia’s war in Ukraine has impacted supply chain issues and inflation in Arizona and across the country during a Senate Banking Committee hearing. https://t.co/3InzP2ISZL","date":"Mon Mar 07 18:36:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill with @SenatorDurbin and @JohnCornyn allows unused employment visas from previous years to be used by doctors and nurses, helping solve hospitals’ health care worker shortages in Arizona and across the country.\nhttps://t.co/kCI6Rnojqx","date":"Mon Mar 07 00:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Now that the Senate has unanimously passed our Health Care for Burn Pit Veterans Act, Congress is one step closer to fulfilling our responsibility to provide care for our nation’s veterans.\nhttps://t.co/5qHoKW5skM","date":"Sun Mar 06 19:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"ICYMI – our office held a Tax Filing Tips Webinar last week to help Arizonans navigate tax season. Check out our full webinar ⬇️ \nhttps://t.co/CPiq15p43s","date":"Sat Mar 05 22:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to advance our bipartisan legislation strengthening postal service for everyday Arizonans.","date":"Sat Mar 05 19:53:30 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to nominate 55 Arizona students to 4 U.S. Service Academies this year. These young men and women, and their dedication to serving our country represent the best of our state. https://t.co/rqudz7Z9Hf","date":"Fri Mar 04 20:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable with Mayor Price and local and tribal leaders to talk about how our bipartisan Infrastructure Investment and Jobs law will help the @CityofMaricopa, tribal communities, and Pinal County. https://t.co/XRdaBsWVPz","date":"Fri Mar 04 18:53:09 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Caregivers help disabled veterans navigate day-to-day activities with a sense of independence and freedom. We’ll keep working across the aisle, and with @DAVHQ, to help Arizona veterans and caregivers access critical benefits and resources they’ve earned. https://t.co/TDDSnXMm7E","date":"Thu Mar 03 21:29:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with @BMAlliance about our work to strengthen and protect Medicare, ensuring hundreds of thousands of Arizona seniors have access to affordable health care services. https://t.co/gcEkuNUP8d","date":"Thu Mar 03 17:02:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill improves @USPS, ensuring Arizonans can count on reliable mail delivery for letters, packages, medications, and more. https://t.co/ydD0a7CGVl","date":"Wed Mar 02 23:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We discussed our Infrastructure Investment and Jobs law with the Salt River Pima-Maricopa Indian Community and highlighted how it will expand jobs and opportunities in tribal communities. https://t.co/OJD4Fedjn7","date":"Wed Mar 02 22:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill with @SenatorCollins will help asylum seekers get jobs, support themselves, and participate in Arizona’s economy. https://t.co/k8Tpz0SRvS","date":"Wed Mar 02 19:34:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re thrilled our Health Care for Burn Pit Veterans Act passed the Senate unanimously last month. Our legislation makes a real difference for post 9/11 combat veterans in Arizona and across the country.\nhttps://t.co/5qHoKVNQWc","date":"Wed Mar 02 19:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on State of the Union Address https://t.co/nbXTdePTc5","date":"Wed Mar 02 03:25:55 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re proud the U.S. Senate unanimously came together to pass our Health Care for Burn Pit Veterans Act last month – and we’ll continue working to earn broad support in the U.S. House to expand health care access for AZ veterans exposed to toxic substances. #SOTU","date":"Wed Mar 02 03:06:36 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We led bipartisan proposals boosting U.S. manufacturing of semiconductors (computer chips) used for phones, computers, cars, and military technology. We’ll continue working to support good-paying jobs, protect national security, and lower the costs of goods. #SOTU","date":"Wed Mar 02 02:30:14 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure law makes historic investments across Arizona – from better roads, to cleaner water, to faster internet, and so much more. We’re incredibly proud of the difference it makes for everyday Americans. #SOTU","date":"Wed Mar 02 02:25:34 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re leading a group of western state U.S. Senators and Members of Congress to urge the administration to distribute funding from our Infrastructure Investment and Job law to protect our states’ forests and water. https://t.co/jDcvqqmzgV","date":"Wed Mar 02 00:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to hear from Arizonans how investments from our infrastructure law will make a real difference in Southern Arizona. We’ll keep working with leaders on the ground to ensure Yuma - and communities across AZ - receive every dollar they’re due. https://t.co/UqTua1N763 https://t.co/J9bAxylcEy","date":"Tue Mar 01 22:26:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re glad the administration agreed to our request and released federal disaster funding, providing much-needed relief for Arizona communities still experiencing the impacts of wildfires. https://t.co/MLeaSkjajq","date":"Tue Mar 01 18:39:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce over $500 million will be invested in Arizona Land Ports of Entry from our bipartisan infrastructure law, improving cross-border trade, supporting jobs, lowering costs, and tackling supply chain challenges. https://t.co/ES7CiBN4xZ","date":"Mon Feb 28 22:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great sitting down with health care leaders and providers in Yuma to discuss how we’re working to ensure they have the support and resources needed to keep AZ families and communities safe and healthy. https://t.co/BjpvovtSe7 https://t.co/lohCGxGO14","date":"Mon Feb 28 18:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Sending our deepest condolences to @SenFeinstein on the passing of her husband, Richard Blum. Our hearts are with their family in this challenging time.","date":"Mon Feb 28 17:36:51 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to historic funding from our infrastructure law, @usbr announced that WaterSMART Small-Scale Water Efficiency Projects grants are now available for local projects that conserve or better manage water in the West.\nhttps://t.co/gDKLmmhiOM","date":"Sun Feb 27 22:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"100 years ago today, the U.S. Supreme Court unanimously upheld the 19th amendment, defending women's right to vote. https://t.co/rhhO0yiR5p","date":"Sun Feb 27 17:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined @SecDebHaaland and @GRIC_Official Gov. Lewis (@crimpima) to discuss the Rio Reimagined project and celebrate the recent news that our bipartisan infrastructure law is investing $224 million in tribes across Arizona to fully fund all Indian Water Rights Settlements. https://t.co/UkYbO0wXow","date":"Sat Feb 26 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today marks 103 years since the Grand Canyon was named a national park. Our Grand Canyon Protection Act ensures AZ's treasure remains a safe and stunning part of our outdoors for generations to come.","date":"Sat Feb 26 18:56:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1881, @CityofPhoenixAZ was founded – over 30 years before Arizona officially gained statehood.","date":"Fri Feb 25 23:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with @BPUnion this week. Border communities pay the price for the federal gov’s failure to fix our broken immigration system. We will keep working to secure the border and ensure migrants are treated fairly and humanely. https://t.co/z5HmIX8gvw","date":"Fri Feb 25 22:17:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Judge Ketanji Brown Jackson’s Nomination for the Supreme Court https://t.co/S5Ne1VX309","date":"Fri Feb 25 16:03:09 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona: don’t miss our free Tax Filing Tips Webinar tomorrow at 11 a.m. MST. There’s still time to secure your spot – RSVP at outreach@sinema.senate.gov.","date":"Thu Feb 24 23:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Grateful to sit down with local aerospace and defense leaders at @uarizona to discuss how our work will support their needs so they can continue to grow, innovate, and fuel economic opportunities.\nhttps://t.co/TzWpQg3ExO https://t.co/3cyR520Rwv","date":"Thu Feb 24 20:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Russia's Attacks on Ukraine https://t.co/02TRLcACdv","date":"Thu Feb 24 15:30:52 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with Mayor Diak to discuss western water resilience and how our bipartisan infrastructure law will support Page’s infrastructure needs.\nhttps://t.co/40CkVWVQQs","date":"Wed Feb 23 17:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure law continues the work of Senator McCain on Rio Reimagined to reconnect AZ's urban communities, improve water systems, &amp; boost economic opportunities. Glad @SecDebHaaland could join us in PHX to discuss this important project.\nhttps://t.co/iNDJOfNsPi https://t.co/aWVdyq73XP","date":"Tue Feb 22 22:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure law invests $224 million in tribes’ economic and water security by fully funding Indian Water Rights Settlements in Arizona and across the country.\nhttps://t.co/csQ70Jyou6","date":"Tue Feb 22 20:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ families and small businesses are hurting from rising prices and empty store shelves. We brought community leaders together to discuss how our bipartisan law invests in border infrastructure, improving supply chain challenges, and lowering prices.\nhttps://t.co/GwKN75d0gh","date":"Tue Feb 22 19:44:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Looking for help filing taxes this year? Join our Tax Filing Tips Webinar on Friday, February 25 at 11 a.m. MST by emailing outreach@sinema.senate.gov.","date":"Tue Feb 22 19:30:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Birthday, @SenMarkKelly! You’ve been a great partner and friend – and I look forward to continuing our work delivering results for everyday Arizonans. 🌵","date":"Mon Feb 21 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Presidents’ Day, Arizona!","date":"Mon Feb 21 15:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Provisions from our CONNECT for Health Act were included in covid-response legislation last year, allowing AZ seniors increased access to telehealth services. These crucial services must be extended.\nhttps://t.co/Oc2ICiofYh","date":"Mon Feb 21 00:24:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re hosting a free Tax Filing Tips Webinar on Friday, February 25 at 11 a.m. MST, and inviting all Arizonans to join. Send us an email at outreach@sinema.senate.gov to let us know you’ll be there.","date":"Sun Feb 20 22:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined other Arizonans to see our infrastructure law in action at @gatewayairport, where our law invests over $22 million for upgrades making air travel safer and more convenient.\n\nMesa Gateway isn’t alone – our infrastructure law provides funding for every airport across AZ. https://t.co/6sWmFhw5Se","date":"Sun Feb 20 18:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re committed to helping Arizonans navigate this tax season. On Friday, February 25 at 11 a.m. MST, Arizonans can join our Tax Filing Tips Webinar free of charge. To secure your spot, send us an email at outreach@sinema.senate.gov.","date":"Sun Feb 20 00:03:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thankful for another opportunity to hear directly from Arizona’s farmers and ranchers this past week. We’ll continue partnering – like we did with our historic infrastructure law – to strengthen our agricultural industry and secure our state’s water future. https://t.co/faEGQUX189","date":"Sat Feb 19 22:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate unanimously passed our bipartisan bill to expand health care access for combat veterans exposed to toxic substances. https://t.co/IlGfwr4lFN","date":"Fri Feb 18 19:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re protecting Arizona seniors from costly and harmful fees by expanding education, awareness, and notice about Medicare eligibility. https://t.co/NJV6ob9eqG","date":"Fri Feb 18 18:17:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re continuing our bipartisan work with @ChuckGrassley to help victims of identity theft. https://t.co/15NeCXLqrO","date":"Thu Feb 17 21:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cosponsoring a bill to allow more health care professionals to practice in Arizona, helping to keep Arizona families safe and healthy. https://t.co/LmgYfqneit","date":"Thu Feb 17 18:13:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona police officers and law enforcement put their lives on the line to keep us safe and secure. Glad to have the chance to speak with law enforcement officials to ensure they have the resources necessary to do their jobs safely and protect Arizonans. https://t.co/pJAkQAhGOT","date":"Wed Feb 16 23:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re calling on Congressional leaders to increase Emergency Food and Shelter Programs for border communities to help manage the ongoing migrant crisis. https://t.co/tzkNhNPtDx","date":"Wed Feb 16 21:28:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As new financial technologies develop, we must balance commonsense protections for everyday Arizonans while creating an environment where innovation can thrive.\nhttps://t.co/4GB91gV0zV","date":"Wed Feb 16 16:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a virtual discussion with the Coconino County Board of Supervisors on Tuesday to discuss forest health, post-wildfire mitigation, and how our Infrastructure Investment and Jobs law will address these issues. https://t.co/nq7qe8nut2","date":"Tue Feb 15 19:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with Arizona farmers, ranchers, and Agriculture leaders to talk about how our Infrastructure Investment and Jobs law will secure our state’s water future. https://t.co/UFmkcnq8U6 https://t.co/XDSLjcbQfE","date":"Tue Feb 15 15:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs law, Arizona will receive $11.3 million in 2022 to build electric vehicle charging stations across our state. https://t.co/fnsIIsTqjf","date":"Mon Feb 14 19:28:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We held a roundtable to talk about economic opportunities in the East Valley and how our bipartisan infrastructure law will support growth. https://t.co/FrblBnwrZW https://t.co/qETr6H2KSd","date":"Mon Feb 14 17:40:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Statehood Day to our valentine – Arizona! ❤️🌵","date":"Mon Feb 14 15:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Nearly one-third of post 9/11 veterans have been exposed to toxic substances – but some can't access VA care. We proudly introduced bipartisan legislation to expand health care eligibility for veterans exposed to toxic substances.\nhttps://t.co/5qHoKVNQWc","date":"Sun Feb 13 22:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - starting this spring, Medicare beneficiaries can pick up eight COVID-19 tests per month free of charge. More ⬇️\nhttps://t.co/1HFzbgyzPq","date":"Sun Feb 13 19:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"February is #CancerPreventionMonth, and we’re leading the AZ delegation to support @UAZCancer, asking the administration to renew its grant to help the center conduct research and develop lifesaving treatments. \nhttps://t.co/rFEtUZ3mJw","date":"Sat Feb 12 23:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"President Abraham Lincoln was born #OnThisDay in 1809.","date":"Sat Feb 12 20:00:13 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured @gatewayairport to discuss how our Infrastructure Investment and Jobs law will support future projects and investments for the airport – improving the experience for people who fly. https://t.co/vlNC6YaLBv","date":"Sat Feb 12 00:23:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona has an affordable housing shortage. Out-of-state landlords are raising rents and kicking out tenants, even our seniors, who can’t pay. I’m working to protect Arizona seniors and expand access to affordable housing for all Arizonans. https://t.co/nVrp5AYKgg","date":"Fri Feb 11 21:27:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Horrified by this violence against law enforcement working to keep our communities safe. We're thinking of everyone injured and hoping for full recoveries as we wait for more information.","date":"Fri Feb 11 14:00:32 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Survivors of sexual assault and sexual harassment who want to speak out and seek justice are too often silenced. I am proud to support the Senate legislation to empower survivors and hold abusers accountable. https://t.co/xRmgQkaOng","date":"Thu Feb 10 22:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans across our state continue to raise concerns around @USPS delays and reduced service. We hosted a call with the U.S. Postmaster General to ask him how they intend to improve service. https://t.co/dnSFXDYzby","date":"Thu Feb 10 18:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“Forever chemicals” endanger Arizona communities by putting drinking water at risk and exposing Arizona servicemembers and fire fighters to toxic substances. We’re calling for robust funding to combat and protect everyday Arizonans from PFAS contamination. https://t.co/pk7SWcQyOO","date":"Wed Feb 09 22:14:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy to see our bill advance out of committee and move to the Senate floor. https://t.co/HJC68KOwBW","date":"Wed Feb 09 18:22:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to make federal hiring more efficient is now one step closer to becoming law. https://t.co/h282LtobZs","date":"Tue Feb 08 23:43:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored that our bipartisan Honoring Civil Servants Killed in the Line of Duty Act – which improves survivor benefits – has earned the support of the Federal Law Enforcement Officers Association (@FLEOAORG.)","date":"Tue Feb 08 20:38:29 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #AmericanHeartMonth, Arizona! ❤️","date":"Mon Feb 07 22:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're calling on the administration to allow more Arizona small businesses to import the goods they need to increase manufacturing, lower prices, and boost jobs.\nhttps://t.co/fg6Ugb3vZP","date":"Mon Feb 07 16:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We were excited to join leaders from Pinal County to welcome the new Arizona Water Company facility in @CityCoolidge, which will provide clean and safe water. https://t.co/WbDWokDEq0","date":"Sun Feb 06 22:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans know too well the devastating effects of increasingly frequent wildfires on our lives and livelihoods. \n\nThat’s why our bipartisan infrastructure law invests $61 million in wildfire prevention – in 2022 alone. \nhttps://t.co/7sdIoslEad","date":"Sun Feb 06 18:47:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Studies show job applicants, particularly women and minorities, sometimes understate their abilities. Excited that our Chance to Compete Act eliminates hiring barriers, increasing the chances of great candidates getting hired.\nhttps://t.co/sDwoURUfvh","date":"Sat Feb 05 22:19:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Heartbroken to hear about Judge Mroz’s tragic passing. Keeping her loved ones in my thoughts during this difficult time.","date":"Sat Feb 05 20:15:19 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Keep an eye out for murals celebrating #BlackHistoryMonth in the Valley!\nhttps://t.co/DWnNgvQl76","date":"Sat Feb 05 19:13:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #WorldCancerDay, we’re working to advance cancer research to develop lifesaving treatments. We recently led the AZ delegation to support @UAZCancer, asking the administration to renew its grant to help the center conduct research and treat patients.\nhttps://t.co/rFEtUZ3mJw","date":"Fri Feb 04 21:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re introducing bipartisan legislation to bolster health care access for combat veterans exposed to toxic substances.\nhttps://t.co/mgNPEQT664","date":"Fri Feb 04 18:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our legislation honors federal civil servants who die in the line of duty by improving their survivor benefits. https://t.co/DfZzzgE3us","date":"Mon Jan 24 19:37:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The United Service Organizations (@the_USO) was founded #OnThisDay in 1941 – we’re grateful for your many years of service to our troops and their families.","date":"Fri Feb 04 17:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs law will bring over $26 million to Arizona in 2022 to clean up abandoned oil and gas well sites causing pollution.\nhttps://t.co/NaM601cxex","date":"Thu Feb 03 17:47:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1995, Col. Eileen Marie Collins became the first woman space shuttle pilot. We’re celebrating her legacy by sharing resources for AZ girls in #STEM. \nhttps://t.co/8iFi3OwRmX","date":"Thu Feb 03 15:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy National Girls &amp; Women in Sports Day! This year marks the 50th anniversary of #TitleIX, which promotes equal opportunities for girls &amp; women in education and sports. Here’s how to celebrate:\nhttps://t.co/5LPTEv9ZHX","date":"Wed Feb 02 19:37:54 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Requiring regular review of federal regulations will help improve outcomes and reduce burdens on Arizona businesses. Glad to see our Smart Act move closer to becoming law and increasing the transparency of the federal government. https://t.co/QjX2UUf2GH","date":"Wed Feb 02 19:28:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to hear my friend @SenatorLujan will make a full recovery following surgery today. Sending strength to him and his family and looking forward to seeing him back at the Senate soon.","date":"Tue Feb 01 22:55:54 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to introduce Shalanda Young at her confirmation hearing to serve as OMB Director. She is the right person for the job, and I look forward to supporting her and moving her nomination forward. https://t.co/6ZWlhU1mom","date":"Tue Feb 01 21:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following FEMA’s announcement it will pay for the National Guard’s response to COVID, we’re calling on Governor Ducey to allow the Arizona National Guard to assist AZ hospitals during staffing shortage caused by the coronavirus pandemic. https://t.co/ETnVbwOFDZ","date":"Tue Feb 01 19:57:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing all Arizonans celebrating a Happy Lunar New Year – and hoping the #YearOfTheTiger brings health and happiness to you and your families.","date":"Tue Feb 01 15:05:09 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured $2 million for telehealth in Arizona. This critical funding will expand telehealth services across our state, helping Arizonans access quality health care from home. https://t.co/vcgyxjDd56","date":"Tue Feb 01 00:48:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re calling on congressional leaders to work with us to expand Medicare coverage of telehealth services, which has been critical for Arizona seniors during the pandemic. https://t.co/RCKR1GE3qa","date":"Mon Jan 31 21:32:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1865, Congress passed the 13th Amendment abolishing slavery.","date":"Mon Jan 31 20:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team worked hard to ensure that Western states received a fair share of water infrastructure upgrades. Glad that our historic infrastructure law invests $50.5 million in 2022 to secure AZ’s water future as we continue to grow.\nhttps://t.co/lMoFE4kt9Q","date":"Sun Jan 30 21:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Good news, Arizona - @USDA is accepting grant applications to support organizations developing safe and affordable housing for farmworkers. Applications are due on March 21, 2022. https://t.co/ahFqYKO0Q1","date":"Sun Jan 30 17:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - the 2022 tax season is open. Here are a few tips to keep in mind as you’re filing: \nhttps://t.co/l0kd4NYyj7","date":"Sat Jan 29 23:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations to new @PHXFire Chief, Mike Duran! Mike has been with the department for decades, working hard to keep AZ communities safe and secure.","date":"Sat Jan 29 18:40:59 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re leading the Arizona delegation to support @UAZCancer. We’re asking the administration to renew its grant to help the center conduct lifesaving research and treat patients. https://t.co/rFEtUZkY86","date":"Fri Jan 28 20:11:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our most recent covid relief law, Hualapai and Yavapai-Apache tribes will receive $1.6 million in housing grant funds, providing affordable housing assistance to recover from the effects of the coronavirus pandemic. https://t.co/jwbf77u2X5","date":"Fri Jan 28 17:48:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We honor the seven brave heroes who lost their lives on the Space Shuttle Challenger 36 years ago today.","date":"Fri Jan 28 16:50:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans know that our state’s economic future depends on securing our water future and protecting our communities from wildfires. Thanks to our Infrastructure Investment and Jobs law, AZ will receive $50.5M for drought relief and $61M for wildfire prevention in 2022 alone. https://t.co/6qltZBvfOV","date":"Fri Jan 28 01:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Justice Breyer’s Retirement https://t.co/JuOMvD8Iq8","date":"Thu Jan 27 20:23:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thank you @FLEOAORG, @NTEUnews, @NFFE_Union, @seniorexecs, @VoiceOfPMA, @FedManagers, National Association of Assistant U.S. Attorneys, and National Postal Mail Handlers Union for your support!","date":"Wed Jan 26 20:23:26 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team was honored to attend the celebration of life in honor of @GoodyearAZGov Mayor Georgia Lord last week. Mayor Lord was a devout public servant and trusted partner – #State48 will miss her leadership. https://t.co/AQ1neZwXHa","date":"Wed Jan 26 18:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re asking @DeptofDefense for more information regarding long-term military housing contracts after a major housing contractor pleaded guilty to major fraud. Arizona military families deserve responsive and respectful housing services. https://t.co/q2Pzhwh4tA","date":"Tue Jan 25 22:52:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #NationalBloodDonorMonth, Arizonans can help save lives by giving blood. Find a donation site near you: https://t.co/Tzxc1xGtfE.\nhttps://t.co/Dk5QMZgKe1","date":"Tue Jan 25 17:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our legislation honors federal civil servants who die in the line of duty by improving their survivor benefits. https://t.co/DfZzzgE3us","date":"Mon Jan 24 19:37:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #InternationalDayofEducation, Arizona! We’re thankful for all the teachers, parents, and students for their dedication to education during these challenging times.","date":"Mon Jan 24 15:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1997, Madeleine Albright made history as the first woman sworn in as Secretary of State. 🇺🇸","date":"Sun Jan 23 20:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're removing barriers that limit opportunities for Arizonans seeking federal government jobs. Our Chance to Compete Act ensures that skills and experience count as much as formal education. https://t.co/CCBlZEMOdF","date":"Sat Jan 22 22:00:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Reminder: the 2022 tax season begins on January 24 and returns must be submitted by April 18. More:\nhttps://t.co/jZ9QK0LrSc","date":"Sat Jan 22 16:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Chance to Compete Act improves federal hiring. It ensures that skills and experience are taken into consideration, not just a formal education, as part of the hiring process.\nhttps://t.co/sDwoURUfvh","date":"Fri Jan 21 22:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$82.8 million is coming to Arizona water systems and environmental infrastructure in 2022 thanks to our bipartisan Infrastructure Investment and Jobs law. This funding will safeguard Arizona communities and jobs from dangerous flooding and other disasters. https://t.co/JqeH3Yev2K","date":"Fri Jan 21 20:43:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s agricultural industry is critical to our rural communities and our state’s economy. Glad to announce the Yuma &amp; La Paz Counties Community College District was awarded a $500,000 agricultural workforce training grant. https://t.co/LCP2hH8HP8","date":"Thu Jan 20 20:10:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@uarizona will receive a $500,000 workforce development grant to boost teacher training in food and agricultural science – helping ensure AZ’s agriculture industry continues to grow. https://t.co/RkWdK1H1UM","date":"Thu Jan 20 19:24:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to team up with @SenMarkKelly to introduce the FORWARD Act of 2022 – legislation addressing diseases like Valley Fever. \nhttps://t.co/FWXa8H6dPb","date":"Thu Jan 20 18:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs law, over $50 million is coming to Arizona for drought relief – creating jobs and keeping our communities healthy. https://t.co/Gir8J2cUP8","date":"Wed Jan 19 20:26:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona will receive $61 million for wildfire prevention and recovery efforts thanks to our Infrastructure Investment and Jobs Law. https://t.co/e5csSWukmW","date":"Wed Jan 19 18:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans can now order 4 free at-home coronavirus tests online at https://t.co/2PFY1JDK4k.","date":"Tue Jan 18 21:29:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We intro'ed a bill with @SenatorHagerty to make federal hiring fairer for Arizonans by reducing traditional bureaucratic barriers that limit opportunities for federal job seekers and make the federal government more efficient and effective. https://t.co/n7iQFE3AOA","date":"Tue Jan 18 16:31:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We worked with @SenMarkKelly to introduce the Colorado River Indian Tribe Water Resiliency Act – legislation authorizing tribes to lease a portion of the Colorado River water to Arizona communities.\nhttps://t.co/GJbBSmi65h","date":"Mon Jan 17 22:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today we remember the life and legacy of Dr. Martin Luther King, Jr. #MLKDay","date":"Mon Jan 17 18:55:55 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Now that our bipartisan infrastructure bill is law, our team is focused on the implementation of AZ projects like @valleymetro’s Northwest Light Rail Extension. Great meeting with community members to see firsthand the improvements our law makes. https://t.co/1jBcbzfpCJ","date":"Mon Jan 17 00:20:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Good news, AZ - Taxpayer Advocate (@YourVoiceAtIRS) just launched a Spanish-language site to ensure every taxpayer is treated fairly. If you need help, visit https://t.co/YACXN0JfKD.","date":"Sun Jan 16 20:00:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our legislation - named after Arizona veteran and former member of Team Sinema, Alexander Lofgren - shows our gratitude to our military community and promotes access to our beautiful national parks.\nhttps://t.co/fa2zebTGGA","date":"Sun Jan 16 00:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Booster shots are available for Arizona kids ages 12 and older. We know that Arizonans who have received their boosters are significantly safer from serious illness and hospitalization – get yours today.\nhttps://t.co/UagqoDMLNJ","date":"Sat Jan 15 22:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to hear from Arizonans last week at the @AZNationalGuard 161st Refueling Wing and discuss the military priorities we secured in the annual defense bill, which was recently signed into law. https://t.co/TnLxybd6Dn","date":"Fri Jan 14 21:15:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our bipartisan Infrastructure Investment and Jobs law, Arizona will receive $45M this year to repair and replace over 130 bridges in poor condition across our state. https://t.co/qEk3T99pjO","date":"Fri Jan 14 20:48:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ - tomorrow is the last day to enroll for health insurance in 2022. #GetCovered\nhttps://t.co/pIpRpLjVPV","date":"Fri Jan 14 19:29:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"San Luis Walk-In Clinic (@RCFBH) is distributing at-home rapid coronavirus tests in Yuma County. Learn more: https://t.co/Oc1lkvn68P","date":"Fri Jan 14 00:29:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Sinema Delivers Senate Floor Remarks on Voting Rights, America's Divisions, and the U.S. Senate https://t.co/72zAFWDPjO","date":"Thu Jan 13 17:13:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to the American Rescue Plan and other covid relief bills we passed last year, $106M is headed to Arizona Health Care Providers affected by the pandemic. https://t.co/9VtCghvcUz","date":"Wed Jan 12 18:58:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1932, Hattie Caraway became the first woman elected to the U.S. Senate.","date":"Wed Jan 12 16:30:01 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Grand Canyon Protection Act safeguards the natural beauty and outdoor economy that the Grand Canyon provides our state. \nhttps://t.co/Z0vxf0rSIQ","date":"Tue Jan 11 22:49:55 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"114 years ago today, Arizona's Grand Canyon was named a national monument. 🏜 https://t.co/KuYP6F0P3M","date":"Tue Jan 11 21:35:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@BLMNational opened the first application period for the Aging Infrastructure Account – a program we created and funded through our bipartisan Infrastructure Investment and Jobs law to improve outdated water and power infrastructure projects in the West. https://t.co/ehsPmU5uD7","date":"Tue Jan 11 19:07:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Arizona Air National Guard plays a critical role protecting our national security and military readiness by responding to missions around the world. We toured the 161st Refueling Wing and spoke with Arizona defense leaders. https://t.co/EkT0UcHMKx https://t.co/fkFaqMDFXp","date":"Tue Jan 11 16:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a discussion with the Inter Tribal Council of Arizona to talk about the historic investments our bipartisan Infrastructure and Jobs law will make in tribal communities. https://t.co/eDxRJTyXy0","date":"Mon Jan 10 21:06:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@uarizona students and employees are encouraged to use on-campus coronavirus testing to avoid long lines. Register below:\nhttps://t.co/5c2BUlk9Hy","date":"Mon Jan 10 17:59:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"January is National Slavery and Human Trafficking Prevention Month. We're committed to cracking down on human trafficking and supporting survivors as they recover and rebuild their lives. https://t.co/lqpeYaXg2D","date":"Mon Jan 10 00:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today and every day, we’re grateful for our brave law enforcement officers across Arizona. Thank you for keeping us safe and secure. #LawEnforcementAppreciationDay","date":"Sun Jan 09 15:46:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@ASU students, faculty, and staff - the Devils’ drop-off system is an easy and efficient way to get tested for coronavirus. Learn more: \nhttps://t.co/9rPtsBXyFG","date":"Sun Jan 09 00:28:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re honoring the lives and legacies of Justice O’Connor and Justice Ginsburg with legislation permanently placing their statues in the U.S. Capitol. Check it out: \nhttps://t.co/hXP2oY3Cji","date":"Sat Jan 08 20:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We strongly encourage Arizonans to get tested to slow the spread of the Omicron variant in AZ and across the country. Find a location near you: \nhttps://t.co/YJxyElI8bV","date":"Sat Jan 08 01:05:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured @valleymetro’s Northwest Light Rail Extension Project. Thanks to our Infrastructure Investment and Jobs law, Arizona will receive a historic investment in public transit, connecting our communities and growing our economy. https://t.co/rifuHYep3g https://t.co/UpJlInXY4a","date":"Fri Jan 07 23:26:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona, giving blood is quick, easy, and saves lives. If you’re able, sign up to donate.\nhttps://t.co/ba4QCb5EJ5","date":"Fri Jan 07 00:54:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"One year ago on the Senate floor, I defended AZ’s election against disinformation as violent insurrectionists entered the Capitol. I’m proud we certified the election and am profoundly grateful to law enforcement. America must remain the model for peaceful transitions of power. https://t.co/81QjhMbh5R","date":"Thu Jan 06 14:58:57 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to see a $500,000 grant coming to Tucson from the covid relief law we passed earlier this year. It will fund Tucson startups focused on finding climate solutions. https://t.co/uFWH9tXHbv","date":"Wed Jan 05 19:04:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@GrandCanyonNPS will offer 5 days of free admission in 2022. Visit one of Arizona’s most treasured destinations: \nhttps://t.co/b6ul55kvRQ","date":"Wed Jan 05 17:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We were proud to meet with Yuma community members and local leaders to discuss how our bipartisan infrastructure law will make critical improvements throughout the region – including high-speed internet and airport upgrades.\nhttps://t.co/IiEPU3fRh3","date":"Tue Jan 04 22:47:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"January is #NationalBloodDonorMonth – and Arizona is experiencing a donor shortage. Find a donation site near you and help save lives: \nhttps://t.co/Tzxc1xGtfE","date":"Tue Jan 04 20:31:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce $25 million in federal funding to help repair Arizona’s highways following recent storms and flooding. https://t.co/6zIvgZiOZ6","date":"Tue Jan 04 01:01:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud that @ASU continues to conduct important research to support a resilient, sustainable, and healthy food supply for all Americans.","date":"Mon Jan 03 19:51:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We successfully worked to provide funding for multiple Arizona military priorities in the annual defense bill, including protecting the A-10, expanding airspace, increasing pay for servicemembers, and much more.\nhttps://t.co/JjZ3bdpoPC","date":"Sun Jan 02 20:45:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing all Arizona families health and happiness in 2022! We’ll keep working to beat coronavirus, fuel our state’s economic recovery, and help everyday families get ahead.","date":"Sat Jan 01 17:30:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy New Year’s Eve! We’re so grateful to serve the great #State48 in the U.S. Senate. Looking forward to continuing our work delivering results for everyday Arizonans in the new year. https://t.co/WBu6FktcXh","date":"Sat Jan 01 03:55:00 +0000 2022","user_id":"1080844782"},{"handle":"SenatorSinema","text":"For decades, American infrastructure has been crumbling – and for decades, progress was blocked by political disagreements.\n\nThis year, that changed. Our bipartisan infrastructure law will rebuild our nation’s crumbling infrastructure and create millions of good-paying jobs.","date":"Fri Dec 31 22:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"2021 has been a year filled with hard work and, most importantly, results for everyday Arizonans.\n\nWe're so proud to represent the Great State 48 and look forward to continuing our work for you in 2022. https://t.co/9Ptu1qPgED","date":"Thu Dec 30 17:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We also introduced the bicameral Bipartisan Border Solutions Act with @JohnCornyn to ensure the federal government takes meaningful steps to support our border communities, secure the border, and treat all migrants and unaccompanied children fairly and humanely.","date":"Thu Dec 30 00:15:50 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As Chair of the Border Management Subcommittee, I made several trips to the AZ border this year to meet with @CBP officials and NGOs, assess needs at our Land Ports of Entry, and learn how to best address challenges at the border.","date":"Thu Dec 30 00:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Military bases across our state – including @LukeAFB, @DMAFB, @Fort_Huachuca, @yuma_mcas, @ypg_az, and more – will receive critical resources for key projects and improvements. Check it out: \nhttps://t.co/JjZ3bdGZHa","date":"Wed Dec 29 21:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to improve Arizona veterans’ long-term care options is one step closer to becoming law.\nhttps://t.co/zpT3p7l8ID","date":"Tue Dec 28 23:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re working to ensure @fema provides necessary support to overwhelmed AZ hospitals, doctors, and nurses. If you haven’t already, do your part and get vaccinated and boosted.\nhttps://t.co/cm3eT1oKbU","date":"Tue Dec 28 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We recently joined a group of 45 senators calling on @SecYellen and @IRSnews Commissioner Rettig to revise outdated federal guidance that results in same-sex couples being denied retirement benefits. \nhttps://t.co/tRW0Owaq15","date":"Mon Dec 27 19:36:13 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re proud to have successfully incorporated provisions from our Downwinders Parity Act in the annual defense bill, calling for support for Arizonans experiencing sickness from exposure to radiation in Mohave County.\nhttps://t.co/JjZ3bdpoPC","date":"Mon Dec 27 00:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing a Happy Kwanzaa to all Arizonans celebrating this week.","date":"Sun Dec 26 19:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, we honor Arizona servicemembers – and their families – for putting everything on the line to protect our freedoms.","date":"Sat Dec 25 22:03:17 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing you and your loved ones a safe, happy, and healthy Christmas. 🎄","date":"Sat Dec 25 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad our team could join the Arizona Farm Bureau (@azfb) and Arizona Nursery Association (@AZNurseryAssoc) for a poinsettia delivery last week. https://t.co/PSIWCUaDiS","date":"Fri Dec 24 22:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing safe travels to all Arizonans visiting loved ones for the holidays. This time next year, we’ll see improvements to our state’s highways, roads, bridges, airports, and more from our bipartisan infrastructure law. \nhttps://t.co/hA8AqhZPkS","date":"Fri Dec 24 18:02:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona servicemembers and our military communities are critical to America’s national security. Proud that our hard work helped secure several AZ military priorities in this year’s annual defense bill. More: \nhttps://t.co/JjZ3bdpoPC","date":"Thu Dec 23 23:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The @federalreserve was founded #OnThisDay in 1913.","date":"Thu Dec 23 17:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"11 years ago today, Don’t Ask, Don’t Tell was repealed. Any American willing to risk his or her life to protect and serve our country deserves our gratitude and support.","date":"Thu Dec 23 01:29:05 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs law, Arizona airports will receive $69.5 million – boosting tourism, creating jobs, and expanding economic opportunities. https://t.co/bW0pALgpnO","date":"Wed Dec 22 19:06:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured more resources for Mohave County residents harmed by radiation exposure in this year’s defense bill. https://t.co/9N2Fa4d9I1","date":"Tue Dec 21 18:18:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"One year ago today our bipartisan legislation, the Somers Access to Care Act, became law – one of the proudest moments of my career in public service. \nhttps://t.co/O6YMPsIVNO","date":"Tue Dec 21 17:34:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We were honored to join Jack Holder – Pearl Harbor survivor, veteran, and American hero – for his 100th birthday! We hope you enjoyed our cards and best wishes. 🇺🇸 https://t.co/PQl03aTNbe","date":"Mon Dec 20 22:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Still deciding how to treat friends and family for the holidays? Consider celebrating #BuyLocalMonth:\nhttps://t.co/1v7aEN2vIe","date":"Mon Dec 20 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our historic bipartisan infrastructure law includes partnerships between local communities and the federal government to promote safety projects throughout Arizona. Glad @leagueofcities is continuing to advocate for safer cities.\nhttps://t.co/HuN8z6uCo9","date":"Sun Dec 19 22:31:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team was thrilled to participate in the ribbon cutting ceremony for the new @USArmyReserve center in Glendale, AZ – providing space for local Army Reserve units to train more effectively and efficiently. https://t.co/NIy5o43Ixw","date":"Sun Dec 19 17:18:53 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re encouraging Arizonans to support small and local businesses this holiday season, helping fuel our economic recovery. #BuyLocalMonth","date":"Sun Dec 19 00:01:17 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Unvaccinated Arizonans are at a much higher risk of dying from coronavirus than Arizonans who have been fully vaccinated. These vaccines are safe and effective – let’s #VaccinateState48 so our state can get back to normal. \nhttps://t.co/Y663HebZXG","date":"Sat Dec 18 18:48:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our bipartisan Infrastructure Investment and Jobs law, nearly $1 billion is coming to Arizona to strengthen and modernize Arizona’s highways, roads, and bridges. These funds will create 1,000s of jobs and keep Arizonans safe as they travel. https://t.co/5mOVBjYpOF","date":"Fri Dec 17 21:41:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We joined our fellow border-state Senators @JohnCornyn and @MartinHeinrich in introducing a bill to boost Ports of Entry and border security through public-private partnerships. https://t.co/f8m78Zhs7k","date":"Fri Dec 17 21:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured critical resources for Arizona's servicemembers and our military communities in this year's national defense bill. Bases across the state, including Luke and Davis-Monthan Air Force Bases, Fort Huachuca, and Marine Corp Air Station Yuma will receive funding. https://t.co/WZsYaS9YzO","date":"Fri Dec 17 18:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@DHSgov needs to increase resources for Yuma and surrounding communities to help with the current migrant surge. https://t.co/dXSQpXrDTm","date":"Fri Dec 17 15:32:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations to the talented @uarizona students graduating tomorrow. We can’t wait to see all you accomplish for our state and country. #BearDown","date":"Thu Dec 16 22:57:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce new covid-relief funding for Arizona airports. This money will support airports across the state, keeping Arizonans safe and healthy during their travels. https://t.co/erGj7xTDDb","date":"Thu Dec 16 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured critical funding for Arizona in the annual national defense bill. Arizona's servicemembers and our military communities are critical to our national security, and our bill provides funding to bases across AZ for projects and improvements. Watch below for details ⬇️ https://t.co/w2mXBeBunf","date":"Thu Dec 16 00:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#DidYouKnow Arizona dedicated the country's first Bill of Rights monument nine years ago today? Happy Bill of Rights Day! \nhttps://t.co/Pc2OSsLFrS","date":"Wed Dec 15 16:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Team Sinema has the *best* interns! We’re lucky to have this extraordinary group’s help delivering results for the great #State48. https://t.co/adDgAzuYyP","date":"Tue Dec 14 23:55:16 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We are holding the VA accountable as it modernizes its electronic health record to ensure Arizona veterans get the care and benefits they’ve earned. https://t.co/dKwt818FXd","date":"Tue Dec 14 19:17:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to permanently place statues of Justices O’Connor and Ginsburg in the U.S. Capitol has passed the Senate. These 2 women paved the way for so many others in law and life. We’re honing their legacy and remembering their achievements. https://t.co/ypHMlqFr2v","date":"Mon Dec 13 22:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On the @USNationalGuard’s 385th birthday, we’re grateful for the service and sacrifice of our Guardsmen and women keeping our communities safe.","date":"Mon Dec 13 21:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations to the amazing @ASU students graduating today! We’re so proud of your perseverance – and excited to see the great things you’ll achieve. #ForksUp","date":"Mon Dec 13 17:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Imagine what more we could accomplish for our country if, rather than staying in comfortable partisan corners, more leaders reached out in a genuine desire to craft durable, bipartisan solutions to our country’s most difficult challenges.\nhttps://t.co/gYwDpoetJ3","date":"Mon Dec 13 00:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team was honored to attend the Pearl Harbor Remembrance Day in Phoenix earlier this week, commemorating the 80th anniversary of the attack on Pearl Harbor with Arizona veterans and servicemembers. https://t.co/r6XdGM2E20","date":"Sun Dec 12 18:44:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@ASU is working to turn research into solutions for many of our nation’s most pressing challenges. Read more:\nhttps://t.co/KpVw82Z5lK","date":"Sat Dec 11 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Rather than feeding our divisions with extreme rhetoric, all-or-nothing purity tests, and personal attacks, the 10 senators who negotiated this jobs bill showed America something different. Read about how our law provides a roadmap to make Washington work:\nhttps://t.co/gYwDpoetJ3","date":"Sat Dec 11 17:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs law will modernize our Land Ports of Entry – boosting our economy, supporting small businesses, reducing supply chain backlogs, and helping secure the border. https://t.co/MbG7ONYqUR","date":"Fri Dec 10 19:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Human Rights Day! We’ve accomplished so much in the past decade – and we know there’s still more work to do to achieve equality for all. Today, we pledge to continue that work.","date":"Fri Dec 10 16:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In an especially difficult year for education, @ASU ranks as the top university in the country for international students. 👏 \n\nhttps://t.co/cWHDEkrwVa","date":"Thu Dec 09 23:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ Veterans: @PhxVAHealthcare now offers drive-thru COVID-19 and flu vaccinations Monday - Friday, 7:30 a.m. - 3:30 p.m. \n\nWe strongly encourage all veterans -- and all eligible Arizonans -- to get vaccinated as soon as possible.\nhttps://t.co/HUmkaLmG20","date":"Thu Dec 09 22:15:27 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ Shadow Wolves have worked to keep the Tohono O’odham Nation -- and all of Arizona -- safe and secure for decades. \nhttps://t.co/MYaeXxrf7I","date":"Thu Dec 09 00:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@SanLuisAZGov received the @GFOA Certificate of Achievement for financial reporting for the eighth year in a row. Congratulations!\nhttps://t.co/P7Wm0Bsmux","date":"Wed Dec 08 18:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad the Senate confirmed Tucson Police Chief Chris Magnus as @CBP Commissioner. We look forward to working with him to ensure we secure the border, protect our communities, and ensure migrants are treated fairly and humanely.","date":"Tue Dec 07 23:50:37 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured $1.7 million in COVID-relief for the Pascua Yaqui Tribe. These funds will fuel the construction of several public health facilities, directly helping families impacted by COVID-19. https://t.co/GKsX8oSq2P","date":"Tue Dec 07 19:38:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’ll always remember the brave men and women who lost their lives in the attack on Pearl Harbor 80 years ago today. 🇺🇸","date":"Tue Dec 07 15:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Computer Science Education Week, Arizona! There are plenty of opportunities to celebrate, learn, and get involved: \nhttps://t.co/v165B7kHJf","date":"Mon Dec 06 23:23:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Medicare Open Enrollment closes tomorrow. Arizona seniors can visit https://t.co/5IMtcco9si for more information.","date":"Mon Dec 06 16:43:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Jack Yeager is a demonstrated leader with decades of experience -- and will make all of #State48 proud as the next @KingmanAZFire chief.\nhttps://t.co/G5UAZZ4tnm","date":"Sun Dec 05 23:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy International Volunteer Day! Arizonans can volunteer with hundreds of organizations across our state -- including virtually. Check it out.👇 \nhttps://t.co/SL41Y0ToFJ","date":"Sun Dec 05 17:00:46 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This is good news for our state -- and there’s still more work to do. Proud that our bipartisan infrastructure law will create thousands of good-paying Arizona jobs.\nhttps://t.co/YBFVUotxTe","date":"Sun Dec 05 00:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"⬇️ \nhttps://t.co/iUfByJa21l","date":"Sat Dec 04 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to see the North American Development Bank invest in Arizona’s wastewater treatment infrastructure. Together with our Infrastructure Investment and Jobs law this funding will help keep our communities healthy and safe. https://t.co/mT3HOY1YRT","date":"Fri Dec 03 18:58:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We questioned federal nominees about how they would make sure our Infrastructure Investment and Jobs law is implemented fairly and quickly. https://t.co/eNxsCEzZdH","date":"Fri Dec 03 16:40:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona seniors: Medicare Open Enrollment ends Tuesday, December 7. Check your coverage or change plans here. ⬇️ \nhttps://t.co/5IMtcco9si","date":"Fri Dec 03 15:29:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs law will deliver over $500 million to Arizona to help secure our state's water future. https://t.co/trx9kM09UR","date":"Fri Dec 03 02:59:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thrilled to connect with Tohono O’odham Nation Chairman Ned Norris, Jr. this week to discuss our bill reclassifying AZ’s Shadow Wolves -- our country’s only Native American tracking unit -- to help keep Arizona safe and secure. \nhttps://t.co/MYaeXxrf7I","date":"Thu Dec 02 21:53:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We spoke with the VA Secretary about the need for improved VA facilities in Arizona, so our veterans can access the care and benefits they’ve earned. https://t.co/ZwlAAYBvcO","date":"Thu Dec 02 21:21:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #SpecialEducationDay, we pledge to continue supporting funding for special education and schools in under-served communities throughout Arizona.","date":"Thu Dec 02 17:26:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We questioned the Treasury Secretary and Federal Reserve Chairman about the role supply chain issues have on rising prices and how our Infrastructure Investment and Jobs law may help. https://t.co/T2wovLu46i","date":"Wed Dec 01 19:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1955, Rosa Parks famously refused to give up her seat on a bus in Montgomery, AL.","date":"Wed Dec 01 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is #WorldAIDSDay, and we’re raising awareness for the nearly 19,000 Arizonans living with HIV/AIDS. We’re proudly working to increase all Americans’ access to the quality, affordable treatment they need.","date":"Wed Dec 01 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce $40 million is coming to Arizona for hypersonic research and development – fueling our aerospace and defense industry. https://t.co/OOmBv0YV6d","date":"Tue Nov 30 19:08:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona nonprofits provide critical resources and services across our state. On #GivingTuesday, we encourage Arizonans to show their support: https://t.co/ox5wwyVl1a","date":"Tue Nov 30 16:42:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce federal funding to hire more local law enforcement in Glendale and La Paz County. https://t.co/hgjLMMyDjL","date":"Mon Nov 29 20:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Birthday, @Tempegov! We’re grateful for your contributions to the Valley and all of #State48.","date":"Mon Nov 29 19:28:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing a very Happy Hanukkah to all Arizonans celebrating. Chag Sameach!","date":"Sun Nov 28 23:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Including investments for cleaner and more reliable water sources represented a critical Arizona priority throughout the bipartisan infrastructure negotiations. Proud that we secured historic funding for drinking water and wastewater infrastructure. 👇\nhttps://t.co/G4eoUgXINm","date":"Sun Nov 28 20:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations to the four outstanding @ASU educators named as Regents Professors -- the highest faculty award possible. 👏\nhttps://t.co/UwGvsWVMSc","date":"Sat Nov 27 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona -- it’s Small Business Saturday! Consider celebrating by supporting local communities and business-owners today. #ShopSmall","date":"Sat Nov 27 17:30:10 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thinking about skipping Black Friday shopping? #OptOutside today at one of AZ's National Parks! https://t.co/fNLY6Kmxoq","date":"Fri Nov 26 19:56:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Native American heritage and culture is incredibly important to #State48, having shaped our state for generations. We’ll always ensure Tribal sovereignty is respected, and will continue working with Tribal communities to expand opportunity. #NativeAmericanHeritageDay","date":"Fri Nov 26 18:44:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In addition to Thanksgiving, today is the International Day for the Elimination of Violence against Women. We’re calling on Congress to renew #VAWA and ensure survivors of domestic violence and sexual assault have the support they need. #OrangeTheWorld","date":"Fri Nov 26 01:11:24 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This Thanksgiving, we honor and thank our nation’s brave servicemembers -- and their families -- for sacrificing so much to keep America safe.","date":"Thu Nov 25 21:15:16 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Thanksgiving, Arizona! I’m forever humbled and grateful for the opportunity to serve our state in the United States Senate -- and I pledge to continue working hard to deliver lasting results for Arizona’s everyday families. Thank you, #State48.","date":"Thu Nov 25 15:29:17 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to join @StMarysFoodBank this year to help feed Arizonans experiencing hunger ahead of Thanksgiving. If you want to volunteer this holiday season visit https://t.co/kHCf8w5yh4 https://t.co/l7k62jLAss","date":"Wed Nov 24 19:50:55 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing all Arizonans traveling this holiday a safe trip -- and thinking about how our Infrastructure Investment and Jobs Act will provide safer, more reliable transportation over the coming years. #Thanksgiving","date":"Wed Nov 24 15:34:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - if you’re able to participate, there are plenty of opportunities to show thanks and give back to local communities in the Valley this Thanksgiving:\nhttps://t.co/NloRomwjJ1","date":"Tue Nov 23 23:24:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs Act law will bring billions of dollars to Arizona, repairing and upgrading crumbling infrastructure and creating new, good-paying jobs. Glad @SecretaryPete could join us to hear from Arizonans about what our historic law means for our state. https://t.co/d0OGYWoyOf","date":"Tue Nov 23 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our bill to create a fellowship programs for Gold Star families – a small token of gratitude for these patriots who gave the ultimate sacrifice for our country.\nhttps://t.co/r9OmsSeixc","date":"Mon Nov 22 21:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1963, President John F. Kennedy was assassinated. Today, we celebrate his many accomplishments -- leading in space exploration, keeping Americans safe, promoting service opportunities, and so much more. 🇺🇸","date":"Mon Nov 22 16:14:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team participated in the @armyfutures project convergence in Yuma, supporting our servicemembers and Arizona's military installations. https://t.co/8ByknF5QI6","date":"Sun Nov 21 22:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Infrastructure Investment and Jobs Act was made possible by our group of 10 Senators -- including our fantastic #WonderWomen. 🦸‍♀️\n\n@SenatorShaheen @SenatorCollins @lisamurkowski","date":"Sun Nov 21 15:45:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Grateful to the leaders in the @ProbSolveCaucus for their successful work ensuring the Infrastructure Investment and Jobs Act was signed into law. #ProblemSolvers","date":"Sun Nov 21 00:42:38 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Caregivers shoulder intense responsibility while supporting loved ones. We’re proud cosponsors of the Alzheimer’s Caregiver Support Act, which provides critical training for Arizonans looking after family members. #FamilyCaregiversMonth https://t.co/rJC4fzsuzr","date":"Sat Nov 20 15:14:21 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Now that our Infrastructure Investment and Jobs Act is law, airports across AZ will receive critical funding for repairs and upgrades. Glad to be joined by @SenMarkKelly and @SecretaryPete to see firsthand how @PHXSkyHarbor will benefit.\nhttps://t.co/UtD5uU7ESp https://t.co/LOvCbZbJTq","date":"Sat Nov 20 01:09:13 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following the signing of our Infrastructure Investment and Jobs Act, we hosted a roundtable with @SenMarkKelly and @SecretaryPete to discuss supply chain issues and how our new law will boost jobs and expand economic opportunity. https://t.co/eIpIiD5qKU https://t.co/DEEIE98DwS","date":"Fri Nov 19 22:50:18 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@GoodyearAZGov was established #OnThisDay in 1946. Happy Birthday!","date":"Fri Nov 19 15:49:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Open Textbooks Pilot program reduces costs for Arizona students, allowing college students to save money and achieve their dreams. #AmericanEducationWeek \nhttps://t.co/PvhWhNMuJ9","date":"Thu Nov 18 23:47:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"@CesarChavezAZ Thank you, Rep. Chávez and your colleagues for addressing this critical issue! We agree - we must lower prescription costs for seniors. Here's how I am working in the Senate to do just that. Looking forward to continuing to work together. https://t.co/jTtRyqIFle","date":"Thu Nov 18 22:38:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs Act -- which was just signed into law -- will create millions of jobs and make our country stronger, safer, and more globally competitive. \n\nAll without raising taxes on everyday Americans. ⬇️  \nhttps://t.co/WISJVxLjal","date":"Thu Nov 18 16:43:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #TakeAHikeDay! Take some time to hit one of #State48’s incredible trails. https://t.co/lGGAlxRukf","date":"Wed Nov 17 21:11:22 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"With our Infrastructure Investment and Jobs Act now law, Arizona is set to receive hundreds of millions of dollars to expand access to broadband internet. The FCC needs to update their broadband maps so we can distribute these funds to areas most in need. https://t.co/kHB9KvdbSs","date":"Wed Nov 17 20:28:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured a $10.6 million grant for Yuma’s Multimodal Transit Center. This money will boost the city’s economic growth by connecting residents to critical services, revitalizing downtown Yuma, and creating jobs. https://t.co/8aRQOD3SWt","date":"Wed Nov 17 14:23:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona -- let’s do our part by getting vaccinated for our state’s continued recovery and -- most importantly -- the health and safety of our loved ones.\nhttps://t.co/rbHfEoLRBC","date":"Wed Nov 17 00:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’ve all heard that bipartisanship isn’t possible anymore -- and that important policy like our Infrastructure Investment and Jobs Act can only happen on a party line. \n\nOur legislation proves the opposite. \nhttps://t.co/ulS8paDGNZ","date":"Tue Nov 16 18:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"President Biden signed our historic, bipartisan Infrastructure Investment and Jobs Act into law! \n\nThis is what it looks like when elected leaders set aside differences, shut out the noise, and focus on delivering results on the issues that matter most to everyday Americans.","date":"Tue Nov 16 01:00:44 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, I joined President Biden as he signed our Infrastructure Investment and Jobs Act into law.\n\nAt the ceremony, I said this is what it looks like when leaders set aside differences, shut out the noise, and deliver results on the issues that matter to everyday Americans. https://t.co/GQnd0LH1Ua","date":"Mon Nov 15 23:28:50 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're at the White House to join President Biden as he signs our bipartisan Infrastructure Investment and Jobs Act into law.\n\nhttps://t.co/fG4T1f4b3C","date":"Mon Nov 15 20:23:18 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re so proud to have led negotiations on the historic, bipartisan Infrastructure Investment and Jobs Act, which will be signed into law today. This bill is full of policies that will make a real, lasting difference in the lives of everyday Arizonans.\nhttps://t.co/gnzqDFsMlO","date":"Mon Nov 15 16:44:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This National Family Caregivers Month, @alzassociation invites Arizonans who look after loved ones with Alzheimer’s to participate in virtual education sessions throughout November. https://t.co/5MR9MjTQxs","date":"Sun Nov 14 23:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona -- this bill is a big deal: https://t.co/WISJVxtIiN","date":"Sun Nov 14 17:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We worked hard to ensure our bipartisan infrastructure bill effectively addresses Arizona’s historic drought conditions, made worse by this year’s La Nina. \nhttps://t.co/LdS6wnxQJr","date":"Sat Nov 13 22:40:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This #LungCancerAwarenessMonth, we’re working to advance lung cancer research to better determine causes, understand prevention, and develop life-saving treatment.","date":"Sat Nov 13 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We were honored to join Arizona veterans at Sedona's 2021 Veterans Day Tribute. We're thankful for their service and sacrifice and remain committed to ensuring they get the benefits and care they’ve earned. https://t.co/Tfhi8kt40B","date":"Sat Nov 13 00:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona -- earlier this year, we helped secure a bigger tax credit for Arizona’s everyday families. Monday, November 15 is the last day for non-filers to receive this much-needed financial support. More info: https://t.co/WSQzcx3M07","date":"Fri Nov 12 21:32:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"November is National Diabetes Month. We cosponsored the Diabetes Self-Management Training Act, empowering Arizonans with diabetes to learn from certified diabetes educators about how to manage their diabetes, prevent complications, and hospitalizations. https://t.co/YQ9wE4YBLD","date":"Fri Nov 12 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This Veterans Day, we proudly renew our commitment to support, honor, and protect our nation’s servicemembers -- both overseas and at home.","date":"Thu Nov 11 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our nation and state are forever indebted to our veterans and their families for their service and sacrifice to keep our nation safe and protect our freedoms. #VeteransDay","date":"Thu Nov 11 15:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured @forestservice funding to rehabilitate the Museum Fire Burn Scar. Glad to meet with Northern Arizona leaders and the U.S. Forest Service to discuss the federal government’s role in forest management.\n\nhttps://t.co/p6s6t2CGWf https://t.co/Cqls77fna2","date":"Wed Nov 10 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@gatewayairport is the perfect home for @GulfstreamAero’s new facility. The project will expand economic opportunities and create hundreds of good-paying jobs. Proud to welcome them to the Valley.\n\nhttps://t.co/CpHtYYnqFM https://t.co/G86fuU6quk","date":"Wed Nov 10 18:54:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@USMC was established #OnThisDay in 1775 -- and has worked to keep Americans safe and secure for 246 years. #SemperFidelis","date":"Wed Nov 10 16:24:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As Veterans Day approaches, Arizona veterans are encouraged to explore the many events and deals for servicemembers across #State48. \nhttps://t.co/mXw76ciItw","date":"Tue Nov 09 21:34:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy National STEM Day, Arizona! We’re working to expand STEM education, which equips Arizona students for the jobs of the future. #NationalSTEMDay","date":"Mon Nov 08 22:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We included crucial investments to modernize and strengthen Land Ports of Entry, funding every Customs and Border Protection Land Port of Entry project on the agency’s five-year plan. https://t.co/o9ZW1eVoBJ","date":"Mon Nov 08 18:18:10 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona families and employers depend on a strong, reliable supply of power -- so we included historic investments in America’s critical power grids and energy infrastructure. https://t.co/OAf3hXBoZ0","date":"Mon Nov 08 18:18:09 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs Act makes historic investments in critical water systems and addressing drought conditions threatening the health and safety of Arizona communities. https://t.co/efMftVbXEO","date":"Mon Nov 08 18:18:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We ensured that the legislation includes major upgrades to every airport in the country. This historic investment will create jobs, improve passenger safety, boost tourism, and ensure Arizona continues to lead in aviation. https://t.co/uh7kWBvWqJ","date":"Mon Nov 08 18:18:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The bipartisan Infrastructure Investment and Jobs Act strengthens and upgrades critical infrastructure to prevent and mitigate the impacts of wildfires and boost recovery from such disasters. https://t.co/R4co7bz46R","date":"Mon Nov 08 18:18:07 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act passed the U.S. House, and President Biden is expected to sign it into law. Arizona -- this legislation is a game-changer for our state’s communities. ⬇️","date":"Mon Nov 08 18:18:06 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill makes significant investments in critical transportation and water infrastructure, broadband deployment, and security programs in Tribal communities -- creating jobs and expanding economic opportunity while respecting tribal sovereignty. https://t.co/USAHfJqpaX","date":"Mon Nov 08 18:18:06 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations to Jacob C. Fruchthendler Elementary School’s Principal, Tucson’s Mary Anderson, who received the 2021 Terrel H. Bell award for outstanding leadership.\nhttps://t.co/7o4edHMwNj","date":"Sun Nov 07 23:33:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1916, Jeannette Rankin (one of my personal heroes) became the first woman elected to Congress. We’re celebrating her remarkable legacy of service and strength.","date":"Sun Nov 07 17:44:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans are too smart for daylight saving time -- no need to turn those clocks back tonight. ⏰","date":"Sun Nov 07 01:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great news, Arizona! The U.S. House just passed our bipartisan Infrastructure Investment and Jobs Act in a major victory for our state and country. \n\nIt’s the largest investment in critical infrastructure in a generation, upgrading roads, bridges -- and so much more.","date":"Sat Nov 06 17:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The House has passed our bipartisan Infrastructure Investment and Jobs Act. Once the president signs this bill, the largest investment in American infrastructure in a generation will be law.\n\nWATCH to see how our bill will benefit everyday Arizonans ⬇️ https://t.co/9GYaDwhVhQ","date":"Sat Nov 06 03:37:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Military families make incredible sacrifices for our country – and their frequent moves, long deployments, and intense training can cause extreme stress. Our COMFORT Act with @RoyBlunt increases access to counselors. #MilitaryFamilyMonth https://t.co/cf15kucL5n","date":"Fri Nov 05 16:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our nation observes daylight saving time this Sunday -- but not #State48. In Arizona, we do things a little differently.\nhttps://t.co/mxgGWGMa4z","date":"Thu Nov 04 22:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to classify the Tohono O’odham Nation’s Shadow Wolves as special agents is now one step closer to becoming law. https://t.co/t7IPgjHEpZ","date":"Thu Nov 04 18:11:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our commonsense, bipartisan plan saves Arizona taxpayers’ money through smarter, more efficient use of federal properties across the country. https://t.co/tYRZPbHb83","date":"Wed Nov 03 20:24:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The administration must quickly release drought relief funds for Arizona. https://t.co/8l0i4Cj1zf","date":"Wed Nov 03 17:12:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"November is Lung Cancer Awareness Month. We encourage Arizonans and their loved ones living with lung cancer to explore the support and resources available to you: https://t.co/Bkt8bUsJee","date":"Tue Nov 02 23:17:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Sinema Office Statement on Historic Medicare Drug Negotiation Agreement: https://t.co/jiHeH6q4kB","date":"Tue Nov 02 18:42:57 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"La Nina could worsen AZ's drought. From building and strengthening western water infrastructure, to fueling water projects in the lower Colorado River Basin, our bipartisan infrastructure bill includes historic investments to address our state’s drought. https://t.co/LYzzsnjvld","date":"Tue Nov 02 00:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Día de los Muertos, AZ! Don’t miss these chances to celebrate across our state: https://t.co/KDc4JznAsD","date":"Mon Nov 01 16:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The sooner young Arizonans get vaccinated, the sooner our schools can fully return to safe and effective in-person learning. We strongly encourage all Arizona families to get vaccinated as soon as vaccines are available: \nhttps://t.co/0CL1UNKpOd","date":"Sun Oct 31 23:50:23 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Halloween, Arizona! 🎃","date":"Sun Oct 31 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act invests $15 billion to remove lead pipes from our water systems – making our drinking water cleaner and safer. https://t.co/GU0w8ltQmi","date":"Sat Oct 30 23:14:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona communities need blood donations -- sign up to donate here: https://t.co/HBbdBuXhjw. \nhttps://t.co/o0Ojnz90te","date":"Sat Oct 30 18:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We have a duty to protect the brave men and women who serve our communities. For Arizona’s first responders and their loved ones, please get vaccinated. \nhttps://t.co/fYZklzywH0","date":"Fri Oct 29 22:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to see the continued progress toward returning to normal. We're encouraging all eligible Arizonans to get the vaccine for our continued health and economic recovery. \nhttps://t.co/nKN6bJQtZG","date":"Fri Oct 29 15:47:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The facts are clear. Arizona’s health and economic recoveries both depend on everyone who is eligible getting vaccinated. \nhttps://t.co/pZTB2UaBK7","date":"Thu Oct 28 23:49:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"After months of productive, good-faith negotiations with @POTUS and the White House, we have made significant progress on the proposed budget reconciliation package. I look forward to getting this done, expanding economic opportunities and helping everyday families get ahead.","date":"Thu Oct 28 15:45:48 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"I look forward to working with Ambassador Flake to advance our national security, repair a strained relationship with Turkey, and bring stability to the region.","date":"Wed Oct 27 22:37:14 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@JeffFlake will represent America well and with distinction as our Ambassador to Turkey, just as he represented Arizona in both chambers of Congress.","date":"Wed Oct 27 22:37:14 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Jeff’s unanimous confirmation demonstrates the Senate’s trust in his skills and record as a bipartisan and consensus-building statesman.","date":"Wed Oct 27 22:37:14 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The @CMOH_Society Citizen Honors Awards commemorate local heroes for helping others in their communities. Nominations for the 2022 Citizen Honors Awards are open now through December 31. Submit a story for your hometown hero here: https://t.co/u6Syb7qeWr","date":"Wed Oct 27 19:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Proposed Corporate Minimum Tax https://t.co/tRLMDXLgot","date":"Tue Oct 26 21:00:13 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"National Day of the Deployed reminds us of our duty to protect the men and women in uniform -- overseas and at home. We’re working with @senrobportman to reduce suicide risk among servicemembers with our Military Suicide Prevention in the 21st Century Act: https://t.co/nf5aA7UR4m","date":"Tue Oct 26 16:17:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Producing clean and reliable energy is critical to Arizona’s future. That’s why our bipartisan Infrastructure Investment and Jobs Act Invests $32 billion in clean energy. https://t.co/nFC6VlmznE","date":"Mon Oct 25 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad @TheJusticeDept awarded funding to support accreditations for 18 tribal police agencies across Arizona. https://t.co/eZh3KPd64T","date":"Mon Oct 25 18:21:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This Women’s Small Business Month, consider supporting local women-owned companies -- like AEC Printing in Flagstaff! AEC has served the Flagstaff community for over 40 years: \nhttps://t.co/qvpUw3NycK","date":"Sun Oct 24 23:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #UnitedNationsDay, we commemorate the creation of the @UN 76 years ago today.","date":"Sun Oct 24 17:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#DidYouKnow our bipartisan Infrastructure Investment and Jobs Act includes the #REPLANTAct? It helps the U.S. @forestservice plant 1.2 billion trees on National Forest lands, creating thousands of jobs over the next decade. 🌱 \nhttps://t.co/R4co7bhtfj","date":"Sat Oct 23 22:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable with key local leaders to identify ways to resolve the ongoing sewage water issue in Nogales. https://t.co/vwuhm31zly https://t.co/ZmyIR0kKwz","date":"Sat Oct 23 15:00:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with Yuma @MayorNicholls to discusses infrastructure and our work to secure Arizona’s water future. https://t.co/b9qko0XlCW https://t.co/mzU8dNgnzP","date":"Fri Oct 22 22:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The pandemic created challenges for all Arizonans -- especially young kids. Check out these amazing resources to help young Arizonans get through these difficult times: https://t.co/Plsvmmqgpt","date":"Fri Oct 22 17:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re expanding law enforcement agencies’ ability to stop drug and human traffickers, helping keep communities across our country safe and secure. https://t.co/3p8it4YVrq","date":"Thu Oct 21 21:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Individuals experiencing domestic violence can explore available resources here: https://t.co/0cytf7K4X2","date":"Thu Oct 21 19:05:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is Purple Thursday -- a national day of action and awareness during #DomesticViolenceAwarenessMonth. Team-Sinema is wearing purple today to show support and solidarity for the many Americans who experience domestic violence. 💜 https://t.co/ColAFZtvA9","date":"Thu Oct 21 19:05:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Military families make incredible sacrifices – their frequent moves, deployments, and training can cause extreme stress. We’re increasing access to Military and Family Life Counselors to ensure they have access to the services they’ve earned. https://t.co/cf15kucL5n","date":"Thu Oct 21 16:48:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will invest $39 billion to expand and strengthen public transit – moving commuters and visitors around our cities and towns quickly and safely. https://t.co/Rwuz80Hf8U","date":"Wed Oct 20 21:02:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We partnered with Senators Marshall &amp; Thune to introduce the Improving Seniors’ Timely Access to Care Act to help Arizona seniors with Medicare Advantage plans receive timely, quality health care with lower costs. https://t.co/FH8dkQhWnW","date":"Wed Oct 20 15:36:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tucson Police Chief Magnus is an exceptional nominee to be @CBP Commissioner. Having someone like him leading CBP is the best way to secure the border, better protect our communities, and ensure migrants are treated fairly and humanely. https://t.co/CG0qQGjeXE","date":"Wed Oct 20 15:13:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad @USDOT awarded a $158 million grant for @valleymetro's Northwest Light Rail Extension Phase II. Transit connects our communities and grows our economy which is why our Infrastructure Investment and Jobs Act will invest in transit programs across AZ. https://t.co/0M1AR69Y5A","date":"Tue Oct 19 23:59:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The administration must release funding to help Arizona families facing financial strain with their energy costs. https://t.co/eBcxHSFLP3","date":"Tue Oct 19 18:29:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re strengthening clean water protections through our bipartisan Infrastructure Investment and Jobs Act -- including $15 billion for lead pipe replacement and $10 billion to address water contamination caused by PFAS and other “forever chemicals.” https://t.co/efMftUUmNg","date":"Mon Oct 18 19:30:05 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1972, the Clean Water Act was signed into law.","date":"Mon Oct 18 19:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on General Powell’s passing: https://t.co/z0miJHoifP","date":"Mon Oct 18 14:01:57 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ firefighters compete and share recipes to raise money for child burn victims with @arizonaburn. Amazing to see Arizonans coming together for this cause.\nhttps://t.co/6a4XnaDpZ5","date":"Sun Oct 17 23:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wildfires are happening more often and growing more severe. Our bipartisan Infrastructure Investment and Jobs Act funds wildfire prevention efforts, reduces hazardous fuels, and boosts recovery efforts. https://t.co/lPkdlH7wtu","date":"Sun Oct 17 18:31:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"During Women’s Small Business Month, we’re spotlighting some of Arizona’s many incredible women-owned businesses. @LocalFirstAZ builds strong, inclusive economies in local communities across our state.\nhttps://t.co/SRbDwfCjBC","date":"Sat Oct 16 23:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"5 Arizona schools were ranked among the best in the nation for academic performance by the @NatlBlueRibbon Awards. ⬇️\nhttps://t.co/MwkjObIbsT","date":"Sat Oct 16 18:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re joining a bipartisan group of Senators to protect Medicare Advantage for Arizona seniors – ensuring they continue to have affordable access to the health care they need and deserve.\n\nhttps://t.co/rx9IBhVlVK","date":"Fri Oct 15 22:15:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - today is Latino AIDS Awareness Day. We’re encouraging Arizonans to take this opportunity to get a free HIV test at one of many AZ locations: https://t.co/5iNKG2myoA","date":"Fri Oct 15 20:06:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is #NationalMammographyDay. We'll continue working to ensure every Arizona woman can access lifesaving screenings. Find a free mammogram near you: https://t.co/cW9a9CFcic","date":"Fri Oct 15 17:14:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to protect Arizona teachers from surprise loan charges was signed into law. https://t.co/3Gx7WOMiQQ","date":"Thu Oct 14 19:37:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"October is Domestic Violence Awareness Month. We’re working with @JohnCornyn to support domestic violence survivors in the military and hold perpetrators accountable -- ensuring the health and safety of everyone in our military communities. https://t.co/7woyW3kLEm","date":"Thu Oct 14 16:40:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As a border state, cross-border travel and trade fuels Arizona jobs and business opportunities. Glad to see that, following our request, @DHSgov plans to ease restrictions on cross-border travel. https://t.co/h1iFCBHbJV","date":"Thu Oct 14 14:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"October is Women’s Small Business Month! Our team is celebrating by highlighting women-owned businesses from across our state, starting with @GreenwoodBrews -- AZ’s first woman-owned brewery.\nhttps://t.co/CMXjns3JRU","date":"Thu Oct 14 00:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Birthday, @USNavy! We’re grateful for your service and sacrifice to our country.","date":"Wed Oct 13 17:43:57 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Ada Lovelace is remembered as the first known computer programmer and tech visionary of her time. On #AdaLovelaceDay, we’re proudly celebrating women and their achievements in STEM. https://t.co/y6bSIUTqsv","date":"Tue Oct 12 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy National Farmers’ Day, Arizona! Earlier this year, the U.S. Senate came together to pass our bill with @SenMarkKelly to increase economic opportunities for Arizona farmers and ranchers while keeping our air clean and supporting a cleaner environment. https://t.co/TX6VxdhNL0","date":"Tue Oct 12 17:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"53 years ago today, #Apollo7 launched from Cape Kennedy, Florida. 🚀","date":"Mon Oct 11 20:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Indigenous communities and contributions are part of what makes #State48 so great! On Indigenous Peoples’ Day, we honor and celebrate Arizona’s 22 federally-recognized Tribes.","date":"Mon Oct 11 16:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans struggling with mental health are not alone. We proudly worked with @SenMarkKelly to deliver $71.9 million to help Arizonans recover from mental health and substance abuse. #WorldMentalHealthDay 💪 https://t.co/l4Wx9jc0VN","date":"Sun Oct 10 22:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Last year, our bill expanding mental health resources for veterans adjusting to civilian life was signed into law. We’ll keep working to ensure our nation’s veterans get the support they’ve earned -- both physical and mental. #WorldMentalHealthDay https://t.co/rto1Bz8oZR","date":"Sun Oct 10 21:31:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1845, the United States @NavalAcademy was established -- and America’s Sailors have continued working tirelessly to keep us safe and secure every day since.","date":"Sun Oct 10 18:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@uarizona offers COVID booster shots to eligible students, faculty, and staff -- learn more: \nhttps://t.co/CxUAYYickh","date":"Sun Oct 10 00:10:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re forever grateful for Arizona’s first responders. Thank you, @PHXFire, for keeping our communities safe and secure. \nhttps://t.co/j8pMr7exVn","date":"Sat Oct 09 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will help secure Arizona's water future as we continue to grow, and deliver cleaner water to millions of Arizona households. https://t.co/nr9yRUokX9","date":"Fri Oct 08 22:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona is recovering jobs lost during the pandemic -- and there are many job openings across our state. Employers are hiring in the Phoenix area. 👇\n\nhttps://t.co/tayl7HkEzU","date":"Thu Oct 07 22:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Arizona Hispanic Chamber of Commerce (@azhcc) signals a promising recovery for minority-owned businesses. 💪 \nhttps://t.co/CILEd4vukQ","date":"Thu Oct 07 18:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“The Grand Canyon State ranked first in the index for small business growth in August, edging out Texas and Georgia, which ranked second and third, according to the Small Business Jobs Index from by Paychex and IHS Markit.” ⬇️\nhttps://t.co/k9TaedLr2R","date":"Wed Oct 06 23:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"October is Breast Cancer Awareness Month. We’re making life-saving screenings more accessible, and reminding Arizona women to schedule regular exams and mammograms. Learn more about detecting breast cancer early: https://t.co/3uuEROs2HL","date":"Wed Oct 06 20:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona families and businesses need reliable electricity. That’s why we ensured our bipartisan Infrastructure Investment and Jobs Act will strengthen power grids and make our energy system more resilient against extreme weather. https://t.co/Znrsix2Ogz","date":"Tue Oct 05 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy World Teachers Day, Arizona! Today and every day, we’re grateful for the dedicated educators across our state.","date":"Tue Oct 05 19:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The pandemic highlighted the need for high-speed broadband in every corner of Arizona. Our bipartisan Infrastructure Investment and Jobs Act invests $65 billion in broadband expansion and access -- creating economic opportunities and connecting Arizona communities. https://t.co/1hhJcUhGYU","date":"Mon Oct 04 21:31:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement Following Events at ASU on Sunday https://t.co/4d3BF9P8CO","date":"Mon Oct 04 15:20:49 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Canceling the U.S. House vote on the bipartisan Infrastructure Investment and Jobs Act denies Americans millions of new good-paying jobs and hurts everyday families.\n\nFull statement ⬇️ https://t.co/BM7hrUL3KK","date":"Sat Oct 02 17:30:25 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on Budget Reconciliation Negotiations https://t.co/QZpaMXxm7q","date":"Thu Sep 30 17:36:36 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congrats to my running frenemey @SenCapito who took the Senate title yesterday. 🏆\n\nI’ll be back for redemption next year, sans boot. 🏃🏼‍♀️ 🥇 https://t.co/Tps325Wn6a","date":"Thu Sep 30 12:39:16 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On National VFW Day, we thank the brave men and women who sacrificed so much for our freedom.","date":"Wed Sep 29 21:12:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Suicide among our servicemembers is a nation crisis. We introduced a bill with @SenRobPortman to create a pilot program to use cutting-edge technology to support our troops’ mental health.\n\nRead more ⬇️ https://t.co/nf5aA7UR4m","date":"Tue Sep 28 20:11:06 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - today is National Voter Registration Day. Especially now, it’s important that all eligible Arizonans register to vote (and update your registration information) as soon as you’re able. Make your voice heard! ⬇️ https://t.co/K9CetMO8i5","date":"Tue Sep 28 16:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We reintroduced our bipartisan bill to make veterans’ long-term care options more affordable. https://t.co/7417czUCHE","date":"Mon Sep 27 23:09:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"For the seventh year in a row, @ASU leads the nation in innovation. Congratulations! \nhttps://t.co/nHPtrMrJ3K","date":"Mon Sep 27 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure bill supports a greener future for Tribal communities, providing $216 million for Tribal climate resilience, adaptation -- and community planning, design, and implementation of projects that address climate challenges.\nhttps://t.co/USAHfJI0zx","date":"Mon Sep 27 16:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our PAWS for Veterans Therapy Act -- which recently became law -- empowers Arizona veterans to participate in service dog training therapy and allows them to adopt those service dogs. #NationalServiceDogMonth https://t.co/1UPZKsro9K","date":"Sun Sep 26 21:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, on #GoldStarMothersDay, we honor and send strength to the mothers who have lost sons or daughters in service to our country. ⭐️","date":"Sun Sep 26 16:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Last year, we proudly cosponsored the Great American Outdoors Act providing permanent and full funding for the Land and Water Conservation Fund and addressing the maintenance backlog in Arizona’s national parks and other public lands. #PublicLandsDay https://t.co/kC4gO2Go1o","date":"Sat Sep 25 20:30:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In #State48, we treasure our public lands. They’re vital to economic success -- supporting jobs, attracting tourism, and building vibrant communities across our state. Happy #PublicLandsDay, Arizona! https://t.co/sflcy85ryM","date":"Sat Sep 25 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On September 25, 1981, Sandra Day O’Connor became the first woman Supreme Court Justice -- paving the way for countless women to pursue a career in public service. 40 years later, we’re grateful for her meaningful and inspirational legacy.","date":"Sat Sep 25 18:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on conclusion of Arizona ‘audit’ https://t.co/fVKFIT3bLr","date":"Fri Sep 24 18:15:15 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #NativeAmericanDay, we’re reminded of the incredible contributions all of Arizona’s 22 Tribes make across our state and country. We’ll always work to protect Tribal sovereignty and expand opportunity. https://t.co/9ZM4Coa6ml","date":"Fri Sep 24 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"This announcement from @usbr on the 5-year projections for Lakes Mead and Powell underscores the need for swift passage of the Infrastructure Investment and Jobs Act to help secure Arizona's water future.","date":"Thu Sep 23 18:46:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We successfully worked to include hundreds of millions of dollars for the Emergency Watershed Protection Program in the bipartisan Infrastructure Investment and Jobs Act -- to help local communities recover after wildfires. \nhttps://t.co/R4co7bhtfj","date":"Thu Sep 23 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs Act will help close the digital divide with $2 billion for the Tribal Broadband Connectivity Program, boosting broadband deployment, workforce development, telehealth, and distance learning in Tribal communities. \nhttps://t.co/USAHfJqpaX","date":"Wed Sep 22 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy first *official* day of fall, Arizona!","date":"Wed Sep 22 16:04:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congress and the administration must work together to secure the border, protect our communities, and ensure migrants are treated fairly and humanely. https://t.co/xVPygc7OL9 https://t.co/DKJnuf0EOO","date":"Wed Sep 22 00:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Mental health challenges -- including thoughts of suicide -- can affect anyone, especially in such stressful times. This #SuicidePreventionMonth, check out these important mental health resources: https://t.co/BNZEqsQQse.","date":"Tue Sep 21 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will improve airport travel -- leading to shorter wait times, fewer delays, and safer experiences for Arizonans who fly. https://t.co/YerNmPOYop","date":"Mon Sep 20 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"If you or someone you know is affected by leukemia, lymphoma, myeloma or Hodgkin's disease, you can access support resources here: https://t.co/TBkKdT45S3 #BloodCancerAwarenessMonth #FightBloodCancer","date":"Mon Sep 20 17:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Support amazing restaurants across Arizona this Restaurant Week. Explore participating restaurants here: https://t.co/8EKuRagwIa","date":"Sun Sep 19 19:55:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Mitigating and Recovering from Wildfires: The Infrastructure Investment and Jobs Act allows the use of Emergency Relief program funding for protective features to mitigate the risk of recurring damage or the cost of future repairs from natural disasters.","date":"Sun Sep 19 16:15:28 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Watershed Protection: The legislation provides hundreds of millions of dollars for the Emergency Watershed Protection Program to help local communities recover after wildfires.","date":"Sun Sep 19 16:15:28 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wildland Fire Mitigation &amp; Management Commission Act: The Infrastructure Investment and Jobs Act includes this bipartisan bill, which establishes a commission to study and recommend wildland fire prevention, mitigation, suppression, management, and rehabilitation policies.","date":"Sun Sep 19 16:15:28 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Fireweather Test Bed Programs: The Infrastructure Investment and Jobs Act invests $100 million to improve wildfire prediction, detection, observation, modeling, and forecasting.","date":"Sun Sep 19 16:15:27 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Road and Trail Restoration: Our historic proposal provides funding to remediate Forest Service legacy roads and trails.","date":"Sun Sep 19 16:15:27 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Forecasting and Detecting Drought: Our plan funds the National Oceanic and Atmospheric Administration’s high-performance computing -- allowing the agency to improve drought, flood, and wildfire prediction and detection.","date":"Sun Sep 19 16:15:27 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Burned Area Rehabilitation: The Infrastructure Investment and Jobs Act provides $450 million for the Forest Service and the Department of Interior to carry out Burned Area Rehabilitation.","date":"Sun Sep 19 16:15:26 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Community Defense Grants: The Infrastructure Investment and Jobs Act invests $500 million for Forest Service Community Defense Grants.","date":"Sun Sep 19 16:15:24 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"REPLANT Act: Our plan includes this legislation, which helps the U.S. Forest Service plant 1.2 billion trees on national forest lands, creating nearly 49,000 jobs over the next decade.","date":"Sun Sep 19 16:15:24 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Hazardous Fuels: The Infrastructure Investment and Jobs Act provides $2.4 billion for the Forest Service and the Department of Interior to reduce hazardous fuels on federal, state, and Tribal lands.","date":"Sun Sep 19 16:15:23 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wildfires increasingly threaten the health and safety of AZ communities. Our bipartisan Infrastructure Investment and Jobs Act makes historic investments to prevent and mitigate the impacts of wildfires and boost communities’ recoveries from such disasters.🧵","date":"Sun Sep 19 16:15:22 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal Climate Resilience: The plan provides $216 million for Tribal climate resilience, adaptation, and community planning, design, and implementation of projects that address climate challenges.","date":"Sat Sep 18 18:45:10 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal Cybersecurity Grants: The Infrastructure Investment and Jobs Act establishes a new federal cybersecurity grant program for Tribal Governments.","date":"Sat Sep 18 18:45:09 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Raising the Voices of Native American Communities: The Infrastructure Investment and Jobs Act establishes a new Assistant Secretary for Tribal Government Affairs under the U.S. Department of Transportation.","date":"Sat Sep 18 18:45:09 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Bureau of Indian Affairs Road Maintenance Program: The historic legislation significantly boosts funding for the Road Maintenance Program.","date":"Sat Sep 18 18:45:09 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal Public Transportation Modernization: Our bill provides over $20 million for Arizona Tribal governments to improve and modernize their public transportation systems.","date":"Sat Sep 18 18:45:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Critical Tribal Water Infrastructure: The Infrastructure Investment and Jobs Act invests $3.5 billion in the Indian Health Service Sanitation Facilities Construction program for water infrastructure and resiliency.","date":"Sat Sep 18 18:45:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal Broadband: The Infrastructure Investment and Jobs Act sets aside $2 billion for the Tribal Broadband Connectivity Program, boosting broadband deployment, digital inclusion, workforce development, telehealth, and distance learning.","date":"Sat Sep 18 18:45:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Indian Water Rights Settlements: The legislation provides full funding to complete all currently-authorized Indian Water Rights Settlements.","date":"Sat Sep 18 18:45:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tribal Governments and Native American Communities will directly benefit from our bill which expands economic opportunities while respecting tribal sovereignty. Here’s how.👇","date":"Sat Sep 18 18:45:07 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans may have heard about our bipartisan Infrastructure Investment and Jobs Act’s historic investment in upgrading roads and bridges, high-speed broadband, water systems, and power grids. What else is included for Tribal communities in AZ? 🧵","date":"Sat Sep 18 18:45:07 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1947, the @usairforce was established. We’re working to protect critical resources -- like the A-10 Warthog -- to ensure America’s security. https://t.co/Qb52ckOdTp","date":"Sat Sep 18 17:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, on National #POWMIA Recognition Day, we honor and thank our nation’s servicemembers who sacrificed so much to protect our freedoms. Our National POW/MIA Flag Act ensures we remember these heroes year-round.  https://t.co/84gQu03ulB","date":"Fri Sep 17 22:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s roads need upgrades. That’s why we included $110 billion in our bipartisan Infrastructure Investment and Jobs Act for roads, bridges, and major transportation projects -- helping Arizonans get where they need to go more safely and reliably. https://t.co/L1gUF139RN","date":"Fri Sep 17 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1787, America’s Founders signed the United States Constitution.","date":"Fri Sep 17 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona: Applications for the @DesertFinancial @Fiesta_Bowl #WishesForTeachers program -- which awards $2,500 classroom grants to 400 AZ teachers -- is now open. Learn more: \nhttps://t.co/888uRkLNQK","date":"Thu Sep 16 21:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"September is #HungerActionMonth. Find a local food bank near you to help AZ families facing hunger. https://t.co/dssDg11QrZ","date":"Thu Sep 16 16:55:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing an easy fast to all observing #YomKippur. G'mar chatima tova.","date":"Thu Sep 16 00:34:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans know our bipartisan infrastructure bill will upgrade roads and bridges -- but #DidYouKnow we included $3.5 billion in Tribal water investments for the Indian Health Service Sanitation Facilities Construction program for water infrastructure and resiliency?","date":"Wed Sep 15 21:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Hispanic Heritage Month begins today, Arizona! Our state’s culture is rich with Hispanic heritage and history. https://t.co/D9TpPqJKLu","date":"Wed Sep 15 17:40:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"¡El mes de la herencia hispana comienza hoy, Arizona! La cultura de nuestro estado es enriquecida con la historia y herencia hispana. https://t.co/wDbpGaxAUe","date":"Wed Sep 15 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Especially as the coronavirus Delta variant continues to impact our communities, we must protect ourselves and our loved ones this flu season: https://t.co/UuDyrM7W43.","date":"Tue Sep 14 20:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing Arizona photographer Nick Oza a full recovery after his frightening accident. Sending strength to him and his loved ones. https://t.co/IWLNBWNxl2","date":"Tue Sep 14 15:38:51 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following our request, the President has issued a Major Disaster Declaration for Arizona – opening up critical federal resources for Arizona communities to recover from monsoon damage. https://t.co/9Qn8oAjnK2","date":"Mon Sep 13 23:08:45 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act expands high-speed broadband access in Flagstaff and communities across Arizona. Thank you, @MayorDeasy, for your support. https://t.co/VSap9isXjf","date":"Mon Sep 13 22:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"27 years after the Violence Against Women Act became law, we’re calling on Congress to renew this landmark law. We must guarantee that survivors of domestic violence and sexual assault can access the support they need.","date":"Mon Sep 13 18:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #GrandparentsDay, Arizona!","date":"Sun Sep 12 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Doctor, engineer, and NASA astronaut Mae Jemison made history #OnThisDay in 1992, becoming the first African American woman in space. 🚀","date":"Sun Sep 12 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona’s doctors and nurses are working overtime to beat this pandemic. Thank a #HealthcareHero today.","date":"Sat Sep 11 21:54:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, 20 years after the September 11th terrorist attacks, we remember all those who lost their lives. We will #NeverForget.","date":"Sat Sep 11 14:50:15 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following the Afghanistan withdrawal, it is critical that the VA proactively reach out and support veterans in need and their families – both now and in the weeks and months ahead. https://t.co/3WCkmUuZQD","date":"Fri Sep 10 21:14:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will modernize our Land Ports of Entry, helping keep our border communities - including @SanLuisAZGov - safe, while fueling economic development. Thank you, Mayor Sanchez, for your support. https://t.co/TJ4AcwlDUp","date":"Fri Sep 10 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our nation loses nearly 18 veterans to suicide every single day. #WorldSuicidePreventionDay reminds us of our duty to support the brave men and women at home who have risked everything to protect us overseas.","date":"Fri Sep 10 19:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It’s official -- from better roads and bridges to electric vehicle and solar upgrades, Arizona wins big with our bipartisan Infrastructure Investment and Jobs Act. \nhttps://t.co/4n0TayUSa0","date":"Thu Sep 09 21:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"September 17-26 is Arizona’s Restaurant Week! We’re proud that Congress passed our Restaurant Rescue Plan this year, helping independent AZ restaurants survive the pandemic and keep Arizonans employed.\nhttps://t.co/PG3jsoiapc","date":"Thu Sep 09 16:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We led the Arizona delegation to urge President Biden to issue a Major Disaster Declaration for Arizona following the monsoons in July that severely impacted our state. https://t.co/bxke8jaUiH","date":"Wed Sep 08 21:22:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Terminal Program: Our legislation provides $5 billion in competitive grants for terminal development, ensuring terminals at all types of airports will receive funding and guaranteeing that communities of all sizes benefit.","date":"Wed Sep 08 20:04:18 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Air Traffic Control: The bipartisan plan invests $5 billion in grants for strengthening Air Traffic Control towers and systems -- many of which are decades-old and require upgrades to house new equipment to better keep American travelers safe.","date":"Wed Sep 08 20:04:18 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Funding for Airside and Landside Projects: Our bipartisan bill invests $15 billion in priority projects at every airport in the U.S., including runways and taxiways, safety upgrades, terminal development projects, noise mitigation, and transport services like shuttles and trams.","date":"Wed Sep 08 20:04:17 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona leads the nation in aviation. Our bipartisan Infrastructure Investment and Jobs Act, which passed the Senate 69-30, includes major upgrades to every airport in the state -- creating jobs, improving passenger safety, and boosting tourism. 🧵","date":"Wed Sep 08 20:04:17 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Coronavirus cases are already straining Arizona hospitals. We must do our part to reduce that strain -- including by getting our flu shot. Let’s support our doctors, nurses, and hospitals. 💪 https://t.co/UuDyrM7W43","date":"Wed Sep 08 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will help ensure clean water, clean air, and healthy forests for Arizonans. Thank you, @nature_arizona, for your support. https://t.co/ecBOMlK4jL","date":"Tue Sep 07 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"September is Ovarian Cancer Awareness Month. Register for TEAL’s virtual walk/run/ride to raise awareness and support women with ovarian cancer. https://t.co/3myOkLQ6sy. #KnowOvarian","date":"Tue Sep 07 17:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"L'Shanah Tovah to all Arizonans celebrating Rosh Hashanah!","date":"Tue Sep 07 00:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Labor Day! We're committed to ensuring every Arizona family has a fair shot at the American Dream.","date":"Mon Sep 06 16:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"After the challenges created by the pandemic, a new playground in Tempe will be a “hyper-clean space for sick children battling cancer, and others with delicate immune systems.”\nhttps://t.co/nJ4cP0LMQ8","date":"Sun Sep 05 23:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Nearly 20 years after the devastating September 11th terrorist attacks -- on National Service and Remembrance Day -- honor America’s first responders with acts of service across Arizona. https://t.co/uYYkg6rIio","date":"Sun Sep 05 20:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@santacruzaz’s Board of Supervisors supports our bipartisan Infrastructure Investment and Jobs Act because they know our bill will create new jobs, fund major transportation projects, and expand economic opportunities. https://t.co/ONpZGEci6m","date":"Sat Sep 04 23:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #NationalWildlifeDay, Arizona! Our state is home to some of the most diverse -- and coolest -- wildlife in the country.","date":"Sat Sep 04 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona hospitals are experiencing staff shortages and urging all Arizonans to get vaccinated. Let's do our part.\nhttps://t.co/Inv63Q1Xuq","date":"Fri Sep 03 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced a bill to ensure veterans, servicemembers, and gold star families receive free annual national park passes. https://t.co/53BuE6xyaa","date":"Thu Sep 02 20:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1945, World War II ended with Japan’s surrender. 76 years later, we’re grateful to all Americans who fought to protect our freedoms.","date":"Thu Sep 02 19:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thank you, @AZNationalGuard, for 156 years of dedicated service to safety and security. Happy Birthday!","date":"Thu Sep 02 14:59:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As the Delta variant surges, Arizona’s health and economic recovery depend on everyone doing our part and getting vaccinated.\nhttps://t.co/QCBU5DnBcA","date":"Wed Sep 01 23:30:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"September is #SuicidePreventionMonth — if you or a loved one needs help, call 1-800-273-8255 or visit https://t.co/OwBilfByAf.","date":"Wed Sep 01 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wishing a quick and full recovery to those injured in the Chandler explosion. \nhttps://t.co/gaL3WIPVw3","date":"Tue Aug 31 23:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thank you, Mayor Cano, for supporting our bipartisan Infrastructure Investment and Jobs Act. Our historic legislation will fund infrastructure needs across Arizona, including projects like the Winslow Levee project. https://t.co/jEte8pg8GN","date":"Tue Aug 31 17:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill to create a 5-year pilot program on service dog training therapy for veterans at the VA is now law. https://t.co/OEtW1GLErt","date":"Mon Aug 30 20:19:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Cochise County will directly benefit from our bipartisan Infrastructure Investment and Jobs Act. Glad to sit down with county leaders to talk about how our bill will help Arizona’s everyday families. https://t.co/QapmEUnBiW https://t.co/7Jm6JFXq2Z","date":"Mon Aug 30 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@usbr declared a water shortage on the Colorado River for the first time in our state’s history. Our bipartisan Infrastructure Investment and Jobs Act that recently passed the Senate will direct $300 million for water reclamation. \nhttps://t.co/gH44xEQbXr","date":"Sun Aug 29 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Infrastructure Investment and Jobs Act will help secure a reliable supply of clean water and help prevent wildfires in communities like Payson. Thank you, Mayor Morrissey, for your support! https://t.co/6LWKSeKhIY","date":"Sun Aug 29 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act paves the way for critical infrastructure upgrades in Pinal County. Glad to sit down with local leaders to talk about the details of the bill. https://t.co/jmCwwsNWwN https://t.co/nW5nGl1sW2","date":"Sat Aug 28 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"58 years ago today, Dr. Martin Luther King, Jr. delivered his iconic “I Have a Dream” speech at the March on Washington. We’re honoring his legacy by working to advance our nation’s shared values of freedom, justice, and equal treatment under the law for all Americans.","date":"Sat Aug 28 16:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We hosted a roundtable @TucsonAirport to discuss how Tucson and all of Arizona will benefit from our Infrastructure Investment and Jobs Act.\nhttps://t.co/1YS9magcje https://t.co/UgnRoNd5Iv","date":"Fri Aug 27 22:42:11 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will fund critical projects in cities and towns across Arizona. Thank you, @AZCities, for your support. https://t.co/SXBvpLcNC1","date":"Fri Aug 27 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"https://t.co/zpXSytHWZZ","date":"Thu Aug 26 21:40:37 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce @PHXSkyHarbor will receive $138 Million in covid-relief funds to provide a safer flying experience. https://t.co/mbhNvs2JpU","date":"Thu Aug 26 16:52:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Senator John McCain taught us to always assume the best in others, to seek compromise instead of sowing division, and to put country ahead of party. Three years after his passing, I am still inspired by his legacy, leadership, and service to our nation.","date":"Wed Aug 25 22:40:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act will modernize our Land Ports of Entry -- boosting our economy, and helping secure the border. Glad to visit the San Luis Port of Entry to thank @CBP for keeping us safe and secure. https://t.co/wtmT4AT4pv https://t.co/Vvja71nzCX","date":"Wed Aug 25 20:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On August 25, 1916, President Woodrow Wilson signed a law creating the @NatlParkService. We’ll keep working to protect Arizona’s public lands, strengthening our outdoor recreation industry.","date":"Wed Aug 25 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We met with local leaders in Yuma to talk about the impact our bipartisan Infrastructure Investment and Jobs Act would have in Yuma and across our state. https://t.co/6Gty3HbIAu https://t.co/R513AN6YnB","date":"Wed Aug 25 15:00:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona communities have been hit hard by recent monsoons and severe flooding. We’re not out of the woods yet. Review this guide from @ASU to keep yourself and loved ones safe during extreme weather.\nhttps://t.co/uDtCp8oLVd","date":"Wed Aug 25 00:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Americans returning home from serving our nation must always have somewhere to turn for support with mental health challenges. We’re proud to have worked with @SenThomTillis to pass the PAWS Act, giving veterans with PTSD access to service dogs.\nhttps://t.co/SU4p8P0ZiE","date":"Tue Aug 24 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great to meet with @sallycmorton and welcome her to the @ASU family. Dr. Morton is the first woman to serve as ASU’s Executive Vice President of Knowledge Enterprise. Congratulations! #ForksUp https://t.co/eHbbNy1BBL","date":"Mon Aug 23 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Wow! Two Valley high school students -- Bridget and Bella -- launched a YouTube series aimed at sharing and preserving the stories of retired servicemembers.\nhttps://t.co/BX9uxy1EQ7","date":"Mon Aug 23 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1978, @PrescottVly was founded.","date":"Sun Aug 22 22:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thank you, @FlgChamber, for supporting our Infrastructure Investment and Jobs Act. From repairing roads and bridges, to securing clean water access, to expanding high-speed broadband, and more, our bill will support local communities and grow AZ’s economy. https://t.co/f6Lc0rzvrC","date":"Sun Aug 22 20:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Former Navajo Nation President Kelsey Begaye, a Vietnam veteran and devoted leader, leaves behind a legacy of service and strength.\nhttps://t.co/eV8oc9I9QI","date":"Sun Aug 22 16:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Senior Citizens Day, Arizona! We’ll always safeguard the retirement benefits Arizona seniors have earned over a lifetime of hard work.","date":"Sat Aug 21 23:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Together We Served - virtually connect with veterans with whom you served: https://t.co/k8od2T2Dmb","date":"Sat Aug 21 19:01:33 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"VA Caregiver Support Line - call 1-855-260-3274 (Monday-Friday 8am-10pm and Saturday 8am-5pm ET)","date":"Sat Aug 21 19:01:33 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"VA Women Veterans Call Center - call or text 1-855-829-6636 (Monday-Friday 8am-10pm and Saturday 8am-6:30pm ET)","date":"Sat Aug 21 19:01:32 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"VA Mental Health Services Guide - sign up for and access mental health services here: https://t.co/7IfjWJYZ1Q","date":"Sat Aug 21 19:01:31 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"VA Mobile Apps - download these tools to monitor and understand your mental health symptoms: https://t.co/r3FYeUYSVZ","date":"Sat Aug 21 19:01:31 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Vet Centers - you can discuss how you feel with other veterans in community-based counseling centers. Call 1-877-927-8387 or visit: https://t.co/gP1ZVYdH1I","date":"Sat Aug 21 19:01:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Veterans Crisis Line - call 1-800-273-8255 if you are having thoughts of suicide. You can also find your local VA medical center, which you can access 24/7, here: https://t.co/gP1ZVYdH1I","date":"Sat Aug 21 19:01:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Many American veterans may be experiencing stress in response to the recent events in Afghanistan. You are not alone. @DeptVetAffairs has resources for those in need.","date":"Sat Aug 21 19:01:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Amazing news - Arizona leads the nation in small business job growth. While we have more work to do, this is what strong economic recovery looks like. 💪\nhttps://t.co/CKRbta1vEt","date":"Sat Aug 21 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thanks to our Infrastructure Investment and Jobs Act, cities and towns across Arizona will receive crucial resources for overdue infrastructure projects -- such as expanding broadband and wildfire prevention &amp; recovery. Thank you, Superior @Mayor_Mila, for your support! https://t.co/mSL2WyNAwT","date":"Fri Aug 20 19:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following our request, the administration will extend the pause on federal student loan payments until January 2022. https://t.co/5SOC5t2dLv","date":"Fri Aug 20 17:33:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy 246th Birthday to my hometown, @cityoftucson! 🌵","date":"Fri Aug 20 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act makes critical upgrades to roads, bridges, and so much more. We’re helping fuel Arizona jobs and economic opportunities.","date":"Thu Aug 19 21:16:18 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"August is #NationalBackToSchoolMonth. You can help ensure the safety of Arizona’s students, teachers, and families by getting vaccinated. #VaccinateState48","date":"Thu Aug 19 19:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement following administration briefing on Afghanistan: https://t.co/578lxIEwo6","date":"Wed Aug 18 22:24:32 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans, the second payments from the newly expanded Child Tax Credit are beginning to arrive. If you’re having issues accessing your payment, check its status here:\nhttps://t.co/iqoSCAi7km","date":"Wed Aug 18 19:16:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act is the strongest investment in critical infrastructure in a generation -- and includes funding for wildfire prevention and recovery for communities like @city_globe. Thank you, Mayor Gameros, for your support. https://t.co/R1QKsvIL7M","date":"Tue Aug 17 19:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, communities across the country mark  #NationalNonprofitDay! It’s a great day to support amazing Arizona-based nonprofit organizations. 👇https://t.co/S2WN4UIZRZ","date":"Tue Aug 17 14:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Statement on events in Afghanistan: https://t.co/4ki6pNSkBt","date":"Mon Aug 16 20:52:29 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona is home to some of America’s best National Parks. In honor of 105 years of operation, @NatlParkService will hold a #feefree day on Wednesday, August 25. Plan your trip now: https://t.co/fNLY6KE8N0","date":"Mon Aug 16 15:44:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans - employers in the Valley are hiring for hundreds of positions. Check out the in-person Greater Phoenix Job Fair on Tuesday, August 17 at 10:00 a.m. More details: https://t.co/DZgVjbVdAY","date":"Sun Aug 15 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thankful that the administration listened to our request and extended the pause on federal student loans repayments. This pause will help Arizona’s economic recovery from the coronavirus pandemic.\nhttps://t.co/eQxYUZR9x0","date":"Sun Aug 15 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"76 years ago, World War II ended with victory in Japan. As we remember #VJDay, we honor and thank all who bravely served.","date":"Sat Aug 14 21:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In 1942, the Navajo Code Talkers created an unbreakable code that would help America win World War II. On #NavajoCodeTalkersDay, we remember and honor those brave servicemembers.","date":"Sat Aug 14 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1935, President Franklin D. Roosevelt signed the Social Security Act into law. We’re committed, as always, to protecting Social Security and safeguarding the retirement benefits Arizona seniors have earned.","date":"Sat Aug 14 16:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our historic legislation will create good-paying jobs and expand economic opportunities in communities across Arizona and the U.S. \n\nThank you for your strong support, @USChamber.","date":"Fri Aug 13 19:08:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment and Jobs Act is the strongest investment in critical infrastructure in a generation. As AZ’s County Supervisors know, our plan will strengthen AZ's economic competitiveness and improve public safety. Thank you, @csaofaz for your support! https://t.co/PtaBkEHCjp","date":"Fri Aug 13 17:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"With above-normal rainfall in Arizona last month -- the most since measurements began in 1990 -- follow these tips to stay dry and safe in August:\nhttps://t.co/FfiegkVJ6p.","date":"Thu Aug 12 22:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud of Tucson schools providing free mental health resources for students.\nhttps://t.co/a3bch2XGxN","date":"Thu Aug 12 19:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The American Red Cross is experiencing a severe shortage of blood and platelet donations in Arizona. If you’re able, consider donating at one of these AZ blood drives:\nhttps://t.co/Kft4z8B4ZJ","date":"Thu Aug 12 16:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Sister Jose Womens’ Shelter helps women experiencing homelessness and abuse get back on their feet. When the shelter needed help during coronavirus restrictions, the Tucson community came together and delivered.\nhttps://t.co/P1LvGEle9I","date":"Wed Aug 11 21:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"August is Children’s Eye Health and Safety Month. As schools reopen in Arizona and across the country, remember to schedule a comprehensive eye exam for your kids!","date":"Wed Aug 11 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Upgrades to our electrical and power grid to help prevent outages. https://t.co/T4fNQ0e5pG","date":"Tue Aug 10 16:13:12 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Western water infrastructure to secure Arizona’s water future. https://t.co/bV351QU904","date":"Tue Aug 10 16:13:11 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Upgrades for ALL of Arizona airports. Reducing travel times, and creating a safer flying experience. https://t.co/dc4pKm1x3j","date":"Tue Aug 10 16:13:10 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Improvements to passenger and freight rail, giving Arizonans more transportation options and helping our employers transport goods. https://t.co/xbxsfG3RpS","date":"Tue Aug 10 16:13:08 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Expanding high-speed broadband across our state. Connecting our communities with each other and the world. https://t.co/Y0gWASkbDa","date":"Tue Aug 10 16:13:07 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Upgrades to roads and bridges, reducing traffic and improving safety. https://t.co/aWHlAyjHcG","date":"Tue Aug 10 16:13:06 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate just passed our bipartisan Infrastructure Investment and Jobs Act! It’s the largest investment in our nation’s critical infrastructure in a generation. Here’s what it means for everyday Arizonans. 🧵 https://t.co/l4cBCkMTO8","date":"Tue Aug 10 16:13:05 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Over the past few months, we’ve co-led negotiations with a bipartisan group of senators and President Biden to write the Infrastructure Investment and Jobs Act. The Senate just passed this historic package.\n\nSee how it will benefit Arizona. 👇 https://t.co/XdWkTuvxOf","date":"Tue Aug 10 15:59:46 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"LIVE: The Senate is preparing to pass our Infrastructure Investment and Jobs Act. It's the largest investment in our nation's infrastructure in a generation. https://t.co/ugYuaDGzZp","date":"Mon Aug 09 20:41:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Navajo Nation lost a hero last week. Thomas Lynch, Jr. -- a World War II veteran, prisoner of war, and native Arizonan -- passed away at the age of 98. We’re grateful for his incredible service to our country.\nhttps://t.co/GilQS68OQx","date":"Mon Aug 09 19:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We must continue investing in tribal water systems to guarantee access to safe, clean running water for Native American communities.\nhttps://t.co/jtwEoSuvIi","date":"Mon Aug 09 16:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@scottsdaleazgov, @GilbertYourTown, @cityofchandler, and @PeoriaAZ were ranked among the 20 best cities in the nation for renters. \nhttps://t.co/xRBDjH8hFb","date":"Sun Aug 08 18:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Strong education starts with strong educators. Excited to see @ASU make teacher-prep programs more accessible and affordable.\nhttps://t.co/8Q7RCa19RC","date":"Sun Aug 08 16:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're working to pass our bipartisan Infrastructure Investment and Jobs Act in the coming days. It's the biggest investment in our nation's infrastructure in a generation.\n\nHere's what it means for Arizona 👇 https://t.co/48WZ1RPbrQ","date":"Sat Aug 07 21:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"1 in 7 Arizonans live in areas without the infrastructure for minimally acceptable broadband speeds. Our infrastructure framework would close the digital divide in rural and Tribal communities across Arizona. https://t.co/0TVaFRQYNb","date":"Sat Aug 07 18:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #NationalPurpleHeartDay, we honor the brave servicemembers who made the ultimate sacrifice to protect our freedoms. 💜","date":"Sat Aug 07 17:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On August 6, 1965, President Lyndon Johnson signed the Voting Rights Act into law. The right to vote is critical to the health and vitality of our democracy. We’re proudly cosponsoring the John Lewis Voting Rights Act to ensure Americans’ right to vote remains protected.","date":"Fri Aug 06 20:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to join @TheView for my friend (and fellow tough-as-nails Arizonan), @MeghanMcCain’s final show - to discuss friendship, how her father inspires me, and why Arizona is the best state (sorry, not sorry). Congratulations, Meghan - wishing you the very best.","date":"Fri Aug 06 16:55:20 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@asuprepdigital is partnering with @azedschools to help improve math outcomes in Arizona middle schools. Learn more:\nhttps://t.co/QLE0NY4WES","date":"Fri Aug 06 15:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Too often, parents of children with serious illnesses cannot get needed at-home care. We’re proud that #State48 is leading the way in helping parents become paid certified nursing assistants for their children.\nhttps://t.co/8afCsgYmRq","date":"Thu Aug 05 19:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan bill ensures Arizona workers know their future Social Security benefits. https://t.co/rN1kQeF9HK","date":"Thu Aug 05 16:18:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Fellow #ToughCookie and friend @CynthiaMLummis sent a sweet treat to our office — just can’t tell if our team liked it! 🍪 https://t.co/jz6RTi2v65","date":"Wed Aug 04 20:38:13 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"I was honored to be present for @SenMarkKelly’s first speech on the Senate floor today. I’m proud to call Mark a friend and colleague — and work alongside him to deliver lasting results for everyday Arizonans.","date":"Wed Aug 04 17:39:21 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad that the administration listened to our request to maintain the current classification for metro areas, protecting access to critical federal services and programs for communities across Arizona.\nhttps://t.co/HoYlksgogJ","date":"Wed Aug 04 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1790, the United States Coast Guard was founded. We’re grateful for 231 years of security on our shores.","date":"Wed Aug 04 14:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to partner with @senrobportman, @MarkWarner, @SenatorCollins, @SenatorShaheen, @lisamurkowski, @Sen_JoeManchin, @SenBillCassidy, @SenatorRomney, @SenatorTester, and colleagues in both parties on our bipartisan Infrastructure Investment and Jobs Act. https://t.co/OfraBWzSFP","date":"Tue Aug 03 21:04:26 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"As communities in Arizona continue to experience flash floods, follow these tips to stay safe:\nhttps://t.co/35ee63Z6MW","date":"Tue Aug 03 17:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to introduce the bipartisan Infrastructure Investment and Jobs Act. Bipartisan compromise takes time and hard work but the product is a lasting result that strengthens our country. https://t.co/srVm4hwxYR","date":"Mon Aug 02 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@SecRaimondo is right -- our infrastructure framework “represents a once-in-a-lifetime opportunity to... bring affordable, high-speed broadband to every community, allowing millions of Americans to better prosper in our modern economy.”\nhttps://t.co/0TVaFS8AbL","date":"Mon Aug 02 18:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to secure over $7 million for the Havasu airport with @SenMarkKelly. Here’s what it means for AZ:\n✅ Safe, functional runways\n✅ Efficient taxiway system\n✅ Job growth\n✅ AZ leadership in aviation \nhttps://t.co/8Z89s04sBK","date":"Mon Aug 02 16:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"100 years ago today, Harriet Quimby made history as the first American woman to earn a pilot’s license. On this milestone anniversary, we celebrate Harriet and all the women in aviation who followed in her footsteps. ✈️","date":"Sun Aug 01 18:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #NationalMountainClimbingDay, Arizona! ⛰","date":"Sun Aug 01 16:06:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re so proud of the amazing Arizona athletes representing #State48 and the U.S. at the 2021 Tokyo Olympics. Get to know them here:\nhttps://t.co/l7idCj1QfN","date":"Sat Jul 31 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re honored to have earned the support of 369 mayors from all 50 states and both political parties for our bipartisan infrastructure plan. \nhttps://t.co/EhNpSioEKL","date":"Sat Jul 31 16:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is National Whistleblower Appreciation Day, marking the passage of America’s first whistleblower protection law in 1778. We’ll continue to protect brave whistleblowers speaking out and confronting waste, fraud, and abuse.","date":"Fri Jul 30 18:14:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Justice O’Connor and Justice Ginsburg paved the way for so many women in law and life. Our bill will place statues of them in the U.S. Capitol, honoring their legacy and reminding women they can achieve their dreams. https://t.co/eAFXMpcHV0","date":"Fri Jul 30 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On July 30, 1965, President Lyndon B. Johnson signed Medicare and Medicaid into law, expanding health care access to millions of American seniors, veterans, and everyday families. We’ll continue safeguarding these critical programs for Arizonans.","date":"Fri Jul 30 15:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're continuing the work started by Senator John McCain to revitalize the Rio Reimagined Project, which will improve water systems, boost economic growth, and reconnect communities. Thank you, @cindymccain, for your support. https://t.co/XSaFvAjlrp","date":"Thu Jul 29 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay 63 years ago, @NASA was established by Congress. Today, we’re grateful for the leaps made in space exploration every year since.","date":"Thu Jul 29 16:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"From Monsoons to triple digit temperatures, follow these tips from @CityofPhoenixAZ to keep yourself and loved ones safe.\nhttps://t.co/tXHlUbnKuo","date":"Thu Jul 29 15:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan Infrastructure Investment &amp; Jobs Act is the strongest investment in America’s critical infrastructure in a generation. It will create Arizona jobs, support our state’s employers and communities, and help everyday families get ahead. https://t.co/YQJXurzMQt","date":"Thu Jul 29 01:29:35 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re supporting legislation to help Arizonans with diabetes manage their condition and prevent complications and hospitalization. https://t.co/CS4owDOwnh","date":"Wed Jul 28 14:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@usmayors know what our bipartisan infrastructure plan will mean for communities in Arizona and across the country. Upgrading roads, bridges, rail, water systems, power grids, and ports will grow our economy and create good-paying jobs. https://t.co/XASBJ6NIoM","date":"Tue Jul 27 18:05:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce that Salt River was awarded over $610,000 in federal grant resources to expand transit options, including low and no-emission busses. https://t.co/WqYpLmHGcm","date":"Tue Jul 27 15:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re glad to announce $2.2 million in federal funds to strengthen Prescott’s drinking water and wastewater infrastructure. https://t.co/kmuy8MqJvR","date":"Mon Jul 26 22:04:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Amazing news - Arizona has recovered the number of jobs lost during the pandemic. We’ll continue working to fuel Arizona’s economic recovery. #State48 is in this together.\nhttps://t.co/dXbwuEAQEZ","date":"Mon Jul 26 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure framework will expand jobs and business opportunities for everyday Arizonans. Thank you, @BuildTogether_ for your support. https://t.co/xTufBB0DbZ","date":"Sun Jul 25 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona schools, businesses, and restaurants are hiring! Here’s where to look for job openings:\nhttps://t.co/tayl7HCfrs","date":"Sun Jul 25 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Parents’ Day, Arizona!","date":"Sun Jul 25 16:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re excited to see this investment in @MaranaSchools and educators, paving the way for Arizona’s future STEM leaders.\nhttps://t.co/06Eikzbtr2","date":"Sat Jul 24 21:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@AHLA supports our bipartisan infrastructure proposal, recognizing the positive impact this historic investment would have on America's tourism industry and other critical sectors of our economy. https://t.co/SkRzKM8Bi2","date":"Sat Jul 24 17:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“A new power and endurance device from ASU is giving U.S. Air Force aerial porters enhanced levels of safety and strength on the job.” Read more from @ASU:\nhttps://t.co/W1mhNDmu4P","date":"Sat Jul 24 15:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed two of our bills. One ensures veteran family members receive survivor benefits. The other increases VA disability compensation rates. https://t.co/WcA7AWYdDi","date":"Fri Jul 23 21:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re continuing the important work started by Senator John McCain to revitalize the river corridor through the Rio Reimagined Project, which will improve water systems, boost economic growth, and reconnect communities. https://t.co/l2X3AoHazM","date":"Fri Jul 23 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan framework paves the way for the strongest investment in America’s infrastructure in a generation. It will create jobs and boost economic opportunity for Arizonans and all Americans. Thank you, @USChamber, for your support. https://t.co/p7kivZ0Pjg","date":"Fri Jul 23 17:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re cosponsoring a bipartisan bill to permanently cover telehealth services under Medicare for AZ seniors. https://t.co/BuQp9d0SPH","date":"Thu Jul 22 20:39:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona is experiencing the most destructive year for wildfires in a decade. Protect yourselves and your loved ones by following these guidelines:\nhttps://t.co/I4DcLxydrQ","date":"Thu Jul 22 15:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #BumpDay, we’re committed to accessible care for every mom, everywhere. We’re proud to advance legislation that expands postpartum care for mothers, ensuring continued support for women and children.","date":"Wed Jul 21 21:08:54 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Joint statement from 22 Senators: https://t.co/8xAVPHpcL1","date":"Wed Jul 21 20:06:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"@SenatorBurr\n@SenBillCassidy\n @SenatorCollins\n @ChrisCoons\n@SenatorDurbin\n @GrahamBlog\n @SenatorHassan\n @SenatorHick\n @CaptMarkKelly\n @SenAngusKing","date":"Wed Jul 21 20:06:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"@Sen_JoeManchin\n@lisamurkowski\n @senrobportman\n @SenatorRomney\n@SenJackyRosen\n @SenatorRounds\n @SenatorShaheen\n @SenatorTester\n @SenThomTillis\n @MarkWarner\n @SenToddYoung","date":"Wed Jul 21 20:06:30 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On Glioblastoma Awareness Day, we honor the Americans we have lost to this tragic illness - including one of my heroes, Arizona Senator John McCain. We pledge to continue advancing treatments for GBM and all brain cancers.","date":"Wed Jul 21 15:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to announce Yuma will receive nearly $5 million to build a water treatment and distribution system. https://t.co/yRGzRctv99","date":"Tue Jul 20 22:59:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy 53rd Birthday, @SpecialOlympics! Thank you for providing opportunities to millions of individuals with disabilities for so many years.","date":"Tue Jul 20 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1969, Neil Armstrong became the first person to walk on the Moon. https://t.co/JPPi8Py1nJ","date":"Tue Jul 20 15:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud the Senate came together in a bipartisan way to pass our bill with @SenMarkKelly to increase economic opportunities for Arizona farmers and ranchers while helping create clearer air and a cleaner environment. https://t.co/TX6VxdzoCy","date":"Tue Jul 20 14:12:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In the event of an excessive heat warning, you can visit a @SalvationArmyUS heat relief station near you:\nhttps://t.co/DVSCNHoEt7","date":"Mon Jul 19 21:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Heartbroken for those who lost their lives, the brave first responders, and everyone affected by yesterday’s horrific violence in Tucson. We’re hoping for a quick and full recovery for those injured.","date":"Mon Jul 19 18:45:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1848, the Seneca Falls Convention lit the flame of the women’s suffrage movement.","date":"Mon Jul 19 14:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re glad to announce over $7 million in federal infrastructure investment for Lake Havasu City Municipal Airport. https://t.co/BAl3R0JJMk","date":"Sun Jul 18 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Scottsdale, Tucson, and Glendale were named among the best cities in the nation for parks and recreation. Happy National Parks and Recreation Month, #State48!\nhttps://t.co/aQ1w7kvBDZ","date":"Sun Jul 18 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy National Ice Cream Day, Arizona! Beat the AZ summer heat and enjoy a scoop (or two) of your favorite flavor 🍦☀️","date":"Sun Jul 18 15:07:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure deal will upgrade roads and bridges, improve transit options, and expand electric vehicle options for Arizonans.\nhttps://t.co/5A5I4WkJ2N","date":"Sat Jul 17 22:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Extending the current pause on federal student loan payments will provide relief to Arizonans and help fuel our continued recovery from the coronavirus. \nhttps://t.co/12roJ5G4PO","date":"Sat Jul 17 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy 143rd Birthday, Mesa!","date":"Sat Jul 17 17:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great news - @USDA is investing $7.2 million in improvements to water treatment and distribution systems in Arizona’s rural communities. \nhttps://t.co/nI5A8TLGB5","date":"Fri Jul 16 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona, child tax credit payments have begun. Here’s what you need to know:\nhttps://t.co/lOsdel6McL","date":"Fri Jul 16 17:46:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#Apollo11 launched 52 years ago today, demonstrating to the world that the United States leads in space -- and Arizona played a critical role in that effort. We’ll continue working to fuel Arizona’s space research and exploration.","date":"Fri Jul 16 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Billions of dollars to modernize land ports of entry, which will help keep Arizonans safe and secure and improve travel and trade across the border. https://t.co/oMQBOUlMdQ","date":"Thu Jul 15 20:20:44 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Billions of dollars to improve ports and waterways – which serve as vital links for American employers selling U.S. products abroad, boosting jobs and national security. https://t.co/f4bvsGIbZ2","date":"Thu Jul 15 20:20:43 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$73 billion to upgrade America’s power infrastructure and strengthen the resiliency of the power grid that Arizona’s communities rely on. https://t.co/wea6HiGtHU","date":"Thu Jul 15 20:20:42 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tens of billions of dollars in expanding and strengthening America’s passenger and freight rail systems that boost Arizona tourism and move Arizona’s manufacturers’ products to markets. https://t.co/zpQnxIpEJX","date":"Thu Jul 15 20:20:41 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$25 billion to upgrade and strengthen America’s airports – including Arizona’s nearly 200 airports – to support job-creators that rely on air transportation and ensure the U.S. remains the world leader in air safety, travel, and innovation. https://t.co/CHYH0zaVzO","date":"Thu Jul 15 20:20:40 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"More than $8 billion to strengthen infrastructure in AZ and western states facing drought and wildfire – including more than $3 billion to repair aging infrastructure, $2 billion in water storage and recycling, and full funding for Drought Contingency Plan projects at Lake Mead. https://t.co/QDrxOr7rYn","date":"Thu Jul 15 20:20:40 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$65 billion to expand high-speed broadband to all Americans, make broadband more affordable, and close the digital divide for rural and Tribal communities. https://t.co/bZh4GZSjyq","date":"Thu Jul 15 20:20:38 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"$110 billion in additional spending to repair and upgrade America’s roadways and bridges – and fuel new major transportation projects. https://t.co/Rp8kcrKSBW","date":"Thu Jul 15 20:20:37 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The biggest federal investment in public transit in history, clearing America’s backlog of public transit repairs, and expanding Arizona’s urban and rural transit options to reduce commute times. https://t.co/SxsGAsRgIs","date":"Thu Jul 15 20:20:37 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure plan paves the way for the largest investment in Arizona’s critical infrastructure in a generation, creating jobs and boosting economic opportunities. 🧵","date":"Thu Jul 15 20:20:36 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re proud to have earned the @BizRoundtable’s support of our bipartisan bill to improve the federal permitting process, fueling jobs and expanding economic opportunities for Arizona communities.","date":"Thu Jul 15 20:16:06 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to announce $18.5 million in federal infrastructure funding for @TucsonAirport. https://t.co/ptDoc6OTOp","date":"Thu Jul 15 17:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tina Sweeney just made history by becoming Phoenix’s first female Postmaster. Congratulations!\nhttps://t.co/BPEE2mfiqj","date":"Wed Jul 14 19:15:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"In the recent COVID relief law, we helped secure monthly child tax credit payments for Arizona’s everyday families. Payments start this week. For more info, visit: https://t.co/XhC9Q7H1nN.","date":"Wed Jul 14 16:45:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Statement on Jeff Flake’s Nomination as U.S. Ambassador to Turkey: https://t.co/JWmvthN9Te","date":"Tue Jul 13 21:05:21 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonenses pueden encontrar lugares de pruebas del coronavirus gratis en el condado de Maricopa aquí:\nhttps://t.co/YjGbnnQAhw","date":"Tue Jul 13 20:32:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured the San Ysidro port of entry last week. As chair of the Border Management Subcommittee, I’m committed to investing in technology to secure our border while ensuring all migrants are treated fairly and humanely.\nhttps://t.co/yJDPH0nHzk","date":"Tue Jul 13 18:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thrilled to see Arizona receive $40.2 million from @Interior through the PILT program. These resources will support AZ first responders, health care workers, and local communities. https://t.co/5W11hrwpoz","date":"Mon Jul 12 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"El Distrito de Servicios de Salud Pública del condado de Yuma ofrecerá vacunaciones gratis para los niños mayores de 12 años para el regreso escolar.\nhttps://t.co/riInqAIn9I","date":"Mon Jul 12 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Devastated to learn two brave Arizona firefighters lost their lives in the line of duty yesterday. Our hearts go out to their families and loved ones. https://t.co/L5jsaNlXOT","date":"Sun Jul 11 22:55:23 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Excited to see the Navajo Nation reopening to visitors!\nhttps://t.co/VQbnfkrWo2","date":"Sun Jul 11 22:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"“Amidst promises of repaired bridges, lead-free pipes, and expanded broadband is a $73 billion investment into a larger, stronger power grid... withstanding extreme weather events.” ⬇️\nhttps://t.co/NYZGn54Uoi","date":"Sun Jul 11 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: if you haven’t received your COVID vaccine, visit https://t.co/Y8YVLEdhZX to find a vaccination site near you.","date":"Sat Jul 10 23:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Downwinders Parity Act supports Arizonans experiencing sickness from radiation exposure in Mohave County. We’re working to extend compensation for radiation exposure sickness caused by nuclear testing. https://t.co/8eTxlKjan3","date":"Sat Jul 10 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Bipartisan Border Solutions Act with @JohnCornyn will help address the migrant crisis by creating regional processing centers to more quickly process migrants while ensuring they are treated fairly and humanely. https://t.co/dJGLpByIbF","date":"Sat Jul 10 16:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Have questions about your passport? Check out this helpful resource 👇 https://t.co/qiRdR9btYS","date":"Fri Jul 09 21:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"July is Disability Pride Month. We’re grateful for the contributions of Arizonans with disabilities to our state and country.","date":"Fri Jul 09 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure proposal would reduce AZ wildfire risks, expanding fire prevention and cleanup. \nhttps://t.co/U6keDth4mO","date":"Fri Jul 09 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill helps ensure quick completion of airport construction, saving taxpayer dollars. Proud to work with @SenTedCruz and @SenToddYoung on this bipartisan legislation. https://t.co/HA3KRg1fQA","date":"Thu Jul 08 20:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Restrictions on non-essential travel are hurting small businesses and communities along the Arizona border. @DHSgov must provide a plan for recovery. https://t.co/lMWwrJaaxv","date":"Thu Jul 08 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: need help accessing monthly Advance Child Tax Credit payments? Check out these free events in July. https://t.co/wLHBeTEmHv","date":"Wed Jul 07 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured the San Ysidro Port of Entry with @RepJuanVargas and @RepScottPeters to see firsthand the challenges facing @CBP and nonprofits at the border. https://t.co/oECLYhWrO2 https://t.co/hVLhnPDtIr","date":"Wed Jul 07 18:25:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay in 1981, Sandra Day O’Connor became the first woman nominated to the U.S. Supreme Court. https://t.co/DX6Ze9mlQw","date":"Wed Jul 07 15:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Great news - kids under 18 are eligible for weekly meal bundles from @ScottsdaleUSD Nutrition Services this summer. More info: https://t.co/y49V56eI5g","date":"Wed Jul 07 00:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're calling on the administration to extend the pause on student loan payments to help support Arizona families as we continue our coronavirus recovery. https://t.co/kxjDCflhev","date":"Tue Jul 06 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Todos los miércoles de 10am a 1pm, los arizonenses en el condado de Coconino pueden ser vacunados contra el coronavirus. Si necesita transportación, envíe un texto con la palabra “vacuna” al 822-862. \nhttps://t.co/PSglrg5amg","date":"Tue Jul 06 18:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The National Academy of Sciences (@theNASciences) elected two Arizonans as members - @Uarizona’s Lynn Nadel and @ASU’s Linda T. Elkins-Tanton - for their advances in scientific research. \nhttps://t.co/u4MWbfE1MV","date":"Mon Jul 05 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Here’s what our bipartisan infrastructure deal means for Arizonans: \n✅  Upgrades to roads and bridges\n✅  Rural broadband access\n✅  Investments in renewable energy\n✅  Water storage improvements\n✅  Expanded transit options\nhttps://t.co/ZYKkRGgb7B","date":"Mon Jul 05 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Independence Day, Arizona! We’re proud to honor the bravery, sacrifice, and service of all our veterans and servicemembers. https://t.co/I6SRTcsNQm","date":"Sun Jul 04 17:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona firefighters serve on the front lines every day keeping our communities safe. I’m proud to team up with @SenAlexPadilla, @SenFeinstein, and @SteveDaines to increase pay for firefighters. https://t.co/P30wHkCPTe","date":"Sat Jul 03 23:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@Uarizona’s new School of Mining and Mineral Resources will ensure Arizona leads the way in energy production.\nhttps://t.co/r4cZ57w9Ka","date":"Sat Jul 03 19:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Grateful for the Arizona Game and Fish Department (@azgfd) crews protecting Arizona's wildlife. \nhttps://t.co/L06dCX19Dk","date":"Fri Jul 02 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona - Independence Day is just around the corner! Here’s where to find the best fireworks and other fun activities near you: https://t.co/A6vn4NfIil","date":"Fri Jul 02 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"#OnThisDay 57 years ago, The Civil Rights Act became law. We pledge to continue working to advance our nation’s core values: freedom, justice, and equal treatment under the law.","date":"Fri Jul 02 16:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"55 years ago today, Medicare benefits first became available in Arizona and across America. On this milestone anniversary, we’re working to secure and strengthen Medicare benefits now and for generations to come.","date":"Thu Jul 01 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On National Postal Worker Day, we’re committed to improving the efficiency, transparency, and stability of the Postal Service that Arizonans rely on. https://t.co/8I3mYyTGPb","date":"Thu Jul 01 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congrats @Suns, our Western Conference Champs! Now, let's win it all! #RallytheValley","date":"Thu Jul 01 13:02:07 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to see Yavapai Community College receive $801,218 as a result of our Open Textbooks Pilot program to reduce costs for AZ students. https://t.co/mLrgBsEDBF","date":"Wed Jun 30 18:51:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team toured The WD Recovery &amp; Wellness Center, an outpatient program helping Arizonans struggling with addiction and mental health issues. We’re proud to support WD’s mission of helping our communities. https://t.co/iFvDbkdgNu","date":"Wed Jun 30 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Eight years ago, Arizona lost the Granite Mountain Hotshots in the Yarnell Hill Fire. Today, we honor their legacy and thank all of AZ’s firefighters putting their lives on the line to keep us safe.","date":"Wed Jun 30 15:30:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Giving blood saves lives. Sign up to donate ⬇️\nhttps://t.co/8j2zHttBCQ","date":"Tue Jun 29 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We introduced a bipartisan bill to increase mental health awareness for veterans by establishing a “Buddy Check Week,” helping the VA and non-profit partners conduct wellness checks on veterans. https://t.co/SgLc0YISlb","date":"Tue Jun 29 18:17:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're working with @JohnCornyn to address the crisis at the southern border, support border communities, and ensure migrants are treated fairly and humanely.\nhttps://t.co/M2VKiZ3Q4w","date":"Tue Jun 29 17:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S. Service Academies. We’re highlighting this year’s appointments including William Harrison Fricke to @AF_Academy. Thank you for keeping our country safe and secure. https://t.co/rOUHrSJHtK","date":"Mon Jun 28 21:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The administration needs to extend the pause on federal student loan payments as Arizona’s coronavirus recovery continues. https://t.co/HFz37nCoRQ","date":"Mon Jun 28 19:54:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Check out these helpful tips from @PHXFire to stay safe outside this summer 👇\nhttps://t.co/rOS0iKMhv7","date":"Mon Jun 28 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to see Arizona’s tourism industry recovering from the pandemic. We’ll continue working with tourism leaders to fuel jobs, expand opportunities, and ensure our state remains a top tourism destination. \nhttps://t.co/of3hWKNGSw","date":"Sun Jun 27 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #PTSDAwarenessDay, we’re working to improve mental health services for Arizona veterans and ensure servicemembers receive the care and support they’ve earned.","date":"Sun Jun 27 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S. Service Academies. We’re highlighting this year’s appointments including Weslan Lannuier to @WestPoint_USMA. Thank you for keeping our country safe and secure. https://t.co/C2U3N6dqk1","date":"Sat Jun 26 23:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan agreement will upgrade critical infrastructure, create jobs, and expand opportunities for AZ. Honored to have @POTUS’s support. https://t.co/uy4dKOubGa","date":"Sat Jun 26 22:38:33 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #IndieWeekAZ! Let’s support our state’s local businesses and help fuel our recovery from coronavirus. Find an Indie Week Business near you: https://t.co/yZLD7p9oA7","date":"Sat Jun 26 17:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@IRS lanzó una nueva herramienta que ayuda a las familias de Arizona a reclamar sus beneficios del Crédito Tributario por Hijos. Aprenda más: https://t.co/b70plgZzCR","date":"Fri Jun 25 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona caregivers: the Dementia Caregiver Alliance wants to hear from family caregivers. Fill out this survey to give your input: https://t.co/nGi5QgDXTx. Responses are confidential and anonymous.","date":"Fri Jun 25 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bipartisan infrastructure agreement supported by @POTUS will boost AZ jobs and small businesses, fix roads and bridges, expand broadband, and help protect our communities from droughts and wildfires.\n\nBipartisanship takes work, but the product you get is good for our country. https://t.co/pAnSpsY0jD","date":"Thu Jun 24 20:10:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"So excited to see our state’s beautiful national parks reopen! https://t.co/FG8p9iKQzd","date":"Thu Jun 24 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S. Service Academies. We’re highlighting this year’s appointments including Michelle Basinger to @WestPoint_USMA. Thank you for keeping our country safe and secure. https://t.co/YV3ngo2Gl1","date":"Wed Jun 23 22:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"https://t.co/bgOg7YmRrV","date":"Wed Jun 23 22:09:12 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We secured critical COVID-19 relief funding to expand vaccinations, support everyday families, employers, and schools, and provide direct aid for AZ restaurants employing thousands of Arizonans. \nhttps://t.co/jspKLypwf2","date":"Wed Jun 23 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy 49th birthday, #TitleIX! We're ensuring gender never stands in the way of anyone getting her shot at the American Dream.","date":"Wed Jun 23 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our statement on the #ForThePeopleAct https://t.co/UWeZ9WFeJo","date":"Tue Jun 22 21:37:57 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today’s $1 billion in grant funding will expand broadband access on tribal lands and create job opportunities. https://t.co/3LigtpdJ0x","date":"Tue Jun 22 18:20:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"77 years ago today, the GI Bill became law, helping millions of veterans today pay for college, graduate school, and training programs. https://t.co/pJJE8x3K4d","date":"Tue Jun 22 16:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S. Service Academies. We’re highlighting this year’s appointments including Katherine Frost to @AF_Academy. Thank you for keeping our country safe and secure. https://t.co/eIdQ7dFera","date":"Mon Jun 21 23:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is Child Tax Credit Awareness Day. In the latest COVID relief law, we helped secure a bigger tax credit for Arizona’s everyday families. Families could see their first monthly payment on Thursday, July 15. For more info. on the new CTC, visit https://t.co/XhC9Q7YCMn.","date":"Mon Jun 21 19:24:53 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re incredibly proud of the bright, dedicated Service Academy students representing our state who are committed to keeping America safe. I encourage all Arizona students interested in attending U.S. Service Academies to apply. https://t.co/UFwRjSpZaD","date":"Mon Jun 21 15:47:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S Service Academies. We’re highlighting this year’s appointments including Jasper Marie Schineller to the U.S. Merchant Marines Academy. Thank you for keeping our country safe and secure. https://t.co/SIMAV43mmh","date":"Sun Jun 20 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Father's Day, Arizona!","date":"Sun Jun 20 16:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tucsonans: as temperatures rise, you can visit one of the city’s cooling centers. Find a site near you:   \nhttps://t.co/uSKu77bMvc","date":"Sat Jun 19 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On #Juneteenth, 156 years after the end of slavery in the United States, the promise of equality is still not a reality for many Americans. Today and every day, we’re working to advance our nation’s values: freedom, justice, and equal treatment under the law.","date":"Sat Jun 19 16:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're working with @JohnCornyn to address the crisis at the southern border, support border communities, and ensure migrants are treated fairly and humanely.\nhttps://t.co/M2VKiZlrt6","date":"Sat Jun 19 00:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Good luck, @ArizonaBaseball, in the NCAA College World Series! Make Arizona proud. \nhttps://t.co/rvqouFW3aI","date":"Fri Jun 18 16:00:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S Service Academies. We’re highlighting this year’s appointments including Edmond Yip to @NavalAcademy. Thank you for keeping our country safe and secure. https://t.co/L5nFsmRvlV","date":"Thu Jun 17 22:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We reintroduced our bill to incentivize airports to complete construction project ahead of schedule, saving Arizona taxpayers money. https://t.co/86RNyZGMfn","date":"Thu Jun 17 20:01:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"For decades, the federal government has failed to address our broken immigration system. Our Bipartisan Border Solutions Act secures the border, supports border communities, and ensures migrants are treated fairly and humanely.\nhttps://t.co/BQhb3swzEV","date":"Thu Jun 17 19:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to announce a $17.4M federal grant to Valley Metro’s Tempe Streetcar Project. https://t.co/CGTCsVTIid","date":"Thu Jun 17 15:12:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"@SenatorBurr @SenBillCassidy @SenatorCollins @ChrisCoons @GrahamBlog @SenatorHassan @SenatorHick @CaptMarkKelly @SenAngusKing @Sen_JoeManchin @JerryMoran @lisamurkowski @senrobportman @SenatorRomney @SenatorRounds @SenatorShaheen @SenatorTester @SenThomTillis @MarkWarner @SenToddYoung","date":"Wed Jun 16 22:07:52 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"@SenatorBurr @SenBillCassidy @SenatorCollins @ChrisCoons @GrahamBlog @SenatorHassan @SenatorHick @CaptMarkKelly @SenAngusKing @Sen_JoeManchin","date":"Wed Jun 16 22:07:37 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Joint statement from 21 Senators: https://t.co/bR9Umfp2hj","date":"Wed Jun 16 22:07:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to see Arizona administer 6 million+ COVID-19 vaccines, saving lives and livelihoods and fueling our state’s economic recovery. \nhttps://t.co/bKeV0rU6qj","date":"Wed Jun 16 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"LIVE: We're chairing a @HSGAC subcommittee hearing on improving security, trade, and travel at land ports of entry along the southwest border. https://t.co/U8VMP3GUcu","date":"Wed Jun 16 18:32:52 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Following the tragic assault and death of Army Specialist Vanessa Guillen, we’re introducing a bill with @JohnCornyn to strengthen the safety and accountability of servicemembers. https://t.co/Uws06uzjy2","date":"Wed Jun 16 16:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to welcome @mayorcoreywoods to testify in today’s @SenateBanking hearing. We’ll continue working with him and other local Arizona leaders to ensure our state’s infrastructure needs are met. https://t.co/BJgmv58pgY","date":"Tue Jun 15 23:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"AZ students: interested in applying to the U.S. Service Academies? RSVP to our Virtual Service Academy Day here: https://t.co/UUE8UKihoa. https://t.co/ckUJJVNEn4","date":"Tue Jun 15 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona law enforcement organizations can now apply for Community Policing Development grants to provide de-escalation training, law enforcement agency accreditation assistance, and diversity and anti-bias training. https://t.co/ic1cKOOWGR","date":"Tue Jun 15 15:00:03 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy #FlagDay, Arizona! https://t.co/IYM1Vjs8GY","date":"Mon Jun 14 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Birthday, @USArmy! Thank you for keeping our nation safe and secure for 246 years.","date":"Mon Jun 14 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Cheering on the @Suns as they move on to the Western Conference Finals! #RallyTheValley","date":"Mon Jun 14 13:52:20 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S Service Academies. We’re highlighting this year’s appointments including Jadah Cortez to @NavalAcademy. Thank you for keeping our country safe and secure. https://t.co/blgtqUSjmp","date":"Sun Jun 13 23:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Congratulations, @AliciaSouris, on your Planetary Science Early Career Award from @NASA! We’re grateful for your work training the next generation of scientists. https://t.co/IxwWtL4kJF","date":"Sun Jun 13 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our team proudly attended Brig. Gen. Kerry Muehlenbeck’s promotion ceremony to lead @AZNationalGuard. We’re thankful for your work keeping Arizona communities safe and secure. https://t.co/IPICEkBXGd","date":"Sat Jun 12 20:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today is Women Veterans Day, marking the anniversary of the Women's Armed Services Integration Act that allowed women to serve as members of the Army, Marine Corps, Navy, and Air Force.","date":"Sat Jun 12 17:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"It is our privilege to nominate exceptional Arizona students to the U.S Service Academies. We’re highlighting this year’s appointments including Dominic Flowers to @WestPoint_USMA. Thank you for keeping our country safe and secure. https://t.co/MQtwW8nEdt","date":"Fri Jun 11 22:29:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona servicemembers put their lives on the line to keep us safe and secure, and it is our duty to ensure they can access reliable childcare. Our bill improves and expanding childcare services across military installations. https://t.co/rqubaJFZ9k","date":"Fri Jun 11 20:04:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our bill supports Mohave County residents harmed by radiation exposure. https://t.co/jbwoQFXfI4","date":"Fri Jun 11 17:11:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizonans: state-run COVID-19 vaccination sites will close by June 28 - but vaccines remain available in our communities! If you haven’t yet received your vaccine, visit https://t.co/Se69U4kJxK to find a vaccine site near you. https://t.co/Pc4Htttymp","date":"Fri Jun 11 16:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our statement with @SenBillCassidy, @SenatorCollins, @Sen_JoeManchin, @lisamurkowski, @senrobportman, @SenatorRomney, @SenatorShaheen, @SenatorTester, and @MarkWarner. https://t.co/pEEQMn1WEN","date":"Thu Jun 10 21:05:33 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Happy Birthday to the late Rose Mofford! To this day, she continues to be an inspiration for what it means to get things done for Arizona.","date":"Thu Jun 10 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Restaurant Rescue Plan is getting Arizonans back to work and ensuring local Arizona restaurants can keep their doors open. Now, we’re pushing for more funding as we continue fueling a full economic recovery. https://t.co/EIRZuwkoFF","date":"Thu Jun 10 16:38:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today, on the #EqualPayAct anniversary, we’re recommitting to closing the gender pay gap. It’s simple: equal work deserves equal pay.","date":"Thu Jun 10 16:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Proud to help shape this critical legislation to help create Arizona jobs, strengthen our national security, and ensure America continues to lead the world in innovation.","date":"Wed Jun 09 18:35:32 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The Senate passed our bipartisan bill expanding opportunities at Tribal colleges and universities. https://t.co/IU7LShWvQS","date":"Wed Jun 09 18:23:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our National Aeronautics and Space Administration (NASA) Authorization Act passed the Senate. Strengthening America’s leadership in space exploration and research boosts our national security and expands economic and educational opportunities for Arizona. https://t.co/5q4O5E53cy","date":"Wed Jun 09 17:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today’s bipartisan Senate passage of our critical U.S. Innovation and Competition Act will help create jobs across Arizona, strengthen our national security, and ensure our country continues to lead the world in innovation. https://t.co/1XuCZcEDy1","date":"Wed Jun 09 00:21:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our hearts are with the congregation of Chabad on River today in the wake of this horrible vandalism. We must stand strong against anti-Semitism and with our Jewish brothers and sisters. Hate has no place in our community. https://t.co/yAM6NT7sxb","date":"Tue Jun 08 21:32:27 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"The A-10 has proven its usefulness time and time again. We wrote to President Biden expressing our concern with his plan to retire the A-10 aircraft housed at @DMAFB. https://t.co/Skavlb7nsr","date":"Tue Jun 08 19:50:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona: los casos de coronavirus están bajando gracias a las vacunas. Escuchemos a los expertos médicos: las vacunas son seguras y efectivas. \nhttps://t.co/W5DPteDqAg","date":"Tue Jun 08 19:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Education was my key to opportunity, and I’m committed to ensuring all Arizona students have the same access to higher education that I did. Our bipartisan Earn to Learn Act reduces student loan debt and makes college more affordable. https://t.co/sXK5V47ZDZ","date":"Mon Jun 07 22:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona servicemembers put their lives on the line to defend our freedoms and keep our country safe. We’re opening up access to federal nutrition programs to ensure our troops can feed themselves and their families and stay healthy. https://t.co/8IaST1TODn","date":"Mon Jun 07 20:34:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re working to expand opportunities for first-time homebuyers and ensure affordable housing for Arizonans. \nhttps://t.co/PLaNwoZPgW","date":"Mon Jun 07 18:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"For decades, the federal government has failed to address our broken immigration system. We're working with @JohnCornyn to address the current crisis at the southern border, secure the border, support border communities, and ensure migrants are treated fairly and humanely. https://t.co/DIIVaeu94V","date":"Sun Jun 06 21:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"On the 77th anniversary of D-Day, we honor the incredible sacrifices made on the beaches of Normandy.","date":"Sun Jun 06 15:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Thankful for the Arizona firefighters working to contain this dangerous blaze and hoping that everyone in the vicinity stays safe.","date":"Sun Jun 06 01:32:12 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Tucson and Tempe were recognized in the 2021 Smart 50 Awards for innovative work in community health and broadband access. Learn more: \nhttps://t.co/OrrAAhNBvI","date":"Sat Jun 05 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Our Earn to Learn Act helps Arizona students save for school while teaching important money-management skills. Listen ⬇️\nhttps://t.co/Hu1KhzUJ5y","date":"Sat Jun 05 18:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We’re working with Arizona’s local leaders to ensure our cities and towns get needed coronavirus-relief funding.\nhttps://t.co/OOYAUhnyQ2","date":"Fri Jun 04 21:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Arizona leads the way in space research. The Arizona History Museum (@AZHistSociety) in Tucson showcases our state’s history of space exploration.\nhttps://t.co/HBZvKeM48H","date":"Fri Jun 04 19:00:01 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Today marks the 102nd anniversary of the Senate recognizing women's right to vote. It’s the greatest honor of my life to serve as Arizona's first female Senator and I am committed to delivering results for everyday families.","date":"Fri Jun 04 16:30:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Honored to work with @JohnCornyn, @RepCuellar, and @RepTonyGonzales to build bipartisan support in the House and Senate for our Bipartisan Border Solutions Act. https://t.co/Ia4E5T1rLf https://t.co/YZqn3oTAcc","date":"Thu Jun 03 23:00:02 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We're hosting a Virtual Service Academy Day on Saturday, June 19 at 10:00am AZ time for Arizona students interested in applying to the U.S. Service Academies. RSVP here ⬇️ \nhttps://t.co/UUE8UKihoa","date":"Thu Jun 03 20:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"Glad to see our state vaccinate more Arizonans in rural communities.\nhttps://t.co/Nwmb0W3rkh","date":"Thu Jun 03 16:48:19 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"June is Alzheimer’s and Brain Awareness Month. So many families have been impacted by Alzheimer’s. This month we honor those suffering from this disease and we continue to support new treatments.","date":"Wed Jun 02 22:00:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":"We toured Casa Alitas Welcome Center in Tucson with @JohnCornyn to talk about the current migrant crisis and the role non-profits play. https://t.co/06Nxe07BXR https://t.co/UVO2aLb96w","date":"Wed Jun 02 20:35:00 +0000 2021","user_id":"1080844782"},{"handle":"SenatorSinema","text":".@CBP leadership in Tucson briefed @JohnCornyn and us on the current migrant crisis and the agency’s efforts to keep Arizona safe and secure. https://t.co/HftzWQ8vYn https://t.co/txwmeUiqMC","date":"Wed Jun 02 17:48:00 +0000 2021","user_id":"1080844782"}]