[{"handle":"SenatorRounds","text":"Visited with students and parents from Summit who were in Washington this week celebrating achievements in the National History Day Contest. Enjoy your time in the nation's capital! https://t.co/0GDYAKonym","date":"Thu Jun 16 17:50:37 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This marks 50 years since the Rapid City Flood, the most destructive in South Dakota history. It took the lives of 238 people, injured 3,000 and displaced many from their homes. We remember, honor and commemorate those who were impacted by this devastating event. https://t.co/h9Tr27E0p1","date":"Thu Jun 09 18:29:58 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On this 78th anniversary of D-Day, we remember the sacrifices of the Greatest Generation. Their contributions, both at home and overseas, will forever play a significant role in shaping our nation’s history. https://t.co/WwKMLLnCpl","date":"Mon Jun 06 23:33:01 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Every day is a great day to celebrate the unmatched beauty of South Dakota. Happy #605Day #GreatFacesGreatPlaces https://t.co/RKibrp8WY5","date":"Sun Jun 05 17:47:08 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I had the opportunity to visit with high school students attending Boys and Girls State. Very engaged kids with great potential to leave the world better than they found it. Keep up the good work, you’ll go far! https://t.co/7rhoOqTMmu","date":"Fri Jun 03 20:04:17 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Americans expect the president to defend our borders. It’s time the administration realizes the error in their ways. But I’m not holding my breath.","date":"Fri May 20 23:12:26 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"President Biden’s proposal to lift Title 42 was just one more major policy mistake. Thankfully, the courts have stopped this proposed policy for now.","date":"Fri May 20 23:12:25 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @SD_Guard continues to answer the call to serve. Today in Rapid City, we recognized the 129th MPAD who will be deploying in support of the European Defense Initiative. We also welcomed home the 641st AVN DET. Thank you for your service to our state and nation. https://t.co/PbDTuFp5fp","date":"Sat May 14 18:55:17 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Closely monitoring reports of storm damage from across eastern South Dakota. Sending prayers and stay safe.","date":"Fri May 13 02:22:08 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My statement on the leaked Supreme Court draft decision ⤵️ https://t.co/1LMW60Gz2v","date":"Tue May 03 22:25:26 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"@bethjensen @dexterkelo11 Congratulations on 45 years, Dexter! Thanks for all you do for South Dakota.","date":"Mon May 02 22:08:57 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to visit with the folks at @Silencercentral today in Sioux Falls.","date":"Fri Apr 29 21:15:02 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We had a brand-new visitor in the office. It was great meeting Surrey Faye, the one-week-old daughter of my D.C. Deputy Chief of Staff, Kyle Chase. Congratulations to Kyle, Alyssa and Saylor! https://t.co/Rp097DaHaN","date":"Wed Apr 27 18:54:39 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Saddened to hear of the passing of my former colleague Senator Orrin Hatch. He was a true gentleman and lawmaker who was respected by members of both parties. My prayers are with his wife Elaine and the entire Hatch family.","date":"Sun Apr 24 02:33:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing you and your family a very happy Easter. https://t.co/UokCZOxtCA","date":"Sun Apr 17 12:59:44 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"At the same time, the CDC is rescinding the COVID-19 border removal authority under Title 42 which will allow approximately 18k per day to illegally cross our southern border. It seems the administration thinks the threat of COVID-19 exists on airplanes but not at the border.","date":"Wed Apr 13 17:08:23 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My statement on the upcoming Supreme Court nomination vote⤵️ https://t.co/ejxAVz15Cp","date":"Tue Apr 05 01:52:09 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨 The average price of diesel in South Dakota has hit an all-time high. 🚨\n\n$4.863 per gallon.","date":"Thu Mar 31 17:20:00 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This requires Supreme Court justices to exercise judicial restraint while making decisions on issues we as Americans hold most dear: life, liberty and property.","date":"Tue Mar 29 22:05:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Ultimately, I believe it’s critical anyone serving on the Supreme Court is fair-minded, and will interpret the Constitution and statutes as written to uphold the rule of law.","date":"Tue Mar 29 22:05:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In the days ahead of her final confirmation vote, I will continue to examine her judicial record and qualifications as a judge, before announcing how I intend to vote on her nomination.","date":"Tue Mar 29 22:05:50 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I appreciated the opportunity to visit today with Judge Jackson, @POTUS’ nominee to the United States Supreme Court. I came into our meeting with an open mind and take seriously the Senate’s responsibility to provide ‘advice and consent’ on Judge Jackson’s lifetime nomination. https://t.co/8DEnqGdCT7","date":"Tue Mar 29 22:05:50 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota would not be what it is today without the countless women who are involved in agriculture. Thanks to the wives, mothers, grandmothers, daughters and sisters who work every day on farms and ranches across the state. #NationalWomeninAgDay","date":"Thu Mar 24 18:45:33 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My friend @SenJohnThune and I enjoyed visiting with high school students from West Central who are in DC today. Have fun on your trip! https://t.co/0OeodgdEKv","date":"Wed Mar 23 17:14:46 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota farmers and ranchers work hard every day to feed the world. On National Ag Day, we say thank you.","date":"Tue Mar 22 21:51:29 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks again for your leadership here, Chuck. Looking forward to your response and to potentially partnering with you to get this across the finish line.","date":"Tue Mar 22 15:04:31 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Lastly, my read is that this bill excludes 5 of the 9 JBS plants, 2 of the 3 Cargill plants and 2 of the 6 Tyson plants. That’s 9/18 large packers that are currently excluded. Is there a plan to include the rest of the plants?","date":"Tue Mar 22 15:04:31 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Another concern is that no region's minimum can be more than ‘3 times higher than that of the lowest region's minimum.’ Texas is at approximately 10%. Iowa was recently over 50%. Does this language “cap” Iowa, in this case, at 30%?","date":"Tue Mar 22 15:04:30 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"So the only latitude left up to the Secretary is a comment period where they could make that minimum higher than the previous 18-month average, but not lower. Is that correct?","date":"Tue Mar 22 15:04:30 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve been reading through the compromise legislation you proposed w/ @SenatorFischer. I believe your legislation is a step in the right direction toward more cash trade, transparency &amp; competition but have a few questions/concerns I’d like addressed before I can support it.","date":"Tue Mar 22 15:04:29 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Does the formula create a “floor”? Does this proposal seek to set a floor, a minimum cash trade, per packing plant, set by each feeding region? That regional minimum, while left up to the Secretary, cannot be below the previous 18-month cash trade average. Is this correct?","date":"Tue Mar 22 15:04:29 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hey @ChuckGrassley - I’ve appreciated your leadership on a number of efforts to reform the broken cattle market. It’s been great working with you on bills that would make a difference for consumers and our producers, like 50-14 and the Meat Packing Special Investigator Act.","date":"Tue Mar 22 15:04:29 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Rural communities have historically suffered the most from initiatives like the AIR Commission. SD vets are witnessing this first-hand with plans to close facilities in Hot Springs, Sturgis and Wagner. @Sen_JoeManchin and I are leading a letter to @POTUS fighting for rural vets. https://t.co/IK2DzRqbdi","date":"Tue Mar 15 18:06:49 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"February inflation hit a forty-year high of 7.9%. The anti-energy policies of the Biden administration are causing SD families to pay record-high gas prices. And, the inflation increase from Putin’s war has not hit Americans’ pockets yet.","date":"Thu Mar 10 22:01:12 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to @SDCoyotesWBB and @GoJacksWBB as they play in @thesummitleague Championship today. #March2TheSummit #SummitWBB https://t.co/7F8Jy8X6AB","date":"Tue Mar 08 18:54:22 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to see a sign of SD on the National Mall! Dr. Ashley Podhradsky’s statue is featured at the Smithsonian as part of Women’s History Month. Dr. Podhradsky, VP for Research &amp; Economic Development at DSU, is one of 120 women recognized for her innovative work in STEM. Congrats! https://t.co/qsQi8ZPkRQ","date":"Tue Mar 08 13:30:26 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Vladimir Putin is the enemy. We cannot continue to fund his war efforts. The Biden administration needs to stop worshiping at the altar of climate change. We must do everything in our power to produce more American energy. I joined @ErinBurnett @OutFrontCNN to discuss the latest. https://t.co/Lzm8r7IbDk","date":"Tue Mar 08 02:53:15 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The VA MISSION Act also included provisions to include this BRAC-style process, which we learned today will negatively impact much of rural SD.","date":"Fri Mar 04 22:31:17 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As a member of the Senate Committee on Veterans’ Affairs, I’ll fight like hell to make sure veterans in South Dakota receive the care they’ve earned. I call upon all veterans organizations to help us defend these services in rural South Dakota.","date":"Fri Mar 04 22:31:17 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The VA MISSION Act was bad public policy then and it’s gotten no better with age. While the provisions of this BRAC will not be released publicly until March 14th – the threat has become clear to our local veterans.","date":"Fri Mar 04 22:31:17 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The concerns I warned against in 2018 when I voted against the VA MISSION Act have come to fruition. Veterans were told they could receive care in the community, and that’s proven not to be the case.","date":"Fri Mar 04 22:31:16 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Stop importing Russian oil. Produce more American energy.\n\nPutin’s crude is crud.","date":"Fri Mar 04 19:29:54 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Voted today to block the Biden Administration's CMS vaccine mandate which would apply to most health care workers.","date":"Wed Mar 02 22:56:42 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Oil from Russia accounts for 4% of total US consumption. We continue to line the pockets of Putin as he wages war on Ukraine. This has to stop!\n\nIt’s time to ramp up American energy production and end the U.S. and European dependence on Putin’s energy. https://t.co/4ebC0mCg3I","date":"Wed Mar 02 00:14:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We stand with the people of Ukraine. 🇺🇦 https://t.co/z6houapqeF","date":"Tue Mar 01 21:20:57 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m deeply saddened to learn of the passing of @SenFeinstein's husband, Richard Blum. Losing a spouse is painful and life altering. Thinking of my colleague and her family during this time.","date":"Tue Mar 01 00:28:45 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just voted no on H.R. 3755, also known as the Abortion on Demand Until Birth Act. Enough said.","date":"Mon Feb 28 23:07:42 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Vladimir Putin is a cold, calculating killer. We must continue to support the people of Ukraine as they defend their country. I joined @OutFrontCNN with @ErinBurnett to discuss the ongoing situation. https://t.co/D0TYHG6CeW","date":"Sat Feb 26 01:10:23 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I take very seriously the Senate’s responsibility to provide advice and consent on these lifetime appointments, and look forward to meeting with Ms. Jackson in-person during her thorough and rigorous confirmation process.","date":"Fri Feb 25 19:24:12 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Supreme Court is the highest court in the nation and has superior jurisdiction over all federal and state courts. Therefore, it is critical to make certain this nominee is fair-minded, and will honor the original intent of the Constitution and the rule of law.","date":"Fri Feb 25 19:24:12 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As I examine Judge Jackson’s record, I will look to her qualifications as a judge, her temperament and her ability to interpret the law as written while exercising judicial restraint.","date":"Fri Feb 25 19:24:12 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The bill is supported by @uscattlemen, @BeefUSA, @RCALFUSA, @SDCattlemen and SD Stockgrowers. It’s not often that you have all the cattle groups supportive of the same idea, which says a lot. I thank Sen. Tester for his leadership and am hopeful others will get behind this effort","date":"Thu Feb 17 22:03:07 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Consumers should feel confident that their beef is safe. Foreign beef should not jeopardize the high-quality beef produced by American ranchers.","date":"Thu Feb 17 22:03:07 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Brazilian beef poses a threat to both American consumers and producers. I'm joining @SenatorTester on legislation that would suspend Brazilian beef imports to the United States until experts can conduct a systematic review of the commodity’s safety.","date":"Thu Feb 17 22:03:07 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My statement on the Durham Investigation ⤵️ https://t.co/UbIZRePrY4","date":"Wed Feb 16 23:44:57 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great meeting today with students from Takini. Enjoy your time visiting Washington! https://t.co/rqKBXDghe8","date":"Wed Feb 16 22:53:28 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great meeting today with members of the SD National Guard Enlisted Association. Whether serving their communities at home or our nation overseas, National Guardsmen have always answered the call. We owe it to them to make sure they receive the pay and benefits they deserve. https://t.co/zvwMQey1cS","date":"Tue Feb 15 21:39:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As the conditions in Ukraine intensify, it's important to send a strong message to Vladimir Putin that a Russian invasion will not be tolerated. If Putin decides to carry out this action, Russia will be in for an \"economic hell\" that will devastate their country. https://t.co/GnrYbNZVTi","date":"Tue Feb 15 16:51:25 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our first Valentine’s Day apart. My forever Valentine. https://t.co/4c42ulw6PH","date":"Mon Feb 14 18:38:38 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great time visiting with folks yesterday at the Black Hills Stock Show! Stop by our booth if you’re looking for help with a federal agency or to let me know your thoughts. https://t.co/jhbRerGWyV","date":"Sat Feb 05 21:38:33 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Praying for a full and speedy recovery for my friend and colleague @SenatorLujan.","date":"Wed Feb 02 00:08:02 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Visited with leaders from the City of Box Elder, Douglas Schools and Ellsworth Air Force Base. The B-21 will be here soon and so will thousands of new people in the region. Lots of planning to be done and actions to be taken, but good to hear an update. https://t.co/FY0Gf7v9hE","date":"Fri Jan 28 21:16:46 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Spent some time yesterday with @Elevate_RC. Exciting to hear about the growth and planning that is happening in this community. The future is bright! https://t.co/xMcHaO5yRv","date":"Fri Jan 28 15:55:11 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Some of the most important work we do in the United States Senate is helping constituents. If you or a family member need assistance with the Social Security Administration, Indian Health Service, the VA or any other federal agency, my team and I are here to help. https://t.co/fWnqDHrtHn","date":"Fri Jan 28 01:29:09 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My new West River office is officially open. While we’ve always had an office in Rapid City, this new location will allow my staff to best serve constituents in western South Dakota. Stop by and visit us at 603 Omaha Street in Rapid. https://t.co/Bnp4uxp77I","date":"Fri Jan 28 01:28:57 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our goal is to avoid war. Deterrence is the key. We need to send a strong message to Vladimir Putin that an invasion in Ukraine will cost him blood and treasure. Last night, I joined @ErinBurnett on @OutFrontCNN to discuss the situation. https://t.co/6UDHAsxIWX","date":"Tue Jan 25 23:59:09 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to visit with @sdcorn this weekend! https://t.co/YkXL77qWG0","date":"Tue Jan 25 02:13:59 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We support our friends in Ukraine. It's critical that we provide defensive capabilities to Ukraine as they courageously defend their country against the threat of Putin’s invasion. https://t.co/1KSCIKvCzM","date":"Sun Jan 23 00:59:37 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Very sorry to hear of the sudden passing of Greg Dean. Greg was truly a friend and a real class act. My thoughts and prayers are with Jill, Blake, Bradley and Bennett. His family and our community have suffered a great loss. https://t.co/4XQs9xuWxi","date":"Fri Jan 21 20:30:57 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Senators Manchin and Sinema, joined with every @SenateGOP member, acting to preserve the current rules of the Senate which require bipartisan approval of legislation and which protects the minority rights as our Founders envisioned.","date":"Thu Jan 20 04:02:18 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrat Senate leadership just lead their caucus on a failed mission to significantly alter Senate rules in an attempt to pass their liberal agenda on a simple majority vote.","date":"Thu Jan 20 04:02:18 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Republicans believe in local control and common sense. That’s right!","date":"Thu Jan 20 00:52:55 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrats believe that taxpayer money should subsidize federal elections. That’s wrong!","date":"Thu Jan 20 00:52:55 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our Founding Fathers knew that confidence in the integrity of our elections could best be protected at the local level - not by a federal bureaucrat.","date":"Thu Jan 20 00:52:55 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrats want to force states to allow convicted felons to vote. That’s wrong!","date":"Thu Jan 20 00:52:54 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrats think that elected state officials should be subject to federal bureaucratic oversight over any election decisions. That’s wrong!","date":"Thu Jan 20 00:52:54 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrats want you to show your ID with proof of vaccination to participate in society, yet don’t think you need an ID to vote. That’s wrong!","date":"Thu Jan 20 00:52:54 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"All human life is a gift from God. I’ve worked with my colleagues in the Senate on numerous bills to limit abortions and protect innocent lives, both the very young and the very old. While there is still more work to be done, I thank @SBAList for their continued advocacy. https://t.co/CnPpC0Ofmz","date":"Wed Jan 19 20:17:53 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Justice Sabers was a respected member of the South Dakota Supreme Court. Our state is a better place because of his dedication and efforts to deliver justice as fairly as possible. My thoughts and prayers are with his family. https://t.co/atWkxIM5t7","date":"Fri Jan 14 22:16:51 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good to have Dusty leading the charge in the House on my legislation. I introduced S.1725 in May &amp; have 24 cosponsors. American Indians serve in the military at a higher rate than any other group. The NAIV deserve a congressional charter to better represent these brave patriots.","date":"Thu Jan 13 22:57:15 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great news - the Supreme Court just blocked President Biden’s OSHA vaccine mandate on large employers. While I am a supporter of vaccines, forcing these mandates on private businesses is excessive federal overreach by the Biden administration.","date":"Thu Jan 13 22:05:02 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My response to the former president: https://t.co/pmCayV3AQT","date":"Tue Jan 11 00:06:48 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This morning, I joined @GStephanopoulos on @ThisWeekABC. Watch my full interview here ⤵️ https://t.co/r9xSONOc9f","date":"Sun Jan 09 22:55:29 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joining @GStephanopoulos on @ThisWeekABC.\n\nTUNE IN SUNDAY MORNING:\n📺 @dakotanews_now at 9 AM CT.\n📺 @kotatweets at 7 AM MT. https://t.co/bT5cPvQn9p","date":"Sun Jan 09 04:03:44 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hey @SteveDaines - Making good on our bet. Good luck in Frisco! https://t.co/PKY33vhhfA","date":"Fri Jan 07 23:47:14 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday to my friend and seatmate, @SenJohnThune! Enjoy this picture I recently found in my archives - the good ole days! https://t.co/434wScVYqN","date":"Fri Jan 07 19:52:42 +0000 2022","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Merry Christmas from the Rounds family! https://t.co/KJS5xpq1zY","date":"Sat Dec 25 14:24:56 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Johnny Isakson was a kind and genuine friend. He was known in the Senate as a true gentleman and a man of great Christian spirit. Johnny was a champion for veterans and his leadership as @SVACGOP chairman made a difference. My prayers are with Dianne and the Isakson family. https://t.co/Dlg0Gq0Qnc","date":"Sun Dec 19 17:26:26 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":".@SteveDaines - you’ve never seen a SD Jackrabbit, have you?\n\nLooking forward to seeing you wear my Jackrabbits hat in the US Capitol!\n\n#gojacks @GoJacksFB","date":"Thu Dec 16 17:56:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This morning, I visited w/ Sisseton Wahpeton Tribal Chairman Hopkins, Councilman Owen and Councilwoman Lake. They provided an update on the tribal detention facility progress and ongoing efforts towards building a comprehensive justice and treatment center for the tribe &amp; region. https://t.co/Y02mn17oR8","date":"Thu Dec 09 17:57:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On this 80th Anniversary of the attack on Pearl Harbor, we remember the more than 2,400 lives who were lost and 1,200 wounded. They are part of our Greatest Generation. They must never be forgotten. #PearlHarborRemembranceDay #PearlHarbor80","date":"Tue Dec 07 21:56:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Earlier this year, @SenatorShaheen and I introduced the Greatest Generation Memorial Act to authorize the U.S. Treasury to mint coins in commemoration of the National @WWIIMemorial in Washington, D.C. Proceeds from coin sales will go toward much-needed repairs and maintenance.","date":"Tue Dec 07 21:56:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The National World War II Memorial recognizes the tremendous sacrifices made by the Greatest Generation. On behalf of South Dakota’s World War II veterans, we will continue to work to preserve and protect this very important memorial. @VFWHQ @AmericanLegion @MOPH_HQ","date":"Tue Dec 07 21:56:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to visit with @David_Bordewyk, Executive Director of @SD_Newspapers. I appreciate the important role each South Dakota newspaper plays in keeping their readers informed and connected with their communities. https://t.co/0LoXhefSD7","date":"Mon Dec 06 23:56:18 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Bob Dole was a man of character. His life was dedicated to service and he will always be remembered as a true American hero. Our world needs more leaders like him. My prayers are with Elizabeth and the entire Dole family.","date":"Sun Dec 05 18:00:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you or a family member are being restricted by the VA from using the Care in the Community Benefit you’ve earned, please contact one of our local offices. We can be reached toll free at 844-875-5268 or by sending an email here: https://t.co/4mngRwmDif","date":"Sat Dec 04 17:49:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I had the opportunity to question VA Sec McDonough on the implementation of the MISSION Act. Specifically, I addressed w/ him claims the VA’s Care In The Community administrators are purposely limiting a Veteran’s ability to seek care from a local healthcare provider. https://t.co/rRRHJTA5yJ","date":"Sat Dec 04 17:48:19 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My prayers are with the Weems and Thune families. Jim was a man of deep Faith. His soul is at peace with our Heavenly Father. May all who loved him find comfort in that.","date":"Fri Dec 03 23:00:16 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"An update and moving forward - grateful for your continued support and the opportunity to serve you. https://t.co/2YW6RbmzUA","date":"Tue Nov 30 00:36:17 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"No amount of people can replace Jean’s presence. For 43 years, we shared everything together. In marriage, we became one. She was my soulmate, my rock and her void is impossible to fill.\n\nThe First Thanksgiving: https://t.co/w7miD9HonA https://t.co/eWNiwMpjTw","date":"Mon Nov 22 21:48:46 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We will never be able to repay our veterans for the sacrifices they've made and we can never thank them enough! Please thank a veteran not only today but every day.","date":"Thu Nov 11 15:50:26 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The prayers and support we received throughout this battle were powerful and made a difference. We ask for your continued prayer as we remember her life and grieve together as a family.","date":"Tue Nov 02 21:02:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The love of my life is with the Lord. No more treatments. No more pain. Just peace. South Dakota knew her as First Lady. We knew her as wife, daughter, mom and grandma. She was everything to us. https://t.co/XbeXFbIj64","date":"Tue Nov 02 21:02:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"He was also an involved community leader, astute businessman, fellow pilot, generous philanthropist, accomplished athlete and, most importantly, a father of five. Jean and I valued our friendship with Frank and Pat. Our prayers go out to the Farrar Family.","date":"Sun Oct 31 19:20:15 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Gov. Farrar had boundless energy &amp; unlimited optimism. God blessed Frank with a long life &amp; he used every minute of it to pursue a variety of different interests; first among them public service. We are grateful for his service to our country as a veteran &amp; to SD as the AG &amp; gov. https://t.co/v1teXnFuMb","date":"Sun Oct 31 19:20:15 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Biden’s OCC nominee, Saule Omarova, stated she supports “effectively end[ing] banking as we know it.” Should her nomination make it to @BankingGOP, I'll request additional info into Ms. Omarova’s documented comments in favor of nationalizing retail banking &amp; radicalizing the OCC.","date":"Tue Oct 26 21:09:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hobo Day is a 100+ year old tradition at @GoJacksSDSU. Good luck to @GoJacksFB today! #HoboDay https://t.co/cS9U66YKTf","date":"Sat Oct 23 17:47:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This photo was taken in Spearfish. A year ago today, the average price of regular unleaded in South Dakota was $2.11 per gallon. The average price of diesel was $2.21 per gallon. https://t.co/wXxsYz6yJq","date":"Sat Oct 23 14:04:59 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I lost a good friend last week. Lonnie lost her husband of 37 years and her soulmate. The state of South Dakota lost a legendary public servant. \n\nMy tribute to Jim Soyer: https://t.co/7ulppQWcPV https://t.co/DzpvkL7X7F","date":"Fri Oct 22 21:25:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The American buffalo is a treasured animal &amp; resource for Native American communities. @MartinHeinrich &amp; I introduced the Indian Buffalo Management Act to give tribes the ability to manage their buffalo populations &amp; utilize the many benefits from buffalo. https://t.co/jlSQb4CL2M https://t.co/x22vdZjAfA","date":"Fri Oct 22 14:02:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I introduced a bill to establish performance objectives &amp; metrics for the incorporation of AI &amp; digital readiness into DOD's training and operations. As our adversaries integrate AI into their military capabilities, we need to do the same. [2/2] https://t.co/WQMvaKvJpM","date":"Thu Oct 21 16:52:40 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In a recent @SASCGOP hearing, I raised concerns over the reason for Mr. Chaillan’s resignation as a top DOD software officer. I agree with Mr. Chaillan that DOD needs to move more quickly in advancing technology, including artificial intelligence. [1/2]\nhttps://t.co/hnGhPxhWFK","date":"Thu Oct 21 16:52:39 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Godspeed! https://t.co/6X4JkJpFSY","date":"Wed Oct 20 21:07:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"General Colin Powell dedicated his life to military and public service. General Powell made a profound impact on American foreign policy and was a leader in our fight against terror. Our nation mourns the loss of this great American hero.","date":"Mon Oct 18 13:40:57 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great pheasant opener! Had lots of family and friends including and best of all, all of our grandchildren! https://t.co/2eLamYZnCg","date":"Mon Oct 18 02:19:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Opening Day! The pheasant opener is a South Dakota tradition. Hope everyone who is participating today has a safe and successful hunt! #HiFromSD\n https://t.co/S58W7bDDBR","date":"Sat Oct 16 18:55:55 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday to the @USNavy! Thank you for 246 years of service to our nation. It was great talking to @SECNAV Carlos Del Toro last week about the importance of supporting our sailors. 🇺🇸 https://t.co/lMKV2K5kIe","date":"Wed Oct 13 19:58:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Native Americans’ Day is a way for us to honor the rich culture and history of Native Americans in South Dakota. Today, all South Dakotans celebrate #NativeAmericansDay! https://t.co/6fwkdbTYgd","date":"Mon Oct 11 16:01:46 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This weekend is #VikingDays at Augustana, a tradition dating back to 1929. Good luck to @AugieFB and happy Viking Days! https://t.co/1MGKtCdGER","date":"Sat Oct 09 15:13:23 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My full statement opposing the debt limit increase ⬇️ https://t.co/hODl9sYWmu","date":"Fri Oct 08 02:29:52 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As the ranking member of the Cybersecurity Subcommittee of @SASCGOP, I’m glad to bring attention to #CybersecurityAwarenessMonth and work to deter cyberattacks in our businesses, homes, government and military. Increasing awareness and resources will help protect Americans. https://t.co/iyxSplEe63","date":"Thu Oct 07 19:23:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I spoke on the floor about the Afghanistan debacle. \n\nDespite receiving the best military advice, @POTUS decided to use his own judgement and chose to withdraw on a date certain - without regard for the conditions on the ground. History will not judge him kindly. https://t.co/FLZfFfa0OC","date":"Wed Oct 06 22:26:58 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The border crisis by the numbers: \n🚨208,887 apprehensions in Aug.\n🚨34% increase of fentanyl seizures from July to Aug. \n🚨36% increase of cocaine seizures from July to Aug.\n🚨10,000 lbs of fentanyl seized this year\n \nWe need to protect our borders! https://t.co/rBFLdx3hnM","date":"Wed Oct 06 14:11:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve heard from thousands (no kidding—thousands!) of South Dakotans who are outraged by this attempt at extreme government overreach. I’ve proposed legislation with Senator @MikeCrapo to prohibit this absurd proposal from being enacted into law. We cannot let this happen!","date":"Tue Oct 05 19:33:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Biden admin is proposing a requirement that banks report annualized transactions for all accounts with more than $600 or $600 in activity to the IRS.\n\nDon’t believe it? Read the proposal yourself. This is buried on page 88 of the Treasury’s 107 page document of proposals. https://t.co/qrydaPCvMh","date":"Tue Oct 05 19:33:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For 70 yrs, the U.S. has worked w/ NATO allies to prevent warfare. Following Pres. Biden's disastrous withdrawal from Afghanistan, the U.S. must commit to better cooperation &amp; strong transatlantic relations with our European allies. Great meeting with the NATO Secretary General. https://t.co/cjiAzXxnVO","date":"Tue Oct 05 16:14:54 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"From August 2020 to August 2021, core inflation saw its biggest annual jump in THREE DECADES. \n \nPassing the Democrats’ reckless $3.5 trillion spending proposal will continue to raise prices on everyday goods and harm our economy! https://t.co/Kri3eDDzR8","date":"Tue Oct 05 13:14:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week is National Newspaper Week. I want to recognize and thank everyone working for local newspapers in SD. From the editor to the ad sales rep and the reporter to the delivery person, you all play a vital role in keeping our communities connected, vibrant and strong.","date":"Mon Oct 04 15:16:16 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In Sioux Falls today for the activation ceremony for the @SD_Guard’s 1742nd Transportation Company. Thank you for your service! https://t.co/Sk9NncTYSK","date":"Sun Oct 03 22:39:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today in Aberdeen, we thanked the brave men and women of the @USArmyReserve’s 452nd Ordnance Company, 3rd platoon, who will be serving our country overseas. God bless our military! https://t.co/Izsm7SUAgF","date":"Sun Oct 03 00:21:53 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to @SDCoyotesFB as they take on the Indiana State Sycamores on Dakota Days! #WeAreSouthDakota #GoYotes https://t.co/sRxFaakaRl","date":"Sat Oct 02 17:48:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to be in Aberdeen for Gypsy Day. Good luck to @NSUWolves_FB (including my former intern Jacob Howard) and the @NorthernStateU volleyball team! #GoWolves https://t.co/LnO0SElUh0","date":"Sat Oct 02 16:05:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great visiting with kids from the Cheyenne River Youth Project in Eagle Butte. They’re in town today visiting Washington. Enjoy your time in the nation’s capital! https://t.co/boY6RDhMhj","date":"Thu Sep 30 16:07:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans are outraged at our disgraceful departure from Afghanistan.\n\nThe blame falls squarely on the shoulders of President Biden. He clearly ignored the advice of the generals and owns this debacle.\n\nHistory will not judge him kindly.","date":"Wed Sep 29 14:54:50 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, our military leaders testified they recommended to Biden to leave troops in Afghanistan—a rec clearly rejected. \n\n@SecDef also told me the admin didn’t plan for an immediate collapse of the Afghan govt.\n\nBiden’s decision to withdraw on a date certain boxed our military in. https://t.co/YMfvFc600M","date":"Tue Sep 28 18:50:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Biden admin is proposing a requirement that banks report annualized transactions for all accounts with more than $600 or $600 in activity to the IRS. \n\nBankers are not IRS agents!\n\nI’ve introduced legislation w/ @SenCrapo that stops this excessive government intrusion.","date":"Mon Sep 27 20:24:14 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read more here: https://t.co/FM0FJfYEnu","date":"Thu Sep 23 21:04:13 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I introduced a bill with @SenTinaSmith which would allow tribes the ability to administer SNAP to meet the needs of their communities. This would create additional opportunities for tribes to strengthen local food economies &amp; promote the inclusion of indigenous foods. https://t.co/J8mQZId0D6","date":"Thu Sep 23 21:04:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday to the @usairforce! Thanks to generations of Airmen for their service and protecting our skies. I’m especially proud to support the men and women at Ellsworth Air Force Base. You make South Dakota proud! #AimHigh https://t.co/PBYWO9zRya","date":"Sat Sep 18 14:30:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As President Abraham Lincoln once said, “Don’t interfere with anything in the Constitution. That must be maintained, for it is the only safeguard of our liberties.” \n\nHappy #ConstitutionDay! https://t.co/qrbvsxKq0Z","date":"Fri Sep 17 21:30:28 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We honor and remember prisoners of war and service members who never returned home. Today and every day, we are grateful for those who fought for freedom, their loved ones and their sacrifices. These heroes will never be forgotten. https://t.co/33hHRIGEHs","date":"Fri Sep 17 17:09:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve heard from thousands of South Dakotans concerned about the proposed expansion of the IRS &amp; its impacts on Americans’ financial privacy—I share their concerns. Our bill creates safeguards to help prevent IRS abuses &amp; protect taxpayer privacy. Read more:https://t.co/ZYCwtwsIAh","date":"Thu Sep 16 14:23:15 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Each year, I am honored to nominate our nation’s future military leaders to U.S. service academies. I encourage young South Dakotans looking to answer the call of duty to consider applying to one of our service academies. 🇺🇸\n\nFor more information visit: https://t.co/BFyBMSKp43 https://t.co/s8o4zm4oIu","date":"Wed Sep 15 20:05:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Bob was a friend, a titan in the broadcasting industry, a true public servant and a strong advocate for the community of Watertown. One of the best. Jean and I are praying for Susie and the entire Faehn family. https://t.co/sYy8X0vpEM","date":"Wed Sep 15 15:49:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My staff is in Miller today to assist constituents having problems with a federal agency. We are here to help and answer your questions. Visit https://t.co/omLsRizFbt for more information. \n\nDetails below! https://t.co/e7TEE88zIj","date":"Wed Sep 15 14:09:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"President Biden owns the Afghanistan departure debacle. We are left with many questions. Today we demand answers from @SecBlinken on the proposed path forward during the @SenateForeign hearing. https://t.co/rp5HIYeiQI","date":"Tue Sep 14 14:20:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad the U.S.-Egypt Bright Star military exercise has begun after a 3 year hiatus and that after recent events, we continue to stand by our great friend and partner Egypt.","date":"Sun Sep 12 15:05:19 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, America remembers the terrorist attacks of September 11, 2001. While 20 years has passed, we will #NeverForget the 2,977 Americans who lost their lives on 9/11 and all those who answered the call to fight terrorism and protect our country. May God bless the USA. https://t.co/k4i7aRHIJt","date":"Sat Sep 11 12:31:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My full statement on President Biden’s executive orders on vaccine mandates ⬇️ https://t.co/GYgyRr3wfe","date":"Fri Sep 10 18:34:56 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Chipman’s out-of-touch, anti-gun views threatened the 2nd Amendment rights of law-abiding South Dakotans. It’s important for the president to now nominate an individual who will respect #2A, reject burdensome regulations &amp; work with our nation’s sportsmen. https://t.co/8cpdY3V8uQ","date":"Thu Sep 09 19:56:41 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It’s time to restore Mandatory Country of Origin Labeling (MCOOL) once &amp; for all. This is an important step in restoring market integrity for consumers &amp; cattle producers. For too long, packers have skewed this market in their favor. Now, we take it back. https://t.co/A1WFAyuzkk","date":"Wed Sep 08 22:22:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good to be in Huron today for the South Dakota State Fair! Great chance to catch up with so many folks and see lots of family and friends! https://t.co/43eNhSVU0j","date":"Fri Sep 03 21:37:30 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’re at the South Dakota State Fair! Stop by and say hi! https://t.co/LHjnoPIu37","date":"Fri Sep 03 17:22:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Please keep the service members  who lost their lives today in your thoughts and prayers. Please also remember their families during this very difficult time. We stand in solidarity with the men and women who wear the uniform so proudly and so bravely while in harm’s way.","date":"Thu Aug 26 19:36:36 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to the Sioux Falls @LittleLeague team today!","date":"Wed Aug 25 21:01:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In April, I raised my concerns about a withdrawal of U.S. forces in Afghanistan based on an arbitrary date rather than conditions on the ground. Unfortunately, our fears have become reality. President Biden bears the responsibility for the disastrous situation in Afghanistan. https://t.co/XmjmKYDGmz","date":"Wed Aug 25 18:00:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota is home to some of the best cattle producers in the world. Great to be at the annual @RCALFUSA convention. The time has come for mandatory country of origin labeling. https://t.co/sKiJO3535C","date":"Wed Aug 25 14:07:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We continue seeing images of U.S. military equipment in the hands of Taliban terrorists. It’s critical that @DeptofDefense secures our assets in Afghanistan. I joined @SenRubioPress &amp; others calling for a full account of U.S. military equipment left behind in Afghanistan. https://t.co/x6ScSlY2t4","date":"Tue Aug 24 14:30:22 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The situation in Afghanistan is worsening by the day. The Biden administration must make the safe evacuation of Americans still stuck in Afghanistan its top priority. I’m praying for those in harm’s way and for our service members protecting innocent lives.","date":"Mon Aug 23 22:45:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"One of the best parts of my job is listening to and talking with South Dakotans, young and old! 3-month-old Rayna Sprengeler sure did steal the show at @TheBCFair. https://t.co/SpVtfUuMmU","date":"Fri Aug 20 18:06:56 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great time yesterday in Aberdeen at the Brown County Fair. It was nice seeing so many folks. Anyone who has been to the Brown County Fair knows that a Tubby Burger is a must-have. So delicious! The fair runs through Sunday so be sure to stop by this weekend! https://t.co/UdBE0X3VfH","date":"Fri Aug 20 17:13:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Power outage in Pierre wouldn’t stop the South Dakota Veteran Service Officer Benefit School. Always appreciate visiting with the VSOs and hearing about the work they’re doing for veterans around the state - even if it was in the dark! https://t.co/aCGREOHSJ2","date":"Tue Aug 17 02:04:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We recognize that there were no good or easy choices in Afghanistan, but that does not relieve this administration from their completely failed policy. America’s first priority must be saving human life now and in the years to come.","date":"Mon Aug 16 19:40:19 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My statement on the infrastructure bill: https://t.co/NEvcFvHiZx","date":"Tue Aug 10 13:30:21 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thank you to the South Dakota Stockgrowers Association for your support of the USA Beef Act! https://t.co/M2HlXJyVy3","date":"Mon Aug 09 14:55:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Check out today’s @RCJournal to  learn more about the USA Beef Act. \n\nOnly beef born, raised &amp; harvested in the United States should receive the “Product of USA” label. 🇺🇸 https://t.co/qjgg9rujy0","date":"Sat Aug 07 21:14:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It is great to see Yankton and communities across South Dakota recognize heroes who received the Purple Heart. #PurpleHeartDay https://t.co/JkCy6HdDP0","date":"Sat Aug 07 18:19:49 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On #PurpleHeartDay, we honor the men and women who were wounded or killed while serving our country. God bless our American heroes who have sacrificed their lives in defense of our nation. https://t.co/IPreba8AMO","date":"Sat Aug 07 14:30:14 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hoping everyone has a safe and fun time at the 81st Sturgis Motorcycle Rally! #Sturgis2021 https://t.co/3zgxXxQmrr","date":"Fri Aug 06 20:28:26 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"WATCH: White House Press Secretary Jen Psaki even said affixing the “Product of USA” label on foreign beef is “outrageous.” \n\nIt’s time to pass the USA Beef Act to make certain the “Product of USA” label only applies to beef born, raised &amp; harvested in the United States! https://t.co/eTzjj0q2KV","date":"Thu Aug 05 23:18:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Consumers deserve to know where their beef comes from &amp; transparent labeling supports American farmers &amp; ranchers. That's why I've introduced the USA Beef Act.\n \nOnly beef born, raised &amp; harvested in the U.S. should receive the \"Product of USA\" label. https://t.co/SLfPkAel4y","date":"Thu Aug 05 20:52:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday to the @USCG! Thank you for 231 years of service. Semper Paratus. https://t.co/aUiROxIIaG","date":"Wed Aug 04 13:00:34 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"So far this year, we’ve responded to more than 23,000 South Dakotans who had questions or needed assistance. \n\nIf you need help, please reach out to one of my offices: \n📞Pierre: (605) 224-1450\n📞Rapid City: (605) 343-5035\n📞Sioux Falls: (605) 336-0486\n📞Aberdeen: (605) 225-0366 https://t.co/kpfcn0lOFQ","date":"Tue Aug 03 21:30:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congrats @ChrisNilsen2 on your🥈- South Dakota is proud!","date":"Tue Aug 03 13:28:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Inflation DOES matter to South Dakotans who are paying more for everyday goods! https://t.co/iHOya6dO74","date":"Mon Aug 02 19:27:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our internship program is an incredible opportunity for students to experience a deeper understanding of the political process. I encourage interested college students to apply for this fall semester today! \n \nMore information on how to apply visit: https://t.co/ogqSzwm67t https://t.co/o2swxS5VYO","date":"Mon Aug 02 13:39:15 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On #NationalInternDay, I’d like to thank the interns in our D.C. &amp; state offices for their hard work this summer. We’ve truly appreciated Andrew, Arden, Matt S., Courtney, Matt Y., Holly &amp; Madison.\n\nInterested in applying for a fall internship? Click here: https://t.co/Kf80Q19Pop https://t.co/83TU0SzPx2","date":"Thu Jul 29 17:42:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Secretary Kendall will be a steadfast advocate for our Airmen. I look forward to working with Secretary Kendall to support Ellsworth Air Force Base, the B-21 bomber program and a strong nuclear deterrent.\nhttps://t.co/UoVgbe04aS","date":"Thu Jul 29 14:38:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Mike Enzi was a true statesman, good colleague and real friend. A man of strong faith, I got to know Mike on a deeper level each week at Senate Prayer Breakfast. Jean and I are praying for his wife Diana and the entire Enzi family.","date":"Tue Jul 27 13:44:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The numbers speak for themselves. Encounters at the southern border in 2021:\nJan: 78,442\nFeb: 101,095\nMarch: 173,265\nApril: 178,850\nMay: 180,641\nJune: 188,829\n\nThe #BidenBorderCrisis continues to worsen every month. We must act now to protect our nation &amp; secure the border. https://t.co/Xd6iPkbp0u","date":"Mon Jul 26 13:37:30 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"David Lust was a true public servant, a brilliant legal mind and a devoted family man. His thoughtful leadership made a lasting impact on the community of Rapid City and the state of South Dakota. Jean and I lift up Becky and their four children in prayer.","date":"Fri Jul 23 23:32:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you’re in Sioux Falls this weekend, I’d encourage you to stop by the Tomb of the Unknown Soldier replica to honor our fallen heroes. https://t.co/mMOMUoJODm","date":"Fri Jul 23 18:00:21 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to see many of our nation’s Airmen at Ellsworth Air Force Base for world-class training! https://t.co/Q0HbWxAJzg","date":"Fri Jul 23 13:50:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"#FY22NDAA is a prime example of Congress putting politics aside &amp; achieving results for service members &amp; their families. I’m pleased  our bill contains measures supporting South Dakotans. I look forward to moving this bill across the finish line. @SASCGOP https://t.co/WAWW14ZPM5","date":"Thu Jul 22 21:14:24 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our largest city is home to #FallsPark and the rushing waters of the Big Sioux River. Enjoy your #ParkandRecreationMonth right in the heart of @CitySiouxFalls! https://t.co/kbyCgci8nO","date":"Thu Jul 22 18:30:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Biden administration’s lack of sanctions enforcement against the Nord Stream 2 pipeline is not only poor U.S. foreign policy but also makes our European allies more dependent on Putin. https://t.co/IxS9CEZ7sn","date":"Thu Jul 22 14:15:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Consumers deserve lower-cost, lower-carbon choices at the pump. Our bill will strengthen rural economies by allowing low-carbon fuels to be sold year round. Read more:\nhttps://t.co/ieNWGtmSL5","date":"Wed Jul 21 13:25:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"TUNE IN: I’m providing remarks at today’s Subcommittee on Housing, Transportation &amp; Community Development hearing. Looking forward to hearing from Sharon Vogel of the Cheyenne River Sioux Tribe Housing Authority on safety issues in Native American housing. https://t.co/RjCBrgWBSh","date":"Tue Jul 20 18:48:53 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota's official nickname is the Mount Rushmore State. Celebrate #ParkandRecreationMonth this July at @MountRushmoreNM! https://t.co/PfYGnj69gI","date":"Tue Jul 20 15:13:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":".@BadlandsNPS in South Dakota is a great place for visitors to hike, spot wildlife and see beautiful sunsets like this. #ParkandRecreationMonth https://t.co/rHRgglHbD1","date":"Sun Jul 18 14:23:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"July is #ParkandRecreationMonth. Take some time to go outside and enjoy South Dakota’s beautiful recreation areas like those in @CusterStatePark! https://t.co/yXm82uUaxW","date":"Fri Jul 16 17:46:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations, Jody! Well-deserved!","date":"Wed Jul 14 16:45:22 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It is completely inappropriate &amp; immoral for federal taxpayer dollars to be used to fund abortions. Our bill will help protect life by stopping the flow of taxpayer money to institutions that perform abortions. https://t.co/idCDjlyAFl","date":"Tue Jul 13 18:38:30 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Fourth of July, South Dakota! 245 years ago, the Continental Congress adopted the Declaration of Independence, officially declaring our nation independent from Great Britain. Today, we celebrate our freedom and thank all those who have sacrificed to defend it. 🇺🇸 https://t.co/VmCxXXKprd","date":"Sun Jul 04 12:30:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For years, we’ve called on the USDA to stop foreign beef from receiving the ‘Product of the U.S.A.’ label. Only products born, raised and slaughtered in the USA should receive this label. Consumers deserve to know the source of their food. This is a step in the right direction.","date":"Fri Jul 02 15:29:47 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Taiwan is the 10th largest trading partner of the U.S. and a good friend of our country. I joined a bipartisan letter encouraging U.S. Trade Representative, Ambassador Katherine Tai, to reconvene free trade agreement talks with Taiwan.\n \nhttps://t.co/jaxOxWAgEZ","date":"Thu Jul 01 18:14:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I sent a letter with @SenJoniErnst urging President Biden to support our South Dakota corn farmers and the biofuels industry by not undercutting the Renewable Fuel Standard. https://t.co/HxWtMXFF9y","date":"Thu Jul 01 15:45:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For many Americans, home ownership is part of the American dream. I intro'd legislation w/ Sen. Smith to permanently reauthorize a 502 lending pilot program which partners w/ Native CDFIs to help Native American families access affordable home loans. https://t.co/1G9AGzohOx","date":"Tue Jun 29 20:42:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Cattle producers, grocers and consumers need to come together to fix the ongoing challenges in the beef industry. https://t.co/67UAUTz19I","date":"Mon Jun 28 21:35:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There needs to be more competition in the beef industry. On Friday, we brought together a team of grocers and cattle producers in Fort Pierre to discuss the ongoing crisis in the beef market. https://t.co/j9brn8i9G2","date":"Mon Jun 28 20:43:41 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Republicans protected the filibuster when we were in control, &amp; I hope that the Dem colleagues that I've talked to will stick to their guns &amp; not eliminate the filibuster. \n\nLong term, I think it's better for the country if we continue to work hard &amp; find consensus. https://t.co/1fMb5EaJX0","date":"Sat Jun 26 17:15:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"World-leading research is being conducted nearly one mile below ground at the Sanford Underground Research Facility in Lead. I’m proud to have worked on this project as governor, and it’s exciting to see SURF still thriving today. The future is bright!\n\nhttps://t.co/l4Di44h0AE","date":"Sat Jun 26 14:21:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There were many issues with the Dems’ failed bill to federalize state election systems, including provisions to make taxpayers fund federal elections for candidates they may not support. More from my @postlive conversation here ⬇️ https://t.co/kdl1anLMpZ","date":"Fri Jun 25 19:25:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The cattle market is in crisis. Cattle producers are barely making enough to break even &amp; consumers are paying an overinflated premium for beef at the grocery store. I spoke about this &amp; more on @postlive this week. ⬇️ https://t.co/pfyXOQPNqd","date":"Fri Jun 25 17:32:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"S.1 would have been a major incursion on voting rights that are normally handled by the states. I voted against moving forward on a bill that would:\n✖️relax voter ID laws\n✖️put taxpayer dollars toward political campaigns\n✖️force states to allow felons to vote\n✖️weaponize the FEC https://t.co/banUiT6w7T","date":"Thu Jun 24 20:15:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We're building momentum 📈! Our bill to give USDA the tools to investigate anticompetitive processes in the meat processing industry now has bipartisan support in both the House &amp; Senate. Let's get this to the president's desk. https://t.co/b7SyoydaDv","date":"Thu Jun 24 19:50:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I joined @postlive yesterday to discuss the cattle market crisis, ransomware concerns, the infrastructure package and voting rights. Watch our conversation here ⬇️\n\nhttps://t.co/m9I497241o","date":"Thu Jun 24 19:13:13 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"He keeps giving us reasons to defend the Second Amendment.","date":"Thu Jun 24 17:05:22 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to have dinner tonight with Justin Tupper, from St. Onge, SD and VP of @uscattlemen, before he testifies tomorrow at the Senate Ag Committee hearing on the cattle market. Tonight, we had steak for dinner but really, #WeHaveBeefWithPackers https://t.co/ESmnZY43SF","date":"Wed Jun 23 01:12:49 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to Col. Joseph Sheffield as he returns to Ellsworth AFB as commander of @28thBombWing. I look forward to working together as we prepare for the B-21. Thank you to Col. David Doss for his service as commander and we wish him the best of luck in his next endeavor. https://t.co/peH1U1jZKY","date":"Tue Jun 22 14:09:23 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy #NationalDairyMonth! Milk is the state drink of South Dakota, adopted in 1986. We appreciate all of the work our dairy farmers do to keep us healthy. https://t.co/L9hkYx0eiY","date":"Mon Jun 21 13:43:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy #FathersDay to all the dads, grandads and father figures out there! https://t.co/yfUly0p8x1","date":"Sun Jun 20 13:26:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, the Senate unanimously approved &amp; POTUS signed into law legislation making Juneteenth a federal holiday. Today and every June 19th, we celebrate the end of slavery in the United States and commit to protecting equal justice under the law. https://t.co/1I3jhm0ej9","date":"Sat Jun 19 12:19:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to Britta, Carson &amp; Jillian of Yankton High School on the selection of their project for the @NationalHistory virtual showcase. Their project, The Unbreakable Code, looks at the contributions of Native American code talkers. ⬇️ https://t.co/3ugRtG0i0i","date":"Fri Jun 18 14:21:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"June is #NationalDairyMonth. South Dakota has over 141,000 dairy cows that produced over 3.1 billion pounds of milk in 2020. Take time this month to recognize the hardworking dairy farmers in our state. https://t.co/FMeuegM4Yi","date":"Thu Jun 17 18:13:15 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see the Senate Agriculture Committee announce it will hold a hearing on June 23 to examine anticompetitive behavior in the cattle market. This is long overdue! #WeHaveBeefwithPackers https://t.co/SQWR3ynv3K","date":"Thu Jun 17 15:53:13 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":".@DakotaState is working to fill the cybersecurity workforce shortage in this nation. I was glad to bring together @CYBERCOM_DIRNSA, DSU President @josegriffiths, &amp; DSU's Dr. Josh Pauli at @US_CYBERCOM &amp; @NSAGov HQ to discuss the future of cybersecurity. https://t.co/GIEr2RUgD9","date":"Wed Jun 16 14:45:20 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Momentum is building. Great to have @SecVilsack’s support for our legislation to establish a meatpacking investigator and I'm glad to help @SenatorTester &amp; @ChuckGrassley in this effort. Consumers and ranchers are counting on us. #WeHaveBeefwithPackers https://t.co/ZK1dFNvYbJ","date":"Wed Jun 16 13:35:36 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our fight for fairness in the meat packing industry continues.\n\nI introduced a bill w/ @SenatorTester &amp; @ChuckGrassley to strengthen the USDA’s ability to investigate harmful anticompetitive behavior in the meat packing industry. #WeHaveBeefwithPackers\nhttps://t.co/CwRtNAXGuR","date":"Tue Jun 15 17:03:28 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The RESPECT Act unanimously passed the Senate. We are one step closer to removing 11 laws that are discriminatory toward Native Americans from our federal code. I look forward to working with my colleagues in the House to get this to the president’s desk. https://t.co/1YlRXXHjir","date":"Mon Jun 14 18:39:57 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we are celebrating 246 years of the #USArmy. Soldiers have defended our great nation dating all the way back to the Revolutionary War. Thank you to all those who have served and are currently serving in the @USArmy. https://t.co/yuVDr5eaFq","date":"Mon Jun 14 16:21:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy #FlagDay, South Dakota! Since 1777, the stars and stripes have been a symbol of our freedom. Today, we celebrate our flag and honor all those who have fought to defend it. 🇺🇸 https://t.co/uZC1MsOYof","date":"Mon Jun 14 13:14:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota has a proud history of women warriors, including U.S. Air Force Capt. Ola Rexroat. She was the only Native American Women Airforce Service Pilot (WASP) to serve in WWII. Capt. Rexroat’s story continues to inspire. #WomenVeteransDay\nhttps://t.co/aoYP1MHExV","date":"Sat Jun 12 17:14:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On #WomenVeteransDay, we thank all of the brave women who have served our country. 73 years ago today, Pres. Truman signed the Women's Armed Services Integration Act into law, finally allowing women to permanently serve in our Armed Forces. 🇺🇸 https://t.co/YAu2w2YRvI","date":"Sat Jun 12 14:31:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve said it before and I’ll say it again – the B-21 is one badass weapon of war and peace. Ellsworth Air Force Base being named the official home of the B-21 Raider bomber is a generational accomplishment for the communities of Box Elder and Rapid City. https://t.co/IkCjkmww57","date":"Thu Jun 10 19:03:07 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Going live on ⁦@kotatweets⁩ evening news - tune in! https://t.co/miuiQwYamP","date":"Wed Jun 09 23:30:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Going LIVE on @keloland evening news. Tune in!","date":"Wed Jun 09 22:55:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"https://t.co/rmgm3g6Bua","date":"Wed Jun 09 22:31:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨🚨NEW: I am pleased to announce that Ellsworth AFB has been officially designated as the first home of the B-21 Raider bomber.\n\nSouth Dakota will continue to play a critical role in our national defense for decades to come. https://t.co/1eDCGVQ2nL","date":"Wed Jun 09 22:30:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"UPDATE: Emergency Conservation Reserve Program (CRP) grazing and haying practices have been modified since South Dakota last experienced severe drought conditions. Learn more ⬇️ https://t.co/uGCaGq1Vw8","date":"Tue Jun 08 22:58:33 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’ve seen tremendous grassroots support from across the nation for addressing meatpacker concentration issues. Our letter is just one step in our effort to restore competition in the marketplace &amp; protect consumers. #WeHaveBeefwithPackers https://t.co/LGV97zYxjf","date":"Tue Jun 08 21:27:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On this day 77 years ago, 156,000 Allied troops heroically stormed the beaches of Normandy, successfully turning the tide in WWII. We will always remember their tremendous courage and sacrifice. #DDay77 https://t.co/guAHqDQXZD","date":"Sun Jun 06 18:04:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"@WarrenDavidson @RepHerrell\n@TomReedCongress @RepAndyBarr @RepGosar\n@replouiegohmert @DrNealDunnFL2 @RepMaryMiller @RepRoKhanna @RepJasonSmith @RepBobGood @repmarkpocan","date":"Wed Jun 02 18:24:28 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨NEW: We just sent a bipartisan, bicameral letter from 26 Members of Congress calling on the DOJ to investigate the meatpacking industry to determine if antitrust violations exist. It's time we get to the bottom of this for U.S. consumers &amp; cattlemen.\nhttps://t.co/QSZylVowA2 https://t.co/3njPTPGzwy","date":"Wed Jun 02 18:24:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thank you to the bipartisan members who signed onto this letter: @SenBooker @SteveDaines @SenLummis @SenatorTester @HawleyMO @SenAngusKing\n@SenHydeSmith @RonWyden\n@ChuckGrassley @SenatorWicker @SenJoniErnst\n@SenatorBraun @SenMarkKelly\n@SenCortezMasto","date":"Wed Jun 02 18:24:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This Memorial Day, please remember and honor the memory of those who died fighting to defend the freedoms we hold so dear. #MemorialDay2021 https://t.co/kmLaPmmuWs","date":"Mon May 31 11:31:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"“As beef demand has been strong, both domestically &amp; in the export market, ranchers &amp; feedyards are struggling to find strength in the fed cattle market.” \n\n📢Ask your Member of Congress to join our letter to the DOJ: 202-224-3121. \n#WeHaveBeefwithPackers\nhttps://t.co/dq39UGC2ij","date":"Fri May 28 14:12:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Grateful for @govkristinoem's leadership on this issue. #WeHaveBeefwithPackers","date":"Thu May 27 22:06:09 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see @SenateAgGOP Ranking Member @JohnBoozman call for a hearing on the cattle industry. Much needed!\n#WeHaveBeefwithPackers https://t.co/IIJSOFvnb8","date":"Thu May 27 22:00:22 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There are many interesting moves being made in the field of CCs. It very much is the Wild West of finance. They make new things possible, which isn’t always a good thing. They can have consequences no one expected. This field deserves a great deal of attention going forward.","date":"Thu May 27 19:51:08 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In short, the more miners there are, the harder it is to mine bitcoins. Since the best way to mine is to simply use more computations, there is an incentive to pool as much effort into mining as possible, simply to make sure your pool has an advantage over other miners.","date":"Thu May 27 19:51:07 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This means that, as bitcoin gets more valuable, more people mine, mining gets harder, it takes more computations and more electricity to mine a bitcoin. Some of you may be familiar with @elonmusk recent statement about bitcoin’s carbon footprint.","date":"Thu May 27 19:51:07 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"So how does this relate to Colonial Pipeline? Bitcoins only exist as data. They can be tied to digital wallets rather than a specific person’s identity, which means people believe they can receive and spend them anonymously- perfect for secret transactions like ransoms.","date":"Thu May 27 19:51:07 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The first person to win a block gets a prize of bitcoins. Since the second step in forming a block is essentially up to chance, the most effective way to mine is simply to throw more computation at the problem, verifying as many blocks as possible as fast as possible.","date":"Thu May 27 19:51:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Despite the randomness, it's more like they’re getting paid a fee to maintain ledgers than mining or creating bitcoins. Miners provide proof that they’ve done work to contribute to the chain in exchange for compensation (in bitcoins), rather than making bitcoins themselves.","date":"Thu May 27 19:51:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The interesting thing is that you can make it easier or harder to form new blocks if you make the nonce higher or lower. And for bitcoin, the difficulty is adjusted every 2016 blocks so that the rate of formation of new blocks is constant.","date":"Thu May 27 19:51:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Since #bitcoins are decentralized, there isn’t a government or bank to maintain the system, which means there needs to be a different way. People who verify transactions are bitcoin miners, and the process of verification is fundamental to how they make (or mine) new bitcoins.","date":"Thu May 27 19:51:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"You may ask “why not just guess 000…0001 for your hash, if the goal is to get a hash below the target nonce?” The answer: your guess is put through what is basically a randomizing equation based on several inputs, like the timestamp. Guessing your hash ahead of time is #noncense","date":"Thu May 27 19:51:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In short, mining a new bitcoin is a two-step process. First, you need to verify a block’s worth of transactions, then you need to guess a hash (a number). Your guess is compared to a target (called a nonce) and if your guess is below the nonce then you form a block.","date":"Thu May 27 19:51:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This blockchain of transactions forms a distributed ledger that is difficult to modify and easy to verify (in theory); a ledger that is maintained collectively on a network with specific protocols to verify each new block in the chain, meaning that bitcoin exchanges are secure.","date":"Thu May 27 19:51:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Using bitcoin as an example: bitcoins exist in digital ledgers, but to prevent fraudulent exchanges, transactions are recorded in encrypted blocks. Each block points at the previous block and has a timestamp. Go where each block points and you get a chain, called a “blockchain”.","date":"Thu May 27 19:51:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"These protocols revolve around cryptography (for computers, this is the use of math to code information) hence “crypto”currencies. However, someone needs to actually verify each new block in the chain to keep the system running smoothly.","date":"Thu May 27 19:51:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Some people decided that, if the commodity backing a currency doesn’t matter, then why should money need to be a physical object and why should you need a government (or bank) to back money? From there, some programmers started developing cryptocurrencies (CCs).","date":"Thu May 27 19:51:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"CCs exist only in digital ledgers and wallets rather than as physical objects like dollar bills. Like all fiat currencies, they have value only because people agree they do, but CCs in general lack the backing of a government or central bank.","date":"Thu May 27 19:51:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The software used to make new CCs exists and is publicly available, which means that developing a new CC can be done in as little as a few hours. Honestly, it looks like a return to the days when each bank printed their own notes.","date":"Thu May 27 19:51:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Some history: in the last century governments have moved away from commodity currencies (such as gold) to fiat currencies (such as Federal Reserve notes) cementing the idea that money can have value just because people agree it does.","date":"Thu May 27 19:51:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Software developments, however, mean that they don’t need to bother with masks and voice modulators. They can issue a ransom and request payment with a cryptocurrency (CC) (like bitcoin) rather than exchange a briefcase full of cash.","date":"Thu May 27 19:51:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hostage and ransom payments are a practice that has been applied in different contexts for thousands of years, ranging from prisoner exchanges to kidnappings. Today, a person collecting a ransom payment does not want their identity publicly tied to a ransom.","date":"Thu May 27 19:51:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thread: Recently, I tweeted about the Colonial Pipeline ransomware attack. Since then, the Colonial Pipeline network has returned to normal operations, but I realize that there was one question I didn’t answer. Specifically: how do ransomware ransoms get paid?","date":"Thu May 27 19:51:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The growing disparity between beef prices at the grocery store &amp; live cattle prices is hurting both consumers &amp; cattlemen.\n\n📢Call your Member of Congress &amp; ask them to join our letter to the DOJ: (202) 224-3121.\n#WeHaveBeefwithPackers https://t.co/mKq0Ov3RFI","date":"Thu May 27 17:40:24 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to the NFL’s all-time leading scorer, \n@adamvinatieri. Looking forward to seeing you next fall in the fields of South Dakota!\n\n#GOAT #GoJacks #SDProud #GreatFacesGreatPlaces","date":"Wed May 26 21:59:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just saw this photo of a homework assignment from, Trace, a 10-year-old from Kansas who explains the importance of the #beefmarket to American consumers and producers.\n\n📢Call your Member of Congress &amp; ask them to join our letter to the DOJ: (202) 224-3121.\n#WeHaveBeefwithPackers https://t.co/5JYJ11gIJP","date":"Wed May 26 18:13:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"💯% agree, @ChuckGrassley. The Ag Committee should hold a hearing on packer concentration &amp; work to pass the 50-14 bill. #WeHaveBeefwithPackers","date":"Wed May 26 16:55:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"📃🖋️Thank you to @SenBooker, @SteveDaines, @SenatorTester, @SenLummis, @HawleyMO, @SenAngusKing, @WarrenDavidson, @RepHerrell, @TomReedNY23, @RepRickAllen, @RepAndyBarr, @RepGosar, &amp; @replouiegohmert for signing onto my letter with @SenTinaSmith to the DOJ.\n#WeHaveBeefwithPackers","date":"Wed May 26 14:38:52 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If our independent cattle producers get run out of business, the price of beef is going up 📈. We need to protect the domestic supply of live cattle available to us. #WeHaveBeefwithPackers\nhttps://t.co/PJT3ErP4FI","date":"Wed May 26 14:04:14 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I introduced legislation w/ @SenatorLujan to create a congressional charter for the National American Indian Veterans, Inc. (NAIV). NAIV serves the more than 140,000 Native vets living in the U.S. and this charter will expand their platform. https://t.co/V1bBzbnVwj","date":"Fri May 21 19:27:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is a positive development. We encourage both sides to continue down this peaceful path.","date":"Thu May 20 20:48:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Join us on Facebook Live in about 15 minutes for an informative discussion on the need to work together to solve packer concentration issues in the cattle industry. #WeHaveBeefWithPackers https://t.co/O94oucLZxv","date":"Wed May 19 22:45:41 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"☎️Call your Member of Congress and ask them to join our letter to protect consumers and cattle producers: (202) 224-3121. https://t.co/Y9VjSjXqU1","date":"Wed May 19 22:38:26 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We have a big problem: families are paying way too much for beef at the grocery store, while our independent cattle producers are going broke despite the high demand for their product. \n\nIt's time the DOJ examined the meatpacker oligopoly that continues to profit. https://t.co/yR07RksQ9G","date":"Wed May 19 22:38:25 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The far left is like a freshman in college. They went in being a science major and quickly found out that their passion was for theater.\n\nGet fully vaccinated and then ditch the mask. https://t.co/79AYc1vArD","date":"Wed May 19 17:59:50 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m joining @greta on @FCPwithGreta this morning☀️! \n\nTune in!\n📺 8AM MT on @BlackHillsFox \n📺 10AM MT on @Kotatweets\n📺 8:30AM CT on @dakotanews_now","date":"Sun May 16 13:00:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Looking forward to talking with @greta on @FCPwithGreta tomorrow morning! \n\nTune in Sunday☀️!\n📺 8AM MT on @BlackHillsFox \n📺 10AM MT on @Kotatweets\n📺 8:30AM CT on @dakotanews_now","date":"Sat May 15 21:34:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to join @SenTuberville in introducing legislation to give our state &amp; local law enforcement the ability to enforce our immigration laws, since President Biden has largely prohibited our ICE agents from doing so.  https://t.co/pIuGFHz4cX","date":"Fri May 14 15:10:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I joined 43 of my Senate colleagues in urging @POTUS to #StandWithIsrael and immediately end negotiations with Iran, following the terror attacks we’ve seen perpetrated by Iranian-backed terrorists. https://t.co/vwvyMELK3L","date":"Thu May 13 20:42:47 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🇺🇸NEW: I introduced a bipartisan resolution w/ @SenatorSinema to establish the McCain-Mansfield Fellowship, a first-of-its-kind Senate fellowship program for wounded American veterans. https://t.co/e4nrmjAJN7","date":"Thu May 13 18:40:06 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our veterans, servicemembers &amp; their families deserve full access to the educational benefits they’ve been promised. Our new bill will give the VA authority to reinstate vet benefits taken by predatory institutions &amp; improve the GI Bill Comparison Tool. https://t.co/Mz79uW6Dtz","date":"Thu May 13 16:54:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I introduced a bipartisan bill with @SenatorShaheen to support the restoration of the National WWII Memorial through the creation of a commemorative coin honoring the Greatest Generation. ➡️ https://t.co/HA1AoD5Mtt https://t.co/HEpQmHeOLp","date":"Wed May 12 21:25:30 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨South Dakotans can now apply for the Soil Health and Income Protection Program (SHIPP) through July 16. This program allows producers to improve soil health on their least profitable farmland. Learn more: https://t.co/MnsWBQWP3h","date":"Wed May 12 16:10:18 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Silence only helps bad actors. Sharing info about attacks, exploits or vulnerabilities allows us to find trends in attacks, share effective responses, and respond effectively to the fast-pace and evolving threat of cyberattack.","date":"Tue May 11 22:11:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In this rapidly evolving environment the federal government has a role to play. To start, \n@CISAgov has tools and resources available to help protect networks (https://t.co/FSv3GxbcAv) and implement best practices (https://t.co/tYjp1gMokV)","date":"Tue May 11 22:11:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The first is the rise of ransomware attacks, the second (which I plan to discuss more at a later date) is the vulnerability of critical infrastructure.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Citizens, companies, and even local and state governments are vulnerable to cyberattacks and need to be prepared in advance to deal with them.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While not a replacement for Colonial Pipeline’s full network, this waiver and several smaller lines that are in operation should buy time to restore full function. This incident illustrates two problems at once.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Ransomware has been on the rise for a long time, but increases in teleworking have exposed existing cyber vulnerabilities in many companies’ systems. We see from Colonial Pipeline that such vulnerabilities can impact even the largest companies.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Ransomware is malware that infects a computer system and locks it down, preventing it from working. It holds the system “hostage” until a ransom is paid. Pipelines aren’t unique; ransomware can target digital records, ordinary servers or even traffic lights.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The attack has caused shutdowns across their network, a problem that is exacerbated by rising demand for fuel as the economy recovers. To help combat supply issues, the Department of Transportation issued a temporary waiver to ease trucking of oil products to impacted areas.","date":"Tue May 11 22:11:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thread: You may have seen the news this weekend about the ransomware attack on Colonial Pipeline, which is responsible for providing ~45% of the East Coast’s supply of diesel, petrol and jet fuel.","date":"Tue May 11 22:11:41 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Anniversary, Jean! It’s been a blessing to have you by my side for these 43 years. Our family couldn’t ask for a better wife, mom and grandma. https://t.co/4Dinf9zZEs","date":"Thu Apr 22 15:13:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"DC Democrats reintroduced the radical Green New Deal. They continue to push for DC Statehood and they’re exploring packing the Supreme Court.\n\nIt appears the only pipe dream Democrats aren’t supporting is the Keystone XL...","date":"Wed Apr 21 20:58:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just had a call with the SD Rural Electric Association. Thanks for powering the homes, farms and businesses of your customers with reliable, affordable and sustainable electricity.","date":"Tue Apr 20 23:26:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to be in Mitchell today to chat with the rotary club. I also had the opportunity to visit virtually with the Rapid City Downtown Rotary. We had good discussions about issues critical to South Dakota and our nation. https://t.co/tyN6T7qUqV","date":"Fri Apr 09 00:57:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Praying for the United States Capitol Police Officers who were injured today and the first responders who are on the scene.","date":"Fri Apr 02 18:28:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are continuing to monitor the Schroeder Fire ravaging the Rapid City area. Praying for all those impacted and the first responders who are working to extinguish this fire. https://t.co/96gJaio0Vp","date":"Tue Mar 30 02:21:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This fire is very active and dangerous. Thank you to our first responders who are putting themselves in harm’s way. Please give them the right of way as they respond to this threat. They are the real professionals.","date":"Mon Mar 29 17:57:44 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing a blessed Passover to all those celebrating in South Dakota and around the world. Chag Sameach! https://t.co/ZsYBflLrLt","date":"Sat Mar 27 23:57:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hey @JoeBiden - come and take it. Careful, she bites too. https://t.co/NOKWlq5aQv","date":"Thu Mar 25 16:55:03 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Founding Fathers never intended for Washington D.C. to be a state.\n\n#DCStatehood is really about packing the Senate with Democrats in order to pass a left-wing agenda.\n\nJust look at the DC voter registration data: \n🔵 76.4% Democrat\n🔴 5.7% Republican","date":"Mon Mar 22 21:57:46 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In Colorado, some are celebrating  #MeatOutDay and cutting meat out of their diet today.\n\nIn South Dakota, every day is #MeatInDay unless, of course, it’s a Friday during lent. Celebrating today by teaching Beckett and Cohen the art of grilling South Dakota beef! https://t.co/rA1UcwMhmA","date":"Sat Mar 20 23:46:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"@AustinGossSD Congratulations!","date":"Sat Mar 20 16:00:08 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I am deeply troubled by the Senate’s vote today to confirm Xavier Becerra as the next Secretary of Health and Human Services. Mr. Becerra’s lack of health care experience and extreme views make him the wrong person to lead our nation’s health department—now or ever!","date":"Thu Mar 18 20:18:51 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Russia and Communist China are not acting as our friends. Both are working to undermine the US and the Western Hemisphere. We must work with allies in the region and continue to support democracy.\n\nhttps://t.co/Ibv96VKyst","date":"Thu Mar 18 16:22:20 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Theft of intellectual property can never be tolerated. Any discussions between @POTUS and China should address this serious issue.\n\nhttps://t.co/vT7KwYeqdE","date":"Wed Mar 17 18:16:57 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Second Amendment guarantees the right to own and operate firearms. I'll continue to work with my colleagues to oppose efforts to undermine YOUR constitutional rights.\n\nhttps://t.co/qM2yO3rdrZ","date":"Tue Mar 16 18:55:54 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Imagine how the Democrats would be sounding the alarm if a Republican were still in office!🧐\n\nhttps://t.co/GbhMESIELu","date":"Tue Mar 16 16:53:21 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"#IRS begins delivering another round of Economic Impact Payments. The 3rd round of payments will be based on your latest processed tax return from either 2020 or 2019. https://t.co/Wf4fHGGEdL #COVIDreliefIRS\n\nhttps://t.co/Wf4fHGGEdL","date":"Tue Mar 16 13:11:53 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is good news.","date":"Mon Mar 15 22:07:11 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If the Biden admin continues to pursue an anti-energy agenda, energy prices will continue to increase.","date":"Mon Mar 15 21:17:16 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The EPA adopted rules in 2019 which allowed E15 to be sold year round. This increase in the use of E15 is great news for consumers, farmers and the environment. I pushed the EPA on this directly, and urge Administrator \n@Michael_S_Regan to keep the current E15 rules in place.","date":"Fri Mar 12 22:00:05 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I couldn't agree more.","date":"Fri Mar 12 21:58:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Excellent conversation - thank you for being involved!","date":"Thu Mar 11 21:42:58 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"💉Skip quarantine and testing if exposed to someone who has #COVID19 but is asymptomatic.\n\nLet's keep on using our South Dakota common sense.","date":"Thu Mar 11 14:32:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @CDCgov has issued new guidelines. Vaccinated individuals can: \n\n💉Visit other vaccinated people indoors without masks or physical distancing.\n\n💉Visit indoors with unvaccinated people from same household without masks or physical distancing.","date":"Thu Mar 11 14:32:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Here is the current timeline for when you can expect to get the #COVID19Vaccine, check out the chart here👇 index or visit: https://t.co/3iVrWuRmUB https://t.co/cuotOjfOsy","date":"Thu Mar 11 14:32:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As a former governor, I would never cede authority of SD's tax code to DC Democrats. Taking this “free” money has a major claw back: states aren't allowed to cut their own taxes! Apparently, they are allowed to raise taxes during a pandemic!","date":"Wed Mar 10 22:06:23 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @SDCoyotesWBB are advancing to the NCAA tournament.🏆 Congrats on @thesummitleague championship! #GoYotes🐾","date":"Tue Mar 09 23:44:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck today, women! #GoYotes \n\nhttps://t.co/8ZfpmBcEiV","date":"Tue Mar 09 16:10:21 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The legislation passed today is not targeted and is not specific, but rather includes many giveaways to left-wing causes.","date":"Sat Mar 06 17:45:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My colleagues and I offered a reasonable conservative alternative that targeted relief to those directly impacted by the pandemic and was one-third the price. Unfortunately, Democrats were unwilling to compromise.","date":"Sat Mar 06 17:45:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is the first bill that did not pass either chamber with bipartisan support. In fact, it had bipartisan opposition in the House of Representatives.","date":"Sat Mar 06 17:45:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Up until this point, we have always found a way to work together on a bipartisan basis to provide COVID-19 relief for the American people. None of the previous five pandemic relief bills received fewer than 90 votes in the United States Senate.","date":"Sat Mar 06 17:45:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Democrats used the guise of COVID-19 relief to further their left-wing agenda while putting our nation deeper into debt. I voted against this partisan $1.9 trillion spending bill that reads more like a liberal wish list than targeted pandemic relief.","date":"Sat Mar 06 17:45:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tomorrow is the start of @thesummitleague basketball tournament. Good luck to both South Dakota teams playing in the tournament. I know who I’m rooting for this weekend! ￼\n \nRetweet for #GoJacks\nLike for #GoYotes https://t.co/B1JZPnD6Gi","date":"Fri Mar 05 17:08:49 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Understand completely!","date":"Fri Mar 05 15:01:40 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today is #WorldBookDay and it is also #ReadAcrossAmericaWeek. Reading is extremely important, as it develops lifelong skills from vocabulary to comprehension. Besides, reading is fun! I am proud of our SD schools and teachers for helping develop reading skills in our SD youth.📚","date":"Thu Mar 04 21:24:18 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"https://t.co/qIufE87BgP","date":"Wed Mar 03 20:50:45 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"https://t.co/UiqXCpUJa3","date":"Wed Mar 03 19:28:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @FoxFriendsFirst this morning to discuss the attacks on an airbase in Iraq hosting U.S. troops. We must do everything in our power to protect the men and women who wear the uniform of the United States of America. https://t.co/69w5fF0pcM","date":"Wed Mar 03 13:18:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota is home to 35 public power utilities. Our state is in good hands with companies like @HeartlandPower leading the way at this week's American Public Power Association Legislative Rally. #APPA\n@publicpowerorg #communitypowered","date":"Tue Mar 02 16:37:36 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"$135 million for the National Endowment for the Humanities \n\n$135 million for the National Endowment for the Arts \n\n$200 million for the Institute of Museums and Library Services","date":"Tue Mar 02 01:53:11 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"How are Democrats using taxpayer money in their $1.9 trillion COVID relief bill? \n\nNot to target aid directly to those impacted by the pandemic. \n\nThread👇 https://t.co/Yw4QSqwqiP","date":"Tue Mar 02 01:53:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"$112 million for the Silicon Valley Subway \n\n$1.5 billion for Amtrak \n\n$4 billion for subsidizing farmers from minority communities \n\n$12 billion for foreign aid","date":"Tue Mar 02 01:53:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"$1.5 million for the New York Seaway International Bridge\n\n$50 million for ‘Climate Justice’ \n\n$50 million for family planning funding, without Hyde protections","date":"Tue Mar 02 01:53:10 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"House Democrats passed COVID-19 relief legislation that would put the American taxpayers $1.9 trillion further into debt. I joined @TeamCavuto on @FoxNews to explain my opposition to their proposal. This isn't targeted pandemic relief, but rather a giveaway to left-wing causes. https://t.co/44jQQzCimO","date":"Sat Feb 27 22:37:54 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good Saturday morning! Looking forward to joining @TeamCavuto on @FoxNews at 9 AM CT/8 AM MT. \n\nTune in! 📺","date":"Sat Feb 27 13:25:30 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Welcome to Twitter, Gov! Looking forward to working with you on meat labeling, biofuels and other issues critical to ag in SD.","date":"Thu Feb 25 18:00:53 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy National #FFAWeek. The @NationalFFA plays an important role in the education and development of our South Dakota youth. @SD_FFA continues to shape our ag leaders and the future of agriculture in our great state. https://t.co/NzQ3uQrSl4","date":"Thu Feb 25 15:58:47 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is great news for South Dakotans and Americans!","date":"Wed Feb 24 21:45:59 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"@AustinGossSD Welcome to the neighborhood!","date":"Wed Feb 24 18:17:41 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last Level 3? Never. \nWe need to get to the bottom of this. In the meantime, please conserve energy.","date":"Tue Feb 16 23:06:46 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to participate in the Veteran’s Parkway ribbon cutting ceremony today. This project will improve highway safety and will provide opportunities for economic growth in Sioux Falls. https://t.co/vV07nhrBQB","date":"Mon Feb 15 23:16:02 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Valentine’s Day, Jean! Thanks for being you and for being mine. https://t.co/J47GXeijTK","date":"Sun Feb 14 16:29:28 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It is now time to get back to the work of the American people.","date":"Sat Feb 13 21:37:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"After carefully listening to every minute of the presentations made by the House Managers and the former president’s legal team, I am convinced that the Senate does not have jurisdiction to render a judgement against the former president. Therefore, I voted not guilty.","date":"Sat Feb 13 21:37:37 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve said all along that impeaching former President Trump is a moot point as the Constitution is clear that removal from office is the primary purpose of impeachment. Our Founding Fathers intended impeachment to remove public officials from office, not to punish private citizens","date":"Sat Feb 13 21:37:36 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks for having me, @GovMikeHuckabee. The #KeystoneXLPipeline is the most efficient and environmentally sound way to transport petroleum. This decision by @POTUS not only kills thousands of jobs in SD, but also puts the environment at greater risk.\nhttps://t.co/j1LxJhENUH","date":"Tue Feb 09 14:19:20 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Chinese Communist Party may have stolen the personal data of 80% of American adults. This should concern us all. The CCP cannot be trusted. https://t.co/0R57dHvpzv","date":"Mon Feb 08 22:39:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota is well represented at #SuperBowl  \n\n✈️ B-1B Lancer from Ellsworth Air Force Base in pregame flyover\n📺 Displays from Daktronics in the stadium\n\nEnjoy the game!","date":"Sun Feb 07 23:28:47 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday to my favorite president, Ronald Reagan. President Reagan brought a wave of conservative leadership that paved the pathway for a better America.  He is pictured here with former SD Congressman Clint Roberts. https://t.co/OUZcbsYhum","date":"Sat Feb 06 15:55:00 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Senate Democrats voted to block medical care for babies who survive attempted abortions. That’s just wrong. Every life has value.","date":"Fri Feb 05 02:56:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This morning, I attended the annual National Prayer Breakfast. We pray together, Republican and Democrat, for wisdom and guidance as we govern our nation. #nationalprayerbreakfast","date":"Thu Feb 04 17:29:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We also discussed the importance of ethanol, creating new markets for state-inspected meat processing facilities and the need to reform the @USDA_NRCS. I look forward to working with him to address these issues critical to SD should he be confirmed. https://t.co/ugtmIVF9c2","date":"Thu Feb 04 02:10:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Had a productive talk w/ Ag Sec nominee today. I expressed the need for MCOOL and that we must close loopholes so only beef born, raised and slaughtered in the USA should receive a \"Product of the USA” label. He agreed consumers have the right to know where their meat comes from.","date":"Thu Feb 04 02:10:42 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This year’s #MarchForLife is going virtual. Tune in tomorrow at 10 a.m. MT/11 a.m. CT to hear from pro-life leaders about the sanctity of life! https://t.co/M2u4FDY9YD","date":"Thu Jan 28 20:35:40 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is flat-out wrong. An attack on life anywhere is an attack on life everywhere.","date":"Thu Jan 28 20:28:27 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On Holocaust Remembrance Day, we remember the millions of lives lost during the Holocaust. #NeverAgain https://t.co/doaASUdBej","date":"Wed Jan 27 19:57:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Here’s a great place for @POTUS to start: support the RESPECT Act, my bill that repeals old, racist federal laws related to the treatment of Native Americans. Let’s get this done now. Together, we can take steps toward righting wrongs that have been done throughout our history.","date":"Wed Jan 27 18:27:51 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I agree with my friend @JimInhofe - the defense of our nation is the most important responsibility of the federal government. @POTUS must build on the successes we’ve had the past several years in strengthening our national defense, not relying solely on diplomacy.","date":"Tue Jan 26 23:37:14 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will work with the agencies to make sure his Executive Order does indeed close loopholes that allow foreign beef to have the USA label – this is not only misleading to consumers, it puts our beef producers at a competitive disadvantage.","date":"Tue Jan 26 17:20:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Buying American is great. @POTUS can show he is serious about his proposal by making sure only US beef is labeled “Product of the U.S.A.” and by supporting Mandatory Country of Labeling (MCOOL).","date":"Tue Jan 26 17:20:31 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The filibuster is a big, fancy Washington word but it really just refers to a historic Senate rule that leads to more bipartisanship and consensus when making federal laws. #NoNuclearOption https://t.co/wqO4dfZwgk","date":"Mon Jan 25 15:56:01 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The filibuster is an important tool unique to the Senate that leads to bipartisanship and consensus in the making of permanent federal laws.  Republicans have supported keeping it for the passage of legislation, even while in the majority. \n\nhttps://t.co/zv5bz1CFS2","date":"Fri Jan 22 17:59:38 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Full statement here: https://t.co/wMyHHNQRR6","date":"Fri Jan 22 16:21:52 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I joined 92 senators to confirm General Lloyd Austin as the Secretary of Defense. Mr. Austin has earned praise from his colleagues throughout his military career, from the time he entered the Army in 1975 to working his way up to become a four-star general.","date":"Fri Jan 22 16:21:51 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As a member of the Armed Services Committee, I look forward to working w/ Mr. Austin on continuing to strengthen our national defense, especially in the cyber realm. We'll be working closely with him as we bring the next-gen B-21 Raider bombers to Ellsworth Air Force Base.","date":"Fri Jan 22 16:21:51 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"America is, and will continue to be, a world leader in calling out religious persecution and human rights abuses. The genocide of the Uyghur population by the Chinese Communist Party is not just unacceptable—it’s horrifying.","date":"Fri Jan 22 15:39:19 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I hope that the State Department’s determination will result in the CCP being held accountable for their crimes. https://t.co/vQ1lbQLalx","date":"Fri Jan 22 15:39:19 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Pulling into my DC office this morning, I ran into @SD_Guard patrolling the entrance. Spent a few minutes thanking them for their role in keeping the Capitol complex safe &amp; secure this week. https://t.co/YNd5qKsZEW","date":"Fri Jan 22 14:18:13 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Day 2 and the Biden administration is already attacking the right to life. Federal funding shouldn’t support abortions in the US or overseas. Baby Lives Matter. https://t.co/309HO4ITsq","date":"Thu Jan 21 16:41:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My full statement on the Inauguration of President Biden: https://t.co/l4nc5JY0ie","date":"Wed Jan 20 18:32:35 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we honor the life of Dr. Martin Luther King, Jr., who dedicated his life to bring greater equality and justice to all. We continue to be inspired by his tireless pursuit of a more perfect Union. https://t.co/y6sXomdAJo","date":"Mon Jan 18 14:15:04 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Big Tech companies have become too powerful. It’s time to discuss using antitrust laws to break up these oligopolies. https://t.co/ukkod4B4NI","date":"Fri Jan 15 16:17:56 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined The Greg Belfrage Show on @keloradio this morning to discuss my thoughts on the Electoral College certification process. https://t.co/idsoO5hHaj","date":"Thu Jan 14 21:41:32 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As a nation, we should stand together in opposition to the violent acts &amp; lawlessness that occurred at the US Capitol today. Violence &amp; destruction are never the answer-we are better than this. It’s past time for cooler heads to prevail. I continue to pray for our great country.","date":"Wed Jan 06 22:42:20 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My full statement on the formal count of the Electoral College votes by Congress https://t.co/dNKklHMuL6","date":"Tue Jan 05 23:52:43 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I was sworn into my second term serving South Dakota in the United States Senate. Continuing to work on behalf of South Dakotans in the Senate is a tremendous privilege and honor. I’m also incredibly thankful Jean was able to join me for the ceremony. https://t.co/RMTxBrRatT","date":"Sun Jan 03 21:08:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I look forward to getting to work on the important issues that will define our future. \n\nThe reenactment photo was taken in the Old Senate Chamber following the official swearing in ceremony. This is Jean’s first trip to D.C. since she first started cancer treatment in June 2019","date":"Sun Jan 03 21:08:29 +0000 2021","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Merry Christmas from the Rounds family! https://t.co/C23tSzaFej","date":"Thu Dec 24 21:01:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While I agree that Section 230 needs to be reformed, Section 230 has nothing to do with our military. There are better ways to address this issue than opposing legislation that’s so essential to our national defense.","date":"Wed Dec 23 22:05:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"#NDAA is one of the few things in Washington that passes every year with broad bipartisan support, and I anticipate a veto override vote will follow suit. We owe this to the men and women who defend the United States of America.","date":"Wed Dec 23 22:05:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"No piece of legislation has a greater impact on our men and women in uniform than the #NDAA. As a member of @SASCMajority, we’ve worked hard to produce a strong, bipartisan bill that includes many wins for our troops, Ellsworth Air Force Base and our nation.","date":"Wed Dec 23 22:05:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"But glad to see he is still investigating election irregularities in the @HSGAC  committee.","date":"Thu Dec 17 14:36:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tune in! I’ll be live shortly with Greg Belfrage on @keloradio to discuss ongoing COVID-19 relief negotiations and the election process, among other things. Listen live: https://t.co/Rh7sdxpY1z","date":"Thu Dec 17 14:06:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Why I’ll Be Getting the COVID-19 Vaccine: https://t.co/H1p4r6iRai","date":"Fri Dec 11 23:32:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Jean and I are wishing our Jewish friends a Happy Hanukkah on this first day of the Festival of Lights. #HappyHanukkah https://t.co/MFC9Pnu4oe","date":"Thu Dec 10 23:01:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations, Hattie! You’ve made the state of South Dakota and our alma matter proud! #gojacks","date":"Wed Nov 25 14:34:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This message isn’t about Thanksgiving 2020. It’s much bigger than that. This is about how we get through Thanksgiving 2020 so we can all enjoy Thanksgivings together for years to come. \n\nRead more in my weekly column -Chicken on Turkey Day: https://t.co/SVqHzGpW1J","date":"Fri Nov 20 18:08:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota common sense in action. Good job Will!\nhttps://t.co/YJPjaBrCJe","date":"Tue Nov 17 17:25:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Information on these and other questions can be found at the Centers for Disease Control and Prevention’s (CDC) website. The CDC is a good source for up-to-date, factual information on COVID-19. https://t.co/IirN9j3xtb","date":"Tue Nov 17 14:41:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As COVID-19 vaccine development continues to progress, South Dakotans have asked me important questions, such as the plan to distribute a vaccine or when it will be available.","date":"Tue Nov 17 14:41:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Coronavirus Food Assistance Program 2 (CFAP2) applications remain open until Dec. 11 for farmers and ranchers impacted by the  COVID-19 pandemic. \n\nMore info ⬇️ \nhttps://t.co/6BV192rmEq","date":"Thu Nov 12 19:50:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The men and women who wear the uniform of the United States of America are among the best of the best. We honor their service today and every day. https://t.co/oFrSJcJCl6","date":"Wed Nov 11 13:22:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday, @USMC! Thank you for 245 years of service and dedication to our great nation. #SemperFi https://t.co/HwveuUQnjb","date":"Tue Nov 10 15:43:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our elections must be safe and beyond reproach. Transparency is critical, and instances in which the vote count was not monitored must be corrected. Second, every single legal vote must be counted. Period.","date":"Fri Nov 06 21:28:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The courts must also be ready to step in if there are voter fraud allegations that need to be resolved. All of this is necessary to protect the integrity of our election process and make certain the American people have faith in the results.","date":"Fri Nov 06 21:28:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to be in Aberdeen for the ribbon cutting celebration at 3M’s new N95 production facility. 3M has stepped up to the plate to fulfill a critical need during the pandemic. \n\nIt goes without saying that 3M is a staple of the Aberdeen community. This expansion solidifies that. https://t.co/2nBvtaZ4ET","date":"Fri Nov 06 19:39:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Had a great virtual visit this afternoon with SDSU’s Consumer Policy &amp; Analysis class. We discussed my work in the Senate and a variety of issues important to young South Dakotans. Talking to our next generation is always special, especially when they’re Jackrabbits! #gojacks https://t.co/6fONsuy6eS","date":"Thu Nov 05 22:50:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Hard to believe our firstborn turns 40 today! Our son Chris was born the day before Ronald Reagan was elected President. Wishing you a very happy birthday, Chris. https://t.co/iAWVCLIejo","date":"Tue Nov 03 15:32:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"📸credits:\nKids on the Farm: Jamie Kaup, Faulkton\nCorn Field Sunrise: Pat Ziegler, Mitchell\nSunset at Buffalo Lake: Marlys Brooks, Sisseton\nBlack Hills Trees: Tom Barclay, Summerset\nMt. Rushmore Fireworks: Hayley Kaemingk, Rapid City\nSunset Ride: Shaylie Holben, Spearfish https://t.co/mmYN9gavup","date":"Mon Nov 02 16:57:28 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday, South Dakota! On this day in 1889, President Harrison signed statehood documents for South Dakota &amp; North Dakota. Blessed to live in the best state in the nation. Check out some of these photos of our beautiful state submitted by South Dakotans over the years. https://t.co/KxRWavmA0T","date":"Mon Nov 02 16:57:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"November is National Adoption Month.  In 2019 I had the privilege of nominating the O’Connor family for the Angels in Adoption award. Their story is an inspiration to us all. https://t.co/GYbXPdEYas","date":"Sun Nov 01 18:59:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our Founding Fathers weren’t perfect, but they created the most perfect system of government that has ever existed.\n\nDespite their imperfections, we continue to honor the four “guys” on Mt. Rushmore. Their lives tell the story of our nation &amp; our journey to a more perfect union. https://t.co/qLAfcmCZgN","date":"Thu Oct 29 22:44:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Every veteran deserves a place to call home. I introduced legislation with @SenatorLoeffler to make changes at the VA so all vets can access the resources they need to find a home. More here: https://t.co/1xQTcXJDdl","date":"Wed Oct 28 15:08:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today is a great day for the rule of law and our Founders’ vision when carefully crafting the Constitution. On behalf of all South Dakotans, it was an honor to cast my vote in support of Justice Barrett tonight. My full statement: https://t.co/7cePjjR6qO https://t.co/gOVSA1izQV","date":"Tue Oct 27 00:38:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As we await a final vote on Judge Barrett’s nomination, I’m headed to a classified briefing on election security. This is part of my duty as Chairman of the Armed Services Cybersecurity Subcommittee. With just 8 days to go before the election, we must continue to be vigilant.","date":"Mon Oct 26 13:57:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, we spent several hours voting on the Senate floor, w/ more votes expected throughout the weekend &amp; into next week. We’ll be occupied with lots of busywork these next few days, but in the end we will confirm Judge Barrett to the Supreme Court, a supremely qualified nominee!","date":"Fri Oct 23 20:24:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Appreciated the opportunity to meet with Judge Barrett today. We had a wonderful discussion about a number of issues that South Dakotans care about, such as the importance of upholding the Second Amendment and the role of Congress – not the Judiciary – in making policy decisions. https://t.co/zHBaeTvCst","date":"Wed Oct 21 22:18:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"DC Dems need to stop putting politics ahead of struggling families.","date":"Wed Oct 21 17:57:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Senate Dems just blocked:\n\n❌Enhanced unemployment benefits\n❌$100B+ to gets kids back in school safely\n❌PPP funding to save jobs &amp; small biz\n❌More testing\n❌More contact tracing \n❌More funding for vaccine development\n❌Funding to make sure everyone can get a vaccine","date":"Wed Oct 21 17:57:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans &amp; all Americans continue to struggle because of the COVID-19 pandemic. The common-sense, targeted bill we tried to move forward today would have provided immediate relief to families, businesses, schools and healthcare providers at a time when they need it most.","date":"Wed Oct 21 17:55:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We must continue working to #cutredtape.","date":"Wed Oct 21 16:04:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today’s Senate Veterans’ Affairs Cmtte hearing focused on implementation of the VA MISSION Act. I participated virtually to register my frustration with the bureaucracy at the VA, which prevents our community health care providers from giving our veterans the care they deserve. https://t.co/k2KZ8Lftzv","date":"Wed Oct 21 16:04:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Appreciated the opportunity to join the South Dakota Homebuilders Association in a virtual meeting this morning. Had a good discussion about the housing market, interest rates &amp; measures we can take to bring the price of lumber back down. https://t.co/lGhaBbITUo","date":"Tue Oct 20 15:15:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Opening Day! It's tough to beat pheasant hunting in South Dakota. Here's a throwback video that tells the story of our tradition.\n https://t.co/S58W7bm2dh","date":"Sat Oct 17 17:41:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The pheasant opener is a South Dakota tradition. I look forward to opening day as a time to make memories with my family and friends, and have some fun in the fields. I hope everyone who is participating today has a safe and successful hunt! #HiFromSD https://t.co/rak4fvIFBW","date":"Sat Oct 17 13:18:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Judge Amy Coney Barrett is impressive indeed. Read more in this week's column: https://t.co/HbogvGMWvt https://t.co/gcrTaapZpv","date":"Fri Oct 16 19:31:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"With more families working and learning online, the need to improve high-speed internet access in rural areas is greater than ever. Glad to see @USDA make another investment in rural broadband in SD. https://t.co/HEvUYqna9I","date":"Wed Oct 14 22:58:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’re excited to share the news that @SDState and Oglala Lakota College have been awarded @USDA_NIFA grants to provide support specifically targeted for Tribal students.","date":"Wed Oct 14 21:46:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to @SDState on receiving a Rural Health &amp; Safety Grant from @USDA_NIFA. Under this program, SDSU will participate in community-based outreach education to help improve &amp; promote health for rural citizens of all ages. https://t.co/gzijZFzW6R","date":"Wed Oct 14 21:36:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing the @USNavy a happy 245th birthday today! Thank you to all Navy service members, past and present, for your service to our nation. #Navy245","date":"Tue Oct 13 17:32:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I was notified by VA Secretary Robert Wilkie today that the VA will rescind its Record of Decision regarding the Hot Springs VA Medical Center. This is a great day for The Veterans Town! Visit my website to learn more: https://t.co/SuWFrCQbOW","date":"Fri Oct 09 23:26:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This year, we celebrate the 30th anniv. of recognizing the second Monday in October as Native Americans’ Day. As a member of the Cheyenne River Sioux Tribe &amp; lifelong SDian, I’ve asked my General Counsel, Kyle, to share some thoughts in this week’s column: https://t.co/ZuZLkYqcCh","date":"Fri Oct 09 12:47:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I look forward to joining Greg Belfrage on @keloradio at the top of the hour. Tune in here: https://t.co/Rh7sdxpY1z","date":"Thu Oct 08 12:34:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Their story reminds us all that every child is a precious gift from God. Today is Chase’s fifth birthday. Happy Birthday, Chase! Enjoy your special day! #AdoptionAngels2020","date":"Wed Oct 07 21:16:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"God has a plan for each of us, even if we don’t know it ourselves. Yesterday, I had the opportunity to meet virtually with Chris and Amber Friedel of Parkston, and their two kids, Chase and Kamber. The Friedels are my nominees for #AdoptionAngels2020. https://t.co/VdDPUb59My","date":"Wed Oct 07 21:16:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The NAIV, headquartered on the Cheyenne River Reservation, provides one-of-a-kind assistance to Native veterans across the US. Legislation @SenJohnThune &amp; I introduced would create a NAIV Congressional Charter &amp; strengthen its ability to help Native vets. https://t.co/DMCPGmvyIB","date":"Wed Oct 07 18:48:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tune in now to @WNAX. I’ll be live momentarily to discuss ag issues, news of the day. Live link: https://t.co/3GxRo7yygO","date":"Tue Oct 06 22:15:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m fighting for our SD ranching community by demanding greater market transparency, new markets for state-inspected facilities, Product of the U.S.A. labeling and MCOOL. But I can’t do it alone. It’s going to take all of us working as one to get this done. We can do it together. https://t.co/ATtWzTyecl","date":"Mon Oct 05 22:02:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we're celebrating two very special birthdays--my wife Jean and our granddaughter Andrina. Happy birthday to you both! https://t.co/JaOEFoGqFu","date":"Sun Oct 04 14:36:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"National Cybersecurity Awareness Month is a good opportunity to review our online security habits. Learn more about how to #BeCyberSmart here: https://t.co/oehUQBXdOd https://t.co/yjju8zexQT","date":"Sat Oct 03 16:22:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We wish Secretary Bergquist all the best as he retires from state government. He has been a dedicated public servant to the people of South Dakota for many years. We thank him for all he's done to improve our infrastructure &amp; safe travel through the state!\nhttps://t.co/wWA56YfZD1","date":"Sat Oct 03 15:15:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our son John turns 32 today! Time flies. Happy birthday, John. https://t.co/sP1P65qtO0","date":"Sat Oct 03 14:30:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"History Repeats\n\nhttps://t.co/hzYvnbJmXH https://t.co/wVV4FWph1x","date":"Fri Oct 02 22:08:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is welcome news! I look forward to reviewing the details when available. In the meantime, I'm continuing to push for automatic loan forgiveness for all PPP loans under $150k.","date":"Fri Oct 02 21:01:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Common sense proposals to help our beef producers shouldn't be a political issue. I'm working to bring much needed and long overdue relief to South Dakota's cattle industry. https://t.co/OqYBMy0GPA","date":"Fri Oct 02 20:21:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Legislation I introduced this week would allow for an existing @FCC program to continue investing in telehealth technology so more Americans can utilize these services. More here: https://t.co/OwJtFs1ySO","date":"Fri Oct 02 15:54:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As the COVID-19 pandemic continues, South Dakotans—especially those in rural areas—need to know they can access medical attention when they need it. Fortunately, telehealth services have become an easy and safe way for folks to speak with a medical professional from their home.","date":"Fri Oct 02 15:54:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks, @SDFarmBureau and @FarmBureau for your support of our NRCS compliance reform legislation. Our bill will allow NRCS to better serve South Dakota’s farmers, ranchers &amp; landowners. https://t.co/l6nNRnNDyb","date":"Fri Oct 02 15:35:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This #ManufacturingDay, we celebrate South Dakotans who work in manufacturing. They work hard to produce critical supplies for our state and nation. #MFGDay20 https://t.co/RIeaFwnzof","date":"Fri Oct 02 14:42:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Learn more about our legislation here: https://t.co/pp9gKHCRPE","date":"Thu Oct 01 14:32:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota’s farmers, ranchers and landowners know their land better than anyone else. They’re on the frontlines of conservation efforts to make certain our natural resources are available for future generations.","date":"Thu Oct 01 14:32:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"They don’t need the heavy-hand of government interfering with their ability to use and manage their own land. That's why @SenKevinCramer @SenJohnHoeven and I introduced legislation today to reform @USDA_NRCS. We're pleased to have support from @SDFarmBureau &amp; @FarmBureau.","date":"Thu Oct 01 14:32:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thousands of SD small businesses utilized the PPP to help stay afloat through COVID-19. But the loan forgiveness paperwork requirements are burdensome &amp; unnecessary-particularly for those with smaller loans. I continue to push for automatic loan forgiveness for loans under $150k https://t.co/QO2M1cuZ2Z","date":"Wed Sep 30 20:41:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing a happy birthday to my friend ⁦@RepDustyJohnson⁩! https://t.co/ZAovYJhpcw","date":"Wed Sep 30 14:27:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"President @realDonaldTrump has made an excellent choice in nominating Judge Amy Coney Barrett to the Supreme Court. My full statement: https://t.co/KKQucN117d","date":"Sat Sep 26 21:31:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'm honored to nominate Chris and Amber Friedel of Parkston for this year's Angels in Adoption Award, presented by the @CCAInstitute. Read more about the Friedel's inspiring adoption story here: https://t.co/qfb3fPQY9C https://t.co/IRxX8rftDK","date":"Wed Sep 23 17:28:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"China could have prevented COVID-19 from becoming a global pandemic. It’s time to hold China responsible. https://t.co/6ebhFVNCUo","date":"Mon Sep 21 22:41:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In our country, we should never forget to offer respect and prayers for those who have given their service to the best of their ability in the pursuit of justice. We send our thoughts and prayers to the family of Ruth Bader Ginsburg.","date":"Sat Sep 19 01:47:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Having real discussions about improving policing is one thing. Defunding the police is entirely different. It can only lead to one thing: anarchy. Just look at Portland, Kenosha or Minneapolis. These cities should learn a lesson from SD and back the blue. https://t.co/0saTrtsApp https://t.co/dkHu4C0uQM","date":"Fri Sep 18 16:53:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Signup for the Coronavirus Food Assistance Program will run from September 21 through December 11. More information can be found here: https://t.co/6BV192rmEq","date":"Fri Sep 18 15:33:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today @USDA announced an additional $14 billion for ag producers. This is a good step forward for South Dakota producers who have been struggling with the effects of COVID-19, on top of already low commodity prices, trade uncertainty and poor weather conditions.","date":"Fri Sep 18 15:33:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our @usairforce is the best in the world because of the men and women who volunteer to serve. Congratulations on 73 years! #USAF73","date":"Fri Sep 18 14:10:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our law enforcement officers are men and women with families just like ours, who put their lives in danger every day to protect our communities. Proud to join @SenThomTillis on this bill to make sure anyone who attacks or targets an officer will be held fully accountable.","date":"Thu Sep 17 19:20:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"233 years ago today, our Founding Fathers signed the U.S. Constitution. May we all take a moment to reflect on the freedoms and liberties recognized by our founders. We must always continue to protect &amp; defend our constitutional rights. #ConstitutionDay","date":"Thu Sep 17 17:49:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The sanctity of human life is something we should all seek to protect. I’ll continue working on pro-life &amp; pro-family policies in the Senate. Thanks @SBAList for your work to protect the lives of unborn children. https://t.co/VI5logK2J2 https://t.co/dvjMmeCxql","date":"Thu Sep 17 16:24:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to visit with @sdfarmersunion about the many issues facing our ag industry. We’ll keep fighting together!","date":"Wed Sep 16 16:44:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota's a low-tax state--you're welcome to move your exchanges here anytime, @NYSE!\n\nhttps://t.co/voFcndaIup","date":"Tue Sep 15 19:51:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"No matter your political beliefs, we can all agree that peace between Israel, the UAE and Bahrain is good for the Middle East and the United States. Thanks, @realDonaldTrump, for your leadership.","date":"Tue Sep 15 19:38:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Cancer touches all of our lives. But with continuing advancements in healthcare &amp; technology, more Americans will survive this disease. Thanks, @AmericanCancer, for the virtual visit today about cancer research &amp; for your kind words for our family as Jean fights her cancer battle https://t.co/EMVMsvLDkh","date":"Tue Sep 15 16:44:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to speak w/ @DeptVetAffairs Sec. Wilkie today about the VA’s plans to rescind an earlier decision to realign the Black Hills Health Care System, keeping the Hot Springs VA campus open as-is. More work to do-will continue working w/ Sec. Wilkie to see this decision through!","date":"Mon Sep 14 22:56:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I've been working with a handful of senators and @realDonaldTrump to make sure the EPA requires 15 billion gallons of conventional ethanol to be blended into our fuel supply. Today’s announcement is a step in the right direction to make sure that happens. https://t.co/t4LpJsp6bu","date":"Mon Sep 14 21:42:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @EPA's excessive issuance of Small Refinery Exemptions has undermined the integrity of the RFS for years, harming South Dakota corn and corn ethanol producers by reducing demand. Today’s decision upholds the integrity of the RFS and Congress’ intent of the law.","date":"Mon Sep 14 21:42:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Anyone or any family that has dealt with a cancer diagnosis knows that #CancerSucks. Jean and I have so appreciated your prayers and support through this time. https://t.co/u4FviExYgn","date":"Fri Sep 11 16:58:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We will always remember the innocent lives lost 19 years ago today. As threats from our foreign enemies continue every day, we thank our men and women in uniform who work tirelessly to prevent future attacks on American soil, as well as our first responders. https://t.co/0NmTkJJrxW","date":"Fri Sep 11 14:10:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Lots of talk about foreign interference in the election. Glad United States Cyber Command continues working hard to thwart these efforts like they did so well in 2018. Not a coincidence that there was no election interference then. https://t.co/8MwRVzNIi7","date":"Thu Sep 10 22:45:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I thank @SecElaineChao for approving a BUILD Grant to help reconstruct and widen a 70-year-old section of SD HWY 46 in southeastern South Dakota. This will help to keep it in safe working condition for years to come.\n\nhttps://t.co/ygsuB1KlRn","date":"Thu Sep 10 20:26:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Had a great briefing today from the Air Force on B-21 basing and the B-21 program overall. The program continues to be on track and looking great for Ellsworth.","date":"Thu Sep 10 20:15:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":".@SenateDems just opposed moving to debate a COVID-19 relief bill that included:\n☑️$20 billion in additional ag relief\n☑️Funds for vaccine development\n☑️Additional $260 billion for PPP &amp; streamlined loan forgiveness\n☑️Extra $300/wk in unemployment benefits\n☑️$105 billion for edu.","date":"Thu Sep 10 18:22:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just joined @keloradio to talk about the latest COVID-19 relief bill. Tune in now: https://t.co/Rh7sdxpY1z https://t.co/2fUWlUVewU","date":"Thu Sep 10 13:09:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota students interested in attending a U.S. Service Academy for the 2021-2022 school year now have until October 30, 2020, to submit nomination applications. More info here: https://t.co/Z4EsWPgZ5C","date":"Wed Sep 09 15:32:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"September is National Suicide Prevention Month. 2020 has been a difficult year for many. If you’re struggling, please call the Suicide Prevention Hotline at 1-800-273-8255. Avera also offers a free, confidential Farm and Rural Stress Hotline: 1-800-691-4336 https://t.co/xVvURGSkbs","date":"Thu Sep 03 17:07:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The White House is also accepting applications for volunteers to provide entertainment for visitors during the holidays. The deadline is Oct. 8, 2020. Apply here: https://t.co/QeL238R1UG","date":"Thu Sep 03 16:30:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans interested in volunteering to decorate or greet visitors at the White House this Christmas season can submit applications until Oct. 1, 2020. Apply here: https://t.co/S8fmB6bEIT","date":"Thu Sep 03 16:30:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, USDA announced that farmers and ranchers in Custer County and Fall River County are eligible for disaster assistance for losses caused by drought this year. More info here: https://t.co/mJoeQrlFof","date":"Tue Sep 01 15:27:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great discovery in the Badlands of South Dakota - congratulations to the team who worked to unearth Shady! https://t.co/8JgUOWy93z","date":"Thu Aug 27 17:18:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last night, I visited with a group of Veteran Service Officers in Pierre who were in town for their annual conference. It was a great opportunity to thank them for all the work they do everyday for veterans across our state. https://t.co/AqAMoVytCj","date":"Tue Aug 25 22:01:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see @FHFA act on our letter regarding the Fannie/Freddie refinance fee. This tax should be eliminated but a delay is a good first step. https://t.co/PQePFuSoIy","date":"Tue Aug 25 21:19:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🗳USPS can handle the increased volume. Due to the pandemic, the volume of first class mail has dropped significantly. The increased demand to vote by mail will not overload the USPS. If all registered voters cast ballots by mail, it would make up only 6% of normal weekly volume.","date":"Mon Aug 24 23:57:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"📬Postmaster General DeJoy was not appointed by President Trump. He was unanimously appointed by the Board of Governors of the USPS. The Board of Governor is a bipartisan board confirmed by the Senate.","date":"Mon Aug 24 23:57:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"❌Standards of delivery have not been changed. The USPS is prepared to securely deliver election mail on-time.","date":"Mon Aug 24 23:57:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"💵USPS is not broke. It has $15 billion cash on hand right now. Additionally, the CARES Act authorized a $10 billion loan for USPS. In negotiations, we have considered changing this loan to a grant. If additional resources are needed for the post office, we stand ready to assist.","date":"Mon Aug 24 23:57:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There’s a lot of misinformation going around about the USPS. \n\n👇🏻Here are the facts👇🏻","date":"Mon Aug 24 23:57:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Cybersecurity is national security. Today, I had the opportunity to tour MadLabs at Dakota State University in Madison, the home of the next generation of experts in Cybersecurity. It’s great to know our future is in good hands. https://t.co/iMWItIsNhR","date":"Thu Aug 20 21:37:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Recently met with Ken Charfauros and Janet Niehaus, owners of Wall Meat Processing. We discussed the issues plaguing the cattle market, and some of the bills I'm working on to fix them. Read more about our visit here: https://t.co/dg3kYEsDgb https://t.co/vgMUGr5tsS","date":"Thu Aug 20 18:02:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m live with the @GreaterSFCC for their virtual Inside Washington event.","date":"Thu Aug 20 17:06:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are currently accepting nomination applications for SD students interested in attending one of our nation's service academies for the 2021-2022 school year. The deadline to submit your application is Oct. 1. More info here: https://t.co/DR5jkmPmMt","date":"Wed Aug 19 20:52:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m live with @RepDustyJohnson on a virtual @DakotaFest forum hosted by @SDFarmBureau.","date":"Wed Aug 19 18:27:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Rural transit plays an important role in the lives of many South Dakotans. Our legislation would allow certain transit operators to receive a higher federal share of operating assistance so they can continue to provide necessary services to residents. https://t.co/uQX8R0T2bQ","date":"Tue Aug 18 20:10:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"100 years ago today, the 19th Amendment was ratified, giving women the right to vote. Today, we celebrate the women’s suffrage movement, as well as the sacred right of all citizens to vote in our free and fair elections.","date":"Tue Aug 18 13:57:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Following our request, USDA announced today that farmers &amp; ranchers in 19 SD counties who planted cover crops on prevented plant acres can begin haying, grazing or chopping those fields beginning on Sept. 1 instead of Nov. 1.","date":"Mon Aug 17 20:11:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m pleased USDA has provided some flexibility by allowing them to hay, graze and chop their fields earlier in the season. I hope USDA will consider additional South Dakota counties for early haying and grazing. https://t.co/RKuupAm2q0","date":"Mon Aug 17 20:11:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Harold Thune was an American hero and inspiration to many South Dakotans. Jean and I are praying for John, Kimberly and the entire Thune family during this difficult time.","date":"Sun Aug 16 01:50:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is a huge step toward greater peace and prosperity across the Middle East region. With this announcement, @realDonaldTrump and his administration have shown the power of diplomacy to deliver real results at a time when our world needs stability.","date":"Thu Aug 13 19:33:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"New evidence shows that FBI officials blatantly lied to the Senate Intel Committee about information in the Steele dossier. Washington bureaucrats knowingly perpetuating this kind of disinformation is dangerous for our democracy. \n \nhttps://t.co/musKCgFsKe","date":"Tue Aug 11 14:57:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Reckless spending that adds to our debt jeopardizes the future of our children who will be faced with paying for these spending mistakes.","date":"Mon Aug 10 19:37:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"But wasting trillions of dollars on liberal priorities like cannabis funding, taxpayer-funded abortion and the federalization of our elections - things that have nothing to do with providing COVID-19 relief - does much more than nickel-and-dime them.","date":"Mon Aug 10 19:37:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":".@speakerpelosi talks about not wanting to nickel-and-dime our children. https://t.co/LazMCdIetd","date":"Mon Aug 10 19:37:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This gave the president no choice but to take bold executive action. I thank him for stepping up to provide much-needed relief to American families. It’s what Americans should expect and deserve from their elected leaders.","date":"Sat Aug 08 22:26:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Unfortunately, they seem to care more about playing politics ahead of the November election than they do about helping American families and regrowing our economy. This is Washington dysfunction at its worst; hurting South Dakotans and all Americans.","date":"Sat Aug 08 22:26:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’ve spent weeks trying to negotiate with Washington Democrats on targeted, timely relief that focuses on getting people back to work and getting kids back to school safely.","date":"Sat Aug 08 22:26:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This morning in Fort Pierre, I had the opportunity to be the keynote speaker at a Code Talker Congressional Medal presentation for Guy George Chapman, who served in World War 1. We honor the service of all our veterans. https://t.co/jz4SJfnT4F","date":"Fri Aug 07 20:54:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Maintaining the integrity of our free and fair elections is critically important—our elections are how we choose our country’s leaders. We need to make sure that they remain secure as we adapt to life during a pandemic. More: https://t.co/e5BGtIfoqI","date":"Fri Aug 07 13:08:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"or South Dakota. We'd love to have the @NRA in the Rushmore state.","date":"Thu Aug 06 18:21:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During a @SASCMajority hearing today, I reinforced the important role IGs play in the fight against bureaucratic overreach. https://t.co/5Xzzm5liS7","date":"Thu Aug 06 17:32:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For too long, unelected Washington bureaucrats have run amuck - trying to make important decisions that impact South Dakotans. They need adult supervision.","date":"Thu Aug 06 17:32:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Chinese Communist Party isn’t just attempting to gain total control over its own people, it is also seeking to control other countries around the world. https://t.co/G0zvRjpWMg","date":"Thu Aug 06 17:12:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenJohnThune on legislation to improve snowpack &amp; drought monitoring so the Corps can more accurately manage the Missouri River. We cannot have a repeat of 2011 or 2019. https://t.co/lymbE9xLr4","date":"Wed Aug 05 20:31:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"These loans are vital to our businesses struggling to recover from the COVID-19 pandemic. Proud to join this bipartisan effort.","date":"Wed Aug 05 19:33:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"📞 Call into the telephone townhall at: 877-229-8493 Pin: 115923\n\n💻 📱Listen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Wed Aug 05 00:41:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall. If you would like to participate, all you need to do is call in or click on the link below tonight at 7:55 p.m. CT/6:55p.m. MT.","date":"Wed Aug 05 00:41:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We need real price transparency in the cattle market.","date":"Tue Aug 04 21:19:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This year’s election won’t be delayed. We do, however, want to be sure all ballots can be counted on election day. https://t.co/d2QWl9AT74","date":"Tue Aug 04 14:01:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota is a large, rural state. Families can live a hundred miles or more from a hospital or clinic. Expanding tele-health services is incredibly important and I am glad the @realDonaldTrump administration is making this a priority.https://t.co/aPWHyT4I4T","date":"Mon Aug 03 22:06:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I agree with the president that - to the best of our abilty - ballots should in &amp; counted on November 3. We shouldn’t have to wait weeks for ballots to be counted.","date":"Fri Jul 31 20:39:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In the history of our nation, we have always been able to hold our federal elections on time. This year is no different. Our election will be held Nov. 3.","date":"Fri Jul 31 20:39:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨BREAKING🚨 Our legislation to allow Americans to sue the Chinese Communist Party for its role in spreading COVID-19 passed out of the Senate Judiciary Committee this week.","date":"Fri Jul 31 14:51:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate also approved the promotion of Col. Patrick Pardy of Howard to Brigadier General today! On behalf of all South Dakotans, we thank Patrick for his commitment to serving our state and nation.","date":"Thu Jul 30 22:50:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I thank him for continuing to share his depth of knowledge, commitment to our servicemembers and strong work ethic with the South Dakota National Guard. We’re grateful and proud of all his accomplishments.","date":"Thu Jul 30 22:49:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate just approved the promotion of South Dakota Adjutant General Jeff Marlette from a Brigadier General (one-star) to a Major General (two-star)!","date":"Thu Jul 30 22:49:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Including our bipartisan, bicameral New Markets for State Inspected Meat and Poultry Act in future COVID-19 relief legislation is good for producers and very good for consumers. https://t.co/FPSq1RhZOq","date":"Thu Jul 30 19:25:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Earlier today, Senate Democrats tried to unanimously pass the $3 trillion House-passed HEROES Act on the Senate floor. Fortunately we did not let this extreme, socialist bill pass the Senate.","date":"Thu Jul 30 17:51:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While we work to get meat and pork processing facilities back up and running at capacity, we should also be utilizing state-based solutions to help offset the backlog and provide additional capacity.","date":"Thu Jul 30 17:30:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"At a time when our food supply is in danger, this is an easy first step.","date":"Thu Jul 30 17:30:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Specifically, we should include the New Markets for State-Inspected Meat and Poultry Act in the next relief package","date":"Thu Jul 30 17:30:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Labor shortages and worker protection measures slowed down plants around the country and outbreaks even caused some facilities to shut down entirely.","date":"Thu Jul 30 17:29:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Like so many sectors of our economy, the food production industry was ill-prepared for the unprecedented changes needed to be made when the COVID-19 pandemic hit.","date":"Thu Jul 30 17:29:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to speak on the Senate floor. Listen here: https://t.co/1puB6QEl3r","date":"Thu Jul 30 17:02:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our bipartisan bill would allow meat and poultry products inspected by state Meat and Poultry Inspection programs to be sold across state lines. This would be a huge win for producers and consumers in South Dakota and across the country.","date":"Thu Jul 30 16:59:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Headed to the Senate floor to urge the inclusion of our New Markets for State-Inspected Meat and Poultry Act in COVID-19 response legislation.","date":"Thu Jul 30 16:59:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This story is disturbing. If this is all true--that coaches were abusing kids at NBA-sanctioned training camps and denying them the opportunity for education—we should expect the NBA to take a hard look at its cozy relationship with the repressive Chinese government.","date":"Thu Jul 30 14:50:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"CAUTION: If you receive a package of seeds in the mail with Chinese writing on the outside and you did not order them, DO NOT plant them. This appears to be a scam.\nhttps://t.co/UhCvxdreqp","date":"Thu Jul 30 02:24:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"“Though banning Huawei would be expensive at first, placing a revisionist China at the center of the EU’s communications networks would be far more costly over time.” - @WSJopinion https://t.co/AQbmq0xUHz","date":"Wed Jul 29 17:42:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"China completely failed to contain the spread of COVID-19. They waited weeks before even alerting the world to the seriousness of the pandemic. China must be held accountable. https://t.co/DPiXKKYPt4","date":"Tue Jul 28 23:32:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Small businesses have been hit hard by COVID-19 and the last thing they need is to worry about bureaucratic red tape. Our bill will streamline the forgiveness process for businesses that received PPP loans. https://t.co/UeH8C4q2Vu","date":"Tue Jul 28 21:40:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Appreciate the support for the TRUST Act from @daily_leader. This legislation will help to make sure programs like Social Security and Medicare will be around for future generations. https://t.co/ULE0fj3NXN","date":"Tue Jul 28 20:15:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The 70 percent of our budget that’s on autopilot is the biggest driver of our national debt. The TRUST Act will restore and preserve our endangered federal trusts.","date":"Tue Jul 28 13:40:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There are more than 1,400 unsolved cold cases of missing and murdered Indigenous people in the US. Appreciate the dedication of the @realDonaldTrump administration, including @IvankaTrump, for seeking justice and safety for our tribal communities.  https://t.co/R7651RK2r8","date":"Tue Jul 28 12:01:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Baby Lives Matter.","date":"Mon Jul 27 23:03:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Honored to help welcome home members of the @SDArmyNG Alpha Battery 1-147th Field Artillery Battalion and the 147th Forward Support Company! This group of 110 soldiers just returned home from a 10 month tour in Europe. Welcome home and thank you for your service to our country! https://t.co/ha6v9aI7zy","date":"Sun Jul 26 01:42:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy National Day of the American Cowboy! I’ll never forget meeting this little guy at the Saint Onge sale barn! https://t.co/O9RwOcil4A","date":"Sat Jul 25 21:41:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"International threats against U.S. interests will continue to grow, but we have the best military in the world. It isn’t just weapons systems that make our armed forces strong, though they are indispensable—it’s the men and women who wear the uniform. https://t.co/mLAhHOBsLk","date":"Fri Jul 24 13:53:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This year marks the 60th consecutive year that we’ve passed a strong, bipartisan NDAA out of the Senate. This shows that when we have a common goal—in this case, strengthening our military and taking care of the men &amp; women who wear the uniform—we can work together to achieve it.","date":"Thu Jul 23 19:18:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read my full statement here: https://t.co/SqZdK1xoxd","date":"Thu Jul 23 19:18:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Baseball is back! ⚾️ \n\nGood luck tonight to the 27-time World Champion New York @Yankees as they take on the defending World Series Champion Washington @Nationals. Great to have America’s pastime back on the field again!","date":"Thu Jul 23 17:39:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Another unacceptable attempt by the Chinese Communist Party to destroy religious freedom. America stands with Chinese Christians and all those persecuted for their faith by the CCP. https://t.co/UtMkgeZRJL","date":"Thu Jul 23 14:36:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday, Senator Dole! Thank you for dedicating your life to making our country better.","date":"Wed Jul 22 17:33:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Proud to support an amendment to provide benefits to additional Vietnam veterans who were exposed to Agent Orange.","date":"Wed Jul 22 17:30:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"These men and women made great wartime sacrifices and were sickened because of Agent Orange exposure in the course of that service. Congress and the VA need to make sure their health concerns are taken care of.","date":"Wed Jul 22 17:30:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We never want to send our men and women into a fair fight—we always want them to have the advantage.","date":"Wed Jul 22 16:45:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I just voted no on @SenSanders #NDAA amendment to cut funds for our troops.","date":"Wed Jul 22 16:45:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As our near-peer competitors, like China and Russia, continue to grow their own militaries, it’s critically important that the U.S. makes sure our troops have better weapons systems and all the resources they need to succeed against our adversaries.","date":"Wed Jul 22 16:45:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A local organization that could use your help! \nhttps://t.co/YEMtu1i8Tc","date":"Wed Jul 22 12:17:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Washington D.C. vs. Real America \n\nHonored to represent people who stand for freedom and love our state and country. 🇺🇸 https://t.co/1ujwQRpK9d","date":"Wed Jul 22 01:03:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just voted in favor of an amendment to restore American leadership in semiconductor manufacturing. We can’t continue to rely on our adversaries, such as China, for this important product that is critical to our national security.","date":"Tue Jul 21 20:58:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just voted in favor of an amendment to increase funding for PFAS research.  The more we know about this problem, the more we can do to help those affected such as South Dakotans in the area of Ellsworth Air Force Base.","date":"Tue Jul 21 20:18:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great addition to @SDState! Thank you, Barry Dunn, for your leadership. https://t.co/S5TydWlmBo","date":"Tue Jul 21 17:48:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I joined @SenMcSallyAZ @MarshaBlackburn @SenTomCotton @SenHawleyPress @SenThomTillis to introduce legislation allowing Americans to sue China for its role in causing the COVID-19 pandemic. https://t.co/BOX9hZcjKs","date":"Tue Jul 21 13:56:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Watch this ➡️ a Chinese Ambassador fails to answer what’s happening in footage clearly depicting Uighur Muslims being shackled, blindfolded, shaved and loaded onto trains.\n\nThe real answer ➡ the Chinese Communist Party is conducting an ethnic cleansing. This is wrong.","date":"Tue Jul 21 12:22:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Since South Dakota is a large, rural state where families can live a hundred miles or more from a hospital or clinic, expanding tele-health services is incredibly important. https://t.co/UAq5XeaFII","date":"Tue Jul 21 00:25:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"#NDAA21 will be taken up by the Senate this week. Our strong bipartisan bill:\n✅ Furthers the National Defense Strategy\n💵Gives troops a pay raise\n🏠Improves military housing\n\nWe have the best armed forces in the world. This bill helps make sure we remain the best in the future.","date":"Mon Jul 20 22:20:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"51 years ago today, American astronauts aboard #Apollo11 landed on the moon and pulled off one of the greatest achievements in human history.","date":"Mon Jul 20 21:42:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Promising vaccine news out of the UK today.","date":"Mon Jul 20 15:20:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Small businesses have until Aug. 8 to apply for Paycheck Protection Program loans. Remember, these loans are forgivable if you keep your workers on the payroll. Learn more here: https://t.co/ITy2ssUrWs","date":"Mon Jul 20 15:00:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"He will forever be remembered for courageously putting everything on the line to oppose racism and build a better America rooted in love and compassion. Jean and I are praying for his family.","date":"Sat Jul 18 13:47:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"John Lewis was a giant in the civil rights movement. He understood the principle of working to create a more perfect union.","date":"Sat Jul 18 13:47:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thank you Chairman @LindseyGraham for your efforts to declassify these important documents. They are further proof of the corruption among Washington bureaucrats who sought to undermine the 2016 election. We must continue to hold them accountable. https://t.co/QZyTInnuGX","date":"Fri Jul 17 20:19:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We can do our due diligence to protect our natural resources without timely, costly regulations that delay the construction of roads, bridges and other critical infrastructure. This is a step in the right direction.\nhttps://t.co/NUlPPUXCiK","date":"Fri Jul 17 19:39:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For COVID-19 relief, Americans deserve a lot better than what the House is putting forward. We’re working in the Senate to come up with actual relief for American families and businesses who are struggling to deal with this virus. More here: https://t.co/tE0owTiQ98","date":"Fri Jul 17 15:33:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The new school year is around the corner, but there’s still uncertainty about how to best re-open in the age of COVID-19. I discussed with the Sioux Falls Downtown Rotary the importance of local decision making in determining what's best for each district. https://t.co/Jq98kHpsCJ","date":"Wed Jul 15 20:12:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is a necessary step toward holding the Chinese Communist Party accountable for its actions in Hong Kong. We will always stand up for freedom and democracy across the globe. https://t.co/WwrR1Xh6vf","date":"Wed Jul 15 18:44:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The sooner we can get successful treatments and vaccines approved and distributed, the sooner we can get our economy back to the strong level it was at pre-pandemic. https://t.co/JIR35oyRuM","date":"Tue Jul 14 20:20:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There is no daylight between the Chinese Communist Party and Chinese-owned telecommunications companies such as Huawei. This is the right step to protect national security interests of UK, allies. https://t.co/AZfy4MDUCe","date":"Tue Jul 14 18:27:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There are a couple of South Dakotans in that group of cadets! Congrats and good luck to all.","date":"Tue Jul 14 18:09:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @KELO and @sdfarmersunion today to discuss what we’re doing to improve the cattle market for SD’s producers. Listen: https://t.co/qL6PlmVFXW","date":"Tue Jul 14 16:56:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad you enjoyed our South Dakota hospitality, @tonyhawk! #GreatFacesGreatPlaces","date":"Mon Jul 13 19:32:34 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to be in Sioux Falls today to visit with the Sioux Falls Downtown Rotary! https://t.co/PZK8UjsDgF","date":"Mon Jul 13 18:35:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @nativesba will be hosting webinars in the coming months designed to train participants how to teach a workshop on entrepreneurship and small business management for Native entrepreneurs or business owners. More info here: https://t.co/cb0JsJmyAh","date":"Fri Jul 10 18:28:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The year 2020 is only half written, but already it’s one for the history books.  Everyone will remember this year as one unlike any other.  While it is very common to set resolutions and goals on New Year’s Day, this year is unique enough to deserve a half-time review.","date":"Fri Jul 10 14:14:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read more in my full weekly column: https://t.co/6BgKgtz3Pt","date":"Fri Jul 10 14:14:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Jean and I were deeply saddened to hear about Lee Weber. We continue to pray for his family and friends during this difficult time. https://t.co/FaHmMphuUb","date":"Fri Jul 10 01:23:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Reminder: the deadline to file taxes has been extended to July 15 due to the COVID-19 pandemic.","date":"Thu Jul 09 22:44:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great virtual meeting with South Dakota Superintendents this morning. We discussed the need to get ours kids back to school this fall, different scenarios to safely re-open our schools and the importance of local control when making these decisions. https://t.co/eFeBdXiXfp","date":"Thu Jul 09 15:17:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tune in now: I’ll be live shortly with Greg Belfrage on @keloradio: https://t.co/Rh7sdxpY1z","date":"Thu Jul 09 12:59:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The recent court decision to shut down the Dakota Access Pipeline threatens to impact our farmers' ability to transport their grains. Rail space in the Upper Midwest is already tight.","date":"Wed Jul 08 16:14:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This would mean farmers have even more competition for space, as oil will turn to rail companies for transport. This is a concern for farmers, who are already struggling due to low commodity prices, trade disputes and the COVID-19 pandemic, among other things.","date":"Wed Jul 08 16:14:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great day for religious liberty! No one should be forced to violate their deeply-held religious beliefs due to a government mandate.\n\nhttps://t.co/h39blEIjQY","date":"Wed Jul 08 16:05:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great news! @realDonaldTrump signed our legislation to extend the PPP application deadline. That means South Dakota small businesses now have until August 8th to apply for the COVID-19 relief program.\nhttps://t.co/VxqIy82DP2","date":"Mon Jul 06 21:56:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing all South Dakotans a happy and safe Independence Day! https://t.co/IJUsn57YJS","date":"Sat Jul 04 13:15:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Chairman @JimInhofe is right – our country continues to face threats from dangerous adversaries like China and Russia. Now is not the time to cut our defense spending. Now is the time to prioritize our national security and the service members who protect our nation.","date":"Thu Jul 02 19:00:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wishing a very happy birthday to our grandson, Beckett, who turns 7 today! https://t.co/ZqHFYsTY47","date":"Wed Jul 01 13:02:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Listen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Wed Jul 01 00:49:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall. If you would like to participate, all you need to do is call in or click on the link below tonight at 7:55 p.m. CT/6:55p.m. MT.\n\nCall into the telephone townhall at: 877-229-8493 Pin: 115923","date":"Wed Jul 01 00:49:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is a good, necessary step toward protecting our critical infrastructure. @AjitPaiFCC put it best when he said: “We cannot and will not allow the Chinese Communist Party to exploit network vulnerabilities and compromise our critical communications infrastructure.”","date":"Tue Jun 30 19:45:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"June is Dairy Month. Dairy producers in South Dakota work hard every day to feed the world by producing high-quality milk, cheese and yogurt products.","date":"Tue Jun 30 16:08:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Supreme Court ruled today that the organizational structure of the CFPB, with a single director who could be removed only “for cause,” is unconstitutional and must be reconsidered. This decision confirms our assertion that the CFPB was unconstitutional in its framework.","date":"Mon Jun 29 22:35:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Reminder for small businesses in South Dakota ⬇️","date":"Mon Jun 29 21:39:10 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"SD students interested in submitting artwork for @FLOTUS's #19thAmendment exhibit should do so by July 6.","date":"Mon Jun 29 14:30:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read more in this week's column: https://t.co/LGHrYOTv7S","date":"Fri Jun 26 13:33:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During these difficult times, when some are trying to destroy our sacred symbols of freedom and democracy, we must remember that there are a lot of good people in our history who may not have been perfect, but they did remarkable things in order to create a more perfect union.","date":"Fri Jun 26 13:33:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Listen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Thu Jun 25 00:28:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall. If you would like to participate, all you need to do is call in or click on the link below tonight at 7:30 p.m. CT/6:30 p.m. MT.\n\nCall into the telephone townhall at: 877-229-8493 Pin: 115923","date":"Thu Jun 25 00:28:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The VA’s Native American Direct Loan program was established to provide Native American veterans living on trust land with an accessible home loan option. We’re continuing to work with our partners in SD to make sure the program does what it was intended to do. https://t.co/p2Zrp3Hb5C","date":"Wed Jun 24 19:57:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Quick Update on the Senate this week:\n➡️ Confirmed the 200th federal judge nominated by President Trump\n➡️ Senate Democrats blocked police reform legislation\n➡️ Begin consideration of the National Defense Authorization Act by the full Senate https://t.co/crxUE25yY8","date":"Wed Jun 24 19:37:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thank you, @SenatorTimScott, for your leadership. This fight is not over.","date":"Wed Jun 24 18:42:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The record-breaking number of judges we’ve confirmed under President Trump is especially notable since the judges we’ve confirmed will serve lifetime appointments to the federal judiciary. The court decisions they make can have a lasting impact on the direction of our country. https://t.co/iOgBDNFuya","date":"Wed Jun 24 16:42:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Welcome home! Thank you for your service to our country. We are all proud of you! 🇺🇸 https://t.co/Qu1QoKrv6z","date":"Wed Jun 24 16:01:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, @SenateDems plan to block debate on the JUSTICE Act, our police reform bill. By blocking this bill, @SenateDems are rejecting:\n❌Making lynching a federal crime\n❌Providing incentives for departments to ban chokeholds\n❌Making improvements to training &amp; hiring of officers","date":"Wed Jun 24 14:29:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Couldn’t agree more! We have introduced legislation that allows high-quality meat products that pass state inspection standards (which are required to be ‘at least equal to’ or better than federal state inspection standards) to be sold across state lines. https://t.co/pNBW5JoTHc","date":"Tue Jun 23 21:03:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations on this historic appointment! https://t.co/ZQM99zkx7y","date":"Mon Jun 22 21:03:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Father’s Day! https://t.co/NJnUKrfCmp","date":"Sun Jun 21 16:14:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate recently passed a resolution designating June 19, 2020, as Juneteenth Independence Day, signifying the end of slavery in the US. This Juneteenth, may we unite in celebration of freedom and recognize this historic milestone in our pursuit of equality &amp; justice for all.","date":"Fri Jun 19 18:54:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate will soon confirm the 200th judge nominated by @POTUS. The judges that have been confirmed over the past three-and-a-half years provide balance to the courts so they can continue to provide due process of law to all Americans. https://t.co/rNDkVASf8v","date":"Fri Jun 19 13:50:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨Great news for Mitchell:\nThe city of Mitchell has received more than $3 million in grant funding to improve the city's storm water system. This project will allow businesses to update sewer piping &amp; water mains to help prevent damage during flood events. https://t.co/J5ykecnrGg","date":"Thu Jun 18 22:11:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Even one veteran taking his or her life due to the stress of serving our country is one too many. Appreciate @realDonaldTrump @POTUS for taking steps to address veteran suicide.","date":"Thu Jun 18 15:22:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenRickScott &amp; a bipartisan group of senators on a resolution that encourages folks to shop at businesses that manufacture products here in the United States, which helps to support the American workforce. https://t.co/rzaQzCPLos","date":"Wed Jun 17 18:13:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last week, I led a group of 44 senators urging the administration to provide paperwork relief for small businesses who utilized the PPP. Glad they're taking this step so our small businesses can focus on reopening. Still more work to do. \nhttps://t.co/BJJ3poERER","date":"Wed Jun 17 16:41:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to Pierre/Fort Pierre Rotary Club member Larry Lyngstad, who was recently awarded @Rotary's highest honor for individuals, the “Service Above Self Award.” Thanks for all you do for our community, Larry. https://t.co/hyLw2l54vQ","date":"Wed Jun 17 16:16:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Up next to ask questions at our @EPWGOP hearing. Tune in: https://t.co/W9C9vG7Uv0","date":"Wed Jun 17 15:16:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you are a small business that has been impacted by COVID-19, there’s still time to apply for assistance under the #PaycheckProtectionProgram.","date":"Tue Jun 16 14:46:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I joined a bipartisan group of senators in calling for the expansion of access to telehealth services during the COVID-19 pandemic to be made permanent. More: https://t.co/6Y7MXsSSc7","date":"Tue Jun 16 13:57:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota students in grades 3-12 are invited to submit artwork to the @WhiteHouse for an exhibit honoring the 100th anniversary of the ratification of the 19th amendment, which gave women the constitutional right to vote. Learn more &amp; apply here: https://t.co/0DEg9gE9RR","date":"Mon Jun 15 19:29:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Companion legislation to our New Markets for State-Inspected Meat and Poultry Act was recently introduced by @RepLizCheney in the House of Representatives.\nhttps://t.co/xo3BsazGS3","date":"Mon Jun 15 14:36:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Flag Day! https://t.co/HMJO3iyI5F","date":"Sun Jun 14 20:42:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday, @POTUS @realDonaldTrump! Looking forward to celebrating America’s birthday with you at Mount Rushmore!","date":"Sun Jun 14 14:35:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday to our granddaughter Natalie, who turns 5 today! https://t.co/SOFnepIjAY","date":"Sun Jun 14 13:37:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As small businesses begin to reopen their doors, the last thing they should be worried about is burdensome, unnecessary paperwork. Today I led a letter urging the admin. to ease paperwork requirements for small businesses seeking PPP loan forgiveness.\nhttps://t.co/46jlJvI1cf","date":"Fri Jun 12 18:23:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Passing the NDAA each year is one way for us to make sure they and their families are taken care of and have all the resources they need as they serve our nation. https://t.co/vEf8HycuNt","date":"Fri Jun 12 13:43:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The men and women who wear the uniform of the United States put their lives on the line to protect and preserve our freedom. We’re forever grateful to them for their service and sacrifice.","date":"Fri Jun 12 13:43:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"By expanding telehealth capabilities to rural areas, more people with mental health concerns will be able to receive the care they need, from the comfort of their own home. https://t.co/9QTPgVXVaQ","date":"Fri Jun 12 13:07:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate Armed Services Committee approved this year’s National Defense Authorization Act, which includes a number of provisions that will impact South Dakota. Read more: https://t.co/rOJFt9PhUd","date":"Thu Jun 11 20:08:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenAmyKlobuchar @SenDanSullivan @SenDuckworth in a letter to DOD and the VA today, urging them to take immediate action to help make sure servicemembers and veterans exposed to burn pits receive care during the COVID-19 pandemic. https://t.co/I3GRMz2PGa","date":"Thu Jun 11 20:06:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our ethanol producers will help our country make it through the pandemic we are facing.","date":"Thu Jun 11 17:46:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I introduced legislation today with @SenJohnThune and others that would extend for two years the FDA’s guidance allowing for preparation of hand sanitizer products during the COVID-19 crisis. This guidance includes allowing ethanol production for hand sanitizer.","date":"Thu Jun 11 17:46:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: During these difficult times, access to mental health is critically important. Our bill would expand mental health care to folks in rural areas, like farmers and ranchers. https://t.co/pgLxOewudf","date":"Wed Jun 10 14:46:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, the Senate voted to confirm General Charles “C.Q.” Brown to be Chief of Staff of the @usairforce. General Brown is a well-respected and highly decorated combat pilot. Since 2018, he has served as Commander of Pacific Air Forces.","date":"Tue Jun 09 19:15:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I look forward to working with him and @SecAFOfficial as Ellsworth AFB prepares for the new B-21 Raider Bomber. https://t.co/yFlj3I3Wz8","date":"Tue Jun 09 19:15:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to Lincoln High School grad Julia Lair, who received an offer of appointment to the @NavalAcademy! We wish her all the best as she begins this next chapter. https://t.co/hzuWoDpGVu","date":"Mon Jun 08 19:36:32 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This is a great step forward. Lots more work to do!","date":"Fri Jun 05 15:20:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy #605Day! We are so lucky to get to call this great state our home. What do you love most about South Dakota? https://t.co/l4Jze9AI6i","date":"Fri Jun 05 14:06:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We continue to pray for George Floyd, for his family, for our country and for a permanent healing and understanding of all Americans, regardless of race. And we will renew our resolve to make our country better for future generations. This week's column: https://t.co/YV4mgZFR2u","date":"Fri Jun 05 13:48:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are wishing a very happy golden birthday to our sweet grandson Hendry, who turns 5 today! https://t.co/lxqE5CkJf9","date":"Fri Jun 05 13:33:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"🚨BREAKING🚨 \n\nhttps://t.co/sUk1QuZ6fJ","date":"Thu Jun 04 23:50:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, I joined @JerryMoran, @SenatorTester and some of our @SenateVA colleagues in a letter calling for @USGAO to review the VA's Native American Direct Loan program. https://t.co/vNyrGQmPN7","date":"Thu Jun 04 19:15:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The ticketing system for @POTUS @realDonaldTrump’s visit to SD for Mount #RushmoreFireworks celebrating Independence Day opens tomorrow morning. About 7,500 tickets will be available through a lottery system. More info from @SouthDakota tourism here:\nhttps://t.co/dNKrTTKN0T","date":"Thu Jun 04 16:04:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, Sen. Klobuchar and I introduced a bill to make sure servicemembers and veterans with previous exposure to burn pits receive the care they need during the coronavirus pandemic. More here: https://t.co/uKd43tm5Zo","date":"Wed Jun 03 21:07:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you’re a farmer or rancher and your operation has felt the effects of the COVID-19 pandemic, you can apply for direct relief through @USDA’s Coronavirus Food Assistance Program (CFAP). More information on the program here: https://t.co/sxe2gboIyy","date":"Wed Jun 03 16:04:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Ellsworth Air Force Base will be the home of the first two B-21 squadrons, one of the most advanced weapons systems that we have ever developed. This puts Ellsworth on the map for at least the next 50 years. https://t.co/6h2qOVCCG9","date":"Mon Jun 01 20:15:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We must recognize the criminal act causing the loss of George Floyd’s life and stand together seeking justice. We should all keep his family in our prayers. Our nation can do better.","date":"Sun May 31 17:57:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"When crimes like this occur, it is important that we continue to speak out. We must remember that violence and rioting are not the answer.","date":"Sun May 31 17:57:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The rioting which has occurred in many of our communities does not represent the heart of the people that call these communities home, but rather in many cases radical outsiders trying to further divide us. We cannot let this happen.","date":"Sun May 31 17:57:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Like many Americans, I am saddened and angered by the death of George Floyd. Watching the video displaying such reckless, unwarranted brutality at the hands of law enforcement made me sick to my stomach. Those responsible should be prosecuted to the fullest extent of the law.","date":"Sun May 31 17:57:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Let’s try this again! Due to weather, the launch has been rescheduled to today at 2:22 PM CT. Watch live here: https://t.co/nfdAbW5mMh","date":"Sat May 30 18:09:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As a member of the Senate Armed Services Committee, making sure the B-21 Raider program is fully funded and delivered on time has been, and will continue to be, a top priority for me. https://t.co/4tY7BqLV7z","date":"Fri May 29 23:47:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The reality is, our top industries in South Dakota – agriculture and tourism – rely on these programs to be successful. Here’s what South Dakota ag and tourism leaders had to say about our support for the H-2A and H-2B guest worker programs. https://t.co/dXQM8y4RBt","date":"Fri May 29 17:05:28 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A recent letter I signed with eight other colleagues caught national attention this week. These national stories made a number of false claims about the seasonal H-2A and H-2B guest worker programs.","date":"Fri May 29 17:05:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Prior to the COVID-19 pandemic, our economy was soaring. Jobs were being created, unemployment was at record lows and wages were rising. We believe that as soon as we can begin to fully reopen, our economy will come back stronger than ever. Read more here: https://t.co/Bb5gjf5cZe","date":"Fri May 29 16:39:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"That bill is one part of our plan to address cattle market pricing inconsistencies. We will also keep working toward mandatory country-of-origin labeling and a DOJ investigation into the meat packers. Read our op-ed here: https://t.co/z4uNAVztAA","date":"Thu May 28 17:36:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"COVID-19 has put our nation’s food supply chain to the test. The last thing we want to see during a global pandemic is a major food shortage. This crisis highlights the urgent need to pass our legislation that allows for sales of meat and poultry across state lines.","date":"Thu May 28 17:36:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The South Dakota Ellsworth Development Authority recently launched the Black Hills Wire – a website for the local military community to connect with businesses and events throughout the Black Hills of western South Dakota. Check it out!  https://t.co/jICqjdSDBp","date":"Thu May 28 13:59:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Earlier this week, the @realDonaldTrump administration announced $500 million in distribution to @IHSgov and tribal facilities around the country, to help support their ongoing COVID-19 response efforts.\nhttps://t.co/neQyUlQ7Gs","date":"Wed May 27 22:38:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we launch American astronauts from American soil on American rockets for the first time in nearly a decade as the @SpaceX #DragonCrew takes off for the International Space Station. Scheduled takeoff is 3:33 p.m. CT today - watch live: #LaunchAmerica\nhttps://t.co/nfdAbW5mMh","date":"Wed May 27 19:51:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we launch American astronauts from American soil on American rockets for the first time in nearly a decade as the @SpaceX #DragonCrew takes off for the International Space Station. Scheduled takeoff is 3:33 p.m. CT today - watch live: #LaunchAmerica\nhttps://t.co/nfdAbW5mMh","date":"Wed May 27 19:51:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"37 Planned Parenthood affiliates wrongly applied for and received $80M in PPP loans meant to help small businesses keep employees on the payroll during this pandemic. I urge SBA to fully investigate and take necessary action.","date":"Wed May 27 18:34:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m glad to see @realDonaldTrump take action to reduce insulin costs for seniors. Lowering prescription drug costs continues to be a top priority for me. I’ll continue working across the aisle to make sure life-saving prescription drugs are more affordable for all South Dakotans.","date":"Wed May 27 18:32:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenTomCotton in calling for a DOJ investigation into why and how Planned Parenthood accessed PPP loans despite knowing they’re ineligible.","date":"Wed May 27 18:06:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last week, Jean and I traveled to the Mayo Clinic in Rochester, Minn., for Jean’s 90-day post-radiation checkup. After a series of important tests, we are thankful to share the news that Jean’s cancer treatment has remained successful!","date":"Wed May 27 14:24:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The past year has been the toughest one we’ve faced. We’re grateful for all the prayers &amp; support we’ve received. We feel very fortunate for the care we’ve received from our doctors both at Mayo &amp; here in SD. Thank you to all the folks that continue to keep those prayers coming!","date":"Wed May 27 14:24:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On Memorial Day, we honor the brave Americans who made the ultimate sacrifice in service to our country. We are eternally grateful to them for defending our freedoms and keeping us safe. https://t.co/zEXBE67iFD","date":"Mon May 25 14:00:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last week, I introduced bipartisan legislation to bring back MCOOL in the US. I’ve appreciated the ongoing support and working relationship with cattle producers as we’ve worked on this, as well as other issues to help address the cattle market crisis.\nhttps://t.co/VPhm6y7Lrl","date":"Sat May 23 00:49:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, the Senate unanimously passed legislation to stop Chinese companies from trading on U.S. stock exchanges if they don’t follow the rules – which American companies are required to follow.","date":"Fri May 22 17:11:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"China continues to cheat every chance it can get. This is one step we can take to hold them accountable.","date":"Fri May 22 17:11:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy 60th birthday to my friend, @Hrbie14! Look forward to sharing the field with you this fall! https://t.co/XFDZNXzrtl","date":"Thu May 21 15:04:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Overregulation hurts businesses, stunts economic growth and stifles innovation. I thank @realDonaldTrump for taking bold steps to remove regulatory barriers, which will help get our economy back on track. https://t.co/t5vBD9UXVe","date":"Wed May 20 18:01:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Appreciate the support of @RCALFUSA, the SD Stockgrowers Association and ranchers across the state of South Dakota. Great to be building a united front on this issue! \nhttps://t.co/eluQkrcsvp","date":"Wed May 20 02:13:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are forever grateful to the men and women who serve our country in the armed forces. Thank you! #MilitaryAppreciationMonth","date":"Tue May 19 19:52:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our producers raise some of the best beef in the world but they’re at a disadvantage when it comes to marketing their meat at the store. Reinstating MCOOL would improve food security, increase transparency &amp; bolster supply chain issues. This is a win for producers &amp; consumers.","date":"Tue May 19 16:06:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"About to ask questions at our Senate Banking Committee hearing. Treasury Secretary @stevenmnuchin1 and @federalreserve Chairman Jerome Powell are testifying to discuss implementation of the CARES Act &amp; re-growing our economy post-COVID-19. Tune in here: https://t.co/4kcv3B4f1h","date":"Tue May 19 15:03:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Chinese Communist Party has conducted a cultural genocide against the Uyghur people &amp; persecuted over 1 million Uyghurs in prison camps. Last week, we passed legislation to send a strong message to CCP officials that this behavior is unacceptable &amp; will no longer be tolerated","date":"Tue May 19 14:51:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ll be on @keloradio this morning around 9:15 CT. Tune in! https://t.co/3R11BSiQ6Q","date":"Tue May 19 13:32:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m live on @keloland discussing the ongoing COVID-19 crisis with @SenJohnThune and @RepDustyJohnson. https://t.co/hDbBSDgdyN","date":"Tue May 19 00:26:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"She looks like a good hunting dog! You two can join us for pheasant season in South Dakota this fall.","date":"Mon May 18 16:59:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As Americans focus on keeping their families safe and healthy during the COVID-19 pandemic, I’m working to remove some of the roadblocks livestock producers are facing so that they can continue to provide high quality food for families across the country. https://t.co/xP1KDE57kK","date":"Fri May 15 17:36:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On this day 72 years ago, the modern State of Israel was established. Israel is our strong ally and a source of stability in a region full of turmoil. I look forward to continuing this great relationship. 🇮🇱\nhttps://t.co/dtjusZUtMc","date":"Thu May 14 19:00:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below tonight at 7:40 p.m. CT/6:40 p.m. MT. https://t.co/MGNvrrk800","date":"Thu May 14 00:26:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 \nPin: 115923 \n\nListen to the telephone townhall live and ask an online question: https://t.co/jMqnnGylAH","date":"Thu May 14 00:26:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Lee/Leahy amendment makes much-needed reforms to the foreign surveillance system to protect Americans from these types of civil liberty violations from happening again. Read my full statement here:\nhttps://t.co/EtkSV1cMa3","date":"Wed May 13 22:09:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The FBI’s gross mishandling of the FISA process when it surveilled President Trump’s campaign has underscored the need to reform the entire process.","date":"Wed May 13 22:09:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It started with a bad FISA warrant when, according to the IG at the DOJ, FBI employees made substantial misrepresentations to the affidavits they submitted to the court in order to get approval to surveil the Trump campaign. This type of behavior should appall every one of us.","date":"Wed May 13 22:09:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I just voted in favor of the Lee/Leahy amendment to the FISA reform bill. This amendment provides federal law enforcement with the tools they need to protect Americans from foreign powers while also better protecting the civil liberties of all Americans.","date":"Wed May 13 22:09:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Re-implementing MCOOL would bring back laws and regulations that required retailers to inform customers what country beef commodities originated in, providing more transparency to American shoppers and giving American producers a competitive edge.","date":"Wed May 13 21:51:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read my full statement here: https://t.co/U0NQfXOBmC","date":"Wed May 13 21:51:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This legislation is the broadest and strongest bipartisan support we’ve seen for MCOOL since it was eliminated in 2015, and it begins the critical and necessary discussion on food security in America. This is a win-win for producers and consumers.","date":"Wed May 13 21:51:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I introduced a resolution today with @SenatorTester, @SteveDaines, @SenJohnThune and @SenBooker to support mandatory country of origin labeling for beef products in the US in an effort to provide critical support to American cattle producers hurt by the COVID-19 pandemic.","date":"Wed May 13 21:51:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Investing in Chinese companies = Supporting the Chinese Communist Party. @realDonaldTrump showed leadership by protecting the savings of federal employees by stopping investments into companies that, at the direction of the CCP, spy on Americans and conduct human rights abuses.","date":"Wed May 13 20:29:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined my friend @chuckgrassley to introduce a bill that will provide necessary transparency in the cattle industry so producers get paid a more fair price for their product. https://t.co/rzvPrmWlHW","date":"Tue May 12 21:57:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @DeptVetAffairs launched a new mobile app today designed to help veterans and civilians cope with feelings of stress and anxiety they may be experiencing during the COVID-19 pandemic. More info here: https://t.co/kcfqKCx1ZJ","date":"Tue May 12 21:25:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Since calling for a DOJ investigation back in March, a growing number of colleagues have been urging for an investigation into whether a packer oligopoly exists in the cattle market. Joined a letter supporting a DOJ investigation w/ @SenatorFischer, @SenJohnThune &amp; others today.","date":"Tue May 12 20:55:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks, @jiminhofe, for your leadership on this issue. Taiwan has been a reliable partner in the global fight against COVID-19. https://t.co/JHvDdcGUHf","date":"Tue May 12 18:10:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great news for the Black Hills! Thanks to federal funding through @USDA, a $4.4 million broadband expansion will be conducted by @SDNcomm to make sure residents of the Black Hills and tourists visiting the region have access to reliable connectivity.\nhttps://t.co/cqqd5LyV8m","date":"Tue May 12 16:34:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Introduced a bill allowing states to use part of their previously-appropriated COVID-19 relief funds to recoup lost state, local &amp; tribal tax revenue. My bill, supported by @govkristinoem, does not spend new money or bail out fiscally-irresponsible states. https://t.co/PRyXQTgMUX","date":"Tue May 12 13:57:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During National Police Week, we take time to appreciate the men and women who dedicate their lives to protecting our communities and keeping us safe. Thank you for your service. https://t.co/WDmR1Mw7zD","date":"Tue May 12 13:14:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Read our letter here: https://t.co/N5QEbLGeT8","date":"Mon May 11 22:24:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I sent a letter to Senate Majority Leader Mitch McConnell and Senate Minority Leader Chuck Schumer, urging them to pass the New Markets for State-Inspected Meat and Poultry Act as part of the federal government’s COVID-19 response efforts.","date":"Mon May 11 22:24:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans who haven’t received their economic impact payment: The IRS has set a deadline of this Wednesday at noon to submit banking information so you can receive your payment via direct deposit. Submit your information here: https://t.co/KtcfbDwT0r","date":"Mon May 11 17:30:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today I joined @ChuckGrassley and 12 of our bipartisan colleagues in a letter to Congressional leaders, urging indemnity support for pork producers who are being forced to depopulate livestock herds because of processing plant closures due to COVID-19. https://t.co/JvUQB4rukA","date":"Mon May 11 16:26:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Kent - you have great taste. 👍🏻","date":"Fri May 08 16:48:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The actions taken by China’s government to cover-up the coronavirus and its spread aren’t just negligence – they are criminal in nature. China must be held accountable. Read more in this week's column: https://t.co/bX1nzL3ZLk","date":"Fri May 08 13:23:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This #NationalDayofPrayer, I encourage all South Dakotans go offer a prayer of thanks for all the gifts the good Lord has given us. https://t.co/XWJ4dLSYhB","date":"Thu May 07 18:06:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"View my full statement here: https://t.co/b0BK2CjmwO","date":"Thu May 07 15:33:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great news - @POTUS @realDonaldTrump has asked the Department of Justice to investigate suspicious meat packer pricing activity. Thank you, @realDonaldTrump, for continuing to stand up for our farmers and ranchers!","date":"Thu May 07 15:33:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In March, I sent a letter to the DOJ asking for this investigation to take place. The disparity between the price of meat at the store vs. what the producer gets for his or her product is very concerning. It’s time we know why this is happening so we can fix it once and for all.","date":"Thu May 07 15:33:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Jean and I live in Fort Pierre, and we love spending time with our kids and grandkids on the Mighty Mo! What’s your favorite place to visit in South Dakota? #NTTW20 #HiFromSD #SpiritofTravel https://t.co/XvEMMYFsVq","date":"Thu May 07 15:33:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"China's cover-up of the COVID-19 crisis isn't just negligence, it's criminal in nature. We must hold China accountable. https://t.co/5ptGrIHfYi","date":"Thu May 07 14:19:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are eternally grateful for all our nurses, especially now as they are on the front lines fighting the COVID-19 pandemic. #NationalNursesDay https://t.co/0JwiZUN8az","date":"Wed May 06 21:19:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923\n\nListen to the telephone townhall live:\nhttps://t.co/jMqnnGylAH","date":"Wed May 06 21:13:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall with @SenJohnThune and @RepDustyJohnson to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below.","date":"Wed May 06 21:13:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In South Dakota, we raise more cattle than we have people, yet our consumers still can’t buy the meat they want at the store. Our ranchers are losing upwards of $400 per head on cattle while the big four packers are selling boxed beef at record prices. Something isn’t right here.","date":"Wed May 06 02:22:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you would like to participate, all you need to do is call in or click on the link below. \n\nCall into the telephone townhall at: 877-229-8493 \nPin: 115923\n\nListen to the telephone townhall live: \nhttps://t.co/jMqnnGylAH\n  \n*the link will be live 10 minutes before the call.","date":"Tue May 05 23:51:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live, toll-free telephone townhall with \n@SenJohnThune and @RepDustyJohnson tomorrow, May 6, at 4:20 p.m. CT/3:20 p.m. MT, to discuss the federal response to the ongoing COVID-19 crisis. https://t.co/wkRP0wAAtg","date":"Tue May 05 23:51:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Kim, thank you for your years of public service. You have spent your career advocating for your fellow farmers and ranchers. Jean and I wish you all the best whatever your next chapter may be.\n https://t.co/9F9oLDTqJI","date":"Tue May 05 23:37:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ll be live on @KOTARadio today around 4:40pm MT. Tune in or listen online at https://t.co/PXoNrumjxf","date":"Tue May 05 22:12:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m inviting South Dakota veterans to join me for a live, toll-free tele-townhall today at 3:00 p.m. CT/2:00 p.m. MT to discuss the ongoing COVID-19 pandemic and its impact on veterans. I’ll be joined by representatives from the @VASiouxFalls and the @VABlackHills. https://t.co/YkPTVd7QWC","date":"Tue May 05 18:24:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Participants can join the tele-townhall by calling in or clicking on the link below:\n\nCall #: 877-229-8493\nPin #: 115923\nParticipate online:\nhttps://t.co/jMqnnGylAH","date":"Tue May 05 18:24:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to 13 year old Madison Grimm from Burbank, South Dakota, on winning the National Junior Duck Stamp Art Contest. Her painting of a wood duck will now grace the 2020-2021 Junior Duck Stamp. https://t.co/qseS7AWR92","date":"Tue May 05 17:37:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today and every day, we thank South Dakota’s teachers who work tirelessly to educate our children. #NationalTeacherDay #TeacherAppreciationDay https://t.co/FjwXfUOpo4","date":"Tue May 05 15:59:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Cattle producers are seeing record losses, while the price of beef at the store is at a record high. The four big packers stand in the middle, controlling the market. Status quo isn’t working for producers or consumers. The DOJ needs to act to protect the integrity of the market.","date":"Mon May 04 22:36:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During #NTTW2020, we celebrate the communities, businesses &amp; people that make South Dakota a great place to visit &amp; and the best place to live! We look fwd to when we can safely travel around the state to support the hardworking folks in our tourism industry. #HiFromSD https://t.co/KCywH8sf0U","date":"Mon May 04 21:18:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Participants can join the tele-townhall by calling in or clicking on the link below:\n\nCall #: 877-229-8493\nPin #: 115923\nParticipate online:\nhttps://t.co/jMqnnGylAH","date":"Mon May 04 15:21:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m inviting South Dakota veterans to join me in a live, toll-free tele-townhall on Tuesday, May 5, at 3:00 p.m. CT/2:00 p.m. MT to discuss the ongoing COVID-19 pandemic and its impact on veterans. I’ll be joined by representatives from the @VASiouxFalls and the @VABlackHills. https://t.co/45H66cQutP","date":"Mon May 04 15:21:33 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"There’s no better place to celebrate America’a birthday. We look forward to having you, @realDonaldTrump!","date":"Fri May 01 18:02:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \n\nListen to the telephone townhall live and ask a question:\nhttps://t.co/jMqnnGylAH\n\n*the link will be live approximately 10 minutes before the call begins.","date":"Thu Apr 30 20:29:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below.","date":"Thu Apr 30 20:29:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The link will allow you to listen to the call live &amp; submit questions for me to answer.\n\nCall into the telephone townhall at: 877-229-8493 \nPin: 115923\n\nListen to the telephone townhall live: https://t.co/fq19EutamH\n\n*the link will be live approximately 10 minutes before the call","date":"Thu Apr 30 15:39:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live, toll-free telephone townhall today at 3:50 p.m. CT/2:50 p.m. MT, to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below. https://t.co/KIOuBNFZ29","date":"Thu Apr 30 15:39:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, @SenKevinCramer and I sent a letter to @USTreasury Secretary Mnuchin, urging Treasury to distribute the $8B allocated for tribes in the CARES Act in a fair and equitable manner to the 12 Bureau of Indian Affairs Regions. Read our letter here: https://t.co/4j3TNZMq7l","date":"Wed Apr 29 14:44:32 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below.","date":"Wed Apr 29 00:18:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live:\n\nhttps://t.co/jMqnnGylAH","date":"Wed Apr 29 00:18:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll be joining @WNAX today around 5:15 CT. Tune in at https://t.co/kP3POMuGP4","date":"Tue Apr 28 22:01:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll be live on @todayskccr in about five minutes for the monthly \"Ask the Senator\" show. Join us online or at 1240-AM: https://t.co/9zF5Z2nTtV","date":"Tue Apr 28 18:55:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If this applies to you, be sure to provide your information to the IRS by May 5 to receive the additional payments for children. https://t.co/KtcfbDwT0r","date":"Tue Apr 28 17:46:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans who receive Supplemental Security Income or are VA beneficiaries, and who have not filed a 2018 or 2019 tax return, are eligible to receive $500/dependent age 16 and under.","date":"Tue Apr 28 17:45:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \n\nListen to the telephone townhall live and ask questions: https://t.co/jMqnnGylAH\n\n*the link will be live approximately 10 minutes before the call begins.","date":"Tue Apr 28 16:17:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live, toll-free telephone townhall tonight at 7:40 p.m. CT/6:40 p.m. MT, to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below. https://t.co/PUnG3LCMJt","date":"Tue Apr 28 16:17:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In addition to asking the administration to provide assistance to producers, today I called for the food supply industry to be declared an essential industry by invoking the Defense Production Act.\nhttps://t.co/MqDhPrgeDm","date":"Tue Apr 28 01:17:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tune in later today! I look forward to answering your questions. https://t.co/nC0qiZrzYU","date":"Mon Apr 27 16:50:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’re glad that the rules have been modified so they can now be eligible to receive SBA loans to help get them through this time. \nhttps://t.co/7OO4swIaHM","date":"Mon Apr 27 15:27:28 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tribally-owned casinos and gaming operations in Deadwood, like all small businesses in South Dakota, are experiencing the impacts of COVID-19 right now.","date":"Mon Apr 27 15:27:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just sent a letter to @VP @Mike_Pence, who is leading the coronavirus task force, to emphasize the need to take immediate steps to address the nation’s food production crisis.\nhttps://t.co/V1VsXquTbh","date":"Sun Apr 26 19:44:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"More relief is on its way for South Dakota businesses--read more in this week's column: https://t.co/UwkZA8qtjI","date":"Fri Apr 24 18:12:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m glad the administration recognized our concerns and modified their rules to allow all gaming operations to apply for assistance under the PPP. This will provide a much-needed lifeline for our casinos and help keep hardworking South Dakotans employed during this difficult time","date":"Fri Apr 24 16:34:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Like every other sector of SD’s economy right now, our gaming facilities need relief. We raised concerns about initial guidance from SBA that prevented casinos like tribally-owned casinos &amp; those in Deadwood from receiving the same relief other small businesses are receiving.","date":"Fri Apr 24 16:34:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll be joining @MomentSDPB today around 11:06am CT to discuss COVID-19. Tune in! @sdpb https://t.co/bwis7XnpbP","date":"Fri Apr 24 15:56:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below.","date":"Thu Apr 23 18:59:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \n\nListen to the telephone townhall live and submit online questions:\nhttps://t.co/jMqnnGylAH","date":"Thu Apr 23 18:59:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you’re able, please check on your older friends, family and neighbors during this time to make sure they have food, medications and other supplies they may need.","date":"Thu Apr 23 18:00:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Helpful news for military families who are staying home with school age kids","date":"Thu Apr 23 17:45:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \n\nListen to the telephone townhall live:\nhttps://t.co/jMqnnGylAH\n\n*the link will be live approximately 10 minutes before the call begins.","date":"Thu Apr 23 17:22:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live telephone townhall today at 2:20 p.m. CT/1:20 p.m. MT, to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below. https://t.co/ZC1AhKi8te","date":"Thu Apr 23 17:22:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: I joined @SenAmyKlobuchar in a letter to VA @SecWilkie to urge the agency to make sure at-risk veterans who have been exposed to burn pits or other dangerous substances get the care they need during the coronavirus pandemic. https://t.co/WisBIqkt5P","date":"Wed Apr 22 21:08:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I support @POTUS @realDonaldTrump’s insistence on full accountability from the World Health Organization. @WNAX has the full story on my position:\nhttps://t.co/91G9cNDWqY","date":"Wed Apr 22 20:05:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During this challenging time, @SecondLady @KarenPence reminds us all to remember the importance of mental health. Read her op-ed here: https://t.co/N98LSkU5g2","date":"Wed Apr 22 18:18:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live:\n\nhttps://t.co/jMqnnGylAH","date":"Wed Apr 22 00:14:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below.","date":"Wed Apr 22 00:14:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Senate has approved additional $320 billion in funding for the PPP Small Business relief program including:\n- $250 billion for all small businesses\n- $60 billion specifically for smaller lending institutions","date":"Tue Apr 21 22:32:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It also provides $50 billion for Economic Injury Disaster Loans (EIDL) &amp; $10 billion for EIDL grants. IMPORTANTLY, it clarifies that agriculture enterprises are eligible for EIDL. I've been calling for extra assistance for ag producers, and I'm glad this was included.","date":"Tue Apr 21 22:32:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live: https://t.co/jMqnnGylAH\n\n*the link will be live approximately 10 minutes before the call begins.","date":"Tue Apr 21 20:36:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live telephone townhall on tonight at 7:30 p.m. CT/6:30 p.m. MT, to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below. https://t.co/xVYTP54Z6V","date":"Tue Apr 21 20:36:55 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota is home to some beautiful National Parks and National Monuments. While many of us are staying home right now, we can still celebrate #NationalParkWeek by downloading a background of our favorite park.","date":"Tue Apr 21 17:25:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenAmyKlobuchar in a letter to VA @SecWilkie today, urging him to make sure at-risk veterans who have been exposed to burn pits or other dangerous substances get the care they need during the coronavirus pandemic. Read our letter: https://t.co/UQkMK4lVrj","date":"Tue Apr 21 17:19:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Social Security beneficiaries who didn’t file 2018 or 2019 tax returns are still able to get $500/dependent to help during the coronavirus pandemic. Visit the IRS website before tomorrow, April 22, to apply for these funds: https://t.co/dWclB3TMDw","date":"Tue Apr 21 14:36:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While we practice healthy social distancing, it’s important we stay connected as a community:\n📞 Call your friends and family\n🍽 Order take-out from local restaurants\n🎁 Consider purchasing gift certificates from local businesses for future use","date":"Mon Apr 20 21:29:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Details of @USDA’s COVID-19 ag relief program have just been released. I look forward to reviewing their plan to make certain it meets the needs of South Dakota’s farmers and ranchers, whose recent struggles have been exacerbated by the COVID-19 pandemic.","date":"Fri Apr 17 23:40:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Due to COVID-19, the academy day events scheduled for this month are canceled, but interested students and parents can visit my website to learn more about our nation's service academies and the application process. More information here: https://t.co/DR5jkmPmMt","date":"Fri Apr 17 17:37:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During some of my recent telephone townhalls, we've asked medical doctors to join us to help answer South Dakotans' healthcare-related COVID-19 questions. In this week's column, we've rounded up some of our most asked questions w/ answers: https://t.co/3svoJJTDvs","date":"Fri Apr 17 14:43:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Fri Apr 17 00:26:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. If you would like to participate, all you need to do is call in or click on the link below.","date":"Fri Apr 17 00:26:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined my colleagues in bipartisan, bicameral a letter to @SecretarySonny urging USDA to take immediate action to assist our nation’s pork producers and maintain the pork food supply chain. Read it here: https://t.co/KALvGC2VI4","date":"Thu Apr 16 15:59:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks @POETbiofuels for donating hand sanitizer to Sioux Falls.","date":"Thu Apr 16 15:45:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live: https://t.co/jMqnnGylAH\n\n*the link will be live approximately 10 minutes before the call begins.","date":"Thu Apr 16 15:38:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be hosting a live telephone townhall on Thursday, April 16, at 7:40 p.m. CT/6:40 p.m. MT, to discuss the ongoing COVID-19 crisis, and I would like to invite you to join the call. If you would like to participate, all you need to do is call in or click on the link below. https://t.co/hzDpbJ2gk9","date":"Thu Apr 16 15:38:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I joined 34 of my Senate colleagues to send a letter to @realDonaldTrump, asking the administration to maintain pro-life protections during the search for treatments and cures for COVID-19. You can read our full letter on my website:  https://t.co/YxogK2ij7o","date":"Wed Apr 15 15:56:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @USTreasury and @IRSnews just launched the “Get My Payment” web app so you can check the status of your economic impact payment and enter your direct deposit information if needed. Learn more here ⬇\nhttps://t.co/KtcfbDOtRZ","date":"Wed Apr 15 14:18:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Many of them are currently working to combat COVID-19, leaving behind empty positions at IHS, the Bureau of Prisons and elsewhere.","date":"Wed Apr 15 13:11:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"U.S. Public Health Service officers play an integral role in providing health care to Native Americans through the Indian Health Service. During times of emergency, the officers may be called away from their regular post to help save lives here in the U.S. and around the world.","date":"Wed Apr 15 13:11:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In the CARES Act that passed last month, my legislation was included to create a \"ready reserve\" of medical professionals to fill in when USPHS officers are called away, so no patients go without needed care. Read more about it here: https://t.co/zz6gsYXaUW","date":"Wed Apr 15 13:11:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Call into the telephone townhall at: 877-229-8493 Pin: 115923 \nListen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Tue Apr 14 20:14:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m about to go live on a telephone townhall to discuss the ongoing COVID-19 crisis. I’ll be joined by doctors from @AveraHealth and @SanfordHealth. If you would like to participate, all you need to do is call in or click on the link below today at 3:30 p.m. CT/2:30 p.m. MT. https://t.co/Ht4ONnzJ8m","date":"Tue Apr 14 20:14:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you would like to participate, all you need to do is call in or click on the link below today at 3:30 p.m. CT/2:30 p.m. MT.  \n\nCall into the telephone townhall at: 877-229-8493 Pin: 115923\n\nListen to the telephone townhall live: https://t.co/jMqnnGylAH","date":"Tue Apr 14 12:53:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'm hosting a live telephone townhall today to discuss the COVID-19 crisis. I'll be joined by Dr. Jennifer McKay, Medical Information Officer at @AveraHealth and Dr. Mike Wilde, Vice President, Medical Officer of the @SanfordHealth Services Division for the Sioux Falls Region. https://t.co/2A6OQ02tzd","date":"Tue Apr 14 12:53:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Because of the coronavirus, we'll be celebrating Easter a little bit differently this year. https://t.co/j4RCUtQz64","date":"Fri Apr 10 12:42:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My tele-townhall is starting soon! I’ll be answering your COVID-19 related questions tonight at 7:40 PM CT/ 6:40 PM MT. I’ll be joined by special guest @SenBillCassidy. You can dial in 877-229-8493, PIN:115923 to join the call. You can also listen online: https://t.co/jMqnnGylAH","date":"Thu Apr 09 00:12:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Passover to all those celebrating. Your seder meal may look a little different this year, but I hope you are able to celebrate with a renewed spirit of hope and love. https://t.co/hAkLsBbfDr","date":"Wed Apr 08 23:37:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @USDA has put together a resource page with the latest COVD-19 response information for farmers and ranchers. It was recently updated to include the latest PPP information for our ag community. Find it here: https://t.co/SFkETYxyu9 https://t.co/NWrgZg1Frm","date":"Wed Apr 08 20:36:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today has been declared a Statewide Day of Prayer in South Dakota by @govkristinoem. During this time of uncertainty, we must continue to lift up in prayer all those impacted by the spread of COVID-19, especially those serving our communities on the frontline.","date":"Wed Apr 08 16:18:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I am hosting a live tele-townhall tonight at 7:40 p.m. CT/6:40 p.m. MT to discuss the federal government’s COVID-19 response. I'll be joined by @SenBillCassidy, who is a gastroenterologist. Hope you can join! https://t.co/UdICL8pOOE","date":"Wed Apr 08 13:30:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I joined a bipartisan group of my Senate colleagues today to send a letter to @USDA Secretary Sonny Perdue asking him to allocate additional funds to the biofuel industry so plants can remain open.\n\nhttps://t.co/kEnmoqVySe","date":"Tue Apr 07 22:00:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Supporting our biofuel plants during the coronavirus pandemic is important to South Dakota’s economy. Farm income and prices for corn and other crop commodities are directly linked to the health of the renewable fuel industry.","date":"Tue Apr 07 22:00:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I recently joined some of my Senate Veterans' Affairs Committee colleagues to urge the VA to implement a provision in the CARES Act that would help veterans access telemental health services during this COVID-19 pandemic.","date":"Mon Apr 06 21:29:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During this time of social isolation, veterans may be experiencing mental health challenges. It's important they get the help they need, when they need it. More here: https://t.co/1vcdwOrm1B","date":"Mon Apr 06 21:29:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota's farmers play a critical role in our nation's food supply chain, especially during times of crisis. I recently sent a letter to @SecretarySonny urging USDA to take action to protect the continuity of our food supply. https://t.co/amOLFjEG9C","date":"Mon Apr 06 21:13:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you’re a South Dakota small business with questions about the new Paycheck Protection Program to help you get relief during this difficult time, don’t forget to join my tele-townhall with SBA officials tomorrow morning! https://t.co/eLSyvfZvTe","date":"Mon Apr 06 01:38:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I am hosting a live tele-townhall for South Dakota Small Businesses on Monday, April 6, at 10 a.m. CT/9 a.m. MT to discuss the small business relief provisions in the Coronavirus Aid, Relief and Economic Security (CARES) Act.","date":"Sun Apr 05 15:52:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I will be joined by officials from the Small Business Administration to help answer your questions. Participants can join the townhall toll-free by phone: 877-229-8493 (Pin #115923) or online at the following link:\nhttps://t.co/xNkPtCt69M","date":"Sun Apr 05 15:52:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This isn't right. Leaving these types of small businesses out of important COVID-19 recovery efforts would be crippling for SD. I'm urging the SBA and Department of Treasury to allow gaming operations to participate in the newly-created Paycheck Protection Program.","date":"Sat Apr 04 21:47:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota small businesses: do you have questions about the new Paycheck Protection Program? I’m hosting a tele-townhall with SBA officials on Monday where we’ll be taking your questions. https://t.co/6630LgSlPd","date":"Sat Apr 04 21:22:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Stay tuned for updates, and in the meantime, information on the rule is available here: https://t.co/AD1Z3TBZy4","date":"Fri Apr 03 22:19:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Likewise, we understand the concerns of community banks, lenders and borrowers regarding the implementation of the PPP and the urgency of getting this program running to help businesses and employees.","date":"Fri Apr 03 22:19:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are in discussions with both the SBA and South Dakota lenders and borrowers, around the clock, to relay information in order to make certain the program works as intended.","date":"Fri Apr 03 22:19:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Banks and credit unions in South Dakota are reviewing this information and hope to be able to offer these loans. We understand that the SBA has been tasked with putting together a new, complex program in a short amount of time.","date":"Fri Apr 03 22:19:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last night, the SBA and Treasury Department issued interim guidance for local lenders regarding the Paycheck Protection Program to provide relief for small businesses.","date":"Fri Apr 03 22:19:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The CARES Act was signed into law last week to help every family and business impacted by the effects of COVID-19. I’ve created a hub on my website to answer questions about the CARES Act and its implementation. https://t.co/UpLWcDst1X https://t.co/WFnC1ySR1u","date":"Thu Apr 02 14:07:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Welcome news for SD Social Security recipients!","date":"Thu Apr 02 01:28:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Have questions about the economic impact payments authorized by the CARES Act? The IRS has helpful information to help answer your questions.\nhttps://t.co/y3EZ87hwxX","date":"Wed Apr 01 23:02:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I fought hard to make sure assistance for cattle producers was included in the COVID-19 relief package that was signed into law last week.","date":"Wed Apr 01 19:47:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I joined more than 140 members of Congress in a letter urging USDA Secretary Sonny Perdue to act swiftly to implement the provisions included in the CARES Act so our cattle producers get the help they need. https://t.co/lLFN4GFUUT","date":"Wed Apr 01 19:47:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today is #CensusDay! The 2020 Census is taking place as scheduled, &amp; the Census Bureau is working w/ health authorities to make certain the agency is following their guidance in relation to COVID-19. Find out more about how to respond &amp; why it’s important: https://t.co/3GK61pdWU5","date":"Wed Apr 01 19:11:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Proud to see this South Dakota business doing its part to combat COVID-19.\nhttps://t.co/RtAbXLbe0A","date":"Wed Apr 01 18:29:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our medical professionals are putting their lives at risk every day as they work to save the lives of others. We can’t thank them enough for the hard work they do every day to take care of us and our loved ones. #NationalDoctorsDay","date":"Mon Mar 30 17:50:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"COVID-19 relief is available for South Dakota families and businesses. Learn more here: https://t.co/3tDnKYv8If","date":"Fri Mar 27 23:26:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Ready Reserve Corps Officers will be able to fill in to make sure USPHS jobs continue to get done at federal facilities, including IHS hospitals and federal prisons. https://t.co/tB3rdThzxP","date":"Fri Mar 27 18:30:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It creates a Ready Reserve Corps within the US Public Health Service (USPHS), so that when USPHS Officers are dispatched to deal with emergency healthcare situations such as COVID-19, their positions won’t sit empty.","date":"Fri Mar 27 18:30:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A bipartisan bill I introduced w/ @SenDougJones was included in the CARES Act, soon to be signed by @realDonaldTrump.","date":"Fri Mar 27 18:30:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"3M is producing 35 million N95 masks per month to keep our healthcare workers and others on the front lines battling COVID-19 safe. Thank you, @3M.  https://t.co/r7qGKoAtNr","date":"Fri Mar 27 17:52:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Best GEN Modular in Rapid City &amp; Watertown is now making temporary hospital rooms to help fill shortages throughout the country. They’re prepared to make 5000 rooms right now. Thank you, @BestGenModular.  https://t.co/Fjh64as0A6","date":"Fri Mar 27 17:43:51 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I agree with my friend @ChuckGrassley. Something’s not right. Let’s get to the bottom of this and make it right.","date":"Fri Mar 27 16:07:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Some great information on who is eligible for rebates and how families will receive them. https://t.co/0daln1t4fU","date":"Fri Mar 27 16:00:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll be live on @keloradio at 8:05 CT this morning, visiting with Greg Belfrage. Tune in! https://t.co/29dqRFbcya","date":"Fri Mar 27 12:53:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"News for SD farmers: FSA is extending loan application deadlines to provide flexibility during this time of uncertainty. https://t.co/KGHTLajXBQ","date":"Thu Mar 26 21:44:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great story about @agtegra donating N95 masks to local health care facilities and nursing homes. Thank you, Agtegra, and all South Dakotans who have stepped up to help their neighbors during this time. https://t.co/V9pL6mdKZR","date":"Thu Mar 26 13:49:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The federal government has a responsibility to act in emergency situations, such as this, to protect lives and safeguard our country from undue harm. Tonight, the Senate fulfilled this important duty.","date":"Thu Mar 26 03:50:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In the history of our nation, we’ve never faced a challenge we weren’t able to overcome. The COVID-19 crisis is no different. No one is immune to the disease or its impact on our everyday lives. We’re in this together, and we’ll get through this together.","date":"Thu Mar 26 03:49:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m glad we were able to come together to provide immediate, direct relief to South Dakota families and businesses, while at the same time taking steps to stabilize our economy.","date":"Thu Mar 26 03:49:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just voted in favor of the COVID-19 relief legislation. As a nation, we’re all feeling the effects of this unprecedented crisis.","date":"Thu Mar 26 03:49:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It's not a perfect bill, but it gets resources to state and local governments, who know the needs of their communities better than anyone else. It also removes regulatory barriers so businesses can get people the help they need during this time of crisis. https://t.co/kB7telrt8J","date":"Thu Mar 26 03:49:22 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ve been fighting to make sure our cattle producers were included in our COVID-19 relief bill, &amp; I’m glad they’ll finally be able to get the direct support they need to offset the losses created by the lack of overseas markets, attributed to the spread of COVD-19. My full stmt: https://t.co/ZyT9RHccqp","date":"Wed Mar 25 20:29:36 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"“When America most needs bipartisan cooperation, Democrats add to the economic uncertainty by putting their partisan interests above the needs of the country.” - @WSJ editorial https://t.co/ttSlIWVDvI","date":"Tue Mar 24 20:01:49 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota’s farmers and ranchers work nonstop to feed and fuel our world. Especially during times like these, we’re grateful to them for making sure families have safe, reliable access to food. #thankafarmer #thankarancher #NationalAgDay #AgDay20","date":"Tue Mar 24 15:21:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"You’re either helping right now, or hurting. Pelosi’s handpicked partisan ploys are helping no one. She’s hurting American families by prioritizing airplane emissions, same day voter registration &amp; wind energy tax credits over #coronavirus relief. #StopTheGamesNancy, #PassTheBill","date":"Tue Mar 24 14:00:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"American families and businesses are suffering. Now is not the time to make liberal demands that have nothing to do with addressing this urgent crisis.","date":"Mon Mar 23 15:41:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: I held a call yesterday to discuss our three-pronged approach to address the cattle market crisis. You can listen to the full call here: https://t.co/92obAecz4P","date":"Sat Mar 21 01:05:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Small Business Administration approved Gov. Noem’s request to activate the Economic Injury Disaster Loan program for South Dakota small businesses following our delegation’s letter to them earlier this week. Business owners can apply for a loan here: https://t.co/Mr4SM8JSSC","date":"Fri Mar 20 21:55:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, I submitted bipartisan legislation that would help offset the losses being felt by our cattle producers due to the COVID-19 outbreak. Read the full bill here: https://t.co/QfYkyhVUxd https://t.co/T0t4ODyden","date":"Fri Mar 20 21:09:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Anyone with federal student loans can now suspend their monthly payments without penalty for the next 60 days.","date":"Fri Mar 20 20:47:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Just met with our Republican conference. We are staying for the weekend and committed to getting a vote on the Phase 3 economic security package in the Senate by Monday with preliminary votes anticipated over the weekend.","date":"Fri Mar 20 20:06:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Because of the COVID-19 crisis, @realDonaldTrump’s administration has postponed Tax Day to July 15. Individuals, families and businesses now have additional time to file taxes without penalties.","date":"Fri Mar 20 16:47:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: Cattle producers in SD are experiencing huge prices drops right now. I’ve laid out a plan to help them recover.","date":"Fri Mar 20 14:52:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tele-heath services can help during the COVID-19 crisis. https://t.co/du5GyVObCi","date":"Fri Mar 20 13:48:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota’s cattle producers are facing unprecedented challenges. I’ve launched a three-pronged approach to help them weather this storm. Learn more here: https://t.co/wQwyVmZoYf","date":"Thu Mar 19 19:40:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Sent a letter to @realdonaldtrump today in support of Mandatory Country of Origin Labeling. Since MCOOL’s repeal, SD’s beef &amp; pork producers have been at a competitive disadvantage. Consumers deserve transparency, which MCOOL would provide.","date":"Thu Mar 19 18:28:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Only beef &amp; pork that comes from the US should have a “Product of the USA” label. Read my letter here: https://t.co/0fK4H2u4r4 https://t.co/XGs08gE6kx","date":"Thu Mar 19 18:28:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good information from @CDCgov about how to best care for your health when at home.\nhttps://t.co/IwZcVLf8SR","date":"Thu Mar 19 15:39:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, @SenJohnThune, @RepDustyJohnson &amp; I sent a letter to @SBAgov urging quick approval of @govkristinoem's request for Economic Injury Disaster Loans during the COVID-19 pandemic. South Dakota’s small businesses need our support during this time. https://t.co/HE8XnGcDCH","date":"Thu Mar 19 14:35:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"During times of uncertainty, South Dakotans do what South Dakotans do best. Grateful for those who are helping their neighbors.\nhttps://t.co/hcTcHUNCvT","date":"Thu Mar 19 13:17:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Some members of my staff are recommending that I listen to Dr. Fauci on today’s @PardonMyTake. What do you think? 🤔","date":"Wed Mar 18 21:33:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A good reminder: if you are sick, stay home!","date":"Wed Mar 18 21:25:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Most importantly, it will deliver immediate relief to South Dakota families and workers and provide free COVID-19 testing kits that will help us track and stop its spread.","date":"Wed Mar 18 20:45:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We must continue to work together, in a bipartisan manner, to find timely, targeted solutions that keep South Dakotans healthy and help struggling businesses across the state.","date":"Wed Mar 18 20:45:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We continue to work on additional measures to address the effects of COVID-19, including legislation to provide economic relief.  Every family and business, both ag and non-ag, has been impacted by the spread of COVID-19.","date":"Wed Mar 18 20:45:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While the COVID-19 crisis is unlike any other we’ve seen in modern times, American resilience remains strong. We settled the West, put a man on the moon and won two World Wars. There’s no challenge we can’t overcome when we put our minds to it.","date":"Wed Mar 18 20:45:20 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This bill, which was negotiated between House Democrats and the Trump administration, is far from perfect. However, as we seek to address our country’s urgent needs in the wake of COVID-19’s spread, I believe it does more good than bad.","date":"Wed Mar 18 20:45:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This afternoon, I voted in favor of the Families First Coronavirus Response Act. It now heads to the president’s desk for signature.","date":"Wed Mar 18 20:45:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We continue working to provide relief to those who have been hurt as a result of COVID19. I'm in close contact w/ SD business &amp; stakeholders to hear their ideas on the best way to help. Spoke w/ @SDRetailers &amp; look forward to talking w/ tourism folks &amp; tribal leaders later today. https://t.co/CNnmDze2xp","date":"Wed Mar 18 19:10:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Learn how you can help “flatten the curve” and prevent the spread of #COVID19.\n\nhttps://t.co/gGdrkrgZCr","date":"Tue Mar 17 21:04:34 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great informational video explaining COVID-19 and how to stop it from spreading.","date":"Tue Mar 17 19:24:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We're continuing to monitor the CDC's latest guidance on #COVID19, and are regularly updating our website for South Dakotans: https://t.co/ScaQEywPhd","date":"Tue Mar 17 14:21:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"According to the CDC, COVID-19 is primarily spread through human-to-human contact. Limiting social interactions and maintaining distance between yourself and others are two impactful ways you can minimize your chance of getting or spreading the disease. \n\nhttps://t.co/o7AeCKi7ve","date":"Mon Mar 16 23:18:32 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As Americans, let’s join together on this National Day of Prayer, recognizing our continued need for Divine providence.","date":"Sun Mar 15 19:50:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, an agreement was reached between the House and the @realDonaldTrump @POTUS administration on a coronavirus aid package. I look forward to reviewing the legislation in the coming days to make certain it is in the best interest of South Dakotans.","date":"Sat Mar 14 01:41:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A great program in Rapid City is helping single parents complete their college degrees. https://t.co/8nXAXLvkL0","date":"Fri Mar 13 14:54:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We believe in giving all Americans access to affordable, reliable health care coverage that put patients in control of their healthcare decisions. More in this week's column: https://t.co/tfKfUrXqie","date":"Thu Mar 12 20:42:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This month marks the 10-year anniversary of #Obamacare being signed into law. Over the past decade, Obamacare has led to higher premiums, fewer healthcare choices and millions of Americans losing the health insurance they enjoyed.","date":"Thu Mar 12 20:42:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday to the @GirlScouts! We are grateful for the work the Girls Scouts have done to develop young women in South Dakota and across the country for the last 108 years.","date":"Thu Mar 12 16:44:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"March is Women’s History Month. From the beginning, women have made significant contributions to our nation and our world, and they continue to do so today. #WomensHistoryMonth https://t.co/mKxtckBEO9","date":"Wed Mar 11 22:01:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The Hot Springs VA facility provides vital services to veterans across the region. Joined @SenJohnThune &amp; @RepDustyJohnson in sending a letter to @SecWilkie today to thank him for his recent visit to Hot Springs, and for committing to review the Record of Decision. https://t.co/gJHdNjLM2B","date":"Wed Mar 11 18:57:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Border security is national security. Glad to see @realDonaldTrump’s border wall system is working. \n https://t.co/UTfoPetFdD","date":"Wed Mar 11 17:40:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans will begin receiving information in the mail for the 2020 Census soon. Your responses to the questionnaire help the federal government know how much and what types of resources are needed in communities across the country. https://t.co/HU1RhZC6lt","date":"Wed Mar 11 17:16:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to @SDCoyotesWBB on winning the Women's Summit League Tournament Championship. Best of luck as you head to the tourney! #GoYotes #WeAreSouthDakota","date":"Tue Mar 10 22:53:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While we recognize that there will be economic impacts throughout the United States, the most important things we should focus on right now are saving lives and appropriate healthcare needs. https://t.co/6gXsJkORyt","date":"Tue Mar 10 22:37:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’ll continue working with federal administration officials, state officials, tribal leaders and healthcare providers to make sure we’re doing all we can to take care of our citizens.","date":"Tue Mar 10 22:37:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans should continue to take care of their health during this time. This includes washing your hands frequently, avoid touching your face and stay home if you feel sick. Additionally, avoid close contact with large groups of people if possible.","date":"Tue Mar 10 22:37:40 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last week, we passed legislation to provide state and local entities with additional resources to save lives and prevent the spread of disease. Additionally, health officials are actively working on a vaccine and advanced therapeutic treatments.","date":"Tue Mar 10 22:37:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakota has five confirmed cases of #COVID19. The state of South Dakota has been preparing to deal with a COVID-19, as has the federal government.","date":"Tue Mar 10 22:37:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"While we want to see a permanent fix for the H-2B visa program going forward, this announcement is a step in the right direction. I will continue to work toward a permanent solution to make sure South Dakota employers are able to access H-2B visa workers when they need them.","date":"Tue Mar 10 20:21:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: South Dakota tourism and construction businesses received news last week that more H-2B visas are available for seasonal guest workers than last year, and the visas are being released at an earlier date. https://t.co/0RB5XF6v4r","date":"Tue Mar 10 20:21:46 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Both @realDonaldTrump &amp; @VP attended our Senate lunch today to give us an update on the administration’s COVID-19 response. https://t.co/2ouI233neK","date":"Tue Mar 10 18:35:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Here’s one way you can make sure you’re washing your hands correctly. I recommend Good Vibrations by The Beach Boys. 😎","date":"Tue Mar 10 17:38:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"https://t.co/Qzu8afE8y2","date":"Tue Mar 10 00:12:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Proud to join @SenThomTillis in sponsoring this disaster mitigation bill.","date":"Mon Mar 09 21:45:29 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Let's #GoJacks!","date":"Mon Mar 09 19:57:10 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck @SDCoyotesWBB!","date":"Mon Mar 09 17:20:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Remember to set your clocks one hour ahead tonight as we #springforward.","date":"Sat Mar 07 14:00:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to South Dakota State and The University of South Dakota this weekend at the Summit League tournament in Sioux Falls.","date":"Fri Mar 06 17:00:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Looking for an easy way to protect yourself and others from getting sick? Wash your hands frequently! Regularly and thoroughly clean your hands with an alcohol-based hand sanitizer or wash them with soap and water. https://t.co/sLoquRUQhn","date":"Fri Mar 06 15:00:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to Stanley County student Trevor Caldwell, who will be competing in the state National Geographic Geography Bee on March 27!\n https://t.co/J8Ai1DPVjs","date":"Thu Mar 05 21:59:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As the #coronavirus continues to spread across the world, we should take precautions to stay healthy. This week's column is about protecting your health during this time: https://t.co/NcEnUKOBXC","date":"Thu Mar 05 20:41:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The #Senate just passed a supplemental funding bill that will provide additional resources to respond to the COVID-19 outbreak. We’re continuing to monitor the situation closely to make certain the health of Americans is the top priority.","date":"Thu Mar 05 19:41:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"For the first time in more than four years, @NASA is accepting applications for the next class of American Astronauts. Applications are open until March 31. This is your chance to #BeAnAstronaut! https://t.co/7Qt2RSMWzB","date":"Thu Mar 05 18:52:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I worked in the insurance business for most of my career. It's a great industry to work in!","date":"Thu Mar 05 16:28:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Wondering how to best protect yourself from COVID-19? Helpful tips in this video! https://t.co/PpHG2JQSED","date":"Thu Mar 05 14:56:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I agree with Chief Justice Roberts. It is absolutely inappropriate for any senator to make threatening comments about a member of the Supreme Court or any member of the judiciary.","date":"Wed Mar 04 23:11:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"As flooding concerns rise, we continue to closely monitor the Corps’ actions along the Missouri River. https://t.co/llfE6aRSR2","date":"Wed Mar 04 20:42:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The CDC recommends everyday preventive actions to help prevent the spread of respiratory viruses, including: Avoid touching eyes, nose &amp; mouth; wash hands w/ soap &amp; water for at least 20 seconds; clean &amp; disinfect frequently touched objects &amp; surfaces.\n\nhttps://t.co/H1dMiZWxqf","date":"Wed Mar 04 16:05:45 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Intro'd legislation w/ @SenatorFischer, @SenatorSinema  &amp; others to increase access to respirators, or masks. As the number of confirmed cases of COVID-19 rises in the US, making sure SDians have access to reliable equipment if needed is vitally important. https://t.co/EPl73lcKAL","date":"Wed Mar 04 14:39:39 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"ICYMI: We had a great visit with @SecWilkie yesterday at the Hot Springs VA. Appreciate the commitment from Secretary Wilkie to keep the Hot Springs facility open. https://t.co/jkoen3maOS","date":"Wed Mar 04 00:45:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good luck to the @nsuwolves_mbb team as they play in the @NorthernSunConf Championship at the @SanfordPentagon this evening. #GoWolves","date":"Tue Mar 03 22:36:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"3M employees in Aberdeen are playing an important role in the global fight against COVID-19 by working nonstop to create additional face masks to protect health care workers who are in close contact with sick patients.\nhttps://t.co/KXBzfeBCXC","date":"Tue Mar 03 22:18:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I appreciate @VP Mike Pence for briefing us on COVID-19 during lunch today. While the threat in the U.S. remains low at this time, it’s important to remain vigilant and make certain the federal government is fully prepared to respond appropriately to the virus.","date":"Tue Mar 03 19:20:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thank you, @SecWilkie, for visiting the campus today to see what a wonderful opportunity the VA has here to provide meaningful services for veterans. We hope Hot Springs remains \"The Veterans Town\" for years to come. https://t.co/CbgaONu1ZX","date":"Mon Mar 02 22:54:17 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In 2016, the @DeptVetAffairs announced their \"Record of Decision\" to reduce services in Hot Springs. \n\nWe have always disagreed with this decision. This community and its people are uniquely positioned to serve veterans in the Black Hills region. https://t.co/CYdua5Wsqw","date":"Mon Mar 02 22:54:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Joined @SenJohnThune and 13 of our colleagues in sending this important letter to #USDA regarding their decision to lift the ban on Brazilian beef.","date":"Fri Feb 28 19:32:58 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A great opportunity for high school students to get involved in preserving history!\n\nhttps://t.co/2hCiK7Fd5W","date":"Fri Feb 28 17:02:03 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Americans who value their freedoms should be concerned by the current Democrat nominees running for president this year. “Championing socialist policies is the new normal in today’s Democratic Party.”-- \n@yalinunez\n\nhttps://t.co/vzRnPrgoWd","date":"Fri Feb 28 14:53:34 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We have a special guest columnist for this week's column, my wife Jean. She shares her appreciation for everyone who has supported her and our family as she has gone through cancer treatment: https://t.co/9NYxHM9Gew","date":"Thu Feb 27 20:38:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Children in the Pierre and Fort Pierre area can visit the Delta Dental mobile truck from March 2-6 to receive free dental care. Thank you to Delta Dental of South Dakota for providing an important service for children across our state.\n\nhttps://t.co/4B9yaTL01d","date":"Thu Feb 27 20:31:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Yesterday, a federal appeals court ruled that the Trump administration can withhold federal grants from sanctuary jurisdictions who refuse to cooperate with U.S. immigration enforcement. This is great news for the rule of law. Read more via @WSJopinion\n\nhttps://t.co/WNQ1yCnmPJ","date":"Thu Feb 27 17:53:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see @realDonaldTrump choose \n@VP Mike Pence to lead the government’s #coronavirus response. As we respond to its spread, we must remain vigilant and work together to protect Americans.","date":"Thu Feb 27 16:30:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations to Harrisburg High School senior Pierce Okken, who received an offer of appointment to the U.S. Air Force Academy! https://t.co/2pfnlJNLd1","date":"Wed Feb 26 15:23:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Dems also blocked our bill that would require doctors to care for babies born during an attempted abortion, just as they would care for any newborn baby. No baby that is born should ever be left to die. I believe that life begins at conception and all life has value.","date":"Tue Feb 25 21:43:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We must seek to protect and save lives whenever possible. These are important issues that we must keep working toward in the Senate.","date":"Tue Feb 25 21:43:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The true test of a society is how we treat the most vulnerable among us. I’m disappointed that our colleagues on the other side of the aisle blocked our legislation to limit abortions after 20 weeks, as studies show unborn children can feel pain at that stage of pregnancy.","date":"Tue Feb 25 21:43:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Will be live on @todayskccr in about ten minutes. Tune in! https://t.co/7zYYM78uMA","date":"Tue Feb 25 19:51:16 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"It’s National #FFAWeek! Great to meet such sharp young men and women. https://t.co/zEepUvOAIa","date":"Tue Feb 25 19:46:38 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Don’t forget! Ag producers and private landowners have until Friday to contact their local @USDA service center about signing up for the Conservation Reserve Program in 2020. Find your local office: https://t.co/lhXTFM31Uf","date":"Tue Feb 25 18:33:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great meeting with South Dakota representatives of the @DAVHQ today. As a member of the @SenateVA, I’ll continue working to make sure the VA is working for ALL veterans. https://t.co/AhiEW97JKd","date":"Tue Feb 25 16:37:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A great message of sportsmanship and a special victory for Mason Mahnke! Really proud of these young men. https://t.co/iI02trUu7G","date":"Mon Feb 24 22:43:13 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We're continuing to work to protect the integrity of our election process. More here: https://t.co/fh5JvMp36R","date":"Fri Feb 21 14:54:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congratulations, Paul! Decisions about our water and land are best made at the local level. South Dakota will be well-represented with you on the advisory board.","date":"Wed Feb 19 21:06:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'm honored to receive the True Blue award from @FRCdc.  Promoting policies that put families first is very important to me. https://t.co/kx1T3cyl8c https://t.co/gCrRcKz4Lq","date":"Tue Feb 18 15:34:54 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Presidents’ Day! https://t.co/o1eIKDyX52","date":"Mon Feb 17 15:08:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Thanks for all you do for South Dakota, Denny!","date":"Sun Feb 16 19:22:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Met w/ Captain America today for his new civics platform called A Starting Point. It will feature videos of elected leaders giving brief, straightforward takes on issues important to South Dakotans and all Americans. Thanks Chris Evans &amp; Mark Kassen for inviting me to participate https://t.co/DGEP0aM5mf","date":"Thu Feb 13 17:51:10 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We are a nation of laws. If state and local governments fail to uphold laws that seek to stop dangerous criminals and keep families safe, there should be consequences. These laws are on the books to improve public safety and strengthen national security. https://t.co/MgERA4zM8h","date":"Wed Feb 12 22:33:18 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Legislation I introduced today w/ @SenThomTillis and others will help to make sure federal funds continue to go toward eligible projects even after they’ve already been started, which makes the entire process more efficient. https://t.co/OpaRWT2jES","date":"Wed Feb 12 22:13:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"South Dakotans know all too well the damage that can be done by Mother Nature. When storms strike, communities work to rebuild as quickly as possible. State &amp; local govt shouldn’t have to wait on the federal govt to start simple construction projects following a natural disaster.","date":"Wed Feb 12 22:13:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Four more well-qualified judges confirmed today by the #Senate. We’ll continue to do our part to put fair-minded judges on the federal bench who are committed to upholding the rule of law.","date":"Wed Feb 12 19:15:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Had a great meeting w/ @SecretarySonny and a number of my Senate colleagues this afternoon about ag labor shortages plaguing South Dakota and other states. Look forward to continue working w/ them to make certain our ag labor needs are met.","date":"Wed Feb 12 19:15:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congrats to Ethan Wipf of Rapid City, who received an offer of appointment to the U.S. Air Force Academy. I was proud to nominate Ethan as my principal nominee is USAFA. We wish him all the best as a cadet! https://t.co/M1p420st5e","date":"Wed Feb 12 16:28:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Members of the U.S. military are some of the brightest and best-trained individuals our country has to offer, and a college degree can help them secure good jobs following their service to our nation. Proud that @DakotaState has been named a Military Friendly School!","date":"Tue Feb 11 19:51:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"At the South Dakota Wildlife Expo Saturday, I ran into Madeline Loewe from Lennox, who just received a fully qualified offer of appointment to the U.S. Naval Academy. I nominated her as my principal nominee to the Naval Academy. Great to see you, Madeline! Keep up the great work! https://t.co/xtmEDDuV6R","date":"Tue Feb 11 01:59:14 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I met with House and Senate pages at the Capitol in Pierre on Friday. Pages are high school students who assist members of the South Dakota State Legislature. I also got to see my nephew Nolan, who was a House Page this session. https://t.co/iH4NwxJgZo","date":"Sun Feb 09 19:52:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good to see so many familiar faces at the Capitol in Pierre yesterday! https://t.co/F6dDHnKWw5","date":"Sun Feb 09 03:10:10 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I had a great time at the Black Hills Stock Show yesterday. It was nice to see so many South Dakotans! https://t.co/Rh5sKDafkG","date":"Fri Feb 07 23:34:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On Monday, the Senate will keep confirming @realDonaldTrump’s well-qualified judges. So far we’ve confirmed 187 federal judges since the president took office. The decisions they make will have lasting impacts for generations to come.","date":"Fri Feb 07 19:13:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The US economy added a record-setting 225,000 new jobs in January. This is great news, but we still have work to do on workforce development. Looking forward to getting back to work on this and other important issues in the Senate now that impeachment is over.","date":"Fri Feb 07 15:43:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"In Rapid City today on my favorite president’s 109th birthday. Looks like President Reagan is ready for the Black Hills Stock Show. https://t.co/EVoN1tLFP7","date":"Fri Feb 07 01:35:06 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy Birthday, President Reagan! https://t.co/LTLAosaKiT","date":"Thu Feb 06 15:22:12 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Voted to acquit @realDonaldTrump. Impeaching an elected official is incredibly serious, as it effectively overturns the will of the American electorate. The House failed miserably to make its case, and the Senate rightly voted to acquit the president. https://t.co/POj4G0t0LF","date":"Wed Feb 05 22:34:41 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, the Senate trial comes to an end. We have overwhelmingly rejected the articles of impeachment and can get back to doing the work Americans sent us here to do. And we have lots of work to do!","date":"Wed Feb 05 21:41:19 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great to visit with students and faculty from South Dakota's \n@SittingBullColl and #oglalalakotacollege during the National Tribal College &amp; University week. https://t.co/Ks6RURRM35","date":"Wed Feb 05 21:34:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Update on the #coronavirus from our Senate briefing this morning: https://t.co/V68lTl4vYs","date":"Wed Feb 05 17:19:05 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Last night’s #SOTU highlighted the positive impact GOP policies are having on American families—booming economy, trade deals being finalized, lower taxes, record-low unemployment, a strong military and increased border security. https://t.co/q6AX5waYXy","date":"Wed Feb 05 15:34:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This morning, the Senate EPW Committee is conducting an oversight hearing of the Fish and Wildlife Service.  Look forward to asking questions about the steps the agency is taking to improve their relationship with South Dakota landowners.","date":"Wed Feb 05 14:54:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I look forward to continuing to work with @POTUS and my colleagues on these and other issues to keep our country free and make it stronger and more prosperous for generations to come.","date":"Wed Feb 05 04:18:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"He also laid out a vision for the future that is pro-growth, pro-family, pro-life and pro-security. These values are South Dakota values.","date":"Wed Feb 05 04:18:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Tonight during his State of the Union Address, the president took the opportunity to outline many of these successes: a booming economy, lower taxes, record-low unemployment, a strong military and new trade deals that will benefit our farmers, ranchers and manufacturers.","date":"Wed Feb 05 04:18:26 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The American dream is alive and well thanks to the policies we’ve been able to enact during President Trump’s time in office.","date":"Wed Feb 05 04:18:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"She’s probably sick of hearing about all the winning – record low unemployment, booming economy, strong military, newer &amp; better trade deals. Limited government, pro-growth policies will secure a prosperous future – not socialist ideals and values.\n\nhttps://t.co/PsDVZObkuW","date":"Tue Feb 04 21:22:56 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congrats to @SDCoyotesFB alum @cstrevy on signing with @AZCardinals. May all your @NFL dreams come true!\nhttps://t.co/mfduvjp5ls","date":"Tue Feb 04 18:26:21 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see the Army Corps is planning a major study to provide recommendations on how to better reduce flooding along the Missouri River. https://t.co/q9pfEvYkxZ","date":"Tue Feb 04 16:53:44 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"11 cases of #coronavirus have been found in the U.S. so far. The spread of the virus has led the government to declare a public health emergency. More information on coronavirus here: https://t.co/5qS5S9oKR1","date":"Tue Feb 04 12:37:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Glad to see @DeptofDefense release version 1.0 of their Cybersecurity Maturity Model Certification #CMMC. This is a big step toward developing a framework for cybersecurity for the Defense Industrial Base as directed by my provision in the #FY20NDAA. https://t.co/osM9W4SRBU","date":"Tue Feb 04 03:31:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Sad to hear that political commentator Rush Limbaugh has been diagnosed with advanced stage lung cancer. Jean and I are thinking about you during this difficult time. https://t.co/5cYLAzBHSr","date":"Tue Feb 04 02:01:32 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"One of the best parts of the Super Bowl happened before it even started. Thank you, @NFL, for honoring the service of these great WWII veterans. https://t.co/Vbh5twwRp6","date":"Mon Feb 03 22:56:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll vote to bring the impeachment trial to a close and move forward to the question of acquittal. My full statement here: https://t.co/gvsvOUn2TD","date":"Fri Jan 31 13:48:23 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We're working for South Dakotans, even while the Senate is conducting the impeachment trial. If you need help dealing w/ a federal agency or just have questions for us, please reach out. Learn more about our casework services here: https://t.co/pa1VBPZiIN","date":"Fri Jan 31 13:20:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Block grants let states determine what works best for their citizens. Glad to see @realDonaldTrump @WhiteHouse @SeemaCMS take steps to allow states to convert part of their Medicaid funding to block grants. Looking forward to reviewing the proposal. https://t.co/X5tvStDgq7","date":"Thu Jan 30 16:04:48 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Our prayers are with his family, friends and fellow Airmen from the 37th Bomb Squadron at Ellsworth Air Force Base. https://t.co/mNyxO6oGHX","date":"Thu Jan 30 12:44:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Jean and I extend our heartfelt condolences to the family of the Ellsworth-based Airman who was killed flying a mission over Afghanistan. His service &amp; sacrifice for our country will never be forgotten.","date":"Thu Jan 30 12:44:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"On behalf of South Dakota’s farmers, ranchers and manufacturers, it was an honor to join @POTUS @realDonaldTrump at the White House today for the signing of the #USMCA trade agreement. https://t.co/5stDAjyLU6","date":"Wed Jan 29 21:01:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Honored to join @realDonaldTrump at the @WhiteHouse today for the signing of the #USMCA. This new agreement will expand trade opportunities for South Dakota’s farmers, ranchers and manufacturers. https://t.co/0bn4W0xwC7 https://t.co/EH3alAIhOI","date":"Wed Jan 29 17:20:53 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"At the White House now, where @realDonaldTrump will soon sign the #USMCA. This new trade agreement will expand markets for SD’s farmers, ranchers and manufacturers.","date":"Wed Jan 29 15:47:01 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Impeachment recap after day seven. https://t.co/K6UoDY7snJ","date":"Wed Jan 29 14:08:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Deeply disappointed to hear about the British government’s decision to allow China’s Huawei to build part of its 5G network. This threatens the national security of Britain, the U.S. and our partners across the globe.","date":"Tue Jan 28 19:34:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"China is not our friend – Huawei equipment gives them an open door to conduct espionage and interfere with critical infrastructure.","date":"Tue Jan 28 19:34:30 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Looking forward to joining @realDonaldTrump at the White House tomorrow for the signing of the #USMCA trade deal. SD’s farmers, ranchers &amp; manufacturers win with this deal.","date":"Tue Jan 28 16:47:42 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Great initiative started by Mayor @PaulTenhaken to better connect and improve the community of Sioux Falls.  Consider becoming a mentor today. You can make a difference.\n\nhttps://t.co/HmYZVNCFeE","date":"Tue Jan 28 16:28:07 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Congrats Specialist 1st Class Tony Curtis on being named Sailor of the Year!\n\nhttps://t.co/t8nBUCp2rV","date":"Tue Jan 28 16:10:04 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"If you need help navigating these federal programs, don’t hesitate to contact one of my offices. \n\nhttps://t.co/FmI4fpctMB","date":"Tue Jan 28 15:43:10 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today, @realDonaldTrump will release his Middle East peace plan. I look forward to reviewing it, and I commend the president for working on a path toward peace in a region of the world with a long history of conflict.\n\nhttps://t.co/disEAQnzyS","date":"Tue Jan 28 15:29:11 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I'll be live on @todayskccr in just over half an hour (9:30 CT). Tune in! https://t.co/9zF5Z2nTtV","date":"Tue Jan 28 14:55:50 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Happy birthday! We are grateful for the service of the brave soldiers and airmen who make up the South Dakota National Guard.","date":"Mon Jan 27 16:47:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"A great story out of Tolstoy, SD about friends working to raise money for a great cause!\n\nhttps://t.co/xeDSQB0Omu","date":"Mon Jan 27 16:37:02 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Jean and I are praying for Joyce Miller, wife of Rep. \n@JerryNadler, who was recently diagnosed with pancreatic cancer. We will keep them in our thoughts &amp; prayers during this difficult time.","date":"Mon Jan 27 16:29:27 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Earlier today, I participated in the 47th Annual Hour of Reflection, hosted by South Dakota Right to Life. All life is sacred and has value. Grateful we have a president who agrees. @POTUS @realDonaldTrump https://t.co/VJhFpef3Uc","date":"Mon Jan 27 00:28:31 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"My #ProLife views have been shaped by events in my own family, specifically my Grandma Georgiana. Check out this week's column to learn Georgiana's story: https://t.co/AnfF8EFyPp","date":"Fri Jan 24 16:43:57 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Want to know the story behind the fidget spinner? Watch my full interview on Fox Business from earlier today.\n\n#FidgetSpinner \n\nhttps://t.co/8thLacEYKp","date":"Fri Jan 24 16:35:37 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"The @EPA released their new rule to replace the previous admin’s overreaching #WOTUS rule. The new rule protects the rights of landowners, states and tribal governments. MORE: https://t.co/eqxdiwQOaC","date":"Fri Jan 24 16:29:09 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"This week, @RealDonaldTrump signed into law my bill w/ @SenatorTester to establish a grant program that helps to honor the lives of our nation’s veterans by sharing their stories of service &amp; sacrifice. Thank you to all who serve. https://t.co/jrNYRQORIn","date":"Fri Jan 24 16:20:43 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Proud to receive an “A” rating from @SBAList for my work on #ProLife policies. Life is a gift and should be treated with dignity from the very beginning to the very end. https://t.co/nzhLfv7mcm","date":"Thu Jan 23 15:53:59 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"We’ll continue working until all 500 stations are equipped with this vital equipment.\n\nhttps://t.co/atsDDeuWK5","date":"Wed Jan 22 16:32:52 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Since coming to the Senate, I’ve pushed the Corps to install the snowpack monitoring system so it can make better decisions and work to avoid future flooding. Glad to see they’re making progress &amp; the first weather station has been installed on SDSU’s campus.","date":"Wed Jan 22 16:32:24 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"All life is sacred and all life has value. I thank Gov. Noem for proclaiming January as Sanctity of Human Life Month in South Dakota. I am proud to be pro-life, and I’m working in the Senate to protect all lives—including the very young and the very old.\n\n https://t.co/ZV9q1ICRxv","date":"Wed Jan 22 16:23:08 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Good news for South Dakota farmers.\n\nhttps://t.co/R6YvWrfqLx","date":"Wed Jan 22 16:03:15 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"I’m confident that the organizing resolution will allow us to do our due diligence, bring this process to a close in a timely manner, and get back to doing the work that the people of South Dakota sent me here to do.","date":"Wed Jan 22 15:17:35 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Early this morning, just before 2am DC time, the Senate passed the organizing resolution outlining the next steps in the Senate impeachment trial, which closely follows the Clinton rules and allows for a fair, impartial process.","date":"Wed Jan 22 15:17:34 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Today we honor Dr. Martin Luther King Jr.’s legacy of service and his fight to protect the God-given rights of all people. Dr. King showed us that when we give back to our communities, our communities become stronger. #MLKDay https://t.co/RpOqEZHMFB","date":"Mon Jan 20 13:53:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Earlier today, I had the opportunity to speak at @SDCoopPower’s Annual Meeting. Rural cooperatives help power businesses and communities across our state. We are appreciative of the service they provide South Dakotans day in and day out. Thanks for having me! https://t.co/gL4GlLSvNk","date":"Sat Jan 18 00:06:47 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Finalizing trade agreements that give farmers &amp; ranchers a fair deal for their products is one of the final pieces of the puzzle that will allow the economy to reach its full potential. More in this week's column: https://t.co/BezgsmOlqL","date":"Fri Jan 17 14:03:00 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Freedom to practice religion without the fear of persecution is a fundamental human right and a pillar of our form of government in the United States. I’m proud to support a resolution in the Senate designating today, January 16, as Religious Freedom Day. https://t.co/CNOSNhmOOS","date":"Thu Jan 16 19:48:25 +0000 2020","user_id":"2955485182"},{"handle":"SenatorRounds","text":"Mexico and Canada are two of our most valued trading partners. Passing the #USMCA further solidifies our trade partnerships with them, and it upholds @realDonaldTrump's  commitment to making better, fairer trade deals for our producers and manufacturers. https://t.co/ETm3UHsvtj","date":"Thu Jan 16 18:23:21 +0000 2020","user_id":"2955485182"}]