[{"handle":"SenLummis","text":"People in WY deserve clear answers on how COVID-era policies will continue to impact their healthcare. I joined @SenJohnBarrasso in sending a letter to the Dept. Health and Human Services asking they provide Congress with that info. Read the letter ⬇️ \nhttps://t.co/faURqZBW0E","date":"Fri Jun 17 15:00:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Last August, the Senate faced its first challenge in regulating digital assets during the infrastructure bill debate. We didn’t provide the clarity industry needed then, but Lummis-Gillibrand fixes the broker definition and brings our financial system into the 21st century.","date":"Fri Jun 17 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People in Wyoming are now paying, on average, $4.82 a gallon for gas. \n\nWe must unleash American energy to lower gas prices.","date":"Thu Jun 16 20:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to legendary sports broadcaster Tim Ray on being inducted into the Wyoming Association of Broadcasters Hall of Fame this past weekend! \n\nhttps://t.co/Xe6ZfXvw3n","date":"Thu Jun 16 19:17:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is a tax on all Americans. When producer prices rise, that cost is passed to consumers. Today’s producer price index numbers from May show inflation isn’t slowing down, and the American people will continue to suffer from rising costs.\n\nhttps://t.co/2xmCMltJvJ","date":"Thu Jun 16 17:29:48 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"At 23 I met &amp; later married my husband, Al Wiederspahn, a Democrat who I ran against for the WY State Legislature. What happened to our country where we can no longer be friends, date, work with or even support people who are politically different from us.\nhttps://t.co/Ri6PcOiwhq","date":"Wed Jun 15 19:22:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"RFIA proposals introduce innovative digital asset regulation through ancillary assets https://t.co/xRcO3lTlFG","date":"Wed Jun 15 14:54:22 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Digital asset miners in WY are hooking their computers up to natural gas flares. This provides the power they need to mine their digital assets, and also keeps greenhouse gases out of the atmosphere. \n\nLummis-Gillibrand recognizes that innovation and encourages more.","date":"Wed Jun 15 14:10:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"What a reminder of the principles our nation was founded on. Grateful for those who sacrifice for everything this flag represents. https://t.co/nKsnGBGwnL","date":"Tue Jun 14 20:11:32 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"More than 34 million Americans report owning some form of digital assets. \n\nWe’re regulating this 21st century technology with 20th century regulations. It’s time for an upgrade, and the Lummis-Gillibrand plan accomplishes that.","date":"Tue Jun 14 16:05:46 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Record high gas prices, on top of out-of-control inflation, are crippling for the hardworking people of Wyoming. President Biden needs to fix this energy crisis he created. https://t.co/XSak7NrxEU","date":"Tue Jun 14 13:42:29 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Heads up! Yellowstone National Park has closed all entrances due to flooding.","date":"Mon Jun 13 20:18:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Any emerging industry comes with risks. The Lummis-Gillibrand plan sets up clear consumer protections while promoting innovation in the digital asset industry. This includes disclosures, regulatory sandboxes, and clear guidelines for regulators. \n  https://t.co/PziuTwn8Wd","date":"Mon Jun 13 15:09:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Americans continue to pay record high prices at the pump, but instead of moving our country toward energy independence, the EPA will not grant small refinery exemption relief to Renewable Fuel Standard mandates. We must end President Biden’s war on energy.","date":"Sat Jun 11 01:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/SGQMbphZKu","date":"Fri Jun 10 19:00:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Not a day goes by that I don’t hear from someone in Wyoming about how it is getting harder and harder to buy the everyday things they need. The best solution would have been to slow government spending months ago. The second best solution is to slow down government spending now.","date":"Fri Jun 10 17:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/dbAN8hWbbZ","date":"Fri Jun 10 15:23:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I'm saddened to learn of the tragic loss of U.S. Marine &amp; Buffalo native Seth Rasmuson. I'm praying for comfort over his friends &amp; family as they mourn. I take solace in Psalm 34:18, “The Lord is close to the brokenhearted &amp; saves those who are crushed in spirit.”","date":"Fri Jun 10 15:23:34 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We cannot rely on 20th century laws to dictate 21st century technology. The Lummis-Gillibrand framework is an important step towards securing America's financial leadership for generations to come.\n\nhttps://t.co/BYSo6a6RaG","date":"Thu Jun 09 22:00:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I agree with @SenToomey. We need real answers from the Fed about master accounts. Wyoming banks have been waiting for two years. They need to follow the law and respond to these requests.","date":"Thu Jun 09 20:48:09 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Tune in: I’m joining @cvpayne on @FoxBusiness at 2:25 p.m. to discuss the Responsible Financial Innovation Act!","date":"Wed Jun 08 18:21:15 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden continues breaking records, but not in a good way.\n✅ Record high inflation\n✅ Record high gas prices\n✅ Record high border crossings","date":"Wed Jun 08 17:23:13 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @SenGillibrand and @PostLive to discuss our digital asset framework. You can watch it live here ⬇️\n\nhttps://t.co/J8Dhmw7ew4","date":"Wed Jun 08 13:31:21 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Tune in: I’m joining @PostLive today at 9:25 a.m. alongside @SenGillibrand to discuss our digital assets legislation \nhttps://t.co/UKnk4fIsUl","date":"Wed Jun 08 12:39:33 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Two senators unveil their crypto regulation proposal https://t.co/e4uxBqZhXj via @YahooFinance","date":"Tue Jun 07 16:54:18 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today, I’m introducing the Responsible Financial Innovation Act alongside @SenGillibrand. The United States is the global financial leader, and it’s absolutely critical the U.S. plays a leading role in this new frontier. \n\nhttps://t.co/PziuTwn8Wd","date":"Tue Jun 07 12:38:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"As a former state treasurer, I am excited by the possibilities of incorporating digital assets into the American financial system. The legislation that @SenGillibrand and I are proposing will do just that.","date":"Mon Jun 06 21:35:11 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We’ve been teasing it for months, but the time is almost here – a proposal to fully integrate digital assets into our financial system. Excited to finally unveil this effort next week. Stay tuned 👀 👀 👀","date":"Fri Jun 03 15:31:57 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People in WY and throughout the country are suffering from record high inflation, out of control gas prices and a supply chain crisis. We need real solutions to these economic crises our country is facing, not a president boasting about a strong economy.\n\nhttps://t.co/OWA1M90G3y","date":"Thu Jun 02 16:51:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People across Wyoming rely on Community Health Centers for high quality health care in rural areas. I joined @SenStabenow in sending a letter in support of continued funding for the 1,400 community health centers around the country.","date":"Thu Jun 02 15:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Prices for flights are skyrocketing, and small communities around Wyoming are paying more and more. I wrote a @WashTimesOpEd about the need for reliable air service in rural communities. \nhttps://t.co/fcqEYA1s0c","date":"Wed Jun 01 19:00:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"There is a compassionate way to address the crisis at the border, but removing border protections isn’t it.","date":"Wed Jun 01 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"$60 billion collapse of major cryptocurrency is not the industry's Bear Stearns moment — senators and regulators explain why https://t.co/FP8qegdffb","date":"Tue May 31 17:47:35 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Digital assets are changing the game, and Congress needs to keep up if we’re going to continue to be the global financial leader. If you missed the panel I did at @Heritage with @CaitlinLong_ and @Saylor, you can catch it here: https://t.co/PG0uVTswRt","date":"Tue May 31 13:38:38 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"On this Memorial Day, may we stop and honor those who have given their lives to defend our great nation. I am taking an extra moment to remember Rylee McCollum, a marine from Jackson, WY who gave his life for his country in Afghanistan last August. https://t.co/13bCDX1qaP","date":"Mon May 30 14:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I am working diligently with @sengillibrand to finalize bill text of our comprehensive digital asset legislation. \n\nAny language circulating online is an incredibly outdated version from March 1. Stay tuned for our release of the actual bill on June 7th!","date":"Fri May 27 20:13:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"May is Military Appreciation Month, and I want to take this opportunity to honor those across Wyoming who have dedicated their lives, and sometimes given their lives, to defend our great country. https://t.co/1zMA7Gzfqk","date":"Fri May 27 19:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Instead of honoring our servicemembers as we head into the Memorial Day weekend, Senate Democrats tried to pass a bill that accuses our military and federal law enforcement of being white supremacists and neo-Nazis. This is shameful.\n\nhttps://t.co/6pv66mOKnZ","date":"Fri May 27 18:39:12 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I enjoyed my time with the folks at @AEI last week. Digital assets are here to stay and it’s high time that Congress catches up. Hear more about the framework @SenGillibrand and I are developing in this discussion. \n\nhttps://t.co/Xzf02OUSmf","date":"Fri May 27 18:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The EPA continues to attack WY's energy industry. This, in turn, will raise gas prices and harm families across WY and the nation. Joe Goffman authored the Clean Power Plan under Obama and has been actively trying to implement the damaging regional haze rules under this admin. https://t.co/DIraLmlqZ8","date":"Fri May 27 16:45:57 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My state policy director, @Tyler_Lindholm will be at the Sublette County Chamber of Commerce to talk about digital assets and how Wyoming is leading in this emerging industry. If you can’t attend in person, you can participate via zoom. Find out more here: https://t.co/6sbO9LD7ob","date":"Fri May 27 15:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The crisis at our southern border is still the top issue my constituents in Wyoming talk to me about. Border security is national security. It’s time to take this crisis seriously.","date":"Fri May 27 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We’re setting records again, but not for good reasons. The average price of gas in Wyoming is $4.30, up from $3.03 a year ago. It’s time to take up some of the legislation that my colleagues and I have introduced that would help ease this burden on people in Wyoming. https://t.co/QO6fuRRvIQ","date":"Thu May 26 18:35:24 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Did you know that my website has a grant guide for Wyoming businesses? Businesses, communities, and non-profits may be eligible for grants through a variety of federal programs. Find more information at https://t.co/9UUHJpK129.","date":"Thu May 26 15:50:10 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I am absolutely heartbroken after learning of this tragedy in Uvalde. I’m fervently praying for the families of those lost and those fighting for their lives.","date":"Wed May 25 13:00:10 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Gas prices won’t come down if we don’t make actual effort to unleash American energy. Happy to join @SenJohnBarrasso to fight for Wyoming and our energy industry with the Lease Now Act and the ONSHORE Act.\n\nhttps://t.co/9nbBJnwSS2","date":"Tue May 24 17:40:23 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Grateful to the @DigitalChamber for hosting @SenGillibrand and I today. \nDigital assets are non-partisan, so it’s important that any framework governing them is bipartisan. https://t.co/t6zQw2cjL8","date":"Tue May 24 15:57:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you to The @Heritage Foundation for inviting me to join their panel on “Bitcoin and the American Experiment.” So great to join @CaitlinLong_ and @saylor to discuss the future of Bitcoin in our American financial system. https://t.co/krkDerfECs","date":"Mon May 23 23:05:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I met with the Wyoming Association of General Contractors last week and they shared the struggle they’ve had securing construction materials to complete projects. When they do get the materials, they’re paying insanely high prices. Inflation is hurting people all across Wyoming.","date":"Mon May 23 18:01:30 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Thrilled to see my dear friend Ogden Driskill and his family inducted into the WY Cowboy Hall of Fame this year. Ogden embodies the cowboy way of life, and his contributions to NE WY and the state at large make him more than deserving of this honor. \nhttps://t.co/ibtUShPL8P","date":"Mon May 23 13:31:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Crypto has made unlikely allies of two US Senators, who say regulation is needed now more than ever after recent market turmoil https://t.co/LTkY72wZ4T via @bpolitics","date":"Fri May 20 19:33:57 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Due to inflation, Wyoming families will pay close to $5,200 more this year on goods they use every single day. https://t.co/rLn7bfSU4R","date":"Fri May 20 15:14:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on the Ukraine supplemental vote today: https://t.co/dQlaoWEet0","date":"Thu May 19 18:18:55 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People all across Wyoming invested their hard-earned dollars in major companies across the U.S., yet their voices are being co-opted by financial advisers with a partisan agenda. I joined @SenDanSullivan to make sure people in Wyoming have a voice in the companies they invest in.","date":"Thu May 19 16:34:47 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Homeland Security officials don’t have the resources they need to protect our borders. They’re so busy trying to slow the flow of migrants coming in over the border that criminals constructed tunnels right under their feet. \nhttps://t.co/XWvjq1Adqg","date":"Thu May 19 14:55:13 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Just because you say “free” over and over again doesn’t mean there’s not a price tag. https://t.co/UJVErtPnGg","date":"Wed May 18 18:34:13 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to Kelsey Brown of Shoshoni Elem. and Jeff Brazil of Jackson Hole HS for their nominations as National History Day Teachers of the Year. Thank you for your creativity, hard work, and love for your students.","date":"Mon May 16 14:51:34 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Can’t wait to join the folks at @AEI to talk about the future of digital asset regulation and my upcoming legislation to bring digital assets into the American financial system. \n\nRSVP here: https://t.co/qKxI1QPSFX","date":"Fri May 13 18:30:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Happy National Hummus Day! Remember - it’s Lummis like hummus! https://t.co/rTfQ56kNyb","date":"Fri May 13 15:52:22 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you to all the brave men and women who put their lives on the line every single day to to serve and protect communities and families around Wyoming. https://t.co/QhqzWtF7MS","date":"Thu May 12 17:30:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Most Americans believe there should be limits on access to abortion. Most of Europe limits access to abortions after 15 weeks. The legislation that Sen. Schumer called up is out of step w/ Americans &amp; abortion laws around the world. I voted no and I’m proud to stand up for life.","date":"Thu May 12 14:02:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Instead of focusing our attention on combatting rampant inflation, passing a budget or vetting federal nominees, Schumer is making it his top priority to force American taxpayers to fund abortions on demand up until the moment of birth. We need to get our priorities straight.","date":"Wed May 11 18:21:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"NASA came to the Aerospace and Defense Industry conferenced prepared with everything necessary to play astronaut for a moment! Thanks to all who participated in this conference and the hard work of the staff at Advance Casper! https://t.co/KjvmZ8IRZe","date":"Wed May 11 16:54:15 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Government spending has exacerbated an already bad situation. A situation that now necessitates high interest rates and a Federal Reserve induced recession. We need to learn from our mistakes and stop printing money like we won’t face consequences.","date":"Tue May 10 14:10:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Blanket bailouts of student loan debts don’t address the system that created this problem. Instead, it encourages institutions to raise tuition. We’ll be bailing borrowers out again if we bail them out now.","date":"Mon May 09 20:17:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Please join me in congratulating Casper’s Oliver Soulek. He's been selected to perform with the Middle Honors Junior Choir as part of the 2022 Middle School Honors Performance Series at Carnegie Hall in NYC. It’s incredible to see such talented young people come from our state! https://t.co/qdjVQsmSCE","date":"Mon May 09 16:13:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Happy Mother’s Day! It is such a joy to be a mother and a grandmother to two terrific little boys. \n\nHonoring all the mothers across Wyoming today. https://t.co/zB3gGEL0K8","date":"Sun May 08 11:44:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"2012: The IRS isn’t unfairly targeting conservatives 😉\n\n2022: The Department of Homeland Security isn’t going to unfairly target conservatives 😉\nhttps://t.co/F29jRrevQr","date":"Fri May 06 14:13:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"No one can “cancel” student loan debt. Someone has to foot the bill, and in this case, that someone is every American taxpayer. \n\nPeople who never took out student loans. \n\nPeople who have already paid their loan off. \n\nEveryone.","date":"Thu May 05 14:32:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Americans don’t need their speech monitored. They need their speech protected. \n\nSays so right here: https://t.co/TTXynO9ZW0","date":"Wed May 04 15:00:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The average recipient of a bachelor’s degree accumulates $36k in student debt. The average recipient of a doctorate accumulates $242k in student debt. This isn’t forgiveness for low-income Americans. It’s a bailout for top earners. #Bidenbailout","date":"Wed May 04 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"For the first time in two years, our economy shrank, though we were told all this government spending would help it grow. Trillions of dollars later, we are facing the consequences of this reckless spending.","date":"Tue May 03 16:40:27 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Gas prices are still sky high, yet instead of using his authority to make it easier for refineries to make gas, Biden added another hurdle by taking away any relief available for small, rural refineries. This isn’t the Putin Price Hike. This is the Biden Price Boost.","date":"Mon May 02 15:12:23 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The crisis at the border isn’t getting any better, and on May 23rd, the admin will roll back Title 42. This will worsen the issues border agents are combatting and will exacerbate the humanitarian crisis that’s occurring at the border. \n\nThis isn’t compassionate.","date":"Fri Apr 29 13:53:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"As the costs of goods and services continue to rise, Wyoming families are paying the price. https://t.co/9j8LQQGMCE","date":"Thu Apr 28 14:04:56 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"📺 About to join Larry Kudlow on @FoxBusiness. Tune in! https://t.co/fUN6fYWij3","date":"Wed Apr 27 20:13:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Another Congressional budget deadline has come and gone without even a whisper about Congress taking up a budget resolution. If you were in Congress, how would you structure a budget? Try your hand at this fun @budgethawks budgeting quiz: https://t.co/xy2HjOwtUc","date":"Wed Apr 27 19:48:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Attention high school students! Are you interested in attending a U.S. Service Academy or serving in ROTC? Join staff from my office as well as representatives from the military service academies and ROTC programs at this helfpul info session. \n\nhttps://t.co/AYZHDqiBiv https://t.co/srYtaD2yhL","date":"Wed Apr 27 15:32:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"An open border creates opportunities for drug cartels.\n\nAn open border creates opportunities for human traffickers.\n\nAn open border creates opportunities for criminals. \n\nPresident Biden, we need to secure the border now.","date":"Wed Apr 27 13:35:42 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The EPA continues to be anything BUT a good neighbor to western states. I will keep fighting these kind of misguided actions from the EPA.\n\nhttps://t.co/xJxmcD4BLH https://t.co/2HOtMdN4nY","date":"Tue Apr 26 15:27:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden claims to take the problem of high gas prices seriously. But when it comes to ensuring small refiners have the flexibility needed to produce gasoline at lower costs, President Biden has done just the opposite.\n\nhttps://t.co/wrDLweougU","date":"Fri Apr 22 20:22:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden is trying to quietly forgive student loan debt on high income earners while America’s attention is elsewhere. The student loan repayment pause already contributes to record inflation. Full out student loan forgiveness = more government spending = more inflation.","date":"Thu Apr 21 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My piece on this administration's continuing aggression toward our domestic energy industry. \n⬇️⬇️⬇️\n\nhttps://t.co/wrDLwep26s","date":"Wed Apr 20 18:27:28 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People in Wyoming are being crushed under the weight of inflation. The federal government needs to tighten its belt and stop its spending spree to rein in inflation and let people in WY get their feet back under them. https://t.co/SmAPaw2cV9","date":"Wed Apr 20 16:51:12 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We should maintain Title 42 until there is a process in place for efficiently handling an unexpected surge of migrants. We’ve seen too clearly that immigration authorities are completely overwhelmed by the crisis at our border. There is no accountability.","date":"Wed Apr 20 15:10:42 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Without a doubt, this is long overdue. Glad to see federal courts can still spot government overreach.\n\nhttps://t.co/BqW6m1EPYi","date":"Mon Apr 18 19:52:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Outdoor access bill backed by Barrasso, Lummis sails through Congress https://t.co/8PvdVBhoff via @kpvi","date":"Mon Apr 18 16:14:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"He is not here; he has risen, just as he said. Come and see the place where he lay. \nMatthew 28:6 https://t.co/QI21GJpnDl","date":"Sun Apr 17 11:55:50 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"While this decision is a step in the right direction, it comes nowhere close to making sure that we can meet our own energy demands. It’s an 80% reduction in available leases and a massive royalty rate hike.\n\nhttps://t.co/0UHgVE1fdN","date":"Fri Apr 15 22:21:46 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Since day one, I’ve called on President Biden to unleash our domestic energy supply, starting with the POWER Act to call on the Department of Interior to hold lease sales. I’ll keep banging the drum until we are once again energy independent.","date":"Fri Apr 15 22:21:46 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"May you have the opportunity today to reflect on the abundant and overwhelming love of God. https://t.co/WKizEr8z8s","date":"Fri Apr 15 12:37:41 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Last week, the White House announced that it would roll back Title 42 restrictions at our border. President Biden is bowing to pressure from the progressive wing of his party to stop enforcing our borders. He is playing a political game and the American people are going to lose.","date":"Thu Apr 14 14:10:30 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Answer: Bison!\n\nhttps://t.co/x1BiYqDytW","date":"Wed Apr 13 15:51:41 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We need a new approach that embraces Wyoming's energy abundance. American energy is not just good for our economy and international competitiveness. Making America energy dominant will increase our nation’s and our allies’ security.\n\nhttps://t.co/IPELqj37lo","date":"Wed Apr 13 14:18:49 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden promised no new taxes on middle class families in the US. But now, Americans are paying more for gas, for furniture, for groceries. Inflation is a crushing tax on all Americans and this administration is doing nothing to ease that burden. \n\nhttps://t.co/UlmQoXf7sV","date":"Tue Apr 12 14:05:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I am proud to announce that my longtime Field Representative, Jackie King, will take over as my State Director, effective immediately. Read my full statement here: https://t.co/mXjiclw9QB","date":"Mon Apr 11 15:36:45 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Had a great time speaking at the @TheBitcoinConf today. Looking forward to chatting with more participants this weekend! https://t.co/hf7C8sLeaM","date":"Fri Apr 08 23:18:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today’s #Yellowstone150thTrivia: \n\nYellowstone has the world’s largest free-roaming herd of what?","date":"Fri Apr 08 19:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Janet Yellen is facing the facts: digital assets are here to stay. For the US to remain the global financial leader, we must innovate. I’ll continue to monitor the Biden admin’s actions in the space, while working with @SenGillibrand &amp; others to create smart laws to govern it.","date":"Fri Apr 08 18:48:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/GfW4hFXnA9","date":"Fri Apr 08 18:48:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to all the impressive students who earned their Congressional Gold Medals. I’m honored to serve on the national board for Congressional Awards. It was very exciting to join Wyoming winners in their award ceremony this past weekend. https://t.co/Q4FxZWbBAt","date":"Fri Apr 08 15:00:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Last week, the House passed my bill to rename a federal building in Cheyenne for women’s rights pioneer Louisa Swain. I can't think of a better name for a federal building in the 1st state to recognize this right and enshrine full suffrage for women.\nhttps://t.co/d2R3sa9K81","date":"Fri Apr 08 13:31:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on the confirmation of Judge Ketanji Brown Jackson to the Supreme Court: https://t.co/9gkjzmpT6V","date":"Thu Apr 07 18:25:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Strategic Petroleum Reserve is at its lowest levels since the 1980s, and President Biden wants to release a million barrels PER DAY to try and put a band-aid on his bad domestic energy policy. He’s setting us up for an even bigger crisis down the road.\nhttps://t.co/v5yoerijof","date":"Thu Apr 07 15:42:09 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you to @MarkWarner, @SenatorSinema, and @SenatorHagerty for joining me on this bill.","date":"Thu Apr 07 13:39:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Last week, I introduced a bill to make it easier for main street businesses in Wyoming to access capital markets and take their businesses public. Small and mid-sized Wyoming businesses should have the same opportunities to go public as large corporations.\nhttps://t.co/zw7x3BETcC","date":"Thu Apr 07 13:39:14 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Do you think you can budget better than Congress?\n\nHa! Of course you can. The @budgethawks have great exercises to test your federal budgeting prowess. \n\nhttps://t.co/ngBRWOwq2U","date":"Wed Apr 06 16:11:07 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Attacking oil companies for NOT producing after years of attacking oil companies FOR producing is a hot take.","date":"Wed Apr 06 15:05:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"🧶 https://t.co/KYQNwPimkO","date":"Tue Apr 05 19:00:33 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m on with @cvpayne on Making Money! Tune in! https://t.co/kOOQRsDPV0","date":"Tue Apr 05 18:28:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Digital assets are here to stay. This technology creates opportunities for nearly every sector in our economy. It reduces clearing time for transactions, it opens up opportunities for the unbanked, and creates new potential for businesses and jobs around the country.","date":"Tue Apr 05 13:24:45 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ve been pushing for months to get federal workers back into offices and back to work for the American people. It’s better late than never, but people in WY have been waiting for far too long to get the help they need from the people who are supposed to be working for them.","date":"Mon Apr 04 19:10:22 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today’s #Yellowstone150thTrivia:\nYellowstone National Park is bigger than which two states combined?","date":"Mon Apr 04 16:44:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People know why they’re paying more for the things they need every day. https://t.co/g1vKRclZFn","date":"Mon Apr 04 13:56:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Financial Innovation is nonpartisan, so regulating it has to be bipartisan.","date":"Fri Apr 01 14:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Fed needs to direct its attention to its original mandate, not partisan ends. \n\nMore in my op-ed here: https://t.co/Fa4IVKMSfi","date":"Fri Apr 01 14:26:07 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Biden’s Budget:\nRaise for our troops – 4.6%\nRate of inflation – 7.6% \n\n*Fine print: that’s not a raise. That’s not even a cost-of-living adjustment*","date":"Fri Apr 01 13:15:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Biden's moves to try to tamp down gas prices met with skepticism in Wyoming https://t.co/71golN2SpJ","date":"Fri Apr 01 12:57:48 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is not a solution. If the President wants to get serious about addressing energy prices in our country, he needs to roll back the anti energy actions he has issued since day one. Tapping into our reserves just puts us at a disadvantage for a real crisis down the road.","date":"Thu Mar 31 20:52:28 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Interesting video about the big things that are happening in Wyoming!","date":"Thu Mar 31 19:59:20 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Got a sneak peak at the White House's vision board from their budget planning meeting. It's scarier than I expected. https://t.co/cm94gbexaG","date":"Thu Mar 31 13:27:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Looking forward to the conversation!","date":"Wed Mar 30 21:45:06 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"It was great to have the opportunity to talk through the future of digital assets with @SenGillibrand last week. If you missed it, check out the @PoliticoLive recap at https://t.co/FrZhxa3XpM","date":"Wed Mar 30 17:52:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"A tax on unrealized capital gain = a tax on potential profit on an investment. The Biden administration is optimistically banking on all of its proposals raking in more than $2.5 trillion, though this unrealistic tax structure will shift money overseas, not into the Treasury.","date":"Wed Mar 30 13:35:34 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"For some light reading on direct taxation: \nhttps://t.co/Ckdb5lwxUV","date":"Tue Mar 29 20:18:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The President’s wealth tax is a direct tax (but not apportioned among the states) that he’s trying to sell as a constitutional income tax. He should ask himself if a 20% tax on unrealized capital gains is even constitutional? \n\nFrom what I remember from law school, probably not.","date":"Tue Mar 29 20:13:30 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I loved serving with Don Young when I was in the House. I’ll miss his sense of humor and his dedication to the wonderful state of Alaska. I took a moment to say goodbye as he was lying in state in the Capitol Rotunda today. Rest in peace my friend.","date":"Tue Mar 29 18:00:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden said it was time to get back to normal, yet federal agencies are still working from home. This means long wait times and insufficient responses to my constituents’ requests. I introduced the HERD Act to get federal employees back to work. It is long past due.","date":"Tue Mar 29 14:44:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Some things never change. \n\nInstead of cutting spending to address our $30 trillion deficit, President Biden is once again calling for higher taxes and spending, at a time when inflation is at record levels. \n\nThe people in Wyoming deserve better.","date":"Mon Mar 28 19:36:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I know families across Wyoming are hurting as they fill their gas tanks. I’m working to find solutions that unleash America’s domestic energy industry and reduce our reliance on foreign sources for energy.","date":"Mon Mar 28 18:17:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"If you guessed baby bison, you’re correct!\n\nhttps://t.co/x1BiYqDytW","date":"Fri Mar 25 16:25:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"It's an honor to work with ⁦@SenGillibrand⁩ on this. \n\nBig things are coming. https://t.co/WtnKDbUCQC","date":"Fri Mar 25 00:06:10 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Gillibrand, Lummis plan new regulatory framework for crypto - POLITICO https://t.co/WtnKDbUCQC","date":"Fri Mar 25 00:00:29 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Right now in Wyoming, Bitcoin companies are using flared methane from natural gas operations to power their computers. They are keeping methane out of the atmosphere while actively mining Bitcoin. #POLITICOTech","date":"Thu Mar 24 21:52:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"In Wyoming, sharing is caring, so I promise, no one is trying to steal anyone’s lunch. Don’t worry @SenGillibrand. Though you heard it here first, Wyoming or bust.  #POLITICOTech","date":"Thu Mar 24 21:43:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"➡️ @SenGillibrand “We want to create a functional system so that people want to have their business in the U.S.”\n#politicotech","date":"Thu Mar 24 21:29:21 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"If you can’t join us in person, tune in live here!","date":"Thu Mar 24 21:13:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today’s #Yellowstone150trivia: \n\nIn the springtime, @YellowstoneNPS is full of “red dogs.” What park resident is this referring to?","date":"Thu Mar 24 18:46:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Looking forward to this discussion with @SenGillibrand tonight!","date":"Thu Mar 24 16:47:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"➡️Is it the Supreme Court’s job to fix vague laws enacted by Congress, or should Congress be held accountable for doing its job badly?","date":"Thu Mar 24 14:09:48 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"➡️Are there certain legal questions you feel you would need to recuse yourself from should they come before the Court?","date":"Thu Mar 24 14:09:48 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m not on the Judiciary Committee, so I don’t have the opportunity to question Supreme Court nominee Ketanji Brown Jackson on the record, but if I were, I’d ask the following:","date":"Thu Mar 24 14:09:47 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"➡️It is important that the Supreme Court doesn’t become another political body. Do you commit to using your seat on the Supreme Court to faithfully interpret the Constitution and adhere to our founding documents?","date":"Thu Mar 24 14:09:47 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Madeleine Albright was a trailblazer as the first female Secretary of State and was a role model for many. My prayers are with her family as they mourn her passing.","date":"Wed Mar 23 18:58:38 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is a tax on all Americans.","date":"Wed Mar 23 15:10:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Ag is a way of life in Wyoming and being from an ag family has influenced every step I have taken in life. It is not an easy lifestyle, but it is worth it. Thanks to all the ranchers across the great state of Wyoming, and happy National Agriculture Week! https://t.co/g3XLol6qku","date":"Tue Mar 22 16:59:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Yesterday’s #Yellowstone150trivia answer is Steamboat Geyser!\n\nIts major eruptions shoot water more than 300 feet.\n\nhttps://t.co/SAlbE2dVLy","date":"Tue Mar 22 14:24:45 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today’s #Yellowstone150trivia: Which geyser, which is found in @YellowstoneNPS, is the largest in the world?","date":"Mon Mar 21 20:53:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"People across Wyoming are facing higher prices on gas, on groceries, and on goods they need every day. There’s no one quick fix, but cutting red tape and getting more trucks out on the road will help ease the pressure on our supply chains. \n\nhttps://t.co/o2VK7wpfaj","date":"Mon Mar 21 16:12:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"If you guessed every 1-2 hours, you’re spot on! \n\nhttps://t.co/yi8mLnFeFK","date":"Mon Mar 21 14:36:17 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Don Young was always the most remarkable example of how to do that effectively. He leaves an incredible legacy behind him. Praying for his family right now. 2/2","date":"Sat Mar 19 11:39:18 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Don Young was all Alaska, all the time. He fought for decades to defend Alaska's lands and resources. As a former at-large member myself, I know the particular challenges of serving an entire state with only the resources of a House office. 1/","date":"Sat Mar 19 11:39:17 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Excited to tune into Diners, Drive-ins, and Dives tonight to see some GREAT Laramie restaurants showcase their delicious food. If you're in Laramie or passing through sometime, make sure to try one of the many great, locally owned restaurants in town!\n\nhttps://t.co/48hmGwDEyB","date":"Fri Mar 18 15:48:55 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m a huge fan of Yellowstone National Park, so to keep celebrating 150 years of this national treasure, I have some great #Yellowstone150trivia!\n\nOld Faithful is an iconic landmark in the park. How frequently does it erupt?","date":"Fri Mar 18 14:36:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Advance Casper and I are working to showcase amazing companies across Wyoming at this year’s Aerospace &amp; Defense Industry Conference in Casper on May 5th and 6th. For more information and to register, click here: https://t.co/RE9k0ZXLHX","date":"Thu Mar 17 19:39:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"When you plug your phone into your car to listen to your favorite band or podcast, you give police a way to rummage around in your personal data without a warrant https://t.co/1V7FshHOdh via @reason","date":"Thu Mar 17 14:21:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Glad to see Instagram and Meta taking some of our concerns seriously. There is still work to be done, but it’s good that they are recognizing the harm their products can do to kids and teens.\n\nhttps://t.co/cpTrmdxx2m","date":"Wed Mar 16 19:21:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden admin has been hostile toward our domestic energy industry from the start, but we can change the trajectory. \n\nhttps://t.co/Ketj1XwlUK","date":"Wed Mar 16 16:30:55 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Gas prices are impacting people all across WY. The White House is trying to tell us that this is happening solely because of Russia’s invasion of Ukraine, but that’s not the whole story. 1/","date":"Wed Mar 16 16:30:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My heart is heavy after hearing about the two American journalists killed in Ukraine. These brave men risked their lives to make sure that we saw the truth about Russia’s aggression against Ukraine. I’m praying for their families and colleagues during this difficult time.","date":"Wed Mar 16 13:32:56 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Great news all around. \n\nIt’s essential we have Fed nominees who will not unfairly punish Wyoming energy companies and the jobs and revenues they support.\n\nhttps://t.co/LhvD6YWrjq","date":"Tue Mar 15 20:37:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Joe Manchin is putting the people of West Virginia over partisan politics. This is good news for Wyoming.","date":"Mon Mar 14 16:17:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/j6rn87ga8A","date":"Mon Mar 14 15:13:34 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Want to get in on the anniversary fun, but can’t make it to @Yellowstonenp? Check out the magic on the park’s webcams at \n\nhttps://t.co/qXncm2sJjZ!","date":"Fri Mar 11 16:07:39 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on tonight’s omnibus vote: \n\nhttps://t.co/8SGxaC6f5f","date":"Fri Mar 11 03:36:41 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I spoke on the Senate Floor in protest to the manner in which funding for the people of Ukraine has been strapped to this omnibus spending bill.\n\nhttps://t.co/uTG0DaOdz3","date":"Thu Mar 10 21:40:23 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Senate Banking Republicans have said all along that we are willing to vote on four of President Biden’s Fed nominees. At this point, Senate Democrats are holding up Biden’s nominees. \n\nhttps://t.co/UYZGrWaMcV","date":"Thu Mar 10 21:03:33 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is caused in part by a huge amount of govt spending. We can address inflation &amp; our national debt by cutting that spending. The upcoming omnibus bill does nothing to help curb inflation and instead simply pours gasoline on an already raging fire.\nhttps://t.co/Cb2qMbx2tm","date":"Thu Mar 10 17:31:18 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Time to give energy companies certainty. This will increase production and restore American energy independence. https://t.co/0P1vbQZuAc 2/2","date":"Thu Mar 10 15:17:38 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Since day one, the Biden admin has attacked US energy production through anti-energy policies. Now they are rhetorically attacking it for the chilling effect their own policies have caused. 1/","date":"Thu Mar 10 15:17:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Dangerous and belligerent behavior on planes is unacceptable. Putting the safety of flight crews and fellow passengers in danger, regardless of one’s reasoning, is intolerable. But having the Justice Department unilaterally creating a new list will not fly with me.","date":"Wed Mar 09 21:04:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"So excited to have @SenCapito join us on the @FinancialCaucus. This technology is moving fast and Congress needs all the help it can get to keep up! Welcome my friend!","date":"Wed Mar 09 19:03:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/8WYIRTIOqH","date":"Wed Mar 09 17:59:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/4RAdWroMPy","date":"Wed Mar 09 17:59:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/sZyJJvox5U","date":"Wed Mar 09 17:59:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"It’s been a long time coming, but my bill to fully integrate digital assets into our financial system is almost ready! I’m putting the final touches on it with some key advocates and partners in the Senate, but watch out for an unveiling soon! https://t.co/gpHh2JVgKd","date":"Wed Mar 09 15:10:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on President Joe Biden’s executive order on digital assets today: https://t.co/SiPkdRYk65","date":"Wed Mar 09 14:47:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Now, with gas prices at an all-time high, we need to turn to domestic sources of energy, like Wyoming’s coal, oil, natural gas, and uranium to help fill in the gap and lower prices for consumers across the U.S. 2/2","date":"Tue Mar 08 20:23:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is the right move. By purchasing energy from Russia, we are enabling Putin’s attacks on Ukrainian families. 1/","date":"Tue Mar 08 20:23:32 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Happy #307Day. It’s a pleasure to serve the great state of Wyoming every day in the Senate. https://t.co/2pXNymQiOH","date":"Mon Mar 07 21:52:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m in awe of the Ukrainian people and their bravery. I’m praying for safety and strength for them in the face of this act of Russian aggression. Putin must withdraw his troops from Ukraine.","date":"Mon Mar 07 16:07:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Always a pleasure to come back to where it all started. Thanks for letting me speak to you all today!","date":"Sat Mar 05 04:02:45 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Community banks are essential to people in WY, but all too often they are crushed by regulations that are meant to keep big banks in check. I’m glad I could join @SenatorRounds (R-SD) &amp; @SenatorTimScott (R-SC) on this bill to keep community banks vibrant! https://t.co/WWdCjqQyMg","date":"Fri Mar 04 21:32:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"\"Pandemic-related restrictions are almost gone. The government should not go creating a new infringement on civil liberties that will live on forever.\"\n\nhttps://t.co/5qEADOmPvA","date":"Fri Mar 04 15:42:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Chair Powell is right. We need a framework for this industry, and I’m working on one now. The major digital asset exchanges in the US are complying with sanctions against individuals in Russia. It makes no sense to punish or single them out before they’ve done anything wrong.","date":"Thu Mar 03 21:16:12 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"👏🏻👏🏻👏🏻","date":"Thu Mar 03 15:44:30 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We were energy independent. It’s time to become energy independent again.","date":"Thu Mar 03 15:19:59 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"About to join @AmericaNewsroom to discuss options to prevent an energy crisis in light of Russian aggression in Ukraine. https://t.co/xX4GxLf3YN","date":"Thu Mar 03 15:17:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The No-Fly list being proposed lacks transparency and creates a myriad of due process concerns. If the airlines are so concerned about this issue, they should come to Congress, not sit behind closed doors at DOJ. \n\nhttps://t.co/YI1eVQhEbd","date":"Wed Mar 02 17:02:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My biggest takeaway from President Biden’s speech is that he is completely out of touch with the American people. We are paying more for gas and groceries, yet he is talking about more government spending. This is bad for Wyoming and bad for America.\n\nhttps://t.co/LL9a6Nvb6s","date":"Wed Mar 02 15:54:59 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The State of the Union is that the need for American energy is up, and I have a few suggestions to move us back to American energy independence.\n\nhttps://t.co/JT4g0xpaLn","date":"Wed Mar 02 03:26:48 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s got it right on Big Tech. We have to protect the privacy of our children. It’s time to rein in Big Tech.\n\n#SOTU","date":"Wed Mar 02 03:11:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"You know how to secure our border right…?\n\n#SOTU","date":"Wed Mar 02 02:58:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The concentration of meat packers increases prices and hurts Wyoming families, but the solution isn’t to spend more taxpayer money. \n\nWe need to allow state inspected meat into interstate commerce.","date":"Wed Mar 02 02:55:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is a tax on everybody who makes less than $400,000. And everybody who makes above $400,000. \n\n#SOTU","date":"Wed Mar 02 02:41:27 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Want to know how to cut energy costs? Produce energy here at home.\n\n➡️ Authorize the Keystone XL pipeline\n➡️ Restart oil &amp; gas leasing on federal lands\n\n#SOTU","date":"Wed Mar 02 02:39:28 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"More government spending makes inflation worse, not better. #SOTU","date":"Wed Mar 02 02:32:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Buy American products, but buy Russian oil #Bidenbetweenthelines","date":"Wed Mar 02 02:28:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"If President Biden was serious about pushing back on Russian aggression, he would completely cut off the import of oil from Russia and unleash the American energy industry.","date":"Wed Mar 02 02:15:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Great news! Finally Congress is recognizing what Wyoming has known all along – people need access to their elected representatives. If the doors are locked, they don’t have that access.","date":"Tue Mar 01 20:15:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Yellowstone National Park – a true Wyoming treasure – turns 150 years old today. You can learn more about all Yellowstone has to offer and celebrate alongside the park staff and the many who love this park at https://t.co/Kg0EIvjL5G! https://t.co/JfKaqJ3kt1","date":"Tue Mar 01 19:03:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My heart is with @SenFeinstein and her family after the death of her husband. Unfortunately, I am all too familiar with the loss of a spouse. My prayers are with her as she mourns this difficult loss.","date":"Mon Feb 28 22:43:23 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"While Wyoming families suffer under extreme inflation and Ukrainians fight for their lives, Democrats are pushing this horrendous bill. 2/2","date":"Mon Feb 28 21:40:18 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We are experiencing crises on multiple fronts, yet tonight, we came back to the Senate to vote on a bill that calls for Abortion on Demand until the moment of birth. Leader Schumer has his priorities painfully misaligned. 1/","date":"Mon Feb 28 21:40:17 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I always say, “Tell the truth, it’s easier to remember.” Getting a job because of a friend is not illegal, so why is Raskin refusing to just say that? Her continued refusal to give straight answers to simple questions raises eyebrows and does the American people a disservice. 3/3","date":"Mon Feb 28 20:49:46 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Reserve Trust founder Dennis Gingold is a long-time Raskin supporter, who claims he’s known the Raskins for decades and maxed out to Rep. Jamie Raskin’s 2015 campaign. 2/ \n\nhttps://t.co/4qDlSbcf6O https://t.co/1aZFiqNeTI","date":"Mon Feb 28 20:49:14 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The more I look into Sarah Bloom Raskin’s time at Reserve Trust, the more concerned I am that she’s not being forthright. She told the Senate she could not remember how she got on Reserve Trust’s board. Odd, given the claims of Reserve Trust’s founder. 1/ \nhttps://t.co/NkcdhfwEnx","date":"Mon Feb 28 20:47:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Good thread.","date":"Mon Feb 28 16:23:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m looking forward to meeting Judge Ketanji Brown Jackson as we consider her nomination to the Supreme Court. It’s important that we have a justice who impartially interprets the Constitution, maintains separation of powers &amp; federalism and who upholds our constitutional rights.","date":"Fri Feb 25 19:39:10 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"There is a simple solution here. Allow our domestic energy industry to do what it does best. We have the capability to fill the energy gap and keep prices low. This is good for the people of Wyoming, the people of Ukraine and people across Europe.","date":"Fri Feb 25 15:37:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"FFA is growing the next generation of leaders around our state. I’m proud to sponsor a resolution declaring this week #NationalFFAWeek https://t.co/LxiNbhL7vQ","date":"Thu Feb 24 21:51:15 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on Russia’s invasion of Ukraine. https://t.co/82R3ZvllpT","date":"Thu Feb 24 15:16:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden administration has continually sacrificed America’s energy independence and the wellbeing of the people of Wyoming and our energy industry while bowing to extreme environmentalists. \n\nWe have a right to know the true cost these actions are having on our economy.","date":"Wed Feb 23 16:46:42 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Russia’s invasion of Ukraine is an attack on a sovereign democracy, and the United States must respond. Our failure to impose consequences on Russia’s aggression is a key reason why Vladimir Putin felt emboldened to invade in the first place. 1/","date":"Tue Feb 22 16:32:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I am encouraged to see that Germany has scrapped plans for Nord Stream II. It was environmentally harmful, particularly when compared with Wyoming’s own much cleaner energy production, and was also an international security threat. 3/","date":"Tue Feb 22 16:32:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden should do now what he has failed to do before: help Europe isolate Russia. We should continue to provide military assistance, and must support our allies in the region as they present a united front against Russia. 2/","date":"Tue Feb 22 16:32:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden should have placed sanctions on its construction long ago. 4/4\n\nhttps://t.co/nuYGV204GF","date":"Tue Feb 22 16:32:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Michelle Tafoya is my new hero. She gave up a coveted career in sports journalism to fight for her kids and what she believes. I’m so proud of her!\n\n https://t.co/WSrKWs0oPa","date":"Fri Feb 18 14:52:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Good to see that the Dept of Justice is taking digital asset crime seriously, but the Biden admin needs to recognize and support all of the good entrepreneurs and innovators operating in this space. The US should lead on every aspect of digital assets, not just law enforcement.","date":"Thu Feb 17 21:08:52 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"“Misses” implies that it was an oversight, a mistake. The Biden admin didn’t overlook this on their calendar. They made a choice to continue to attack WY's energy industry in favor of unrealistic climate policies while we continue to pay more at the pump and to heat our homes. https://t.co/d8houhG72k","date":"Thu Feb 17 16:59:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m proud to fight for the rights of the people of Wyoming every day. As I fight for limited government, I am always happy to know that my allies at @FreedomWorks are with me every step of the way.","date":"Thu Feb 17 16:17:20 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Hey @Jim_Jordan…\n\nHappy birthday! https://t.co/bX5doiu7jR","date":"Thu Feb 17 15:44:29 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Airlines are fully within their rights to bar unruly passengers from traveling on their planes, however, it’s ridiculous that they would involve the DOJ. No fly lists are for terrorists. This is an airline level problem, not a DOJ level problem. \n\nhttps://t.co/jXKIrnQODj","date":"Thu Feb 17 15:16:55 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Democrats are doing the other Fed nominees a disservice by holding up the whole process for one contentious nominee. And if they cared about inflation, they would have stopped spending excessively months ago when Republicans raised the alarm. \n\nSmells like election season to me.","date":"Wed Feb 16 21:56:59 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks for having me!","date":"Wed Feb 16 21:04:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We can’t sit by while our most vulnerable citizens struggle under the weight of inflation. Congress and President Biden need to stop spending recklessly, which will only make things worse.\n\nhttps://t.co/1bYt12Qykf","date":"Wed Feb 16 19:06:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Two of Biden’s nominees to the Fed Board of Governors have views that are risky for monetary policy and financial regulation. https://t.co/TNGpfOKMDl via @WSJOpinion","date":"Wed Feb 16 15:06:39 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The IOC is supposed to enforce anti-doping measures to ensure fair competition for athletes no matter who they are or where they’re from. For some reason, Kamila Valieva continues to compete when @itskerrii had to sit out the Summer Olympics? Looks like a double standard to me.","date":"Wed Feb 16 14:40:12 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ve worked with hundreds of colleagues, many of whom I’ve cared for deeply. But rarely do I come across someone whose sincere humility, generosity, and selflessness come close to those of Leland Christensen. Every day spent with Leland was a better day.\n\nhttps://t.co/pLm5DaWyPr","date":"Tue Feb 15 22:59:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Label misleads: It’s time for transparency in meat production - WyoFile https://t.co/NO57RdN5id","date":"Tue Feb 15 21:06:47 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Excited to join @orrinhatch Foundation to discuss how digital assets will impact the American economy. It’s not too late to register at https://t.co/0Xa7ekZcs6! https://t.co/SypQpJmM0y","date":"Tue Feb 15 19:00:53 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"After working at the Fed, Raskin turned around and used her influence to get a company special access to a Fed master account – and made $1.5 million because of it. I have serious questions about this and @SenToomey and I are getting to the bottom of it. \n\nhttps://t.co/zwxRi3VhF5","date":"Tue Feb 15 18:38:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Justice Department should be focused on upholding actual law, instead of finding new ways to target ordinary Americans. \n\nhttps://t.co/jXKIrnQODj\n\n3/3","date":"Tue Feb 15 14:56:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Expanding the use of no-fly lists to include people who are frustrated about mask mandates would tacitly equate ordinary fliers to violent extremists. This is offensive not only to me but to the people of Wyoming. 2/","date":"Tue Feb 15 14:55:37 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"TSA no-fly lists have been historically restricted to suspected terrorists, because such individuals are a threat to every airline and every traveler. 1/","date":"Tue Feb 15 14:55:22 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"GOP senators renew efforts to defund Biden's vaccine mandates https://t.co/NPoGAirvv3 #FoxNews","date":"Mon Feb 14 21:38:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I appreciate that EPA officials are taking our concerns seriously and have come to the table. There is a lot of work left to be done, but these discussions are an important step forward. \n\nhttps://t.co/v9CqgXAPM2","date":"Mon Feb 14 20:37:42 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden administration has been hostile to domestic energy production from the start. At a time when energy prices are already skyrocketing from inflation, this would be yet another hit on our struggling economy. https://t.co/1jw41iVVSp","date":"Fri Feb 11 20:47:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"In a recently posted, then promptly removed, draft notice on their website, the BLM debuted a dramatically increased federal royalty rate, 18.75% up from 12.5% without any input from states and stakeholders. 2/","date":"Fri Feb 11 20:47:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The federal government is once again showing its hand when it comes to our energy industry. 1/","date":"Fri Feb 11 20:47:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The fact that this was a serious proposition to begin with is absolutely appalling. The IRS can’t even protect the data that it does have access to – why in the world would we give them access to our biometric data?\n\nhttps://t.co/SNpBxid3Bt","date":"Thu Feb 10 20:58:34 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"How did Sarah Bloom Raskin’s fintech firm mysteriously get a Fed master account? https://t.co/1yumytTy0q via @WSJOpinion","date":"Thu Feb 10 18:50:44 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"It’d be nice if President Biden and Democrats spent as much time fighting inflation as they do trying to revive the dead Build Back Better plan. \n\nInflation is a tax on all Americans, and is devastating families across Wyoming.","date":"Thu Feb 10 16:02:12 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"A beautiful tribute to my friend Leland from the folks at Cowboy State Daily.\n\nhttps://t.co/vcZaUJz6sv","date":"Wed Feb 09 19:14:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations Jaelin! You make Wyoming proud!\n\nhttps://t.co/0SR54t04MX","date":"Wed Feb 09 16:51:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming schools were one of the first school systems to go back to in person learning, and our students are benefitting. This is all the evidence you need that income disparities are made worse by lockdowns in blue states.","date":"Wed Feb 09 14:27:47 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This week, I’m joining the team at @invariant to talk about responsible financial innovation and my ideas for regulating this budding industry. https://t.co/iQ7PviQ2cU","date":"Tue Feb 08 20:03:07 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I have the highest respect for President Esther George and believe she acted consistent with the law. This isn’t about her, but rather about a connected non-bank getting a master account while actual banks in Wyoming have been stonewalled. 2/2","date":"Tue Feb 08 16:53:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The point here is not that a company’s leadership communicated with the Fed, but rather that a Biden nominee used her former position to financially benefit herself massively in a way no regular American could. 1/","date":"Tue Feb 08 16:52:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to Gwen Geis on her appointment to the Cattlemen’s Beef Promotion and Research Board! She’s a fourth-generation rancher in Campbell County, and I know she will represent Wyoming’s interests well.","date":"Mon Feb 07 22:53:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is not a coincidence. We need district attorneys who prosecute crime. We need local leaders who support police departments. We don’t need platitudes from President Biden, we need action. 2/2","date":"Mon Feb 07 16:13:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Violent crime is on the rise in major cities across the U.S. \n\nIn D.C., where a large number of my staff live and work, there have already been 380 instances of violent crime in 2022 – a 13% increase over 2021. 1/","date":"Mon Feb 07 16:12:57 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today, I mourn the loss of my friend and state director Leland Christensen. https://t.co/FQRKZeAAZw","date":"Sat Feb 05 00:09:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Big things are coming to Wyoming. The WY legislature and @GovernorGordon's office have laid the groundwork to make Wyoming a destination for digital asset companies of all kinds. Excited for what’s to come.\n\nhttps://t.co/op4PUB5xfg","date":"Fri Feb 04 19:00:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Jim Bridger Power Plant is an essential part of our energy grid. I’ll keep fighting to make sure Jim Bridger is operational for its full lifespan.\n\nhttps://t.co/gWjPInDtVj","date":"Fri Feb 04 16:04:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Hmmm… it’s hard to say https://t.co/0deUoXSbLc","date":"Thu Feb 03 18:50:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I wrote about this in the Wall Street Journal in November.\n\nhttps://t.co/RLKQ48BVfK","date":"Thu Feb 03 17:48:25 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming has two entities seeking similar master accounts, but the Fed has illegally slow-walked their applications. What’s the difference? \n\nCould it be Sarah Bloom Raskin’s influence? https://t.co/9YKxD8qe9A","date":"Thu Feb 03 17:47:49 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Currently there is only one non-bank fintech company in the country with a Federal Reserve master account. That company was initially denied an account, but a year after Sarah Bloom Raskin joined the company’s board, the company was granted it. This raises a lot of questions. https://t.co/o0aNJXq5Hy","date":"Thu Feb 03 17:19:15 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This shouldn’t be controversial. The long-standing sentencing disparity between crack and powder cocaine violates America’s commitment to basic fairness and equal justice under law.\n\nhttps://t.co/wspg5trEse","date":"Thu Feb 03 14:59:20 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is not sustainable. I’ve introduced multiple bills to address our debt crisis, and I implore Senate leadership to take these bills up and start moving toward solutions. We can’t keep spending future generations into oblivion.","date":"Wed Feb 02 19:08:09 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"$30,000,000,000,000. \n\nIt’s hard for me to believe that we’ve found ourselves in this position, but here we are. \n\nOur debt is now 125% of our GDP – meaning we owe more money than we are generating in our economy.","date":"Wed Feb 02 19:07:39 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"@SenMarkKelly @RepBalderson @RepLaHood @RepJoshHarder @RepCuellar https://t.co/E1YQQQ2T3I","date":"Wed Feb 02 15:26:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We’re not going to stop the supply chain crisis overnight, but streamlining the licensing process for truckers is a step in the right direction. The LICENSE Act that I introduced with @SenMarkKelly, @RepBalderson, @RepLaHood, @RepJoshHarder and @RepCuellar does just that.","date":"Wed Feb 02 15:26:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We cannot allow our athletes to be used as a Trojan horse to increase the CCP’s ability to spy on the U.S. @MarshaBlackburn, @SenatorWicker &amp; I sent a letter to the US Olympic Committee leadership to push them to keep our athletes from CCP surveillance. \n\nhttps://t.co/9VBrb5SvrH","date":"Wed Feb 02 15:06:35 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Praying for a speedy recovery, my friend.\n\n@SenatorLujan","date":"Tue Feb 01 22:13:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m excited to watch Jaelin Kauf of Alta, WY compete in the Winter Olympics! She’ll compete in the women’s moguls. Help me cheer Jaelin on! 🇺🇸🇺🇸🇺🇸 https://t.co/6BAwUQ4P2L","date":"Tue Feb 01 20:43:11 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/xQ7XeeFCOZ","date":"Tue Feb 01 18:11:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"There is still money that hasn’t been disbursed from previous COVID relief packages. It makes no sense to continue to pump money into our already inflated economy. \n\nhttps://t.co/uX0JfP3ktU","date":"Tue Feb 01 15:14:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"On this day in 1917, the Indian paintbrush was selected as the Wyoming state flower. https://t.co/RRVO73oxwh","date":"Mon Jan 31 15:48:45 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"7/ The government does not need to make financial decisions for the American people. Our $30 trillion national debt should be your first hint at that.","date":"Fri Jan 28 14:56:04 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"5/ I will not stand by and let the heavy hand of the government pick winners and losers. If we go down this path, we threaten our own position as global financial leader.","date":"Fri Jan 28 14:56:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"4/ Should this provision remain in the bill, we really should rename it the America Fails Act. This provision stifles innovation and competition. and feels more like something the Chinese Communist Party would impose on industry.","date":"Fri Jan 28 14:56:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"6/ I’m talking with my colleagues in the Senate and with people at the Treasury to make my concerns known.","date":"Fri Jan 28 14:56:03 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"3/ It doesn’t say it explicitly, but this is a direct attack on the digital asset industry. The Treasury Department already has broad authority in this area, but it has a strict time limit and a public notice requirement.","date":"Fri Jan 28 14:56:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"2/ This provision would give the Treasury Secretary and those she deputizes unilateral, unlimited power to ban any type of financial asset that has a foreign link, without public notice and without any time limit.","date":"Fri Jan 28 14:56:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"1/ I wanted to share a few thoughts about House Democrats’ version of the America Competes Act (pg. 1485 below), which is raising alarms across the financial industry. \n\nhttps://t.co/ciDKzvE2VA","date":"Fri Jan 28 14:56:02 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"@marcorubio and I are calling for Inspector General investigations at both the U.S. Dept of Education and the U.S. Dept of Justice into this matter. We need answers. (2/2)\n\nhttps://t.co/zFf1Krs1MG","date":"Thu Jan 27 19:49:24 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden admin and the nation’s largest teachers’ union appeared to have colluded to target parents who questioned radical school policies. It also looks like they attempted to pressure social media companies to censor parents’ social media profiles as well. (1/2)","date":"Thu Jan 27 19:48:28 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"On this day in 1920, Wyoming ratified the Nineteenth Amendment. This move only confirmed longstanding Wyoming practice: the Equality State had already recognized the right of women to vote 50 years before ratifying this amendment. https://t.co/YZVNHxKtru","date":"Thu Jan 27 16:01:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"We let our guard down on Russia, and now Ukraine is paying the price. I do hope the Biden administration learns from its mistakes in Afghanistan and fully evacuates Americans before it’s too late. \n\nhttps://t.co/CJKyRvEzED","date":"Wed Jan 26 17:30:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Private emails between an attorney and their client are necessary for the constitutional right to due process. @RonWyden and I introduced this legislation to make sure that 21st century technology doesn’t invalidate the Sixth Amendment.\n\nhttps://t.co/k9WZB7399a","date":"Wed Jan 26 16:14:32 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ll continue to block EPA nominees until they agree to take another look at the Jim Bridger Power Plant.","date":"Wed Jan 26 15:43:57 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Jim Bridger Power Plant is an essential part of the power grid in Wyoming and the west. The radical environmentalists in the White House don’t care about the needs of people in Wyoming, or any American family paying a power bill.","date":"Wed Jan 26 15:43:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Leland is a true public servant, as a veteran, former sheriff and legislator, and now as my state director. He's also a beloved husband &amp; father, and a dear friend of mine. Please join me in supporting Leland &amp; his family with our prayers. \n\nhttps://t.co/PxPaiFhp0p","date":"Tue Jan 25 16:50:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to Cameron Reckard and Tamica Smith, both of Sheridan, for their appointments to the United States Senate Youth Program! This is an accomplishment to be proud of. I look forward to meeting you when you come to DC this spring.","date":"Mon Jan 24 17:06:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Unborn children deserve our protection. I’m a mother &amp; a grandmother, but I’m also an attorney and I represented birth mothers as they navigated the difficult decision to give their child up for adoption. I walked with them, and in spirit, I walk with you all today. #whywemarch https://t.co/s6Opj4tBuq","date":"Fri Jan 21 18:26:39 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ve received no response, and his administration has leaned into some of the actions that have exacerbated the crisis, such as vaccine mandates. We need to take real action to get food back on the shelves.","date":"Fri Jan 21 14:32:41 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ve heard it from constituents and I’ve seen it for myself: Shelves in Wyoming are still sitting empty. Before Thanksgiving, I sent a letter to President Biden with some ideas to help ease the supply chain crisis. (1/2) https://t.co/HlaUoNwb7F","date":"Fri Jan 21 14:32:33 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m genuinely undecided whether there is a legitimate need for a CBDC when we have stablecoins, and I look forward to working with Chair Powell and Governor Brainard to figure this out.","date":"Thu Jan 20 23:22:21 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Stablecoins have an important role to play in America’s financial future. At the same time, even countries like the UK are skeptical about the need for a CBDC.\n\nhttps://t.co/60vmqoKfxa","date":"Thu Jan 20 23:22:21 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Most importantly, as the report notes, Congress will ultimately decide whether we should create a US CBDC. I encourage you to submit comments to the Fed on a potential CBDC by May 20, 2022 here.\n\nhttps://t.co/c3OjY9bh1P","date":"Thu Jan 20 23:22:21 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m encouraged that the Fed recognizes what I’ve said all along, that “protecting consumer privacy is critical” in a CBDC. Here’s what I said about CBDCs and stablecoins on the Senate floor in September.\n\nhttps://t.co/8otdXZSqod","date":"Thu Jan 20 23:22:20 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Federal Reserve rightly acknowledges that digital assets are here to stay.","date":"Thu Jan 20 23:22:20 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’m pleased the Federal Reserve released their long-awaited report on central bank digital currencies this afternoon. Here’s a quick thread of my thoughts.\n\nhttps://t.co/UAJFIPwiqG","date":"Thu Jan 20 23:22:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"America has worked for generations to stop monopolies when they arise, and the internet age should be no different. I look forward to supporting this bill on the Senate floor. 3/3","date":"Thu Jan 20 21:06:07 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Consumers in Wyoming and the rest of America would benefit from greater competition among tech companies, but right now the tech giants are self-promoting their own products over their rivals, which hurts competition and solidifies existing internet monopolies. 2/","date":"Thu Jan 20 21:06:07 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Today the Senate Judiciary Committee took a decisive step toward reining in the unchecked, monopolizing power that Big Tech has over the internet marketplace. 1/","date":"Thu Jan 20 21:06:06 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Prices on goods we need every day in Wyoming have been rising for months. The dramatic increase in December is no surprise. The Biden administration needs to take this seriously and come up with solutions to address the out-of-control inflation we are facing.","date":"Thu Jan 20 20:47:43 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I’ll continue to block President Biden’s EPA nominations until they show a good faith effort to address Wyoming’s concerns.","date":"Thu Jan 20 15:20:11 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Radical environmental policies like those suggested by the Biden admin will not effectively address the changing climate. They instead will continue to harm Wyoming workers and families and force our energy needs into the hands of unstable and hostile nations. https://t.co/npByTMByns","date":"Thu Jan 20 15:19:49 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on my vote to protect bipartisanship &amp; the rights of the minority as Senate filibuster comes under attack: https://t.co/g8sqHIRt7J","date":"Thu Jan 20 04:03:22 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Maintaining the integrity of our institutions will protect the integrity of our nation. We have to keep the filibuster to protect the voice of the people in Wyoming.","date":"Thu Jan 20 01:53:35 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I represent 576,851 people in the state of Wyoming. Our voices aren’t irrelevant just because our state is small. The Senate filibuster makes sure our voices are heard. \n#ProtectYourVoice https://t.co/5jRrUSJYLl","date":"Wed Jan 19 21:48:58 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Removing the filibuster to push these radical federal election takeovers through would be a mistake the Democrats will soon come to regret.","date":"Wed Jan 19 15:05:38 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Senate Democrats are willing to throw out rules that have protected the minority’s voice for centuries – all for a power grab. States should follow the procedures set forth by their constitutions to conduct elections.","date":"Wed Jan 19 15:05:32 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Senate has rules in place to protect the voices of small states like Wyoming. \n\nDemocrats are trying to destroy those rules because they aren’t getting what they want.","date":"Tue Jan 18 21:16:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/HvxE4Nj6p2","date":"Mon Jan 17 15:50:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"An oldie but a goodie:","date":"Fri Jan 14 17:03:00 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on why I voted for Senator Ted Cruz's bill to reimpose sanctions on the Nord Stream 2 Pipeline: https://t.co/qSS9MY8xYY","date":"Fri Jan 14 15:18:05 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":".@jillian4supt has fought tirelessly for students across Wyoming. She will be an asset for Virginia schools and I wish her all the best as she takes the lead there!","date":"Fri Jan 14 01:01:35 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"From Justice Kavanaugh’s opinion: \n\n“Permitting OSHA to regulate the hazards of daily life—simply because most Americans have jobs and face those same risks while on the clock—would significantly expand OSHA’s regulatory authority without clear congressional authorization.”","date":"Thu Jan 13 20:52:23 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is a huge win. The federal government has no place making far-reaching mandates that put an undue burden on businesses across Wyoming.\n \nhttps://t.co/u8K40wX31H","date":"Thu Jan 13 20:08:14 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Prices on goods we need every day in Wyoming have been rising for months. The dramatic increase in December is no surprise. The Biden administration needs to take this seriously and come up with solutions to address the out-of-control inflation we are facing. https://t.co/lXlqdE3GDM","date":"Thu Jan 13 15:08:24 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden EPA’s decision here is needlessly hurting Wyoming’s energy workers and threatening America’s energy independence as well. It is blatantly political, and I will continue to block President Biden’s EPA nominees over this issue.\n\nhttps://t.co/cPji0KNmKx","date":"Thu Jan 13 01:53:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"If we want a more perfect union than we have today, we need more compromise, not less. This is why we have institutional norms, like the filibuster.\n\nhttps://t.co/L7Yo5nWcWR","date":"Thu Jan 13 00:37:19 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Obama’s Treasury Secretary is tired of President Biden ignoring the warning signs…","date":"Wed Jan 12 17:15:01 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Paychecks went up by 0.1%, yet prices for goods that people in Wyoming need every day went up by 0.5%. President Biden promised no new taxes on working Americans, but inflation is a tax on working people across Wyoming. https://t.co/CHS8qusubQ","date":"Wed Jan 12 16:22:54 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":".@SteveDaines welcome to the club! https://t.co/qu4wBMqufB","date":"Wed Jan 12 15:36:26 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"How about we: \nA) Finish spending the COVID money we’ve already allocated\nB) Stop spending money we don’t have","date":"Wed Jan 12 14:12:40 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden on pipelines: https://t.co/ooymO7MK00","date":"Tue May 18 22:26:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"the @BankingGOP hearing about my concerns with the Fed and their attempts to slow walk Wyoming’s SPDI charters. \n\nhttps://t.co/z5F6eAOcaP","date":"Tue Jan 11 16:17:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"ICYMI: I wrote an op-ed discussing my concerns with the Federal Reserve's delay in responding to two of Wyoming's SPDI banks' request for master accounts. \n\nhttps://t.co/RLKQ48BVfK","date":"Tue Jan 11 16:17:08 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"There is no point in providing funds to open new small-scale plants if they’re only going to be driven out of business in a few years because the Big Four have a stranglehold on processing that prevents small-scale competition from entering the market.","date":"Tue Jan 11 15:43:46 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"This is all well and good, but it doesn’t mean anything if the underlying problems with packer concentration and anticompetitive marketing practices aren’t dealt with. \n\nhttps://t.co/56X5PY6OeQ","date":"Tue Jan 11 15:43:36 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats’ voting bill would outlaw photo ID and mandate ballot harvesting. \n\nWyoming’s voting procedures work for our large rural state. A one-size-fits-all approach from Washington is the wrong answer.","date":"Mon Jan 10 16:19:31 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming’s voting laws provide flexibility and security for our most rural voters. We don’t need the federal government changing the way we vote.","date":"Fri Jan 07 18:47:32 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"Things that are still wrong with the Build Back Better Plan:\n➡️ Still empowers a politicized IRS to spy on Americans\n➡️ Still hurts our domestic energy independence\n➡️ Still creates more government programs that aren’t paid for","date":"Fri Jan 07 13:49:30 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"My prayers are with the family of U.S. Marine Jerrod Warden who died serving his country at Camp Pendleton. His service to his country will not be forgotten.\n\nhttps://t.co/woeMa7toOf","date":"Wed Jan 05 15:22:16 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I joined 47 of my colleagues in the Senate on a brief encouraging the Court to block the mandate and protect Wyoming people’s right to make their own health care choices. \nhttps://t.co/g182RLzlQQ","date":"Tue Jan 04 18:21:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"The Supreme Court will hear a case challenging the constitutionality of President Biden’s vaccine mandate on private businesses with more than 100 employees.","date":"Tue Jan 04 18:21:51 +0000 2022","user_id":"22831059"},{"handle":"SenLummis","text":"I want to thank her for her commitment to maintaining strong community banks in Wyoming. I am deeply concerned about governance of the FDIC Board in coming years, in light of the last few weeks’ events.","date":"Fri Dec 31 22:19:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Chairman Jelena McWilliams represents the best of our country, immigrating here, working hard, and giving back through public service.","date":"Fri Dec 31 22:19:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden has a responsibility to replace Chairman McWilliams with someone who will live up to the impeccable standard she set and who has a commitment to responsible financial innovation.","date":"Fri Dec 31 22:19:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My first year in the Senate has been an eventful one, and I am looking forward to five more years of working hard for you, the people of Wyoming.\n\nHappy Trails and Happy New Year!\n\nhttps://t.co/wy9rUUO4pC","date":"Fri Dec 31 22:05:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"May you experience the hope of our Savior Jesus Christ this Christmas season. https://t.co/AzonD9Fd7D","date":"Sat Dec 25 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"For the 10th year in a row, Wyoming has ranked #1 in the country for our business tax climate. We are the best place to raise a family and open a business. Thanks @TaxFoundation https://t.co/QKCYveIaW6","date":"Fri Dec 24 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden, Leader Schumer, and Speaker Pelosi should come to Wyoming, or even West Virginia and see how their Build Back “Better” plan would harm the people in rural states. We may be small, but that doesn’t mean we are irrelevant.","date":"Thu Dec 23 19:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s been a year of “All Wyoming, All the Time.” Read a little more about how I worked for the people of Wyoming during my first year in the U.S. Senate.\n\nhttps://t.co/Hz0a8u2OCc?","date":"Thu Dec 23 17:00:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you @Sen_JoeManchin for highlighting the impacts Build Back “Better” would have on our economy. Just because we have become accustomed to spending money we don’t have doesn't mean we can keep doing so. Eventually, the bill is going to come due. \n\nhttps://t.co/8R0335vupz","date":"Thu Dec 23 15:28:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"#gopokes","date":"Tue Dec 21 20:22:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"As if the supply chain crisis isn’t already affecting Wyoming families, the Biden administration is putting more restrictions on truckers who are trying to bring us goods. Thanks @SteveDaines for your leadership on this effort to keep truckers on the road!\nhttps://t.co/TBLbU5rSjI","date":"Tue Dec 21 18:07:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations Chad! Thanks for representing the Cowboys well! #gopokes\n\nhttps://t.co/N5zXBKDkLq","date":"Fri Dec 17 14:43:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The digital yuan represents a serious threat to the privacy of American athletes. It’s good this effort is gaining traction. The USOPC should seriously consider our request to prevent U.S. athletes from using the digital yuan while competing in Beijing.\nhttps://t.co/PTeSMMS0cv","date":"Thu Dec 16 19:01:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Real price tags on the Build Back “Better” Plan: https://t.co/0c4ruT6XnG","date":"Thu Dec 16 14:27:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Good, but we could also pass the HERD Act and get federal workers back to the office and working for the American people. Just a thought!\n\nhttps://t.co/kKtOu3JnXV https://t.co/rmneTkPwzy","date":"Wed Dec 15 18:37:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Saying something costs $0 over and over again doesn’t actually make it free.\n\nhttps://t.co/KZVhOWMnsu","date":"Wed Dec 15 14:54:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Our dollars simply won’t go as far this Christmas. Instead of addressing the cause, the Biden administration is doubling down on its reckless spending plan, even though dozens of economists say it’ll make inflation worse.  \n\nhttps://t.co/jGEMNkz4UP","date":"Tue Dec 14 21:17:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Unfortunately I was not able to join today’s @BankingGOP hearing because of illness but I’m a firm believer that stablecoins are important to America’s financial future. I look forward to working with my colleague @SenToomey to put in place a common sense regulatory framework.","date":"Tue Dec 14 19:24:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/SgBK5TTVYM","date":"Fri Dec 10 19:13:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Exclusive: Republicans say WHO pandered to China by skipping ‘xi’ in COVID names - https://t.co/YDXOtv0pY8 - @washtimes","date":"Fri Dec 10 18:56:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is no question, we are setting ourselves up for big consequences. WY families are already experiencing higher prices and smaller paychecks. However, the Democrats are choosing to exacerbate the problem by spending more &amp; adding to our national debt. This has got to stop.","date":"Fri Dec 10 15:34:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I anticipated Dir. Chopra may try to act in a partisan &amp; egregious manner &amp; asked him about his intentions re: the FDIC Board in his confirmation hearing. His actions by continuing to vote at the FTC, where he is no longer a member, also shows complete disregard for rule of law.","date":"Fri Dec 10 02:07:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This action is nothing short of an attempted coup and should be rejected by all who believe in an independent FDIC governed by the rule of law. (2/)","date":"Fri Dec 10 02:07:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This partisan action is particularly grievous since Director Gruenberg is serving an expired term, and Acting Comptroller Hsu is serving in an acting capacity without Senate confirmation. (3/)","date":"Fri Dec 10 02:07:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The purported ‘vote’ held by certain members of the FDIC Board is not legitimate and departs from the Board’s own rules which grant Chairman McWilliams the authority to set the Board’s agenda. (1/)\n\nhttps://t.co/McRaeWkAEq","date":"Fri Dec 10 02:07:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This is why I intro’d the HERD Act. Wyoming people have been back in the workplace for well over a year, and it’s high time their government got back to work for them.\nhttps://t.co/kKtOu3JnXV","date":"Thu Dec 09 22:39:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s astonishing that Instagram would consider allowing children under 13 to have access to its platform.\n\nhttps://t.co/qZwlSS3wyU","date":"Thu Dec 09 21:00:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Instagram can’t even commit to protecting the privacy of the young users that already use their platform. We’ve already seen reports of the adverse effects prolonged use is having on teenagers. (1/2)","date":"Thu Dec 09 21:00:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I had a great time talking to Tony last week on the @ThinkingCrypto1 podcast. He had great questions about what to expect from Congress for the future of digital assets, and I may have given him some insight into the digital asset bill I’m currently working on. Check it out!","date":"Thu Dec 09 17:59:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Barrasso, Lummis Will Vote To Cancel Biden Vaccine Mandate https://t.co/2UGlXZbZ4l via @@daily_cowboy","date":"Thu Dec 09 15:20:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Yikes...","date":"Wed Dec 08 21:14:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m vaccinated, and people across Wyoming should talk to their doctors about getting vaccinated, but that conversation should NOT include the government. I will keep fighting for the rights of people in Wyoming to make their own medical decisions. https://t.co/8TEODyzqls","date":"Wed Dec 08 18:25:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The people trying hardest to sell this plan know the American people aren’t buying it. That’s why they’re playing numbers games. In DC, they call this spinning the story. In Wyoming, we call it lying. https://t.co/F3lTXA4b3O","date":"Wed Dec 08 14:19:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The President’s next nominee should be someone who understands the government’s proper role in the financial industry and will work with Congress to make sure the people of Wyoming have fair access to financial institutions.(3/3)","date":"Tue Dec 07 22:25:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Banks should not be an extension of the federal government, and the federal government should not decide what industries are “socially sub-optimal” and deny them capital. (2/)","date":"Tue Dec 07 22:25:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden picked the most radical person he could find for this position, so I’m not surprised there was bipartisan opposition to her nomination. (1/)","date":"Tue Dec 07 22:25:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Build Back Better: $80 billion for the IRS to target low-income Americans. Niobrara County has one of the lowest median incomes in WY, yet it has the highest rate of audits by the IRS in my state. My constituents aren’t tax cheats. We don’t need more bureaucrats targeting them. https://t.co/OlbsS79Hdx","date":"Mon Dec 06 17:23:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Saule Omarova, President Biden’s nominee to be the top banking regulator, on banks: https://t.co/tnASa7j7rj","date":"Mon Dec 06 15:29:54 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Bob Dole was an incredible public servant whose service to the American people in the military and in Congress left an indelible mark on our country, particularly for our veterans. Praying for his wife Elizabeth and daughter Robin at this time.","date":"Sun Dec 05 23:21:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Saule Omarova, President Biden’s nominee to be the top banking regulator, on American energy independence: https://t.co/7wM1o6t5Zw","date":"Fri Dec 03 15:42:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wishing a beautiful Hanukkah full of light to Jewish families across Wyoming. May this festival bring blessings upon you and your family. https://t.co/h1uE4GJ2Vz","date":"Thu Dec 02 19:55:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats’ reckless tax-and-spend plan has $80 billion to hire 87,000 more IRS agents. To do what? Well, if history is any indication, to audit middle-class and lower-income Americans and small businesses. \nhttps://t.co/cZoHrUpMPe https://t.co/d6V83KISEC","date":"Thu Dec 02 14:12:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Live shot of us if we don’t start working on space debris problems now:\nhttps://t.co/JEZxJYGBgu https://t.co/mvKL82MTrl","date":"Wed Dec 01 20:09:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s Build Back Better Plan: We’ll cut deficits. \n\nvs.\n\nThe Real Build Back “Better” Plan: This bill will add billions to our national debt. https://t.co/JjUTRuhK2d","date":"Wed Dec 01 17:16:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"When I was practicing law, I helped birth mothers match with couples looking to adopt. There is nothing like placing a baby in an adoptive mother’s arms. I’m grateful for every mother who has chosen life to make miracles like that possible. \n#prolife #EmpowerWomenPromoteLife","date":"Wed Dec 01 14:49:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"No one is above the law, not even the Federal Reserve. It’s time for some answers.\n\nhttps://t.co/vD4Pl1kyyx","date":"Wed Dec 01 01:13:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Sec. Yellen still isn’t backing down from the absurd notion that the IRS should be able to monitor Americans’ bank accounts. The people of Wyoming are not the subjects of the IRS. Wyoming banks do not work for the IRS. Thanks @SenatorTimScott for holding her feet to the fire.","date":"Tue Nov 30 21:56:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Saule Omarova, Biden’s nominee for top banking regulator on oil &amp; gas: https://t.co/4cjdPYd8qE","date":"Tue Nov 30 20:54:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s Build Back Better Plan\n\nvs.\n\nThe Real Build Back “Better” Plan: https://t.co/GnmQwzW3f2","date":"Tue Nov 30 15:40:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Real Build Back “Better” Plan: Slower economy, smaller paychecks, fewer full-time jobs https://t.co/WgT1Ss0APn","date":"Mon Nov 29 19:39:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s Build Back Better Plan: https://t.co/33dQZyR461","date":"Mon Nov 29 19:39:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Real Build Back “Better” Plan: Big tax credits for the wealthy and more taxes for middle-class Americans. https://t.co/LPrQnXNzWd","date":"Mon Nov 29 14:28:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s Build Back Better Plan: https://t.co/0rNcqqy0hI","date":"Mon Nov 29 14:27:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Every year, there is so much to be thankful for. This year, I’m grateful for the time I get to spend with my family and I’m grateful for the opportunity I have to represent the great state of Wyoming. I pray that you all have a restful Thanksgiving with someone you love. https://t.co/WNSrkwwSZl","date":"Thu Nov 25 16:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/yEO8Y1D5cq","date":"Wed Nov 24 15:10:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s great to see federal banking agencies plan for real movement in the digital asset space. Digital assets are here to stay and I’ll be watching to make sure regulators provide innovators with clear guidelines to continue to innovate and also protect consumers from bad actors.","date":"Wed Nov 24 15:10:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks @Stlouisfed… a tofurkey sounds SO much more enjoyable…","date":"Tue Nov 23 18:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Turning to the Strategic Petroleum Reserve is a short-sighted Hail Mary to try and fix the problem he’s actively exacerbating without actually taking responsibility for it.\n\nhttps://t.co/j73CuU7Nvq","date":"Tue Nov 23 16:26:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"One of Biden’s first executive orders stopped new energy leases on federal land. He has continued to push policies that harm WY energy workers and families &amp; raised prices on anyone who relies on fossil fuels to heat their homes or power their vehicles (basically everyone). (1/2)","date":"Tue Nov 23 16:26:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Ron Swanson definitely owns crypto, but he’ll never let the government know.","date":"Mon Nov 22 22:28:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to meeting with Chair Powell and Governor Brainard during the confirmation process, and discussing financial innovation, the impacts of skyrocketing inflation, and other issues affecting the people of Wyoming.","date":"Mon Nov 22 15:23:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We fundamentally disagree about the oil and gas industries, and she would make it harder for Wyoming energy companies to do business. I cannot support that.\n\nhttps://t.co/7MA1tbsUFi","date":"Fri Nov 19 15:32:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’ve supported a handful of President Biden’s nominees, but I’m deeply concerned about his latest pick for Comptroller of the Currency, Professor Saule Omarova. (1/2)","date":"Fri Nov 19 15:31:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"#notpaidfor","date":"Fri Nov 19 00:50:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@RonWyden and I are making sure that tax reporting requirements are clear and don’t put an undue burden on entities that have no information to give the IRS.","date":"Thu Nov 18 21:33:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Digital assets are here to stay, and responsible regulation that protects consumers from bad actors is important. However, we also have to make sure we aren’t stifling innovation.","date":"Thu Nov 18 21:32:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"What do Miley Cyrus and I have in common? The fellas will tell you today on the @RuthlessPodcast","date":"Thu Nov 18 15:25:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Strategic Petroleum Reserve exists to aid us in a true emergency. Our current situation exists solely because the current administration is working overtime to dismantle our domestic energy industry. President Biden has the keys to fix this. \n\nhttps://t.co/14wDwVhBYy","date":"Thu Nov 18 14:54:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Never had so much fun in my life. Thanks @ComfortablySmug and @HolmesJosh","date":"Wed Nov 17 21:49:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden, look at your own EPA, where management of the Renewable Fuel Standards program is adding an estimated 15 to 30 cents per gallon to fuel costs. https://t.co/siVIi7OrRC","date":"Wed Nov 17 19:37:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In Wyoming, we take responsibility for our actions. President Biden said the buck stops with him, but it kind of seems like he’s passing blame to literally anyone else.\n\nhttps://t.co/4JFgXqkJdq","date":"Wed Nov 17 19:37:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A lady never tells...","date":"Wed Nov 17 18:31:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Arriving soon … An opening salvo in support of the coming age of financial freedom and individual sovereignty 🇺🇸 https://t.co/9kyAp9pJfs","date":"Wed Nov 17 16:12:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is at a 30-year high, and people in Wyoming are going to feel it when they put Thanksgiving dinner on the table. https://t.co/rzclvxpTFX","date":"Wed Nov 17 14:31:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to watching this plant come to fruition, and am proud to support Wyoming’s continued place as the number one net energy exporter in the nation.","date":"Tue Nov 16 21:21:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"TerraPower and PacifiCorp’s decision to build their new Natrium reactor in Kemmerer is a huge boon not only to Kemmerer, but to Wyoming’s and America’s future energy independence.","date":"Tue Nov 16 21:20:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming powers America, and I’m so excited for the way that advanced nuclear energy production is going to play a role in our state’s energy sector and economy for years to come.","date":"Tue Nov 16 21:20:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We need to be fostering innovation, not stifling it, if we are going to maintain America’s position as the global financial leader. \n\nhttps://t.co/px84GKbA4x","date":"Mon Nov 15 20:59:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Speaks for itself.","date":"Mon Nov 15 18:58:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden promised that his plan wouldn’t add a penny to the deficit. Turns out that’s not true. Which is surprising to exactly zero people.","date":"Mon Nov 15 16:36:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I know they say in business you have to spend money to make money, but spending billions of dollars on beefing up the IRS to pay for this plan isn’t the winning approach they think it is. https://t.co/lV45B6iwrR","date":"Fri Nov 12 16:48:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My Tribal Liaison Scott Ratliff (Army), State Director Leland Christensen (Army, National Guard), State Policy Director Tyler Lindholm (Navy), and Legislative Director Darrin Munoz (Navy). \n\nJoin me in thanking all of our service members today! https://t.co/8ImFaJqwjF","date":"Thu Nov 11 16:06:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"To those who were willing to sacrifice for our great nation, thank you. \nI’m lucky to have four staff members who selflessly served our country in the armed forces.","date":"Thu Nov 11 16:06:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A $285 billion handout to the wealthiest Americans via the state and local tax deduction doesn’t sound like the middle-class win that the Democrats want you to think this bill is…","date":"Wed Nov 10 17:56:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming produces 14X the energy it consumes, making us the largest net energy exporter in the country. \n\nWe’re using carbon capture, wind – and in the near future – nuclear power, to produce clean, reliable energy for the people of Wyoming and the U.S.","date":"Mon Nov 08 15:20:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$80 billion to expand the IRS is bad news for your bank privacy. The $600 reporting requirement might be gone, but don’t be fooled, the spirit of intrusion is still there. https://t.co/7YUr2JhG6H","date":"Fri Nov 05 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$1.75 trillion is still too much money.","date":"Fri Nov 05 13:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today, I had the great honor of seeing my nephew, Giovanni, and 23 of his fellow marines perform as part of a 24-man Silent Drill Platoon.  \n\nAs we approach Veteran’s Day, I am especially thankful for the men and women who have, and who continue to, serve the United States. https://t.co/M4diZAWHEW","date":"Thu Nov 04 20:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Finally! Flights resumed to the Cheyenne airport earlier this week. It’s important to the Cheyenne community to have reliable air service. I’m certainly looking forward to flying into my hometown when I travel to and from Wyoming. \n\nhttps://t.co/J59L9kMOK2 https://t.co/vMcCBaO4pW","date":"Thu Nov 04 18:07:46 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Big things are coming to Cheyenne! It’s exciting to see companies jump on the momentum that Wyoming has built over the past couple of years. Welcome to a great new home, @EliteMiningInc\n\nhttps://t.co/0Gmzhn6Cj6","date":"Thu Nov 04 16:41:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Any green energy plan that ignores nuclear energy and carbon capture is no plan at all. @SenDanSullivan, @SenKevinCramer, and I are rolling out a framework that cuts our CO2 emissions by 40% by 2050 while preserving American jobs and energy independence. It’s a win-win. https://t.co/DooA841Y9o","date":"Thu Nov 04 14:02:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I'm vaccinated, and support others making the decision to get the vaccine to protect themselves, but I'm very concerned about unacceptable actions by the Exec. Branch to force Americans to get the vaccine. I can't stay silent about these blatant violations of personal freedom.","date":"Wed Nov 03 19:30:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I'm about to speak about this effort on the Senate floor. \n\nhttps://t.co/80qAgREmZT","date":"Wed Nov 03 19:29:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Taking shots at one another won’t fix the supply chain crisis in time for retail’s busiest season. I wrote to President Biden with some real solutions to help make sure Wyoming families aren’t faced with high prices and empty shelves this Christmas season.\nhttps://t.co/7h3dzFgTn8","date":"Wed Nov 03 16:04:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"GOP Sen. Lummis urges Biden to ditch OSHA vaccine rule, lower age requirement for commercial trucking to ease supply chains https://t.co/kSF6funULZ","date":"Wed Nov 03 14:21:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"People in Wyoming are paying more for their groceries and their gas due to President Biden’s inflationary policies. Adding another $1.75 trillion (on top of an already hot economy that doesn’t need it!) will spell disaster for Wyoming families. https://t.co/xeO7yZpAKn","date":"Wed Nov 03 13:35:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My heart goes out to @SenatorRounds after the loss of his wife. I know the feeling of losing a spouse all too intimately. My prayers are with you and your family as you navigate this difficult season.","date":"Wed Nov 03 01:00:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Grizzly Bear State Management Act is essential to ensuring the recovery of the GYE grizzly is a happy conservation success story, not a grisly failure. \n\nhttps://t.co/aOFOVeRGjK","date":"Tue Nov 02 20:14:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Democrats are telling us that this bill will *only* cost $1.75 trillion. But the truth is they have NO IDEA what it’ll actually cost. And they’re willing to vote on it without that information or even information on what is actually in it. \n\nUnconscionable.","date":"Tue Nov 02 18:14:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Paid for you say? https://t.co/RePqP5myx8","date":"Tue Nov 02 15:06:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining @SquawkCNBC to chat about the Build Back Better plan and the supply chain crisis. \n\n📺Tune in!📺","date":"Tue Nov 02 12:31:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My thoughts on the President’s Working Group Report on Stablecoins ➡️➡️➡️ https://t.co/zSxM7w8Diq","date":"Mon Nov 01 22:00:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Exciting potential here: Carbon capture and storage is an important part of any plan to reduce emissions. Big things are happening in Wyoming.\n\nhttps://t.co/Tl37WGA1Gp","date":"Mon Nov 01 14:47:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Sen. Cynthia Lummis: Biden arrives at COP26 climate summit with a US energy crisis he created\n\nhttps://t.co/srw9trrEk2","date":"Sun Oct 31 21:18:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"America is drowning in $28 trillion in debt, and Americans are suffering under rampant inflation. President Biden priority? Encouraging more illegal immigration by giving $450,000 of your tax dollars to lawbreaking illegal immigrants.","date":"Sat Oct 30 18:53:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This is truly appalling and I will do everything I can to fight it.\n\nhttps://t.co/kWFHVhUckj","date":"Sat Oct 30 18:53:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Social Media companies designed their products to be highly addictive, gave our children unfettered access, and then lied about the effects. \n\nSound familiar?\n\nhttps://t.co/LPvKUyM2q6","date":"Fri Oct 29 19:06:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"That is unacceptable. That’s why I introduced the HERD Act to get the federal government back to working for YOU.\n\nhttps://t.co/kKtOu3JnXV","date":"Fri Oct 29 17:47:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"America is getting back on its feet after the COVID lockdowns, but many federal workers are still not in the office. That means casework is piling up and the people of Wyoming aren’t getting the help they need from the VA, Social Security Administration or other gov't agencies.","date":"Fri Oct 29 17:46:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden and Democrats in Congress have hamstrung our domestic energy production. \n\nPresident Biden’s chief of staff says that rising prices are a “high class problem.\"\n\nPeople in Wyoming are paying the price. https://t.co/OF4ukE3Wh4","date":"Thu Oct 28 19:22:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Instead of waiting for the next whistleblower, I’m giving Facebook the opportunity to be forthcoming with information to ensure kids are protected &amp; parents have the resources they need. Sunlight disinfects &amp; it’s long past time to shine light on the darkest corners of Facebook. https://t.co/A49RNEQuec","date":"Thu Oct 28 16:42:54 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joining @TeamCavuto shortly to talk about President Biden’s reckless “Build Back Better” framework. \n\n📺 Tune in! 📺","date":"Thu Oct 28 16:00:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining @seanhannity on Hannity radio at 4:30 ET! Tune in!","date":"Wed Oct 27 20:04:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"“Fiscally responsible” https://t.co/sKdyDQplS5","date":"Wed Oct 27 19:46:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"According to President Biden, we saved 16 cents on our July 4 BBQs. \n\nLooks like we’ll pay for those savings while shopping for our Thanksgiving fixings. \n\nhttps://t.co/DIwyV8hvZf","date":"Wed Oct 27 15:44:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The “green energy” provisions in the Democrats’ reckless tax-and-spend plan would do more to bolster China and Russia than to solve any climate crisis. \n\nhttps://t.co/Ts6PWmWeSr","date":"Wed Oct 27 13:36:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s simple math. If you spend more than you bring in year after year, you’re going to have a problem.\n\nhttps://t.co/OXtAw4nV9g https://t.co/rWxz9Kc2Be","date":"Mon Oct 25 19:07:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"What are four things that people in Wyoming don’t want? Higher taxes, bigger government, increased costs, and a lot more debt. \n\nDemocrats can keep their $3.5 trillion bill.","date":"Mon Oct 25 15:15:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats are raising the threshold to $10,000 for their IRS reporting requirement proposal, but we’re not fooled. \n\nIf you think you’re exempt, check out these 10 ways you might find yourself a target of this new weaponized IRS:\nhttps://t.co/lQ6evAmFCH","date":"Mon Oct 25 13:17:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I had the pleasure of meeting Wyoming’s Teachers of the Year for 2020 and 2021! Dane Weaver of Ten Sleep and Alexis Barney of Casper go above and beyond to ensure their students have a top notch education. Congratulations on this award! https://t.co/pjxIGowvDC","date":"Fri Oct 22 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Shocked and surprised…\n\nBut all sarcasm aside – We the People are paying for this massive spending plan.\n    https://t.co/vIakmfngMf","date":"Fri Oct 22 13:48:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Winter is coming and the cost to heat your home is expected to jump 54 percent. But according to Biden’s chief of staff, that’s a high-class problem. \n\nhttps://t.co/koXlJ6liag","date":"Thu Oct 21 18:17:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Democrats want to know what you’re spending your money on. They’re not trying to catch tax cheats; they’re trying to insert big government into every single part of your life.\n\nhttps://t.co/xnGu26jBUS","date":"Thu Oct 21 14:35:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Fact Check: False. \n\nThe price tag is $3.5 trillion, probably more once we find out what’s in it.","date":"Wed Oct 20 18:56:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/Jr3Tmh6vta https://t.co/tmNsyBH6eC","date":"Wed Oct 20 13:14:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Louisa Swain changed history with her vote in 1870, and I can’t think of a better name for a federal building in the Equality State. \n\nhttps://t.co/UAdNwPQT52","date":"Tue Oct 19 13:46:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My heart breaks for the family of Colin Powell today. He was a pioneer and a man who loved his country greatly. My prayers are with those who loved him today.","date":"Mon Oct 18 18:57:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Looking forward to joining @thedacfp at their Vision Conference on October 19th. \n\nDigital assets have an important role in our financial system moving forward. See you tomorrow! https://t.co/J22MkHDMvh","date":"Mon Oct 18 18:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is talk of watering this IRS reporting requirement down. \n\nThat’s not good enough. \n\nWeaponizing the IRS to spy on everyday Americans doesn’t work for me, and doesn’t work for the people in Wyoming. \n\nhttps://t.co/p8RKJNFyeS","date":"Mon Oct 18 16:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I cosponsored @SenTuberville’s FARM Act to better protect farmers and ranchers in Wyoming from the influence of foreign actors in the Ag industry.\n \nhttps://t.co/KO4mp2A4p9","date":"Mon Oct 18 15:05:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It is horrifying to me that we are even considering a $3.5 trillion spending bill when we are almost $29 TRILLION in debt. Instead of addressing this problem, we are taking cheap shots at one another to win the next election. It’s unconscionable. https://t.co/e2sdcRtGSy","date":"Fri Oct 15 15:58:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Smart regulation fosters innovation. \n\nI founded the @FinancialCaucus to:\n➡️ Protect consumers\n➡️ Empower entrepreneurs\n➡️ Pave the way for regulation that enables the next generation of Americans to thrive\n\nhttps://t.co/3XIbQZCPyL","date":"Fri Oct 15 13:38:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In August, Border Patrol agents seized a record 1,123 pounds of fentanyl.\n\nRadical open border policies are allowing criminals to funnel dangerous drugs into our country.\n\nMr. President – This is a crisis.\n \nhttps://t.co/iwLu4MtdXA","date":"Thu Oct 14 18:20:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The provisions in the Dems tax and spend plan would hamstring our domestic energy industry. \n\nThe United States produces the cleanest energy in the world. (1/2)","date":"Thu Oct 14 15:28:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Sending our clean energy around the world will do more to reduce greenhouse gases than any plan to send production overseas. \n\nYou know who benefits from cutting our production? China and Russia. \n\nWho benefits from American energy production? \n\nEveryone.","date":"Thu Oct 14 15:28:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats are still in disarray over this huge spending package. @ChuckGrassley made a great point this past weekend – Social Security and Medicare are facing insolvency. If we can’t cover our current obligations, what business do we have adding new government programs?","date":"Thu Oct 14 13:29:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I still am waiting to hear why the IRS is interested in the cattle purchases of ranchers in Wyoming. https://t.co/uAnms4QCDO","date":"Wed Oct 13 14:57:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Democrats want to go on a spending binge, without any concern for how it will impact the economy or future generations. \n\nThe people of Wyoming don’t run up credit cards with no plans to pay them back. We expect the same from our government.","date":"Tue Oct 12 17:35:55 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joe Biden continues to prioritize his radical progressive agenda as Main Street America suffers through the worst job report of the year.\n \nDemocrat’s economic crisis continues to hurt everyday Americans and small businesses.","date":"Fri Oct 08 19:03:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This isn’t a partisan issue. Congress must do more to protect our data privacy rights. In Wyoming, we say good fences make good neighbors. It’s time to put some good fences around Big Tech.\n\nhttps://t.co/JoSn8sZW3u","date":"Fri Oct 08 14:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I don’t believe that the regular, hardworking people across Wyoming are tax cheats. But this proposal to report any transaction over $600 to the IRS implies that they are. https://t.co/nRRLIFQXz8","date":"Thu Oct 07 19:49:41 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Students from Shoshoni, WY (pop. 515) won – for the 4th year in a row – the Best in WY prize at the WY Hack-a-thon. These students, under the instruction of @ShoshoniTony and @profsmith9000, are preparing to be leaders in this industry and paving the way for new industry  in WY.","date":"Thu Oct 07 14:27:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The IRS already knows how much you make. Now they want to know how you spend it. \n\nhttps://t.co/xnGu26213k","date":"Wed Oct 06 18:09:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Saying something costs $0 doesn’t actually make it cost $0. If Dems raised taxes on every American family to pay for their plan, it still wouldn’t cost $0. People in Wyoming know when the wool is being pulled over their eyes.","date":"Wed Oct 06 15:53:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @foxandfriends to chat about Facebook and your data privacy. \n\n📺 Tune in now!","date":"Wed Oct 06 11:40:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Live shot of platinum eagles saving the day for Dems https://t.co/BmcefKmjgZ","date":"Tue Oct 05 22:18:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Tolkien be like: the eagle is my deus ex machina!\n\nhttps://t.co/Epv1sod4Xk","date":"Tue Oct 05 21:56:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"💯💯💯","date":"Tue Oct 05 16:34:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Under the current IRS proposal, banks would be required to snitch on purchases people across WY have to make every day. \n\nAn appliance repair, a car repair, or a rent check would trigger this reporting requirement. That’s a huge invasion of privacy.\n\nhttps://t.co/xnGu26213k","date":"Tue Oct 05 14:59:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @bdomenech on Fox News Primetime to talk about Big Tech and your data privacy. Tune in!","date":"Mon Oct 04 23:27:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/OykLbTirSM","date":"Mon Oct 04 22:38:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The actions taken by the protestors at Arizona State University were despicable. This is not how we disagree. This is not how we make our voices heard. This was a violation of @SenatorSinema’s privacy and the privacy of those uninvolved bystanders.","date":"Mon Oct 04 17:03:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Secretary Yellen – do you distrust the American people so much that you need to know when they bought a couch? Or a cow? https://t.co/pg4I1eeblq","date":"Mon Oct 04 13:44:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Tell me you’ve never run a business without telling me you’ve never run a business.\n\nhttps://t.co/Ngv1yvasxw","date":"Fri Oct 01 13:55:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"To my Senate colleagues across the aisle, do you really want your names associated with a NO COMPROMISE mouthpiece of a convicted eco-terrorist organization? \n\nTracey Stone-Manning is wholly unqualified to serve as director of the Bureau of Land Management.","date":"Thu Sep 30 19:43:43 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining @TeamCavuto at 12:30 pm ET to talk about the Democrats’ reckless tax and spending bill and the disastrous IRS reporting requirement proposal. \n\n📺 Tune in! 📺","date":"Thu Sep 30 16:24:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Secretary Yellen: “It’s important to have comprehensive information so people can’t game the system.” \n\nNo ma’am. But you know what is important? Liberty. https://t.co/TKUn4Fi6Ny","date":"Thu Sep 30 15:07:41 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$28 Trillion. Enough is enough. https://t.co/JZowPsAOjP","date":"Wed Sep 29 18:00:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"About to speak at the @SenateCommerce hearing on Big Tech and consumer privacy. Tune in here: https://t.co/yCSrRKm6nI","date":"Wed Sep 29 15:42:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today I’ll be participating in a Commerce committee hearing to talk about your privacy rights, and how big tech is abusing them. Read my oped about recent examples here: \n\nhttps://t.co/7Y8zH7V3Vf","date":"Wed Sep 29 14:07:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Nope.","date":"Wed Sep 29 13:32:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Sen. Lummis slams Yellen over $600 IRS reporting requirement https://t.co/OtBnvcF3xv #FoxBusiness","date":"Tue Sep 28 23:00:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Senator Lummis lambasted a Biden administration proposal to require banks to disclose every financial transaction over $600 to the Internal Revenue Service (IRS) in a Senate Banking Committee Hearing today. \n\nhttps://t.co/0WT2VDLHPu","date":"Tue Sep 28 21:09:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Sen. Lummis Slams Yellen Over $600 IRS Reporting Requirement https://t.co/xC6tcMqyfc via @Newsmax","date":"Tue Sep 28 19:08:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming bank customers are NOT subjects of the federal government. \n\nWyoming Banks do NOT work for the IRS. https://t.co/648Zit7cXL","date":"Tue Sep 28 16:44:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More Government spending = more inflation\n\nMore inflation = higher prices\n\nHigher prices = less economic recovery","date":"Tue Sep 28 13:03:41 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"While I believe the vaccine to be a safe and effective protection against the virus, I’m strongly opposed to a federal vaccine mandate and will continue to fight here in Washington against a top-down approach to vaccination.","date":"Mon Sep 27 16:53:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Hospitals are filled with unvaccinated COVID patients, but those with the vaccine fare better against the virus.","date":"Mon Sep 27 16:53:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Operation Warp Speed, a Trump administration response to the COVID pandemic, changed the game in terms of this virus. I got vaccinated and I urge you to talk to your doctor and consider getting the vaccine.","date":"Mon Sep 27 16:52:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Raising the debt ceiling just to push through an irresponsible spending plan makes no sense. We are actively and knowingly saddling future generations with an unsustainable amount of debt.","date":"Mon Sep 27 15:00:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$28,797,795,874,032. \n\nBut yes, let’s raise the debt limit.","date":"Fri Sep 24 13:51:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A new iPhone\n\nhttps://t.co/k2RzJLmBYA https://t.co/BsKagsB0bp","date":"Thu Sep 23 20:38:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Six bowls of super fancy hummus (yes, I want to try this)\n\nhttps://t.co/IdnvznAWzO https://t.co/Mm54YpJwBg","date":"Thu Sep 23 20:38:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A rent check for an average apartment in Cheyenne\nhttps://t.co/35PFrvLWT1 https://t.co/4LU0kHj4gQ","date":"Thu Sep 23 20:38:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This robot vacuum\n\nhttps://t.co/sRZBG0BCTK https://t.co/1cZD0DtboL","date":"Thu Sep 23 20:38:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This espresso machine\nhttps://t.co/KiKq5IlwAx https://t.co/d3qbKv0oqF","date":"Thu Sep 23 20:38:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Purchases that would trigger an IRS reporting requirement by your bank. \nhttps://t.co/5J2Jfz1uGF\nA Thread.","date":"Thu Sep 23 20:38:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"@MikeCrapo That amendment failed, but we will continue to work to ensure the privacy of your bank account.","date":"Thu Sep 23 17:08:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I got this note from my bank last week. WY banks should not be forced to implement this absolutely absurd proposal that violates our core right to privacy. I joined @MikeCrapo’s amendment to the infrastructure bill to prevent this overreach. (1/2) https://t.co/3W4pw4mJxg","date":"Thu Sep 23 17:08:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Fact: Democrats only want to raise the debt ceiling so they can continue to irresponsibly spend. If they wanted to address long-term spending, I’d be all ears. They don’t, so I’m a hard no on increasing our debt limit.","date":"Wed Sep 22 17:28:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Not only do Americans oppose blanket amnesty, they want a secure border. Democrat efforts to pass radical immigration policies using budget procedure run contrary to the will of the American people. They are also contrary to the longstanding Senate rules.\n\nhttps://t.co/eDlNUrwC8C","date":"Tue Sep 21 14:13:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Instead, we lost 13 U.S. service members in a suicide bombing and have no clear picture of how many Americans are stranded at the mercy of the Taliban. We have a responsibility to our citizens and our allies. (2/2)","date":"Mon Sep 20 14:50:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In April, I supported President Biden’s announcement that the U.S. would finally withdraw troops from Afghanistan. I incorrectly assumed he had a plan for an orderly withdrawal. (1/2)","date":"Mon Sep 20 14:50:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 2020, our budget deficit (money we have minus money we spent) increased by $2.1 TRILLION. This is money we don’t have! https://t.co/AvswuYybHt","date":"Fri Sep 17 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy Constitution Day! https://t.co/tRQltOEDox","date":"Fri Sep 17 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Last weekend, we honored the newest inductees into the Wyoming Cowboy Hall of Fame. These new members embody the cowboy spirit and everything that makes Wyoming wonderful. Congratulations to the 2020 and 2021 inductees! https://t.co/JuWKxyGF8M","date":"Thu Sep 16 19:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Year after year, we run up the debt, then run around w/ our hair on fire when we hear there are consequences for our actions. We need to:\n➡️ stop spending money we don’t have\n➡️ craft a plan that addresses the debt ceiling w/o giving Congress a free pass to spend recklessly.","date":"Thu Sep 16 18:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"While the debt ceiling looms, Sen. Sanders and the Dems are trying to force through a $3.5 trillion plan, even as members of their own party raise concerns. Instead of continuing to spend, we should consider my Sustainable Budget Act to prevent this situation in the future.","date":"Thu Sep 16 16:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is no doubt in my mind that we needed to wind down our involvement in Afghanistan. I never dreamed a withdrawal would be executed so poorly by a Commander in Chief. There are still Americans on the ground there and allies under threat from the Taliban. We’re failing them.","date":"Thu Sep 16 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Raising the debt ceiling has serious consequences, but we never seem to learn from the past. If we don’t address it now, we risk defaulting on our commitments.\nhttps://t.co/tXiYsxPoGd https://t.co/6iO5cZ2P3C","date":"Wed Sep 15 16:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Members of my staff will attend the Wyoming U.S. Service Academies Informational Event on Saturday, Sept. 25 from 1:00 p.m. - 4:00 p.m. at Cheyenne Central High School. \n\nMore information can be found on my website at https://t.co/AYZHDq0ZTV. https://t.co/TZlHpbUkRc","date":"Wed Sep 15 15:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s time for Gen. Milley to go. This accusation is a huge violation of his oath of office. \n\nhttps://t.co/RUMZt09VuX","date":"Wed Sep 15 13:51:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"But don’t worry… we saved 16 cents on our July 4th cookouts.\nhttps://t.co/c4y7ygoVu0 https://t.co/PCCCCdJl8O","date":"Wed Sep 15 13:26:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s time for some accountability over the lives lost and the Americans and allies left behind in Afghanistan. I applaud @HawleyMO","date":"Tue Sep 14 23:00:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I paid tribute today on the Senate floor to Rylee McCollum, a Marine from Wyoming who was killed in a terrorist attack in Afghanistan on August 26.\n\nhttps://t.co/l4ranbNAvk","date":"Tue Sep 14 22:08:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining my Republican colleagues on the Senate Banking Committee to call on Senator Schumer to allow this monumental legislation to go through the proper committee process.","date":"Tue Sep 14 14:34:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$3.5 trillion is an irresponsible amount of money to spend on anything, but the idea that we’re going to pass it, then find out what’s in it is completely unacceptable. (1/2)\n\nhttps://t.co/nXBWVPU3Bk","date":"Tue Sep 14 14:34:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If you’d like a pet, may I suggest heading to your local animal shelter instead of picking up wildlife that you come across? Remember, always keep a safe distance from wild animals.\n\nhttps://t.co/Ocyo2IwRas","date":"Mon Sep 13 19:24:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I can’t think of anyone more deserving of this honor. Diana has dedicated her life to making Wyoming – and the world - a better place, championing vocational education, small businesses and women’s issues around the globe.","date":"Mon Sep 13 14:36:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to my dear friend Diana Enzi as she receives the Governor’s Woman of Distinction Award bestowed by the Wyoming Council for Women. (1/2) https://t.co/IS8KsSeEwK","date":"Mon Sep 13 14:35:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It's hard to believe it has been 20 years since we watched the tragedy of 9/11 unfold before our eyes. In the midst of our grief, we saw heroes stand up and answer the call of duty. \n\nToday and every day, we remember and mourn for those whose lives were lost or forever changed. https://t.co/3Vrbva4mNV","date":"Sat Sep 11 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Lummis staff is taking over real quick to wish a big HAPPY BIRTHDAY to the best boss! https://t.co/zE8cgjgsFu","date":"Fri Sep 10 15:24:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"After all these years, Dale Bohren is retiring! He’s done phenomenal work at the @CSTribune. He will surely be missed. Thanks Dale, for being a listening ear for people across WY &amp; for all your hard work to bring the news each &amp; every day. Happy trails!\n\nhttps://t.co/XIOylMV8ct","date":"Fri Sep 10 15:03:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Yikes...","date":"Fri Sep 10 13:45:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"COVID-19 has taken too many lives in WY and wreaked havoc on our economy. Development of vaccines under Pres. Trump saved many lives. I got my vaccine, and I urge you to talk to your dr about getting yours, but the federal govt inserting itself like this is a huge overreach.","date":"Thu Sep 09 22:57:54 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"David Chipman was the wrong man for the job for multiple reasons, but his ignorance on basic firearm classifications should have disqualified him immediately. Glad to see the White House has withdrawn his nomination.\n\nhttps://t.co/MvEJC6D2gQ","date":"Thu Sep 09 22:08:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I wasn’t in office last time we had this fight, but I would have voted no then too. Raising the debt ceiling is just another attempt to kick the can down the road instead of fixing our spending problem. \n\nhttps://t.co/Zg9G9uQNP5 https://t.co/QhWXKUzB5N","date":"Wed Sep 08 14:46:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is the leader in digital asset legislation, and the University of Wyoming is working to equip students to join one of the fastest growing industries in the American economy. I’m excited to see what this program has to offer. \n\nhttps://t.co/NYXeXwKTkk","date":"Tue Sep 07 15:20:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy Labor Day! \n\nThank you to all the hard-working people in Wyoming who keep our economy moving forward. https://t.co/SbHOOYggUG","date":"Mon Sep 06 14:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@Sen_JoeManchin is right, “An overheating economy has imposed a costly ‘inflation tax’ on every middle- and working-class American” and our national debt is the “biggest threat to national security.”\n\nhttps://t.co/Rc7ALffqVM","date":"Fri Sep 03 20:44:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Bernie Sanders is travelling the country trying to convince people that his $3.5 trillion tax-and-spend plan is good for them. The thing is, he can’t even convince all of his own party. More gov't spending just means more gov't interference in our lives.\n\nhttps://t.co/IlMGQsJESf","date":"Fri Sep 03 12:22:55 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If this was truly the only way to get people out, the administration had a responsibility to ensure all of the them got out before we left. We’ve essentially signed these people’s death warrants. \n\nhttps://t.co/zfRAupjbnq","date":"Thu Sep 02 13:15:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Please call one of my state offices for assistance with these programs. \n\nhttps://t.co/qeOOR1a7Ov","date":"Wed Sep 01 16:45:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is suffering under serious drought conditions this year. 60% of the state is experiencing severe drought. This has huge implications for farmers and ranchers around the state. If your operation was impacted, you may be eligible for one of the USDA’s relief programs. https://t.co/obriAVcRrS","date":"Wed Sep 01 16:44:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming Hidden Gem: Thermopolis Hot Springs\nNeed a little R&amp;R? Head up to the natural hot springs in Thermopolis! Hike around the park, soak in the mineral springs, or view the impressive mineral terraces. A herd of bison also calls the area home. https://t.co/1JL68SHSUw","date":"Mon Aug 30 13:47:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Rylee sacrificed his life in service to his country and to the brave Afghans who partnered with us during our mission in Afghanistan. His sacrifice will not be forgotten. \n\nhttps://t.co/Mswpio1HwW","date":"Fri Aug 27 20:11:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"From fall to early spring, it’ll run for about 18 minutes, then will stop flowing all together for 15-20 minutes. The spring is located about 5 miles outside of Afton, WY, and is just a short hike from the parking area.","date":"Fri Aug 27 13:17:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming Hidden Gem: Periodic Spring\n\nThis geological phenomenon is unlike anything in the world. It’s a cold-water geyser. https://t.co/yoXVHOcCWm","date":"Fri Aug 27 13:17:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m praying for the families of those brave service members who sacrificed their lives today in Kabul. This is absolutely tragic. I’m praying for the safety of those still working to get Americans and our Afghan partners out of the reach of the Taliban.\n\nhttps://t.co/dbKM38580S","date":"Thu Aug 26 17:29:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Law enforcement officers across Wyoming are essential members of our community. It’s always a privilege to be able to talk with them about what they’re facing every day. Thank you for your service. https://t.co/o76AdNywga","date":"Thu Aug 26 13:55:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"So fun to see kids from the Boys and Girls Club at the Wyoming State Fair Parade in Douglas last weekend! https://t.co/z20IKA6530","date":"Wed Aug 25 14:18:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"At no time in the past 20 years have we seen such an influx of migrants at our southern border. President Biden has done nothing to quell the surge. This is a crisis. https://t.co/lSBoVaNqhN","date":"Tue Aug 24 18:14:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It's always fun to ride in the Wyoming State Fair parade! This year was no different. I love celebrating our agricultural roots here in Douglas every year. Congratulations to all who participated in this annual tradition. I’m already looking forward to next year. https://t.co/1QUPKgqDn8","date":"Tue Aug 24 13:50:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It also was the home of Esther Hobart Morris, and where she held office as the first female justice of the peace. Though it’s now a ghost town, you can visit and see the old mine and some of the original buildings.","date":"Mon Aug 23 14:09:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming Hidden Gem: South Pass City\n\nGold rush! South Pass City in Fremont County was established in 1867 after gold was discovered. It was at one time the largest settlement in Wyoming due to traffic on the Oregon Trail and gold miners seeking wealth in the west. https://t.co/til3jBxcAV","date":"Mon Aug 23 14:09:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Border Patrol agents are arresting nearly 7,000 people a day as they attempt to cross our southern border. \n\nBut we know that hundreds, maybe thousands, are crossing undetected.\n\nhttps://t.co/r248P33uKL","date":"Fri Aug 20 18:29:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy Fair Week! Congratulations to all the participants who have worked so hard to make it to the Wyoming State Fair. Thank you for doing your part to keep our Wyoming way of life alive and well. Best of luck this week! https://t.co/WBeGeGSq2V","date":"Thu Aug 19 21:02:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is still a crisis at the border.\n\nhttps://t.co/mrvLlTEU2v","date":"Thu Aug 19 13:57:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming blazed the trail for women’s suffrage in the U.S. It may have taken 50 years, but the ratification of the 19th Amendment recognized a God-given right for all women in America. https://t.co/cpjdzYaQ7Q","date":"Wed Aug 18 19:56:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’ll kick it off with a hidden treasure close to home: Curt Gowdy State Park. Right between Laramie and Cheyenne on Old US Hwy 30, this park is named for renowned sportscaster and Wyoming native Curt Gowdy. Don’t miss this hidden gem! https://t.co/tnhs7Klk1Q","date":"Wed Aug 18 14:13:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Summer is winding down, but there’s still time to see some of Wyoming’s hidden gems before the kids head back to school. This week, I’ll highlight some of my favorite spots around the state.","date":"Wed Aug 18 14:13:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"When I was in the House of Representatives, I balked at our $14 trillion in debt. I voted against President Obama’s budgets because of the high level of spending. Those proposals look measured compared to what we’re churning out now.\n\nhttps://t.co/ZQpfy0jItS","date":"Tue Aug 17 15:23:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Democrats are calling this $3.5 spending package “human infrastructure.” In reality, this is a progressive grab bag that includes job-killing Green New Deal provisions, amnesty for illegal immigrants, and a lot more government interference in your healthcare and education.","date":"Mon Aug 16 22:47:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Yesterday, we officially opened my constituent office in Star Valley! Sarah Hale is ready to meet with you and help you with whatever concerns you may have with federal agencies. Visit https://t.co/qeOOR0SwpV to get in contact with her. https://t.co/DtDCWtoYv8","date":"Sat Aug 14 19:34:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Also Biden: \n➡️ Asks OPEC to produce more oil for lower prices here\n➡️ Signs off on the Russian NordStream Pipeline\n➡️ Turns a blind eye to countries with lower environmental and labor standards as they continue to supply the world with energy.","date":"Fri Aug 13 13:58:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Biden:\n➡️ Bans oil &amp; gas leasing on federal lands\n➡️ Cancels the keystone pipeline\n➡️ Promotes Green New Deal policies","date":"Fri Aug 13 13:58:55 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is hovering like an ominous drone over people in my home state of Wyoming and across America. Real hourly earnings are down nearly 2% from a year ago. This is because increased prices have outpaced any extra money in paychecks.","date":"Thu Aug 12 13:57:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We need cross-party agreement on the future of finance, not narrow partisanship. Stay tuned in the coming weeks for first steps!","date":"Wed Aug 11 22:51:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"New laws cannot put the thumb on the scales for a specific digital asset or against the industry as a whole, and MUST enable responsible innovation. Will work with my colleagues to create a balanced framework that gets this right.","date":"Wed Aug 11 22:51:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Agree with @GaryGensler that we need regulatory certainty for digital asset traders and lenders—but the devil is in the details. Congress WILL weigh in and both @SECNews and @CFTC have important roles to play.","date":"Wed Aug 11 22:51:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Critical that CFTC AND SEC engage to provide digital asset industry w/ more no-action relief and interpretive guidance on the front end.\nhttps://t.co/sqRCre5oe3","date":"Wed Aug 11 22:51:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats reckless tax-and-spend plan featuring:\n➡️ $107 billion to give green cards to illegal immigrants\n➡️ $198 billion for Green New Deal priorities\n➡️ $726 billion for free community college and pre-K regardless of need","date":"Wed Aug 11 14:58:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"What’s in it for you? Higher prices on everyday goods and more government interference in your life.","date":"Wed Aug 11 14:58:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The typical home in Wyoming costs about $273,992. With $3.5 trillion, a Wyoming resident could buy 12,774,095 houses. (There aren’t that many houses to buy in Wyoming…)","date":"Wed Aug 11 02:35:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If we’re going to spend $3.5 trillion, we need to have a better understanding of what that actually means. \n\nFor your reference, if I had $3.5 trillion to hand out, I could give $456 to every human being on the planet.","date":"Tue Aug 10 21:45:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I support @MikeCrapo’s amendment limiting the reach of the IRS and preventing unnecessary regulatory burdens on our hardworking community banks. A bank account is essential today and should not be a license to snoop!","date":"Tue Aug 10 21:09:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’d add inflationary, damaging, and irresponsible.","date":"Tue Aug 10 20:45:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We all want lower gas prices, but just months ago, President Biden halted new oil and gas leases on America’s federal land, which is stifling Wyoming and America’s own domestic production of oil and gas and empowering OPEC.","date":"Tue Aug 10 20:24:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I'm disappointed that Democrats voted down this common sense amendment. \n\nThis summer, President Biden encouraged OPEC to increase their production of crude oil in an attempt to keep gas prices down.","date":"Tue Aug 10 20:24:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Going to speak on the Senate floor about my amendment to protect American energy independence.\n\nhttps://t.co/7wd4urpKzM","date":"Tue Aug 10 19:09:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today, a gallon of gas in Cheyenne, WY is $3.57.\n\nIn 2019, we were energy independent. An average gallon of gas was $2.60. Not the case today. But President Biden still won’t lift his oil &amp; gas leasing moratorium on federal lands. \n\n#stoptheBidenBan\n\nhttps://t.co/kzOKjjdmdd","date":"Tue Aug 10 17:54:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"High praise from one of the GOATs of rock n roll!","date":"Tue Aug 10 14:29:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Let’s be clear: The $3.5 (really closer to $5.5) TRILLION package Dems are pushing is NOT infrastructure. It’s a progressive grab bag of policies that you'll pay for with your hard-earned dollars either through more inflation now or higher taxes later.\n\nhttps://t.co/Y1ZxDZlS3F","date":"Tue Aug 10 13:40:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We will continue to look for ways to fix the digital asset language in this bill. It might not be today, but we won’t give up.","date":"Tue Aug 10 01:09:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you to @RonWyden and @SenToomey for fighting with me for the innovators that make our country great. The fight isn’t over. It always takes work to convince skeptics of the merits of new technology.","date":"Tue Aug 10 00:30:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We must prepare NOW for the next time we go up against the anti-innovation crowd. We must:\n➡️ engage early\n➡️ build coalitions\n➡️ shed light on the actors who are working to stifle innovation and maintain the status quo.","date":"Tue Aug 10 00:30:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This is why we started @FinancialCaucus – to educate those who are going to make decisions that affect this industry. If we keep pressing forward without understanding the implications of our actions, we are going to fall further and further behind China in financial innovation.","date":"Tue Aug 10 00:30:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There are some important lessons from this about the antics in Washington. First: This is what happens when bills are drafted behind closed doors without input from experts and stakeholders.","date":"Tue Aug 10 00:30:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Our effort to get a vote on a digital asset fix failed because other senators refused to set aside their disagreements to support something they could actually agree on. Thanks @SenToomey for explaining this at the end of our effort on the floor.\n\nhttps://t.co/Lok8EWK1Eb","date":"Mon Aug 09 23:48:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"About to head down to the Senate floor to ask for unanimous consent to adopt the Toomey-Lummis-Warner amendment as part of the Bipartisan Infrastructure Framework. It’s not perfect, but it’s a big step in the right direction.\n\nhttps://t.co/7wd4ur89Ie","date":"Mon Aug 09 19:41:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’ve been working all weekend to come up with a compromise to address the digital asset broker issue in the Bipartisan Infrastructure Framework. While it’s not perfect, it protects innovation and doesn’t choose winners and losers.","date":"Mon Aug 09 16:56:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today, we’re going to push for a unanimous consent agreement on the Senate floor, which we are hoping will be successful.","date":"Mon Aug 09 16:56:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"While there were bumps in the road, this is how the Senate is supposed to work. Thanks to @RonWyden, @SenToomey, @MarkWarner, @SenatorSinema and @Senrobportman for their hard work and open minds on this issue.","date":"Mon Aug 09 16:56:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The future is in digital assets. https://t.co/ldzWUUW8aU","date":"Mon Aug 09 15:44:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"🚨🚨TUNE IN 🚨 🚨","date":"Mon Aug 09 15:32:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$3,500,000,000,000. \n\n(That’s it. That’s the tweet.)","date":"Mon Aug 09 13:42:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Right now, we need an agreement on allowing amendments, which is being held up because of conflict between senators over the 30-hour rule, which allows the Senate to consider/read/review a bill for up to 30 hours before voting on it.","date":"Mon Aug 09 02:23:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Some senators want to keep focusing on the infrastructure bill for 30 hours to raise awareness about its price tag. Senator Schumer wants to quickly vote in order to focus on other legislation, and won’t allow amendment votes unless that happens.","date":"Mon Aug 09 02:23:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Tomorrow at 9 am offices will be back in like usual. Feel free to call your senators to let us know how you think we should move forward.","date":"Mon Aug 09 02:23:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"So we’re at an impasse. I understand my colleagues’ positions. But real people are going to be hurt if we do not change the language in this bill. Tomorrow we’ll be back in session and again work to convince our colleagues and Senator Schumer that our amendment deserves a vote.","date":"Mon Aug 09 02:23:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This has been an interesting day. Here’s what is happening: First, we’ve been able to have very productive conversations with senators on all sides of this issue, and if we could vote on amendments I think the digital asset community would be pleased with the outcome.","date":"Mon Aug 09 02:23:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Senate has the opportunity to set the stage for successful implementation of digital assets into our financial system, but we have to get it right here, and we have the perfect opportunity. Let’s get ‘er done.","date":"Sun Aug 08 21:02:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We should ensure that people aren’t trying to avoid taxes by sheltering their money in digital assets, but we can do that without stifling innovation and choosing winners and losers.","date":"Sun Aug 08 20:02:41 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Our position as the global financial leader is a privilege, not a right. Other countries have a head start on us in the development of digital assets. If we get this wrong, we handicap ourselves and put our future prosperity at risk.","date":"Sun Aug 08 19:25:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"No votes tonight. We will continue working toward getting a vote on this vital amendment. \n\nSenate reconvenes tomorrow at noon. Thanks so much for everyone’s hard work toward getting the Wyden-Lummis-Toomey amendment passed.","date":"Sat Aug 07 23:09:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The endorsement we didn’t know we needed.","date":"Sat Aug 07 21:29:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The White House-supported Warner amendment still doesn’t protect software developers. It makes it possible for regulators to choose winners &amp; losers instead of letting the marketplace make that decision. The Wyden-Lummis-Toomey amendment is tech-neutral and promotes innovation.","date":"Sat Aug 07 19:49:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We need to pass the Wyden-Lummis-Toomey Amendment. If we fail now, it will have a real impact, not only on innovators today, but by threatening to cede tomorrow to a host of others on foreign shores.\n\nhttps://t.co/VUtTPr6gmY","date":"Sat Aug 07 15:39:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s difficult to summarize the impact Enzi had on WY &amp; our nation. He worked with those on both sides of the aisle to help the energy &amp; Ag sectors, improve healthcare in rural areas &amp; address the national debt. He leaves behind an impressive legacy in Washington &amp; home in WY. https://t.co/fXhvvHKRDd","date":"Fri Aug 06 16:42:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Do what you say you’re going to do. Our amendment protects miners as well as hardware and software developers. The other does not. The choice is clear.","date":"Fri Aug 06 02:10:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"View my full floor speech here: https://t.co/vPz6PsjbNt","date":"Thu Aug 05 23:54:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Wyden-Lummis-Toomey amendment is simple. It clarifies in law what most of us already believe—that validators of distributed ledger data like miners &amp; stakers, hardware wallet providers &amp; software developers should NOT be required to report transaction data to the IRS. https://t.co/cMtoHMehiU","date":"Thu Aug 05 23:53:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"👏🏻👏🏻👏🏻","date":"Thu Aug 05 23:33:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Hey thanks @cvpayne. It was great talking to you today about this wild world here in the Senate. Can't wait to join you again soon.\n\nIf you missed it, catch up here: https://t.co/vPIb21OBkX","date":"Thu Aug 05 21:54:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Seconded. \n#lummislikehummus","date":"Thu Aug 05 21:17:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Strong statements on the Senate floor just now from @SenToomey and @RonWyden on our crypto amendment. This amendment will help bring digital assets more fully into our financial system.","date":"Thu Aug 05 20:48:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joining @cvpayne now! Tune in! https://t.co/auwMJcQqDX","date":"Thu Aug 05 18:14:54 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Home, home on the range\nWhere the deer and the antelope (and the elk) play\nWhere seldom is heard a discouraging word\nAnd the skies are not cloudy all day!\n\nCan’t wait to be back home in Wyoming to see these guys frolicking in front of my house. https://t.co/AKxEuSgLoG","date":"Thu Aug 05 16:31:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m not quite ready to retire yet, but you know when I am, I’ll make a beeline for the best state in the U.S. While it’s a great place to retire, it’s also a great place to raise a family and start a business. #thatsWY \n\nhttps://t.co/PiwU4TFypI","date":"Thu Aug 05 14:27:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Financial innovation is bipartisan. We need input from Republicans &amp; Democrats to ensure that we effectively integrate digital assets into our tax code without harming the technology. I look forward to continuing this work as we bring our financial industry into the 21st century.","date":"Wed Aug 04 22:29:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyden-led amendment would clarify cryptocurrency reporting rules https://t.co/ZOIUq4tlUk","date":"Wed Aug 04 21:03:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Digital assets are here to stay, and while more work needs to be done, the Wyden-Lummis amendment integrates them into the financial system while leaving room for innovation.\n\nhttps://t.co/OqIxrKFFt7","date":"Wed Aug 04 20:49:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Cryptocurrency industry gains support in narrowing tax proposal \nhttps://t.co/YKrkE6ywZD via @politico","date":"Wed Aug 04 18:19:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’re going to get double billed for President Biden’s economic policies. \n\nNow, with higher prices at the gas pump and the grocery store, and down the road when Congress will want to raise taxes to pay for their reckless spending sprees.","date":"Wed Aug 04 14:29:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More to come but we're proud of the work we've been able to do with @RonWyden to responsibly address digital assets in the BIF. \n\nStay tuned for more on our amendment.","date":"Tue Aug 03 23:05:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Broke: Traveling across the southern border legally for tourism, temporary work &amp; to see family.\n\nWoke: Illegally crossing the border in the midst of a pandemic with new variants coming on the scene.","date":"Tue Aug 03 20:04:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"How many trillions of dollars of debt does the U.S. have to hold before people start to realize the gravity of this situation?\n\nhttps://t.co/rZTo6Maojh","date":"Tue Aug 03 14:29:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Tracy Stone-Manning views people as environmental problems, not partners. Beyond appalling, and highly concerning for western states that use public lands for their livelihood.","date":"Mon Aug 02 21:50:46 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joining @DavidAsmanfox on Fox Business now to talk about the Bipartisan Infrastructure package. \n\n📺 tune in!","date":"Mon Aug 02 20:27:14 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"According to the White House, inflation is just temporary and it also doesn’t exist. So it sounds like we are pretty confident that everything is totally fine and we have nothing to worry about. https://t.co/XbJEUbT6VZ","date":"Mon Aug 02 15:52:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s a beautiful day in Cheyenne and there’s nowhere else I’d rather be than at @chefrontierdays! https://t.co/CoB7fxtfq3","date":"Sat Jul 31 22:57:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Let’s be frank. Behavior like this would have sunk a Republican nominee.\n\nhttps://t.co/JClui6Qcts","date":"Fri Jul 30 14:57:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Nearly $1 trillion of allocated COVID relief money still remains unspent. Instead of further mortgaging the futures of our children and grandchildren, we could reallocate that to improve our infrastructure. \n\nhttps://t.co/ztt9nu5tSD","date":"Fri Jul 30 13:48:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"That’s why I’m supporting the No Vaccine Passports Act, which would keep the federal government from forcing anyone to get a vaccine approved under Emergency Use Authorization, like the COVID vaccines.","date":"Thu Jul 29 21:06:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Much like Obamacare, a federal vaccine mandate would insert government into what should be a personal decision between a patient and their doctor. Any vaccine mandate will further divide our country, instead of uniting us.","date":"Thu Jul 29 21:06:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Nancy Pelosi blows through the Ursula index. An iron grip over her own caucus isn’t enough, so now she’s threatening to arrest staffers who won’t comply with her anti-science mandates. Absolutely absurd. https://t.co/0ump31Zv4V","date":"Thu Jul 29 15:46:14 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If you missed the Facebook Live I did yesterday with @Virginia_Allen5 and @DailySignal, check it out. \n\nHow many trillions of dollars of debt does the U.S. have to hold before people start to realize the gravity of this situation?","date":"Thu Jul 29 14:32:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Shot/Chaser: https://t.co/cKs9LEoVeg","date":"Thu Jul 29 14:02:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"FreedomFest combines two of my favorite things: freedom and festivities. Great to be there, @ComicDaveSmith. Come see us in WY anytime.","date":"Thu Jul 29 13:30:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"First, Obama’s economic advisor, and now the Chairman the Federal Reserve. Doesn’t seem like a coincidence. \n\nInflation won’t go away until we cut the reckless spending.\n\nhttps://t.co/AtOfBhZ6uD","date":"Wed Jul 28 23:45:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"“We can disagree without being disagreeable. There is a lot of vitriol in our politics and our world right now, but you can stay true to what you believe in without treating others badly.”\n\n—Mike Enzi https://t.co/QZh3l2XbMj","date":"Wed Jul 28 20:28:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Americans agree that we need to repair our crumbling roads and bridges. \n\nWhat they don’t want is trillions of dollars that will boost progressive priorities but leave them with less money in their pockets and paychecks.","date":"Wed Jul 28 15:18:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"About to join @Varneyco on Fox Business to chat about digital assets and more. \n\nTune in!","date":"Wed Jul 28 14:30:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Hanging out with the folks at the @DailySignal and @Heritage this morning! Stay tuned for the next installment of “Problematic Women”! https://t.co/JVQHm15r2L","date":"Wed Jul 28 13:43:43 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I paid tribute to my friend Mike Enzi on the floor of the Senate today. \n\nHis retirement left a hole in the Senate, and his passing leaves a hole in our state and in our hearts.\n\nhttps://t.co/xpmBZEuIMW","date":"Tue Jul 27 19:59:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today, Wyoming mourns the loss of a giant.\n\nMike Enzi was a man of God and I take solace knowing that he is at peace. My prayers are with his wife Diana, children Amy, Emily and Brad, and his four grandchildren at this difficult time.\n\nFull statement here: https://t.co/K8yKe5tnBZ","date":"Tue Jul 27 13:27:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Calling all prayer warriors: Wyoming’s great champion, Mike Enzi, needs our prayers right now.","date":"Mon Jul 26 19:21:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Here’s the thing: We don’t need more stimulus. One is occurring naturally as we speak. Americans are flush with cash, and are stimulating the economy without the Fed’s or Congress’ help.\n\nhttps://t.co/trmG6146Er","date":"Mon Jul 26 14:30:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats’ agenda is clear: \n\nThey want to regulate firearms into oblivion. \n\nThat’s unconstitutional, and I will stand up for the law-abiding people of Wyoming and oppose his nomination.\n\nhttps://t.co/iren58w8mo","date":"Mon Jul 26 12:59:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Beautiful day for a @CheFrontierDays parade. And a big #GoPokes!! https://t.co/7QHNz20POw","date":"Sat Jul 24 17:22:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In Wyoming, we honor the spirit of the American cowboy every day. On July 24th, the rest of the country gets a little taste of the values we hold so dear. https://t.co/EEVTvTl42O","date":"Sat Jul 24 14:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today’s the day! The Daddy of ‘em All is back! A little throwback from my days as Miss Frontier to celebrate the 125th anniversary of @CheFrontierDays\n\nCourtesy of the @WyoArchives https://t.co/2ClU1Bm25B","date":"Fri Jul 23 16:35:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This reckless spending plan that the Dems are proposing will likely cost EVEN MORE than the $3.5 trillion price tag they’ve attached to it. @Budgethawks estimate that it could be closer to $5.5 trillion. \n\nhttps://t.co/Y1ZxDZlS3F","date":"Fri Jul 23 13:36:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming families are working hard. They shouldn’t have to foot the bill for this progressive grab bag.","date":"Fri Jul 23 13:36:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Changing my twitter bio to “U.S. Senator/Space Junk Lady\"","date":"Thu Jul 22 15:53:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is plenty of cash in the economy. \n\nHousehold deposits are higher now than they have been at any time since 1952. \n\nPumping more money into the economy will only hurt us in the long run. \n\nWyoming families have struggled enough. https://t.co/1Gb8rMtYj1","date":"Thu Jul 22 13:35:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"https://t.co/heVxsbUJAe","date":"Wed Jul 21 17:44:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Hey @zlj517 – you’re right. Digital currency IS inevitable. We’re just choosing to do it in a way that doesn’t subject people to the whims of a tyrannical dictatorship. That’s not ignorance. That’s freedom. And as I’m sure you’ve heard, here in the U.S., we love “making trouble.”","date":"Wed Jul 21 17:44:55 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@SenJohnBarrasso hit the nail on the head. If the Biden administration is serious about rooting out domestic terrorism, he needs to pull his nomination of Tracy Stone-Manning.\n\nhttps://t.co/ISJYbAHEGU","date":"Wed Jul 21 16:10:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Because of the Democrats’ reckless spending, Wyoming families are paying more at the pump and at the grocery store. Pres. Biden promised no new taxes on middle-class families, but rising prices are due to his policies and are a tax on the middle class.","date":"Wed Jul 21 13:31:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Not true @JakeSherman and @SenSherrodBrown. I’ve been ringing the bell for the 80/20 split for months. The 80/20 split is more important than ever as we continue to adjust to a post COVID world.\n\nhttps://t.co/Pva7we9ffJ","date":"Tue Jul 20 21:04:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @dbongino on the @BonginoReport to talk about #2A and President Biden’s ATF nominee, David Chipman.","date":"Tue Jul 20 17:07:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Real hourly earnings are down 1.7% from a year ago. It doesn’t matter if we have higher wages if inflation causes prices to outpace earnings. Leave President Carter’s economy where it belongs – in the 70’s.\n\nhttps://t.co/RpGb6rbO4Y","date":"Tue Jul 20 15:53:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Welcome back @jeffbezos. Excited for the new frontiers this trip opens up.","date":"Tue Jul 20 13:49:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’re about to hit the debt ceiling. Again. Democrats want to keep kicking the can down the road by increasing the ceiling without addressing our reckless spending. This is grossly irresponsible and, in Wyoming, we’re tired of it.\n\nhttps://t.co/Rw4BwxjYqO","date":"Mon Jul 19 15:46:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats are proposing trillions of dollars in new spending at a time when we are buckling under the weight of our national debt. We need to take this problem seriously and consider ways to address the debt before it’s too late. \n\nhttps://t.co/peK9xRDUx2","date":"Fri Jul 16 15:36:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Our 2nd Amendment rights are integral to the Wyoming way of life. It’s essential that we have leaders who protect those rights. David Chipman is unfit to lead the ATF and I will not support his confirmation. https://t.co/FufUgPb2kq","date":"Thu Jul 15 19:36:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming has over 18 million acres of BLM land. It’s essential we have a BLM Director who understands the nuance of how we interact with the land out west. Ms. Stone-Manning misses the mark. Her ties to eco-terrorists should disqualify her completely. https://t.co/BNiZbN1u8n","date":"Thu Jul 15 14:31:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s unconscionable that the Biden administration would suspend public health orders at the border at a time when the delta variant of COVID-19 is spreading rapidly around the globe. \n\nhttps://t.co/wBD1PtfssT","date":"Thu Jul 15 14:00:54 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden administration, in a nutshell:\n\n➡️ Suspend public health orders to help unvaccinated illegals enter the U.S.\n\n➡️ Enforce public health orders to make vaccinated Americans wear masks on planes.","date":"Wed Jul 14 16:28:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I think we already know the answer.\n\nhttps://t.co/wyhleQ8lKZ","date":"Wed Jul 14 14:11:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I applaud the decision of the Fourth Circuit.\n\nhttps://t.co/OOtf4421YG","date":"Tue Jul 13 20:06:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Second Amendment is a constitutional right. There is no reason a law-abiding 18-year-old adult should be denied that right solely based on their age. If we trust them to defend our country, we should trust them enough to purchase a handgun.","date":"Tue Jul 13 20:06:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Too much spending has real consequences.  We’re seeing it clear as day. Prices are high and are expected to get higher, but instead of addressing the root cause, the Biden administration continues to spend and spend and spend. \n\nhttps://t.co/zWs5hwsbc1","date":"Tue Jul 13 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The latest inflation numbers surprised even the economists. This can be traced to the binge spending by the Biden administration. And they want to spend even more \n\nhttps://t.co/ouElosQZ6N","date":"Tue Jul 13 14:02:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Blessed to call the Cowboy State home. https://t.co/O2qwU2eFe0","date":"Sat Jul 10 13:32:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I introduced legislation to make sure that all law-abiding adults across Wyoming and the U.S. could exercise their Second Amendment rights. I’m proud that Gun Owners of America supports this legislation. \n\nhttps://t.co/Fy6d2mYPig","date":"Sat Jul 10 01:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"WY has been a leader in digital asset legislation. It's time we bring those ideas to Congress. Check out my interview with @ylanmui where we discuss the future of digital assets and the government's role in their development.\n\nhttps://t.co/GnA9LNbSho","date":"Fri Jul 09 18:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More 100 days since VP Harris was named as border czar &amp; since then, we’ve seen:\n\n➡️ Unprecedented rates of unaccompanied minors crossing our border\n➡️ More fentanyl seized at the border in 2021 then all of 2020\n➡️ Over 88,988 migrants released in the US\n\nThis is a crisis.","date":"Thu Jul 08 13:45:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Every state has become a border state. Drugs that are flowing across the southern border will soon be in Wyoming. The Biden administration needs to stop this now.\n\nhttps://t.co/mCneTKmelW","date":"Wed Jul 07 18:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"“But lower-income families and retirees on fixed incomes will especially feel their buying power erode -- not just in the short-term, but for many years to come, further widening the nation's wealth gap.”\n\nhttps://t.co/xZjQJRJPxv","date":"Wed Jul 07 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Law-abiding Americans old enough to fight for our country overseas should be old enough to legally purchase a handgun. \n\nhttps://t.co/JCal7Xjenc","date":"Tue Jul 06 18:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m still not over this tweet from the White House last week. Americans are working hard to keep up with rising prices, and they’re bragging about how we can save 16 cents on a cookout. Completely tone deaf.","date":"Tue Jul 06 13:36:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The SAME Act (Second Amendment Mandates Equality) would recognize the right of ALL law-abiding adults across Wyoming and the U.S. to buy a handgun. @RepThomasMassie introduced companion legislation in the House. \n\nhttps://t.co/JpeaN7cpC5","date":"Mon Jul 05 16:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My favorite place to be any day, but especially on the Fourth of July, is my home state of Wyoming. I’m grateful I got to celebrate American Independence in Cody this weekend. https://t.co/poycz7xokD","date":"Mon Jul 05 12:19:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"After the battle of Yorktown during the Revolutionary War, French officer Marquis de Lafayette said, “Humanity has won its battle, liberty now has a country.” \n\nAs we celebrate our freedom today, remember those who sacrificed for our great nation. Happy Independence Day! https://t.co/Gxq5V2gdB1","date":"Sun Jul 04 13:12:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s a great day to be in Cody! https://t.co/ZUwXUL79TB","date":"Sat Jul 03 17:45:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In Wyoming we know that we can commit to addressing gun violence without a federal gun grab. David Chipman apparently doesn’t agree. \n\nHe’s the wrong choice to lead the ATF.","date":"Fri Jul 02 18:26:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I joined my colleagues in calling on the Biden administration to end mask mandates for vaccinated Americans on planes and public transportation. There’s simply no science backing up this mandate. Wyoming citizens are ready to get back to life as normal.\n\nhttps://t.co/h7lM6CUtld","date":"Fri Jul 02 15:07:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"WY is already feeling the effects of inflation. Gas, groceries, and clothing are more expensive. The Biden admin’s solution is to spend MORE. It’s time to read the writing on the wall and address the out-of-control inflation that’s hurting WY families. \n\nhttps://t.co/XZT61E6Id6","date":"Thu Jul 01 15:59:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Anti-gun lobbying organizations are pushing hard to get the Senate to confirm David Chipman. They know he’ll bring his radical anti-Second Amendment views to the ATF. That’s why we have to push back. \n\nI’m voting ‘NO’ on his nomination.\n\nhttps://t.co/llztjqEvAb","date":"Thu Jul 01 13:35:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Unemployment is falling in states that cancelled enhanced unemployment benefits. This is good for families and businesses across Wyoming. \n\nhttps://t.co/4M5CONmzDb","date":"Wed Jun 30 18:52:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In Wyoming, our Second Amendment rights are essential to our way of life. I will always stand up for those rights.","date":"Wed Jun 30 14:16:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I joined Fox News Wyoming’s Will Silverstein to discuss Wyoming’s digital asset opportunities and the negative impacts of President Biden’s ban on new oil &amp; gas leases on federal lands in Wyoming. https://t.co/NcXxvDsUeN","date":"Tue Jun 29 15:03:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Brendan’s advancing to the semi-finals! \n🇺🇸🇺🇸🇺🇸 https://t.co/7YSJCLLpQq","date":"Fri Jun 25 22:16:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Make sure to tune in to the Olympic Track and Field Trials today at 3pm MT! Wyoming native (and my Director of Business Outreach) Brendan Ames is competing to qualify for Team USA!! Go Brendan!\n🇺🇸🇺🇸🇺🇸\n\nhttps://t.co/Lansfy78k5","date":"Fri Jun 25 18:35:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Many women played an essential role in the journey toward suffrage, but Louisa Swain’s contribution was the shot heard around the world.\n\nhttps://t.co/lafUCUPi6J","date":"Fri Jun 25 16:18:14 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Excellent report from @KansasCityFed. Community banks are essential to Wyoming's rural economy and will play an important role in our country's financial future. @ICBA\n\nhttps://t.co/bRAFjbf4nv","date":"Thu Jun 24 20:05:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @TeamCavuto! \n\n📺 Tune into @FoxBusiness now! https://t.co/vLgQupNiDX","date":"Thu Jun 24 16:03:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A digital asset is like anything else you might own (house, car, or share of stock), but is a computer code-based representation of that asset. Basically, you own a computer code. Many digital assets hold value because of a “blockchain,” which we’ll focus on next.","date":"Wed Jun 23 21:02:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I want to take a deeper dive into some of the buzzwords I've been using as I talk about financial innovation. Today we'll talk about digital assets. (1/2)","date":"Wed Jun 23 21:02:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming has the best sage grouse management strategy in the nation. I urge Secretary Haaland to look at the progress Wyoming has made and leave sage grouse management to the states.\n\nhttps://t.co/HVWHVHa2Hb","date":"Wed Jun 23 15:48:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Law enforcement agents have seized more than 463,000 lbs of drugs so far THIS YEAR at the southern border. (Reminder: It’s only June.) I don’t know about other places, but in Wyoming, we would call this absolute insanity.\n\nhttps://t.co/iwLu4MtdXA","date":"Wed Jun 23 13:25:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrats’ election legislation was nothing more than a messaging bill that was designed to fail. Wyoming doesn’t need the federal government dictating how we run our elections, and political campaigns absolutely don’t need taxpayer funding.","date":"Tue Jun 22 23:23:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Virtual currenices aren’t going away. America has to keep up.\n\nhttps://t.co/U51ah3yoBI","date":"Tue Jun 22 18:23:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Customs and Border Patrol agents are arresting nearly 6,000 illegal immigrants a day. That’s the highest number in two decades.\nhttps://t.co/zHcIvSR8Gu","date":"Tue Jun 22 16:22:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m about to join @Varneyco to talk digital assets, the #Bidenban on energy leasing, and the final frontier. Tune in!","date":"Tue Jun 22 14:27:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Things we should be focusing on instead of the Democrats’ \"For the People\" Act:\n\n➡️ Passing a bipartisan infrastructure package\n➡️ Dealing with the crisis at the southern border\n➡️Addressing the national debt","date":"Tue Jun 22 13:18:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The way we conduct elections in Wyoming works for our rural state. The Democrats’ so-called For the People Act would impose a one-size-fits-all election system across the country. But what works for California isn’t necessarily what works best for us. https://t.co/1x8oQaLLjO","date":"Mon Jun 21 19:53:46 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s time for Congress to let conservative states do what we in Washington seem incapable of doing: saying no to taxpayer dollars and living within our means.\n\nhttps://t.co/ZtXEyGdQeB","date":"Mon Jun 21 13:42:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy Father’s Day! I’m grateful for the years I spent with my father, Doran Lummis, and all the things he taught me. Celebrate your dads well today. https://t.co/RHIUy9eIze","date":"Sun Jun 20 17:35:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s #NationalGoFishingDay! Fly fishing is one of my favorite outdoor activities, and Wyoming is one of the best places in the world to cast out. https://t.co/JxIbBKnf1k","date":"Fri Jun 18 18:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"When I’m home in Wyoming, the number one concern I hear from people is about the crisis on the border. \n\nI get it. \n\nThis is a huge problem with long term consequences. We need action from the Biden Administration now.","date":"Fri Jun 18 12:59:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"You don’t have to be a former state treasurer to understand that when labor is more expensive, products are more expensive. Ask any Wyoming business owner and they’ll tell you the same thing. It’s simple math.\n\nhttps://t.co/VZsXWMTAob","date":"Thu Jun 17 16:55:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@GovernorGordon put his foot down and told federal officials that WY was not open to house illegal immigrants in Customs and Border Patrol custody. I support this 100%. Moving people away from the border doesn’t fix the problem. It just spreads it out.\nhttps://t.co/vue0FGGBLH","date":"Thu Jun 17 13:39:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"“Lummis forcefully made the case that bitcoin not only provides a legitimate alternative store of value and medium of exchange but would act as a check on the devaluation of the U.S. dollar and other currencies through the runaway creation of fiat money.”","date":"Wed Jun 16 21:54:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"After assurances that the EPA would work with us on issues such as WOTUS, I voted to support EPA nominee Radhika Fox in committee. Given the EPA’s recent statements and actions, those assurances seem to be hollow. For that reason, I voted against her today on the floor.","date":"Wed Jun 16 18:31:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks @Varneyco and @hillary__vaughn for recognizing that commercial spaceflight is on the horizon. We need to foster innovation while balancing commercial interests with national defense needs. I can’t wait to work toward the final frontier. https://t.co/sc865VbJAf","date":"Wed Jun 16 17:50:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s still a crisis.\n\nhttps://t.co/w1FL9vKlhl","date":"Wed Jun 16 15:57:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congress should not sit idly by as this lawsuit makes its way through the courts. We should pass the POWER Act to protect the economies of states like Wyoming that rely on energy leases to educate our kids, create jobs, and support our local communities.","date":"Wed Jun 16 00:43:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Judge Terry Doughty sees the Biden ban on oil and gas leases for what it is: an unconstitutional overreach that willfully ignores Article I of the Constitution.\n\nhttps://t.co/k8LrtLoU7w","date":"Wed Jun 16 00:43:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congress created numerous laws requiring mineral and energy leasing, and the president cannot ignore them when he feels like it.","date":"Wed Jun 16 00:43:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A third of Americans aren’t interested in spending their hard-earned dollars on climate change action. Let’s talk about serious solutions instead of wild wish lists.\n\nhttps://t.co/sn8guASDTM","date":"Tue Jun 15 13:37:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@SenRickScott turned down billions for a light rail. The fed gov decided to throw that money at a light rail in CA that is 13 years behind schedule and $44 BILLION over budget. (1/2)","date":"Mon Jun 14 13:35:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"That’s why we introduced the Pay Down the Debt Act – to allow states to make fiscally responsible decisions and not be thwarted by other spendthrift states.\n\nhttps://t.co/x6INnDW1V3","date":"Mon Jun 14 13:35:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today we celebrate all the women who have served and sacrificed on behalf of our great nation. Thank you for your service. We’ll never be able to fully express our gratitude. https://t.co/A65UyduLIs","date":"Sat Jun 12 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"As you’re enjoying your summer activities this weekend, please be aware of the increased risk of fire across Wyoming. Make sure fires are properly extinguished!\n\nhttps://t.co/aw4UMBl7di","date":"Fri Jun 11 16:41:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Taxpayers are footing the bill to subsidize wealthy car buyers. Eight out of 10 electric vehicle credits go to households earning at least $100,000.\n\nhttps://t.co/VRXhY1jFf3","date":"Fri Jun 11 14:09:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Excited to address the young women at @TPUSA today! #YWLS2021 https://t.co/VIbL32GhoX","date":"Fri Jun 11 13:29:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The US has become a global leader in energy production while cutting our carbon emissions. \n\nPresident Biden is eroding this success by attacking American energy independence.","date":"Thu Jun 10 19:01:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Perfect example of the government picking winners and losers. Except this time, it picked poorly and the American people will lose.","date":"Thu Jun 10 13:46:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Republicans are willing and eager to work with Democrats on a cohesive, responsible and reliable infrastructure package that doesn't continue to add to our national debt. #stopthespending","date":"Wed Jun 09 17:51:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks @Jimmyfailla. I’m happy to meet you in Sheridan anytime! Just leave the white cowboy boots at home.\n\nhttps://t.co/m4Qs7EInwT","date":"Wed Jun 09 14:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It's alarming that the president would even consider the idea of having the U.S. rely on other countries for electric vehicle manufacturing. We must do everything we can to keep American jobs from going overseas.\n\nhttps://t.co/EDOqGwKQBJ","date":"Wed Jun 09 13:33:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It was such a pleasure to meet @AliceMarieFree at @TheBitcoinConf last weekend. I look forward to talking to her more about criminal justice reform next time we meet. https://t.co/ePoTi6UV5y","date":"Tue Jun 08 18:49:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I feel like a broken record... we've got to get our spending under control. \n\nThe #BidenBudgetBoondoggle is the opposite. https://t.co/ER0vq9VWSk","date":"Tue Jun 08 13:54:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There’s a reason that crypto is used less for criminal activity than fiat currency.\nhttps://t.co/0w3LHSTlOL","date":"Mon Jun 07 20:31:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Campsites and parking at our state and national parks are going to be hard to find this summer. Make sure to plan ahead as you enjoy Wyoming’s natural wonders!\n\nhttps://t.co/QON4g3dtPa","date":"Mon Jun 07 19:34:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Urban areas have different regulatory needs than rural areas. A one-size-fits-all approach to regulation rarely leaves everyone satisfied.\n\nhttps://t.co/Pva7weqQEj","date":"Mon Jun 07 15:13:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My prayers are with those fighting and those impacted by the Seeley Fire in northeastern Wyoming. The Wyoming @RedCross is available to assist you if you are forced to evacuate. Go to https://t.co/7lFMEuhslf for more information. https://t.co/BmSblMeJBf","date":"Sun Jun 06 21:07:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"On this day 77 years ago, thousands of young American soldiers stormed the beaches of Normandy to liberate Europe. We are forever grateful for their sacrifice and those of our allies. https://t.co/yJipBWy4Ot","date":"Sun Jun 06 17:20:43 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"@CaitlinLong_ @PeterMcCormack 😉","date":"Fri Jun 04 20:42:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m speaking at the #Bitcoin2021 conference at 3:35 ET. \n\nWatch here: https://t.co/oi8TPVVJ94","date":"Fri Jun 04 19:21:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@budgethawks: “The national debt is on an unsustainable path and headed to uncharted territory. Policymakers should work together to correct course.”","date":"Fri Jun 04 16:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@SenRickScott and I authored the Pay Down the Debt Act to reward this kind of good behavior by using unnecessary grant money to pay down our federal deficit. If we don’t stop the reckless spending, our grandchildren will have to foot the bill.","date":"Fri Jun 04 15:44:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More evidence that @GovernorGordon was right to cancel extra unemployment $$ from President Biden.\n\nhttps://t.co/jHG1Ba8suI","date":"Fri Jun 04 15:44:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Biden Budget - $6 Trillion - will take the U.S. to the highest sustained levels of federal spending since World War II. Our national debt sits at over $28 trillion. This budget is flat-out irresponsible.\n\nhttps://t.co/3WBXnrjXPy","date":"Fri Jun 04 13:06:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today one of our finest, Forest Service smokejumper Tim Hart of Cody, paid the ultimate price to keep us safe. We mourn this loss and are praying for his family today. https://t.co/oLp50PiH7O","date":"Fri Jun 04 00:55:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We need to bring our financial system into the 21st Century. That’s why we need the @FinancialCaucus. This caucus will educate senators of both parties about digital assets, blockchain, faster payments, and how the United States can surpass countries like China.","date":"Thu Jun 03 16:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"F.E. Warren is one of only three strategic missile bases in the U.S. https://t.co/tHL8VQRggf","date":"Thu Jun 03 13:06:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to supporting this project and continuing to support Wyoming’s place as the number one net energy exporter in the nation.","date":"Wed Jun 02 20:18:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming powers America, and I’m proud of the work that Governor Gordon and Senator Barrasso have done to advance nuclear energy production here. It’s great to see TerraPower and PacifiCorp recognize what we in Wyoming have always known: there’s no better place to do business.","date":"Wed Jun 02 20:18:46 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wow, this guy is pretty far from home. Maybe because it was too crowded where he lived?\n\nhttps://t.co/hrX2Q3p8hM","date":"Wed Jun 02 17:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Inflation is a real concern. President Biden’s budget plan will only make it worse.","date":"Wed Jun 02 13:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"F.E. Warren is home to the 90th Missle Wing. Warren was the nation's first operational ICBM base. \n\nhttps://t.co/p9Kq2t7FST.","date":"Wed Jun 02 07:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I'm ready to cheer on my Wyoming Cowboys this year! #GoPokes \n\nhttps://t.co/VfqSD4IC9Q","date":"Tue Jun 01 20:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I want Wyoming to be the next financial success story. But this is about more than just our state. That's why I launched the @FinancialCaucus \n\nhttps://t.co/QZwm7e1Jsy","date":"Tue Jun 01 18:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Cheyenne is home to F.E. Warren Air Force Base. \n\nFun fact: It is the Air Force’s oldest continuously active military installation! https://t.co/AvZEKLIWri","date":"Tue Jun 01 13:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I had the privilege of speaking at the American Legion and VFW’s Memorial Day events today in Worland and Ten Sleep. \n\nIt was an honor to take the time to recognize and remember those who have given their lives for our country. https://t.co/EhVLy4AXoY","date":"Tue Jun 01 00:27:29 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"May we never forget the sacrifice of our bravest men and women in the name of our great nation. #MemorialDay https://t.co/V6yZc8RL8M","date":"Mon May 31 14:26:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"People in Wyoming and across the country have grave concerns about reckless federal spending and our soaring national debt. Wyoming folks live within our means, and we expect the same of our government. (1/2)","date":"Fri May 28 20:08:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden’s budget takes federal spending to historic levels, and will only make rising inflation worse. Congress needs to wake up. We cannot continue to mortgage our children’s and our country’s future. (2/2)","date":"Fri May 28 20:08:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"According to a study done by the @budgethawks and IPSOS, 80% of Americans think the government wastes a LOT of money. They're not wrong.\n\nhttps://t.co/2HmjRW0ZZK","date":"Fri May 28 16:08:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I was honored to call him friend. My heart is with Lynn and his entire family.","date":"Thu May 27 21:17:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"With his heartwarming grin, infectious enthusiasm, and fun-loving spirit, Foster lit up every room he walked into. Communities across the Cowboy State were made better by his generosity and advocacy for better education, healthcare and government transparency.","date":"Thu May 27 21:17:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"First and foremost, Foster Friess was a servant of God. A generous philanthropist, devout Christian and unwavering patriot, he was dedicated to improving the lives of people around the globe.","date":"Thu May 27 21:17:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Just another signal that infrastrucutre can and should be bipartisan. We can address the transportation and infrastructure needs of all communities.\n\nhttps://t.co/Dqi2ugRmhs","date":"Thu May 27 18:23:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joining @TeamCavuto on Coast to Coast @FoxBusiness shortly to talk @FinancialCaucus. \n\n📺 Tune in!","date":"Thu May 27 16:40:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A Gallup poll found that 78% of Americans had personal worry about the nat’l debt and fed. deficit. Biden’s budget has the highest debt/GDP ratio in American history. Congress needs to wake up. We can’t continue spending future generations into oblivion. https://t.co/G7Ho7LUQnL","date":"Thu May 27 14:25:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m heading to the Senate Floor to discuss the @FinancialCaucus and the need for financial innovation. \n\n📺: https://t.co/qhiUvkS4Pe","date":"Wed May 26 20:10:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"While Wyoming will be ground-zero for dealing with the devastating impact of the #BidenBan on oil and gas leasing on federal lands, the impacts will be felt across the country.\n\nhttps://t.co/BmdsnnqqAl","date":"Wed May 26 19:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Cowboy State is the most crypto friendly state in the country. I am looking forward to educating my Senate colleagues on why I am so passionate about digial assets through the @FinancialCaucus.\n\nhttps://t.co/CqNSbvrc4S","date":"Wed May 26 17:48:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Devil's in the details...\n\nhttps://t.co/eN8kMEp9aW","date":"Wed May 26 14:22:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is leading the way on carbon capture tech innovation, but we need to prioritize its use. To keep making progress, I signed a letter w/ my colleagues asking the Biden Admin about their efforts to support carbon capture projects and infrastructure.\n\nhttps://t.co/b5LdcL27HL","date":"Mon May 24 21:51:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"States spend money they don't need to spend, but if they don't spend it, someone else will. That's why @SenRickScott and I introduced the Pay Down the Debt Act.\n\nhttps://t.co/jnhFfM6u6W","date":"Mon May 24 16:56:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"When Congress wastes money, let red states use it to pay down the national debt \n\nhttps://t.co/rPCDk2rv8v","date":"Mon May 24 13:35:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to working with my colleagues to improve this bill on Wednesday and hope we can come to an agreement that addresses the real needs of our communities while recognizing the reality of our national debt. (2/2)","date":"Sun May 23 20:35:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More evidence that an infrastructure bill can and should be bipartisan. Today’s announcement is a step in the right direction on which we can build an infrastructure package that addresses our aging bridges and highways, without breaking the bank. (1/2)","date":"Sun May 23 20:35:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy National Endangered Species Day! Guess who we're not celebrating today! The Greater Yellowstone Grizzly! Let's delist them.\n\nhttps://t.co/DfVF7CemmS","date":"Fri May 21 19:50:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Big things are coming next week. Follow @FinancialCaucus and stay in the loop. https://t.co/xfcWWMWdTl","date":"Fri May 21 16:09:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"As a former governor and a former state treasurer, @SenRickScott and I know what it takes to balance a budget. \n⬇️⬇️⬇️\n\nhttps://t.co/WRZwZ0ye2M","date":"Fri May 21 13:09:14 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The devil’s in the details on a Central Bank Digital Currency. A CBDC has the potential to promote financial inclusion, more efficient payments, and unlock trapped capital. I look forward to sponsoring legislation in the coming months to do just that.","date":"Thu May 20 18:58:50 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"👀 Digital Yuan, buckle up: America is coming for you.\n\nhttps://t.co/li3SRSoE3e","date":"Thu May 20 18:57:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The “For the People” Act (S.1) would allow the IRS to investigate orgs based on their political persuasions. Because that went REALLY well the last time… \n\n#throwbackThursday\n\nhttps://t.co/OGoQYl7h48","date":"Thu May 20 16:31:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"With the national debt topping $28 trillion, we are on an unsustainable financial trajectory, and states are powerless to do anything about it. @SenRickScott and I want to fix that. \n\nhttps://t.co/jnhFfM6u6W","date":"Thu May 20 15:10:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"China is already rolling out a digital Yuan in select cities, and they want to use it ultimately to undermine the position of the US dollar in the financial world. This is a national security issue, and if the US does not respond, we will be left behind.\n\nhttps://t.co/vFYwtMhrOo","date":"Wed May 19 14:59:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Prices are rising. Inflation is real. We can't keep printing money with reckless abandon. \n\nhttps://t.co/YB4XvknJli","date":"Wed May 19 12:45:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden on pipelines: https://t.co/ooymO7MK00","date":"Tue May 18 22:26:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Proud of my friend @SenatorTimScott. His police reform bill will make real change WITHOUT defunding the police. \n\nhttps://t.co/V607ilPN3N","date":"Tue May 18 20:49:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If $1.5 trillion is \"skinny\", I'm not sure I want to see what he has in store for the full budget... We can't keep spending like this.\n\nhttps://t.co/IQupmKkJlk","date":"Tue May 18 17:00:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congratulations to @usedgov Presidential Scholars from Wyoming!\n\nJessica Petri - Green River High School\nSiler Weaver - Evanston High School\n\nhttps://t.co/jDG1vxjDMw","date":"Tue May 18 14:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"America's transportation needs have changed, but we're still funding things like it's 1997. That's why @SenMarkKelly and I intro'd the Highway Cost Allocation Act. We need to study the way we use highways before we add another penny to the trust fund.\n\nhttps://t.co/CfcnwMqi49","date":"Tue May 18 13:56:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"First-rate roads, first-rate waterways, first-rate bridges, first-rate airports. Let’s get it done.","date":"Mon May 17 17:08:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming has the critical minerals we need for the technology we use every single day. And we will extract it with a commitment to human rights and safe working conditions. Time to get China out of the picture.\n\nhttps://t.co/Sp3f859GPc","date":"Mon May 17 14:40:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thank you today and everyday. #ArmedForcesDay https://t.co/l0jKqO2ekV","date":"Sat May 15 14:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"ICYMI ➡️➡️➡️ \nhttps://t.co/R1QNcgLO80","date":"Fri May 14 21:30:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The world is changing. Our transportation systems must be updated in order to adapt to those changes. However, these updates must support all swaths of America, and must be bipartisan.\n\nhttps://t.co/Pva7weqQEj","date":"Fri May 14 14:32:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy #NationalHummusDay!\n\nRemember - Lummis sounds like hummus! https://t.co/5cwZOpHcUu","date":"Thu May 13 20:47:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thrilled to see that President Biden is meeting with top Republicans to discuss infrastructure. There’s no reason Democrats &amp; Republicans can’t come together to deliver a bipartisan infrastructure package that meets the needs of Americans in big cities and small towns.","date":"Thu May 13 18:37:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joining Coast to Coast at 10AM MT/12PM ET. Tune in! 📺\n\n⬇️⬇️⬇️","date":"Thu May 13 15:50:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The U.S. is not the global pollution problem, and President Biden should stop treating us like we are.\n\nhttps://t.co/CWIg6kMEyC","date":"Thu May 13 14:44:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Since 2000, the US had the largest decline in emissions of any country, while also becoming the world’s top energy producer. Meanwhile, China’s greenhouse gas emissions are now larger than those of all developed countries combined.","date":"Thu May 13 14:44:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"👏🏻👏🏻👏🏻\nJelena McWilliams, Chairman of @FDICgov https://t.co/5BzhqHibpR","date":"Wed May 12 20:44:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It's still a crisis, and it's getting worse. Madam Vice President, it's time to visit the border.\n\nhttps://t.co/TszAwxChmc","date":"Wed May 12 16:18:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If the US is going to make a big investment in scholarships &amp; grants to help us compete w/ China, then we should be making sure that those scholarships &amp; grants go to educate people who are invested in the success of the US for the long-term: our citizens and permanent residents","date":"Wed May 12 15:07:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Within an overhaul, we must remember the needs of every American — and this includes the many small towns and rural communities in states like Wyoming.\n\nhttps://t.co/Pva7weqQEj","date":"Wed May 12 13:39:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Year in and year out, the @WyomingSOS delivers a reliable election process with plenty of flexibility for even the most remote corners of WY. The Dems’ proposed election reform bill would hamstring their efforts and undermine the integrity of that system.\n#CorruptPoliticiansAct\"","date":"Tue May 11 20:47:15 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The so-called “For the People Act,” the democrats’ proposed election reform bill, weaponizes the IRS and allows them to consider political leanings when deciding an entity’s tax status.\n\n#CorruptPoliticiansAct","date":"Tue May 11 18:08:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Remember that time that the IRS unfairly targeted conservative groups? Apparently, we didn’t learn our lesson...","date":"Tue May 11 18:08:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If we allow the Democrats election bill to pass, it'll fundamentally change elections over time and it'll cause chaos in 2022. \n\n#CorruptPoliticiansAct https://t.co/XDCZjweMHu","date":"Tue May 11 13:22:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The #BidenBan continues to impact Wyoming families. Kudos to @GovernorGordon for standing up to this overreach of power. \n\nhttps://t.co/gOi7Za5JP5","date":"Mon May 10 20:26:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Right now, we rely on China for 80% of imported rare earth minerals, yet northeastern Wyoming is home to one of the largest, richest reserves of rare earth minerals! This has to change. Excited to see what @UWyonews does with DOE funding in this space.\nhttps://t.co/h9QXyuXZJr","date":"Mon May 10 16:28:57 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"ICYMI: Casper company Highwire Energy Partners utilizes generator technology to pull stranded oil for mining cryptocurrency. \n\nhttps://t.co/HSB0YMgG2q","date":"Mon May 10 13:50:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Being a mother and grandmother is one of the greatest privileges of my life. Happy Mother's Day! https://t.co/ylGijbdJ9J","date":"Sun May 09 14:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The job numbers are low because, in part, women still aren't back to work. Women bore the burden of childcare during the pandemic. Until we open up all schools full time, we aren't going to see our economy bounce back.","date":"Fri May 07 20:06:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Encouraging news coming from Mr. Gensler. Bad regulation kills innovation. I have some ideas on how to do it well.  &gt;&gt;","date":"Fri May 07 18:59:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"“Mr. Gensler said he wants to work with Congress to come up with a strategy for regulating the exchanges on which cryptocurrencies are bought and sold.”\n \nhttps://t.co/gi32qHVYow","date":"Fri May 07 18:59:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I toured the Ryan Ranch project outside of Saratoga this week. Water is a precious resource in Wyoming and it was great to see the creative ways they’re working to ensure it’s used efficiently and responsibly. https://t.co/23NyiKRacb","date":"Fri May 07 17:44:33 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The U.S. national debt, in $1 bills, would weigh about 30,864,708 tons. That’s the same weight as 2,805,882 Americans, or a little more than the population of Chicago. https://t.co/AZm1wGhCzk","date":"Fri May 07 14:59:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Businesses have been through a lot this year, but they kept showing up and taking care of their neighbors. They're #WyomingTough and I'm glad I got to honor them at the @CasperChamber Excellence in Business Awards last night. https://t.co/m65zQVcWVl","date":"Thu May 06 20:16:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 2019, the EPW committee, under the leadership of @SenJohnBarrasso, advanced the most substantial highway legislation in history. \n\nUnanimously. \n\nLet’s do it again.\n\nhttps://t.co/e7omScqhED","date":"Thu May 06 19:28:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today we thank the nurses across the state of Wyoming for their bravery and tireless work serving on the front lines during the pandemic. https://t.co/0SUn61nxcL","date":"Thu May 06 13:15:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Read my full statement on the Federal Reserve’s thoughtful guidelines here. &gt;&gt; \n\nhttps://t.co/4lY06FPJ8Q","date":"Wed May 05 20:08:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"NEW! @federalreserve has proposed thoughtful guidelines that promote responsible banking innovation and validate Wyoming’s hard work in digital assets and banking.\n\nhttps://t.co/KYGJYZHsWc","date":"Wed May 05 20:08:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This means the Fed: \n1) takes responsible innovation seriously, and \n\n2) is giving Wyoming a chance to prove we’re doing it right.","date":"Wed May 05 20:08:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming has developed the United States’ best regulatory framework for digital assets and others are beginning to recognize this fact too.","date":"Wed May 05 20:08:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"President Biden promised to be the Unity President, but the only unity speech I heard last week was @SenatorTimScott's rebuttal. That's unity. That's leadership.","date":"Wed May 05 16:29:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"\"We can’t even dig out of the hole we’ve already dug for ourselves…\"\n\nI caught up with @TomCoulter_ of the @WTEnews last week to discuss President Biden’s proposed infrastructure bill. Read the full interview here &gt;&gt;\n\nhttps://t.co/nBahUcbUcr","date":"Wed May 05 13:33:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today we recognize and thank the teachers across Wyoming who have gone above &amp; beyond this past year to put students first! https://t.co/22XqSEw3dY","date":"Tue May 04 21:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"You’re our only hope.  #MayThe4thBeWithYou https://t.co/EReXTlU1Uw","date":"Tue May 04 16:40:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Drinking Water and Wastewater Infrastructure Act is:\n\n✅ Bipartisan\n✅ Strategic\n✅ Fiscally Responsible\n\nHouse of Reps... you're up. Let's make this law. \n\nhttps://t.co/wwQ53leh8A","date":"Tue May 04 13:33:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The @SenateGOP infrastructure plan puts decision-making where it belongs – with individual states. States will have the flexibility to fund infrastructure based on needs instead of mandates from a distant bureaucrat.","date":"Mon May 03 20:56:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"On this day in 1883, William F. Cody, more commonly known as Buffalo Bill Cody, put on his first Wild West Show. https://t.co/wvWllMZEgv","date":"Sat May 01 16:48:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"$28 trillion = $3,650 for every human on the planet. No joke. https://t.co/VAmfkMFW9k","date":"Fri Apr 30 17:06:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This bipartisan solution gives states the flexibility they need to improve their infrastructure, and establishes programs geared toward small and rural public water systems like those across my home state of Wyoming.","date":"Fri Apr 30 15:08:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Honestly, I am hard pressed to remember a time when infrastructure was NOT bipartisan. In 2018, 2016, 2015 and 2014 Congress passed bipartisan infrastructure legislation. This year should be no different.","date":"Fri Apr 30 13:15:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Today, Wyoming celebrated Hank Coe Day. Hank was a giant in the Wyoming State Legislature as well as a mentor and a dear friend of mine. He is missed dearly. https://t.co/p4mANfG4SG","date":"Thu Apr 29 22:25:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Just how much is a trillion dollars?\n \nPS – President Biden’s proposed infrastructure package is nearly $2 trillion. https://t.co/dOfTnu7tJ9","date":"Thu Apr 29 17:21:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More government = less freedom. https://t.co/H4QLC0U7SO","date":"Thu Apr 29 14:29:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Right now, we have a Highway Trust Fund that we can’t actually trust. https://t.co/Qo6FX8EI7H","date":"Thu Apr 29 13:15:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@senatortimscott hit it out of the park. His story is the very definition of the American dream and his vision will propel our country forward.","date":"Thu Apr 29 02:56:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"My statement on President Biden’s address &gt;&gt;&gt; https://t.co/Dqo6pgSRom","date":"Thu Apr 29 02:26:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’re on the same page there. Let’s bring our troops home. \n\n#JointAddress","date":"Thu Apr 29 01:54:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This math isn’t working. President Biden said his American Families plan would reduce the deficit. But that’s just not the case. This plan, as is, will add $300 billion to the deficit. And its impact on our economy is uncertain at best. \n\n#JointAddress","date":"Thu Apr 29 01:42:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming energy workers already have good paying jobs.\n\nThey aren’t looking for new ones. \n\nBiden’s plan forces their hand. #JointAddress","date":"Thu Apr 29 01:33:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Since President Biden’s inauguration, we have been spending ourselves into oblivion. Now Biden is suggesting we spend MORE to placate the progressive wing of his party--at the expense of future generations. This spending spree is bad for WY families, businesses and communities.","date":"Thu Apr 29 01:25:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"A true pioneer.","date":"Wed Apr 28 23:59:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks for hosting this panel! And @SenatorHick, I’m looking forward to that dinner invitation!","date":"Wed Apr 28 19:55:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The real definition of infrastructure. https://t.co/IfxrOFWVx6","date":"Wed Apr 28 18:59:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"April is Sexual Assault Awareness month &amp; an opportunity to highlight the impact it has on women and families. I applaud @SenJoniErnst, @RepNancyMace &amp; @RepDLesko for their bravery in sharing their stories. If you need help, call the Sexual Assault Hotline at 1-800-656-4673.","date":"Wed Apr 28 15:22:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Biden’s Definition of Infrastructure https://t.co/j8hoNWXB7o","date":"Wed Apr 28 14:24:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining @CoinDesk to talk financial innovation and Gary Gensler’s confirmation. Tune in now!","date":"Wed Apr 28 13:16:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Energy leasing FUNDS conservation. Wyoming powers the nation and also works hard to conserve the wildlife that call Wyoming home. President Biden is defunding conservation with the #BidenBan. https://t.co/mE5BYxubz3","date":"Tue Apr 27 22:27:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming and western states suffer big under the #BidenBan. That’s why we need to pass the POWER Act. Thanks for coming and illustrating this point @GovernorGordon. https://t.co/D8mbQWYiXN","date":"Tue Apr 27 21:02:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The WHO must stop siding with the CCP and instead stand for those in need. #LetTaiwanHelp https://t.co/A1fV8PNydX","date":"Tue Apr 27 15:53:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Joe Manchin knows what it means to work across the aisle. Maybe the unity president can take a lesson? Infrastructure has always been bipartisan. Let's get to work.\n\nhttps://t.co/sWUW229rJr","date":"Tue Apr 27 14:50:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Welcome to the best state for all things business and digital assets! https://t.co/iLxuqq8Hqk","date":"Mon Apr 26 17:42:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Bipartisan. Strategic. Fiscally Responsible.","date":"Mon Apr 26 14:56:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Last weekend, I got to join in honoring the first female Eagle Scout in Wyoming. Congratulations Taylor! This is an amazing accomplishment. https://t.co/jYnZs3lYTk","date":"Sun Apr 25 01:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@YellowstoneNPS is the crown jewel of the national park system. It’s home to geothermal features that can’t be found anywhere else in the world. Residents including bison, bears, wolves &amp; moose may pose for pictures, but keep your distance, they’re still wild! #NationalParksWeek https://t.co/H4r10IwIRI","date":"Fri Apr 23 19:02:53 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"25% of eligible residents of Wyoming are fully vaccinated! Everyone over 16 years of age are eligible for the vaccine. \n\nFor more information or to find out where you can get yours, go to https://t.co/U993xSl9Eb.","date":"Fri Apr 23 15:09:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy #EarthDay!! https://t.co/Y4WsH42fFM","date":"Thu Apr 22 21:19:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"ICYMI: I spoke on the Senate floor about the need for a bipartisan infrastructure package. \n\nFull Video ➡️ https://t.co/oOa4vNeEJU https://t.co/8ZwnBqXGR3","date":"Thu Apr 22 20:19:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Admin is piling the hurt on energy folks in WY that are getting hit by #BidenBan.","date":"Thu Apr 22 18:05:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s hard to beat @GrandTetonNPS. Whether you’re ready to camp, fish, or hike, you’ll feel right at home in the Tetons. Make sure you bring your camera. You might just get lucky and get a peek at Grizzly 399 and her cubs! \n#NationalParksWeek \nhttps://t.co/Tzw521GSzb","date":"Thu Apr 22 17:31:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"For years, Democrats have railed against court packing. President Biden himself once called it a “bonehead idea.” What’s changed?","date":"Thu Apr 22 14:58:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@stevedaines, \nSure thing. I’ll meet you tomorrow. Thinking of wearing this.\n\nCL https://t.co/lb14vUdzhM","date":"Wed Apr 21 22:38:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Not our fault that Hollywood is bad at geography.","date":"Wed Apr 21 21:50:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Hey @RepRosendale - fixed this for you. 🙃 https://t.co/lnPqReEqAZ","date":"Wed Apr 21 21:07:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Want to experience a blast from the past? Visit Ft. Laramie National Historic Site in southeastern WY. You can see where soldiers barracked and put yourself in the shoes of those who settled there during America’s westward expansion. \n#NationalParksWeek \nhttps://t.co/q2O6cQVe5Q","date":"Wed Apr 21 18:56:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"SOON - I’ll speak on the Senate floor re: the need for a bipartisan infrastructure package. \n\nWATCH HERE -  https://t.co/7wd4ur89Ie","date":"Wed Apr 21 17:55:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 2018, Wyoming was the top state for per capita vehicle miles travelled (14,003 miles per person). Our highways are critical to our everyday life and must be safe and well maintained. https://t.co/OznXNKaH2P","date":"Wed Apr 21 16:42:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Because WY is such a rural state, it’s critical that we focus on the infrastructure that connects us. Development of our broadband connectivity and our highway systems are essential to the long-term well-being of Wyoming communities &amp; businesses.","date":"Wed Apr 21 14:06:48 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Not sure who the Green New Deal is good for, but I can say for certain it’s not the people of Wyoming.","date":"Tue Apr 20 20:10:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"As you drive down the highway in northeastern Wyoming, Devils Tower National Monument rises dramatically on the horizon. The first national monument in the U.S., this monolith is a sacred Native American landmark as well as a popular site for hiking and climbing. https://t.co/2r7p1N6HYs","date":"Tue Apr 20 17:00:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s still a crisis. \n\nhttps://t.co/HI07ea8fw2","date":"Tue Apr 20 13:30:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Second verse, same as the first. I was opposed to earmarks in the House of Representatives and I’m opposed to them in the Senate. \n\nhttps://t.co/yJfm6suAjI”","date":"Mon Apr 19 20:27:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Cowboy State is proudly pioneering and innovating the way to a greener tomorrow. So proud of the great work being done at @WyomingITC toward a brighter #CarbonFuture. Congratulations to CarbonBuilt!\n\nhttps://t.co/GxENsdmClz","date":"Mon Apr 19 19:15:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s #NationalParksWeek! Wyoming is home to the first National Park, @YellowstoneNPS, and the first National Monument, Devils Tower! Do you have a favorite picture of your trip to one of Wyoming’s national parks? Drop it in the comments!","date":"Mon Apr 19 16:41:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There's broad consensus that we need infrastructure improvements. We can create a plan that helps rural communities like Hanna, WY as well as large metropolitan areas. We can create a bipartisan plan that does just that. https://t.co/Pva7we9ffJ","date":"Mon Apr 19 14:25:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks for having me @haggertynDC!","date":"Fri Apr 16 18:32:42 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Finish the wall. Fix the system. End the crisis.","date":"Fri Apr 16 17:32:20 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Changing the definition doesn’t change the need. Our surface transportation infrastructure is failing and we need to make improvements.\n\nhttps://t.co/XK06zuj1Re","date":"Fri Apr 16 13:24:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Presented without comment. \n\nhttps://t.co/p9BB4GGbMQ","date":"Thu Apr 15 20:57:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is an appetite for a bipartisan transportation and infrastructure bill. We’ve done it already. That should be the framework. https://t.co/4AM6XmlTMZ","date":"Thu Apr 15 18:37:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Congress has spent nearly $6 trillion in the last year. Much of it was necessary to weather the pandemic, but I know that people in WY are concerned that we have no plan to pay it back. We are on an unsustainable trajectory. It’s time to make some changes.","date":"Thu Apr 15 14:08:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to discussing with him how Wyoming can serve as America’s blueprint for responsible innovation. https://t.co/OLtVF1epic","date":"Wed Apr 14 18:07:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If we want to keep pace with China, then we must provide legal clarity to the digital asset industry. While the SEC has a reputation as a black hole for innovators, Gary Gensler recognizes the potential of digital assets. (1/2)","date":"Wed Apr 14 18:07:23 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I look forward to working with the current Administration to continue our intelligence gathering efforts and preventing terrorists from using Afghanistan as a home base. (2/2)","date":"Wed Apr 14 14:14:45 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"After 20 long years our troops will finally be leaving Afghanistan. I wish the Biden Administration had kept to President Trump’s May 1 deadline, but I am pleased our troops are coming home. (1/2)","date":"Wed Apr 14 14:14:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining MarketWatch today at 1pm ET to chat about the regulatory issues of investing in digital assets. Tune in here: https://t.co/BZD2V9Hb9E\n \n#MWLive https://t.co/r5jNJcNOcd","date":"Wed Apr 14 13:27:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"From Class I to Short Lines, #rail infrastructure plays a critical role in Wyoming’s economy. Happy #railday2021 @GoRail","date":"Tue Apr 13 22:19:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I was privileged to honor Capitol Police Officer William Evans today as he was lying in state in the Capitol Rotunda. He died protecting our Capitol and our representatives. Even more than that, he gave his life defending the ideals of our Republic. Praying for his family today.","date":"Tue Apr 13 20:30:49 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The EPW committee passed the bipartisan Drinking and Waste Water Infrastructure Act. If we can address our nation’s water needs on a bipartisan basis, we can address our nation’s transportation needs the same way. @EPWGOP @EPWCmte\nhttps://t.co/DaSINaE4y7","date":"Tue Apr 13 13:16:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The crisis at the border isn’t only affecting border states. Wyoming and our businesses depend on a lawful immigration system. A porous border is a threat to every family and community in our state. It’s time to address the crisis.","date":"Mon Apr 12 15:17:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Disclaimer: this video was made and distributed by Chinese state-run media.","date":"Fri Apr 09 16:18:18 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"See the full video here: https://t.co/YAurYomcPf","date":"Fri Apr 09 16:16:19 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The US is losing our generation’s space race. China’s central bank digital currency is officially HERE. Time for action now. #innovation https://t.co/r3b9SLiwDw","date":"Fri Apr 09 16:12:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"\"Overwhelmed and underprepared, U.S. authorities are releasing migrant families on the Mexican border without notices to appear in immigration court or sometimes without any paperwork at all…” https://t.co/Gay3KCV03I","date":"Fri Apr 09 14:24:46 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The problem is still not the 2nd Amendment, and President Biden’s actions won’t stop evil people, just make it harder for law-abiding people in Wyoming to exercise their rights.","date":"Thu Apr 08 19:52:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Smugglers are using the crisis at the border to exploit women and children. President Biden’s open-arms policy is hurting those it claims to help. https://t.co/Jq9qgB5gfo","date":"Thu Apr 08 14:28:43 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"An infrastructure package should be bipartisan, flexible, and paid for, not a vehicle for Green New Deal priorities and progressive giveaways.","date":"Wed Apr 07 16:51:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There is still a crisis at the border and President Biden still won’t call a spade a spade. We can’t address the problem until we admit there IS a problem. https://t.co/7RpnIOHQeo","date":"Wed Apr 07 14:03:43 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"He is Risen!","date":"Sun Apr 04 20:11:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Our Capitol Police officers put their lives on the line every day to keep us safe. We mourn with the family of the fallen officer today, and pray for them.","date":"Fri Apr 02 20:55:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Proud to have Brendan on team Lummis and I’m excited to cheer him on through this journey! \n\nhttps://t.co/NRQszYzR0E","date":"Thu Apr 01 19:32:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The “For The People” Act, H.R. 1/S.1, would strip the ability of states like Wyoming to decide their own election laws. We don’t need California voting practices like ballot harvesting forced on our state.","date":"Thu Apr 01 14:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Let’s get to work. 💪🏻💪🏻","date":"Wed Mar 31 22:27:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Fish and Wildlife Service under Obama, Trump AND Biden admins agree: The Yellowstone area grizzly population has recovered. It’s time to de-list them.\n\nhttps://t.co/iwSi7QLgtQ","date":"Wed Mar 31 19:13:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@SenatorJohnBarraso and I penned an Op-Ed celebrating Wyoming’s many pioneering women who helped blaze the trail for women in leadership across the country! #WomensHistoryMonth\n\nhttps://t.co/Lzb2RQ51iL","date":"Wed Mar 31 16:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Everyone agrees that we need to update our transportation infrastructure. Biden wants to make it a political football. We can do better. \n\nhttps://t.co/Pva7weqQEj","date":"Wed Mar 31 15:36:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"What’s happening at the border is squarely on the shoulders of the Biden Admin. If we enforced our laws, &amp; built the wall, we could end this crisis. I joined those calling on the Government Accountability Office to keep appropriated wall funding flowing.\nhttps://t.co/FdDhDl3gVb","date":"Wed Mar 31 14:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is getting its first state building named after a woman! Thyra Thompson, Wyoming’s first woman Secretary of State, will now have her name on the new state office building in Casper. #womenshistorymonth\nhttps://t.co/bzS2Thsjlt","date":"Tue Mar 30 21:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Is this even a competition? @YellowstoneNPS FTW!","date":"Tue Mar 30 20:39:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Chatting with Bill Nye the Science Guy about NASA was out of this world! 🚀🧑🏻‍🚀🧑🏼‍🔬 Let’s do it again soon @BillNye! https://t.co/19eHHF363r","date":"Tue Mar 30 20:06:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We need to give Grizzly 399 more room to thrive. Under my bill, the Grizzly Bear State Management Act, wildlife scientists in the state would be able to make science-driven decisions on how to best manage the Yellowstone grizzly population and help Grizzly 399 do just that.","date":"Tue Mar 30 13:43:27 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I come “bear”ing good news: The grizzly bear population around Yellowstone has recovered! So it’s time they are removed from the Endangered Species list. We need to let science, not feelings, dictate our grizzly bear policy. #bearswithoutbureaucracy\nhttps://t.co/YNVhFZI3PF","date":"Mon Mar 29 20:20:32 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Praying for a speedy recovery! @SenThomTillis","date":"Mon Mar 29 16:24:16 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 1924, Wyoming elected the first female governor in the U.S. Nellie Tayloe Ross was elected to finish out her husband’s term, but narrowly lost re-election. #WomensHistoryMonth https://t.co/F5qLHx0mcI","date":"Fri Mar 26 18:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Yellowstone area is near its carrying capacity for grizzly bears. It’s time to delist them and let wildlife scientists in the state manage populations.\n#bearswithoutbureaucracy https://t.co/qepNhwN4gU","date":"Fri Mar 26 14:38:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"\"When you are studying any matter, or considering any philosophy, ask yourself only what are the facts and what is the truth that the facts bear out.” - Bertrand Russel #bearswithoutbureaucracy\nhttps://t.co/YNVhFZI3PF. https://t.co/fScGbkE4aP","date":"Thu Mar 25 18:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Big thanks to @SenJohnBarrasso, @SteveDaines, @MikeCrapo, and @SenatorRisch for joining me on this bill.","date":"Thu Mar 25 15:34:03 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s time to bring science back to the management of grizzly bear populations. #bearsbeetsbattlestargalactica\nhttps://t.co/iwSi7QLgtQ","date":"Thu Mar 25 15:28:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Question. What kind of bear is best? Well, there’s two schools of thought. I’d say a bear that’s part of a well-managed population &amp; not subject to the whims of judges and environmentalists. That’s why I introduced the Grizzly Bear State Management Act. #bearswithoutbureaucracy https://t.co/xaYEBI0YOz","date":"Thu Mar 25 15:22:47 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@federalreserve Chairman Powell is right. We must balance innovation with critical privacy protections. Looking forward to a digital dollar that respects the privacy rights of American users.\nhttps://t.co/SlmCnalGvj","date":"Thu Mar 25 14:48:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming’s Secretary of State delivered a secure election in 2020. If Democrats in Washington have their way, H.R. 1/S.1 will undo our ability to ensure a fair and fraud-free election. https://t.co/sBqnaXozHS","date":"Wed Mar 24 19:35:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’re going to wage this fight on all sides. Kudos to @GovernorGordon for leading the charge at home in Wyoming, and I’m proud to keep up the pressure in Washington, D.C. Wyoming will continue to power the nation with clean and affordable energy. \n\nhttps://t.co/Y17PQOJu4n","date":"Wed Mar 24 18:01:39 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This is the largest surge in migration in two decades, yet the Biden Admin refuses to call it a crisis. Time to acknowledge the reality that this is a security and humanitarian crisis and take action. We need to secure the border!","date":"Wed Mar 24 15:30:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Another @cjboxauthor creation is getting picked up for a TV series! Born &amp; raised in WY, he brings the true spirit of our state to the rest of the world through his books. If you haven’t had a chance, grab one of his books or check out the show “Big Sky”.\nhttps://t.co/x3Pysb5gDq","date":"Wed Mar 24 13:39:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The EPW Committee is starting the session off strong with a bipartisan bill addressing our nation’s aging and failing water &amp; wastewater infrastructure. Our bill gives states like Wyoming the flexibility they need to address their systems in the manner best fitting for them.","date":"Tue Mar 23 21:48:09 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Agriculture is an essential part of Wyoming’s identity. It’s what made me who I am. I celebrate the Wyoming Ag community every day, but especially on #NationalAgDay! https://t.co/rDElQ3gY5z","date":"Tue Mar 23 16:29:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming News Now covered these amazing ladies as well! Thanks for bringing to my attention @kaylamdixon \nhttps://t.co/6zGgHsETWS","date":"Tue Mar 23 13:49:28 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I say it often – WY is the best place to live, work &amp; raise a family. Our people, abundant outdoor recreation opportunities &amp; vibrant communities, plus plenty of elbow room, make it the place to be for vacation &amp; starting or growing a business. #thatswy\nhttps://t.co/pTYsoCl9Ni","date":"Mon Mar 22 20:50:21 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming had the first town in the US governed by women! In 1920, the town of Jackson elected three councilwomen, a female town marshal, and a female mayor. #womenshistorymonth https://t.co/AHSZdUJimQ","date":"Mon Mar 22 16:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Those of us who rely on the land for our livelihood know that responsible care for it means we have a healthy give and take. https://t.co/tpz95W5TRf","date":"Mon Mar 22 14:22:58 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Thanks for having me! It was an honor to speak with you all!","date":"Fri Mar 19 21:16:11 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is already fighting to continue to power the nation in clean and innovative ways while also providing reliable energy to the nation via coal, oil, and natural gas. Haaland will make this more difficult, but I’ll keep fighting for our Wyoming way of life, no matter what.","date":"Fri Mar 19 20:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The University of Wyoming (#gopokes) is the only 4-year public university in Wyoming. Under the #BidenBan, Wyoming stands to lose nearly $13 billion in tax revenue. That’s enough to fund UW for the next 59 years.","date":"Fri Mar 19 18:12:12 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@GovernorGordon got it right. It’s foolish to think cancelling this pipeline will do anything to help our economy or our climate. I’m glad Wyoming is signing on to this lawsuit to signal to President Biden that this is the wrong move for our country.\n\nhttps://t.co/21IHwI0tD2","date":"Thu Mar 18 20:17:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming dedicates a third of our biennial budget to healthcare in Wyoming. Under the #BidenBan, Wyoming stands to lose nearly $13 billion in tax revenue. That’s enough to fund the WY Dept of Health for the next 26 years.\n\nhttps://t.co/Rkhem4YpnF","date":"Thu Mar 18 19:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Becerra fails to represent the pro-life, pro-religious liberty values we in WY hold dear. This combined w/ his lack of healthcare experience and support for Obamacare, which has left WY businesses reeling &amp; many WY citizens w/o coverage, makes him the wrong choice for as HHS Sec.","date":"Thu Mar 18 16:48:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Mary Bellamy made history as the first woman legislator in Wyoming. She served one two-year term. #womenshistorymonth https://t.co/E6QBU4XdCO","date":"Thu Mar 18 14:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming dedicates 24% of its budget to education. Wyoming spends over $16,000/student. Under Biden’s EO, WY could lose almost $13 billion in tax revenue. That’s enough to educate 60,000 WY students for their entire K-12 education. If the #BidenBan stands, students lose.","date":"Thu Mar 18 13:27:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m honored to serve as ranking member on the Subcommittee for Fisheries, Wildlife, and Water. Today we had an important conversation surrounding water infrastructure across the U.S. \n\nhttps://t.co/ldqTQ5neMn","date":"Wed Mar 17 19:32:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 1870, the first woman Justice of the Peace took her seat. Esther Hobart Morris was sworn into this position in South Pass City. Her statue now resides in the State Capitol in Cheyenne and in the United States Capitol. #womenshistorymonth https://t.co/rIbHC12Lc6","date":"Wed Mar 17 16:00:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"WY Energy Fact of the Day:\n\nIn severance tax on oil &amp; gas alone, Wyoming collected over $444 million in 2019. Given that 68% of our mineral wealth is found on federal lands, Wyoming will suffer under the #BidenBan.","date":"Wed Mar 17 14:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"#Respect is right! Thanks to the crews across Wyoming for working nonstop to get our state up and running again.","date":"Wed Mar 17 13:55:06 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Roads are still unsafe for travel across the state. Help alleviate the stress on city and county responders and stay home. If you can, check on your neighbors. \n\nhttps://t.co/AbdQJpLMXt https://t.co/vnTs4UmNOa","date":"Tue Mar 16 19:30:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"This snow storm is no joke. Cheyenne is still shut down, but there are some good Samaritans ensuring that doctors can get to the hospital &amp; that grandparents are okay. Ethan Healey is one of those Cheyenne heroes. Thanks for being a good neighbor, Ethan! https://t.co/dqR28gpRzD","date":"Tue Mar 16 18:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I just keep digging… there’s a driveway in here somewhere! https://t.co/gNxnInZuWb","date":"Tue Mar 16 16:53:01 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In 1870, Wyoming became the first territory to have women serve on a jury. Eliza Stewart was the first woman juror chosen. #womenshistorymonth https://t.co/b4UgAHokRN","date":"Tue Mar 16 16:34:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"WY Energy Fact of the Day:\nWyoming is the is the biggest net supplier of energy in the United States. We produce 15 times what we consume. \nhttps://t.co/HjACOfjY9l","date":"Tue Mar 16 13:40:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"While I love the particular charms of Wyoming winters, this weekend’s historic snowstorm has kept me from returning to Washington, D.C. to vote on the confirmation of Representative Deb Haaland. My full statement here: https://t.co/ILQf5eJ3qI","date":"Mon Mar 15 22:22:22 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"ICYMI: I explained my opposition to Rep. Haaland’s nomination to be Secretary of the Interior on the floor last week. Haaland would be bad for Wyoming workers and energy producers.\nhttps://t.co/oqbHzijnkg","date":"Mon Mar 15 20:25:07 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Master of Coin? That title is pure *digital* gold\n\nhttps://t.co/XNWzw0VYYM https://t.co/7hyrV08AoO","date":"Mon Mar 15 19:03:17 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Stay safe everybody!","date":"Mon Mar 15 15:14:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"For 109 years @girlscouts has helped girls build leadership skills that make the world a better place. I am proud to celebrate their years of global impact. #GirlScouts 💚","date":"Fri Mar 12 17:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m loving this project compiled by Wyoming native Lindsay Linton Buk. Her exploration of the many amazing women across our state is both beautiful and inspiring. Don’t miss the fantastic story from my dear friend, the legendary Clarene Law. Check it out: https://t.co/UEiHxnL1YT","date":"Fri Mar 12 14:25:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"She served as Wyoming Superintendent of Public Instruction before blazing another trail by becoming the first woman to be confirmed by the Senate to a federal position, serving as the national Superintendent of Indian Schools. #WomensHistoryMonth \nhttps://t.co/bcSF9cBchA","date":"Thu Mar 11 21:35:41 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Estelle Reel was the first woman elected to statewide office in Wyoming and only the second woman nationwide to be elected to statewide office. (1/2) https://t.co/tZvR715NiY","date":"Thu Mar 11 21:35:14 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The truth of the matter is, you can be both environmentally friendly and energy friendly. In Wyoming we are doing both. Under Biden and Haaland, we will do neither.\n\nhttps://t.co/oqbHzijnkg","date":"Thu Mar 11 20:06:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@westgov gets it. We need to enact the POWER Act and ensure that western states continue to power the nation. https://t.co/GHbGIxQOzE","date":"Thu Mar 11 15:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"How ‘bout them Cowgirls!\n#GoWyo","date":"Thu Mar 11 12:27:26 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"In her nomination hearing, Deb Haaland said “we absolutely need energy independence…” but her past statements and actions are diametrically opposed to that very goal. I have zero faith that she will fight for American energy.","date":"Wed Mar 10 21:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"If we’re going to Build Back Better, we need to streamline the permitting process. Projects sit in limbo for months or years while we wait for frivolous lawsuits to run their course. I talked about this in committee today, and hope we prioritize this as we move forward. https://t.co/SF9U0dKyC2","date":"Wed Mar 10 20:41:36 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Kentucky families are on the menu. Wyoming families are on the menu. I’ll continue to fight for American energy independence and prosperity for Wyoming families, even if the Senate votes to confirm Haaland.","date":"Wed Mar 10 17:25:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m proud to support the Louisa Swain Foundation, an incredible org that celebrates WY's storied history of women’s firsts. Swain made history by becoming the first woman in the world to legally cast a vote. She did this in the Equality State, my state of WY. #womenshistorymonth","date":"Wed Mar 10 15:16:35 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"We’re a year into the pandemic. We need medical professionals at the helm of the Department of Health and Human Services, not Xavier Becerra – an attorney turned politician with no hands on experience.","date":"Tue Mar 09 20:34:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is full of trailblazing women, and @visitwyoming does a great job highlighting them. This coloring book, created for Wyoming’s Women’s Suffrage celebration, is a fun way to learn about the women who made Wyoming the Equality State. \nhttps://t.co/2OvQigNFPv","date":"Tue Mar 09 17:37:34 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming is the largest net exporter of energy in the U.S. \nWe produce 15x the amount of energy we consume. \n\nWe produce the most natural gas from federal leases in the nation. \n\nDeb Haaland at Interior won’t just put Wyoming at risk, but American energy independence.","date":"Tue Mar 09 14:41:31 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"As the first state to give women the right to vote, Wyoming has a rich history of trailblazing women, and I’m honored to stand on their shoulders as the first woman elected to the U.S. Senate from Wyoming. I hope to make them proud. #InternationalWomensDay https://t.co/JL2B0bCOAo","date":"Mon Mar 08 21:55:05 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Even after the most egregious handouts were stripped from this behemoth bill, we were left with a spending bill full of programs that have nothing to do with the targeted, temporary relief the people of Wyoming need to weather the rest of this pandemic.\n\nhttps://t.co/PPXwB3yoxd","date":"Sat Mar 06 17:54:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"U.S. Sen. Cynthia Lummis is proposing a series of amendments to the $1.9 trillion coronavirus relief bill making its way through the Senate that she said will redirect funds within the bill to better serve Wyoming’s needs.\n\nhttps://t.co/8YVh94eMlC","date":"Fri Mar 05 23:44:38 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@SenCapito has it right. Any infrastructure investment should give states the flexibility needed to deliver on projects that will reap benefits for years to come. I’m excited to work with senators on EPW to achieve a much needed infrastructure package. https://t.co/TVInbRO2Me","date":"Fri Mar 05 20:26:24 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Did you know there is a little piece of Wyoming in one out of every four @MolsonCoors  products? WY barley is found in fan favorites like @CoorsLight and @CoorsBanquet. Time to celebrate the end of Ag Literacy Week, responsibly of course. #WYagfacts","date":"Fri Mar 05 18:10:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I feel like I'm having 2010 déjà vu when Pelosi said we need to pass Obamacare to find out what's in it. With a $28T national debt, the least we can do for the American taxpayer is take a moment &amp; read this bill before we decide to spend nearly $2T more. \nhttps://t.co/eT7K0xdsX8","date":"Thu Mar 04 22:50:08 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"There are approximately 11,600 operational farms &amp; ranches in Wyoming. Over 30 million acres in Wyoming are used for crops and livestock, producing food and goods for people all over the world. #WYagfacts https://t.co/evHbRbhMi8","date":"Thu Mar 04 22:34:51 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming sheep produced 2,270,000 pounds of wool in 2020. That’s enough for about 4 wool sweaters for each Wyoming resident. #WYagfacts https://t.co/IiZiFNM43t","date":"Thu Mar 04 16:35:56 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Nearly 1.2 million heads of cattle live in Wyoming. If you’re counting, that’s about twice the number of people living in the Cowboy State. #WYagfacts https://t.co/pxMItw7VST","date":"Wed Mar 03 16:42:52 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Innovation is inherently speculative. If we dismiss it, we miss it. And another country will become the beneficiary of financial innovation, diminishing America’s place in the world.","date":"Wed Mar 03 00:21:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Farmers in Wyoming produced over $17 million and 679,000 tons of sugarbeets in 2019. Sugarbeets are commonly used to sweeten foods we enjoy everyday.  #WYagfacts","date":"Tue Mar 02 23:40:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m on Clubhouse! I’m jumping in a room with @BlockchainAssn on 3/3 at 11:00am to discuss financial innovation and digital assets. I’d love for you to join us!","date":"Tue Mar 02 19:23:04 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Only 1% goes toward COVID vaccine development and mobilization. Taxpayer dollars need to be used for targeted relief that will help American families, businesses and hospitals in crisis. Period.","date":"Tue Mar 02 17:22:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"The Democrat’s COVID relief package reads more like a progressive wish list. Only 9% of the $1.9 TRILLION package goes toward actual COVID relief. (1/2)","date":"Tue Mar 02 17:21:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Happy #ReadAcrossAmericaDay! I’m loving these two books about Wyoming written by former Wyoming First Lady Carol Mead! https://t.co/meoJRDjA2I","date":"Tue Mar 02 15:37:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Perfect example of why the US needs to step up our game on digital assets and financial innovation. This is the way of the future, and for the sake of free governance globally we cannot let China beat us at this. https://t.co/WSyh1BYueQ","date":"Tue Mar 02 02:00:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s Agricultural Literacy Week in Wyoming. Agriculture is one of the top three industries in Wyoming and contributes nearly $2 billion to the Wyoming economy annually. #WYagfacts","date":"Tue Mar 02 00:49:10 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"More sunlight on the opaque world of our financial plumbing is a good thing. I look forward to working w/ @federalreserve &amp; industry to develop a world-class next gen payments system. We can learn lessons from the resiliency &amp; adaptability of digital assets, including #Bitcoin","date":"Fri Feb 26 20:31:13 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"On this day in 1929, President Calvin Coolidge signed an executive order establishing the Grand Teton National Park here in Wyoming. In 2019, 3.4 million people visited this crown jewel of the National Park System. https://t.co/MMAnAGkIP9","date":"Fri Feb 26 18:51:25 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Wyoming businesses have the exciting opportunity to be a part of the GRO-Biz Conference. This virtual conference helps business owners navigate the complicated world of government contracts and procurement. This year's conference is March 9-11.  https://t.co/kbememAcm2","date":"Fri Feb 26 14:28:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m joining Amanda Wick of @chainalysis on March 4th for a discussion on “Women in Crypto”. We’ll talk all things digital assets and financial innovation. Join us here: https://t.co/8VEKk1zyVy https://t.co/Z9NpP7K93P","date":"Thu Feb 25 17:57:37 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It’s National #FFAWeek! For 50 years, @NationalFFA has  developed the next generation of leaders. Students in FFA programs develop leadership, personal growth, and career success through ag education. They go on to lead their communities, their towns, and our nation. https://t.co/kagfWWncdJ","date":"Thu Feb 25 15:03:59 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":".@CEIdotorg gets it. The policies of President Biden and Rep. Haaland are counterproductive to American industry. They say one thing (unity) then do another. Wyoming can’t afford Deb Haaland at the helm of DOI.","date":"Wed Feb 24 22:57:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"#BREAKING Fedwire and the other Federal Reserve payment rails are offline. Banks are reliant upon these networks to do business. Let’s work together to ensure we have a faster, more reliable way to send payments. #innovation https://t.co/yf9zKW5tRT","date":"Wed Feb 24 19:57:44 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"It sure seems like the Democratic agenda has been specifically designed to destroy the WY economy. The #Bidenban, @DebHaalandNM’s far left environmental agenda, and now an artificially inflated minimum wage - WY businesses are tough, but this is no way to restart our economy. https://t.co/JvGpcgYSK7","date":"Wed Feb 24 19:26:40 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"American energy produced in states like WY and Rep Haaland’s home state of NM is some of the cleanest burning energy in the world. If we don’t produce it, other nations with lower enviro standards will fill the gap and our planet will be worse off for it. Stop the #Bidenban.","date":"Wed Feb 24 17:30:00 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Open red states 'punished' under Biden's $1.9T coronavirus aid package: Lummis https://t.co/zFm87cffIc #FoxBusiness","date":"Wed Feb 24 15:34:30 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"Honored to serve as the top Republican on the Commerce Cmte's Space &amp; Science subcmte as well as EPW’s Fisheries, Water &amp; Wildlife subcmte. These subcommittees zero in on issues important to WY, from the supercomputer in Cheyenne to our wildlife populations across the state.","date":"Wed Feb 24 15:00:02 +0000 2021","user_id":"22831059"},{"handle":"SenLummis","text":"I’m glad she’s so clear on her position. I’ll be clear on mine. Rep. Haaland will be bad for Wyoming and should not be confirmed for Interior Secretary.\n\nhttps://t.co/H3RJytlVxz\n\n@taxreformer","date":"Wed Feb 24 14:00:01 +0000 2021","user_id":"22831059"}]