[{"handle":"SenMikeLee","text":"The Utah Rural Electrical Cooperative Association is an invaluable resource. I was honored to welcome their sponsored students to the Capitol to discuss energy solutions for rural communities. Our future is bright in their hands. https://t.co/XQ5g5A6jyq","date":"Thu Jun 16 22:10:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"“I don't have anything new,\" is the @WhiteHouse response to the baby formula shortage. \n\nMake no mistake, there is no natural baby food shortage. This was created by our government, and it's isolated to our shores.\n\n@POTUS, you should take a look at my FORMULA act. https://t.co/pWAkMRWpvR","date":"Thu Jun 16 00:12:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Unsurprisingly, ending a human life is not good for the economy. Abortion costs trillions of dollars and millions of lives. I am proud to be #ProLife.","date":"Wed Jun 15 18:46:27 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"On the US Army’s 247th birthday, these Utah recruits swore to defend to Constitution. I am forever grateful to them and all the past soldiers upon whose shoulders they stand. https://t.co/eBPSGCWmDk","date":"Wed Jun 15 13:21:26 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My office is quickly approaching our 1,500th mobile office. This year alone we've done nearly 75 and visited every corner of the state. \n\nIf you’d like to schedule a mobile office in your city or town, or see when one will be near you next go to https://t.co/SsSPMHapSN https://t.co/NWHDwd1k5X","date":"Wed Jun 15 00:02:58 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was thrilled to join @SenatorBraun on this important resolution. The Pledge of Allegiance stands for unity, our greatest ideals, and for America as one nation under God.","date":"Tue Jun 14 21:52:06 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Israel is a vital ally to the United States. I enjoyed meeting with @AIPAC today to discuss the partnership between our two nations. https://t.co/jQjgY9l5eg","date":"Tue Jun 14 21:46:12 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"While the White House flips through notes, American moms and dads have been asking themselves how they are going to find formula to feed their babies each and every day. My FORMULA Act would help ease the baby formula crisis. We should pass it immediately.","date":"Tue Jun 14 17:42:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I pledge allegiance to the Flag of the United States of America, and to the Republic for which it stands, one Nation under God, indivisible, with liberty and justice for all. #FlagDay https://t.co/WHGqWQcYGx","date":"Tue Jun 14 16:57:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#Armybday #Army247 @USArmy https://t.co/uDbnOJuTfv","date":"Tue Jun 14 13:15:30 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I will always stand on the side of the Second Amendment, law-abiding Americans, due process, and justice. Those who commit acts of rampage violence are criminals who must be stopped. I look forward to reviewing this legislation.","date":"Sun Jun 12 19:12:04 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Short of repealing the Jones Act, the best policy is proposed by my “Protecting Access to American Products Act,” which would allow Jones Act waivers to better transport US oil and LNG to places like Puerto Rico—so they don’t have to rely on imports. https://t.co/C52fNXhCjb","date":"Fri Jun 10 22:09:20 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"8.6% inflation represents government failing Utah families. Real wages are declining. Prices are skyrocketing. Families are struggling to keep their heads above the rising tide. I have a detailed plan to fight inflation. When will @POTUS act?\n\nhttps://t.co/48znEVteJt","date":"Fri Jun 10 13:52:23 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sandy is a thriving community that helps make Utah the best place in the nation to live, work, and raise a family.  I was honored to meet with Sandy’s Mayor Monica Zoltanski today to talk about the economy and development in this key Utah city. https://t.co/HnyC1AYUkR","date":"Thu Jun 09 21:38:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Today and always, I am proud to be an American and a Utahn. Thank you to @UtahHonorFlight. To all of the veterans in Utah, your dedication, selfless service, and sacrifice will never be forgotten. https://t.co/ljdqfcFBck","date":"Wed Jun 08 21:47:02 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/j9m07edWVA","date":"Wed Jun 08 18:01:16 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Attacks on and threats toward Supreme Court officials have gone on for too long. @POTUS must immediately enforce the laws, condemn illegal protesting at justices' homes, and pledge to protect every member of the Court from these escalating and dangerous threats.","date":"Wed Jun 08 15:00:39 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am thrilled my bill honoring the late Candy Bomber, Col. Gail S. Halvorsen, was signed into law today. This bill unanimously passed the Senate and will make sure Col. Halvorsen’s name is forever remembered as the new name of the Provo Veterans Center. https://t.co/bfDJgCOFBX","date":"Tue Jun 07 21:04:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Gas prices average over $4.95 in Utah and over $4.91 nationally. Yet @POTUS is avoiding his legal obligation to sell energy leases. This administration is snubbing the law so that American families have to pay more at the pump and everywhere else. #gasprices #Bidenflation","date":"Tue Jun 07 14:17:03 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"HOUSES Act: https://t.co/lIVEj5NnWb https://t.co/lfhWnNMGUs","date":"Tue Jun 07 00:00:14 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"SHIP IT Act: https://t.co/lxyIULC0iw https://t.co/qw1iKi7S3d","date":"Tue Jun 07 00:00:13 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"PRICE Act: https://t.co/Rb3XflqTJI https://t.co/u0zua2vgiP","date":"Tue Jun 07 00:00:12 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The failed policies of @POTUS and Democrats cost Utahns an extra $750 a month. This inflation crisis is the president’s own creation and he seems to have no plans to fix it. \n\nI have a plan.\n\nhttps://t.co/48znEVbDkT https://t.co/Rs2HAm8XIE","date":"Tue Jun 07 00:00:11 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#DDay https://t.co/WYmvfMrHRx","date":"Mon Jun 06 20:36:04 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@POTUS promised to use every tool to fix the gas price crisis. But he’s refused to end or reduce biofuel mandates that turn food into fuel, crush small refineries, and cost Americans $30+ billion. High gas prices are on purpose. Biden is making you pay for his radical agenda.","date":"Fri Jun 03 18:13:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Family and civil society breakdown comes with dangerous consequences. Addressing fatherlessness, broken homes, loneliness, bullying, detachment, and addiction must play a role in efforts to keep American communities safe and prosperous.\n\nhttps://t.co/ncJXFxGyhE","date":"Wed Jun 01 16:51:06 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"@POTUS has finally admitted inflation is a problem. Utahns are paying more at the pump, the grocery store, for housing, and for just about everything else. Democrats’ runaway spending is to blame.","date":"Wed Jun 01 15:05:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I have a plan: https://t.co/48znEVteJt","date":"Wed Jun 01 15:05:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My FORMULA Act will help ease this crisis that is threatening American babies. The Senate should pass my bill as soon as possible.","date":"Tue May 31 14:02:57 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"READ MORE: https://t.co/DsPoq8mnau","date":"Tue May 31 14:02:57 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"We celebrate this day by thanking those who died so that we could live and who sacrificed so that we could be free. #MemorialDay https://t.co/qCDx3RYFzW","date":"Mon May 30 14:07:42 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The internet runs on advertising, but big tech’s stranglehold on the industry is killing privacy, innovation, and competition. My bipartisan digital advertising act will protect Americans and the future economy. \n\nClick here to read bipartisan support: https://t.co/giKXgzLi7c","date":"Fri May 27 17:31:30 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My heart breaks at the tragic news from Texas today. I pray for the victims, their families, and for our nation at this difficult time.","date":"Tue May 24 21:48:30 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#ArmedForcesDay https://t.co/P7Hj7vHXIu","date":"Sat May 21 21:56:34 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"LEARN MORE: https://t.co/DsPoq8DY22","date":"Thu May 19 18:32:59 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Keeping American infants fed should be one of the least controversial proposals imaginable. American babies are going hungry and the federal government is standing in the way. My FORMULA Act will help solve the formula crisis and make sure American babies do not go unfed. https://t.co/sKdfEJSBf9","date":"Thu May 19 18:32:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read more about the FORMULA Act: https://t.co/DsPoq8mnau","date":"Wed May 18 21:24:18 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thanks for your support, @SteveDaines. https://t.co/15JdSVxLMu","date":"Wed May 18 21:24:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The ESG movement’s primary goal is to force divestment from fossil fuels. No investment in energy = higher prices. That's what they want. This woke crusade is hurting Americans every time they go to the gas pump or flick the light switch. https://t.co/xmjlhtKg4V","date":"Wed May 18 16:03:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Feeding American babies should be the least controversial of issues. My FORMULA Act can help fix the formula crisis and make sure that American families can take care of their infants.","date":"Tue May 17 21:44:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/hX5gIP5Q1c","date":"Tue May 17 14:20:16 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read more: https://t.co/DsPoq8mnau","date":"Tue May 17 14:20:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My FORMULA Act will help solve the formula crisis and make sure American families can feed their babies.","date":"Tue May 17 14:19:21 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read more: https://t.co/DsPoq8mnau","date":"Mon May 16 18:00:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"American babies are going hungry and the federal government is standing in the way. My FORMULA Act will give these families relief during this unprecedented shortage. Congress needs to pass this bill immediately to protect American babies from going hungry. https://t.co/qn6rJ9jlIB","date":"Mon May 16 17:57:40 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy #NationalPoliceWeek! I had the pleasure of meeting with some of Herriman’s finest. To the law enforcement throughout Utah and all across America, thank you for keeping us safe. @HerrimanPolice https://t.co/BGjLr8RoYp","date":"Fri May 13 13:46:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Judge Griffith makes a compelling case for the independence and integrity of the federal judiciary. The Supreme Court is not a partisan body. Attempts to apply political pressure and threats to pack the Court are wrong.\n\nhttps://t.co/7nklDLUWNb","date":"Thu May 12 20:46:12 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am thrilled the House has passed my RECA extension. This bill’s passage is a statement saying the United States government is not abandoning the victims and communities harmed by the early atomic program. @POTUS should sign the bill as soon as possible.","date":"Thu May 12 19:40:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I wish my friend, @GovCox, a swift recovery.","date":"Thu May 12 16:29:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@RioTinto is a leading company in Utah and a major player in our nation's critical mineral supply chain. I met with CEO Jakob Stausholm today and congratulated Rio Tinto for its new investments at @kennecottutah. https://t.co/0h6d3pjUpm","date":"Thu May 12 15:37:06 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"As gas prices hit an all-time high in the USA, @POTUS cancelled a vital round of oil and gas lease sales this morning. High gas prices are preventable. Democrats are putting woke politics ahead of American families.\n\nhttps://t.co/eBKUg0URWk","date":"Thu May 12 13:37:46 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congress should not have to make the false choice of either giving the FTC broad authority with no safeguards or leaving consumers unprotected. My legislation, the Consumer Protection and Due Process Act would fix that. https://t.co/79IU725G96","date":"Wed May 11 21:23:57 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"These Aggies traded in their ice cream for Jell-O today. It was an honor chatting with these Huntsman Scholars from @USUAggies. https://t.co/tyJ50NMTWt","date":"Wed May 11 20:48:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Families in Utah are paying $750 more a month due to runaway inflation.  #Bidenflation","date":"Wed May 11 17:16:40 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was an honor to help facilitate this amazing donation to Ukrainian refugees in need.","date":"Tue May 10 22:01:38 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great piece by my friend @TreasurerOaks about how ratings agencies are attempting to place political pressure on states like Utah through ESG ratings scores in an affront to voters and state sovereignty. Keep woke politics out of credit ratings!\n\nhttps://t.co/4TsAnrUS7D","date":"Tue May 10 01:04:10 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Public officials should never have to fear for their safety for doing their jobs, certainly not in America. @POTUS must condemn the threats against SCOTUS justices.","date":"Mon May 09 17:29:51 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"There is no greater human calling, title, or honor than that of mother. This Mother’s Day and every day, I am grateful for my mother, who is my hero, and to Sharon, who is the love of my life. https://t.co/w6vQzepsYP","date":"Sun May 08 14:00:02 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Those threatening to hijack the Court are people who can't stand the thought of a Court that doesn't bow to political pressure to make law rather than interpret it. As a former law professor, you know the importance of an independent judiciary. Please don’t threaten that.","date":"Thu May 05 23:30:14 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"While Col. Halvorsen may not be with us anymore, his story, his legacy, and his influence carry on bringing smiles, relief, and hope for a better world. https://t.co/4mC4mWrNYe","date":"Thu May 05 22:56:14 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"On this National Day of Prayer I am reminded of the supplication of George Washington. May we follow his example in praying for our country, our fellow citizens, and the virtues of a free republic. https://t.co/xrjHDTgOER","date":"Thu May 05 21:37:51 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Full remarks: https://t.co/kboQTtSoLJ","date":"Thu May 05 15:12:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"A lot of us have put up for a very long time with decision making that was wrong without questioning the legitimacy of the Supreme Court. Efforts by some now to pressure, pack, and delegitimize the Court are shameful, wrong, and dangerous. https://t.co/Ai4Hw2fN9X","date":"Thu May 05 15:11:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"To the extent this leak was an effort to threaten, intimidate, and harass those justices who support Justice Alito’s well-written and well-reasoned draft opinion is disgraceful. https://t.co/JspFrRHBKY","date":"Tue May 03 23:00:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"SCOTUS has countless procedures to protect against leaks like this because leaks are damaging to the legitimacy, independence, and operation of the Court.\n\n@marthamaccallum @FoxNews https://t.co/nfjHOzaWfs","date":"Tue May 03 21:32:06 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Nailed it.","date":"Tue May 03 03:31:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#SCOTUS https://t.co/n10pN5eIsg","date":"Tue May 03 02:49:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"We are honoring the late Senator Orrin Hatch at the Wallace F. Bennett Federal Building in downtown Salt Lake City this week. A giant of the Senate and a pillar in Utah, he was a pioneer through and through.\n\n@senorrinhatch @OrrinHatch https://t.co/yEhIMhawld","date":"Mon May 02 22:09:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"He’s tied for first place with Justice Alito.","date":"Mon May 02 20:25:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/rI3zFVQLCu","date":"Fri Apr 29 19:44:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was decided long before the founding that the government doesn’t decide what is and isn’t true in America; the people do. That is the whole point of free speech. It is disturbing that @POTUS and @SecMayorkas want to change those roles in response to a shift in tech stocks.","date":"Fri Apr 29 19:44:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My bill, extending RECA payments to downwinders and others harmed by the nation's early atomic program, has passed the Senate unanimously. I am grateful Utahns and others hurt by atomic extraction and testing are a step closer to remaining eligible for this deserved compensation.","date":"Thu Apr 28 23:10:26 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#HolocaustRemembranceDay https://t.co/GihxuB7qmB","date":"Thu Apr 28 17:29:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Taxpayer dollars must not be used to deny the fundamental rights promised in the Declaration of Independence. First among them is life. I voted today to protect preborn babies from federally funded abortions. https://t.co/V8s70y7pCF","date":"Wed Apr 27 23:27:27 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Capitol is back open! I loved giving a tour to folks from the Utah Industry Association this morning, and my office and I would love helping you and yours get a tour when you visit Washington. https://t.co/TDVJcWFZUs","date":"Wed Apr 27 20:23:59 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Forgiving student loans to redistribute wealth to your political supporters is patronage, and it is wrong.  @POTUS https://t.co/Hee7ZwUqxj","date":"Wed Apr 27 18:48:42 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’ve pushed for stronger antitrust enforcement for years, while still fighting attempts by the left to politicize it. Here’s @linakhanFTC’s old employer trying to stretch antitrust law beyond any reasonable interpretation to stop @elonmusk from liberating Twitter.","date":"Wed Apr 27 15:26:24 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Orrin Hatch was a pioneer, through and through. I bid my friend Senator Hatch onward, ever onward. May we as a nation forever remember his legacy is my prayer. @OrrinHatch https://t.co/xbixY2u4Cc","date":"Tue Apr 26 22:43:27 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"If the nanny state had a mascot, it would be the FTC. It’s time @linakhanFTC and her rogue commission get a time out. https://t.co/3N5pd51cNv","date":"Tue Apr 26 19:51:58 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I love to see my colleagues visit the #dctemple. It was an honor to share a part of my faith and this wonderful, holy structure with some of my dear friends in the Senate. https://t.co/Gaow3lLly8","date":"Tue Apr 26 16:05:39 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/G2r6hCu5VY","date":"Sun Apr 24 01:49:07 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah's economy has the best outlook in the nation, and it has for the past 15 years. I joined @UtahTreasurer Oaks to tell S&amp;P that they should keep woke politics out of bond ratings.\n\nhttps://t.co/WAVdrKFZuQ","date":"Thu Apr 21 17:59:36 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The work @northropgrumman and @HAFB are doing in Utah with GBSD is vital to our national security. I’m grateful for the dedicated men and women who continue to keep Americans safe. https://t.co/DteNmxeKix","date":"Thu Apr 21 15:09:24 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Children in Utah and across the nation must be protected from the horrors of sexual exploitation and trafficking. I met with child safety advocates yesterday to discuss pending legislation to protect kids.","date":"Thu Apr 21 14:27:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Worried about the economy? So am I. Here’s my plan.\n\nhttps://t.co/48znEVteJt","date":"Tue Apr 19 17:00:36 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Uncle Sam has had his hands in your wallet all year, and the rising cost of inflation has made life in Utah 12% more expensive. $702 more per month!\n\nMy PRICE Act would make it harder for Congress to spend your money.\n\nhttps://t.co/dKRT69mwYS","date":"Mon Apr 18 22:44:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My family and I wish you a happy Easter. May the light of Christ's resurrection bring you peace and hope this holy day.","date":"Sun Apr 17 19:08:30 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@POTUS’s inflation is costing Utah families almost $8,500 more each year, and it is only getting worse. My PRICE Act would prevent the federal government from recklessly spending while inflation is devastating American families. https://t.co/c6hDfcJoHp","date":"Fri Apr 15 00:21:26 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s the poor and middle class who are paying for this war on American energy. We should not be bailing out Biden’s poor policies with oil from our reserves or asking Venezuela, Saudi Arabia, and Iran to come to our rescue. https://t.co/2JVBNmCcQ4","date":"Thu Apr 14 16:27:33 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My friend, @SenDanSullivan, is an energy expert, and he is right. We can meet our energy needs by cutting burdensome regulations and accessing energy here at home. https://t.co/DSLzGoXG3e","date":"Wed Apr 13 18:53:15 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah’s housing costs have skyrocketed as the population grows. Cities like St. George are running out of space as they bump against federal land. My HOUSES Act will help make sure Utah communities can grow responsibly into the future.\n\nhttps://t.co/2JEwEVdPXj","date":"Tue Apr 12 14:23:46 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah's housing and land shortages are unprecedented. The federal government owns more than 2/3 of Utah's land. My bill would free up some of that land to be responsibly used for housing. \n\nhttps://t.co/59qz3kRbHa","date":"Mon Apr 11 13:25:55 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I sent a letter with 68 colleagues asking @TheJusticeDept to investigate the deaths of unborn babies whose remains were found in DC. \n\nPartial-birth abortion is an evil, heinous crime. If these babies were killed unlawfully, we must find the perpetrators. https://t.co/3GIynd0Pkj","date":"Fri Apr 08 17:39:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Judge Jackson’s refusal to articulate her judicial philosophy, account for her troubling record, or give her opinion on court packing is disappointing. The Constitution demands better. The American people deserve better. I voted today against her confirmation. https://t.co/CEQXQUUadK","date":"Thu Apr 07 20:18:19 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"People are flocking to visit Utah for the stunning views and hiking trails, our great sports teams and universities, the greatest snow on earth, and much more. I enjoyed talking with the Utah Tourism Industry Association today about what makes our state a tourism hotspot. https://t.co/AE3UaQhCHM","date":"Wed Apr 06 21:43:27 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Our republic works because citizens can see and participate in the process. Today, I spoke with students from Mountain Heights Academy and American Preparatory Academy about what life is like as a senator and how Congress works. \n@CloseUp_DC @MHAcad @AmericanPrep_UT https://t.co/xFiVsew559","date":"Wed Apr 06 16:51:35 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah’s cosmetology schools provide an option and an opportunity for students to hone skills and build careers and businesses. Today I met with many owners of Utah’s cosmetology schools and talked about how excessive federal regulations burden their mission of educating. https://t.co/56vrFycrLR","date":"Wed Apr 06 14:44:16 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"While @POTUS is making domestic energy production harder and harder, the people of HF Sinclair are working to keep energy and everyday life affordable for Utahns. I enjoyed speaking with CEO Michael Jennings today about energy policy. https://t.co/SW55W8Hch5","date":"Wed Apr 06 00:15:53 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Taiwan is a vital international partner to Utah and the United States. I was honored to host Ambassador Hsiao Bi-khim of Taiwan today to discuss international affairs, the war in Ukraine, and trade between our nations. https://t.co/bOJQ8VBLIH","date":"Tue Apr 05 18:31:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@POTUS has made it abundantly clear where he stands on oil and gas, and his positions are having ramifications at the pump. He is pointing the finger everywhere but at his own policies and those policies are disproportionately hurting lower and middle-class Americans. https://t.co/SmeHRu8zfO","date":"Tue Apr 05 17:40:16 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"They told us to look at judicial philosophy, but Judge Jackson said she doesn’t have one. They leaned on her record, but what we have of her record is troubling. They said to look at her answers, but she didn't answer basic questions &amp; endorsed judicial activism. I will vote no. https://t.co/iVmZlUSbbr","date":"Mon Apr 04 16:41:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Proud of my staff for working to help secure the passage of some critical aid to Ukrainian refugees in Europe in this incredible mission inspired by my friend, the late Col. Gail Halvorsen.\n\n➡️ 2 tons of school supplies\n➡️ 4 tons of baby products\n➡️ 9,000 letters from Utah kids https://t.co/XAp4u0c4T2","date":"Sat Apr 02 15:30:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy birthday to my former boss, Justice Alito! He is a dedicated jurist and public servant. Our nation is better-off due to his service.","date":"Fri Apr 01 14:46:25 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation is hitting Utah harder than almost anywhere else in the nation. Pleased to share some of my proposed solutions with the @saltlakechamber during this week’s State of Inflation Townhall. https://t.co/JKfJQrjuD3","date":"Thu Mar 31 20:36:40 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@USGS is using data that says Russia is more politically stable than Utah in creating its list of Critical Minerals. I asked them why they would use data that is absurdly and offensively wrong. https://t.co/GxhcV9V70W","date":"Thu Mar 31 17:59:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The only thing that makes Jell-O better, is Utah’s best-tasting water. It was great meeting with @utahruralwater and enjoying some Jell-O made with water from Honeyville in Box Elder County. https://t.co/U7VgSu7Jc2","date":"Wed Mar 30 15:57:32 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation costs American families on average $5,200 a year. In Utah, the number is almost $7,000. Families across the country are suffering under @POTUS's inflation.\n\nUse my map with @JECRepublicans to see what inflation costs families in your region. \n\nhttps://t.co/cyabuKn6aH","date":"Wed Mar 30 14:09:12 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was deeply moved by Eleanor McCullen’s testimony today. Her work as a sidewalk counselor outside abortion clinics and her demeanor of love, peace, and care are inspiring. Thank you, Eleanor, for your words today and for your years of caring for mothers and the unborn. https://t.co/9MV8hE0ZMf","date":"Thu Mar 24 21:00:03 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Ukrainian orphans who were set to be adopted by American families are now trapped in Europe awaiting paperwork. I led a group of 39 members of Congress asking @SecBlinken to help. https://t.co/BOu5rhegvB","date":"Thu Mar 24 14:44:20 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Excess federal land ownership in Utah makes housing, energy security, and even funding local police and fire departments more difficult. I asked Judge Jackson about her record on federal land ownership cases in today’s hearing. https://t.co/lAKrk7APjN","date":"Wed Mar 23 20:12:23 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Glad to welcome Outdoor Retailer back to a state that takes great care of its public lands. Utah is the best place in the nation to spend time outdoors and to run a business.","date":"Wed Mar 23 19:50:32 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It concerns me that Judge Jackson hasn't been willing to offer her opinion on Court Packing. It goes to the Court's independence. https://t.co/wjD0rentV2","date":"Wed Mar 23 19:12:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"A correct judicial philosophy requires humility. Good judges don't seek to be lawmakers; they read and apply the law. And as Justice Scalia said, sometimes that means a judge does not agree with the policy implications of his or her own decisions. https://t.co/VV87JykeVf","date":"Wed Mar 23 01:42:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I asked Judge Jackson questions in today’s hearing. While some of her answers were encouraging, I hope for more direct responses tomorrow. https://t.co/HpVeWilsnE","date":"Tue Mar 22 22:19:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"By my calculations, @TXInstruments is a great American company with a growing presence in @LehiCity. I enjoyed chatting with CEO Rich Templeton about what makes Utah a great place to do business. https://t.co/s5PzIHntNd","date":"Tue Mar 22 22:06:02 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My thoughts before questioning Judge Ketanji Brown Jackson in today’s Judiciary Committee Hearing. Court packing is wrong. https://t.co/l1DoyOi2Kd","date":"Tue Mar 22 15:25:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The job of the court, of the judiciary, is never to exert will or force. It is only judgment, discerning what the law says.\n\nhttps://t.co/cLidGYjnMu","date":"Mon Mar 21 21:13:58 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read my new report on the joy and value Americans with Down syndrome bring to their families, workplaces, and communities. The future is bright for those with Down syndrome and all of us who are blessed to know and interact with them.\n\nhttps://t.co/gSPtsjY8AR","date":"Mon Mar 21 17:52:54 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"On this #WorldDownSyndromeDay I’m reminded of Lucas Warren’s shining smile, and the smiles of all those with Down syndrome who are blessings in my life. They carry with them a warmth and tender cheer that make the world a better place and we should be ever grateful for them. https://t.co/HfsgdBPE6Y","date":"Mon Mar 21 17:51:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"We must prevent the Supreme Court from becoming a political body.","date":"Mon Mar 21 16:31:55 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Even when, and especially when, we disagree with decisions of the Supreme Court, we must not seek to undermine the legitimacy of the Supreme Court. We must not undermine the very thing that we purport to be protecting.","date":"Mon Mar 21 16:31:55 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am sickened when I hear these efforts to delegitimize the Court. We have heard some of those comments here today. Another way to delegitimize the Court is by packing the Court.","date":"Mon Mar 21 16:31:55 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Nine is a number that works. It has worked well for 152 years. Supreme Court justices have praised that number, including Justice Breyer, Justice Thomas, Justice Ginsburg, and others.","date":"Mon Mar 21 16:31:55 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Coming up","date":"Mon Mar 21 16:11:56 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Listen live on @kslnewsradio around 10:20 MT as I give my opening statement in the Judge Ketanji Brown Jackson SCOTUS hearing.\n\nhttps://t.co/G66nHKR88h","date":"Mon Mar 21 15:57:51 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"A Supreme Court Justice must never seek to make law, but interpret the law enacted by lawmakers. Justices should uphold justice and the integrity of the Constitution and the Court. Tune in today as I explain what I will be looking for in Judge Jackson’s hearing this week. https://t.co/OfQyIhjT2w","date":"Mon Mar 21 15:30:42 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sharon and I are praying for Justice Thomas today and wishing him a swift recovery. He is a treasure to our judiciary and our nation.","date":"Mon Mar 21 15:07:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I enjoyed meeting with friends from the @UUtah. The Hinckley Institute’s internship program is a powerful opportunity for young people to participate in government.\n\n@PeterSCooke\n@hinckleyinst https://t.co/A3rVosk8ZO","date":"Fri Mar 18 19:02:20 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The White House's whataboutist response to Judge Jackson’s very real record in child pornography cases is dismissive, dangerous, and offensive. We need real answers.","date":"Thu Mar 17 20:47:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Jones Act is making the rich richer, the poor poorer, and America weaker. It needs to go. https://t.co/DxnlDxqUzD","date":"Thu Mar 17 02:42:39 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am grateful for the members of @UtahFarmBureau every time I sit down to a meal. These hardworking Utahns are the heart of our supply chains, and they are feeling the full pains of @POTUS’s inflation. I am committed to helping our farmers so they can keep food on the table. https://t.co/SUyWnewQiq","date":"Wed Mar 16 22:30:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"UPDATE: Due to recently announced votes on the Senate floor this evening, we are unfortunately cancelling tonight’s event. We will reschedule. I look forward to speaking with you soon.","date":"Wed Mar 16 20:00:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is always a good day when Utah high school students come to town. I enjoyed speaking with these bright students with @Closeup_DC from St. Joseph’s Catholic High School in Ogden about their ideas today. https://t.co/SKjIVAX3UN","date":"Wed Mar 16 19:15:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tonight at 5:00 PM MT for an Access Live Town Hall event. Register at https://t.co/qj2h8Xv61e to participate by phone, or ask your questions on Facebook Live during the event. Looking forward to talking with you! https://t.co/FRx1ZMQFRP","date":"Wed Mar 16 18:15:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"St. George is one of the best places in the nation to live. I loved meeting with Mayor Michelle Randall and other city leaders where we talked about the hard work they’re doing to keep their rapidly growing city one of the best communities in the country. https://t.co/QKnXsHY2Gp","date":"Wed Mar 16 17:19:48 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I loved meeting with Utah mayors, city and town council members, and youth delegates today from across Utah. Local government is where the most impactful decisions of government are made, and Utah has amazing leaders. https://t.co/ydQe9fQd5V","date":"Wed Mar 16 15:59:12 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My statement following an address to Congress by @ZelenskyyUa. https://t.co/9Nm3Rbx5wj","date":"Wed Mar 16 15:22:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I enjoyed meeting with @RideUTA. Their hard work keeps Utahns and our economy moving. https://t.co/sP6rURjMbK","date":"Wed Mar 16 13:39:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"While we all celebrate the end of the lockout, let’s bring baseball back to a competitive market and end the anticompetitive antitrust exemption. https://t.co/EfpMw8HN8h","date":"Fri Mar 11 17:19:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is always a joy chatting with @LanceFritz_UP of @UnionPacific. Union Pacific’s infrastructure and hard work helps keep our nation’s supply chains functioning. Their investments in Utah are helping fuel and supply our state's rapid growth. https://t.co/74SbWn0tBK","date":"Thu Mar 10 19:46:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Banning Russian oil comes with a natural second step, unleashing American energy potential. Unfortunately, @POTUS and his poor policies are standing in the way. One key way to secure our energy supply would be to authorize the @UintaBasinRWY. https://t.co/kRtyqXHTP6","date":"Thu Mar 10 18:56:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation in Utah is up to 9.7%. Joe Biden's failed policies have made life more expensive for and harder on Utah families, and Democrats want to spend trillion$ more today. End the madness.","date":"Thu Mar 10 14:33:25 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/sPBrW8chGN","date":"Wed Mar 09 16:00:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/dXOAOJQvm0","date":"Wed Mar 09 15:59:59 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Had a lovely chat with @UtahBankers this morning. It was great to be among friends. Utah's banks lead the nation in financial security and innovation. https://t.co/Ocrbk5xQTR","date":"Tue Mar 08 20:38:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Now that @POTUS has finally consented to halting Russian oil imports, he must follow through with the logical second step and open the tap on America's clean, abundant energy resources.\n\nhttps://t.co/bxxjf5Il12","date":"Tue Mar 08 14:21:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thoughts after speaking with Ukrainian President Volodymyr @ZelenskyyUa\n\n#Ukraine #StandWithUkraine https://t.co/ZHnQGPV53Y","date":"Sat Mar 05 17:20:28 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Want to end the MLB lockout? Let’s start by repealing baseball’s antitrust exemption. I have a bill (S. 1111) to do just that.","date":"Fri Mar 04 02:11:17 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I stand with the vulnerable orphans caught in Putin's fury, and pray for their speedy evacuation from Ukraine. https://t.co/z9I7R3LnqX","date":"Thu Mar 03 19:35:11 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"If passed, my bill could put SSDI payments into patients' hands sooner, relieving some of the stress of end-of-life care. It would provide a voice to the oftentimes voiceless.\n\n@ABC4Utah\n\nhttps://t.co/9okIWnaW8C https://t.co/hiSAt4BpBA","date":"Thu Mar 03 19:02:16 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Terminally ill patients shouldn’t have to worry about bureaucratic waiting periods for Social Security Disability payments. My bill will allow the terminally ill to receive money when they need it, relieving some of the stress associated with end-of-life care. https://t.co/nw28PARFwV","date":"Thu Mar 03 17:45:11 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"We will not stop until American moms and dads can provide for their families without kowtowing to President Biden’s mandates. https://t.co/GiLMWZ4ZtF","date":"Wed Mar 02 22:47:04 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is a victory for freedom-loving Americans! I am proud to join @RogerMarshallMD in this effort!","date":"Wed Mar 02 21:21:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to the @UTNationalGuard! I appreciated hearing an update on the state of the Guard and talking about my Guarding Readiness Resources Act.\n\nhttps://t.co/QWP2XXgvnz https://t.co/18UjRrqUp4","date":"Wed Mar 02 18:43:54 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It has been an honor to host Utah’s Credit Unions in Washington. During these shifting economic times, Utah’s financial institutions are strong, resilient, and dedicated to serving Utah.\n\n@UtahsCUs https://t.co/f6xKX1GP7X","date":"Wed Mar 02 14:26:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was a pleasure meeting with the @publicpowerorg today. \n@provocity Mayor @mayorkaufusi\n@salemcity Council Kurt Christensen \n@SpanishForkCity Mayor @mendenhallsf\n@MantiUtah Mayor Chuck Bigelow\n@NephiCity Mayor Justin Seely\nLevan Mayor Bruce Rowley. https://t.co/y24pYb1n7L","date":"Wed Mar 02 04:45:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My reaction to tonight’s State of the Union address. \n\n#SOTU https://t.co/94JiQWlMTP","date":"Wed Mar 02 03:29:45 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Out of nearly 400 metro areas across all 50 states, Utah packed the top 35 in employment growth by percentage since 2019! Congratulations, @Cityofstgeorge, @provocity, @Orem_City, @cityoflogan, @OgdenCityUtah, and @SLCgov. https://t.co/npMjTAqOa1","date":"Tue Mar 01 22:33:08 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Glory to Ukraine! \n\n#StandWithUkraine #utpol @SpencerJCox @DeidreHenderson https://t.co/SbKMZDSzHH","date":"Mon Feb 28 23:20:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My heart goes out to @SenFeinstein and her family on the loss of her husband, Richard Blum. Through my work with her over years, Senator Feinstein has represented the highest values of collegiality, cordiality, and grace. Sharon and I pray for them at this difficult time.","date":"Mon Feb 28 20:53:25 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 The Constitution requires that Congress must vote to authorize any use of our Armed Forces in conflict.","date":"Fri Feb 25 17:44:22 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 President Biden’s unilateral deployment of our Armed Forces to the European theater, where we now know they are in imminent hostilities, triggers the War Powers Act, necessitating that the President report to Congress within 48 hours.","date":"Fri Feb 25 17:44:21 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 Should Congress not receive such a report, and Congress not authorize this use of military force, our forces would need to be removed from imminent hostilities. NATO invoking Article V calling on defensive support is not self-enforcing.","date":"Fri Feb 25 17:44:21 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My statement regarding the #SCOTUS nomination of Judge Ketanji Brown Jackson: https://t.co/KIPKXWVkVl","date":"Fri Feb 25 16:19:41 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Yet, President Biden has crippled U.S. energy security over the last year, and now insists Americans stomach higher prices at the pump as war wages in Europe. President Biden’s policies leave the United States and our allies poorer and vulnerable.","date":"Thu Feb 24 16:22:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Putin’s military ambition is further emboldened by Russia’s stronghold on the European oil and gas market.","date":"Thu Feb 24 16:22:31 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The horror of war has again shown its face in Europe. Putin’s cruel attack on the people of Ukraine is a gross breach of sovereignty. I condemn this violence and evil, and pray for the people of Ukraine.","date":"Thu Feb 24 15:17:58 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is always a highlight of my year to speak with the Utah State House and Senate majority and minority caucuses. Utah has dedicated state legislators who make Utah the best governed state in the nation.\n\n@utahhousereps @utahhousedems @UtahSenateGOP @UtahSenDems https://t.co/DuHOb5tKCC","date":"Tue Feb 22 23:04:19 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"“The power under the Constitution will always be in the people.” - George Washington 1787\n\n#PresidentsDay https://t.co/gt9Km4zekF","date":"Mon Feb 21 15:57:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Walter Estes Dellinger III 1941 - 2022\n\nhttps://t.co/Gadqxk3q4b https://t.co/nJBuwzBKiB","date":"Fri Feb 18 16:34:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Federal vaccine mandates are immoral. https://t.co/2emONqdVZe","date":"Thu Feb 17 23:08:56 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SenateGOP has a very real chance of defunding @POTUS’s remaining vaccine mandates IF every Republican stays for the vote.","date":"Thu Feb 17 19:07:21 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Leftists at the Washington Post are trying to bully Justice Clarence Thomas again. When will they learn this doesn’t work? He’s his own man. His commitment to the Constitution and his judicial independence drive the left mad. He is a treasure to our nation. https://t.co/HM8bM0BSLk","date":"Thu Feb 17 17:13:43 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Freedom isn’t free. @EnesFreedom","date":"Thu Feb 17 15:58:28 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Colonel Gail Halvorsen, the Candy Bomber 1920-2022 https://t.co/tZKGrgaQzS","date":"Thu Feb 17 15:51:09 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Godspeed to the men and women of the 34th Fighter Squadron based at @HAFB. We are praying for you. We are proud of you. We are grateful for you.","date":"Wed Feb 16 21:56:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"An honor to host @EnesFreedom today. He has taken a noble stand against genocide in China. Proud he’s an American and taking a stand for freedom! https://t.co/KRkofPG32a","date":"Wed Feb 16 20:18:50 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thanks for stopping by, @EnesFreedom. Freedom is not free. https://t.co/CzV0VRY2G4","date":"Wed Feb 16 18:26:00 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Huge congratulations to both Alex and Nick who both call Utah home!","date":"Wed Feb 16 15:53:33 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Casey Dawson and his teammates! He makes Utah proud.","date":"Tue Feb 15 15:51:06 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Vaccine mandates are wrong. We should not fund the enforcement of mandates that deny American citizens’ rights and harm our economy. I’m proud to stand with American workers.\n\nhttps://t.co/01WnpxwsUI","date":"Mon Feb 14 22:33:07 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Hill Air Force Base again makes Utah proud! It is phenomenal to see Maj. Kristin Wolfe piloting an F-35 in today's moving flyover.","date":"Sun Feb 13 23:29:34 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Huge congratulations to Erin for this incredible, historic victory!","date":"Sun Feb 13 22:48:23 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is always a delight to join the Federalist Society at my alma mater. Utah’s legal community has a bright future. \n@FedSoc @BYU_FedSoc @BYULaw https://t.co/eMUgePXVLi","date":"Sat Feb 12 17:05:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I enjoyed an important conversation with local leaders on the front lines of Utah's rapid growth. Our state is in good hands.","date":"Thu Feb 10 20:36:09 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is a great win for religious freedom and higher education!#GoCougs #utpol\n\nhttps://t.co/dUnYcvQKR6","date":"Thu Feb 10 15:22:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Big congratulations to Utah-native, @nathanwchen on a stunning, gold-medal performance! https://t.co/94aSwuANuJ","date":"Thu Feb 10 14:55:24 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations, @blckriflecoffee! It’s always encouraging to meet with growing, patriotic, veteran-owned, Utah companies. https://t.co/QhaAtrHvbZ","date":"Thu Feb 10 14:52:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tonight at 5:30 PM MT for an Access Live Town Hall event. Register at https://t.co/qj2h8XMHpO to participate by phone, or ask your questions on Facebook Live during the event. Looking forward to talking with you! https://t.co/X6vDGJoGCu","date":"Wed Feb 09 20:00:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Park City’s Colby Stevenson on a remarkable, silver-medal-winning performance in big air! @colbyskier #olympics #utah #bigair","date":"Wed Feb 09 15:12:10 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Everyone has to eat. Runaway inflation caused by reckless government spending hurts poor and middle-class Utahns the most. I spoke with Brandon Peterson of Peterson’s Fresh Market in @RivertonUtahGov about inflation. #utpol https://t.co/3C5P746Pec","date":"Tue Feb 08 18:50:52 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/3D1EGKNPEd","date":"Tue Feb 08 13:46:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"As we celebrate the passage of 20 years since the opening of the 2002 @Olympics in Salt Lake City, we are awed by the world record performance by native Utahn, @nathanwchen. 113.97! Congratulations. Go for gold. #WinterOlympics","date":"Tue Feb 08 13:43:21 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is a win for American freedom. The IRS should never be Big Brother.\n\nhttps://t.co/b0rx5O4sNp","date":"Mon Feb 07 21:51:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Haven Barlow was a leader with a legacy. As the longest-serving state legislator in Utah history, a navy veteran, and a community leader, he was first and foremost an honorable, dedicated man. His legacy will remain with our state. Sharon and I mourn with the Barlow family.#utpol","date":"Mon Feb 07 15:47:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Go for gold, @TeamUSA. #WinterOlympics https://t.co/EuiI62EFwk","date":"Fri Feb 04 22:20:22 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations, @Lifetime, for growing your business and investing in Utah’s @ClearfieldCity!","date":"Thu Feb 03 16:45:58 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"My statement following the announcement by @POTUS to deploy additional troops to Europe. https://t.co/gZKGikznI6","date":"Thu Feb 03 00:31:25 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The national debt is now 30 trillion dollars. That is almost $90,000 per citizen. If you wanted to count to 30 trillion, you would have had to have started almost a million years ago.","date":"Tue Feb 01 22:49:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah’s Catholics are a vital part of our communities and key players in caring for the poor among us. It was an honor to speak to Bishop Solis of the @Diocese_of_SLC about what we can do to care for those in need. https://t.co/WQFaxvg91r","date":"Tue Feb 01 22:24:10 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Service is what Utahns do best. It is heartwarming to see so many get involved to help those in need in Tonga.\n\nhttps://t.co/BNdSrv0HCc","date":"Mon Jan 31 22:07:19 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Founders didn't intend to create and didn't want to create a national government with unlimited power.","date":"Fri Jan 28 14:25:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Holocaust was an unparalleled atrocity. The poison of antisemitism and hate must never be allowed to infect the heart of mankind. #HolocaustRemembranceDay https://t.co/EX542S8UuM","date":"Thu Jan 27 20:57:19 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Parents should be able to choose where their children go to school. Federal education dollars should follow students. It’s that simple.\n\n#SchoolChoiceWeek \nhttps://t.co/HPPsWE4Zs6\n@Deseret","date":"Thu Jan 27 17:03:35 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @USUAggies and the Aggie Creamery for a century of ice cream excellence”\nhttps://t.co/afOPGFsa2w","date":"Mon Jan 24 18:13:47 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The IRS must not become Big Brother. Instead of grabbing for even more sensitive data and invading the privacy of Americans, the Biden Administration should work on securing the data they have and investigating political misconduct within the agency.","date":"Sat Jan 22 13:48:49 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to my friend, @jordanbpeterson, for joining us for an insightful and important discussion.","date":"Sat Jan 22 01:19:39 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Life, liberty, and the pursuit of happiness are #WhyWeMarch because equality begins in the womb.\n#MarchforLife #ProLife https://t.co/DScarppHZU","date":"Fri Jan 21 13:00:02 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Real aid doesn’t do violence to women and girls. #prolife #marchforlife #whywemarch https://t.co/glCzp918mD","date":"Fri Jan 21 01:00:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The lives of babies and the dignity of women and girls are not political footballs. #prolife #whywemarch #marchforlife https://t.co/Y324kiR302","date":"Thu Jan 20 22:13:53 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am honored to receive an A+ from @SBAList and to join them in protecting life. \n\nLife is an unalienable right endowed by our creator. I will always stand to protect the unborn. https://t.co/ZXyKrTeQEY","date":"Thu Jan 20 15:18:56 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Senate rightly decided to keep the legislative filibuster. It protects the voice of millions of Americans. It keeps our laws and republic steady. It defends those not in the majority. I am glad to have cast my vote in favor of the rules and against this Democrat power grab.","date":"Thu Jan 20 04:17:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"\"A soul generated by love ...\" #MartinLutherKingJr #MLKDay https://t.co/uiZzDZ2RFZ","date":"Mon Jan 17 15:31:40 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Antisemitism has no place in America. I am thankful that prayers were answered and the hostages are now safe. Jewish congregations and communities must be safe to worship in this country.","date":"Sun Jan 16 13:20:13 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, @GovCox &amp; @LGHendersonUtah. #utpol https://t.co/W6ypif72XA","date":"Sun Jan 16 00:48:53 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I agree with ⁦@SenatorSinema⁩, the filibuster keeps our republic steady and strong. Without it, Utahns and Americans would be worse off. https://t.co/B6q3PTTsvK","date":"Fri Jan 14 01:02:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Federal bureaucrats don't have the power to make law. They tried with @POTUS's unconstitutional mandate and the Supreme Court shut that down. \n\nI’m joining @RodArquette next to discuss what happened and what that means for Utah. \n\nListen here: https://t.co/wTvJNrnZd3 https://t.co/qCdWUCctHE","date":"Fri Jan 14 00:03:51 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"#BREAKING: In a big win for the American people, the US Constitution, and for freedom, the Supreme Court has blocked President Biden's OSHA vaccine mandate. #SCOTUS https://t.co/UqjjWwy4dI","date":"Thu Jan 13 20:49:05 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Life costs 7% more nationwide, but that number is 8.6% in Utah and the Mountain West. @POTUS's reckless spending and poor management has made life harder on Utah families. #Bidenflation https://t.co/Eu3zzAO3Va","date":"Wed Jan 12 18:32:10 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"With empty shelves and life more expensive for Utah families, we must rein in #Bidenflation.\n\nhttps://t.co/Wgw1NEOIY1","date":"Wed Jan 12 14:44:42 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"🚨UPDATE: 6:35 PM MT.","date":"Wed Jan 12 01:03:27 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’ll be joining @RodArquette shortly to discuss what’s happening here in Washington. \n\nListen here: \n\nhttps://t.co/wTvJNrnZd3 https://t.co/OSViUW39BN","date":"Wed Jan 12 01:00:01 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":".@RogerMarshallMD is an Army veteran, a medical doctor, and a kind, smart person. Dr. Fauci should apologize for this insult.\n\nhttps://t.co/Ko8pH0zZfw","date":"Tue Jan 11 22:21:50 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join live!","date":"Tue Jan 11 17:27:20 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/4zrVhgH2bo","date":"Tue Jan 11 17:17:44 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you. \n#NationalLawEnforcementAppreciationDay https://t.co/VFHDA1wIH0","date":"Sun Jan 09 17:39:40 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Supreme Court heard arguments today on President Biden’s unconstitutional vaccine mandates. The Court should permanently halt the mandates and uphold American freedom.","date":"Fri Jan 07 18:54:51 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to this powerful partnership.","date":"Wed Jan 05 23:32:15 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"10 years ago on the floor of the Senate, I said that the world is a better place because of Haven Barlow and that he was a patriot and an example for all Americans to follow. Those words remain true now as I wish Senator Barlow the happiest 100th birthday! https://t.co/RXiPReqLEq","date":"Wed Jan 05 01:46:48 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/BIUKc409wh","date":"Tue Jan 04 15:33:22 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Statement on Senator Schumer’s rule change threat: https://t.co/114DfxPYyl","date":"Mon Jan 03 18:41:37 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, @Utah_Football. This season has been a thrill. Well done. #RoseBowl","date":"Sun Jan 02 02:25:39 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"Halfway there.\n#RoseBowl https://t.co/6VnLR1Estc","date":"Sun Jan 02 00:10:25 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/AvH1w7RtLs","date":"Sat Jan 01 00:38:43 +0000 2022","user_id":"88784440"},{"handle":"SenMikeLee","text":"I will miss Harry Reid, and will always count my friendship with him and his family as a profound blessing.\n\nhttps://t.co/diuPkovQSA","date":"Thu Dec 30 18:05:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sgt. Breanna J. Jessop, a native of Myton, UT, truly represents the \n@USArmy values and what it means to be a paratrooper and Sky Dragon \nSoldier. https://t.co/Ogl86j5AtH","date":"Wed Dec 29 15:20:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/lEL5SHtpiP","date":"Wed Dec 29 01:53:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Today we celebrate a tradition that unites. The Pledge of Allegiance is a statement of purpose and values that has stood the test of time. Happy Pledge of Allegiance Day!","date":"Tue Dec 28 18:11:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/PDPlyJlD1p","date":"Sat Dec 25 12:00:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"At this time of faith, family, and celebration, Merry Christmas!","date":"Sat Dec 25 03:30:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"As you travel this white Christmas season, be sure to check ahead, take precautions, and stay merry and safe!\n \nhttps://t.co/sN9xEn1RLy","date":"Fri Dec 24 11:44:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation is making this holiday season more expensive than ever. While the Federal Reserve has been reluctant to raise rates, Congress is also to blame. End the reckless spending.","date":"Thu Dec 23 23:31:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Friendly reminder that if you were to climb Mount Everest and drop a billion dollars for every foot of elevation, you would fall short of our national debt.\n#MountainOfDebt","date":"Wed Dec 22 01:17:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations, @USUAggies, for this well deserved designation.","date":"Tue Dec 21 03:48:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"4/4 https://t.co/vtsFctfwuq","date":"Mon Dec 20 19:05:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/4 It’s therefore odd that @SenSchumer is threatening to change the rules of the Senate immediately after realizing that he’s not going to get his way—either as to legislation he supports or as to his proposed rule changes—because most members of the Senate disagree with him.","date":"Mon Dec 20 19:05:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/4 Instead of publicly harassing my friends @Sen_JoeManchin and @SenatorSinema, Schumer would be better served by trying to find consensus within the Senate. He should also keep in mind that his efforts to nuke the filibuster will, if pursued, grind the Senate to a halt.","date":"Mon Dec 20 19:05:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/4 Today’s Senate is evenly divided — neither party holds a majority, much less the super-majority required to pass most legislation.","date":"Mon Dec 20 19:05:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Johnny was a beloved colleague, an absolute gentleman, and a dear friend. He made the Senate a better, more collegial place. Sharon and I pray for Dianne and their family. He will be missed.","date":"Sun Dec 19 16:53:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We honor all those who served and sacrificed at this special time of year. All those who wear or have worn the uniform deserve special remembrance at Christmas. Thank you to @WreathsAcross for this beautiful tradition. https://t.co/hTpwJ9xKT7","date":"Sun Dec 19 00:36:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Senate has unanimously passed my bill to honor Utah's Col. Gail Halvorsen, the \"Candy Bomber.\" https://t.co/mY1toXPdOo","date":"Sat Dec 18 16:21:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"As @BrighamPolice Chief Nelsen transitions into retirement, I hope he does so knowing that his community has prospered as a result of his service, and the memory of his servant leadership will live on. https://t.co/me6cyKfrjs","date":"Fri Dec 17 18:59:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Excited to welcome these athletes back to the fastest ice on earth as they prepare to qualify to represent @TeamUSA and @USSpeedskating \n\nhttps://t.co/BvI37ob0B9","date":"Fri Dec 17 17:25:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Good news as we head into the holidays—Utah’s unemployment rate is now significantly lower than before the pandemic began.","date":"Fri Dec 17 14:48:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations @UintaBasinRWY! https://t.co/qzo45aRf1u","date":"Thu Dec 16 17:56:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Snowplow drivers are some of the heroes of every Utah winter. Thank you for hard work and long hours keeping Utahns safe on the roads.","date":"Thu Dec 16 14:05:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to @UTHighwayPatrol for keeping Utahns safe and moving!","date":"Wed Dec 15 19:04:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/VXQm857nUZ","date":"Wed Dec 15 15:39:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah industry and science are helping us see the cosmos. Congratulations and thank you to Orem's @Moxtek.","date":"Wed Dec 15 01:14:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to ⁦@vistage⁩ for the chance to speak with a group of wonderful Utah CEOs! https://t.co/2GcZUJO4lJ","date":"Tue Dec 14 23:07:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This behemoth bill will do irreparable damage to our republic.\n\n#BuildBackBroke https://t.co/pIwcEXraNA","date":"Tue Dec 14 21:37:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"That’s 15,918,750,000,000 Chinese Yuan—figured we’d get the currency exchange out of the way up front.","date":"Tue Dec 14 16:20:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Worst inflation in decades, and Democrats want to borrow 2.5 trillion dollars more. When will it end?","date":"Tue Dec 14 16:11:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"USU’s Space Dynamics Lab is taking Utah’s pioneering spirit into the cosmos! Very excited to see how they to ensure that Utah and the US remain leaders in space-based technology and national defense in this partnership with the Air Force Research Lab. \n\nhttps://t.co/8XHCAbIHAJ","date":"Mon Dec 13 21:17:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to the National Guard on its 385th birthday! Utahn and American guardsmen play a key role in our communities and national defense.","date":"Mon Dec 13 19:44:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to a great American, Utahn, and statesman, Colonel Gail Halvorsen!","date":"Mon Dec 13 19:18:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Constitution is incredibly clear on who makes the laws in this country, it is Congress, not the President, or the Supreme Court.","date":"Fri Dec 10 15:02:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation is now at the highest level in almost forty years. In the Mountain West region, life is now 7.7% more expensive than last year.\n\n#Bidenflation","date":"Fri Dec 10 14:51:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This debt ceiling bill is a blank check for the Democrats' reckless tax and spending bill. https://t.co/aNYhbVDos7","date":"Thu Dec 09 23:01:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We should not be in the business of imposing this Administration's medical orthodoxy at the threat of taking away American paychecks.\n\nhttps://t.co/DQ4Nnl4h1j @csmonitor","date":"Thu Dec 09 19:43:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"45 million jobs are on the line. https://t.co/9eham6Vcja","date":"Wed Dec 08 23:45:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Only Congress can permanently stop @POTUS's unconstitutional, immoral vaccine mandate immediately. Now is our moment. https://t.co/7LPNJ3ukmB","date":"Wed Dec 08 23:19:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My name is Mike ... https://t.co/lbYRjZMDta","date":"Wed Dec 08 21:58:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Beaver County’s own Stetson Wright for an incredible ride.  @StetsonWright7 #NFR","date":"Wed Dec 08 18:51:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Watch live.","date":"Wed Dec 08 16:44:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Saule Omarova was a radical nominee who should have never been selected. \n\nHer desire to 'end banking as we know it' would have been disastrous for Utah and the nation. The American people can rest easier knowing she will never impose her dangerous agenda on our economy.","date":"Tue Dec 07 22:02:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @TheTabChoir for this amazing achievement!  No one does Christmas like Utah.\n\n@Ch_JesusChrist","date":"Tue Dec 07 21:34:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to Utah Solicitor General Melissa Holyoak for an update on the vaccine mandate cases. Together, we fight for the people of Utah. As I take to the Senate floor and push back against abusive overreach, it’s heartening to know Utah is standing with me. https://t.co/eQ3UwZ3miN","date":"Tue Dec 07 19:40:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah is making a strong appearance at Pearl Harbor to honor the 2,403 lives lost in the attacks 80 years ago.  \n\nThank you to Uintah High School’s band and orchestra, the Utah Pipe Band, and American Heritage High School’s Dance Team who will all be taking part from Honolulu.","date":"Tue Dec 07 17:03:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"#PearlHarborRemembranceDay #USSUtah @USSUtah https://t.co/6JLZwsQfaw","date":"Tue Dec 07 15:01:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We should not draft women, and I am glad that my efforts with Sen. Hawley have made that clear.\n\n@SenHawleyPress","date":"Tue Dec 07 01:32:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A Frankenstein bill to circumvent cloture would neuter the Senate. IT IS AKIN TO “NUKING THE FILIBUSTER!”","date":"Mon Dec 06 22:57:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @byusoccer_w on making it to the NCAA national championship! We will be cheering for you!","date":"Mon Dec 06 19:57:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 While I was serving as a Senate page in 1987, Senator Bob Dole (who was then serving as the majority leader) gave me an elephant-shaped keychain pendant with his signature engraved on the back of it. That keychain became one of my most prized possessions.","date":"Sun Dec 05 18:36:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Americans are fortunate to have been blessed by Bob Dole’s lifetime of military and government service. Today, my heart and prayers are with the Dole family.","date":"Sun Dec 05 18:36:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I stand with American workers against @POTUS’s unconstitutional, immoral mandates. \n\n#DefundTheMandates https://t.co/XDkGGukFcN","date":"Sat Dec 04 17:20:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"President Biden’s mandate is immoral, indefensible, unconstitutional, and illegal. https://t.co/Cit4Njl2fk","date":"Fri Dec 03 02:53:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank YOU for standing with the American people.","date":"Fri Dec 03 02:43:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We got a vote, and now American workers and families can see just where their Senators stand. I stand with them.\n\n#DefundTheMandates @RogerMarshallMD","date":"Fri Dec 03 01:40:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’ll stand with American workers every time. https://t.co/ssxLkfmuRN","date":"Thu Dec 02 22:48:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The American people have a right to know through our votes where we stand on @POTUS’s unconstitutional, grievous vaccine mandate. https://t.co/2aV2Vrhg5D","date":"Thu Dec 02 22:29:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We can fix this right now. Let’s have a vote right now. https://t.co/8eBFnC7NZy","date":"Thu Dec 02 22:18:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Merry Christmas and a million congratulations to my friend, @RepBlakeMoore and his family.","date":"Thu Dec 02 21:03:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me now as I chat live with @glennbeck about the Supreme Court. \n\n#ProLife #SCOTUS #ModernizeOurLaw\nhttps://t.co/VQ1YdbFY98","date":"Thu Dec 02 16:11:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me on Mark Levin this evening at 6:20 Mountain Time, 8:20 Eastern.\n\nListen live: https://t.co/49CzDGgotH","date":"Wed Dec 01 23:06:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Honored to receive the 2021 Quincy Award for Responsible Statecraft, in recognition for my National Security Powers Act. Congress must reassert its constitutional role over decisions of war and peace. \n\nThank you, @QuincyInst. https://t.co/8ejBmY4Zta","date":"Wed Dec 01 17:20:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Roe v. Wade is a tragedy. Today could be the beginning of its end.\n\n#ProLife #ModernizeOurLaw #SCOTUS https://t.co/x6IwsAZLbO","date":"Wed Dec 01 14:44:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me for a facebook live at the Supreme Court with Pro-life Utah President Mary Taylor at 7:15 AM Mountain Time.\n\n#ProLife #ModernizeOurLaw #SCOTUS\nhttps://t.co/gGDV6Grcgb","date":"Wed Dec 01 13:50:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Supreme Court’s abortion precedent is tragic.\n\n#ModernizeOurLaw #ProLife #SCOTUS https://t.co/Zp4AMMy2jV","date":"Wed Dec 01 00:30:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Dobbs case is about whether the people, through their representatives, should be able to decide how to protect human life.\n\n#ModernizeOurLaw #ProLife #SCOTUS https://t.co/ZPA4Xcolwk","date":"Tue Nov 30 22:55:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Hanukkah is a reminder of miracles and light. Hanukkah sameach to all who celebrate!\n#Hanukkah","date":"Tue Nov 30 02:18:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"From housing to healthcare, gas to groceries, reckless spending and overregulation are making life harder for Utah families.  #Bidenflation\n\nhttps://t.co/OpwbxAFgA5","date":"Mon Nov 29 21:17:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I couldn’t agree more. \n\nhttps://t.co/OFdzAdHaMu","date":"Mon Nov 29 20:37:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/xuJO0ebrln","date":"Thu Nov 25 14:00:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This account will now return to its regular @BYUfootball @BYUCougars @byuROC programming.  #GoCougs!","date":"Sun Nov 21 07:05:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SmithfieldFoods is generously donating 40,000 lbs of food to food banks in Oregon in honor of the game!","date":"Sun Nov 21 07:04:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Utes made it happen, and @utahfoodbank will be receiving a donation from @RonWyden and the people of Oregon. Thanks for stopping by and great game!  #GoUtes","date":"Sun Nov 21 07:04:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to @SmithfieldFoods for their generous donation to @utahfoodbank today and for joining our bet with @GoDucks and @RonWyden for today’s @Utah_Football game.  #GoUtes https://t.co/1ZP09HHTQ1","date":"Sun Nov 21 01:17:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"At last, a perfect moment to discuss the 1942 Supreme Court decision that stretched the Commerce Clause beyond its limits.","date":"Sat Nov 20 16:03:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The @Utah_Football uniforms for tomorrow's game are as moving as they are beautiful.\n\nWe honor all who served on @UUtah's Military Appreciation Night.\n\nSee you at the game!","date":"Fri Nov 19 16:57:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My STOP the GRINCH Act will ease our supply chain crisis and help Utah businesses and families get the things they need as we head into the holidays.  \n\nIt’s great having @WTCUtah’s help as we STOP the GRINCH and save Christmas!\n\n#utpol #STOPtheGRINCH \n\nhttps://t.co/mf4N8ciMc9","date":"Fri Nov 19 16:16:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Tomorrow is the day!  With over one hundred thousand pounds of food on the line, let’s go Utes!\n\n@Utah_Football #GoUtes @GoDucks @RonWyden @utahfoodbank @SmithfieldFoods","date":"Fri Nov 19 14:03:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Let’s save Christmas!  \n\nMy STOP the GRINCH Act will help ease pressures on rising prices and on our supply chain for the holiday season. https://t.co/uxorZ2QXdU","date":"Thu Nov 18 23:26:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Who do you think will win this weekend’s game against @GoDucks?\n\n@Utah_Football @utahfoodbank @SmithfieldFoods @RonWyden","date":"Thu Nov 18 18:19:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"While I bleed Cougar Blue, I’m a Utah man for this weekend’s game against @GoDucks.  Follow for updates on the \"bet\" with @RonWyden.\n\n#GoUtes @Utah_Football @utahfoodbank @SmithfieldFoods","date":"Thu Nov 18 13:46:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@Utah_Football @GoDucks @RonWyden @SmithfieldFoods @utahfoodbank Also thanks to @TillamookDairy, Farmers Ending Hunger, @oregonfoodbank, @foodforlc, and @hinckleyinst","date":"Wed Nov 17 18:01:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We decided to make things interesting.  \n\nFor this week’s @Utah_Football and @GoDucks game, @RonWyden and I are “betting” for charity.\n\nThanks to @SmithfieldFoods and @utahfoodbank https://t.co/SEKRL4K4BQ","date":"Wed Nov 17 17:57:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SecMayorkas would rather not comment on embarrassing immigration details.\n\n#immigration @DHSgov https://t.co/B6p60nsujS","date":"Tue Nov 16 18:16:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My team’s new research shows that while inflation hurts everyone, it hurts the poorest Americans the most.\n\n#Bidenflation #Inflation #Economy @JECRepublicans","date":"Tue Nov 16 15:03:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Fifth Circuit is right. This vaccine mandate is unconstitutional and wrong. \n\n@POTUS’s vaccine mandate has to go.\n\nhttps://t.co/g5cWQdTGbB","date":"Sat Nov 13 12:43:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah families are paying the price of @POTUS’s and Democrats’ reckless spending.  \nRein in spending = Rein in inflation\n\n#Bidenflation","date":"Fri Nov 12 19:45:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We honor all who served.\n#VeteransDay https://t.co/jzqs1HXoil","date":"Thu Nov 11 12:00:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah leads the way. https://t.co/7y6qI34a0s","date":"Wed Nov 10 21:31:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Energy is a major driver of this inflation. Biden’s energy policies have been DISASTROUS.\n\nShutting down Keystone, the moratorium on energy leases on federal land, begging OPEC to fill in the gaps. @POTUS has failed on energy, and Americans are paying the price.\n\n#Bidenflation","date":"Wed Nov 10 17:51:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Biden on inflation:\nIt’s not really there.🙅‍♂️\nto\nIt’s transitory; it’ll go away. 🤷‍♂️\nto\nInflation is a good thing.🙆‍♂️\nto\nOkay, inflation’s bad.🤦‍♂️\n\nAmericans have known and felt the harms of inflation for months now.  The answer is simple: STOP THE RECKLESS SPENDING!\n\n#Bidenflation","date":"Wed Nov 10 16:27:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Always faithful.\n\n#HappyBirthdayMarines","date":"Wed Nov 10 16:09:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Inflation just keeps getting worse. Last week's $1.2 trillion inflation bomb will inflict more damage on our carpet-bombed economy.","date":"Wed Nov 10 14:55:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is encouraging to see the Fifth Circuit stay @POTUS's unconstitutional vaccine mandate. It's now time for President Biden to make the right choice and rescind the mandate altogether.","date":"Sat Nov 06 21:24:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was glad to speak during the @UtahBusiness Economic Outlook Summit about what we can do to help fix supply chain and inflation difficulties for businesses and families.\n\n#UtahBusiness #utpol https://t.co/Fmx1ese2Jf","date":"Fri Nov 05 18:17:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’m not against the vaccine. I’m against this mandate. \n@ShannonBream @foxnewsnight @foxnews https://t.co/7x49UHJX7f","date":"Fri Nov 05 16:48:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/vHGlVLK5l6","date":"Wed Nov 03 22:09:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We don’t punish people for diverging from presidential orthodoxy. That’s why I am proud to sign this letter with Senator Marshall to defund President Biden’s mandate. \nhttps://t.co/vqY3frKrZ0","date":"Wed Nov 03 19:28:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"President Biden’s mandate is the most egregious incursion on the medical rights of Americans in our nation’s history.\nhttps://t.co/TqVG72AP5U","date":"Wed Nov 03 17:56:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"125 years ago and today Utah leads the nation in recognizing the contribution Women bring to our leadership. I look forward to welcoming Dr. Martha Hughes Cannon's statue to the Capitol soon, and thanks to @LGHendersonUtah for leading this recognition. #utpol","date":"Wed Nov 03 16:19:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SenSanders is right. Repealing the SALT deduction cap would protect high-tax states and politicians at the expense of states like Utah.","date":"Wed Nov 03 15:32:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Fry Sauce Heads to Silicon Valley.\n@tim_cook @apple https://t.co/9mtVrxvM4z","date":"Mon Nov 01 18:55:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My prayers are with Captain Bone's family. His service and dedication were sealed with his life. We honor him and those rescuers that served with him for all they do to serve our communities and our state.","date":"Mon Nov 01 15:52:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Our heated homes in the winter, the semiconductors in our phones, the batteries and fuel in our cars, and more, is all possible thanks to the men and women of our nation’s mining industry. Thank you @Utah_Mining. https://t.co/UaTxEMhRa1","date":"Fri Oct 29 21:25:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Our office Halloween Trick-or-Treat was a huge success! I’m lucky to have a staff with such wonderful families! https://t.co/71tcMoVKXX","date":"Fri Oct 29 18:52:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"President Biden is unrelenting in his disdain for the rule of law and those who support and defend the Constitution of the United States. \n\nhttps://t.co/FmfcWH1M04","date":"Fri Oct 29 17:56:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"These stories from our armed forces are tragic. I returned to the Senate floor today to help. https://t.co/ZnEFWEWzOz","date":"Wed Oct 20 21:10:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utahns know when something is wrong.","date":"Fri Oct 29 14:14:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is yet another deal that will make life harder for poor and middle-class Americans.\n\n@AmericaNewsroom @marthamaccallum @BillHemmer @FoxNews https://t.co/BnDmk0kkEH","date":"Thu Oct 28 15:17:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Attorney General Garland, I am increasingly concerned by the consistent overreach we are seeing from the Biden Administration. https://t.co/QkVmOVDY7q","date":"Wed Oct 27 21:52:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/cEaxMldN8S","date":"Wed Oct 27 21:03:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tonight at 5 PM MT for an Access Live Town Hall event. Register at https://t.co/qj2h8Xv61e to participate by phone, or ask your questions on Facebook Live during the event. Looking forward to talking with you! https://t.co/0VyipxdXZ8","date":"Wed Oct 27 19:15:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Jell-O is Back! https://t.co/eZr9aGM0iV","date":"Wed Oct 27 09:01:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"When the New York Times finally says it's bad ... It's bad. #Bidenflation","date":"Tue Oct 26 20:36:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was an honor to host Utahns from chambers of commerce across the state at the Taiwanese Ambassador's residence last night.  Thank you to @TECRO_USA and all who joined us. https://t.co/jZc5TIXGZB","date":"Tue Oct 26 19:31:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My dad once said, \"the mark that Glen Tuckett left on BYU's athletics is remarkable and may be unparalleled and historic.\" Today, my own thoughts and gratitude are with the Tuckett family and all @BYUCougars.","date":"Tue Oct 26 18:28:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"President Biden using corporate America to do his dirty work.\n@TGowdySC @FoxNews https://t.co/XpIkdAtNAi","date":"Mon Oct 25 21:59:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/yN26R8pvyV","date":"Fri Oct 22 19:56:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"There are a lot of things that give me optimism about this bill. I can't think of a better time in modern history.","date":"Fri Oct 22 18:35:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Good morning, St. George! \nI enjoyed my weekly chat with @949kdxu's Andy Griffin al fresco today. https://t.co/nQGC58qq66","date":"Thu Oct 21 14:04:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"These stories from our armed forces are tragic. I returned to the Senate floor today to help. https://t.co/ZnEFWEWzOz","date":"Wed Oct 20 21:10:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Gas to groceries, housing to healthcare, it is all getting more expensive. Reckless government spending is to blame.\n\nhttps://t.co/sUcAMxRsjw","date":"Wed Oct 20 17:26:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, @RepHarshbarger and all of the House cosponsors (including @RepChrisStewart). This bill would protect millions of Americans from @POTUS’s unconstitutional mandate.","date":"Mon Oct 18 18:21:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/oU9EbrJPC4","date":"Mon Oct 18 14:58:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/vyHdh69lAm","date":"Thu Oct 14 19:59:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thanks again to @tim_cook for a fantastic conversation. Among other things, I think we convinced @apple to include fry sauce in their cafeteria offerings.\n#SiliconSlopesSummit","date":"Thu Oct 14 19:58:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @KevinRobertsTX on the new post! @Heritage will be in very good hands.","date":"Thu Oct 14 14:56:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My prayers go out to Sergeant Newbold's family and the entire University of Utah community at this difficult time.","date":"Wed Oct 13 23:34:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Thank you to @Tim_Cook for joining me at @SiliconSlopes Summit 2021.","date":"Wed Oct 13 20:47:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Tim Cook: Listening to the reaction here, it might be the best decision I’ll ever make.","date":"Wed Oct 13 20:45:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Mike Lee: There’s something amazing we’ve developed here, over generations, it’s called fry sauce. I highly recommend it. Would you consider serving it in your dining areas?","date":"Wed Oct 13 20:45:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Mike Lee: I can’t live without my iPad. I take it with me everywhere, hearings, meetings. The only way I can read everything I vote on without carrying a truckload of paper, is on my iPad.","date":"Wed Oct 13 20:42:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Tim Cook to Mike Lee: Other than your phone, what would you say is the one piece of technology you can’t live without?","date":"Wed Oct 13 20:42:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Tim Cook: A privacy “back door” would be terrible for our consumers. You can’t make a “back door” for only the good guys. If there’s a door, anyone can find a way in.","date":"Wed Oct 13 20:41:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Tim Cook: I don’t have the ability to come into your house uninvited. I shouldn’t have the ability to get into your data.","date":"Wed Oct 13 20:40:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Tim Cook: We feel a significant responsibility for our customers to make sure they are taken care of with privacy. That’s why we believe in encryption. We don’t have the tools to unlock your phone. The only person with a key to your phone is you.","date":"Wed Oct 13 20:38:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS @SenatorLeahy Mike Lee to Tim Cook: Why is this such a priority for Apple and what do you make of the state of privacy protections today? What role does encryption play in efforts to protect user privacy?","date":"Wed Oct 13 20:37:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: We fought a revolution in part because of excessive intrusion into our privacy. Today, our personal details aren’t just in papers. They’re all over in our data. That’s why I worked with @SenatorLeahy to pass the USA Freedom Act which ended mass phone record collection.","date":"Wed Oct 13 20:36:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Tim Cook to Mike Lee: What’s your view on the dangers of unchecked data collection?","date":"Wed Oct 13 20:33:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: There’s always something you can find that interests you. A few weeks ago on a whim, I wanted to learn Morse code, it turns out there’s an app for that. We live in a time and age when you can do what interests you. If you want to learn or do something, you can.","date":"Wed Oct 13 20:32:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Tim Cook to Mike Lee: I’m so impressed by young people today — by their values, their ambition, their sense of purpose. What advice do you have for young people today looking to find their life’s work?","date":"Wed Oct 13 20:29:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Tim Cook: All too often technology gets lumped together with big tech. It’s easy to lump things together, but it’s rarely correct to do so. Just like you don’t want to lump people together, you don’t want to lump businesses together.","date":"Wed Oct 13 20:28:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Tim Cook: Robust tech competition is important. For any functioning market to continue innovating, you need competition. Our competitors make us a better company.","date":"Wed Oct 13 20:27:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee to Tim Cook: From your perspective, what’s the value of competition, and how can we make the technology space more competitive?","date":"Wed Oct 13 20:26:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: My Government Spectrum Valuation Act would help us give more broadband access to more people.","date":"Wed Oct 13 20:25:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: Permitting for broadband infrastructure can gum up the process. My UNSHACKLE Act would help that permitting get done faster to build out the necessary skeleton of our broadband system.","date":"Wed Oct 13 20:24:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: Innovation requires access to broadband. It needs to be able to work its magic everywhere. Rural, urban, and everywhere in between.","date":"Wed Oct 13 20:22:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: Utah has been an early pioneer in becoming a regulatory sandbox. Innovators can see where we are going better than regulators. New ideas are all too often restricted by burdensome regulatory environments. Utah is leading the way in giving new ideas regulatory freedom.","date":"Wed Oct 13 20:20:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Mike Lee: The youth of our state are one of our biggest advantages. We have a young population, a lot of people moving in, and a lot of people getting involved in tech to do good in the world.","date":"Wed Oct 13 20:17:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Ancestry @CanvasLMS Tim Cook: Four-year college is one path, but it’s only one. There are so many jobs that don’t require four-year degrees.","date":"Wed Oct 13 20:14:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes Tim Cook : @Ancestry, @CanvasLMS , and many other Utah tech companies represent what tech is about -- helping humanity move forward.","date":"Wed Oct 13 20:12:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes @Tim_Cook : “Utah truly deserves the name @SiliconSlopes.”","date":"Wed Oct 13 20:09:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes Mike Lee: “I always enjoy getting to introduce a friend to another group of friends. Nothing says entrepreneurship like @SiliconSlopes or @Tim_Cook. So I’m glad I could help bring these groups together.”","date":"Wed Oct 13 20:09:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@tim_cook @siliconslopes Josh James: “When it comes to technology, Senator Lee has worked to protect innovation, American ingenuity and competition that our entrepreneurs value.”","date":"Wed Oct 13 20:05:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Live highlights from my conversation with @Tim_Cook at @SiliconSlopes Summit 2021.\nThread 🧵.","date":"Wed Oct 13 19:59:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy Birthday, @USNavy! Thank you for 246 years of dedication, sacrifice, and service.  \n\nLooking forward to a bright future including USS Utah in the fleet.\n#246NavyBirthday","date":"Wed Oct 13 16:46:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@WilliamShatner to travel to space wearing a #MadeInUtah belt by @GRIP6_, headquartered in @MidvaleCity. \n\n#NewShepard @blueorigin https://t.co/8XlSv1u9WS","date":"Wed Oct 13 13:35:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read here to see how @Tim_Cook is an Apple Genius in more ways than one.\n\nAnd check back for live-tweet highlights from our conversation at 2:00 MT.","date":"Wed Oct 13 11:50:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy #NationalFarmersDay https://t.co/Jg8twYlYC8","date":"Tue Oct 12 21:50:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Looking forward to this conversation tomorrow!\n\n@siliconslopes @tim_cook","date":"Tue Oct 12 20:17:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This year’s @siliconslopes Summit will be incredible.  I’m glad to be speaking with my friend @tim_cook tomorrow about Utah’s growing tech influence.","date":"Tue Oct 12 13:34:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"And many great Utahns like @RepJohnCurtis and former Governor Jon Huntsman, Jr. served as missionaries there.","date":"Sun Oct 10 22:20:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah and @WVCUT have sister relationships with Taiwan.","date":"Sun Oct 10 22:20:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Wishing happiness to the people of Taiwan on their national day.  Taiwan is a friend of the United States and a friend of Utah.","date":"Sun Oct 10 22:20:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Taiwan is Utah's 5th largest trading partner.","date":"Sun Oct 10 22:20:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A Monumental Insult \nhttps://t.co/CpmCmW7ops","date":"Fri Oct 08 21:10:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I offered to work with @POTUS on a permanent legislative fix. Instead, he opted to ignore the people who live near these monuments and do it alone. His choice today continues the pendulum's swing.","date":"Fri Oct 08 19:17:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@POTUS called signing these monument declarations the easiest thing he’s ever done.  Unfortunately, to the countless Utahns whose livelihoods, communities, and property rights are discarded by these declarations, this is anything but easy.","date":"Fri Oct 08 18:33:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The DOJ must leave parents alone. https://t.co/WL9CGCp9XP","date":"Fri Oct 08 14:34:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I spoke with @POTUS today. I told him the monument announcement runs against Utahns' wishes. I explained that his decision is hurtful and contrary to the Antiquities Act's intention. I offered to work with him on a permenant legislative fix that would protect Utahns' interest.","date":"Thu Oct 07 23:27:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah Delegation Responds to Monument Announcement \n@SenatorRomney @RepChrisStewart @RepJohnCurtis @RepBurgessOwens @RepBlakeMoore https://t.co/RwRf2r2q13 https://t.co/nRCqDu191p","date":"Thu Oct 07 21:05:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We didn’t hire Secretary Austin to use the world’s largest military to scare us into taking his boss’s preferred political positions. He should never be taken seriously by Republicans again.","date":"Thu Oct 07 01:24:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congress and only Congress can make federal law under the Constitution.  Join me in exploring why.  @FedSoc \n\nhttps://t.co/R9Dy0nyMA5","date":"Wed Oct 06 22:06:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/Jwy25lR3KH","date":"Wed Oct 06 19:51:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"\"We're up to snuff, we never bluff, we're game for any fuss.\"\n\nA great morning spent with @PresidentUofU Taylor Randall. We talked sports, mandates, and tragedy. @UUtah is lucky to be led by Dr. Randall. https://t.co/vGhf05IDka","date":"Wed Oct 06 16:19:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"But when seated ... https://t.co/b2BnTulgtn","date":"Wed Oct 06 15:15:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In Utah alone, I have heard from no fewer than 184 people who are at risk of losing their livelihoods. Many of those who share these same concerns are our neighbors, they are everyday Americans, and they have legitimate medical concerns. https://t.co/sKY4xskK2y","date":"Tue Oct 05 22:31:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Ms. Haugen's response. https://t.co/jQBtfLvDzU","date":"Tue Oct 05 17:54:44 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Lee to Facebook whistleblower: \"I'm hoping you can shed some light ...\" https://t.co/JUdK0lB9S8","date":"Tue Oct 05 17:26:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Facebook would like nothing more than for you to think this is all about censorship so Republicans and Democrats can go back to fighting each other. Don’t take the bait. This is about fighting for our kids.\nhttps://t.co/27I4xUgJ19","date":"Tue Oct 05 15:34:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Harassment is NOT part of the process. \n@MorningsMaria on @FoxBusiness https://t.co/bNdh1t5iON","date":"Tue Oct 05 14:52:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"For too long, we have considered the Constitution as something only lawyers, judges, and especially Supreme Court Justices need to worry about. \n\nJoin me in exploring what makes our Constitution so successful, Line by Line.  @FedSoc \n\nhttps://t.co/hHbZzG1s2q","date":"Mon Oct 04 21:48:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Senator Sinema is a friend.  I am appalled by this behavior.  There is no place in civilized society for the type of harassment she suffered.","date":"Mon Oct 04 16:00:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I speak for a lot of people back home today, who are insulted by President Biden’s nomination of Tracy Stone-Manning to run the @BLMNational. https://t.co/5dDOh3JzoW","date":"Thu Sep 30 21:51:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/nGE98qEWEt","date":"Thu Sep 30 14:49:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We are talking about the taking of unborn human life. Innocent life, life of a being that has the right to exist, life of a being that would cry out in pain if it had the capacity to do so, but we can’t hear it. https://t.co/i6Uc1RPpXO","date":"Wed Sep 29 20:24:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was a treat to visit and exchange ideas with the mayors of @RivertonUtahGov, @southjordancity, @TvilleUT, &amp; @WVCUT. As well as chamber members from @stgeorgechamber, @DavisChamberUT, @SVUTChamber, &amp; @ChamberWestUT. https://t.co/jzL5cXBFQI","date":"Tue Sep 28 23:09:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Much can be done to keep Utah resilient through this drought and into the future. https://t.co/uDjM1tyhe8","date":"Mon Sep 27 13:40:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Utah's @tonyfinaugolf and @RyderCupUSA for a great team victory!","date":"Mon Sep 27 00:26:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My heart breaks at news that Aaron Lowe’s young life was cut so short. Sharon and I will mourn with the Lowe family as well as the Ute community that embraced Aaron as a teammate, student, and friend.","date":"Sun Sep 26 17:08:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations Dr. Stephens. This is most deserved. https://t.co/k5me2zs2LF","date":"Sat Sep 25 13:24:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am deeply saddened to hear of the death of Staff Sergeant Paul Lincoln Olmstead. He demonstrated bravery and dedication throughout his service and leaves a permanent legacy with the Utah National Guard. Sharon and I pray for his family.","date":"Fri Sep 24 20:03:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/1dH5eg3Vqu","date":"Fri Sep 24 17:02:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/LPMHppvpit","date":"Thu Sep 23 18:21:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Never, in our republic, should a president wield exclusive power over our nation’s wars.","date":"Wed Sep 22 14:06:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Facebook’s behavior that harms its consumers and subsequent failure to answer straightforward questions shows just how much monopoly power it has acquired. https://t.co/tPSQViwF5I","date":"Tue Sep 21 22:29:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tomorrow at 5 PM MT for an Access Live Town Hall event. Register at https://t.co/qj2h8Xv61e to participate by phone, or ask your questions on our Facebook Live during the event. Looking forward to talking with you! https://t.co/jfaXH5X76q","date":"Tue Sep 21 19:17:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’m Mike Lee, and I love the Constitution. \n\nhttps://t.co/SOkUCJ2bBM\n\n#ConstitutionDay","date":"Fri Sep 17 22:28:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/3cuycB4Q5q","date":"Fri Sep 17 14:22:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Made in USA is a win for everyone.  I'm glad this bill passed the Senate. https://t.co/QkT1D8jwYK","date":"Wed Sep 15 21:50:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"“On heaven’s scenes, you will find the streets are guarded by United States Marines.”\n\nSSGT Taylor Hoover 1990 - 2021 https://t.co/KNh0cUBXN5","date":"Tue Sep 14 20:14:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The President isn’t a King.  He shouldn’t be able to rule by decree on vaccines or anything else, not in America. https://t.co/gjvook4M8I","date":"Mon Sep 13 19:12:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Court packing is wrong.  Justice Breyer, Senator Biden, Justice Ginsberg all agree. https://t.co/KYlZ7Z8CXa","date":"Mon Sep 13 15:59:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We remember. https://t.co/reFP8I9fnN","date":"Sat Sep 11 14:07:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah has some of the nation’s best flight programs, and it was great to witness another fantastic program being developed in Carbon County. Thank you to @USUEastern and the Carbon County commissioners for showing me around. https://t.co/jhq7I81dn0","date":"Fri Sep 10 22:04:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utahns around the state will gather tomorrow to commemorate the lives lost twenty years ago. Here are some of the events happening near you. https://t.co/jedEFLk1nJ","date":"Fri Sep 10 17:45:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The @UintaBasinRWY project will invigorate the local economy and help solve current transportation problems. Thank you to Mark Hemphill of @RGPC_FortWorth and others for giving me an update on this important project. https://t.co/8uMF2BlMcf","date":"Fri Sep 10 14:55:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/jEyIdqIgL4","date":"Thu Sep 09 21:48:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy 97th Birthday to President Russell M. Nelson!  As a physician, professor, and a prophet, his life and service have blessed and continue to bless the lives of millions. https://t.co/a1MAyM0n6d","date":"Thu Sep 09 20:10:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Starting today, The Major Brent Taylor Foundation is hosting Weber Remembers: The 9/11 Project to commemorate the 20th anniversary of the September 11th. May we always remember those who were taken from us. https://t.co/Y9ouxbMWRP","date":"Thu Sep 09 18:19:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I had the pleasure of touring Intermountain Electronics with founder John Houston. For over 35 years, John has been helping develop and expand Carbon County’s technology economy. https://t.co/3XD9YHPVrZ","date":"Thu Sep 09 15:02:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Medical technology is always advancing, and many breakthroughs are happening here in Utah. I loved meeting with @VilexLLC in Park City and seeing their state-of-the-art implants firsthand. https://t.co/8izBo0qGcJ","date":"Wed Sep 08 21:20:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I had the honor of visiting Fort Duchesne and meeting with the Ute tribal leadership. We discussed many issues affecting the members of their tribe, including water rights and energy development. https://t.co/Pih308Z9N7","date":"Wed Sep 08 15:42:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A good teacher can inspire young minds to aim high. Utah students are fortunate to have teachers like Mr. Daniels. https://t.co/IrvsMqT28f","date":"Wed Sep 08 01:06:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"20 years ago, Carrie Pike, Beth Cole, and Sherry Poulson made grief teddy bears for the families of the first responders who died on 9/11. Today, they continue that effort by honoring the families of the 13 soldiers killed in Afghanistan. God bless them. https://t.co/VZbf79IwkO","date":"Tue Sep 07 21:11:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We had a great turn out at our town hall meeting in @cityofroosevelt. Many Utahns were concerned about the crisis in Afghanistan and how we can hold the Biden administration accountable. https://t.co/qy9TAHNXxk","date":"Wed Sep 01 20:23:18 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/cxRWG7teLm","date":"Mon Aug 30 21:55:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/7DNYhkXS1D","date":"Sun Aug 29 19:40:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/wR1WGyOGhW","date":"Sat Aug 28 00:19:44 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My prayers are with those killed and wounded in action today, their families, and their teammates still on the ground. Their sacrifice will never be forgotten.  It is our duty to protect those Americans still in Afghanistan and those who have helped us in this fight against evil.","date":"Thu Aug 26 19:23:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"/2 They are the incarnation of the words of America the Beautiful, \"Who more than self their country loved, and mercy more than life!\"","date":"Thu Aug 26 16:06:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/ God bless our troops, especially those in harms way in Afghanistan. This botched withdrawal and its effects are the worst kind of tragedy, one that was avoidable. Nevertheless our men and women in uniform do their duty.","date":"Thu Aug 26 16:06:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Each time you have a sip of milk, remember all it took to fill that glass. The Kohler family has been working hard in the dairy business for generations. Today, I witnessed that hard work first hand. @HV_Cheese @UtahFarmBureau https://t.co/dAPwywvaQQ","date":"Thu Aug 26 03:32:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The \"remain in Mexico\" policy is legitimate and successful tool to securing the southern border in a humane and considerate way.  The Supreme Court made the right call by determining the Biden Administration illegally rescinded it.","date":"Wed Aug 25 23:36:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am again reminded of Utah’s entrepreneurial drive to innovate and elevate. My thanks to @GRIPSIX’s Kevin, David, and company founder BJ for exemplifying this spirit and sharing their story. #MadeInUSA #MadeInUtah https://t.co/rd7OCEuIpk","date":"Wed Aug 25 14:51:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Trevor and Jenna were once themselves in dire straits, and now, over 3 million meals have been given to those in need. Their inspiring story of perseverance &amp; charity exemplifies the best of Utah values. https://t.co/wSTvYyBah9","date":"Tue Aug 24 15:43:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @tonyfinaugolf for his incredible 20-under-par win at the Northern Trust!","date":"Mon Aug 23 23:27:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Secretary Cardona and President Biden should be ashamed.  Using @usedgov as a weapon against states, like Utah, that have had some of the best education results during the pandemic is as wrong as it is low.","date":"Thu Aug 19 22:37:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SenRonJohnson and I will be submitting a detailed comment to Biden’s proposed open border regulation. It is shocking that any President would violate his oath of office and threaten U.S. sovereignty in this manner. Biden’s reckless action must be stopped.","date":"Thu Aug 19 21:50:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"/3 I pray for the safety of those Americans still in harm’s way, and I will continue to hold President Biden to account for this historic failure.","date":"Tue Aug 17 01:11:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/ After two decades of heroism from Americans in uniform, all is being undone in Afghanistan. Starting, expanding, and continuing a military conflict should never be easy, and these difficulties remind us that there were good reasons why the founders made it difficult","date":"Tue Aug 17 01:11:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/ to start a war. While it has long been the right policy to navigate a withdrawal from our nation’s longest war, the lack of adequate planning, security, and management has placed brave Americans and others at risk.","date":"Tue Aug 17 01:11:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Raising the debt ceiling after such thoughtless spending is carte blanche authority to continue destroying our fiscal future.  I am glad to have signed this letter saying I will have no part in it.","date":"Tue Aug 10 23:49:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Reckless Spending Must Stop. https://t.co/Qtnkf87blY","date":"Tue Aug 10 18:46:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/6DM1mXPFey","date":"Tue Aug 10 17:50:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@SenToddYoung is right. Altering your course often shows wisdom, not weakness. I look forward to more of my Republican colleagues demonstrating this same wisdom.","date":"Mon Aug 09 03:19:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’ve learned a great deal from my friend @GovMikeLeavitt over the years. I wish Mike and Jackie the best as they apply their leadership experience in expanding the mission of the @TheTabChoir","date":"Fri Aug 06 22:49:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to the next President of @UUtah, Taylor Randall. His leadership and experience as the head of @UBusiness will enable him to lead the University of Utah with excellence.","date":"Fri Aug 06 21:40:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We have to rely on what Wharton and the CRFB are telling us because it looks like we will never see a CBO score on this infrastructure package.","date":"Thu Aug 05 19:29:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/TshdUXhAVU","date":"Wed Aug 04 01:01:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"For months, we’ve been told this $1.2 trillion deal was 90% complete. Still, not a single page has been made public. WHERE IS THE BILL?","date":"Sun Aug 01 23:44:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"If your government wanted to spend $1.2 trillion, you’d want to see some of that in writing, right? Me too. WHERE IS THE BILL?","date":"Sun Aug 01 23:43:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Remember that $1.2 trillion “infrastructure” vote in the Senate the other day? We still haven’t seen a single page. WHERE IS THE BILL?","date":"Sun Aug 01 23:41:36 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations, @mykaylaskinner!","date":"Sun Aug 01 15:13:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/WgniBvYDYg","date":"Sun Aug 01 00:44:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"When Utah’s sons and daughters reported to Washington DC to protect the Capitol, they did so out of a commitment to duty and patriotism. Voting today to support the National Guard was a vote to protect and defend the constitution of the United States. https://t.co/bBklqsuHQG","date":"Thu Jul 29 20:41:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/pWfTDMyd6A","date":"Wed Jul 28 20:55:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/89DF21G81A","date":"Tue Jul 27 22:00:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sec. Haaland on Tracy Stone-Manning: \"I didn't nominate her.\" https://t.co/Yjv9UH6QrB","date":"Tue Jul 27 16:56:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me live tomorrow at 5 PM MT for an Access Live Town Hall event. Register here at https://t.co/qj2h8XMHpO to participate by phone, or ask your questions on Facebook Live during the event. Looking forward to talking with you! https://t.co/CTnKbZqJS3","date":"Tue Jul 27 15:00:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My heart is heavy as we mourn the loss of the great Mike Enzi. He was a friend to the west, a friend of freedom, and a friend of mine. Mike’s kindness and quiet dignity were worthy examples for us all. I pray for his wife Diana and their family. I will miss my friend.","date":"Tue Jul 27 14:08:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Let me share with you why I chose to receive the COVID vaccine. https://t.co/IWhP1qbpcr","date":"Mon Jul 26 20:33:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am saddened to hear of both the deadly crash involving three missionaries in New Mexico as well as the devastating pileup near Fillmore. Those affected and their families are in my prayers.","date":"Mon Jul 26 15:28:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy Pioneer Day https://t.co/4dEaHVIGqK","date":"Sat Jul 24 13:59:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/LgfudhqQmW","date":"Fri Jul 23 16:27:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy President M. Russell Ballard Day, Utah! https://t.co/yW33mW2xBB","date":"Fri Jul 23 15:59:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Tracy Stone-Manning has lied to the Senate and apparently the White House in what they have dubbed a “massive vetting failure.”  We can’t continue the failure by letting her care for 42% of Utah. https://t.co/xFOalI14gk","date":"Thu Jul 22 17:30:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Whether through presidential pressure or disguised as a partisan commission, court packing was and is wrong.","date":"Thu Jul 22 17:25:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I'm glad to be working with my colleagues across the aisle to restore war powers to Congress, where the Constitution says they belong.  @SenSanders @ChrisMurphyCT https://t.co/Z69nlH36M9👍👍/","date":"Wed Jul 21 21:23:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/3el9gojtj5","date":"Wed Jul 21 16:58:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@LeaderMcConnell is right—no raising the debt ceiling. \n\nBiden’s admin is refusing to even tell the Senate when the money runs out. We invited @SecYellen to brief us so she could talk and we could listen. She declined!","date":"Wed Jul 21 16:58:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Tracy Stone-Manning has lied and covered up her involvement in eco-terrorism at every opportunity. We cannot entrust her with managing 42% of Utah.","date":"Wed Jul 21 14:30:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The only thing more troubling than Critical Race Theory in public schools is Miguel Cardona mandating that it be there.  These decisions should be handled by states and communities not the federal government.  I’m glad to see Sec. Cardona U-turn. https://t.co/WOocnt46Xy","date":"Mon Jul 19 13:30:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Every trip to the grocery store, it's getting harder to fill cupboards, refrigerators, and bellies due to runaway federal spending.  \n\nhttps://t.co/32OtxRrKgy","date":"Sat Jul 17 15:11:36 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Tracy Stone-Manning should not be entrusted with caring for almost 250 million acres of federal land. https://t.co/g5rRWjOIUv","date":"Sat Jul 17 13:27:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Government should be in the business of protecting speech - not suppressing it. https://t.co/PfSQiLvsdS","date":"Fri Jul 16 21:15:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy to host the Sixth Annual #FlavorsofUtah along with the @utahfood, @associated_food, @ZionsBank, and @Ch_JesusChrist. This year, we honored the My Hometown Initiative in @WVCUT by distributing Utah products to the community! https://t.co/wDuECeWvOh","date":"Fri Jul 16 19:30:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Lee-@SenRubioPress amendment would have ensured that the credit goes to taxpayers, and would have resulted in monthly advances of $290-$375.\n\nIf Democrats had broken rank, working families would be in a stronger position today.","date":"Fri Jul 16 14:47:44 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"If you’re one of the 39 million households receiving their first Child Tax Credit payment today, don’t forget that every single Democrat voted against making it larger.","date":"Fri Jul 16 14:42:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The problem of runaway spending is no longer generations away. It’s now reached its hand into our wallets, our families, and our day-to-day lives. https://t.co/DW4fmqMN7Q","date":"Thu Jul 15 21:51:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Welcome to Utah, Rosalyn!  Thank you for sharing your love and appreciation for those who dedicate their lives to their communities.  We stand with you.","date":"Thu Jul 15 20:09:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Yeah ... With good reason. #Bidenomics   https://t.co/DrRO9nsNqp","date":"Wed Jul 14 19:45:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"9/ Yet, after all of this, Stone-Manning lied in sworn testimony to the Senate Energy and Natural Resources Committee stating that she had never been the subject of a criminal investigation, and that tree spiking was “alleged.”\nhttps://t.co/7446NnFfPq","date":"Wed Jul 14 15:55:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"/11 Tracy Stone-Manning is a radical in policy and practice. Both her assistance to an eco-terrorist group and lying about her involvement constitute sufficient reason to reject her nomination to care for almost 250 million acres of federal land.","date":"Wed Jul 14 15:55:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"10/ Department of Interior public servants should not be required to serve under someone who helped endanger and threaten them and their colleagues.","date":"Wed Jul 14 15:55:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"8/ After Stone-Manning sent the letter, the FBI investigated the group. Stone-Manning stonewalled the investigation leading to years of delay. Once the government’s case against the group solidified, she traded testimony for immunity.","date":"Wed Jul 14 15:55:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"7/ And that the group had driven “five hundred pounds of spikes” into trees. Tree spiking is hammering metal spikes into trees to make felling and processing dangerous. Spikes can shatter chainsaws and mill blades and maim or kill lumber workers.\nhttps://t.co/Onpqfr1WHw","date":"Wed Jul 14 15:55:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"6/ The letter stated, “you would have to find me first and that could be your WORST nightmare, (sic)” and finished in, “P.S. You bastards go in there anyway and a lot of people could get hurt. (sic)”\nhttps://t.co/ajiofLLXGg","date":"Wed Jul 14 15:55:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"5/ Stone-Manning retyped the threat letter on a rented typewriter because, in her own words, her “fingerprints were all over the original.” \nhttps://t.co/n4uBnQqFo5","date":"Wed Jul 14 15:55:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/ Earth First! defined itself as an action group that engaged in everything from grassroots organization to “monkeywrenching,”","date":"Wed Jul 14 15:55:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"4/ It defined “monkeywrenching” as, “unlawful sabotage of industrial extraction and development equipment, as a means of striking at the Earth’s destroyers where they commit their crimes and hitting them where they feel it most.”\nhttps://t.co/TIBgCvnZxq","date":"Wed Jul 14 15:55:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/ If lying to the U.S. Senate were not enough to disqualify Tracy Stone-Manning from running the BLM, supporting criminal eco-terrorism definitely should be. Thread:","date":"Wed Jul 14 15:55:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/ In 1988 Ms. Stone-Manning moved into a house with members of Earth First!, an eco-terrorist organization. She edited the group’s newsletter and sent a threat letter to the Forest Service.","date":"Wed Jul 14 15:55:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The path forward will not be found in tearing down the precious truths and beliefs that unite us. Instead, it will be building on their sure foundation. https://t.co/0jYQOEh9Y4","date":"Wed Jul 14 14:39:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"$3.5 trillion in new spending is $3.5 trillion too much and $3.5 trillion we don’t have.","date":"Wed Jul 14 01:54:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great meeting with @uac29, @DavisCountyComm, @UtahCountyGov, @cachecounty, Tooele, &amp; Rich Counties today. We discussed national defense, wilderness areas, affordable housing, &amp; the burden of bureaucracy. We are blessed to have great leaders across Utah. https://t.co/xxBJfDvKbu","date":"Tue Jul 13 22:03:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The drafters of our Constitution recognized the importance of free exercise of religion by stating it in the First Amendment, and I am inherently skeptical of any legislative efforts that threaten to weaken that right.","date":"Tue Jul 13 20:36:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am happy to have participated on a panel for the Future of Religious Freedom in the Americas hosted by BYU Law International Center for Law and Religion Studies (@iclrsorg) and @ADFIntl today. https://t.co/KYnAwBRAun","date":"Tue Jul 13 20:36:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Jeff and Cheryl Flake are dear friends and honorable people. They will represent the United States well in this critical role in an important time. President Biden shows wisdom in choosing them. https://t.co/p8oiFKhVHT","date":"Tue Jul 13 20:05:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @WestHighSLC Class of 2021 graduate, Barbara Stanley! “Once a panther, always a panther.” https://t.co/3ddaK7JTaE","date":"Tue Jul 13 15:30:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah families have been concerned about and paying the price of inflation for months.  Unfortunately, the Fed doesn’t seem to share that concern.  Maybe that’s why J. Powell hasn’t responded to my letter asking why he urged the printing of trillions of dollars. https://t.co/z1GAEmsDiH","date":"Tue Jul 13 14:13:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is an amazing story of how #socialcapital started in @MidvaleCity can end up serving kids all over the globe. Here’s to another 20 years @eyecare4kids!","date":"Mon Jul 12 19:23:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Cuban people today recognize the failings of dictatorship and communism.  We stand with them in their striving for freedom.\n \nEl pueblo cubano hoy reconoce las fallas de la dictadura y el comunismo.  Les apoyamos en su anhelo de vivir libres.","date":"Mon Jul 12 16:43:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"While the mask mandate stands, families with young or disabled children are put in an often impossible situation.\n\nThat is why I went to the Senate floor to end the mandate. https://t.co/WlcveUD2vg","date":"Fri Jul 09 17:37:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We should be celebrating diversity. Critical Race Theory doesn’t celebrate diversity; it weaponizes it. That’s bad for America, and it doesn’t heal the wounds that need to be healed. https://t.co/ADOd2nI5VB","date":"Fri Jul 09 15:26:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Is the Biden Administration nostalgic for the good old days when OPEC called the shots? https://t.co/fSRuIRdKEK","date":"Thu Jul 08 20:43:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Religious groups must be free to teach their beliefs without fear of government retaliation. @PrayVoteEngage  https://t.co/SCT3QqPX11","date":"Thu Jul 08 16:26:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am glad to see that after receiving our letter, the #IRS  reversed course on what would have been a dangerous and discriminatory decision. https://t.co/CzUyEyeB2e","date":"Thu Jul 08 16:26:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/QYmv5bsoPL","date":"Wed Jul 07 16:23:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The PVSA and Jones Act are not “America First.”  These laws represent protectionism at its worst by increasing costs and reducing competitiveness.  We should repeal them both. https://t.co/DW07TDWmIn","date":"Tue Jul 06 16:55:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Wonderful day at the #Freedomfestival in @provocity! https://t.co/YpKmgwsUit","date":"Mon Jul 05 19:17:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"245 years ago today, the greatest, freest, and most prosperous country in the history of mankind was founded. Happy Independence Day! https://t.co/ORffkPZ1cm","date":"Sun Jul 04 12:33:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Jones Act hurts Americans and our competitiveness abroad.  It’s time to end this legal anachronism.","date":"Thu Jul 01 21:53:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The best way to calm fears about COVID vaccines is to be open and forthcoming about possible side effects. My letter with @SenRonJohnson asks the @CDCgov and @US_FDA to do just that. https://t.co/J8AeWluHcI","date":"Thu Jul 01 13:46:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/SKjQ6djxGJ","date":"Wed Jun 30 20:47:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We can all agree that businesses shouldn’t squelch competition or lie to consumers.  At the @EPPCdc Big Tech symposium, I shared ideas on how we can make sure Big Tech follows the rules.","date":"Wed Jun 30 20:40:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was a pleasure meeting with @UdoSoftware. It’s always good to see Utah leading through innovation. https://t.co/dYNHiN32rK","date":"Tue Jun 29 20:50:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Combining my two loves - ice cream and the Founding Fathers. Fun day with @glennbeck, @SeanReyesUT, @DavidOsmond1 , @DowdleEric, @JakeBequette91 and @RodArquette. Special thanks to the Brooker Family of Brooker’ Founding Flavors. https://t.co/HJue0MfP8N","date":"Sat Jun 26 15:06:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to @ProsperityUtah for the work you do in promoting market-based solutions here in Utah.","date":"Sat Jun 26 01:51:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/h2oekO4f4U","date":"Fri Jun 25 21:30:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am disappointed to see @FTC Chairwoman Khan already moving to undo an important, bipartisan antitrust policy agreement. https://t.co/0D18C7gh4L","date":"Fri Jun 25 15:16:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My amendment would transform this program into a transparent informational resource for farmers, ranchers, and private foresters. https://t.co/nspmuNhZ5Q","date":"Thu Jun 24 15:35:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/LVxgaKccrN","date":"Thu Jun 24 15:00:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I strongly oppose the nomination of David Chipman for Director of the @ATFHQ. https://t.co/HSFTxG24MS","date":"Thu Jun 24 14:03:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/11d7ruMtmV","date":"Wed Jun 23 22:15:47 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"With the vaccine now free and widely available, Americans should be able to choose for themselves whether to receive it, whether to wear a mask, or whether to take their own precautions. https://t.co/MzKGcKpvyB","date":"Wed Jun 23 21:18:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"“… we have to remember that this would have arranged for taxpayer dollars to fund campaigns.” @seanhannity https://t.co/lVIBuijJ3U","date":"Wed Jun 23 15:50:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 My bill would protect the opportunity of girls to athletically compete against other girls. If passed, women and girls would be ensured a full and fair chance for athletic achievement. https://t.co/JIZzo5bXqO","date":"Wed Jun 23 15:35:36 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Title IX recognizes that women and men are different yet deserving of equal opportunities. The Biden Admin’s efforts to alter Title IX threaten athletic opportunities for all women and girls. #WomenDeserveBetter #SaveWomensSports","date":"Wed Jun 23 15:35:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"ICYMI: S.1 would make election fraud easier to commit and harder to detect by allowing vote trafficking &amp; undermining popular voter ID laws. @marklevinshow https://t.co/h5eCp1pe4E","date":"Tue Jun 22 23:49:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"ICYMI: S.1 is not about voting rights – It is a politically motivated federal takeover of the election system. @RichardGrenell @newsmax https://t.co/AgUGQEun5M","date":"Tue Jun 22 21:55:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Everyone has reason to worry when the government doesn’t respect its own boundaries. Due process and basic constitutional protections should not depend on which political jersey you wear. https://t.co/ZrVGMFJB7x","date":"Tue Jun 22 19:21:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is an incredible accomplishment! Congratulations to @HerrimanHS and @HerrimanCity! #Rugby","date":"Mon Jun 21 18:03:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was a pleasure to host my GOP colleagues today with a meal served by Utah’s @IdleIsleCafe. https://t.co/bJTVCPPnfu","date":"Thu Jun 17 21:53:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This bill won’t make it easier to vote – it will make it easier to vote illegally. https://t.co/Pty4s6ePdb","date":"Thu Jun 17 21:08:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Faith-based adoption agencies provide invaluable services to our country. The Supreme Court’s unanimous decision in Fulton v. Philadelphia rightly recognizes that the govt can’t interfere with religious organizations based on faith. A great win for children and religious freedom.","date":"Thu Jun 17 19:45:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/MWsg7twn4A","date":"Thu Jun 17 19:45:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The spirit of #Utah is born from a rich history of hard work, industry, innovation, and ingenuity. Few individuals embody this spirit more than the late Obert Clark Tanner of the @octjewelers. https://t.co/nSaJsYUsmW","date":"Thu Jun 17 18:07:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@WVCUT‘s #OperationMyHometown is a neighborhood improvement coalition made up of residents, city workers, and volunteers. It runs entirely on private initiative and volunteerism—two of Utah’s hallmark strengths. In typical #Utah fashion, it’s neighbors coming together. https://t.co/bgJreHU2x1","date":"Thu Jun 17 18:06:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"As @IdleIsleCafe celebrates its one-hundred-year anniversary this year, it is worth recognizing all the good it has done for #Utah and for @BrighamCityCorp. https://t.co/oPPBPvmML1","date":"Thu Jun 17 17:59:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In @SenateCommerce markup, we debated a @SenRickScott amendment to repeal the CDC’s COVID-19 mask mandate for public transportation. I fully support this effort to promote sound science and common-sense decision-making. https://t.co/oDJoO5QsYw","date":"Thu Jun 17 15:28:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to my friend and his growing family!","date":"Thu Jun 17 14:48:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In the face of the China challenge and post-pandemic recovery, we must work to secure US-UK free trade. As Prime Minister @BorisJohnson said, \"The US and the UK have an indestructible relationship.” https://t.co/WzKFQE0Qjk","date":"Tue Jun 15 22:02:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I went to the border in March and saw this crisis first hand. https://t.co/o6fo355wR7","date":"Tue Jun 15 19:42:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The TEAM Act improves federal antitrust enforcement for the entire economy, without making government bigger.\n\nWe don’t need a bigger government—we need to make the one we have work better. \n https://t.co/CfzI2EUckG","date":"Mon Jun 14 20:57:47 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Valley Forge, Custer's ranks,\nSan Juan Hill and Patton's tanks,\nAnd the Army went rolling along\nMinutemen, from the start,\nAlways fighting from the heart,\nAnd the Army keeps rolling along.\n\nHappy 246th Birthday to the @USArmy. This We’ll Defend.","date":"Mon Jun 14 16:22:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I pledge allegiance to the Flag of the United States of America, and to the Republic for which it stands, one Nation under God, indivisible, with liberty and justice for all. #FlagDay https://t.co/buP2obntvx","date":"Mon Jun 14 15:16:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Anna Camp-Bennett and the entire @BYUTFXC team!","date":"Sun Jun 13 19:04:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Want proof the Passenger Vessel Services Act benefits Canada at the expense of U.S. jobs? Officials in British Columbia are (rightly) concerned about my bill(s) to let ships exclusively serve U.S. ports. The PVSA is not \"America First.\" Repealing the PVSA is \"America First!\"","date":"Sat Jun 12 16:05:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Brad Bonham and the whole @walkeredisonco family on opening their new Global Headquarters in @CityWestJordan. I trust Walker Edison will be an incredible anchor to West Jordan's impressive business community. Thank you for @makeawishutah for being involved! https://t.co/OnuYrwiAoH","date":"Fri Jun 11 22:20:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to @rudygobert27 of the @utahjazz on winning the NBA's Defensive Player of the year &amp; @JordanClarksons 6th Man of the Year win! Good luck tomorrow. Let's do this!  #Takenote","date":"Fri Jun 11 16:40:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"If we truly seek to empower women in the workplace, we ought to help give them the freedom and flexibility to pursue the careers and the families they desire.\n\nThe Working Families Flexibility Act would do just that. https://t.co/PRIQrMJ6mx","date":"Thu Jun 10 18:09:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"EDIT: 101","date":"Thu Jun 10 00:24:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"As India fights its #COVID19 crisis, it's important to continue to share extra US #covidvaccines to help our friends and important ally. A return to normalcy and an eventual end to this brutal pandemic will require some global cooperation.","date":"Wed Jun 09 18:19:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2.4 miles of swimming. 112 miles of biking. 26.2 miles of running. Everyday for 100 days. @IronCowboyJames’ accomplishment is truly incredible and shows that through commitment, hard work and sacrifice, you truly can accomplish anything.","date":"Wed Jun 09 16:44:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s far past time we stop funding a system that excludes parents and hurts disadvantaged children, and instead empower students and their families with options that best meet their unique needs. #ChoiceAct https://t.co/9ZwBLst4xg","date":"Tue Jun 08 21:54:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We need to ensure that our education funds are actually made available to students and families of all stripes. #ChoiceAct https://t.co/qpDdgv5F4t","date":"Tue Jun 08 21:44:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I urge my colleagues to reject the Endless Frontier Act https://t.co/0daRk2lNpC","date":"Mon Jun 07 16:55:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is what a cartel looks like. https://t.co/yZeP6ohXRT","date":"Mon Jun 07 13:52:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, Cpl. Pullan. #GreatestGeneration \n\nhttps://t.co/xWRHtmYNbA","date":"Sun Jun 06 22:44:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Amazing season, @SnowCollegeFB. The @NJCAAFootball championship eluded us this year, but winners get right back up and keep fighting. See you in the fall. #BadgerUp","date":"Sun Jun 06 22:42:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 AGAIN, Americans do not want to see their taxpayer dollars used to destroy, experiment on, or unethically alter human life. #ProLife @CWforA https://t.co/gTBuHwzyh2","date":"Fri Jun 04 17:21:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 The Endless Frontier Act authorizes over $80 billion without any ethical guardrails or protections for the earliest stages of life, or any protections for the conscience rights of American taxpayers.","date":"Fri Jun 04 17:21:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am inspired by Berni and JoAnn’s desire to serve. Utah is blessed to have citizens who make our communities wonderful.","date":"Thu Jun 03 20:02:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We cannot beat China by trying to be China. Listen to my conversation with @glennbeck. https://t.co/3gjXDY4Mt6","date":"Wed Jun 02 20:53:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"On this Memorial Day, we have the opportunity once again to acknowledge the debt we owe to those men and woman who answered the call, donned the uniform, and gave all so that we might be free. https://t.co/TjL98wZM7q","date":"Mon May 31 14:39:28 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/3zWkqUkZyn","date":"Fri May 28 20:06:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"On Wednesday, I raised concerns about access at @ZionNPS. I’m grateful that the message was heard and that park service has taken necessary steps to address the issue. https://t.co/kWZEWdVTjG","date":"Fri May 28 17:57:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations @OrrinHatch on receiving the Canterbury Medal for the “Courage and Defense of Religious Liberty.” I can think of no one more deserving.","date":"Fri May 28 17:22:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Two paths lie before us, I urge my colleagues to choose the better path, and reject the Endless Frontier Act. /11","date":"Wed May 26 21:19:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to strengthen markets, not government. 10/","date":"Wed May 26 21:19:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to encourage entrepreneurship, not crony capitalism. 9/","date":"Wed May 26 21:19:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to partner with our allies, not restrict fair trade. 6/","date":"Wed May 26 21:19:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to value families, not diminish them. 8/","date":"Wed May 26 21:19:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to use our critical minerals, not let them languish. 5/","date":"Wed May 26 21:19:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to decrease regulation, not invest in regulatory bodies. 3/","date":"Wed May 26 21:19:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We ought to simplify and cut taxes, not off-shore our jobs. 4/","date":"Wed May 26 21:19:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Instead of chilling innovation and competition, we ought to decentralize power and champion trust in the private sector. 2/","date":"Wed May 26 21:19:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The strategy of the Endless Frontier Act is rooted in the belief that our markets have failed us, and the only means by which we can jumpstart our economy and create innovation is by trusting in federal government bureaucrats. 1/ https://t.co/cVquGMdV0l","date":"Wed May 26 21:19:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I find this statement by ATF nominee David Chipman incredibly troubling because – setting aside 2nd Amendment issues – this violates our constitutional requirement for due process.","date":"Wed May 26 17:45:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 “while at ATF I conducted studies involving people who failed background checks to determine how many later committed crimes with a gun – many did.  This is a perfect opportunity to arrest people BEFORE committing crimes rather than responding after the fact.” https://t.co/V4nygTspG2","date":"Wed May 26 17:44:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Inflammatory statements like these from a nominee to become the ATF Director are extremely concerning.","date":"Wed May 26 17:44:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 In an article in The SLT on Jan 29, 2019, ATF nominee David Chipman was quoted as saying, “The only people that benefit from [legislation making it easier for Americans to purchase silencers] are gun lobbyists and criminals who want easier access to deadly weapons.” https://t.co/aM9ZH04lAR","date":"Wed May 26 17:43:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to former @CCHSFOOTBALL_  QB @JaxsonDart on winning the Gatorade National Football Player of the Year! Your grit on the field and service in the community showcase the best of Utah. #GatoradePOY","date":"Wed May 26 15:08:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Bezos. Jeff Bezos.","date":"Wed May 26 14:14:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 My amendment would simply prohibit any research funded through the Endless Frontier Act from using fetal tissue obtained from an abortion; and from creating, destroying, discarding, or putting human embryos at risk. #ProLife","date":"Tue May 25 22:34:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Many Americans do not want to see their taxpayer dollars used to destroy, experiment on, or unethically alter human life. And they should not be forced to. #ProLife https://t.co/tPV1ztwCjK","date":"Tue May 25 22:34:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s great seeing Utah sports back in play. What a catch!!!","date":"Sun May 23 23:48:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"\"Lee said sentences must be proportional to the severity of the crime because if they’re not, the criminal justice system loses its sense of legitimacy.\"","date":"Fri May 21 16:20:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The critical race theory that undergirds the ... proposal does not celebrate diversity; it weaponizes diversity. https://t.co/j4erwtOc61","date":"Thu May 20 16:29:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"There is still time to register – see you in 2 hours!","date":"Thu May 20 15:00:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My office presented a Congressional Record of recognition to Maj. Gen. Michael J. Turley &amp; the @UTNationalGuard for their service in protecting our nation’s capital &amp; providing relief work during the COVID pandemic. I am thankful for their selfless desire to serve. https://t.co/l5GHYNyP2H","date":"Wed May 19 21:17:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We must stand with our strongest democratic ally in the region by recognizing their right to self-defense against terrorism. Furthermore, U.S. policy ought to strengthen, not undermine, this valued relationship. #StandWithIsrael https://t.co/vj1UcdeGU7","date":"Wed May 19 20:00:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Also, I hope you will join me with the @OrrinHatch foundation tomorrow!\nRegister here: https://t.co/VFV1fvBwH8 https://t.co/mHNpEg2xY9","date":"Wed May 19 16:02:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"By continuing to move forward in reforming our criminal justice system, we can improve trust in law enforcement, strengthen our families and communities, and better uphold liberty and justice for all. https://t.co/4xst3267hP","date":"Wed May 19 16:02:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Moreover, her record gives reason to doubt that she’ll defend the civil rights of all Americans—not just her political allies.  For these reasons, I can’t support her nomination.","date":"Tue May 18 22:10:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Ms. Clarke’s record reflects a consistent pattern of irresponsible statements and actions, followed by a disclaimer of responsibility and a lack of remorse. https://t.co/cKFuZVGUsx","date":"Tue May 18 22:10:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Is the internet too dangerous for our kids? https://t.co/P08AIu5UPn","date":"Tue May 18 18:20:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"See you Thursday! \nRegister here: https://t.co/VFV1fvBwH8 https://t.co/BkiTmbTWAn","date":"Mon May 17 14:22:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This #NationalPoliceWeek, we honor the brave men and women in blue for their service and protection, especially those in Utah who make our state a safer place. https://t.co/1Sb3rk2iNQ","date":"Fri May 14 18:33:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I caught up with my friend, @jasoninthehouse.  \n \nhttps://t.co/1RO1w5sUd4","date":"Thu May 13 20:51:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"ICYMI: I call it the \"Illegal Voting Act ...\" https://t.co/ihBzdcsjxT","date":"Thu May 13 14:56:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"On Monday night, Hamas launched thousands of rockets into Israeli cities. The goal? To create destruction. The U.S. must stand with our strongest democratic ally in the region by recognizing Israel's right to self-defense. https://t.co/WHn10yx8UI","date":"Wed May 12 22:20:36 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We are a nation of laws, &amp; also a nation of immigrants, &amp; also a nation of compassion. We can be all three. We must be all three! \n\nSomos una nación de leyes, y también una nación de inmigrantes, y también una nación de compasión. Podemos ser los tres. ¡Debemos de ser los tres! https://t.co/r8PHpxAyyp","date":"Wed May 12 17:48:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The smugglers, cartels and coyotes are so comfortable in the knowledge that their work will not be frustrated by President Biden that they taunt our Border Patrol officers at the border. I heard it myself standing on the banks of the Rio Grande.","date":"Wed May 12 16:48:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, @GovCox. This is an important step forward.","date":"Wed May 12 16:45:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 Not to mention, they are attempting to change the law though rulemaking instead of going through Congress.","date":"Tue May 11 19:15:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 I believe the proposed rule the Biden Administration issued on Friday will most certainly affect those law-abiding Americans who use 80% lower receivers or receiver blanks, while doing very little to stop the criminal use of guns.","date":"Tue May 11 19:15:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 When analyzing any gun control proposal, I always look at the impact it will likely have on the constitutional rights of law-abiding Americans. https://t.co/xgiR177OjA","date":"Tue May 11 19:15:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Protecting competition and consumer welfare – including from abuses by Big Tech – is a bipartisan issue. I look forward to working with @SenAmyKlobuchar to address it.\nhttps://t.co/mhuB11Z8kh","date":"Mon May 10 21:42:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Looking forward to this #CriminalJustice reform webinar with the @OrrinHatch Center. Join us! https://t.co/n4gkm4H20o","date":"Fri May 07 15:56:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I thank the @KemGardnerInst for following this same path as they tackle the many issues facing Utah and our future.","date":"Thu May 06 19:07:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Well-informed research is always the key to making right decisions. This is the approach my team at @JECRepublicans takes each day as we collect good data for the Social Capital Project.","date":"Thu May 06 19:07:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is now more clear than ever that Facebook views itself as a gatekeeper of ideas. What this means for the free flow of thought is double-plus-ungood.","date":"Wed May 05 15:43:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Dear @FLOTUS https://t.co/FuInfL34hJ","date":"Wed May 05 14:45:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Sometimes excessive regulation protects big business at the expense of consumers.  That appears to be happening here.  #DeregulateCGMs","date":"Tue May 04 23:02:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 By requiring a prescription for continuous glucose-monitoring devices (“CGMs”), we thwart competition.  Why not let people decide for themselves whether to get a CGM? Letting them do so would reduce prices and improve quality. https://t.co/YSwW3lnRrh","date":"Tue May 04 23:02:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 ... whether Amazon violated antitrust or ethics laws by attempting to influence the procurement process for the Joint Enterprise Defense Infrastructure (“JEDI”) contract for cloud computing services for the DoD.\n\nWe look forward to receiving their responses. #MayTheFourth","date":"Tue May 04 17:20:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Together with @RepKenBuck, I sent letters to Amazon CEO Jeff Bezos, AG Merrick Garland, and the Acting IG of the DoD Sean O’Donnell regarding ... https://t.co/cM2nTf4Ekp","date":"Tue May 04 17:20:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 The Taylors hold the tragic distinction of being a Gold Star Family. Major Brent Taylor lost his life defending our nation. It was an honor to host his widow, Jennie, and their seven children in our nation’s capital. https://t.co/mZtpcXo0Wh","date":"Tue May 04 02:59:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 A big thank you to the Capitol Police for honoring the Taylor family by providing a team of officers to escort them throughout the Capitol.","date":"Tue May 04 02:59:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is great news! Congratulations to @UTNationalGuard's newly promoted brigadier general Charlene Dalto. This is a well-deserved promotion and Utah is lucky to have you.","date":"Mon May 03 17:18:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s Teacher Appreciation Week! With the challenges COVID has presented, it is more important than ever to express gratitude for their incredible work. Teachers, thank you for the difference you make. #ThankATeacher","date":"Mon May 03 17:03:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"ICYMI: I had a great conversation with Steve Evans and @basin_now regarding the President’s executive orders against oil and gas leasing on federal lands. These actions will negatively impact the Utahns who live in the Uinta Basin. https://t.co/UQF8JHkuc2","date":"Fri Apr 30 21:33:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 We are literally shipping our tourism and economic activity abroad, and destroying countless opportunities for our own coastal cities, states, and towns. It should be repealed immediately.","date":"Thu Apr 29 22:20:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 This 135-year-old law, known as the Passenger Vessel Services Act (“PVSA”), harms American workers and redirects tourism to foreign nations. https://t.co/FejEXhMCOl","date":"Thu Apr 29 22:20:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"My amendment – the State Water Rights Amendment – is a simple, common sense solution to ensure that Utah and other public lands states are guaranteed the protection of their existing water rights and a reliable water supply. https://t.co/lsfM7uzeBZ","date":"Thu Apr 29 16:16:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Rather than the “unity” he promised, President Biden has instead delivered extreme partisanship. https://t.co/FfePo8eoOd","date":"Thu Apr 29 02:17:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"“A right is something the government can’t do to you. It can never be defined as something the government takes from others to give to you.”","date":"Thu Apr 29 01:55:12 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 In 2017, Lee and Rubio doubled the Child Tax Credit as part of the Tax Cuts and Jobs Act, which tax return data confirmed has cut taxes for millions of American families. https://t.co/i8Ekjfi2HD","date":"Wed Apr 28 15:01:58 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 U.S. Senators Mike Lee (R-UT) and @marcorubio (R-FL) released a joint statement in response to President Joe Biden’s proposed child allowance plan, which would represent a return to the failed welfare system of the 1990s. https://t.co/BcghAe6tq2","date":"Wed Apr 28 15:01:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/1yWdoNCudC","date":"Tue Apr 27 20:54:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In honor of #SecondChanceMonth, I wanted to share an article by my friend and criminal-justice advocate, @AliceMarieFree. While we have made tremendous progress with the First Step Act, much remains to be done! https://t.co/BhZN3anfVR","date":"Tue Apr 27 20:54:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This superficially easy path is what has led us to the highly dysfunctional and divisive status quo. Earmarks would make life easier for politicians, but worse for the country. That Senator Leahy is even considering such a bargain explains why Congress is held in such disdain.","date":"Tue Apr 27 03:01:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The CDC must justify its current guidelines on face coverings for young children. https://t.co/FExubCGiEx","date":"Fri Apr 23 20:29:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"There IS a crisis at the border. https://t.co/NRsYiJmfyd","date":"Fri Apr 23 14:10:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Read more here: https://t.co/E9WoJKVpfP","date":"Thu Apr 22 15:09:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The #earmark ban endures!\n@SteveDaines R-MT, @SenLummis R-WY, @SenatorRisch R-ID, @SenRickScott  R-FL, @SenTuberville R-AL, @SenHawleyPress R-MO, @RandPaul R-KY, @senrobportman R-OH, @SenatorRomney R-UT, @SenToomey R-PA, @SenTedCruz R-TX, @SenatorBraun R-IN, &amp; @SenJoniErnst R-IA https://t.co/xLkux1fBTv","date":"Thu Apr 22 15:09:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"ICYM my chat with @ShannonBream. \"People are entitled to their own opinions. They are not entitled to their own facts.\" https://t.co/ziMyMglX7r","date":"Wed Apr 21 15:58:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"BEHIND THE SCENES. My friend @RepBurgessOwens &amp; I each granting early-morning interviews. https://t.co/ZNopDiSdxg","date":"Wed Apr 21 12:32:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Pleased to welcome @SenatorLankford, @SenTuberville, and @SenatorRisch on board! #earmarks","date":"Tue Apr 20 19:58:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 It’s simply dishonest for Democrats to claim that supporting one means denying the other. We want it to be easy to vote and hard to cheat. #easytovotehardtocheat","date":"Tue Apr 20 17:16:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Republicans have always supported voting rights—including all constitutional applications of the Voting Rights Act. We also support common-sense election-security measures because all voters are disenfranchised when election integrity is compromised. https://t.co/3KuGg8Mbw1","date":"Tue Apr 20 17:16:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We will not participate in an inherently wasteful spending practice that is prone to serious abuse. #Earmarks https://t.co/egPb2NCxL8","date":"Mon Apr 19 16:14:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@Apple has responded to my letter with @RepKenBuck, and now @Parler_App is back in the App Store. Conservative speech must not be silenced. https://t.co/IjpCXlWmYm","date":"Mon Apr 19 15:37:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The evil of #humantrafficking must be stopped. My thanks to @MaloufFdn @SamBMalouf @KacieMalouf @ElizSmart @RepChrisStewart @SteveYoungQB @RepBurgessOwens @RepBlakeMoore @lanheechen and others for being part of the fight. https://t.co/9muAiCCxSb","date":"Sat Apr 17 22:43:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/d6S0AnpIdG","date":"Thu Apr 15 22:35:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy 150th Birthday @sltrib! The press plays an invaluable role of keeping Utahns informed about the issues and world around them","date":"Thu Apr 15 16:05:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 Joe Biden.","date":"Thu Apr 15 12:39:41 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 Do you know who spoke those words?","date":"Thu Apr 15 12:39:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 On court packing: \" ... it was a bonehead idea. It was a terrible, terrible mistake to make, and it put in question ... the independence of the most significant body—including the Congress in my view—the most significant body in this country, the Supreme Court.”","date":"Thu Apr 15 12:39:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Packing the court is an act of arrogant lawlessness. Those behind this effort spit in the face of judicial independence.","date":"Thu Apr 15 03:11:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Government power is force, and expands at the expense of liberty. https://t.co/cx645ocCse","date":"Wed Apr 14 22:03:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 The SHUSH Act would eliminate this onerous regulation to make a perfectly legal sport safer for millions of Americans. https://t.co/djIjq8jih2","date":"Wed Apr 14 18:23:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 Pleased to have the support of @NatlGunRights,  @GunOwners, and the @NRA.","date":"Wed Apr 14 18:23:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 The current, oppressive process required to buy silencers only hurts the eardrums of millions of hunters, sportsmen, and marksmen each year, and serves to provide surreptitious gun control.","date":"Wed Apr 14 18:23:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 We should have done this decades ago, but when billion-dollar businesses start engaging in political extortion it becomes even more pressing to end their special treatment. https://t.co/XiUfW0KyAu","date":"Wed Apr 14 15:47:03 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 Instead, Major League Baseball has used its judicially fabricated antitrust immunity to suppress wages &amp; divide up markets for decades—conduct that is plainly illegal, &amp; sometimes criminal, in any other industry.","date":"Wed Apr 14 15:47:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Earmarks are the currency of corruption. Keep them banned!","date":"Wed Apr 14 14:27:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 This bill will help lift that unjust burden on our military families – who sacrifice so much to protect our nation – by ensuring that spouses can receive the licensing reciprocity they need across state lines. #SupportMilitarySpouses","date":"Tue Apr 13 22:45:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Faced with a 50-state patchwork of licensing laws, military spouses are forced to spend thousands of dollars and hours to obtain licensure every time they move to a new state under military orders. #SupportMilitarySpouses https://t.co/HFcuRoIeQq","date":"Tue Apr 13 22:45:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"U.S. Capitol Police officer William “Billy” Evans gave his life in defense of our nation’s temple of democracy. Today, he lies in honor in that same building. Sharon and I will forever mourn his loss and be forever grateful for his service and sacrifice","date":"Tue Apr 13 15:03:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I had a great conversation with @jordanbpeterson about federalism, separation of powers, and the proper role to government. Jordan is a voice of reason in today’s chaotic world and I appreciate him inviting me on.","date":"Mon Apr 12 21:49:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"After Urging from Lee and @SenAmyKlobuchar, @Apple Agrees to Send Witness To Hearing on App Stores and Mobile App Competition\nFull Release here: https://t.co/sy7EDuuksN https://t.co/0Txcz6NykO","date":"Mon Apr 12 18:08:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It is long past time to investigate, arrest, and prosecute domestic terrorists. Where are you, @TheJusticeDept (Garland), @AliMayorkas, &amp; @DirectorWray?","date":"Sun Apr 11 18:40:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Just had a chat about big tech with @ChrisEvans &amp; @MarkKassen. Great guys. Great conversation. https://t.co/yM1EIjYXOA","date":"Sat Apr 10 11:31:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In 1983, Joe Biden called President Roosevelt’s effort to pack the #SCOTUS a “boneheaded idea” and “a terrible, terrible mistake to make” He was right back then. And it would be a terrible boneheaded mistake today. https://t.co/ejqmUcosaD","date":"Sat Apr 10 01:01:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I appreciate @SecDebHaaland accepting my invitation to visit Utah. Let’s hope that the voices of Utahns will be heard.","date":"Fri Apr 09 20:44:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Utahns have been impacted most by the “political football” known as the Antiquities Act. A permanent legislative solution is the ONLY way to respect the lives and livelihoods of those near these lands and to end the decades of back-and-forth designations. https://t.co/k1gUbGUcXb","date":"Fri Apr 09 20:43:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The supposed “COVID relief” bill spent 2-trillion dollars, but hardly any went to actual COVID relief. This 3-trillion dollar “infrastructure” bill does just the same, spending enormous amounts of money that will hardly go to actual infrastructure. https://t.co/DyzShy8Hc4","date":"Fri Apr 09 16:33:44 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"On management of Utah public lands, Biden should pursue an accountable legislative process https://t.co/5s740KG45j https://t.co/AbGHb3w7bX","date":"Fri Apr 09 15:29:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Today we celebrate the resurrection of Jesus Christ, the Son of God.  Forgiveness and renewal were not only His message, but also His gift to all mankind.  Happy Easter to all.","date":"Sun Apr 04 17:15:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you @siliconslopes for hosting me and for a great conversation. The innovation, ideas, and leadership coming from Utah’s tech community are an important part of our future. Hearing from all of you helps me take Utah solutions to our nation’s capital.","date":"Sat Apr 03 15:40:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Why does @MLB still have antitrust immunity? It’s time for the federal government to stop granting special privileges to specific, favored corporations—especially those that punish their political opponents.","date":"Fri Apr 02 22:44:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Absolutely horrible scene at the U.S. Capitol, with one officer injured and another who lost their life. My prayers go out to the families of these brave officers. Grateful to the first responders and Capitol Police officers for their bravery and service.","date":"Fri Apr 02 19:51:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee (R-Utah) and @RepKenBuck (R-Colo.) on Wednesday sent a letter to the CEOs of Google, Apple, and Amazon questioning a series of actions their companies took against Parler. https://t.co/Id4XdElZOx https://t.co/z7gzSAVr65","date":"Thu Apr 01 21:38:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Here with @RodArquette discussing the crisis on the US/Mexico border and taking questions from listeners. Tune into @1059KNRS now to listen. Looking forward to answering your questions https://t.co/gGdO8xozmK","date":"Wed Mar 31 23:18:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was great speaking with @Univision32 today. Somos una nación de inmigrantes y una nación de leyes.  Deberíamos seguir siendo ambos. https://t.co/cGtZJ9pGMd","date":"Tue Mar 30 01:04:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Last week, I reintroduced a resolution calling for a free trade agreement between the US and UK. While economic ties between our great nations are already strong, a free trade agreement would allow even more goods and services to flow between our countries https://t.co/FKpdNBMiZn","date":"Mon Mar 29 16:29:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We’re a nation of laws and a nation of immigrants. We don’t need to choose one or the other. Lawlessness is not compassion. https://t.co/TMkLkPNiW7","date":"Fri Mar 26 20:59:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"President Biden promised surges at the border. And he delivered. The resulting humanitarian crisis could easily have been avoided. The smugglers, cartels and coyotes are so emboldened by these policies that they taunt our Border Patrol officers. https://t.co/Q0T8DZfLfn","date":"Fri Mar 26 19:59:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was deeply troubling to see hundreds of people at the border late last night, so many of whom were women and children, who had entrusted their lives to ruthless smugglers and drug cartels. https://t.co/X3H5f9CIGV","date":"Fri Mar 26 18:33:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’m currently down at the US / Mexico Border with my colleagues assessing the situation at the Donna (Texas) Temporary Processing Facility. The facility is designed to handle no more than 1,000 people and with current COVID safety guidelines, that number drops to 250 people.","date":"Fri Mar 26 15:48:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"They’re currently handling 4,200 people. Many are testing positive for COVID-19. This is what the Biden Administration doesn’t want the American people to see.","date":"Fri Mar 26 15:48:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Cartels are making millions of dollars per week. Our Border Patrol agents are overwhelmed. Thousands of people are crossing our border illegally everyday and entering our country without the same COVID testing requirements as American citizens.","date":"Fri Mar 26 14:33:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 The Biden Administration has closed the border to press in an attempt to minimize the crisis so we are here to tell the story of what’s really happening. https://t.co/Ip4KGtPxx0","date":"Fri Mar 26 14:32:44 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee (R-Utah) on Thursday introduced the MORE PILT Act. @MikeCrapo (R-Idaho) and @SenatorRisch (R-Idaho) joined as original cosponsors of the bill. Read the full release here: https://t.co/PvdfFVRbhz https://t.co/xyQ5FAncMg","date":"Fri Mar 26 00:19:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A fantastic piece by @LaVarrWebb about federalism. Give it a read. https://t.co/v1M60dHSQX","date":"Thu Mar 25 15:15:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 Tomorrow I, and 13 of my Republican colleagues in the Senate, will visit the border to see first-hand the crisis the United States is facing.","date":"Wed Mar 24 20:35:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Today I proposed immediate, common-sense reforms that would help stem the flood of immigrants at our border and protect vulnerable women and children from the clutches of the cartels and coyotes. Sadly, it was blocked by Senate Democrats.  https://t.co/TpsD56jLHa","date":"Wed Mar 24 20:35:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Earmarks let politicians funnel your money to their campaign donors as payoff. The Senate must hold the line against this legalized corruption. https://t.co/tvMoVlQFCZ","date":"Wed Mar 24 15:43:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We are lucky to have so many incredible business leaders here in Utah. Our state and our communities are better off because of the work they do and the teams they lead. https://t.co/rubaFiwzyU","date":"Tue Mar 23 20:07:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 We should protect the constitutional right of all law-abiding Americans—including those in low-income communities—to protect themselves and their families.","date":"Tue Mar 23 16:43:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 It’s almost never the wealthy and well-connected whose safety is impaired by restrictive gun-control laws.  This was true in England in 1671 when King Charles II prohibited commoners from owning guns, and it remains true in America today. https://t.co/sO2hirkUzV","date":"Tue Mar 23 16:43:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee (R-Utah) has reintroduced the Protecting American Jobs Act, a bill that would strip the National Labor Relations Board (NLRB) of its power to prosecute and adjudicate labor disputes. https://t.co/zZkApnvsmq","date":"Tue Mar 23 13:58:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations, W0LV3R1NES, on your 1st place victory at the @AtlanticCouncil Cyber 9/12 competition. Your accomplishment highlights the exceptional work being done at @UVU and @UVU_CNSS https://t.co/9EcspdMiBK","date":"Mon Mar 22 23:00:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@JonahDispatch Angelica’s Mexican Grill","date":"Mon Mar 22 18:54:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The BYU law school brought my family to Utah, and has played a prominent role in every stage of my life. I’m grateful that my late father was able to play a role in its founding.  @BYULaw @jrclschair https://t.co/LGfCifvUDK","date":"Sat Mar 20 02:44:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I’ve introduced the Government Spectrum Valuation Act to give us the data that we need to better manage federal spectrum, and to better facilitate a strategy for operating our current technologies and future innovations.","date":"Thu Mar 18 18:55:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Spectrum access and targeted regulatory reform are essential for any future U.S. efforts to develop IoT devices, expand our Wi-Fi capabilities, or look to 5G and eventually 6G networks. Simply spending more federal government money, however, will not address those problems. https://t.co/CL8hVdhzsh","date":"Thu Mar 18 18:55:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee (R-Utah) reintroduced the “CBO Show Your Work” Act Wednesday, legislation designed to improve the legislative process by making the Congressional Budget Office more transparent and accountable. https://t.co/3ZycAyGe61 https://t.co/2LQgDVYd9T","date":"Thu Mar 18 15:30:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you @SecDebHaaland for keeping your commitment to visit Utah to meet with the people impacted by national monument designations. https://t.co/ZztxuqG2OT https://t.co/rEKHOTkOCN","date":"Wed Mar 17 22:44:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Churches, synagogues, and mosques are sacred houses of worship, and should never be regulated like gas stations, stadiums, and other places of public accommodation.  The Equality Act ignores this distinction, and therefore threatens religious freedom. https://t.co/xnaS6CdWN0","date":"Wed Mar 17 19:29:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I had the chance to talk to several members of the team that worked with @virginorbit and @NASA to launch cubesats into outer space. Keep up the great work. You are the modern-day Wright brothers! https://t.co/hth8tJ0Ywr","date":"Wed Mar 17 15:59:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 I couldn’t be more excited about the work of the engineers taking place at my alma mater @BYU.","date":"Wed Mar 17 15:59:14 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 Prosecutors should have to show a suspect had a guilty mind, not just that they committed an illegal act, before an American citizen is put behind bars. https://t.co/gtvhUYi7GR","date":"Mon Mar 15 14:07:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 The Mens Rea Reform Act would end this wrongful government overreach.\n \nThank you @malcolm_john for highlighting this issue.\n\nRead the full bill text here: https://t.co/5azAjFueu7","date":"Mon Mar 15 14:07:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 Unfortunately, our federal laws contain far too many provisions that do not require prosecutors to prove a defendant intended to commit a crime. The result is a criminal justice system that over-penalizes innocent acts, which only undermines the rule of law.","date":"Mon Mar 15 14:07:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Another exemplary Utahn making a difference in their community. Congratulations Jason!","date":"Sat Mar 13 17:31:40 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was proud to join with Utah’s unified congressional delegation today to encourage a collaborative and permanent legislative solution to the Bears Ears-Escalante controversy. https://t.co/EPOCkNQJhP","date":"Thu Mar 11 19:27:35 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"As a reminder, you can sign up for future events by visiting https://t.co/qj2h8XMHpO.","date":"Thu Mar 11 16:11:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Enjoyed connecting with Utahns from Utah’s 1st and 4th congressional districts! I want to extend a special thanks to both @RepBurgessOwens and @RepBlakeMoore for joining me in answering the questions from the people we represent. https://t.co/lLx5xzAojn","date":"Thu Mar 11 16:11:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah is leading again. Great people, great policies, lead to great opportunity.","date":"Wed Mar 10 19:29:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 This bipartisan proposal expands the universal charitable deduction, ensuring that Americans who donate to nonprofits such as charitable and religious organizations are able to deduct their giving from their federal tax liability at a higher level. https://t.co/pZwlI7yGpD","date":"Wed Mar 10 17:11:56 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Yesterday, Sens. Mike Lee (R-UT), @SenCoonsOffice (D-DE), @SenatorLankford (R-OK), @SenatorShaheen (D-NH), @SenatorTimScott (R-SC), @SenAmyKlobuchar (D-MN), @SenatorCollins (R-ME), and @SenCortezMasto (D-NV) introduced the Universal Giving Pandemic Response and Recovery Act. https://t.co/VSknqqbII7","date":"Wed Mar 10 17:11:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great initiative by Utahns continuing to make a difference. Great work Steele McKinney and @RyanQualtrics! https://t.co/h3m1NJiBUu","date":"Tue Mar 09 23:03:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Further unilateral, executive action under the Antiquities Act will result in the same frustration Utahns have felt for 25 yrs. Utahns deserve a legislative solution that would serve both the nation and our state. Let’s end this historic cycle of disputes. https://t.co/nEr0y1gDRs","date":"Tue Mar 09 16:20:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee issued the following statement on the passage of the COVID spending package today in the Senate: https://t.co/B2ofCcEHda https://t.co/LoHmRgzJZR","date":"Sat Mar 06 21:30:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Watch the Senate floor live as Democrats spend another almost $2T. Tick, tick, tick... https://t.co/sMEucggltQ","date":"Sat Mar 06 15:46:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Pleased to announce that @LeeLons will be joining my staff as Comm's Director. Lee is one of the most respected members of the UT media, fair &amp; honest, &amp; a consummate professional. His experience makes him the ideal messenger for my team as he works to serve the people of Utah. https://t.co/iyaW2zab29","date":"Fri Mar 05 23:34:45 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@LeeLons will be joining my staff as Communications Director. Lee is one of the most respected members of the UT media, fair &amp; honest, &amp; a consummate professional. His experience makes him the ideal messenger for my team as he works to serve the people of Utah. https://t.co/X1QUNfQLMW","date":"Fri Mar 05 22:50:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Off to the floor to debate and vote on the $1.9T bill the Democrats call the American Rescue Plan.  In reality it is the \"Democrat Priorities Rescue Plan.\"  Using this process to bypass a bipartisan approach is not what America needs. https://t.co/SlNRNrow24","date":"Fri Mar 05 17:57:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me for two live, interactive town hall events on Wednesday, 3/10. The first event will be at 5pm MT featuring @RepBurgessOwens &amp; the second event will take place at 6:15pm MT with @RepBlakeMoore. Register here: https://t.co/qj2h8XMHpO https://t.co/K6r6Rcc9sa","date":"Fri Mar 05 17:10:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’m gearing up to push back on the Biden administration’s reckless $1.9 trillion earmark wish list—only 1% of which goes for COVID vaccine production and distribution.  These supplies should help keep my colleagues going for a few days. https://t.co/aaEmUF9RKr","date":"Thu Mar 04 22:11:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 This bill is not about providing actual COVID relief for the American people. It’s about fulfilling a partisan wish list, through bad economic reasoning and blatant special-interest handouts. https://t.co/5hUziIAeOY","date":"Wed Mar 03 22:26:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 It will worsen our nation’s economic health in the long term and does little to help American small businesses and families in the short term.","date":"Wed Mar 03 22:26:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"$135 million for the National Endowment for the Arts","date":"Wed Mar 03 18:23:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"An additional $135 million for the National Endowment for the Humanities","date":"Wed Mar 03 18:23:43 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"$50 million in funding for EPA “environmental justice grants.” Code for cash in pockets to the environmental lobby.","date":"Wed Mar 03 16:04:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"$1.5 billion to Amtrak, which is already sitting on around $1 billion of unspent bailout money.","date":"Wed Mar 03 16:02:39 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utahns have made hard decisions to ensure a prosperous economy.  In fact, the State is running a surplus.  Utah’s sacrifice and good governance should not go to bail out other states to the tune of $350 billion. \n\nWhat would you cut? https://t.co/d6oucalIkx","date":"Wed Mar 03 16:02:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 That’s why I’ve cosponsored @SenLummis' POWER Act, which would restrict presidents from taking such sweeping and reckless actions that are harming rural communities in our state.","date":"Tue Mar 02 19:28:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 An in-depth video by Fox 13 Utah on the reckless actions by the Biden Administration which completely disregard not only rural Utah, but rural America in general.","date":"Tue Mar 02 19:28:29 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I call upon FBI Director Christopher Wray to give us answers regarding FBI’s collection of geolocation data, and to stop opposing bipartisan legislation designed to protect the constitutional rights of American citizens.","date":"Tue Mar 02 17:11:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 The FBI has repeatedly opposed efforts to rein in its domestic-surveillance authority under FISA, the PATRIOT Act, and other provisions of federal law. https://t.co/8TtliOEled","date":"Tue Mar 02 17:10:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you @USAttyHuber for your service to Utah and the Nation. John’s commitment to service exemplifies the best of Utah. I wish him the best on his next endeavor. https://t.co/WjqruQAFm5","date":"Fri Feb 26 22:06:06 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Senator Mike Lee (R-UT) issued the following statement in response to the Biden administration’s airstrike in Syria last night:  \nhttps://t.co/0lsuhjPJ5k https://t.co/tAE8utsBH2","date":"Fri Feb 26 20:39:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/3 I hope that today, all of us can take a moment to thank these brave men and women.","date":"Fri Feb 26 18:56:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/3 Each and every one of these guardsmen played an important role in our nation’s capital these last weeks. I respect and admire their commitment to serve not just the people of Utah, but the people of our country wherever they are stationed.","date":"Fri Feb 26 18:56:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/3 To honor and thank the men and women of the Utah National Guard for their dedication and selfless service in protecting the United States Capitol, I have entered their names into the Congressional Record. https://t.co/p7m7PxBCCx","date":"Fri Feb 26 18:56:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":".@marcorubio &amp; I have long said that the Child Tax Credit must be further increased to help working families. In the current pandemic relief bill under consideration, we would support increasing the Child Tax Credit to $3,500, &amp; $4,500 for young children. https://t.co/jzreI20hue","date":"Fri Feb 26 17:34:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@marcorubio &amp; I have long said that the Child Tax Credit must be further increased to help working families. In the current pandemic relief bill under consideration, we would support increasing the Child Tax Credit to $3,500, &amp; $4,500 for young children. https://t.co/jzreI20hue","date":"Fri Feb 26 17:32:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/IpzotXTy9U","date":"Thu Feb 25 19:08:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sens. Lee, @JerryMoran, and @SenatorBraun Introduce PROMISE Act to Hold Big Tech Accountable.\nhttps://t.co/6Du76dDsv8 https://t.co/v3y9KnEnIm","date":"Thu Feb 25 19:07:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Lee-@marcorubio plan would help address the parent penalty by nearly doubling the Child Tax Credit. The plan would also eliminate the stay-at-home parent penalty by turning the childcare credit into a “young child” enhancement that families of all stripes can access. https://t.co/iUWXUjgBLY","date":"Wed Feb 24 23:29:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This week, members of my staff will be hosting mobile offices in the Uinta Basin. If you need help with federal agencies or want to express any concerns with a member of my staff, please stop by! https://t.co/P2US5TNned","date":"Wed Feb 24 02:08:15 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tomorrow at 6:00 PM MT for my #AccessLive event. Register now at https://t.co/qj2h8XMHpO or by texting SENMIKELEE to 833-898-5483. I look forward to answering your questions! https://t.co/oj4D6hg8Mi","date":"Tue Feb 23 19:24:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 We’ve taken non-federal power &amp; brought it to DC; &amp; within DC, we’ve taken that power – or any power we might have previously had – &amp; handed it over to the exec branch. We cannot do this anymore. Congress must reclaim its role under Article one as the lawmaking branch of gov.","date":"Tue Feb 23 17:58:33 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 There has been a consistent trend over the last 80 years – under both Republican and Democratic leadership, in both Congress and the White House – in which we have taken power away from the American people. https://t.co/8rSHdts1XA","date":"Tue Feb 23 17:58:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Utah isn’t made more beautiful by national monument designations.  In some cases, those designations degrade the land and make the surrounding communities — already impoverished by federal land-management policies dictated by federal bureaucrats — poorer. https://t.co/cGCSpGKauo","date":"Tue Feb 23 16:18:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The founders designed a leg branch in which U.S. Senators would be accntble to the states. Each year during Utah’s legislative session, I deliver my annual report to the Utah Leg &amp; people of Utah, &amp; it’s a responsibility I take seriously. Read it here: https://t.co/dE23S5BAKw","date":"Mon Feb 22 22:34:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was disappointed that Judge Garland declined to condemn dangerous, radical positions previously taken by fellow DOJ nominees, Vanita Gupta and Kristen Clarke. https://t.co/ME3NVfFbt9","date":"Mon Feb 22 20:41:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I didn’t defend anyone voting to convict.  Nor would I.  My vote to acquit was correct.","date":"Sat Feb 20 01:04:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This headline is not only misleading, but affirmatively deceptive.  The Salt Lake Tribune will stop at nothing to undermine and create divisions within the Republican Party.   https://t.co/Z80CxsWZlp","date":"Sat Feb 20 00:57:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Congratulations to Provo/Orem, SLC, Ogden-Clearfield for being ranked as #1, #4, and #9 in the 2021 Best-Performing Large Cities Index, and to Logan and St. George for ranking as #2 and #4 in the 2021 Best-Performing Small Cities Index!","date":"Fri Feb 19 20:43:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I am proud to call Utah home, no better place to live; and no better people to share it with.","date":"Fri Feb 19 20:43:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I had a productive conversation on ways to build on the success of the First Step Act as we make important reforms to our criminal justice system. I appreciate the collaboration with local leaders, building on their recent efforts of reform in Utah @erickhutchings @OdysseyHouseUT https://t.co/HueKU66PKx","date":"Fri Feb 19 19:41:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"When my father helped start the Law School at BYU, he was able to put together a stellar charter class—many of whom became legal practitioners I have looked up to throughout my career.  Hearing stories from a handful of them yesterday about their time with my dad was a treat. https://t.co/3xZBVw7whl","date":"Fri Feb 19 15:02:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 I had meaningful discussions with members of both parties in both chambers and remain confident in my belief that the Utah legislature is a superb role model the US Congress should look up to.","date":"Thu Feb 18 23:25:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Today, I had the privilege to speak with the majority and minority caucuses of both the Utah House and Senate. This effort to be accountable to, and collaborative with state policymakers has been a priority of mine since I first took office. https://t.co/WzmNldjlzC","date":"Thu Feb 18 23:25:21 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to the men and women at @NASA. This is a great day for American space exploration and showcases what can be achieved through countless hours of hard work and collaboration. #NASAPerseverance","date":"Thu Feb 18 22:02:24 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Rush Limbaugh was the voice of conservatism for a generation. He was the most important broadcaster in the history of radio, who drew millions of conservatives into a national political debate that was trying to leave them behind. He will be deeply missed.","date":"Wed Feb 17 22:34:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations on the well deserved award, James. Utah is lucky to have someone so dedicated to making a difference in young people's lives. From one @timpview_tbirds Thunderbird to another, congratulations! https://t.co/sbE1OTVE3A","date":"Tue Feb 16 18:32:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Mike Lee (R-Utah) today issued the following statement after the Senate’s acquittal of former President Donald Trump. https://t.co/IWqInbOU3h","date":"Sun Feb 14 01:47:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Well done @GovCox, Sen Hinkins, Rep Brooks, and the entire legislature. The ability of Utahns to exercise their constitutional rights and liberties should always be promoted and defended. Your support of the 2nd amendment is commendable. @utahsenate @utahhousereps","date":"Sat Feb 13 02:17:32 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Incredible work being done by 40 incredible Utahns. A state is only as good as the people who call it home. With men and women like these, it’s no wonder that Utah continues to grow and thrive. https://t.co/06ejFAjNi8","date":"Fri Feb 12 19:16:52 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you, Gideon George, for sharing your journey. You are truly an inspiration, and we are lucky to have you as part of our Utah story. We are all cheering you on! @BYUbasketball","date":"Thu Feb 11 22:58:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Since day one, the Biden Admin has been treading on state authority. Pausing oil &amp; gas leasing. Holding up permits. Today they rolled back a requirement to get support from affected governors and counties before acquiring land under the LWCF. This is wrong. States MATTER.","date":"Thu Feb 11 21:43:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 “There can be no question that he was talking about the three Democrat politicians whose violent rhetoric had just been aired. ...\" https://t.co/gbM2Zg3M9m","date":"Wed Feb 10 19:25:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 \"... His reward for trying to turn down the temperature was to be lied about and disparaged by liberal media outlets such as The Daily Beast, Business Insider, and The New York Times.”","date":"Wed Feb 10 19:25:16 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I suggested we all take responsibility for lowering the temperature of our politics, and look for opportunities to seek to forgive overheated speeches rather than avenge them. The New York Times twisted my call for civility into a partisan attack. We all need to do better. 3/3","date":"Wed Feb 10 17:06:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is why no one trusts the media anymore. Fox News teed up an opportunity for me to slam Democrats’ inflammatory rhetoric, and I declined to do so. 2/3","date":"Wed Feb 10 17:06:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"For those who are accusing me of giving Trump a “mulligan” because of a headline manufactured for more clicks – watch this clip. 1/3 https://t.co/bot4Cco2yx","date":"Wed Feb 10 17:05:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"To be perfectly clear, my reference to taking a “mulligan” was not referring to Trump, but to Democratic politicians whose inflammatory comments had just been played for me on the air.  I used the term only to avoid needlessly inflaming partisan passions. https://t.co/vjhTJyRdhV","date":"Wed Feb 10 05:14:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"To be perfectly clear, my reference to taking a “mulligan” was not referring to Trump, but to Democratic politicians whose inflammatory comments had just been played for me on the air.  I used the term only to avoid needlessly inflaming partisan passions.  https://t.co/6ydOLLIMOw","date":"Wed Feb 10 05:12:59 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Welcome to Utah, MicroGem.  We are excited to have you.  Thank you for not only your commitment to bringing 500 jobs to Northern Utah, but also for helping our nation combat COVID-19. https://t.co/C3qjBdryqy","date":"Tue Feb 09 17:20:27 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A well deserved award and recognition for one of the greatest to ever play football in my state. Sports can help bridge differences and motivate excellence. Alex has shown us both—I may bleed Cougar blue, but I am rooting for this Ute.","date":"Tue Feb 09 15:04:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I appreciate the discussion with @ShannonBream on unifying our nation and the upcoming impeachment. https://t.co/sBY126nIaR","date":"Tue Feb 09 05:24:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"With the tragic loss of these young men and women, my thoughts and prayers go out to their families and friends. To all Utahns, please be safe when going into the backcountry. @UACwasatch is an excellent resource for staying safe on Utah's mountains.","date":"Mon Feb 08 19:37:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 These bills would ensure that parents are afforded the right to remain informed and involved in their children’s care.","date":"Sun Feb 07 18:28:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Parents play the most important role in caring for the health of their children. It is critical that they have information about the policies of the health organizations to which they bring their children for care https://t.co/x7WmOgrRE2","date":"Sun Feb 07 18:28:55 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to my Democratic colleagues @Sen_JoeManchin @SenatorSinema @SenMarkKelly for making the HSA Amendment possible. https://t.co/jmi8WRdtah","date":"Fri Feb 05 20:07:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The last thing we need during an economic crisis is to make things harder on small businesses.","date":"Fri Feb 05 19:11:02 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I commend the President’s announcement ending unconstitutional U.S. support for the war in Yemen. I am proud to have led the Yemen War Powers resolution with @BernieSanders for the last 4 years and today is a victory for restoring the war-making power to the legislative branch.","date":"Thu Feb 04 21:40:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We need to localize more decisions so that all Americans, regardless of where they live, can live under policies that they are more likely to agree with. That's the beauty of federalism. That is the goal of the budget resolution amendments that I will be introducing this week. https://t.co/aVy3NjF2kk","date":"Thu Feb 04 20:51:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The whole point of American foreign aid is to assist countries in times of need... And yet, for many years our foreign aid dollars have been used to impose violent cultural imperialism… by promoting and providing for the practice of abortion. https://t.co/1HonJxJS8X","date":"Wed Feb 03 23:24:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"→ The Epidemic Preceding the Pandemic: Opioid Overdoses Surge Again\nhttps://t.co/nFxeFtAFzm https://t.co/lAC1GReYp7","date":"Wed Feb 03 21:22:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"→ Expanding Child Care Choices: Reforming the Child and Dependent Care Tax Credit to Improve Family Affordability https://t.co/VQuppPMEYY https://t.co/DVJZkS00su","date":"Wed Feb 03 21:22:50 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"→ What’s Next for Schools: Balancing the Costs of School Closures Against COVID-19 Health Risks https://t.co/hZ31PU86g0 https://t.co/EAFDjxVPrK","date":"Wed Feb 03 21:22:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"At @JECRepublicans, I created the Social Capital Project to study the state of the American social fabric and identify ways to strengthen it. The Project just released 3 reports highlighting the opioid epidemic, school reopenings, and child care costs. View these reports below ↓","date":"Wed Feb 03 21:22:48 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Government policy should be neutral toward the choices families make about balancing the competing demands of work and home life. But our current tax code strays from that neutrality. We need reform that treats American families w/children more equally. https://t.co/VQuppPv47q","date":"Wed Feb 03 16:29:31 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The brave men and women of the U.S. Capitol Police risked life and limb defending us on January 6th. Today we honor Officer Sicknick who died in that fight. He is a hero and we will never forget his sacrifice.","date":"Wed Feb 03 16:07:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A $15 minimum wage is great for Big Tech companies like Amazon, but it is a job killer for small businesses. According to the CBO, a $15 minimum wage would force 1.3 million people out of work. How does killing jobs help the economy?\nhttps://t.co/QFy0atS1kw","date":"Tue Feb 02 21:22:01 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The combination of Mr. Mayorkas’s expansive view of unlimited executive power coupled with his established track record of favoritism for partisan allies makes him a very dangerous choice to head the Department of Homeland Security for the American people. https://t.co/Qdi8lcAqLg","date":"Tue Feb 02 16:44:38 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great work by our @JECRepublicans staff on the very real costs of distance learning. Our youngest children are both hurt the most by distance learning and are the least likely to contract and spread COVID. Let’s get these kids back in school!\nhttps://t.co/QCySfD1WNj","date":"Tue Feb 02 16:05:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great deep dive by @Loisco on reform options for the Child Tax Credit. There is bipartisan agreement to expand the CTC and make it permanent. Let’s get it done!\nhttps://t.co/UhG7UKpT0I","date":"Mon Feb 01 19:43:42 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you Farmers Feeding Utah (@FeedingUtah) for distributing Utah-based food to people in need in southern Utah! Your commitment to service is what makes Utah great.\nhttps://t.co/r4O1IAcRUV","date":"Mon Feb 01 19:25:54 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"A much deserving award for @spidadmitchell Good to see the NBA acknowledge his service.","date":"Fri Jan 29 21:11:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"“Thus, Lee said, while the question of Senate jurisdiction is a close call, the safe conclusion, the one that will avoid massive future problems, is to reject the notion that the Senate should hold the trial.” https://t.co/Bs6HfYSXpO","date":"Fri Jan 29 18:53:57 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In a normal year, tens of thousands of Americans would be marching down Constitution Ave today. This year the #MarchForLife will instead be virtual. We cannot heal and unite if we do not honor and respect all of the American people – born, and unborn. https://t.co/AnIs0fObdP","date":"Fri Jan 29 17:37:18 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"What could go wrong? https://t.co/0CCB4hy6NT","date":"Fri Jan 29 17:15:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I look forward to improving antitrust enforcement this Congress. It is imperative that we ensure markets work for consumers, not just monopolists. It is equally imperative that we not cede this task to the radical left. The consumer welfare standard is essential to both. 5/5","date":"Thu Jan 28 22:36:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Let's also note what the consumer welfare standard is NOT: it is not a narrow concern with price. As Judge Bork wrote, it encompasses “innovation, choice among differing products\" and quality. That more than covers the ways in which markets like Big Tech are failing us. 3/5","date":"Thu Jan 28 22:36:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We need the enforcers to (finally) enforce the antitrust laws against those who harm competition and consumers, including Big Tech. But we need to do it in a way that doesn't allow judges to usurp Congress's legislative role. 4/5","date":"Thu Jan 28 22:36:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"There’s a lot of talk about antitrust legislation this Congress. One thing lost in many proposed reforms: the consumer welfare standard is not a get-out-of-jail-free card for Big Tech. We don’t need to change the law, we need to enforce it. 1/5","date":"Thu Jan 28 22:36:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"What is the consumer welfare standard? It's a guardrail that ensures 1) the primary beneficiaries of the antitrust laws are the people, not big business; and 2) that unelected judges are not allowed to use antitrust to advance their own political preferences. 2/5","date":"Thu Jan 28 22:36:04 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I’d otherwise share this on Parler too, but ....","date":"Thu Jan 28 18:50:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"How many times will Big Tech companies disprove their own claims of having given the world useful, valuable services? This is what happens when competition is stifled.","date":"Thu Jan 28 18:49:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"We should investigate.","date":"Thu Jan 28 18:39:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The text thus reveals that the authors of the Constitution chose a design that was different than the English impeachment system, under which any private citizen could be impeached. The founders made a clear choice to reject that approach. https://t.co/dw8KbWB8h7","date":"Thu Jan 28 18:18:08 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Left seems to see nuking the cloture rule as a pure win for its side, with no tradeoffs. It’s a simple step, they believe, that will lead the US, at long last, to the broad, sunlit uplands of Scandinavian social democracy and campus-style woke-ism. https://t.co/ylmFqgEZon","date":"Wed Jan 27 15:50:51 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great news for Utah form @DOL this week: our economy added 13,800 jobs and unemployment rate to 3.6% in December. #GetVaccinated https://t.co/aKHO076KwL","date":"Wed Jan 27 15:38:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In everything they do, the @UTNationalGuard seeks to serve and strengthen our communities, our country, and our state; and we are all better off for it.\n \nIt has been an honor to have these selfless men and women in our nation’s Capitol; and I thank them for their service. https://t.co/Myk0JzhKqY","date":"Tue Jan 26 22:46:36 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@VoteDarlene Questions are not pre-selected, they are chosen real time. Questions are also taken from the Facebook Live comment section during the event. If you would like to submit a question beforehand, please use the comment section of the promotional post currently on Facebook.","date":"Tue Jan 26 18:11:13 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Join me tomorrow at 6:00 PM MT for my #AccessLive event. Register now at https://t.co/qj2h8XMHpO or by texting SENMIKELEE to 833-898-5483. I look forward to answering your questions! https://t.co/P1ktbIoLt4","date":"Tue Jan 26 17:48:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Good to see the Biden administration admit their oil/gas moratorium is bad for local economies. Unfortunately they are only exempting Native American lands from their job killing executive order. The rest of America should get this exemption too. https://t.co/b56c5tEgec","date":"Tue Jan 26 14:56:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sens Lee and @SenatorRomney Introduces the Protect Utah’s Rural Economy (PURE) Act. https://t.co/ucWRfudqlQ https://t.co/QaJSniTRLo","date":"Tue Jan 26 01:28:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The Biden Administration’s pause on RS 2477 right-of-way adjudication tramples on the rights of the public to access public lands. Witnesses for these cases are becoming harder to find. Urban Dems are again restricting how rural Americans can use our land! https://t.co/4Ysarwm8cQ","date":"Mon Jan 25 21:11:19 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great talking to @gabby_hoffman about the need for Antiquities Act reform. Public land management decisions should be made by those closest to the land. https://t.co/GxHcHdzBB4","date":"Mon Jan 25 20:37:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I have been told there was a miscommunication between law enforcement agencies yesterday about where Guardsmen were permitted to be. That miscommunication has been resolved and plenty of indoor space has now been made available to the Guardsmen.","date":"Fri Jan 22 19:12:11 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you so much @Pro_Life_Utah for all your hard work on this important issue.","date":"Fri Jan 22 18:55:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"On this day, the anniversary of Roe v. Wade, we remember the over 60 million little lives lost to abortion in our country… and we strive to work – through our laws and through our lives – to value the dignity of each and every American person, born and unborn.","date":"Fri Jan 22 18:53:46 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"COVID-19 has already forced some mines to close or suspend operations. President Biden’s unilateral executive action to halt permitting and administrative processes will only kill more jobs and further strangle this vital struggling industry.\nhttps://t.co/nCldi6TK1c","date":"Fri Jan 22 15:25:17 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"I was honored to connect with more of our @UTNationalGuard and show them around the Capitol tonight. I want to thank not only these men, but ALL the men and women who have served our nation in DC over the last week. Thank you for your service. https://t.co/quDrG8CDIY","date":"Fri Jan 22 04:03:09 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Very upset by this story but I have been in touch with the Utah National Guard and they are taken care of. My staff and I are investigating what happened here and will continue working to fix this situation. https://t.co/Fw2ZVv4fgO","date":"Fri Jan 22 01:33:05 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great talking to @LeeLons today about President Biden’s Bears Ears EO. This expanded use of the Antiquities Act is simply incompatible with his promise of unity. Instead we should all be coming to the bargaining table to find a legislative solution. https://t.co/cPHdSHCSZ6","date":"Thu Jan 21 21:27:49 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Took me a second to recognize my colleague @SenBooker  with his mask on, but I look forward to working with him in the 117th Congress. https://t.co/34BGhQtMxa","date":"Wed Jan 20 19:51:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/l6WCRbRMyZ","date":"Wed Jan 20 16:52:23 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Honored to meet with the fine men and women of the @UTNationalGuard helping to secure the Capitol today! Incredibly proud of these Utahns and their continued sacrifice no matter the mission. https://t.co/JHLRLg7pRN","date":"Wed Jan 20 15:18:22 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 \"Men must see that force begets force, hate begets hate, toughness begets toughness. And it is all a descending spiral, ultimately ending in destruction for all and everybody ...\" https://t.co/2oFnGGOGBF","date":"Mon Jan 18 15:38:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 \"Somebody must have sense enough and morality enough to cut off the chain of hate and the chain of evil in the universe. And you do that by love.\"","date":"Mon Jan 18 15:38:37 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"@JeremyBRoberts Jeremy, we’ve got to keep private things private.","date":"Sat Jan 16 02:52:25 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you to the brave men and women of @UTNationalGuard who have bee activated to serve in DC for the presidential inauguration. Your commitment to uphold and defend the Constitution of the United States is deeply appreciated. https://t.co/jusOqeg0yT","date":"Fri Jan 15 21:51:53 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Very happy to hear @RyanTAnd will be the next president of @EPPCdc. No one is more deserving and I know he’ll do a fantastic job advocating for American families.","date":"Fri Jan 15 17:36:20 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/6vZfAB1wMB","date":"Fri Jan 08 16:01:00 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Our job is to open and then count. Open and then count. That’s it. That is all there is https://t.co/CSYS5UKwQP","date":"Thu Jan 07 02:03:34 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"The violence at the United States Capitol is completely unacceptable. It is time for the protesters to disperse.\n\nMy staff and I are safe. We are working  to finish our constitutional duty to finish counting votes today.\n\nGod bless the Capitol Police keeping us all safe.","date":"Wed Jan 06 20:44:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Whether we get back in the chamber or convene in a different location, the Senate should continue the work of the American people immediately. This outrage cannot be allowed to disrupt that work for a minute longer.","date":"Wed Jan 06 20:11:18 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congress was elected to govern. We need to get back on the floor and gavel in the Senate as soon as possible.","date":"Wed Jan 06 20:07:10 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"No matter our political differences let’s all treat each other with respect and decency. Harassing your political opponents on a plane is not acceptable. Harassing your political opponents at their home is not acceptable. We as a country need to be better than this.","date":"Wed Jan 06 14:40:07 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy Inauguration Day to @SpencerJCox! Looking forward to working together to make life better for all Utahns. I wish you all the success in your new role! https://t.co/4lxicr8YiZ","date":"Mon Jan 04 18:04:30 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy 125th Birthday to the great state of Utah! It is truly an honor to serve in the United States Senate and to work for all of you who call Utah home. https://t.co/igtIva8Dnk","date":"Mon Jan 04 18:02:26 +0000 2021","user_id":"88784440"},{"handle":"SenMikeLee","text":"In a myriad of ways, @GovHerbert has been a champion and a spokesman for all that is good about our state. It has been an honor to serve the people of Utah with him, and I wish him all the best as he embarks on his retirement. https://t.co/Xfiiutbo5h","date":"Thu Dec 31 22:39:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Saddened to hear about the passing of Rep. Shurtliff. She was a true stateswoman and my thoughts and prayers are with her family.","date":"Thu Dec 31 17:53:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/2 And congratulations to Chief Young of Ogden and Chief Cottam of the newly formed Taylorsville Police Department. I look forward to meeting and working with both of you and wish you well in your service!","date":"Wed Dec 30 20:20:33 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/2 Thank you Chief Watt for your service to the Ogden community. Utah appreciates the sacrifice made by you and your family. \nhttps://t.co/oKGDsFwyor","date":"Wed Dec 30 20:20:33 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thanks for your kind words, Mark Holden! https://t.co/Gx4PJPPMbt","date":"Tue Dec 29 14:07:14 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"From my family to yours, wishing you a Merry Christmas and a joyous holiday season! https://t.co/xPqXMDoXa0","date":"Fri Dec 25 13:24:59 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The prosecution of Phil Lyman—a devoted public servant—amounted to an abuse of prosecutorial discretion by the Obama Justice Department. I thank President Trump for correcting the injustice stemming from this overreach of federal power. https://t.co/cQ2mXXSFVE","date":"Wed Dec 23 01:27:49 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Weldon Angelos was instrumental in helping to pass the most significant federal criminal justice reform legislation in a generation, the First Step Act. I thank President Trump for listening to his case and making the compassionate decision. https://t.co/cQ2mXXSFVE","date":"Wed Dec 23 01:25:53 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Google has repeatedly pointed to Facebook as evidence for its claim that there is plenty of competition in online advertising. But it turns out the two companies may have agreed not to compete at all. The American people deserve to hear the truth. https://t.co/Ydxt5ZjUcC","date":"Tue Dec 22 16:08:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"4/4 This process has not overcome Washington dysfunction; it is Washington dysfunction. Even during a pandemic this is not how governing should be done, it is unfair to the American people, and that is why I voted no.","date":"Tue Dec 22 15:19:55 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/4 Unfortunately, the COVID relief bill has been packaged together w/ a much larger government spending bill that is bursting at the seams with special interest handouts slipped into to 5,593 pages of legislative text in the dark of night. No one who voted for this bill read it.","date":"Tue Dec 22 15:19:54 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/4 This COVID relief bill - like the one Senate Democrats blocked for months out of pure partisan politics - contains some much-needed items to help Utahns recover including more funding for faster vaccine deployment and an expanded charitable deduction.","date":"Tue Dec 22 15:19:54 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/4 For almost a year, Utahns have been fighting through terrible conditions to work, to find work, to serve their neighbors and communities as best they can. Congress has failed to meet their standard of courage and duty.","date":"Tue Dec 22 15:19:54 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you @realDonaldTrump for signing the bill to rename Utah’s federal courthouse in Senator Hatch’s honor. Senator Hatch dedicated his life to serving Utahns and this is a fitting tribute to his service.","date":"Tue Dec 22 02:24:59 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"I agree.","date":"Mon Dec 21 22:00:39 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"3/4 which will cost American taxpayers trillions of dollars.  This process, by which members of Congress are asked to defer blindly to legislation negotiated entirely in secret by four of their colleagues, must come to an end.","date":"Mon Dec 21 21:27:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"2/4 Here’s the really sad thing:  we’re being told that there will be no opportunity to amend or improve it.  As a result, nearly every member of Congress — House and Senate, Democrat or Republican — will have been excluded from the process of developing this bill,","date":"Mon Dec 21 21:27:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"4/4 It won’t come to an end until no longer works for those empowered by it.  That can happen, but only when most members of both houses and both political parties stop voting for bills they haven’t read—and, by design, cannot read until after it’s too late.","date":"Mon Dec 21 21:27:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"1/4 This is the spending bill under consideration in Congress today.  I received it just moments ago, and will likely be asked to vote on it late tonight.  It’s 5,593 pages long. I know there are some good things in it.  I’m equally confident that there are bad things in it. https://t.co/SoWXnEWYfV","date":"Mon Dec 21 21:26:33 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The REPORT Act will provide an important tool for conducting congressional oversight into incidents of terrorism, &amp; will help lawmakers better address homeland security needs. I look forward to seeing this bill move through the House &amp; reaching the President’s desk to become law.","date":"Sat Dec 19 20:58:48 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"This is great news for Utahns and the fight against COVID-19. https://t.co/qdxshFfnez","date":"Sat Dec 19 17:28:43 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Productive listening session this morning with Utah Superintendents Association, @UtahSchoolBoard, @UAPCS, and other education stakeholders. Great to hear from folks engaged in the critical role of educating the 650k+ Utah school kids. https://t.co/jYyyifmozs","date":"Thu Dec 17 19:32:39 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great to see @SeanReyesUT leading the effort to enforce Utah’s antitrust laws. Our @senjudiciary Antitrust Subcommittee examined this very issue back in September\nhttps://t.co/UwEbNtXJcP","date":"Thu Dec 17 18:32:39 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Exciting moment at the University of Utah hospital today! Another big step on the road to recovery! I look forward to getting it after those most vulnerable and the heroic front line workers have the opportunity. https://t.co/yjJIyGEvo6","date":"Tue Dec 15 21:24:28 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy Bill of Rights Day!!! 229 years ago today the first ten amendments were ratified to the Constitution. Which amendment is most important to you?\nhttps://t.co/LllevKpUMH","date":"Tue Dec 15 15:30:06 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great work by @BYU_CSED and @DeseretNews on this year’s American Family Survey. Looks like 38% of parents have considered homeschooling since the pandemic began.\nhttps://t.co/PxxgIUBhNC","date":"Mon Dec 14 20:48:49 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great work by the @WitherspoonInst here on why we need to make the CARES Act’s charitable tax deduction permanent. https://t.co/SLoax7vIIz","date":"Mon Dec 14 18:46:57 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Fantastic news. What a huge accomplishment of human ingenuity. Thank you @realdonaltrump and everyone involved in Operation Warp Speed for getting us a vaccine in record time. Now handing it off to the states to get it to the people. https://t.co/d3B65C0aJL","date":"Sun Dec 13 22:51:52 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Lee Announces Support for Section 230 Reform https://t.co/8DoX5pfGiG","date":"Thu Dec 10 20:11:29 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/7CS5jZ2niG https://t.co/qJoTxBnEUN","date":"Thu Dec 10 16:48:40 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Enjoyed meeting with Utah businesses, including @UMAssoc + @BioUtah,  who have helped meet the demands of PPE and COVID-19 testing since the start of the pandemic.  Thankful to have such thoughtful and innovative business leaders in our state! https://t.co/LXEdKYHxWH","date":"Thu Dec 10 16:25:57 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"As the first woman to serve as Command Chief Master Sergeant of the 151st Air Refueling Wing @UtahAirGuard, I would like to congratulate her on her well-earned promotion.","date":"Thu Dec 10 16:15:20 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"36 across is a tough one. Any tips? https://t.co/PkxxNRpdxl","date":"Wed Dec 09 23:24:07 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Lee Supports Belated FTC Action Against Facebook https://t.co/SRXO0sjjSJ https://t.co/AukY6xAvWW","date":"Wed Dec 09 22:12:24 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great story of hard work and creativity. Congratulations to Joel Clark and everyone else @KodiakCakes \nhttps://t.co/Nu7CP6iepF","date":"Wed Dec 09 18:20:10 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Lee Introduces PROMISE Act to Hold Big Tech Accountable https://t.co/s54BmYduzD https://t.co/gBrJMEKZd1","date":"Wed Dec 09 15:10:45 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Lee Thanks Sen. Hatch for His Service with Courthouse Renaming\nhttps://t.co/I9dNksY8ty https://t.co/nbcJi3ERjz","date":"Tue Dec 08 22:28:45 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"I am disappointed, but will continue to oppose efforts by my colleagues to put the U.S. at a disadvantage and support the private sector trying to keep the U.S. technologically competitive globally.","date":"Tue Dec 08 18:28:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sadly, the misguided decision to include provisions in the NDAA to overrule the @FCC, further break our interagency spectrum decision-making process, and could harm our ability to deploy 5G and next generation Wi-Fi.","date":"Tue Dec 08 18:28:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"DOD’s opposition to the @FCC’s L-Band decision does not reflect any science-based engineering, facts, or technical analysis. It is simply fearmongering wrapped in an amorphous “national security” argument.","date":"Tue Dec 08 18:28:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Their service will never be forgotten.","date":"Mon Dec 07 19:02:21 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"We all know there's a whole lot more to life than dollars and cents. There are families, there are marriages, there are community organizations and neighborhoods. These are the things that really make us and define us and lead to human thriving. https://t.co/zwPbhCSA3p","date":"Fri Dec 04 21:15:07 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"These are the strongest reforms cracking down on H-1B abuse since the program was created 30 years ago. https://t.co/whOWGbCeWW","date":"Thu Dec 03 19:23:01 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"My good friend @RepRobBishop is retiring from Congress. He will be sorely missed. https://t.co/Hth5c9vPsc","date":"Wed Dec 02 23:47:03 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The @FestofTrees is virtual this year. Check out these gorgeous entries from the floor of @vivintarena. And thank you as always to @intermountain for putting on this worthwhile event. https://t.co/Yi2MFmwfFp","date":"Wed Dec 02 22:50:16 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Utah’s own @nkaddas of @Kaddas_Ent  for being named the Vice Chair of the Small Business Council at the US Chamber of Commerce.\nhttps://t.co/xJ5guyBhmX","date":"Tue Dec 01 16:12:56 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Today the world lost a great one. Judge Dee Benson, who served for nearly three decades on the U.S. District Court for the District of Utah, passed away this morning after a heroic battle with cancer. https://t.co/Ago1h2FsvG https://t.co/gghjlZiG5D","date":"Mon Nov 30 22:27:05 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s clear that our current dual agency antitrust enforcement arrangement isn’t working. The Justice Department is more politically accountable, and its structure is better suited to decisive enforcement.","date":"Mon Nov 30 22:08:28 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Big thank you to @MLB for stepping up to make sure professional baseball continues in Utah. Looking forward to getting out for a @ogdenraptors game soon! https://t.co/dK6gOQp7CT","date":"Mon Nov 30 19:23:04 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"What a fantastic celebration of community and service. Very proud that my Utah staff helped volunteer for this event.","date":"Wed Nov 25 16:44:15 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The A-10 Warthog is an exceptional plane and in a league of its own when it comes to close air support for our troops on the ground. This is great news for #HillAFB #brrrt https://t.co/SzwpFgtL2m","date":"Tue Nov 24 20:06:37 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Breaking down barriers in the foster care system is vital to connecting more children in need with stable, loving homes.","date":"Mon Nov 23 16:42:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Sen. Lee Introduces One Agency Act to Streamline Antitrust Enforcement https://t.co/O319RERcQU https://t.co/oqb0wb45Wi","date":"Thu Nov 19 18:09:37 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Additionally, the bill would grant federal land managers at the local level the authority to determine, whether, where, and when to allow non-motorized travel over existing, particular routes. 2/2","date":"Wed Nov 18 22:07:59 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"An estimated 40 million Americans engage in mountain biking every year. S. 1695 would amend  the Wilderness Act to ensure that the rules restricting “mechanical transport” do not include forms of human-powered non-motorized travel. 1/2 https://t.co/yqOoC5MF4M","date":"Wed Nov 18 22:07:41 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Yesterday’s Senate Judiciary Committee hearing revealed that Big Tech needs to be held accountable. I’m introducing legislation this week to streamline antitrust enforcement thereby making it easier to hold Big Tech accountable. https://t.co/urdx0Itypw","date":"Wed Nov 18 16:59:37 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"These social media platform giants, Facebook and Twitter, have been offering one thing to the public: a neutral, unbiased platform. But instead, they’ve been delivering an entirely different product – a platform that silences conservative voices. https://t.co/tEEmr4qavm","date":"Wed Nov 18 15:39:36 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Senator Hatch’s positive impact on the state of Utah and the nation’s federal judiciary cannot be overstated, and it is only appropriate that Utah’s federal courthouse be named in his honor. https://t.co/Y5xeDJLARN","date":"Tue Nov 17 22:08:35 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"When Facebook employees give 92.8% of their political $ to Dems, &amp; Twitter employees give 99.3%, it’s hard to believe that all their “mistakes” silencing conservatives are an accident. https://t.co/Oz9tpvbhIZ","date":"Tue Nov 17 17:29:38 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"While Big Tech companies are luring their customers in promising an unbiased experience, in practice they are steadily placing their thumb on the left side of the scale. That’s a problem – that’s a deceptive trade practice and they need to be held accountable for that. https://t.co/tzbGp3EPe5","date":"Tue Nov 17 15:38:25 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thanks for putting this project together, Trey! You have absolutely achieved your goal of inspiring hope in the world and showing people that they can be heroic no matter what life throws at them. #DownToBe https://t.co/C97UkJUxre","date":"Mon Nov 16 18:39:14 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Don’t protest at someone’s home. Protest all you want, but don’t threaten the family of the person you’re trying to influence. And make no mistake—that’s exactly what you’re doing when you show up to protest at the place where they sleep. https://t.co/9XpXlIFrh7","date":"Mon Nov 16 04:22:49 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@JennyWilsonUT @realDonaldTrump No matter who the next president is I think we can all agree this was a closely contested &amp; divisive election. The message Jenny chose to ignore was about honoring our shared institutions &amp; celebrating veterans. I hope she can embrace this message of unity https://t.co/hq41R95qjp","date":"Fri Nov 13 22:06:03 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"How are the American people supposed to trust in the secretive FISA process if no one in FBI or DOJ leadership is willing to admit they were aware of serious flaws in a very high profile investigation. https://t.co/uVUdxZbEdY","date":"Fri Nov 13 15:30:28 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Don’t forget to tune in to the Utah National Guard Veterans Day Concert #HonorUtahVeterans","date":"Wed Nov 11 15:47:39 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Special shout out to Leslie Zimmerman who deployed to Iraq and is currently the Veterans Treatment Mentor Coordinator in the 4th District Veterans Treatment Court in Utah County. #HonorUtahVeterans","date":"Wed Nov 11 14:26:28 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy Veterans Day to all our soldiers, both past and present. You are loved and appreciated more than you know. #HonorUtahVeterans https://t.co/xlarKhfvSe","date":"Wed Nov 11 14:26:28 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Happy 245th Birthday @USMC! Today we pay tribute to the honorable and courageous service of our U.S. Marines.","date":"Tue Nov 10 20:32:15 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"How are the American people supposed to have confidence in the secretive FISA process if no one in FBI or DOJ leadership is willing to admit they were aware of serious flaws in a very high profile investigation? https://t.co/9ce8aIphOe","date":"Tue Nov 10 18:48:16 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/vERgesuW8r","date":"Mon Nov 09 21:25:33 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Be sure to #HonorUtahVeterans by flying a flag this Wednesday and tuning in to the Utah National Guards annual Veterans Day Concert! You can watch online at https://t.co/eiJ2OoYdU5 or at https://t.co/PuYaAS262w https://t.co/3l9OPm7iqV","date":"Mon Nov 09 18:25:23 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Americans deserve a free and fair election. While vote counters must be allowed to do their jobs the American people also need a transparent process so they can trust the final count.","date":"Thu Nov 05 21:42:53 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Good thread on yesterday’s Supreme Court argument on #fultonvphiladelphia #FreeToFoster","date":"Thu Nov 05 16:49:48 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Big argument in the Supreme Court today on the role religious organizations play in our foster care system. You can read a brief on the case here: https://t.co/Hsy2nIBz9R and a @JECRepublicans report on the importance of foster care organizations here: https://t.co/AUEfkOZN7F","date":"Wed Nov 04 16:11:01 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"When any workplace is this biased towards one ideology it would be a miracle if its work was not biased against an opposing ideology. No wonder the employees at these very, very, Democratic companies keep suppressing conservative ideas. https://t.co/s4LjsxB4fm","date":"Fri Oct 30 13:34:10 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Both government and industry leaders are united around the need for more spectrum access and policies and reforms that would advance this important goal. 3/3\n\nClick this link to see what industry leaders have to say: https://t.co/u6ZuyMDhAy","date":"Thu Oct 29 20:58:34 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"My bill, the Government Spectrum Valuation Act (S. 1626) is the first step to help Congress, the Administration, and the private sector obtain the data we need to better inform our spectrum decision-making. 2/3","date":"Thu Oct 29 20:58:33 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Technological innovation requires more access to our electromagnetic spectrum. However, spectrum is a limited resource so we have to use it more efficiently. 1/3 https://t.co/xa9REaZuLt","date":"Thu Oct 29 20:57:19 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great talking to @glennbeck today Big Tech bias and other threats to our republic.","date":"Thu Oct 29 19:58:50 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"It was an honor to recognize a man in the Congressional Record, who is an excellent example of public service. Dean Collett is now in his 65th year of teaching the students of Highland High School. Thank you Dean for your friendship and continued service. GO RAMS!!! https://t.co/GxhADrcniN","date":"Thu Oct 29 17:37:37 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"“Given the disparate impact of who gets censored on your platforms, it seems that you’re either one, not enforcing your terms of service equally, or alternatively, two, that you’re writing your standards to target conservative viewpoints.” https://t.co/Y2etxX5wuG","date":"Thu Oct 29 12:27:36 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"\"Zuckerberg was unable to answer the question and told Lee he needed time to think about it.\" https://t.co/4eVn1fv6nv","date":"Thu Oct 29 02:21:02 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Big Tech suppresses #ProLife groups all the time but can’t name one time they suppressed Planned Parenthood, NARAL, or Emily’s List. https://t.co/K57MIyNEXB","date":"Thu Oct 29 01:50:39 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Proud of @vasaltlakecity for providing alternative care and solutions for veterans in the fight against opioid abuse. https://t.co/YpKm7erfJV","date":"Wed Oct 28 18:49:37 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The only people that benefit from uncertainty in antitrust law are antitrust lawyers. Both businesses and consumers deserve clarity when it comes to federal antitrust law enforcement and the SMARTER Act would create a simpler and more equal system. https://t.co/qbXXAUC1ti","date":"Wed Oct 28 17:56:27 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/Q97MZd3Ti7","date":"Tue Oct 27 00:09:46 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"She will be a justice whose approach to the law – abstaining from policy-making from the bench, deferring to Congress and the states – will ease divisions and allow the Federalism envisioned by our Founders to serve the needs of our pluralistic society. 2/2","date":"Mon Oct 26 17:32:10 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Judge Barrett understands that lawmaking by unelected judges is inconsistent with the Constitution and usurps the prerogatives of the legislative branch. 1/2 https://t.co/YSyePtP59v","date":"Mon Oct 26 17:32:10 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you @guybenson for letting me help teach your audience about the history of Court confirmation fights. #ConfirmBarrett https://t.co/3mg3UdH2qb","date":"Fri Oct 23 18:14:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Every norm broken, every escalation, one party – the Democrats – has been the aggressor. At every step along the way, our side has used our constitutional authority, and the other side has abused theirs. There is no “tit” for “tat.” There’s just “tat.” https://t.co/aUs5qAmRx2","date":"Thu Oct 22 14:11:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Collin tirelessly fought to protect kids and encourage parents and children to connect with each other. #SavetheKids is a call to action for all of us. Let’s build on what Collin has done while supporting his wife and kids through their loss. https://t.co/clwJDscidu","date":"Thu Oct 22 02:24:44 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Looking forward to this one","date":"Wed Oct 21 21:07:52 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Rest assured, every single critic who attacked me for correctly crediting America’s political success as a republic, not a democracy, supports counter-democratic checks and balances on majorities he disagrees with. https://t.co/1FLUvIjyva","date":"Wed Oct 21 17:57:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Great discussion with Chad Booth and @SecBernhardt about the need for NEPA reform.\nhttps://t.co/JyAFaiDXJ4","date":"Wed Oct 21 17:45:43 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"First The Federalist. Now The Babylon Bee. It’s time to stop pretending anti-conservative bias doesn’t exist. Facebook needs to decide whether it wants to be a publisher or a neutral platform worthy of protection under the law. Which is it, Mr Zuckerberg?\n\nhttps://t.co/1oxlxhNBmT","date":"Wed Oct 21 02:32:41 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"My favorite part of DOJ’s antitrust complaint against Google so far is the shout out to Brown Shoe v. U.S., 370 U.S. 294 (1962), on page 12. https://t.co/YS0tgOOAu3","date":"Tue Oct 20 17:15:14 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"I look forward to voting to subpoena Big Tech for the Judiciary Committee this Thursday just as I already voted to subpoena them for the Commerce hearing next Wednesday. https://t.co/WT30u7Yfi6","date":"Tue Oct 20 15:39:29 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/VxvFNNsH6v","date":"Tue Oct 20 15:34:11 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"https://t.co/5rcDeClz9e","date":"Sun Oct 18 21:55:42 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@jack, what about this is untrue? https://t.co/P1oEOCvvX7","date":"Sun Oct 18 21:46:35 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Big tech‘s hypocrisy is not sustainable. https://t.co/FXHoaD8uIN","date":"Thu Oct 15 18:14:56 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The authority of senators to confirm a nominee extends through all six years of their term. It does not end at 5 and ¾ years. https://t.co/2OXM7jwgQW","date":"Thu Oct 15 15:07:22 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Thank you for acknowledging that the dormant Comemrce Clause is important!","date":"Thu Oct 15 14:15:27 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Four years ago BuzzFeed posted the Steele Dossier, filled with lies and misinformation, and twitter and Facebook happily spread their fake news. Now these platforms are blocking transmission of a New York Post story critical of a Democrat. The hypocrisy is not sustainable.","date":"Wed Oct 14 21:15:21 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"You can’t pack the Supreme Court without inevitably threatening things like religious freedom, things like free speech—things that are themselves often unpopular but are protected by the Constitution precisely because they are unpopular. https://t.co/v6lzPT4UdV","date":"Tue Oct 13 17:28:52 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"In the meantime, let’s get back to the actual business of this committee. Let’s dispense with the grandstanding and fearmongering, and give this nominee the good faith consideration she deserves.","date":"Mon Oct 12 18:04:59 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"But that’s not what we’re here to discuss. We are here to discuss the judicial philosophy and qualifications of a nominee to the Supreme Court.","date":"Mon Oct 12 18:04:58 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"If Rs wanted to join that conversation, we could easily point to the millions of Americans who actually did lose healthcare coverage as a result of Obamacare or who saw their premiums and co-pays go up.","date":"Mon Oct 12 18:04:58 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"If Democrats are afraid that a sound judicial philosophy will lead to the Affordable Care Act being found unconstitutional, they have an easy response: Do. Your. Job. Write a law that doesn’t ignore the Constitution.","date":"Mon Oct 12 18:04:58 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Today we heard a litany of histrionic complaints from my Democratic colleagues alleging that the confirmation of Judge Barrett to the Supreme Court would automatically result in the loss of healthcare coverage—or even death—for millions of Americans.","date":"Mon Oct 12 18:04:58 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Cory, thanks for your concern.  https://t.co/pyyEoohZX3","date":"Mon Oct 12 17:06:08 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Well said Brett!","date":"Mon Oct 12 16:54:06 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Many of you have expressed concern about my health status. Please do read this letter from the Attending Physician. https://t.co/YGxrkPti2V","date":"Mon Oct 12 14:38:36 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"This year we celebrate 40 years of Utah-Taiwan relations that continue to add trade, tourism, and international friendship to the communities all around our state.","date":"Sat Oct 10 13:00:01 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"The 180-day rule was originally adopted to prevent high ranking DOD personnel from carving out civilian employment opportunities for themselves. Unfortunately this rule has disproportionately hurt rank-and-file servicemembers. https://t.co/r1WSq2l2R1 https://t.co/5MpvtpB7ZZ","date":"Fri Oct 09 21:45:00 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Tomorrow is the 100th Birthday of my friend, Gail Halvorsen, the Berlin Candy Bomber. Gail is a true American patriot who exemplifies the best of UT. I hope @realdonaldtrump considers awarding Gail the Presidential Medal of Freedom for his remarkable efforts in the Berlin Airlift https://t.co/5iV7BUNwK0","date":"Fri Oct 09 17:51:12 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"I wish Utah had a thoughtful, print-media enterprise willing to delve into the important distinction between a democracy and a constitutional republic like ours.  https://t.co/w0oetfphnj","date":"Fri Oct 09 03:25:24 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"It’s a big deal, because in many ways, the whole idea of having a constitution itself, particularly a constitution that establishes a constitutional republic like ours, is materially different and distinct from a democracy. https://t.co/OQ6soFBJ3N","date":"Thu Oct 08 20:14:03 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Congratulations to Carol Hollowell of @switchpointcrc for being named an Entrepreneur of the Year 2020. What Carol and her team have done in partnership with their community is saving lives, building hope, and inspiring to all of us. Well deserved!","date":"Thu Oct 08 18:27:35 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Democracy isn’t the objective; liberty, peace, and prospefity are.  We want the human condition to flourish.  Rank democracy can thwart that.","date":"Thu Oct 08 06:24:16 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris what if most people wanted to burn books you thought were good?  The First Amendment would operate in a blatantly undemocratic fashion there.","date":"Thu Oct 08 06:22:36 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris here’s why you should agree that we’re not a democracy:  the whole point of a constitution is to tell majorities what they can’t do, regardless of how badly the majority wants them.  Free speech protections?  Totally anti-Democratic.","date":"Thu Oct 08 06:21:09 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris do you remember what @JoeBiden did to Robert Bork?  And CLarence Thomas?  And Sam Alito?  Those are just a few examples of your running mate’s divisiveness.  Call him whatever you want, but a unifier he is not.","date":"Thu Oct 08 02:33:34 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@SusanPage I blame you for much of that contention you just decried.  When you present your self as neutral but fail to be neutral, chaos and contention are the predictable results.","date":"Thu Oct 08 02:31:47 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@SusanPage, the answer to your question can be found in putting too many eggs in one basket.  The federal government—and the presidency itself—should not have this much power.  Vote for candidates who seek not for power but to pull it down.","date":"Thu Oct 08 02:30:17 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris how dare you accuse @realDonaldTrump and @VP of doing what you’re party has been trying for four years to do-deligtitinze a presidential election?","date":"Thu Oct 08 02:28:24 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris I couldn’t have been prouder of @realDonaldTrump when he signed into law the First Step Act.  I worked on this for nearly a decade.  Trump accomplished what previous presidents tried and failed to do.","date":"Thu Oct 08 02:27:15 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris stop race baiting.","date":"Thu Oct 08 02:25:22 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris not a democracy.  It matters.","date":"Thu Oct 08 02:25:06 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"Susan Page, that was disgusting.  He didn’t say that.","date":"Thu Oct 08 02:24:32 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris taking cheap shots based on race against your opponent isn’t a cost-free proposition. When you falsely accuse someone of racism, it causes problems.  Disagree with @realDonaldTrump and @VP if you want to, but accusing them of racism is irresponsible.","date":"Thu Oct 08 02:23:18 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@VP thank you for getting rid of the fly.","date":"Thu Oct 08 02:20:45 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris how will he bring us together when his running mate is relentlessly race baiting?","date":"Thu Oct 08 02:20:29 +0000 2020","user_id":"88784440"},{"handle":"SenMikeLee","text":"@KamalaHarris condemn violent protesters. Please condemn them, categorically.","date":"Thu Oct 08 02:19:52 +0000 2020","user_id":"88784440"}]