[{"handle":"SenRandPaul","text":"I asked, \"Can you tell me if anyone on the vaccine approval committees ever received money from the people who make vaccines?\"\n\nFauci : \"People who receive royalties are not required to divulge them.\" https://t.co/a0YIm2jfvZ","date":"Thu Jun 16 15:23:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The government recommends a booster for children despite Fauci admittedly not having any evidence to support their decision.\n\n\"That's not science. That's conjecture. And we should not be making public policy on it.\" https://t.co/fbZgBgN85Q","date":"Thu Jun 16 15:13:08 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/t6s0r0656l","date":"Wed Jun 15 22:54:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I forced the U.S. Senate to go on the record on fiscal responsibility with a vote on my “Six Penny Plan” federal budget that would have balanced within five years. https://t.co/q3BQdJwFvj","date":"Wed Jun 15 22:37:27 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Will be speaking soon on the Senate floor ahead of the vote on my 6 Penny Plan federal budget. Be sure to tune in! https://t.co/z3wJQWkEBj","date":"Wed Jun 15 20:58:29 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Join me and @TFASorg for the 2022 Capitol Hill Lecture Series! Watch live here: https://t.co/jDg0Lt0GUz","date":"Wed Jun 15 16:31:21 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy #FlagDay 🇺🇸! As always, you can request a flag flown over the U.S. Capitol from our website https://t.co/diTJ80WcSl https://t.co/eXl9en0E1l","date":"Tue Jun 14 15:11:17 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Hopefully members of Congress will take up the Penny Plan and work now to tackle this budget problem because it’s only going to get worse.” https://t.co/d04i7BCkLQ","date":"Fri Jun 10 17:05:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“The fact that we’re now at six pennies rather than one or two demonstrates that we can no longer kick the can down the road.” https://t.co/VrI1i3rXwT","date":"Fri Jun 10 17:05:37 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Senator Paul’s Six Penny Plan approach would take smart, incremental steps towards fiscal responsibility, cutting $0.06 for every dollar of spending.” https://t.co/Ma0YqZI71M","date":"Fri Jun 10 17:05:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“When I first heard about Senator Paul’s Penny Plan, I thought it was the most obvious, commonsense policy in the world.” https://t.co/h9QaIefDKV","date":"Fri Jun 10 17:05:17 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“At a time when Americans across the country are cutting their own budgets in the face of inflation, I don’t think it’s so much to ask that the federal government do the same.” https://t.co/pHuNqj5Hmh","date":"Fri Jun 10 16:50:30 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thanks to @Protectaxpayers for hosting this great conversation. Thanks to everyone who joined and gave a ringing endorsement of my Six Penny Plan! You can read more about it here: https://t.co/z7qim6g1aL","date":"Fri Jun 10 16:50:23 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: I joined the @Protectaxpayers to discuss my Six Penny Plan to address the debt! Americans everywhere are feeling the effects of historical high inflation and sustaining labor and supply chain issues. https://t.co/lN0O4FSgDV","date":"Thu Jun 09 17:47:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Don't miss this panel discussion about the federal budget! Watch here: https://t.co/yWfeu8jePB https://t.co/qUAEDH1VqC","date":"Wed Jun 08 22:25:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/KGLtf8G1Mb","date":"Wed Jun 08 21:56:09 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"On Monday, Paul introduced his \"Six Penny Plan,\" which he says will balance the federal budget within five years. With numerous financial troubles on the horizon, his plan is the legitimate solution our country desperately needs. https://t.co/NQi1O5JOsR","date":"Wed Jun 08 15:41:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’m hosting interns in DC and those interested should apply by July 8th for priority consideration! https://t.co/Vmzv1fG4vT","date":"Tue Jun 07 16:23:23 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We cannot keep ignoring this problem at the expense of taxpayers, and my budget will put our nation on track to solve this crisis that Congress created. https://t.co/PsSveR2LC5 https://t.co/Xl43ZtMzS8","date":"Mon Jun 06 20:15:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great meeting with community members in Adairville, Ky. As I’ve heard all across the Commonwealth, a top issue on their minds was inflation. Inflation might be an ‘invisible tax’, but Kentuckians are feeling it heavily at the gas pump and grocery store. https://t.co/D8u1fct1Hx","date":"Mon Jun 06 17:15:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"On my last stop today, I visited Druther’s of Campbellsville, Ky to present them with the Senate Small Business of the Week award. Druther’s continues to provide a sense of nostalgia that their loyal customers love. Congratulations to Steve and the entire Druther’s team! https://t.co/JCdh3kfcWb","date":"Fri Jun 03 20:55:15 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Another successful public forum with the liberty-loving citizens of Liberty, KY. Our country was uniquely conceived on the idea that our natural rights come from God, and Liberty embodies that spirit well. In fact, they even have their own replica Liberty Bell! https://t.co/7viAi8e3vW","date":"Fri Jun 03 20:33:58 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We had a great turnout at our public forum in Jamestown, Ky. I enjoyed discussing solutions to issues like inflation, workforce participation, and Biden’s border crisis. Thank you Russell County! https://t.co/zrQ8FZU87f","date":"Fri Jun 03 18:21:30 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: I had a great conversation about inflation and more on @kevinrobertstx! \n\nRand Paul: Calling Biden out for Rising Inflation https://t.co/agJhhYtCd8 https://t.co/2uYZMVYzCg","date":"Fri Jun 03 18:20:16 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning I met with the Barren County Chamber of Commerce. We agreed that county governments should be a model for federal government because they budget within their means and don’t have access to an unlimited printing press. https://t.co/LhS3TujsJB","date":"Fri Jun 03 17:08:16 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Glad to join @KevinRobertsTX to discuss the disaster inflation hurting KY and our entire country.","date":"Thu Jun 02 19:28:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’m proud to join pro-life senators pledging to block any bill that would undermine the Hyde Amendment, which prohibits taxpayer funding for abortion, or any other pro-life protections. https://t.co/4JH1a7obPZ https://t.co/kfbRCkl3ug","date":"Thu Jun 02 16:30:16 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We believe that the American taxpayer deserves to know the degree to which government doctors and researchers have a financial interest in drugs and products they support… https://t.co/VBqWKBUXBU","date":"Thu Jun 02 14:12:31 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It's #ThrowbackThursday! Here's a video of my previous Penny Plan to balance the budget. I'll never stop fighting for fiscal sanity. https://t.co/H6zjFcWeeZ https://t.co/bsnnjD47KY","date":"Thu Jun 02 13:35:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/A2RrSOVCzp","date":"Wed Jun 01 20:26:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy 230th Birthday Kentucky! I am beyond grateful to represent the people that make our Commonwealth great. https://t.co/qALc4ta0Zb","date":"Wed Jun 01 18:10:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"No one should have to play a complicated guessing game with the FDA simply to bring a safe, effective and affordable drug to market. The Increasing Transparency in Generic Drug Applications Act will help low-cost generics get to American consumers faster. https://t.co/KpUPJg0bMO https://t.co/tGiF53lBYj","date":"Wed Jun 01 13:57:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Those of us who still care about the Bill of Rights just got done taking down the DHS 'Ministry of Truth,' and a day later, Democrats want to create the DHS Thought Police. You couldn't make it up if you tried. But they don't stop there. https://t.co/TpxhUsfyGx https://t.co/tBpP8xFoyS","date":"Tue May 31 18:34:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I wish this authoritarian urge to censor speech would die along with the Disinformation Governance Board. https://t.co/9aYLSLrzRB https://t.co/288WEPRzrJ","date":"Tue May 31 15:15:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Last week I was proud to recognize Druther’s Restaurant of Campbellsville, Kentucky, as the Senate Small Business of the Week. https://t.co/3VjsgSUjDB https://t.co/KPwgjVYkyX","date":"Tue May 31 13:59:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This #MemorialDay, Kelley and I honor all those who gave their lives in service to our country. We are forever grateful to these brave men and women who made the ultimate sacrifice, and we send our thanks to our veterans and those who are currently serving this great nation. https://t.co/mYwknH2p9K","date":"Mon May 30 14:30:52 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: Earlier this week I joined @JesseBWatters to discuss the dangers of the WEF and the elites. https://t.co/6osukTQK7v https://t.co/xkf5o9CPWt","date":"Fri May 27 21:11:55 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Biden's censors want Russian-style speech controls and they haven't given up | Fox News https://t.co/EVkq7old9e","date":"Fri May 27 19:25:23 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I spoke on the floor against an outrageous bill that insults our service members and police. https://t.co/LGc27kqc3h","date":"Thu May 26 15:17:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I'll be speaking on the Senate floor shortly! Watch here: https://t.co/z3wJQWCfZT","date":"Thu May 26 14:34:58 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":".@danosseasoning is a remarkable example of how hard work, ingenuity, and discipline can turn a dream into reality. Congratulations to Dan and the entire team at Dan-O’s Seasoning on being a recent Senate Small Business of the Week! https://t.co/EQWEWWVvKv","date":"Mon May 23 17:11:51 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I just saw Sheriff Corman a few weeks ago in Jessamine County and am so saddened by this news. Sending prayers and condolences to the family and community.  https://t.co/Sq4gQgdWum","date":"Mon May 23 14:55:24 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today we celebrate the brave men and women who defend this great nation. Thank you. #ArmedForcesDay2022","date":"Sat May 21 17:58:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"There are ramifications to this mountain of debt.  Make no mistake, inflation is here and it is rip-roaring and on the rise. https://t.co/DVYlBWysIE","date":"Thu May 19 19:42:39 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We sent $40 billion out before lunch and they want to send $48 billion more after lunch. It's time to end the bailouts. https://t.co/GzkVZk2oPH","date":"Thu May 19 18:35:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The government must stop borrowing money, stop printing money, and quit digging the hole deeper. https://t.co/NOeEEldIpk","date":"Thu May 19 14:22:04 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"While the Biden Administration and government bureaucrats stand idly by – yet again – to watch a crisis run out of control, my bill offers a commonsense solution. https://t.co/aZ2MEP4M4q","date":"Thu May 19 13:48:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/8oCKwU6EcR","date":"Wed May 18 23:14:35 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"While the Biden Administration and government bureaucrats stand idly by – yet again – to watch a crisis run out of control, my bill offers a commonsense solution…https://t.co/RL4cXE1gnq","date":"Wed May 18 21:38:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kelley &amp; I were deeply saddened to hear of the tragic loss of a Calloway County Deputy while serving and protecting his community. Please join us in keeping the family and friends of this brave Kentuckian and public servant in your thoughts and prayers.\nhttps://t.co/UqCHupcB2g","date":"Tue May 17 21:39:16 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"In times like these, we would be well-advised to heed Jefferson’s wisdom and pursue a course of “peace, commerce, and honest friendship with all nations, entangling alliances with none.” https://t.co/bnvau7ptYH","date":"Tue May 17 21:01:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congress will do what Congress does best – spend other people’s money.  I, for one, will not.  I will vote no.  Somewhere, somehow a voice of fiscal sanity must remain vigilant, must remain stalwart and steady in a sea of fiscal madness. https://t.co/T9i8IzgKMp","date":"Tue May 17 19:52:19 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning, I met with the @BGChamber to discuss business growth and rising prices throughout Kentucky. Inflation doesn’t just happen. It is a direct result of overbearing government policies, and I fear it’s only going to get worse with further reckless spending. https://t.co/PKjaBj7AKN","date":"Mon May 16 21:30:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to be at Coleman Crest Farm to discuss second chance job initiatives in the greater Lexington area. Keep up the good work! https://t.co/4dy2et6ejR","date":"Fri May 13 20:25:34 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Got to visit @birddogscoffee in Owenton to recognize them as another recent Small Business of the Week. Kasey and Randy have created a welcoming café with delicious food and a hospitable atmosphere. I look forward to watching their continued growth and success in Kentucky. https://t.co/OWjyJcND0U","date":"Fri May 13 17:51:10 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, I recognized @NFDistilling in Sparta, as a recent Small Business of the Week. The Neeley family proudly honors its rich history by continuing the 11 generation tradition of fine Kentucky craftsmanship. Congratulations to the Neeley family and the entire distillery team! https://t.co/rSIzBN6bLB","date":"Fri May 13 15:28:08 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning, I traveled to Covington to honor Officer Anthony E. Jansen, Sr. and his sacrifice, the sacrifices of his family, and the sacrifices of all Kentucky Law Enforcement Officers who have paid the ultimate price to protect our Commonwealth. #NationalPoliceWeek https://t.co/XdHupdHRBC","date":"Fri May 13 13:50:17 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The biggest threat the U.S. faces is inflation, debt, and destruction of the dollar. https://t.co/hIfaIkCDD1","date":"Thu May 12 20:40:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I was joined by the Kentucky FOP today to discuss their important role in protecting our communities.\n\nHappy #NationalPoliceWeek https://t.co/fHZgELNzti","date":"Thu May 12 20:00:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thanks to @VPrasadMDMPH @MartyMakary @DrJBhattacharya @MartinKulldorff, and Dr. Scott Atlas","date":"Thu May 12 17:06:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"There is no scientific reason to continue mask and vaccine mandates for Senate pages so I went to the floor to fix it!\n\n\"Now in the halls of Congress, we have created a privileged class that can choose whether to get vaccinated and an underclass that has to abide by dictate.\" https://t.co/YobA23p4HR","date":"Thu May 12 16:40:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/THgxMsB7iP","date":"Wed May 11 19:57:33 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: Last night I joined @Jesseprimetime to discuss Biden's board to govern disinformation! https://t.co/N6Y0w8GUVN","date":"Tue May 10 18:21:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was my pleasure talking to students at South Warren High school about the importance of everyone being able to express their opinion and using the Constitution as a guide for how much or how little government we have. https://t.co/DeR2EVXVEy","date":"Tue May 10 14:42:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"All Americans, and particularly those who serve in the Senate, should heed the advice of Washington and Jefferson and preserve the freedom to pursue American national interests. https://t.co/Q0iyjsKthw","date":"Mon May 09 15:51:19 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I questioned @SecMayorkas on this truly Orwellian Disinformation Governance Board. The American people do not need the federal government to tell them what the truth is. https://t.co/nsHCKmioqr","date":"Mon May 09 14:57:39 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’d like to share this with everyone for #NationalDayofPrayer! https://t.co/qTYLzyQVv0","date":"Thu May 05 18:23:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I think the American people can figure out the truth. We don’t need the government to act as the arbiter of truth. https://t.co/htridFJRHz","date":"Thu May 05 14:18:25 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The DOD is attempting to encourage 5th graders toward interests in STEM topics by operating a week-long camp-style experience called STARBASE and spending $35 million in the Fiscal Year 2020 to do it.\n\n#Maythefouthbewithyou On this #WasteReportWednesday https://t.co/RJIl5svIod","date":"Wed May 04 22:03:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"\"How are we ever going to come to an agreement on what is disinformation so you can police it on social media? ... I think you have no idea what disinformation is.\" https://t.co/D1FsMyE2AF","date":"Wed May 04 21:00:50 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This vote brings us one step closer to ensuring that this never happens in the future and prohibits taxpayer dollars from being used to fund dangerous and unnecessary research in China…\nhttps://t.co/PemVVHQzPr","date":"Wed May 04 19:33:50 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Speaking soon on the Senate floor on my motion to stop gain-of-function research funding in China. Tune in: https://t.co/z3wJQWCfZT","date":"Wed May 04 18:25:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to speak at the Novelis groundbreaking ceremony in Guthrie, KY today for their automotive recycling center! The new facility will create over 140 Kentucky jobs. https://t.co/HT647K6AJZ","date":"Mon May 02 18:06:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Join Down 4 Dawson April 30th to help clean up Dawson Springs, Kentucky! https://t.co/9nk6r4okLn","date":"Fri Apr 29 21:48:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This week, it is my privilege to recognize the small business, A Place To Belong Home Care of Radcliff, Kentucky, as the Senate Small Business of the Week. https://t.co/WmKX81KoWk","date":"Fri Apr 29 16:18:52 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul, @SenRickScott, @SenRonJohnson, @SenatorLankford, @HawleyMO, and @SenatorRomney Send Letter to SBA Administrator Guzman Requesting Information on Illegal PPP Loans to Planned Parenthood Affiliates ➡️ https://t.co/1OoPZLXDg6 https://t.co/ltmwK1BkDP","date":"Thu Apr 28 17:04:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: Administrator Guzman claims to ‘believe in transparency’ yet she continues to refuse to give us the information we’ve asked for. https://t.co/tzklfCl8Yw","date":"Thu Apr 28 16:09:01 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Republicans led by Sen. Rand Paul, sent a letter to Small Business Administrator Guzman demanding to know why the agency has continued to provide Paycheck Protection Program loans to Planned Parenthood affiliates despite being ineligible for the funds.\nhttps://t.co/OwJiPMPYVE","date":"Thu Apr 28 14:14:29 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Coming up on @FoxNews with @seanhannity. Tune in!","date":"Thu Apr 28 01:37:41 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/Ty0f18Rhp5","date":"Wed Apr 27 21:11:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul presents Imogene’s Alterations with Small Business of the Week\nhttps://t.co/QBUQSJYXbI","date":"Mon Apr 25 17:47:27 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congrats to Clay county on setting the world record for tallest Red Hickory!\nhttps://t.co/9g1wsvKhDZ","date":"Mon Apr 25 14:38:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Honors Powell Valley Millwork as Senate Small Business of the Week https://t.co/aWkJSNxGEd","date":"Sat Apr 23 20:27:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul speaks to Lexington FOP about supporting our police https://t.co/ObbM5OYzWW","date":"Fri Apr 22 17:28:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Paul honors The Seasonal Shoppe as Senate Small Business of the Week https://t.co/Dk9fDk7Gke","date":"Thu Apr 21 20:19:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It’s #420day so this #WasteReportWednesday we’d like to remind you of the time the NIH wasted $3,125,768 of your money on Baby Boomers and edibles. #420 https://t.co/vUsJVt9lgw","date":"Wed Apr 20 18:32:11 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“As Ronald Reagan once quipped, \"Republicans believe every day is the Fourth of July, but the Democrats believe every day is April 15,\" Tax Day in most years.” https://t.co/QLfGo2iqQm","date":"Wed Apr 20 14:51:03 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I hate to add insult to injury on #TaxDay but here are just a few examples of how your money is being wasted. It has to stop. Find me on Instagram to see more: https://t.co/hHdIjMH0Lz https://t.co/4P5393Sfrn","date":"Mon Apr 18 16:46:21 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kelley and I wish you a blessed Easter @KelleyAshbyPaul https://t.co/uptk4SKcKi","date":"Sun Apr 17 16:43:48 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"From my first day serving Kentucky until my last, I pledge to uphold my promise, as few ever do, and fight for fiscal sanity in our federal government. https://t.co/TzWqREuHyt","date":"Fri Apr 15 16:05:36 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congratulations to the Louisville Small Business Development Center for receiving the Small Business Development Service Excellence and Innovation Award, one of just three Outstanding Resource Partners to be recognized by the SBA!\n\nhttps://t.co/jqmt3U6i7L","date":"Thu Apr 14 19:56:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great news for Bowling Green! Always great to see more jobs and economic growth coming to Kentucky! https://t.co/gZefy75611","date":"Wed Apr 13 20:18:47 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congratulations to the team at Kentucky’s @duPontManual whose hard work &amp; engineering skills earned them a spot in the 2022 @RocketContest National Finals – the world’s largest student rocket contest! Good luck at the Finals on May 14! #RocketContest22 https://t.co/SOfH7VGtOp","date":"Wed Apr 13 19:17:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/UHaN9Yy2H7","date":"Wed Apr 13 19:02:36 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Paul said he wanted to meet with police officials in order to lend his support in the face of the movement to “defund the police,” as well as to listen to concerns from the everyday beat cops working the streets of northeastern Kentucky.” https://t.co/czPrmr6Yy5","date":"Wed Apr 13 14:36:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congratulations to Kelsey and her family and the entire team at Kelsey’s On Main for being Senate Small Business of the Week. I wish them the best of luck and look forward to watching their continued growth and success in Kentucky! https://t.co/o2tBFLdZpE","date":"Tue Apr 12 19:40:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Stopped in Pippa Passes at @ALCeagles to meet with students, faculty, and staff. We had a great discussion on ways to make college more affordable, including their student work program which allows students to pay for their education by working on campus. https://t.co/jNmAoElTgx","date":"Tue Apr 12 18:38:48 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to meet with so many Kentuckians in Louisa and Inez. All across the Commonwealth, people are concerned about rising prices. Nothing in life is free, and because of reckless government spending, American’s everywhere are paying the price through inflation. https://t.co/x8tsQu7Y3a","date":"Tue Apr 12 16:45:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Started the day in Ashland, Kentucky, with a law enforcement roundtable. Rather than defunding the police, we must support these brave men and women who protect our communities. https://t.co/sjOo1dhPIB","date":"Tue Apr 12 13:10:11 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop today was in Bath Co. where I got to meet with local leaders. We discussed burdensome government regulations and my efforts in the Senate to cut red tape and get the government off the backs of the American people. https://t.co/wS903n4Kwm","date":"Mon Apr 11 19:59:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy #NationalPetDay!\n\nMy bill, the FDA Modernization Act of 2021, is a bipartisan piece of legislation that would end mandatory animal testing once and for all. https://t.co/EKMV1V2rVw","date":"Mon Apr 11 18:58:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to be in Paris, Kentucky, to meet with the Bourbon County Chamber of Commerce. We discussed Washington, DC’s spending addiction and my penny plan to balance our nation’s budget. https://t.co/IYkTSrH0RN","date":"Mon Apr 11 17:59:34 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Too often we hear an account of another police officer in our nation coming under attack while carrying out their daily duties, protecting the citizens of their community. It was a privilege to recognize Trooper Sanguigni of @kystatepolice and Officer Faoro of @kyfishwildlife. https://t.co/SO55Vfi2Yp","date":"Mon Apr 11 15:48:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/lQHCovXWBz","date":"Wed Apr 06 17:14:51 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Coming up on @AmericaRpts with @SandraSmithFox. Tune in!","date":"Tue Apr 05 18:12:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“We can make it worse for the Ukrainian people with escalation and intervention, he added. ‘Almost all war ends in negotiation,’ he charged. ‘It doesn’t justify (Putin’s) aggression, but I do think we need to find off ramps and exits even for our enemies’.”https://t.co/20TljKzwly","date":"Fri Apr 01 14:59:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The American people deserve to know how this pandemic started, to know if the NIH funded dangerous gain-of-function research that may have caused this pandemic, and to remove from office anyone, such as Dr. Fauci, who let this happen. https://t.co/8kIipaLy7x","date":"Thu Mar 31 16:41:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This week, it is my privilege to recognize the small business, Our Best Restaurant of Smithfield, Kentucky, as the Senate Small Business of the Week. https://t.co/VQEF8CFyb1","date":"Thu Mar 31 14:54:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you don’t define what human-rights abuses are, you set up something so wide open that… a president [could] sanction anyone in the world for anything they feel like.\nhttps://t.co/fHSkNJa2LA","date":"Wed Mar 30 22:10:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/Be9d1QpKpz","date":"Wed Mar 30 19:46:30 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Anyone interested in fixing this supply chain fiasco should look to one economic system that has created more wealth, more prosperity and lifted more people out of poverty --- Capitalism. https://t.co/fhm4dWMQbE","date":"Wed Mar 30 19:33:28 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"What an inspiring example of the American dream https://t.co/C49SoievaH","date":"Wed Mar 30 19:02:08 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We take this day to honor the sacrifices of the men and women who fought in the Vietnam War. If you’re a veteran in need of assistance with the VA, please reach out to my office and visit: https://t.co/JjiXbezOYn #VietnamVeteransDay","date":"Tue Mar 29 17:35:52 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“I have legislation in the Senate to fix the issue, a resolution to give members ample time to read the bills before they vote. It would also increase transparency and incentivize legislation to be shorter.\" https://t.co/VcGWe8m8c6","date":"Tue Mar 29 16:11:25 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Seasonal Shoppe of Salyersville, KY demonstrates the integral role small businesses play in the daily life of small towns across the country. I am thankful for the chance to honor these entrepreneurs and what they represent. Congrats to Bekah and the entire Seasonal Shoppe team! https://t.co/9viO6l1xfT","date":"Sat Mar 26 14:46:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to be at Natural Bridge State Park today to meet with Kentuckians and discuss the impact tourism and recreation has on their communities! https://t.co/tuXxInV3Vq","date":"Fri Mar 25 18:28:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Small businesses like @PVMillwork are the core of small towns across Kentucky, and like the lumber they use, their roots grow deep to help our communities flourish. Congratulations to the Thornberrys and the entire Powell Valley team on being Small Business of the Week! https://t.co/Jii3799r8W","date":"Fri Mar 25 15:58:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I am privileged to meet young men and women like Officer Pauleus throughout Kentucky, and am honored to recognize one example from among their ranks today.","date":"Fri Mar 25 14:07:46 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, I recognized a member of @lexkypolice, Officer Junior Pauleus, who was shot in the back at close range this past February as he was conducting a routine investigation with other members of the Lexington police force. https://t.co/HHujj4cflK","date":"Fri Mar 25 14:07:45 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I was in Louisville for a follow-up meeting with Christopher 2X and the Future Healers program, where we met with a young Kentuckian who was blinded by violence. We continued discussions about the Future Healers’ important efforts to positively affect Louisville’s youth. https://t.co/lolpXwjCEG","date":"Fri Mar 25 13:20:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI this morning I joined @newsmax to discuss Ukraine and my plan to fire Fauci and pursue an investigation. https://t.co/vNU5CfyDcy","date":"Thu Mar 24 16:31:37 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Paul explains how inflation works to Democrats - it's debt and spending. https://t.co/nCzeRRk8BT","date":"Tue Mar 22 21:19:55 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"For all the president’s promises about raising taxes only on the rich, all Americans pay inflation’s \"hidden tax\" – at the gas pump and checkout counters, in utility bills, rents and car payments.  https://t.co/qH4CexGZz1","date":"Tue Mar 22 13:10:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to be in Louisville this morning with my friend @2xGameChangers &amp; his Future Healers Got Zoo Buddies program, where I was able to meet Malakai Roberts, a young Kentuckian who was blinded by violence last year. https://t.co/LnBk8uzVL9","date":"Mon Mar 21 16:15:22 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We also continued discussions about @futureheallersky’s efforts to positively affect Louisville’s youth &amp; their new awareness campaign for healthy eyes, inspired by Malakai. Thank you to @KYCommishGlass, @KSBWildcats, @KosairCharities, @LouisvilleZoo &amp; @UofLHealth for your work!","date":"Mon Mar 21 16:15:22 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Each week I recognize an outstanding Kentucky small business that exemplifies the American entrepreneurial spirit. This week, it is my privilege to recognize the Seasonal Shoppe of Salyersville, Kentucky as the Senate Small Business of the Week! https://t.co/Rg7U72ZbxY","date":"Fri Mar 18 20:00:16 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My resolution will not only give members ample time to read and review all legislation before they vote but also incentivize legislation to be shorter.\n\nGood legislation shouldn’t need to be thousands of pages long. https://t.co/5guYYix9rx","date":"Fri Mar 18 15:43:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: I joined Fox &amp; Friends this morning on @FoxNews to talk about the Senate’s bipartisan rejection of Biden’s travel mask mandate on planes, trains, and other public transportation. \nIt’s time to end these mandates, and end the charade!\nhttps://t.co/3bkVr4GF7h","date":"Thu Mar 17 14:57:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, I spoke at the @SmallBizCmteGOP hearing on small business franchising. It's 100% clear that small businesses do not need to face any more red tape. https://t.co/rgV12lSfWd","date":"Wed Mar 16 19:21:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesdays\n\nThe National Science Foundation (NSF) granted Giant Screen Films $2,453,100 in an attempt to promote dinosaurs and reach millions of theatrical viewers across the U.S. https://t.co/iCvCuFhg7W","date":"Wed Mar 16 18:12:37 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Now is our chance to say enough is enough. We have it within our power, to assure the American people that we are irreversibly going back to normal. We can tell Americans that the unscientific mask mandates are on the way out once and for all. \nhttps://t.co/SaMnq2Ks1D","date":"Wed Mar 16 14:04:33 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul forces vote against “nonsense” travel mask mandates\nhttps://t.co/L9ljJLc2uR","date":"Wed Mar 16 02:02:29 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As the entire world is learning to live with COVID, the federal government still uses fear mongering to stubbornly perpetuate its mandates, rather than giving clear-eyed, rational advice on how to best protect yourself from illness.","date":"Tue Mar 15 22:53:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Since March 2020, unelected bureaucrats have incessantly declared that we should ‘follow the science.’ But the same bureaucrats continue to defy science by imposing an ineffective and restrictive mask mandate for individuals traveling on public transit and airplanes.","date":"Tue Mar 15 22:53:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"That is why, I forced this vote, and I applaud the Senate for rejecting this nonsense on a bipartisan basis, voting 57-40.","date":"Tue Mar 15 22:53:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, the Senate said enough is enough, and sent a message to government bureaucrats to stop the anti-science, nanny state requirement of travel mask mandates.","date":"Tue Mar 15 22:53:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"During my time in the Senate, farmers, small businesses, and I have fought side-by-side to cut the bureaucratic red tape that impedes economic growth. This bill is no exception. https://t.co/WuF5Fjojg1","date":"Tue Mar 15 16:46:27 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"No one person should have unilateral authority to make decisions for millions of Americans. https://t.co/ggOEuZOKRm","date":"Mon Mar 14 21:21:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This will create accountability and oversight into a taxpayer funded position that has largely abused its power, and has been responsible for many failures and misinformation during the COVID-19 pandemic. https://t.co/ZkDedqq9Fv","date":"Mon Mar 14 18:16:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We’ve learned a lot over the past two years, but one lesson in particular is that no one person should be deemed “dictator-in-chief.” I’ve introduced an amendment to eliminate Dr. Fauci’s position as Director of the NIAID, and divide his power into three separate new institutes.","date":"Mon Mar 14 18:16:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I spoke at the 2022 Kentucky Fraternal Order of Police Convention in Owensboro. I thank the law enforcement in attendance and those across Kentucky for always having mine and my family’s back. I will always continue to have yours. https://t.co/2Mb3zbOVHc","date":"Sat Mar 12 17:07:21 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Small businesses like Burchett’s Heating and Cooling are the lifeblood of small towns in Kentucky, and serve as an inspiring example of entrepreneurial spirit that transcends across generations. Congrats to the entire Burchett team on being Senate Small Business of the Week! https://t.co/0d2Mt4zNyH","date":"Fri Mar 11 18:25:33 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"You can read my resolution to ensure Congress has time to Read the Bills here: https://t.co/tFlj7v8XGR","date":"Fri Mar 11 14:37:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I stand by my pledge to increase transparency and accessibility in the U.S. Senate, and my resolution would not only give members ample time to read all legislation before they vote but also incentivize legislation to be shorter.","date":"Fri Mar 11 14:36:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If my resolution was enacted, the current omnibus bill would take 137 days to be called for a vote in the Senate. Which would allow enough time for congress to actually READ THE BILLS and understand their impact.","date":"Fri Mar 11 14:36:58 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The 2741-page omnibus with a $1.5 trillion price tag that was released in the middle of the night is a perfect example of why Congress needs time to read the bills.","date":"Fri Mar 11 14:36:58 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Do you think there is a single person in the U.S. who believes that Congress is filled with speed readers capable of digesting thousands of pages in a matter of hours?","date":"Fri Mar 11 14:36:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My resolution would require bills, amendments, and conference reports to be filed for 1 day for every 20 pages before they can be considered, while leaving legislators room to act in emergencies.","date":"Fri Mar 11 14:36:57 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"In light of the recent $1.5 trillion spending package, I’m renewing my call for the Senate to pass my Read the Bills resolution which would provide sufficient time for legislation to be thoroughly reviewed.","date":"Fri Mar 11 14:36:56 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The United States cannot proudly affirm human rights to be at the center of our foreign policy, while it arms a regime at war with its own people. That is why I forced the Senate to vote on a resolution that would cancel the latest military sale to Egypt’s criminal masters. https://t.co/JfxLEjbVxL","date":"Thu Mar 10 22:12:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI This morning I joined Fox 56 to discuss the travel mask mandates and Ukraine! https://t.co/1ucxVTRibm","date":"Thu Mar 10 17:20:08 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesdays https://t.co/sxk4OuhJgy","date":"Wed Mar 09 18:10:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Proud to receive a score of 100 from the @RLibertyCaucus as a Top Defender of Liberty for 2021! https://t.co/FkDj3cnkns https://t.co/gM3dSyQOVt","date":"Wed Mar 09 18:10:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’m pleased to have worked with Senators Cory Booker and Tim Scott to strengthen the language of this bill, which will ensure that federal law will define lynching as the absolutely heinous crime that it is…https://t.co/GIISrl6Xqk","date":"Tue Mar 08 00:53:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The hawks in Congress will gnash their teeth and lament that no such promise should ever be made but a promise of neutrality gives up nothing and actually positions Ukraine to have both Russia and Europe compete for her interest. https://t.co/w9HbAToRr5","date":"Mon Mar 07 15:34:08 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Small businesses like the Neeley Family Distillery are the lifeblood of towns across KY, &amp; the rich history of bourbon is an intricate detail in the fabric of our Commonwealth. Congrats to the Neeley family &amp; the entire distillery team on being Senate Small Business of the Week! https://t.co/SpTe50syK3","date":"Fri Mar 04 21:28:22 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We owed it to Marie Thompson, to Emmett Till, and to the over 4,700 other victims of lynching in this country to get the law that honors them right. https://t.co/6KbjinU4aK","date":"Wed Mar 02 21:38:54 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday https://t.co/PAPvwTxNFm","date":"Wed Mar 02 18:01:10 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great article from my wife @KelleyAshbyPaul about the important work being done by @hopehousebg! https://t.co/cTWjLL8Kj1","date":"Wed Mar 02 15:16:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Every day Americans see their freedom, jobs, and livelihoods stolen from them by petty tyrants drunk on power with lockdowns and mandates…For now, keep fighting and hoping that our best days can and will be ahead of us. #SOTU https://t.co/DfMJt9yzTr","date":"Wed Mar 02 03:36:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It’s almost time for the #SOTU. Don’t miss my response!","date":"Wed Mar 02 01:03:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I am forcing a vote to repeal travel mask mandates on public transportation and put a stop to this anti-science, nanny state requirement. https://t.co/sOYgLVPK9f","date":"Tue Mar 01 18:53:04 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kentucky farmers not only work hard to feed our state, but also feed the world. It was great to be with @KYFB this morning and see so many friends in our nation’s capital. https://t.co/sYBYyPEjbY","date":"Tue Mar 01 15:51:41 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":".@hopehousebg is something that really will save people and we have to do everything we can. Their new woman’s facility and program will make a huge difference in the lives of women suffering from addiction. https://t.co/JAtLChvwst","date":"Tue Mar 01 15:00:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’m pleased to have worked with Senators Cory Booker and Tim Scott to strengthen the final product and ensure the language of this bill defines lynching as the absolutely heinous crime that it is, and I’m glad to cosponsor this bipartisan effort in the Senate.","date":"Tue Mar 01 00:59:33 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I've led the fight to protect life – from defunding Planned Parenthood to stopping your tax dollars from funding abortion, and tonight I stand strongly opposed to the Democrats' bill that would allow abortion on demand until birth.","date":"Mon Feb 28 23:03:39 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"After a series of flight cancellations and delays, it is clear I will not be able to make it from Kentucky to Washington for tonight’s vote. I am strongly opposed to this bill and would have voted against it.","date":"Mon Feb 28 23:03:39 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"When the Senate returns to session, I will force a vote to repeal travel mask mandates on public transportation and put a stop to this anti-science, nanny state requirement. \nMORE ⤵️\nhttps://t.co/eNurPVPEAT","date":"Fri Feb 25 18:14:26 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Since March 2020, unelected bureaucrats have incessantly declared that we should ‘follow the science.’ But the same bureaucrats continue to defy science by imposing an ineffective and restrictive mask mandate for individuals traveling on public transit and airplanes…","date":"Fri Feb 25 18:14:25 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We will keep an open mind, making no rushed or harsh judgments ahead of time, and judge the nominee based on their character, experience, and their knowledge of the law. https://t.co/ht4vx6zjpx","date":"Tue Feb 22 22:56:32 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“The government's fiscal irresponsibility and reckless administrative application were the impetus for Paul's letter.” https://t.co/47RzJmn7bz","date":"Tue Feb 22 14:47:33 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy #PresidentsDay  https://t.co/eeaSy83RC3","date":"Tue Feb 22 01:25:25 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy #NationalLoveYourPetDay. It’s important we make sure the government doesn’t force companies to torture man’s best friend.","date":"Sun Feb 20 19:41:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As tyrants shrink back, keep up the pressure against mandates! https://t.co/YurVOeWbfB","date":"Fri Feb 18 18:50:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As Ranking Member of @SmallBizCmteGOP, each week I recognize an outstanding KY small business that exemplifies the American entrepreneurial spirit. This week, it is my privilege to recognize Farm Girl Gifts and Bake Shop of Corydon, KY. https://t.co/Ov3htBogjy","date":"Fri Feb 18 18:49:48 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/xMMCVsyBv5","date":"Wed Feb 16 21:53:00 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Yesterday, I joined @seanmspicer and @lyndsaymkeith on @newsmax to discuss President Biden's recent remarks on the Ukrainian situation. \n\nhttps://t.co/oqm25Udf5W","date":"Wed Feb 16 18:54:19 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We have consistently opposed President Biden’s federal COVID-19 vaccine mandates, which would force millions of Americans to choose between an unwanted medical procedure and being able to provide for their families. https://t.co/H0P3LAvll6","date":"Mon Feb 14 23:06:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The United States cannot proudly affirm human rights to be at the center of our foreign policy, while it arms a regime at war with its own people. https://t.co/hndx7dx1H4","date":"Mon Feb 14 20:46:43 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy Valentine's Day America!\n\nOn average Americans will spend $175 on candy, cards, flowers and other romantic gifts. This years number is up from $164 last year. It seems that love and wasteful spending are both in the air this year. Even your Gov. seems to feel the love! https://t.co/ATL2XQ91gl","date":"Mon Feb 14 16:57:11 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My FDA Modernization Act offers humane alternatives to barbaric experiments on beagles, like those funded by Dr. Fauci with your tax dollars.  While I can assure you #PaulsPups are safe, we need to make sure the government doesn’t force companies to torture man’s best friend... https://t.co/GnpauYMnZu","date":"Tue Oct 26 21:09:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As R.M. of the @SmallBizCmteGOP each week I recognize an outstanding Kentucky small business that exemplifies the American entrepreneurial spirit. This week, it is my privilege to recognize, @CruiseFlags of Shepherdsville, Kentucky, as the Senate #SmallBusinessoftheWeek. https://t.co/6Bcu2Kxcfj","date":"Fri Feb 11 18:22:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We may disagree on politics and there's a good chance he's going to pick somebody that has a much different understanding of the Constitution than me and I'll voice my differences on that. But we can be respectful. https://t.co/yYZs2fhL5t","date":"Fri Feb 11 16:45:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"A true bipartisan criminal justice reform movement must defend the civil liberties of all Americans, regardless of race, religion, socioeconomic level, and political persuasion. https://t.co/iRo7h6Srjw","date":"Thu Feb 10 15:32:46 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: Earlier this week, I joined Eric Bowling with Newsmax to discuss mask mandates and the hysteria surrounding Covid.\n\nhttps://t.co/S1gYW01I9s","date":"Wed Feb 09 22:07:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/EvTQnPo893","date":"Wed Feb 09 18:13:17 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I have been telling everyone since the beginning that Dr. Anthony Fauci and other public health officials were NOT following science, and I’ve been proven right time and time again. \n\nEnd the mask mandates for our children. https://t.co/AwkWewD1QY","date":"Wed Feb 09 16:21:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kentucky Congressional Delegation Contacts @POTUS in Support of @GovAndyBeshear’s Request for a Major Disaster Declaration for tornadoes and severe weather on December 31, 2021- January 2, 2022: https://t.co/3hSuQgmpm1","date":"Wed Feb 09 14:59:47 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I joined @HillTVLive to discuss vaccination, mask mandates, Dr. Fauci, and natural immunity. https://t.co/fk5amIy3Im","date":"Tue Feb 08 19:59:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"FEMA has put out new resources for helping children cope with trauma after the Kentucky tornadoes. https://t.co/wQjeJJD9fU","date":"Mon Feb 07 22:44:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Each week I recognize an outstanding Kentucky small business that exemplifies the American entrepreneurial spirit. This week, it is my privilege to recognize the small business, Olive You Boutique of Richmond, Kentucky, as the Senate Small Business of the Week! https://t.co/q35M1tgATR","date":"Fri Feb 04 19:52:01 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI This morning, I spoke with Wake Up America to highlight the hypocritical vaccine mandates destroying our local businesses.\n\nhttps://t.co/M8vBNwrsWz","date":"Thu Feb 03 17:50:36 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI, Yesterday I joined Fox to share my thoughts on the newly released John Hopkins University report that shows the lockdowns set in place during the Spring of 2020 only reduced COVID mortality by 0.2%.\n\nhttps://t.co/2zPtVd8mTy","date":"Thu Feb 03 14:50:40 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/xVBqxruAHm","date":"Wed Feb 02 22:22:50 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The American people should be appalled... https://t.co/aE9iWqWxOz","date":"Tue Feb 01 21:50:54 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Watch Biden bureaucrat when asked over 10 times refuse to acknowledge that citizens have a right to know how $ is spent\n\nhttps://t.co/ePws8isESO","date":"Tue Feb 01 21:01:52 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Join me and @TFASorg this Wednesday for a webinar: Capitalism, Socialism + the Arguments for Liberty https://t.co/LoQujV872X","date":"Mon Jan 31 20:02:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"'Draconian' COVID Protocols at US Universities: John Hopkins Prof. and Rand Paul Sound Off | CBN News https://t.co/q3LMiZWBnS","date":"Fri Jan 28 18:38:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It's about the truth. Plain and simple. https://t.co/OPUApA7GNy","date":"Fri Jan 28 18:11:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I think the mask mandates are wrongheaded and unscientific, but also these draconian things that they're asking of students, I think it's unfair to the students, but really, parents need to wake up.\nhttps://t.co/q3LMiZW3yk","date":"Fri Jan 28 17:18:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you or someone you know is interested in joining my Washington D.C. office this Summer, go to my website to apply! https://t.co/QJ0WliTIyI","date":"Fri Jan 28 15:09:38 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The idea that a government official would claim to unilaterally represent science and that any criticism of that official would be considered a criticism of science itself, is quite dangerous... https://t.co/A6xUmP6V4r","date":"Thu Jan 27 21:20:07 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"On #HolocaustRemembranceDay, we honor and mourn the millions of lives taken, and stand with those who survived. We must always be vigilant against the kind of hate that leads to such evil. https://t.co/4JuAB2AJAN","date":"Thu Jan 27 20:03:04 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul makes stop in E'town | Local News | https://t.co/T4PTKSS8dw https://t.co/zwdjRTxgRa","date":"Thu Jan 27 16:12:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Finished up the day in Brandenburg and Brownsville where we discussed rising prices, interest rates, and debt. https://t.co/gySFVinC6j","date":"Wed Jan 26 23:39:25 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If Fauci cared a fig about saving lives, he would be touting early treatment with monoclonal antibodies at each of his myriad daily press appearances. https://t.co/db5MgIG1YG","date":"Wed Jan 26 22:35:13 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/603Rf4Rr4t","date":"Wed Jan 26 22:03:09 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/VEXUcBAngq","date":"Wed Jan 26 21:08:28 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in Munfordville and Elizabethtown this morning to meet with Kentuckians! We discussed COVID treatments and anti-American mandates. \n\nIt is my hope that Americans will, once again, rally to the cause of freedom and reject medical tyranny. https://t.co/ApMJFPy0DA","date":"Wed Jan 26 18:09:31 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/Ugaq1FKT9L","date":"Wed Jan 26 17:05:14 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you @BGMU for your hard work restoring power and providing relief to those in need following December’s deadly tornadoes. \nhttps://t.co/9yhLfYHCaP","date":"Sat Jan 22 17:02:54 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Proud to have an A+ rating defending life!","date":"Fri Jan 21 18:09:34 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"With today marking the 49th annual #MarchforLife I ask: Can a nation founded in Liberty carry its head high when it denies protection to the youngest and most vulnerable of its citizens? Today I stand up and march to defend those who can't defend themselves. https://t.co/PIcAKAfEFa","date":"Fri Jan 21 17:52:46 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/GUUEOZDXlf","date":"Thu Jan 20 18:04:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI this morning I joined @TND to discuss this disastrous inflation.  https://t.co/fKamxX9j4f","date":"Thu Jan 20 17:03:40 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/ahXrzSqzGB","date":"Thu Jan 20 16:15:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Be sure to read ‘The Hidden Tax,’ my latest report that shows inflation’s effect on American families and small businesses. https://t.co/YsSKEB0ZZC","date":"Thu Jan 20 16:15:05 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesday https://t.co/x7HjsofSKK","date":"Wed Jan 19 22:00:12 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Glad I was able to meet with local leaders in Pembroke yesterday to discuss their needs in the aftermath of last month’s tornadoes. My office is here to help with the FEMA application process and any assistance with federal agencies.","date":"Wed Jan 19 15:25:53 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/rC3dnxJUeZ","date":"Wed Jan 19 15:19:28 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you to 5 Star Electric for their immediate response and continued service to all the impacted communities of the Dec. 11 tornadoes and severe storms. Because of their efforts, they were able to restore power to countless Kentuckians and provide relief to those in need. https://t.co/GLlmDUnFKY","date":"Tue Jan 18 20:12:35 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to visit with Kentuckians in Hartford and Bremen this morning. I continue to be amazed at the communities in our Commonwealth and across our nation who have come together to help those impacted by the horrific tornadoes this past December. https://t.co/XvLSbVW5ct","date":"Tue Jan 18 17:19:54 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"On this Martin Luther King Jr. Day, let us celebrate the life and legacy of Dr. King, and keep building the kind of America that is worthy of memory and that our children — of every race, creed and color — deserve.","date":"Mon Jan 17 13:35:51 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI Today, I spoke on the Senate floor to object to proposed sanctions against the Nord Stream II pipeline.\n\nhttps://t.co/hKQOerFHJ1","date":"Thu Jan 13 19:12:54 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI Today I joined @foxnews to discuss yesterday’s hearing and how Fauci continues to refuse to answer questions. https://t.co/9IV8oeBCxz","date":"Wed Jan 12 19:44:43 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/9IV8oeBCxz","date":"Wed Jan 12 19:13:03 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#WasteReportWednesdays https://t.co/V8h5V2wBw5","date":"Wed Jan 12 17:12:45 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul Ends Fauci With a Pic for the Ages, as Dems Try to Save Him – RedState https://t.co/g8g4MDozh2","date":"Wed Jan 12 16:48:36 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Im still pro-vaccine as I’ve always been. Especially for those with high risk factors like older age and increased weight. but Im also pro-freedom, and in a free country people will evaluate their personal risk factors and are smart enough to ultimately make medical decisions https://t.co/KEPICDrdB8","date":"Wed Jan 12 16:32:19 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul rips Fauci following latest hearing fireworks: He doesn't want debate because he 'is science' | Fox News https://t.co/CgilUaWBSq","date":"Wed Jan 12 15:30:28 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/RmNb2XWiel","date":"Tue Jan 11 21:19:06 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/hOqMM9tUtS","date":"Tue Jan 11 20:26:02 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/n6CO6D9ej4","date":"Tue Jan 11 20:05:49 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/J6quilsofx","date":"Mon Jan 10 21:44:44 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If sanctions were really about changing Russian policy or deterring aggression, then NATO, including Germany, could threaten sanctions if Russia invades Ukraine. Now that threat of sanctions, with Germany as an ally, might actually have deterring value. https://t.co/0jdOl0JOZW","date":"Mon Jan 10 16:59:10 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/S0OzpaZl0v","date":"Mon Jan 10 15:26:17 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today is National Law Enforcement Appreciation Day, a day dedicated to showing thanks to the brave men and woman of our police force for their dedication, sacrifice and commitment to keeping our communities safe. https://t.co/Rs2ekZANOu","date":"Sun Jan 09 18:27:52 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy 59th Birthday to Doctor and Senator Rand Paul! https://t.co/SZXJZ0lqun","date":"Fri Jan 07 17:44:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Supreme Court should stop Biden's vaccine mandate and stand up for small businesses\n\nhttps://t.co/jUBtbcTHeM","date":"Fri Jan 07 15:02:42 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"FDA modernization act could change medical treatment forever | Lexington Herald Leader https://t.co/LJURPKr1Yu","date":"Fri Jan 07 00:23:20 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"\"I think they are the worst\": Dr. Rand Paul Joins Eric Bolling to Discuss Quitting YouTube\n\nhttps://t.co/RbaOU24lLW","date":"Thu Jan 06 18:45:39 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"\"By leaving YouTube and going to Rumble, I hope to elevate other platforms and not give free content to people who look down their nose at people like me.\" Check out the full article by @brad_polumbo \n\nhttps://t.co/5hsLdFZ3bL","date":"Wed Jan 05 22:36:59 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Discusses School Shutdowns and Leaving YouTube - January 5, 2022\n\nhttps://t.co/LZ5ahAzLDS","date":"Wed Jan 05 20:17:31 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nCheck out my full Festivus Report on my website! https://t.co/p7GJdqEHg2","date":"Wed Jan 05 20:15:18 +0000 2022","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It’s that time of year again #wastereportwednesday🗑🔥💸\n\nMy 2021 Festivus Report is officially out! This year we found a whopping $52,598,515,585.00 billion dollars in government waste.\n\nHead over to my website to read the entire review and let us know your favorite! https://t.co/0cuPvw0mBn","date":"Wed Dec 22 19:02:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Kentucky is going to rebuild,” he said from the Dawson Springs High School gym. “We’re going to take care of folks. We’re already finding places for people to stay. I think that we are going to be there for everyone in Kentucky. We will recover.” https://t.co/XQZi2on31x","date":"Sat Dec 18 20:11:02 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I visited His House Ministries, in Mayfield, KY where I met with Pastor Steven Boykin, Pastor Joel Cauley of Relevant Church of Paducah, and Mayfield Mayor Kathy O'Nan to get an update on disaster recovery efforts &amp; offer my assistance. https://t.co/RnC2rK9HAS","date":"Sat Dec 18 00:11:06 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"La Administración de Pequeñas Empresas de EE. UU. Anunció hoy la apertura de un Centro de Recuperación Empresarial en el Centro Comunitario Joe Creason en Benton, para brindar a las empresas de Kentucky asistencia personalizada para presentar solicitudes de préstamos por desastre https://t.co/IdIRenFepM","date":"Wed Dec 15 21:26:10 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The U.S. Small Business Administration announced today the opening of a Business Recovery Center (BRC) at the Joe Creason Community Center in Benton on Wednesday, Dec. 15 to provide Kentucky businesses with one-on-one assistance in submitting a disaster loan applications. https://t.co/V1aZnBXtpP","date":"Wed Dec 15 19:26:23 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins America Reports to Discuss Tornado Relief Efforts\n\nhttps://t.co/nwrj70fugx","date":"Tue Dec 14 21:25:56 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Senator Paul says he’s pleased with the state and federal government response so far and he’s also uplifted by the generosity of individuals and businesses.” https://t.co/yW9YkRN1tl","date":"Tue Dec 14 16:42:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I met with Mayor Todd Alcott and Judge-Executive Mike Buchanon to discuss recovery and relief efforts around the area before visiting the affected areas in Bowling Green. \n\nIf you are a Kentuckian and need assistance, please contact my office by going to https://t.co/5SDDVYcXcC https://t.co/FmraCQp8e2","date":"Mon Dec 13 17:46:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning I sent a letter to @POTUS asking for expeditious approval of any request for federal assistance by our Governor. If you are a Kentuckian &amp; need assistance with federal agencies following the devastating &amp; deadly storms, please contact my KY office at 270-782-8303. https://t.co/7t01njodwY","date":"Sat Dec 11 13:53:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I have tried to warn of the dire forecast for our nation if we continue with this fiscal insanity. And while I may not be a meteorologist, I can see when a storm is brewing. Congress ought to join me in keeping an eye on the horizon and act… https://t.co/vNf0c3MSIf","date":"Thu Dec 09 18:48:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Fauci is still intent on sending money to the Chinese. As recently as a month ago he said that we have to do research in China and we should fund it.\n\nI don't know about you... but I don't think the Chinese regime has proven themselves to be trust worthy. https://t.co/mU9drqLbBq","date":"Thu Dec 09 18:35:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins @janjeffcoat with @TND  - December 9, 2021\n\nhttps://t.co/ELtUKzylDt","date":"Thu Dec 09 16:35:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Proud to stand w/ @SenatorBraun in opposing @POTUS’ unlawful vaccine mandates. Biden's authoritarian command is a flagrant abuse of power that blatantly ignores the Constitution, &amp; lawlessly bullies Americans into submitting to his mandates upon penalty of loss of livelihood.","date":"Thu Dec 09 01:47:13 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesdays🗑️💰🔥 https://t.co/5Z7yuSDWT9","date":"Wed Dec 08 18:47:34 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul: \"I can promise you; I will do everything within my power to stop any more money from going to China\"\n \nThis morning, I joined @AmericaNewsroom to share my reaction to the Biden administration’s unreasonable response to the Omicron variant.\n \nhttps://t.co/8gayI8Eo0m","date":"Wed Dec 08 17:34:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI, I created an interactive website that exposes the disastrous effects of @POTUS 's vaccine mandates across the country. The @SmallBizCmteGOP and I are committed to fighting to preserve the estimated 44,966,434 US jobs at risk. https://t.co/AKXkimeWFC https://t.co/D63uPYaBoY","date":"Wed Dec 08 16:36:23 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"How is the Build Back Broke deal working for everyone these days? https://t.co/QgJl0zdcIq","date":"Tue Dec 07 19:20:36 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"America Must Stop Enabling the Saudi War in Yemen - Should we fail to seize this opportunity, history will never let us forget that America, the last best hope for humanity, failed to protect defenseless civilians from the cruelty of a criminal regime. https://t.co/AXmvMcc4Rk","date":"Tue Dec 07 18:50:59 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today we honor and remember the brave men and woman who made the ultimate sacrifice 80 years ago today at Pearl Harbor. We will never forget the sacrifice you made that fateful day. #PearlHarbor80 https://t.co/J2RdVFS5K7","date":"Tue Dec 07 15:28:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in Louisville, KY today to recognize @DrinkPhocus as Senate Small Business of the Week. Congrats to the entire team! https://t.co/35jqqEOJgu","date":"Mon Dec 06 22:10:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins Sean Hannity to Discuss Dr. Fauci's Ever-Changing Covid Guidance\n\nhttps://t.co/3V7sYwq4Rt","date":"Mon Dec 06 18:49:52 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul honors Imogene’s Alterations of Bowling Green as the U.S. Senate Small Business of the Week https://t.co/AbdLsFCy3h","date":"Mon Dec 06 15:08:37 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins John Bachman on Newsmax \n\nhttps://t.co/kEFzNbgYY2","date":"Sat Dec 04 20:00:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We must continue to shed light on the hypocrisy of Dr. Fauci. Thank you @brad_polumbo and @HannahDCox \n\nhttps://t.co/mwg4SbY0Tz","date":"Sat Dec 04 15:42:02 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins @SchmittNYC  on @newsmax  - December 2, 2021\n\nhttps://t.co/OefCkb4QeN","date":"Fri Dec 03 19:32:15 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI - I created an interactive map exposing the cost of @POTUS's tyrannical vaccine mandates across the US, w/ an estimated 44,966,434 US jobs at risk. I'm fighting along w/ my @SmallBizCmteGOP to protect all Americans from these ridiculous mandates.\n https://t.co/AKXkimeWFC https://t.co/f8RMIGSi35","date":"Thu Dec 02 20:43:47 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"You would think they would do a little bit of planning... https://t.co/BEvYQh4q9l","date":"Thu Dec 02 20:24:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Joins @MariaBartiromo on @FoxBusiness to Discuss Covid Restrictions - December 2, 2021 https://t.co/Qjwf4Fkp6v","date":"Thu Dec 02 18:29:12 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul to Newsmax: No One Should Have the 'Power' Fauci Wields | https://t.co/i1Oh6bXyFc https://t.co/HduJmxIh5c","date":"Wed Dec 01 15:28:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Congratulations to Elle Smith for bringing the Miss USA crown back to the Commonwealth!\n\n#missusa2021 #misskentucky #kentuckyfirst https://t.co/b5VP6Tp5ow","date":"Tue Nov 30 22:54:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Lockdowns were a failed experiment.\n\nBad for our workforce\nBad for our economy\nBad for our country https://t.co/cZBjoqHIh6","date":"Tue Nov 30 21:09:37 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Wishing everyone a safe and pleasant #Hanukkah  this holiday season! https://t.co/Qqliy9ifu5","date":"Mon Nov 29 19:28:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul Scolds Fauci for Saying ‘I Represent Science‘ https://t.co/dxHZnBEf78 via @BreitbartNews","date":"Mon Nov 29 16:19:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"By participating in this sale, we would not only be rewarding reprehensible behavior, but also exacerbating a humanitarian crisis in Yemen. I urge Congress and the Biden Administration to consider the possible consequences of this sale… https://t.co/HOFlZR5Oh9","date":"Mon Nov 29 13:56:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It’s #SmallBusinessSaturday in Kentucky! \n\nHere are some of the great small businesses we’ve highlighted this year. We hope you will join us in supporting our small businesses around the commonwealth! https://t.co/RYnAVm6OY4","date":"Sat Nov 27 21:03:04 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"From our family to yours, Kelley and I want to wish everyone a safe and Happy Thanksgiving this year! \n\nWhat are you most thankful for this holiday season? https://t.co/fXqF7vXidf","date":"Thu Nov 25 19:08:13 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"FULL INTERVIEW: Sen. Rand Paul talks inflation, paid family leave, vaccine mandates https://t.co/R7fzBwqHai","date":"Tue Nov 23 20:59:05 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul Tears Into Anthony Fauci, Promises Consequences https://t.co/3B1fEppNQK","date":"Mon Nov 22 16:51:52 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kentucky is beautiful during the fall! Here's the recap of my recent travels through eastern Kentucky. It's my honor to serve as your senator. Come visit us soon! https://t.co/zGqdK1XCW5","date":"Thu Nov 18 20:26:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“The Kentucky Republican called Fauci a “liar,” arguing that his disregard for individual liberty approaches “disdain.” https://t.co/u5bjSlqDN5","date":"Thu Nov 18 17:33:16 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, as Ranking Member of @SmallBizCmteGOP I released a statement on @SBAgov's funding of Planned Parenthood. https://t.co/0r3CPB8l64 https://t.co/XzwYsaREuL","date":"Wed Nov 17 20:13:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI today I joined @brad_polumbo for : What’s REALLY Behind Disastrous Inflation? (Interview) https://t.co/GYalVlhDIf","date":"Tue Nov 16 23:55:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As your Senator, I will continue to propose commonsense, fiscally responsible solutions and oppose any and all spending furthers our supply chain crisis, encourages inflation, and aims to hurt American taxpayers.  https://t.co/KtUlQWDSZ3","date":"Mon Nov 15 17:15:02 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you are a Kentucky business or resident affected by the severe flash flooding on July 29-30, 2021, in Bath, Bourbon, Fleming, Harrison, Nicholas, Montgomery, and Robertson counties, you may apply for a low-interest disaster loan from the U.S. Small Business Administration. https://t.co/nmbphml4qh","date":"Fri Nov 12 18:05:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"On this Veteran’s Day we honor all of the men and women who have answered the call to defend our great nation. While we can never fully repay you for your courage, dedication, and hard work, today allows us to show our appreciation for all that you’ve done. https://t.co/FSXExFjL3C","date":"Thu Nov 11 15:31:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great crowd in Adair County today! Loved stopping by Day &amp; Day Feed Mill in Columbia, KY to present the owners with a copy of the Congressional Record on behalf of @SmallBizCmteGOP honoring their successful small business. https://t.co/0X4ZHFnAcT","date":"Wed Nov 10 21:30:39 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"After speaking with Kentuckians in Barbourville, KY, I stopped for photos with the local JROTC and the law enforcement officers onsite. Check out next week’s edition of the Mountain Advocate for more on my stop in Knox County! https://t.co/h5x8Tj39gp","date":"Wed Nov 10 20:42:47 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today we celebrate 246 years of dedication, honor, service to our great country. Kelley and I want to thank each and every one of the brave patriots who have made the commitment to defend our Republic.\n\nGod bless the few\nGod bless the proud\nGod bless our Marines https://t.co/43qoYPhyef","date":"Wed Nov 10 20:05:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Next I headed to Middlesboro, KY for another community forum and a quick stop by the Pinnacle Overlook at Cumberland Gap National Forest to take in the gorgeous views and fall foliage. Thank you State Rep. Adam Bowling for joining me! https://t.co/eezAhJ3Pbj","date":"Wed Nov 10 18:39:55 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Spots are filling up fast! Don't delay, sign up today! \n\n#WashingtonDC #internship https://t.co/1gjaqBu7mY","date":"Wed Nov 10 17:56:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Started the morning in Pineville, KY for a community forum. So glad students from Pineville High School were able to attend and participate in the Q&amp;A! https://t.co/Gi72jb35qH","date":"Wed Nov 10 15:59:38 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My last stop of the day was a Veterans Outreach event in Harlan, KY, where members of my staff and several veterans organizations were onsite to help with VA issues and casework. If you are a veteran in Kentucky and need assistance please contact my office! https://t.co/8hdg77TTjJ","date":"Tue Nov 09 21:34:49 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Held a community forum in Jenkins, KY earlier today and took questions from those in attendance. Spending time speaking with local residents and hearing their concerns is incredibly important to my work as your Senator! https://t.co/HzMjHtVDmT","date":"Tue Nov 09 19:58:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Recognized another great Kentucky small business in the eastern KY mountains today -\nKentucky Mist Moonshine! Thank you for the distillery tour and delicious lunch! https://t.co/DqVNsEmucJ","date":"Tue Nov 09 19:37:35 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you to Kentucky’s dedicated nurse practitioners. November 7-13 may be Nurse Practitioner Week, but we appreciate you 365 days out of the year. https://t.co/xb6UGSMCCj","date":"Tue Nov 09 16:32:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"For my next stop, I went to Virgie, KY to honor Reed Family Floral as a recent @SmallBizCmteGOP Small Business of the Week! https://t.co/4KQ7UxATvG","date":"Tue Nov 09 16:00:29 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Spent some time this morning with local law enforcement in Pikeville, Ky. We discussed the issues they’re facing, why we absolutely cannot defund the police, and what they’re doing to engage with the local community. Thank you for your service! https://t.co/K2IumK7XGR","date":"Tue Nov 09 14:41:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Was taking a walk through downtown Prestonsburg, KY this evening and stopped into Lad n’ Lassie Children’s Boutique, a business I recently recognized as a @SmallBizCmteGOP business of the week! https://t.co/NGLX0Cy1A6","date":"Mon Nov 08 22:27:25 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Hazard, KY for a meeting with local law enforcement officers. Please join me in thanking these men and women in uniform for all they do to support and serve our communities! https://t.co/vOqeQ7Dy2s","date":"Mon Nov 08 20:32:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This week I’m making stops throughout Eastern Kentucky! First up is Manchester, KY for a community forum with local residents &amp; officials. https://t.co/XZLh8Eq7hp","date":"Mon Nov 08 17:53:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"🔥🔥🔥","date":"Fri Nov 05 18:36:28 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/rUz4CjRlR1","date":"Thu Nov 04 21:50:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“You won't admit that it's dangerous, and for that lack of judgment, I think it's time that you resign.” \n\nToday, I continued to hold Dr. Fauci accountable on his repeated lies about the funding of gain-of-function research in the Wuhan Lab of Virology.\nhttps://t.co/ZuQXwqsFjM","date":"Thu Nov 04 18:27:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Paul Questions Dr. Fauci at HELP Committee hearing about Gain of Function research\n\nhttps://t.co/xoOajMNkfa","date":"Thu Nov 04 17:12:23 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nU.S. Africa Command (USAFRICOM) and the U.S. Air Force in Europe-Air Forces Africa (USAF-Africa) spent $110 million on a poorly constructed drone base in Niger resulting in alleged violations of federal law, safety concerns, mission delays, and much more. https://t.co/0Bm20xfLC1","date":"Wed Nov 03 19:22:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you or someone you know is interested in joining my Washington D.C. office this spring, go to my website to apply! 🇺🇸\n\n#washingtondc #senate #internships https://t.co/6QhJ4a9P59","date":"Wed Nov 03 18:28:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to have @CKYAgCredit in DC today! I look forward to continually working with them to support Kentucky farmers and our agriculture industry. https://t.co/mDrtvziJQE","date":"Wed Nov 03 16:56:17 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As a physician, I know firsthand how much the doctor-patient relationship relies on trust and privacy, which is why I introduced the National Patient ID Repeal Act to protect Americans’ medical privacy. \n\nhttps://t.co/VMvibAvVKc","date":"Tue Nov 02 21:27:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be at Aviette Bioprocessing yesterday in Franklin, KY, for their grand opening, celebrating Kentucky’s diverse agriculture industry! https://t.co/Y1HcpUu1ag","date":"Tue Nov 02 14:57:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I sent a letter with @JamesComer to Dr. Francis Collins, Director of the National Institutes of Health (NIH) requesting information on an update made to the NIH website on October 20, 2021. Read more here: https://t.co/OEPhJSjmJt","date":"Mon Nov 01 19:40:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I joined other senators in sending a letter requesting further information about the cruel and inhumane experiments conducted on beagle puppies under the supervision of Dr. Fauci. Read more here: https://t.co/eN9ZrgYUHW","date":"Mon Nov 01 15:04:38 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I joined @MariaBartiromo to Discuss Dr. Fauci and the upcoming hearing this Thursday! https://t.co/hWqCC7DicL","date":"Mon Nov 01 13:09:04 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kelley and I wish everyone a safe and happy Halloween this year! https://t.co/bPfQwV5Z4U","date":"Sun Oct 31 16:51:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"U.S. Senator Rand Paul names Hinton Mills as U.S. Senate Small Business of the Week\nhttps://t.co/QbgWsb56iX","date":"Fri Oct 29 20:45:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Financing education is already hard enough, and Uncle Sam doesn’t need a cut. My plan allows people to pay for college with pre-tax dollars and would be available to anyone who is helping pay for college... https://t.co/V7fKZbBOj3","date":"Thu Oct 28 15:15:54 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Fauci should be fired immediately. https://t.co/aShw0G3XdN","date":"Wed Oct 27 23:01:36 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday\n\nThe U.S. is spending $20 million teaching Laotians their own language. https://t.co/8GnnxHEunJ","date":"Wed Oct 27 19:30:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Check out my bill at: https://t.co/CpPrDwZKIh","date":"Tue Oct 26 21:09:47 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My FDA Modernization Act offers humane alternatives to barbaric experiments on beagles, like those funded by Dr. Fauci with your tax dollars.  While I can assure you #PaulsPups are safe, we need to make sure the government doesn’t force companies to torture man’s best friend... https://t.co/GnpauYMnZu","date":"Tue Oct 26 21:09:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We need to know how much of this research is happening and what dangers we face. I am asking the relevant Senate committees to schedule hearings on this research as soon as possible. https://t.co/y0wcuYMtlC","date":"Mon Oct 25 17:47:23 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This week, as Ranking Member of the U.S. Senate Committee on Small Business and Entrepreneurship, I recognize Lad n’ Lassie Children’s Boutique of Prestonsburg, Kentucky, as the U.S. Senate Small Business of the Week. https://t.co/nMejqpKchP","date":"Mon Oct 25 14:16:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“The NIH kept saying, ‘No, we didn’t do it, we didn’t do it,’ until last night they admitted, ‘Yes, they did do it,” said Sen. Rand Paul. https://t.co/w0ukYb6c3K","date":"Fri Oct 22 20:40:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"\"This week, U.S. Senator Rand Paul (R-KY) Ranking Member of the U.S. Senate Committee on Small Business and Entrepreneurship, recognized Lad n’ Lassie Children’s Boutique of Prestonsburg, Kentucky, as the U.S. Senate Small Business of the Week.\" https://t.co/UtfPCXMAbZ","date":"Fri Oct 22 16:07:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"New NIH Letter About EcoHealth Reporting Failure Raises New Questions About Gain-Of-Function Funding | The Daily Wire https://t.co/MDqueUbOkU","date":"Fri Oct 22 13:35:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"BREAKING: NIH Today Corrects False Statements by Directors Collins and Fauci - the NIH Did Fund Gain-of-Function Research in Wuhan - Fauci Lied Under Oath https://t.co/sqcE5zVY4h","date":"Thu Oct 21 14:57:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“The revelation vindicates Republican Senator Rand Paul, who got into heated exchanges with National Institute of Allergy and Infectious Disease Director Dr. Fauci during his May and July testimonials before Congress over the gain-of-function question.” https://t.co/Px4EjiOC5X","date":"Thu Oct 21 13:15:03 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday🗑🔥💸\n\nA team of researchers from Brown University used $896,994 from the National Institutes of Health (NIH) to give cigarettes to adolescent kids to test their reactions to various levels of nicotine in the cigarettes. https://t.co/fXggvtNoAg","date":"Wed Oct 20 17:35:05 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was a privilege to meet some of our nation’s heroes as they visited their memorials today. While we can never fully repay them for their sacrifices, special days like these give us a chance to show them that we will never forget. https://t.co/vlcgjeZ6AH","date":"Wed Oct 20 16:48:15 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"- Since 1981, every Corvette that’s been produced was built at the Bowling Green Assembly Plant in Bowling Green, Kentucky.\n\n- Kentucky is one of the few places in the world where you can spot a moonbow—a rainbow that is created by the light of the moon rather than the sun.","date":"Tue Oct 19 19:06:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"- The very first American public performance of a Beethoven symphony was in Kentucky.\n\n- There are more bourbon barrels than people in Kentucky.\n\n- Kentucky is home to the largest fireworks display in North America.","date":"Tue Oct 19 19:05:45 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"To celebrate, here are a few fun facts about the great commonwealth. \n\n - Kentucky is known as the horse capital of the world.\n\n - The song “Happy Birthday to You” was penned by two Louisville sisters.","date":"Tue Oct 19 19:04:48 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy National Kentucky Day everyone! \n\n#nationalkentuckyday #kentucky https://t.co/YY0072bpQC","date":"Tue Oct 19 19:02:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“I was so proud tonight, my husband, Rand Paul, has entered into the Senate record, a document honoring him and speaking about the tribute that he got tonight for his patriotism and his service,” says Kelley Paul. https://t.co/wzzvlh9lGL","date":"Mon Oct 18 19:49:40 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As Ranking Member of the U.S. Senate Committee on Small Business and Entrepreneurship, I recognize Phocus LLC of Louisville, Kentucky, as the U.S. Senate Small Business of the Week. https://t.co/s2SeudCYHN","date":"Mon Oct 18 17:26:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Kelley and I send our thoughts and prayers to family and friends of Judge Executive Chris Pace. Judge Pace was a dedicated and outspoken leader who always put the needs of Clark Co. first. He will be greatly missed in our community.","date":"Fri Oct 15 17:13:30 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy National Pork Month Kentucky! 🐖 https://t.co/42WmrVRT5P","date":"Thu Oct 14 18:55:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday 💸🔥🗑\n\nYou didn’t misread—Metro actually spent more than $22,000 per space on a project that took nearly a decade, and all they got was a total of 270 bike spots! https://t.co/JJCBSjHgD6","date":"Wed Oct 13 18:01:16 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today marks #nationalfarmersday🌾🌽\n\nI believe that much of what American Farmers need is not more government programs and regulations, but rather, a return to common sense policies that remove the bureaucratic red tape which slow innovation and production. https://t.co/z2gcPqAfNO","date":"Tue Oct 12 19:41:25 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you @LimitGovt for highlighting the red-flags surrounding the Democrat's massive spending spree!\n\nhttps://t.co/7vfiZt6080","date":"Tue Oct 12 17:07:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“We’re rapidly approaching a milestone in our country, and it’s not a good one — $30 trillion in debt,”  https://t.co/VOSlpoo2U8","date":"Tue Oct 12 14:36:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/n6my2q94tL","date":"Fri Oct 08 20:44:50 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I think there's a reasonable chance that we might find something that we could actually pass through a bipartisan — maybe even a unanimous — bill. https://t.co/dAsgEZZUuB","date":"Fri Oct 08 20:41:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"You can watch the entire press conference on this important biPawtisan legislation here: https://t.co/x17IXtSwGd https://t.co/wgmUEOG9Jh","date":"Fri Oct 08 20:41:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The FDA Modernization Act to End Animal Testing Mandates would also prevent the needless suffering and death of animal test subjects—which is something I think both Republican and Democrats can agree needs to end. https://t.co/sPCLxui5oR","date":"Fri Oct 08 20:41:25 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI yesterday I introduced the FDA Modernization Act to end animal testing mandates. Read more here: https://t.co/CpPrDwZKIh https://t.co/Ey5AiP5DJ4","date":"Fri Oct 08 20:41:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Special thanks to @SenJohnKennedy and @SenatorBraun for joining in the press conference on this important legislation to accelerate innovation and get safer, more effective drugs to market more quickly by cutting red tape... Watch @WKYT's coverage here: https://t.co/gOTnTBmaj9","date":"Fri Oct 08 20:41:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Paul, Booker introduce bill to end FDA animal testing mandates https://t.co/6ULjblyBqD","date":"Thu Oct 07 22:31:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, we made great strides to accelerate innovation by bringing safer, more effective drugs to market through the removal of mandatory animal testing. I am proud to introduce the FDA Modernization Act with @SenBooker \n\nFull release below:\nhttps://t.co/CpPrDwZKIh https://t.co/u2vzbHsJEg","date":"Thu Oct 07 16:45:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI: “Criminalizing dissent is something we should all be appalled with” \n\nTonight I spoke with Ben Domenech on Fox Primetime about the politicization of the DOJ.\n\nhttps://t.co/5yh2D71D73","date":"Thu Oct 07 00:56:06 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Yesterday I joined Larry Kudlow on Fox Business to discuss the Democrats and their massive spending spree, as well as Dr. Fauci and his guidelines for the Christmas season. \n\nhttps://t.co/a07VpD0BTl","date":"Wed Oct 06 14:10:06 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“For those of us who’ve had the disease and survived, we’re more at risk in being around only vaccinated people. So these people are hysterical about the unvaccinated, it’s actually the opposite of the truth,” https://t.co/i0Iue8tczB","date":"Tue Oct 05 16:01:31 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I talked to ⁦@FoxNews⁩ about my questioning Xavier Becerra and demanding an apology for the arrogance shown to many Covid survivors. https://t.co/rRtwaRCiat","date":"Sun Oct 03 14:08:03 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“This isn't an argument against the vaccine, but it's an argument for letting people make a decision who already have immunity.\" https://t.co/7hHwYVSD6B","date":"Fri Oct 01 21:21:06 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul Grills HHS Sec. Becerra: \"Quit Lying To People About Natural Immunity\" | Video | RealClearPolitics https://t.co/lLBuuWRY4u","date":"Fri Oct 01 19:14:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Becerra Won’t Apologize For Suggesting COVID-19 Survivors Who Didn’t Get Vaccine Are Like ‘Flat-Earthers’ | The Daily Caller https://t.co/VTWcoMn7M4","date":"Thu Sep 30 19:57:37 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICMI: This morning I questioned Xavier Becerra and demanded an apology for the arrogance shown to many Covid survivors in our HELP committee hearing. https://t.co/pDqna72Iqs","date":"Thu Sep 30 16:06:58 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We strongly urge the CDC to acknowledge infection-acquired immunity in addition to vaccine-acquired immunity. Natural immunity, to date, has been dismissed without adequate scientific acknowledgment...https://t.co/FKEdMBC6DW","date":"Thu Sep 30 15:08:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The Biden administration has continued to obstruct congressional oversight of the illegal planned parenthood loans. Let's be very clear, planned parenthood is not a small business. https://t.co/0BTGhuUdVi","date":"Wed Sep 29 17:21:30 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":".@ford is a valued employer in our Commonwealth and I appreciate their continued commitment to creating more jobs in Kentucky!","date":"Mon Sep 27 23:12:58 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I'm spearheading an effort in Congress to hold the Small Business Administration (SBA) accountable for reportedly sending federal funds to Planned Parenthood through Paycheck Protection Program (PPP) loans. https://t.co/qOIQYqGVUu","date":"Mon Sep 27 16:42:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As Ranking Member of the Senate Committee on Small Business and Entrepreneurship, I recognize @danosseasoning of Louisville, KY as the U.S. Senate Small Business of the Week! https://t.co/2AmO35ORa1","date":"Mon Sep 27 16:08:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul: Biden, Fauci continue to ignore the science of natural immunity https://t.co/pUxEmj8B48","date":"Mon Sep 27 14:44:48 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Every individual is different… In a free country, you make your free decisions based on what you deem your risk to be…” https://t.co/oo1GuJNkab","date":"Mon Sep 27 13:12:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I joined ⁦@ericbolling⁩ to discuss the new updates on COVID vaccinations. https://t.co/3y8sErnO9D","date":"Fri Sep 24 15:06:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I joined @DLoesch where we discussed natural immunity, the failed drone strike by the Biden Administration and FISA abuse \n\nhttps://t.co/YYsv0IF2Gr","date":"Thu Sep 23 19:49:23 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Check out my remarks from my stop in Mt. Sterling, KY. I’m proud to support those who put their lives on the line everyday to defend us.\n\nhttps://t.co/T4PV0Ph2jx","date":"Thu Sep 23 19:19:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“Sen. Rand Paul (R., Ky.) said the agency is ignoring its own ruling—which held that affiliates of organizations with more than 500 employees are ineligible for PPP—to reward a political ally.” https://t.co/4cOrZobGEC","date":"Thu Sep 23 17:32:10 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I addressed the unnecessary spending and abuse by SBIR mills. https://t.co/5clNugJ8z9","date":"Thu Sep 23 14:51:10 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday\n\nThe State Department is spent $2 million dollars to “increase the quality and quantity of locally produced content on Moldovan television through co-productions that expand investment and employment in the media space according to a funding notice.” https://t.co/SmPnl326Ah","date":"Wed Sep 22 21:55:50 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nThe NSF gave USC $49,990 to put on a six-day “educational experience for graduate students who are interested in studying decision making in the context of engineering design and systems engineering from programs that do not have coursework in this area.” https://t.co/emURte7yz4","date":"Wed Sep 22 16:06:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to have the @PaducahChamber in Washington today! I always enjoy having Kentuckians visit our nation’s capital. https://t.co/IEvsSgnvPj","date":"Tue Sep 21 18:51:31 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I attended the Senate Homeland Security and Governmental Affairs Committee hearing where we evaluated the landscape of America 20 years after 9/11 and the impacts still felt today. \n\nWatch my full remarks below: \n\nhttps://t.co/WMaveofCjw","date":"Tue Sep 21 17:05:56 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you or someone you know is interested in receiving more information about the service academy nomination process, make sure you RSVP for the 2021 virtual fall service academy Q &amp; A tomorrow! https://t.co/L0Mq3637Te","date":"Mon Sep 20 19:57:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I joined Friday’s broadcast of the @FoxNews Channel’s @seanhannity https://t.co/X8FMtLW9hM","date":"Mon Sep 20 17:06:51 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The 2021 Virtual Fall Service Academy Question &amp; Answer\nis Tuesday, September 21, 2021\n1:00 PM CST / 2:00 PM EST! We’ll have representatives from all 5 Service Academies available to help answer your questions about the nomination process. Learn more here: https://t.co/w0IolYlhJI","date":"Mon Sep 20 15:38:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you to @wku and coach John Palowski for allowing me to practice with the team this morning in preparation for the upcoming congressional baseball game! https://t.co/aeOozVp1LM","date":"Fri Sep 17 15:42:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"During #HispanicHeritageMonth we celebrate and honor the culture, histories and contributions of the Hispanic &amp; Latino communities. https://t.co/31sUOtKdjZ","date":"Thu Sep 16 19:44:53 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nThe DOD is attempting to encourage 5th graders toward interests in STEM topics by operating a week-long camp-style experience called STARBASE and spending $35 million in the Fiscal Year 2020 to do it. https://t.co/xVf29wUEE3","date":"Wed Sep 15 20:53:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nThe nation's top infectious-disease expert, who has led the National Institute of Allergy and Infectious Diseases since 1984, earned $417,608 in 2019 - almost $18,000 more than President Trump. Making Dr. Fauci the highest paid federal employee in the US. https://t.co/BmE3Sz7IzL","date":"Wed Sep 15 19:57:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nThe DOJ spent $8,000 to purchase two blue drapes that hide the giant and partially nude, aluminum art deco statues because they were tired of being photobombed in pictures. https://t.co/nFHuvPIvIP","date":"Wed Sep 15 18:49:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I questioned Secretary of State Antony Blinken during a U.S. Senate Foreign Relations Committee hearing on the Biden Administration’s botched Afghanistan withdrawal and continued incompetence. https://t.co/2W594gQSgQ","date":"Tue Sep 14 18:53:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As a physician, I think it’s incredibly important for patients to have access to as much life-saving information as possible, especially as we still continue to see COVID-19 cases across the country. https://t.co/VDU62bQV1N","date":"Tue Sep 14 14:12:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was an honor to meet &amp; recognize these two @LMPD officers today in Louisville, KY for their bravery in stopping a potentially deadly incident this past July. We are all encouraged to know that such exemplary character exists in our communities. https://t.co/vXOzCE3Vjo","date":"Thu Sep 09 20:11:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday https://t.co/RIEZ7TZcGp","date":"Wed Sep 08 23:11:28 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday https://t.co/8rEh44lpT1","date":"Wed Sep 08 22:37:38 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I also stopped in Madisonville &amp; Morgantown, KY where we talked about skyrocketing inflation, vaccine mandates, and school choice. https://t.co/GKQXlp8cXW","date":"Wed Sep 08 22:08:35 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday https://t.co/Hh6WqRqEaN","date":"Wed Sep 08 20:56:40 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today, I got to stop at @Unclelees in Greenville, KY to recognize them as @SmallBizCmteGOP Business of the Week. Congratulations to the entire team at Uncle Lee’s. I wish them the best of luck and look forward to watching their continued growth and success in Kentucky. https://t.co/WEHKQM610r","date":"Wed Sep 08 19:23:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in Beaver Dam &amp; Calhoun, KY this morning to meet with Kentuckians. We talked about the rise of free speech censorship across social platforms and mainstream media. We also discussed the threat socialist policies poses to our great country. https://t.co/1aqAmizIoR","date":"Wed Sep 08 16:31:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Yesterday I visited Burkesville, KY to meet with community members, give an update on my work in Washington, and answer their questions on issues like inflation and the the state of our economy. https://t.co/ILfrZBFfmx","date":"Fri Sep 03 16:28:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul meets with Ky. superintendents about keeping kids safe, in school during pandemic\n\nhttps://t.co/7AvH6jSrr5","date":"Thu Sep 02 20:31:45 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Earlier this year I recognized Hunter’s BBQ in Albany, KY as @SmallBizCmteGOP Business of the Week... today I got to meet the owners &amp; staff in person, present them with the Congressional Record honoring their business, &amp; of course try some of their delicious BBQ! https://t.co/e8BBCZx04Z","date":"Thu Sep 02 18:12:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Lots of familiar faces in McCreary County this morning! I held a community forum at the VFW in Stearns, KY &amp; answered questions from those in attendance, including many veterans. Some topics we covered included COVID mandates, Afghanistan, &amp; the future of coal. https://t.co/qyrnDDVfmY","date":"Thu Sep 02 16:56:36 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in Danville, KY yesterday to sit down with the Financial Services Institute. We discussed the PRO Act &amp; the significant harm it would do to the independent financial services industry. https://t.co/ZlqWs6DmRi","date":"Thu Sep 02 13:20:54 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\n The State Department is spending up to $150,000 so Kenyans can study music, art, and poetry to “identify upcoming artists and performers, train them in arts entrepreneurship and give them the tools they need to be able to succeed in the industry.” https://t.co/sCkfDN07MK","date":"Wed Sep 01 22:37:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I visited @CampbellsvilleU in Taylor County, KY to speak with CU’s Interim President, Dr. Spears, and other University officials about my plan to allow people pay for college with pre-tax dollars. https://t.co/3yuFYDHnPl","date":"Wed Sep 01 20:32:58 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday The National Science Foundation spent over $1.5 million trying to improve the taste of tomatoes. Make no mistake, the research was about taste. https://t.co/qQEdxh1nK4","date":"Wed Sep 01 18:42:39 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday In 2015, the U.S. Embassy in Islamabad put out a grant opportunity to send Pakistani students to 6-days of Space Camp in Alabama to promote the development of English language, social, and analytical skills of the participants, through first-hand experiences https://t.co/QH1795mvIi","date":"Wed Sep 01 17:13:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I also made a stop at the Hope Center for Pregnancy in Bowling Green, KY to learn more about the work they do serving our community with the services they provide, such as pregnancy tests, ultrasounds, consultations, and support — which are all free of charge. https://t.co/VbAi2TwtfA","date":"Tue Aug 31 21:27:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I also met with Lyon County officials to discuss the issues they are facing due to limited availability of federal law enforcement at Land Between the Lakes National Recreation Area. I promise to look into this matter and appreciate their time speaking with me today. https://t.co/5cq3ZnkLTA","date":"Tue Aug 31 18:10:40 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning I met with law enforcement officials in Christian County, KY to discuss the issues facing law enforcement communities &amp; answer their questions. I encouraged them to share more good news with their local media so everyone can hear about the good things they’re doing! https://t.co/OHNg7S5URA","date":"Tue Aug 31 16:01:54 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My final stop was in Cold Spring, KY where I spoke with Kentuckians about vaccine and mask mandates. In a free country people will evaluate their personal risk factors and are smart enough to ultimately make medical decisions themselves. https://t.co/HwpGsWkbmF","date":"Fri Aug 27 19:38:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in Maysville, KY to catch up with the Maysville Chamber of Commerce and Rotary Club. We discussed government waste and the excessive spending of taxpayer dollars by those in Washington. https://t.co/QyVie9U7io","date":"Fri Aug 27 17:00:48 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Flemingsburg, KY at the @KYWeldInstitute. I was able to tour their facility and discuss their efforts to provide state of the art welding training as an alternative pathway for education and vocational training to students across the Commonwealth. https://t.co/4cGZIBrqVD","date":"Fri Aug 27 16:11:36 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I’m starting my day off in Morehead, KY at Rajant Corp. to tour their facility. Rajant Corp. is the exclusive provider of private wireless networks with successful global deployments in more than 60 countries. It’s great to see a Kentucky industry succeed on the global stage. https://t.co/lcN5YRSb8B","date":"Fri Aug 27 13:29:03 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My last stop of the day was in Mt. Sterling, KY where I participated in a law enforcement roundtable to hear the issues impacting those who work to protect our communities. I’m proud to support those who put their lives on the line everyday to defend us. https://t.co/dm5SlaRnXC","date":"Thu Aug 26 21:23:58 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Winchester, KY where I participated in a discussion with local business and community leaders. We talked about the threat socialist policies pose to our economy, small businesses &amp; individual freedoms. https://t.co/apaRbsVYSq","date":"Thu Aug 26 20:02:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to visit @DV8Kitchen at their new location in downtown Lexington, KY &amp; honor them as a Senate Small Business of the Week. The team at DV8 Kitchen is a remarkable group that focuses on giving second chances &amp; uplifting those in their community. Keep up the great work! https://t.co/WA3yr3FGku","date":"Thu Aug 26 18:29:38 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Good morning Kentucky! Thank you to @KYFB for hosting their 57th annual Kentucky Country Ham Breakfast. It’s always great to be surrounded by good friends and great food. https://t.co/TvAhpN11fL","date":"Thu Aug 26 13:34:29 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I always love traveling through the Commonwealth to meet with Kentuckians! Today, I visited Hodgenville, KY &amp; Bardstown, KY where I talked with Ag leaders and farmers about burdensome federal regulations impacting them &amp; the repercussions inflation has on our supply chain. https://t.co/LvnDC18bVR","date":"Wed Aug 25 21:20:43 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The USAID spent part of a $22 million Sustainable Local Development Project training the staff at the Regional Center for Agricultural Development in Sjenica, Serbia, to follow the cheese standards of the International Org. for Standardization (ISO) and help adopt best practices. https://t.co/lSWAdvRMjH","date":"Wed Aug 25 21:00:04 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nScientists at the National Institutes of Health (NIH) did not trust common knowledge and have decided to spend $4,658,865 over several years to study the connection between drinking alcohol, hurting yourself or somebody else, and winding up in the ER. https://t.co/WQp8psprZ6","date":"Wed Aug 25 17:40:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Lisa’s Fifth Street Diner honored as U.S. Senate Small Business of the Week https://t.co/VQ3a3ylo0i","date":"Wed Aug 25 16:59:32 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Yesterday, I visited Lisa’s Fifth Street Diner in Bowling Green, KY to present them with U.S. Senate Small Business of the Week. Small businesses like Lisa’s Fifth Street Diner form the heart of towns across Kentucky, regularly stepping up to support their communities. https://t.co/wJKKSnYEsW","date":"Wed Aug 25 15:02:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"“It’s Hard to Imagine a More Incompetent Withdrawal” Dr. Paul Addresses Afghan Withdrawal https://t.co/xQUGTsu0fb","date":"Tue Aug 24 16:16:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy birthday to my dad, Ron Paul! Thank you for being a leader in the fight for liberty and the impact you’ve had on us all. Happy birthday Dad. https://t.co/tqChqAjMb7","date":"Fri Aug 20 20:52:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"If you or a loved one who has served in the military are in need, please let us know how we can help. \n\nIf you would like my office to handle casework on your behalf, please go to https://t.co/BZbKx1lCkg and fill out the necessary release forms that allow us to do so.","date":"Fri Aug 20 19:18:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We owe it to those who have served in combat to provide them with quality care for injuries sustained in defense of this nation and provide the necessary support tools as they adjust back to civilian life. My office is committed to serving those who served this country. https://t.co/wWRpstlvcj","date":"Fri Aug 20 19:17:31 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It claims the “higher level of customer service,” which just amounts to a shorter wait time in a telephone queue, is worth $217,000,000 of your tax dollars. \n\n#wastereportwednesdays","date":"Wed Aug 18 21:45:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The Railroad Retirement Board (RRB) has spent $217 million over seven years to provide RRB employees and beneficiaries with specialized customer service for the 455,000 who can access a specially focused Medicare program. https://t.co/EbrABL9RXA","date":"Wed Aug 18 21:44:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"So what did we learn? We found out that Boomers stick to their limits, don’t ingest edibles when they need to be alert, and drink coffee when the high is too much. All this ground breaking insight for a cool $3 million.","date":"Wed Aug 18 18:02:51 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"With the six grants, researchers published ONE paper, focusing on responsible and ontrolled use: older cannabis users and harm reduction, sought “to elucidate how older adult cannabis users managed health, social, and legal risks in a context of normalized cannabis use.”","date":"Wed Aug 18 17:59:26 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesday \n\nHave you ever wondered how San Francisco-based Baby Boomers use edibles? Me neither. But now, thanks to the six grants the NIH issued to researchers with the Scientific Analysis Corporation over six years totaling $3,125,768, we have the answer. https://t.co/35LwNdJ9L4","date":"Wed Aug 18 17:56:52 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Is it the government’s job to stop people from indoor tanning? Absolutely not! This is a trademark of government intervention: regulate an industry for people’s safety, drive them into less safe alternatives, then ask how to prevent them from going to those less safe alternatives","date":"Wed Aug 18 16:34:06 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The other paper was closer to the topic of the actual grant, but still a way off — it advocated the need for “primary prevention efforts throughout adulthood because the incidence of melanoma in middle to older age groups continues to climb.”","date":"Wed Aug 18 16:33:35 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Researchers published two articles. The first was entitled “Insights on HPV vaccination in the United States from mothers’ comments on Facebook posts in a randomized trial.” In other words, not the purpose of the grant.","date":"Wed Aug 18 16:33:13 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"second goal to “evaluate the effectiveness of the IT messages at \na) decreasing mothers’ permissiveness for daughters to indoor tan and daughters’ perceptions of their permissiveness, \nb) reducing the prevalence of IT by mothers and daughters","date":"Wed Aug 18 16:31:48 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The first goal was to “develop and implement a social media campaign for mothers on health and wellness of adolescent daughters that includes a theory-based messaging advocating adolescent girls avoid IT [indoor tanning],”","date":"Wed Aug 18 16:30:13 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"#wastereportwednesdays\n\nIf a mom of a teenaged daughter sees an ad saying, “Don’t let your daughter indoor tan,” will it work? That’s the question researchers tried to answer, with the help of $3,452,234 from the American taxpayer. https://t.co/qcHOl8jVh2","date":"Wed Aug 18 16:28:55 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Russell Springs, KY where I participated in a healthcare roundtable. We had a great conversation about vaccine mandates and the infringement it poses on people’s individual freedoms. https://t.co/AuTHFHHetr","date":"Fri Aug 13 17:46:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be back in Kentucky! My first stop was in Somerset, KY to recognize @BaxtersCoffee as Senate Small Business of the Week. Baxter’s Coffee is a remarkable example of the critical role small businesses play in uplifting and building community. https://t.co/fMF0nhlRmp","date":"Fri Aug 13 15:00:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"...and so I present to you a chance to vote to replace the Democrat budget with a budget that actually balances. (4/4)","date":"Wed Aug 11 02:58:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"The Democrat budget before us is a blueprint for bankruptcy. The Democrat budget never balances and speeds us toward a day of reckoning. Already our national debt exceeds  $28 trillion and is growing at a rate of $2 million per minute. (2/4)","date":"Wed Aug 11 02:58:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Instead of concern this body is eager to explode the debt to the tune of nearly $5 trillion in one year. Republicans have been largely united in believing in a constitutional amendment that balances the budget in 5 years...(3/4)","date":"Wed Aug 11 02:58:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My remarks ahead of the vote on my amendment just now:\n\nDuring today’s long debate we have not heard a word on the actual subject at hand— the budget. The budget presented by the Democrats has been entirely ignored by both parties. (1/4)","date":"Wed Aug 11 02:58:10 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"I think this kind of censorship is very dangerous, incredibly anti-free speech, and truly anti-progress of science, which involves skepticism and argumentation to arrive at the truth. https://t.co/E8atFRMuBP","date":"Tue Aug 10 21:31:11 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Who’s afraid of the truth?  Watch the video YouTube took down on Rumble. https://t.co/ahe2BPhaKY","date":"Tue Aug 10 12:29:08 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Still waiting. . .","date":"Fri Aug 06 02:31:44 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We’ve been sitting around all day waiting for action on today’s installment of the $5 trillion Biden spending spree, so I decided to record the remarks I was going to give whenever we got to this bill… https://t.co/12YSMI7aYU","date":"Thu Aug 05 23:24:48 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I introduced my “Five Penny Plan” federal budget resolution that will balance within five years. I also plan to offer my Five Penny Plan as an amendment to any forthcoming budget resolution that is brought to the Senate floor. https://t.co/vCgzAAQP01","date":"Thu Aug 05 16:12:43 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Let’s fund infrastructure projects at home rather than building roads and bridges in Afghanistan. More in my latest oped here:\nhttps://t.co/z1MZRYNfCZ","date":"Sun Aug 01 16:08:49 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"As Ranking Member of the @SmallBizCmteGOP, each week I recognize an outstanding Kentucky small business that exemplifies the American entrepreneurial spirit. This week, it is my privilege to recognize @birddogscoffee. https://t.co/EnUmXHmJ08","date":"Fri Jul 30 20:39:20 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":".@SBAgov has wrongfully approved nearly $100 million in taxpayer-funded PPP loans to @PPFA branches across the country. On June 30th alone, SBA approved 4 PPP loans to PP affiliates despite a determination from the last Admin that they're ineligible. https://t.co/fRgPq9uEM4","date":"Tue Jul 27 19:19:37 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"https://t.co/e4A8FK986M","date":"Mon Jul 26 17:22:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul talks debt, jobs in visit to Henry Co. https://t.co/yvAOFxNAGd","date":"Sun Jul 25 13:55:01 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul: Dr. Fauci is “trying to escape culpability”https://t.co/xW3fpHCdl6","date":"Sat Jul 24 19:03:41 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul talks COVID response, vaccination; other topics in La Grange https://t.co/32vadduYS1","date":"Wed Jul 21 16:59:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was an honor to meet &amp; recognize the @LMPD, MetroSafe Dispatch &amp; a Good Samaritan this morning for their heroic efforts that saved a 6-year-old girl from being kidnapped in Louisville two weeks ago. https://t.co/wpIhqYnNea","date":"Mon Jul 19 17:44:04 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"When I asked Dr. Fauci about GOF research funding to a Wuhan lab in May he repeatedly denied it. Yet, emails released under the Freedom of Information Act show he knew. He isn’t a trusted advisor &amp; needs to be removed from a position of authority. https://t.co/pGulvH2bwQ","date":"Mon Jul 19 16:21:45 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"U.S. Senator Rand Paul visits Marion County https://t.co/njoTdTASMF","date":"Mon Jul 19 13:17:53 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul urges NSA director to investigate claims that agency spied on Tucker Carlson \n\nhttps://t.co/56NjYpHd3z","date":"Tue Jul 13 14:57:02 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"U.S. Senator Rand Paul visits Marion County \nhttps://t.co/njoTdTASMF","date":"Mon Jul 12 19:45:04 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul talks COVID response, vaccination; other topics in La Grange \nhttps://t.co/clmr9uHeyo","date":"Mon Jul 12 14:37:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul talks debt, jobs in visit to Henry Co. \nhttps://t.co/jMBtNSqkWz","date":"Mon Jul 12 00:34:31 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul visits Isaiah House, talks funding \nhttps://t.co/grzSVV8FbI","date":"Thu Jul 08 14:05:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"‘Confused economic nonsense’: Sen. Rand Paul criticizes Beshear’s back-to-work incentive program\nhttps://t.co/DVUq54hfxS","date":"Wed Jul 07 15:12:09 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul talks about crime, criminal justice reform in Louisville \nhttps://t.co/ns0F7HR6yW","date":"Wed Jul 07 13:28:21 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"We currently have a $28 trillion deficit, and $3.1 trillion of that has been from just this past year. It will only continue to grow if Democrats in Congress continue to give ‘free’ handouts &amp; push massive spending bills filled w/ pork barrel spending. https://t.co/V7hMsZvLqd","date":"Tue Jul 06 17:05:24 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul discusses economy in Country Boy visit  \nhttps://t.co/mNOMh4Kqem","date":"Tue Jul 06 15:08:33 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul touts criminal justice reform as he seeks 3rd term https://t.co/pRy0LPULcv","date":"Tue Jul 06 14:06:46 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you to Jean West and the Louisville Rotary for moderating such a great event with my friend Christopher 2X @2xGameChangers. We addressed some of the most important issues in Louisville right now, including curbing violence and the importance of education. https://t.co/e6xu3HJBsZ","date":"Thu Jul 01 17:27:28 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great way to start the day in Kentucky talking about school choice and taking action for freedom in education with Pastor Stephenson! https://t.co/4Ok8jDTJ79","date":"Thu Jul 01 15:36:17 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I also spoke to the Oldham County Chamber in La Grange, KY and honored a recent recipient of my @SmallBizCmteGOP of the week award, Dr. Molly Rutherford of Bluegrass Family Wellness, PLLC. https://t.co/KI6KiNt7sm","date":"Wed Jun 30 20:14:51 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Lots of great questions in New Castle, KY today! I held a community forum at the Henry County Cooperative Extension Office where I answered questions on issues like the economy &amp; stimulus checks as well as COVID19 vaccines &amp; the science of natural immunity. https://t.co/hPZwDet2Bi","date":"Wed Jun 30 17:39:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Operation Care in Shelbyville, KY does wonderful work helping people through  services like transitional housing for women &amp; children, critical medical &amp; dental care, and a food pantry. Enjoyed visiting their thrift shop &amp; hearing more about their Christian mission. https://t.co/s0X763wZ0J","date":"Wed Jun 30 16:34:19 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Good morning from Georgetown, KY at @CountryBoyBrew! Always great seeing Kentucky businesses thriving and succeeding! https://t.co/awdf9GgeQb","date":"Wed Jun 30 13:22:55 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Thank you @IsaiahHouse for hosting such an informative roundtable in Willisburg, KY today to talk about addiction recovery and substance abuse treatment. The work you do helping Kentuckians is so important, and I look forward to following up on our discussions! https://t.co/yZSNC5aJoB","date":"Tue Jun 29 20:38:51 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today I also stopped in Lebanon, KY for a meeting with local community members. I gave an update on what I’m working on in the Senate and took questions on issues including hemp, tech censorship, and 2nd amendment rights. https://t.co/rNdmb0E3ua","date":"Tue Jun 29 19:05:10 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Stopped in Green County, KY today for the Greensburg Rotary Club meeting! Always great to visit Longhunter’s Coffee. The lunch was delicious! https://t.co/APlzdTn7AT","date":"Tue Jun 29 17:27:35 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Senator Paul hopeful for bi-partisan compromise in infrastructure bill \nhttps://t.co/OMAW0hOD0F","date":"Tue Jun 22 19:15:08 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Bowling Green’s Batteries Plus Bulbs honored as Senate Small Business of the Week\nhttps://t.co/CrrHtpxnhL","date":"Tue Jun 22 14:03:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul in Paducah; Discusses Fauci, COVID\nhttps://t.co/ykvqoPkFr1","date":"Thu Jun 17 13:57:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Paul meets with local law enforcement in Mayfield, Kentucky https://t.co/9JZdlDHpJm","date":"Tue Jun 15 13:54:21 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Dr. Rand Paul Speaks at Xtreme Fabrication in Leitchfield, Kentucky \nhttps://t.co/REiS7P1mt9","date":"Mon Jun 14 17:04:22 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"U.S. Senator Rand Paul Speaks In Hardinsburg, Kentucky  \nhttps://t.co/U1IVHwIn7J","date":"Mon Jun 14 13:35:45 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul attends presentation on proposed job opportunities in Webster CO. https://t.co/YK1CPSTtx5","date":"Sat Jun 12 18:37:59 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"ICYMI I visited Grayson County on my recent trip through Western #Kentucky. Check it out! https://t.co/GfTRWThhkw","date":"Sat Jun 12 15:31:43 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Rand Paul talks labor, inflation with Chamber board members https://t.co/BizFw9e9ax","date":"Thu Jun 10 14:47:36 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen Rand Paul meets with Century regarding importance of military grade aluminum https://t.co/Bx3Vei88Mj","date":"Wed Jun 09 13:48:47 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Paul speaks on government spending, COVID at MSU business roundtable @murraystateuniv https://t.co/z7HzOqgYH5","date":"Tue Jun 08 17:56:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul participates in roundtable discussion in Paducah https://t.co/MMGZ1eqchv","date":"Tue Jun 08 15:25:05 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Senator Rand Paul tours through Western Kentucky to discuss key issues https://t.co/k2aVkMNIJw","date":"Tue Jun 08 13:48:18 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul visits Hopkinsville to host agricultural roundtable https://t.co/yyVAYlg6Fz","date":"Mon Jun 07 20:52:32 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Sen. Rand Paul Grills Dr. Fauci on NIH Grants and Wuhan Institute of Virology https://t.co/2REvSccgxo","date":"Mon Jun 07 20:21:28 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My last stop of the day was in Leitchfield, KY at Xtreme Fabrication. I talked with employees &amp; local leaders about filling jobs in the region, fully reopening businesses &amp; the economy. It’s been great to meet with so many Kentuckians this week! https://t.co/W6jF09qQCk","date":"Thu Jun 03 20:27:13 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Hawesville, KY, where I met with Century Aluminum employees, &amp; local industry leaders. It was great to see their American made products &amp; discuss bringing jobs back to the U.S. https://t.co/UGbOFYFCn1","date":"Thu Jun 03 17:06:07 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning, I visited Owensboro, KY. I met with the Kentucky Sheriff’s Association &amp; local law enforcement. I then spoke with the Daviess County Chamber of Commerce where we discussed infrastructure, COVID-19’s impact on businesses, &amp; government spending. https://t.co/IfpG15GFym","date":"Thu Jun 03 15:02:42 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"\"U.S. Sen. Rand Paul kicked off a swing through four western Kentucky cities Wednesday with a morning stop at the Paducah office of the Kentucky Farm Bureau.\" https://t.co/kAveYJXUUT","date":"Thu Jun 03 13:51:14 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"After visiting Smithland, KY, I stopped at the University of Kentucky Rare Earth Research Station in Providence, KY. Webster Co. is working with Alliance Coal &amp; @universityofky to extract rare earth elements from coal spoils, benefitting U.S. national security &amp; the economy. https://t.co/ewUmiTCddq","date":"Wed Jun 02 19:24:12 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"This morning, I stopped at the Paducah, KY @KYFB to meet with local farmers and community leaders. We discussed the region’s Ag issues &amp; the need for less regulations on KY farmers. https://t.co/t3Fckhs4v3","date":"Wed Jun 02 15:08:00 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to be in-studio with @GregDunker on @NewsTalk943 this morning! https://t.co/gYoNWKVEaV","date":"Wed Jun 02 13:57:02 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My last stop of the day was in Mayfield, KY where I met with local law enforcement and first responders. Thank you for protecting and serving our communities! https://t.co/cXqXyCRpTP","date":"Tue Jun 01 22:08:32 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Happy 229th Birthday Kentucky! https://t.co/pd8lAbMsMx","date":"Tue Jun 01 20:41:12 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"It was great to visit @murraystateuniv’s College of Business to participate in a discussion on the current state of small businesses and economic activity in Murray, KY &amp; the surrounding region. https://t.co/eFUDi2Fatt","date":"Tue Jun 01 19:50:44 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"My next stop was in Cadiz, KY at the Trigg County Fiscal Courthouse. I spoke with community leaders on Land Between the Lakes in Kentucky &amp; Tennessee, and the legislation impacting the region. https://t.co/StIh8Te8G9","date":"Tue Jun 01 16:20:35 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Great to be back in the Commonwealth! I’m kicking off my Western Kentucky travel in Hopkinsville, KY. This morning, I attended an Agriculture roundtable hosted by the Commonwealth Agri Energy Ethanol Plant. We discussed the community’s Ag needs, infrastructure &amp; government waste. https://t.co/LvidcUHskX","date":"Tue Jun 01 14:35:27 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today several of my Senate colleagues and I held a press conference. We are currently $28 trillion in debt. Not only does the China spending bill put us even more in debt, it gives money to one of the most wasteful agencies in government, the National Science Foundation. https://t.co/qtVHkcyd8U","date":"Fri May 28 16:41:57 +0000 2021","user_id":"1298624375692894210"},{"handle":"SenRandPaul","text":"Today on the Senate Floor, I railed against wasteful spending. Watch ⤵️\nhttps://t.co/WNouMMlx6F","date":"Fri May 28 14:32:09 +0000 2021","user_id":"1298624375692894210"}]