[{"handle":"SenStabenow","text":"Reminder: Republicans want to raise taxes on working families and put Medicare, Social Security, and Medicaid on the chopping block. @POTUS and @SenateDems’ plan puts the American people first and strengthens services people rely on.","date":"Thu Jun 16 21:54:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Big news for Michigan veterans: The Senate just came together to provide the VA with the long overdue resources needed to treat veterans who have been exposed to toxic substances. Our nation’s heroes deserve quality, affordable health care. #PACTAct","date":"Thu Jun 16 17:04:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I could not agree more. Oil companies need to stop price gouging Americans. \nhttps://t.co/YnfOaxqpM8","date":"Thu Jun 16 13:13:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Help is on the way for moms and babies in Michigan and nationwide! New shipments of formula—including through DTW—will reach store shelves and healthcare providers soon.","date":"Wed Jun 15 20:17:50 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our bipartisan gun safety proposal builds upon my transformational behavioral health care initiative. We are finally treating health care above the neck the same as health care below the neck. https://t.co/W7pZ7MYJL7","date":"Wed Jun 15 17:24:39 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thoughts and prayers are not enough. It’s time to act. https://t.co/3WMQ0QiFoX","date":"Wed Jun 15 13:56:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Women should have the freedom to make their own reproductive health decisions, not politicians. Period.","date":"Tue Jun 14 21:15:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We don’t have to live with the gun violence epidemic in our country. Our bipartisan gun safety proposal is a meaningful step in the right direction. https://t.co/sRcROJc80X","date":"Tue Jun 14 16:29:42 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"When our goods are stuck in our ports, that hurts Michigan farmers, businesses, and workers. I’m thrilled that this critical bill is on its way to @POTUS’ desk!","date":"Tue Jun 14 13:08:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"My mental health care initiative is a proven success story. We’ve seen in MI how Community Behavioral Health Clinics provide quality, affordable behavioral health care. We’re one step closer to expanding these life-changing clinics to people in every corner of our country.","date":"Tue Jun 14 00:08:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It was the honor of a lifetime working alongside Carl Levin. I will never forget the joy he brought to all who knew him. He is greatly missed.\nhttps://t.co/nNU8w9d2ek","date":"Sun Jun 12 23:12:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The mental health care &amp; addiction initiative I created with @RoyBlunt is a proven success story. Now our community behavioral health clinics will be available nationwide.\n\nWe will finally make sure health care above the neck is funded the same way as health care below the neck.","date":"Sun Jun 12 17:55:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Inaction on gun violence is not an option. Republicans and Democrats came together on a bipartisan proposal to help keep our children safe. It's an important first step on our path to combat gun violence. https://t.co/SSheNfkP81","date":"Sun Jun 12 17:55:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What an honor to stand side by side with all the young adults at the #MarchForOurLives rally today. Thank you Riley for the introduction! \n\nFirearms are now the leading cause of death for American children. Enough is enough!! https://t.co/DukW5hUY0H","date":"Sat Jun 11 15:40:59 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Back in the 1800s, Detroit Central Market put Detroit on the map. Exciting to have this structure live on at The Henry Ford Museum! https://t.co/gdllK9rzMJ","date":"Fri Jun 10 22:57:17 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So impressed with the new Detroit Union Carpenters and Millwrights Skilled Training Center. This facility will increase the training capacity of skilled workers in Southeast Michigan! https://t.co/W0nP7Lw75P","date":"Fri Jun 10 21:02:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Honored to receive the Keystone Leadership Award from @TheKeystoneCtr! It's a privilege to work across the aisle every day to get things done for Michigan. #KPCLeadershipAwards https://t.co/XLOwFd2LlC","date":"Thu Jun 09 22:52:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Time is running out. In 22 days children across America will not be able to receive healthy meals this summer or next school year. https://t.co/tfjQGxn30s","date":"Thu Jun 09 00:47:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Firearms are now the leading cause of death for American children. We need to do better than thoughts and prayers. https://t.co/cZHyzeqJQD","date":"Wed Jun 08 16:32:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited about our state’s first USDA urban agriculture committees in Detroit &amp; Grand Rapids. These committees will help our urban farmers create jobs and put healthy food on the table.\nhttps://t.co/cMu5ixeZq1","date":"Wed Jun 08 14:29:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news out of Auburn Hills! @FLOevcharging is creating jobs at a new EV charging plant. This wouldn't have been possible without the investment from the Bipartisan Infrastructure Law. \n \nMI workers continue to lead our country to a clean energy future!https://t.co/TD3GkyMe97","date":"Tue Jun 07 17:04:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"ICYMI: Read more about how my initiative with @RoyBlunt is transforming mental health and addiction treatment across the country. \nhttps://t.co/aVSxVa7PJp","date":"Tue Jun 07 13:01:59 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers are going to continue to help save lives! \nhttps://t.co/d8Ahtac6xr","date":"Mon Jun 06 21:17:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations!","date":"Mon Jun 06 20:21:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Alzheimer’s is a heartbreaking disease for patients, families, &amp; caregivers.\n \nThis month and every month, I am thankful to have @alzassociation and advocates across Michigan as partners in the fight to #EndALZ. #AlzheimersAwarenessMonth","date":"Mon Jun 06 12:58:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck @Money23Green! I know you will make Michigan proud.","date":"Sun Jun 05 21:05:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations to this outstanding group of Michiganians of the Year! Thank you for everything you are doing to make our state the best it can be! \n\nhttps://t.co/x2KSlpBatk","date":"Sun Jun 05 13:08:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today, we celebrate the anniversary of the 19th Amendment. This milestone paved the way for generations of women leaders. We have come so far, but there is still more work to be done in the fight for equality.","date":"Sat Jun 04 14:37:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It was an exciting day in Grand Rapids! @USDA &amp; I announced new opportunities for urban farmers in our state, including our first urban agriculture offices in Detroit &amp; Grand Rapids.\n\nThe projects will put healthy food on the table, improve water quality, create new jobs, &amp; more! https://t.co/l95X8BqC7G","date":"Sat Jun 04 01:42:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Homegrown biofuels play a critical role in increasing U.S. energy security at a time when Russia threatens to reduce production.","date":"Fri Jun 03 20:35:20 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today’s action by @EPA and its previous move to increase ethanol in gasoline during the summer months will help lower gas prices and reduce emissions to combat the climate crisis.\nhttps://t.co/mV9NA5wwlC","date":"Fri Jun 03 20:35:19 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From Henry Ford’s first automobile to today’s amazing all-electric F-150, Michigan has always led the way on innovation. https://t.co/iCt3Hq170t","date":"Thu Jun 02 16:36:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news from @Ford! Michigan workers are the best in the world, and today’s announcement will help them lead the future of our auto industry. https://t.co/nq1W1jvjfy","date":"Thu Jun 02 13:37:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This law makes the single-largest-ever investment in our Great Lakes, fixes our infrastructure, and speeds up battery production to make new electric vehicles!","date":"Wed Jun 01 20:59:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Infrastructure Investment &amp; Jobs Act is making a huge difference in Michigan already. This is a great example of teamwork with our partners @SecretaryPete, @GovWhitmer, our federal delegation, and local leaders. https://t.co/fSXMPSRchu","date":"Wed Jun 01 20:59:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Tune in! @SenGaryPeters and I are talking about how we've been working across the aisle in the U.S. Senate to deliver some important wins for Michigan.\nhttps://t.co/2dpdx6RGYW","date":"Wed Jun 01 18:35:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be back at the Mackinac Policy Conference! There is no question we have a number of challenges, but I’m focused every day on getting things done for Michigan. #MPC22 https://t.co/d9hom1wueg","date":"Wed Jun 01 13:58:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This Pride Month, we celebrate the trailblazers in Michigan and across our country, and we remember the ongoing challenges the LGBTQ+ community faces. There is more to be done in the fight for equality. - Debbie Stabenow (she/her) https://t.co/MUNcpgISKS","date":"Wed Jun 01 12:57:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to Lt. Bush for showing me the Gaylord areas damaged by the tornado. I met with city, county, state &amp; community leaders to hear what this community needs to recover. Inspiring to see everyone come together to help. https://t.co/GuZbNomCRh","date":"Tue May 31 21:13:42 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s time we start treating health care above the neck the same as health care below the neck. Read more about how my initiative with @RoyBlunt is transforming mental health and addiction treatment across the country.\nhttps://t.co/xBxDT9OeXm","date":"Tue May 31 14:51:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, John Heidenreich for this special tribute today!\nhttps://t.co/GQeKpRV64V","date":"Mon May 30 13:29:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This Memorial Day and every day, we show our unwavering gratitude to those who lost their lives fighting for our country. Let’s support their families and honor their heroic sacrifice. https://t.co/Klwu6JZtDh","date":"Mon May 30 12:07:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I continue to be inspired by the strength and courage of the Oxford High community. I stand with you. Now is the time to act.\n\nhttps://t.co/1nuCXTEibb","date":"Sun May 29 13:35:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you @chefjoseandres for all you do—including the help you are giving to the people in Gaylord, Michigan who were hit so hard by the tornado.","date":"Sat May 28 13:26:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The last time oil was $110 a barrel, gas was $3.58 a gallon. Now it’s $4.60. Why? Oil companies are padding their profits and taking advantage of the American people. https://t.co/KOFd2UfW7c","date":"Fri May 27 22:30:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS is addressing the baby formula shortage by signing my bipartisan Access to Baby Formula Act, invoking the Defense Production Act and launching Operation Fly Formula.\n \n1.5 million cans have arrived in the U.S. so far and there's more to come! https://t.co/docveeiBkY","date":"Fri May 27 16:38:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @MIChronicle, for hosting an important discussion this week on tackling the challenges and opportunities facing Detroit and other Michigan urban communities. https://t.co/KFawNYwa31","date":"Fri May 27 12:30:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to Congress, @USDA, and @POTUS’ swift actions last week, baby formula is headed to store shelves.","date":"Thu May 26 21:35:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I spoke on the Senate floor urging my Republican colleagues to join us to take action on gun violence. We don’t have to live like this! https://t.co/tGJKYETFdj","date":"Thu May 26 19:56:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats think our best days are ahead of us. MAGA Republicans think they are behind us—50 years or even 100 years. https://t.co/OsB6uVBQdT","date":"Thu May 26 15:12:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What a privilege to meet Korean and Vietnam veterans from the UP at the WWII Memorial today and thank them for their service. Thank you to the Honor Flight Network, who flew them from Escanaba to Washington D.C. https://t.co/IZMyiuD4zh","date":"Thu May 26 00:52:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @GovWhitmer!","date":"Wed May 25 21:40:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"HAPPENING NOW!\n \nTune in to watch @SenateDems discussion with state leaders about Roe v. Wade and the future of women’s reproductive freedom in America.\nhttps://t.co/FKkpaWcTVF","date":"Wed May 25 20:34:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We don't have to live like this. No other country does.","date":"Tue May 24 21:00:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Stephanie Davis has spent her entire career serving the people of Michigan. I know she will continue this work on the Sixth Circuit Court of Appeals. https://t.co/05ko29MRPJ","date":"Tue May 24 18:08:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It was a pleasure speaking with Reverend Antoine Colvin, the new pastor of the Historic Little Rock Baptist Church. Welcome to Detroit! We are so glad to have you and your family with us! https://t.co/FDWSGfcXAW","date":"Tue May 24 15:02:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The price of insulin should be capped at $35 a month.","date":"Tue May 24 13:00:50 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Safe baby formula is on its way to store shelves and parents who need it: https://t.co/QTrScYo9W6","date":"Tue May 24 01:09:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The number of Americans relying on unemployment insurance programs fell to its lowest level in over 52 years!\n \nOur businesses are getting America back to work.","date":"Mon May 23 19:50:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks @POTUS &amp; @USDA for making sure babies who need formula can get it. \n\n1.5 million cans are on their way to stores this week.","date":"Mon May 23 16:13:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is an all hands on deck moment. I’ll keep fighting to get baby formula in the hands of Michigan families.   \nhttps://t.co/WWbjLpcTQM","date":"Mon May 23 13:17:28 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The DHS Trade and Economic Security Council Act is an important step to address critical shortages and breakdowns that will not only benefit our economy but our homeland security too.\n \nRead more here: https://t.co/ehPDPaWlCx","date":"Sun May 22 18:00:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There’s no question that strengthening our domestic manufacturing and food supply chains is critical to our national security.\n \nI introduced bipartisan legislation with @senrobportman &amp; @SenGaryPeters to do just that.","date":"Sun May 22 18:00:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan's Dawn Ison is officially sworn in as U.S. Attorney for the Eastern District of Michigan! You've made Michigan so proud! https://t.co/Nj6vcjOk2K","date":"Sat May 21 18:43:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Just one of the many ways the Infrastructure law is delivering for our schools.","date":"Sat May 21 14:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Help is on the way! @POTUS just signed my bill to address the baby formula shortage into law. It’ll make sure moms and babies can still get the formula they need, and guarantee manufacturers have a plan in place to keep this from happening again. https://t.co/BSnHzhoLHR","date":"Sat May 21 13:01:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The scenes from Gaylord are just devastating. I’m saying a prayer for all those injured and giving thanks for the first responders and community members who are already working on recovery.\n\nhttps://t.co/Q8yRzz1fj2","date":"Sat May 21 00:06:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS is putting people first. This week:\n✔️increasing baby formula supply\n✔️getting free COVID-19 tests to households\n✔️making housing more affordable https://t.co/Seg8bYjcwz","date":"Fri May 20 20:03:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s clear who is putting the safety of the American people first.","date":"Fri May 20 17:40:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Just joined @morning_joe to talk about the urgent baby formula shortage. My bipartisan bill just passed the Senate to get formula in the hands of families now and ensure there is not a future delay in getting babies the safe and healthy formula they need. https://t.co/bR2HMZrSaU","date":"Fri May 20 14:34:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"More free COVID-19 tests are available. Visit https://t.co/e9NIxUwPYu to order yours.","date":"Fri May 20 13:50:17 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Professor Michael Barr is exactly who we need at the Federal Reserve. I can’t think of anyone who would do a better job in such a crucial role at a crucial time for families and our economy. Great to introduce him @SenateBanking with @SenGaryPeters. https://t.co/9Q3pfnOaEG","date":"Thu May 19 22:03:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I am proud of how swiftly we worked together – House, Senate, Democrat, Republican –to bring forward and pass this overwhelmingly bipartisan legislation.\nhttps://t.co/6pXVfA2jEp","date":"Thu May 19 21:22:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Extremism and hatred have no place in America. https://t.co/D3PzJBeYZ0","date":"Thu May 19 19:03:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congress stands with the people of Ukraine and just delivered another critical assistance package with both military and humanitarian aid. I will continue to do everything in my power to support the Ukrainian people’s fight for freedom.","date":"Thu May 19 17:50:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Alzheimer's is a heartbreaking disease for patients, families, and caregivers. This week I met with @alzmichigan advocates, who are doing incredible work to support all those affected by this disease. I'm glad to have them as partners in this fight. https://t.co/hJBWrf9vRK","date":"Thu May 19 14:30:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Important vote today to support our Michigan restaurants and bars! We can deliver urgently needed funding if Republicans join us!","date":"Thu May 19 13:15:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is an extremely stressful time for parents who are being forced to search high and low to find baby formula. \n\nAlmost half of all babies born in the U.S. rely on the WIC program.","date":"Thu May 19 00:46:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"That’s why I’m leading this bipartisan effort with @JohnBoozman and Senate and House colleagues to address this shortage as quickly as possible. We must do everything we can to ensure our families have what they need to keep their children healthy and fed.https://t.co/2TFMNabxls","date":"Thu May 19 00:46:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @POTUS.\nhttps://t.co/fvur31kecW","date":"Thu May 19 00:36:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@johnboozman and I are partnering across the aisle to help millions of families get the formula they need to feed their babies during this crisis. WATCH: https://t.co/fVM60aQBeg","date":"Wed May 18 20:37:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s been six months since we passed the historic Infrastructure law. Since then, Michigan has received over $2.9 billion to fix our roads and bridges, strengthen public transportation, clean up our Great Lakes, and more. And we are just getting started!","date":"Wed May 18 20:06:17 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Oil and gas companies are making prices at the pump go up and up so that they can continue to make record-high profits. These companies are exploiting hardworking Michiganders.","date":"Wed May 18 16:28:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's always great to celebrate women business leaders - especially when they are from Michigan! So glad I got to talk with @committeeof200 members and thank them for all they do. https://t.co/M9DqD7wWRB","date":"Wed May 18 13:04:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No parent should have to frantically run from one grocery store to the next or go online to try to find food for their baby.\n \nI am laser-focused on making sure moms and babies can get the healthy food they need safely. This crisis is urgent! https://t.co/qmzzJlNk5d","date":"Wed May 18 01:41:39 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: Republicans have increased our national deficit. Democrats are lowering it.","date":"Tue May 17 21:49:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good news!\nhttps://t.co/31fSkOW2cF","date":"Tue May 17 19:49:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The 25 largest oil and gas companies raked in $205 billion in profits last year all while price gouging Michigan drivers at the pump. This has got to stop.\nhttps://t.co/7V0YUz95c3","date":"Tue May 17 17:14:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This action by the FDA is important. Safely increasing the availability of infant formula from trusted international companies will give parents more options for their babies that meet our critical nutrition and safety standards.\nhttps://t.co/mtXDlEGLl1","date":"Tue May 17 15:15:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today marks the 68th anniversary of the landmark Brown v. Board of Education ruling ending racial segregation in public schools. This decision forever changed our country, but the fight for racial justice is not over.","date":"Tue May 17 13:08:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is absurd!\n \nOil and gas companies are making choices to keep prices high at the pump so that they can pad their pockets with record profits.\nhttps://t.co/pizdvDkTJz","date":"Tue May 17 00:38:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Then we must act to address gun violence! It’s past time!","date":"Mon May 16 23:22:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"My heart goes out to the families in Buffalo who lost a loved one over the weekend.\n \nThe facts are clear: this was a planned white supremacist attack on a Black community. White supremacy, hatred, and racism have no place in our country and must be condemned.","date":"Mon May 16 23:22:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Sending well wishes to my friend @ChrisVanHollen and his family. I look forward to seeing him back in the Senate soon.","date":"Mon May 16 18:48:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"@POTUS and @SenateDems budget will lower costs that keep Americans up at night. The Republican plan? Increase taxes on Americans and let billionaires and large companies off the hook as they price gouge and take advantage of the American people.","date":"Mon May 16 13:21:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This Gold Star Awareness Month, we honor all of Michigan’s Gold Star families. No one has given more to our country than service members lost in combat and the families they leave behind.\nhttps://t.co/TfQC0DYJSx","date":"Sun May 15 22:26:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wonderful to see @WesternMichU supporting electric vehicles. Getting more Michigan-made EVs on the road is great for our economy and environment. https://t.co/kXTCMgpZUa","date":"Sun May 15 19:21:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Honored to speak at @K12Michigan’s Spring Policy Conference. They have done such incredible work helping Michigan schools educate students throughout the pandemic. https://t.co/3XPB9wF0Bm","date":"Sat May 14 19:03:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be with all my friends at @BPWMichigan who are continuing to improve women’s lives. Congratulations on over 100 years! https://t.co/pK0o9e2KX0","date":"Sat May 14 14:04:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's clear: @POTUS is putting people first by making high-speed internet more affordable and taking steps to lower the cost of food! https://t.co/vAMAwflYuh","date":"Fri May 13 22:13:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to our historic Infrastructure investments, millions of families are now eligible for free high-speed internet access. Visit https://t.co/M8FCFvUPhI to learn more.","date":"Fri May 13 13:01:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Alvaro Bedoya is confirmed! This means the @FTC now has the full strength to put consumers first by protecting them from price-gouging.","date":"Fri May 13 00:27:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our Asian Pacific American businesses make our communities stronger and more vibrant in Michigan. \n\nDuring #AAPIHeritageMonth, I joined @APACC_Detroit for their Annual Gala to celebrate all they do to support these businesses! https://t.co/zsi4qTdP7m","date":"Thu May 12 21:19:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The @hfcc Class of 2022 is full of the next generation of Michigan leaders! \n\nIt was an honor to join them on their commencement day. I know they’ve made their friends and family proud! https://t.co/EqeGTMdn7v","date":"Thu May 12 19:50:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"MI workers are best in the world &amp; there's nothing more American than making sure our products are built here at home.\n\nGreat to meet with @DepSecGraves in Detroit this week to discuss how to support diverse suppliers, make more things in Michigan &amp; create more good-paying jobs. https://t.co/kGKvJ0BdnF","date":"Thu May 12 15:49:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Dr. Lisa Cook’s experience is unmatched and is needed as our nation recovers from the pandemic. I’m so proud to see one of Michigan’s best at the Federal Reserve — I know she’ll do an amazing job.\nhttps://t.co/vsQ0bT0od4","date":"Thu May 12 12:57:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If Roe v. Wade falls, American women will no longer be able to make our own reproductive health decisions. This is the ultimate intrusion into our privacy. We need to protect our freedom and pass the Women’s Health Protection Act now. https://t.co/UmZq2JaHze","date":"Wed May 11 17:59:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Republican politicians want to take away 50 years of freedom for women in this country to make our own reproductive health decisions! https://t.co/QBxhLs8zxB","date":"Wed May 11 17:02:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Deciding if and when to have a child is the most personal – and most consequential – decision any of us can make. Women alone should be able to make that choice, not right-wing Republican lawmakers or members of the Supreme Court.\n \nThat is what today’s vote is about.","date":"Wed May 11 13:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Tomorrow, every U.S. Senator will show where they stand. The stakes could not be higher. https://t.co/FSLdCOI7ve","date":"Tue May 10 22:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS and @SenateDems, we are making more things in America!","date":"Tue May 10 20:37:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @GovWhitmer!","date":"Tue May 10 16:42:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This Women’s Health Week comes at a critical moment in our county. Our right to privacy and freedom to make our own health care decisions are under attack.","date":"Tue May 10 13:05:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"May is #AAPIHeritageMonth. From serving our country in uniform to advocating for civil rights, the contributions of the Asian American and Pacific Islander community have touched the lives of every Michigander. We celebrate their role in making Michigan a better place.","date":"Mon May 09 16:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"To the women in this country:  I support you. I respect you. And I believe you alone have the right to make your own reproductive health choices.","date":"Mon May 09 13:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Some good news to get you through the day.\nhttps://t.co/U8HxZYWAhU","date":"Sun May 08 18:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Mother’s Day to all the moms in Michigan and the special women who care for and love our children – including my mom! We are all lucky to have you in our lives. https://t.co/wDoSAGXD1u","date":"Sun May 08 13:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This week I met two Michiganders who represented our country at the Olympics and Paralymics!\n \nJohn and Mason - your dedication is inspiring and you've made Michigan proud. https://t.co/MIOY5dlOPF","date":"Sat May 07 14:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our nation’s next Farm Bill will give Michigan farmers, families, and rural communities the tools they need to meet new challenges. That’s why I started the process by hearing directly from them. https://t.co/M3nhEC2AbQ","date":"Sat May 07 00:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From record-setting job growth to reducing the deficit by over $350 billion, @POTUS is putting our economy first. https://t.co/b2H4GzWKAV","date":"Fri May 06 22:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"A million empty chairs at the dining room table. A million people missed at a birthday party. A million American lives tragically cut short. On this day – and every day – I’m holding space in my heart for everyone who is grieving. You are not forgotten.\nhttps://t.co/CJrdD0oMJb","date":"Fri May 06 21:24:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations to Michigan’s Small Business Person of the Year, Tarolyn Buckles! Small businesses like yours are the heart and soul of our Michigan communities. #SmallBusinessWeek","date":"Fri May 06 21:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I led the effort to secure these important priorities for Michigan in the Water Resources Development Act. Read more here:\nhttps://t.co/tdIL6uQqiq","date":"Fri May 06 19:21:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many in MI know the impact of severe weather &amp; our aging infrastructure.\n \nThe good news - the Water Resources Development Act will help this. It will protect our Great Lakes from invasive species, address erosion in our coastal areas &amp; prevent flooding in our communities.","date":"Fri May 06 19:21:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"A woman’s right to privacy and our freedom to make personal health care decisions, including access to safe, legal abortion services are all on the line. Next week the American people will know where every senator stands. https://t.co/uib5MHUUw9","date":"Fri May 06 16:13:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Record-setting job growth continues!\nhttps://t.co/6XsPSvjefY","date":"Fri May 06 13:56:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s crystal clear. Oil companies are taking advantage of American drivers while making record profits.\nhttps://t.co/CyLzGPCsFb","date":"Thu May 05 16:29:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"All of us have teachers who have made such a big difference in our lives and pushed us to do our best. Thanks to Michigan teachers for all you do to support and encourage our students. You deserve to be celebrated every day! #TeacherAppreciationWeek","date":"Thu May 05 15:14:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to see the @WhiteHouse’s focus on food, nutrition, hunger and health. I look forward to working together to explore programs that are working well, ways to get more healthy food to the people who need it, and lessons learned from the pandemic to better help those in need.","date":"Thu May 05 13:07:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The attack on women’s right to privacy and reproductive health is very real. I will do everything in my power to protect the women of Michigan. https://t.co/oaqrR8kwxU","date":"Thu May 05 00:03:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Retweet if you think a woman has the right to make her own reproductive health decisions.","date":"Wed May 04 18:22:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations Eminem! Detroit proud! \nhttps://t.co/oWoAVxlgaB","date":"Wed May 04 14:52:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"A woman should be able to make her own reproductive health choices, not right-wing Republican lawmakers or members of the Supreme Court.\n \nThis is a very serious moment in our country that could have grave consequences for women across our nation. https://t.co/xLXOdihhKA","date":"Wed May 04 13:46:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If the Supreme Court overturns Roe v. Wade, it would be the ultimate intrusion into a woman’s right to privacy. We need to pass the Women’s Health Protection Act to protect our right to make our own reproductive health decisions. https://t.co/WH6MnSHeuE","date":"Wed May 04 01:47:19 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is outrageous! Overturning #RoeVWade will have extreme consequences for women across the country. https://t.co/6SIznHgP8s","date":"Tue May 03 02:28:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we begin to work on our nation’s next Farm Bill, I'm committed to supporting Michigan’s farmers and families, creating new jobs, and ensuring that Michigan is represented on every page.\nhttps://t.co/8Eb5iGEHmr","date":"Mon May 02 21:47:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today’s Google Doodle is of Elijah J. McCoy, an amazing inventor from Michigan! McCoy was raised in Ypsilanti and invented lubrication systems for steam engines. Back in 2011, I honored him by naming the first regional U.S. Patent &amp; Trademark Office in Detroit after him. https://t.co/dXeTJuO9EK","date":"Mon May 02 20:28:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"One of my favorite things as a Senator is welcoming Michigan students to the Capitol. Oxford community school students were here last week and I was so glad to be able to talk with them. #OxfordStrong https://t.co/9qyH5DIyqX","date":"Mon May 02 17:07:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wishing a peaceful and joyous Eid al-Fitr to everyone celebrating. #EidMubarak","date":"Mon May 02 13:14:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Heading into the @DETROITNAACP annual dinner! https://t.co/Gf9bkYlySy","date":"Sun May 01 20:20:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we kick off Mental Health Awareness Month, I want to draw attention to our community behavioral health centers. They have been life-changing for so many who need mental health and addiction treatment.","date":"Sun May 01 15:13:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The good news is there’s lots of bipartisan momentum to expand these to every state in the country. @POTUS is on board and included this initiative in his budget!","date":"Sun May 01 15:13:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great visit to @frugthaven farm in Greenville. Orchards, hard cider, awesome event spaces and more! https://t.co/1bhdfANzyZ","date":"Sat Apr 30 19:54:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree. It’s time billionaires and giant corporations pay their fair share.","date":"Sat Apr 30 14:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Agriculture powers 1 in every 4 jobs in Michigan. Today we heard from 16 witnesses - dairy farmers in the thumb, food banks and farmers markets in the UP, cherry growers &amp; specialty crop producers along the fruit belt. Their insights are key to writing the next Farm Bill. https://t.co/tFYr7SQ1jY","date":"Sat Apr 30 00:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news: thanks to @POTUS, small businesses are booming and more Americans have access to lifesaving COVID-19 treatments! https://t.co/fqmanO5cEq","date":"Fri Apr 29 22:47:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Here at @michiganstateu with my colleague @SenateAgGOP @JohnBoozman where we just wrapped up the first hearing of the 2023 Farm Bill! The Farm Bill has always been bipartisan and we continued that strong tradition today. https://t.co/YS8M32zncK","date":"Fri Apr 29 20:24:50 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited to kick off the Farm Bill field hearings at my alma mater @michiganstateu with my friend and colleague @JohnBoozman. https://t.co/GNDYXjXZj8","date":"Fri Apr 29 14:09:56 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you! Glad to have such a strong partner in @AVMACAN.","date":"Fri Apr 29 12:58:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Making more semiconductors in America is essential to the future of our manufacturing industry. The CHIPS Act will put Michigan workers in the driver’s seat.","date":"Thu Apr 28 21:32:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Republicans always promise to reduce the national debt. Instead, it grew by $7.2 trillion in four years under President Trump! That’s 30% of our total debt! https://t.co/jHqXDKDu0B","date":"Thu Apr 28 16:31:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No American should be forced to ration their insulin because of outrageous costs. It’s time to cap the cost of insulin at $35 a month.","date":"Thu Apr 28 13:23:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The future is electric, and it’s being made in Michigan! #F150Lightning ⚡️","date":"Wed Apr 27 21:34:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Republicans create huge deficits⬇️Democrats clean up the mess. Rinse, repeat! https://t.co/BVufavGqYJ","date":"Wed Apr 27 18:11:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Madeleine Albright was a tireless champion for democracy and human rights and a wonderful role model for so many of us. Her service has had a profound impact on our nation and our world. She will be greatly missed. https://t.co/AoH3ng05Xh","date":"Wed Apr 27 16:07:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Republicans talk and talk about inflation. But they refuse to actually do anything to lower costs for Americans. @POTUS and @SenateDems are focused on strengthening our food system and lowering the cost of food. https://t.co/wW7ycykHn9","date":"Wed Apr 27 13:20:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Putting more Michigan-made EVs on the road is a win-win for our environment and economy. I am excited to see @michiganstateu moving toward a clean energy future.\nhttps://t.co/EAVzVC69cp","date":"Tue Apr 26 22:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats in Congress are laser-focused on building a better America. Meanwhile, Republicans have voted against tax cuts for working families, funding for schools to deal with the pandemic, and funding for President Biden’s historic vaccination effort.","date":"Tue Apr 26 20:15:19 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I have always said Michigan workers are the best in the world. Glad to see @GM step up and help the Ukrainian people during this unimaginable tragedy.\nhttps://t.co/LOo48yKrOX","date":"Tue Apr 26 17:06:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Let’s be clear: the climate crisis impacts Americans every day. I remain committed to providing our farmers, foresters, and businesses with the tools they need to tackle the climate crisis. We need to act.","date":"Tue Apr 26 13:03:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS and @SenateDems, we’re seeing the best economy for American workers in decades. Americans are getting higher wages, better benefits, and better jobs across the board.","date":"Mon Apr 25 17:39:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What an excellent choice at such an important time.\n\nhttps://t.co/pYTlnhirQN","date":"Mon Apr 25 14:01:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No one should have to worry about going into debt to pay for their lifesaving insulin. It’s time to cap the price of insulin at $35 a month.","date":"Mon Apr 25 13:02:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So sorry to hear that Senator Orrin Hatch has died. We worked together on health issues on the Finance Committee, and he was passionate about serving the people of Utah. Sending my prayers to his family.","date":"Sun Apr 24 01:47:50 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, Miggy! 3️⃣0️⃣0️⃣0️⃣!","date":"Sat Apr 23 18:44:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"In today’s world, you need reliable high-speed internet to be successful. Thanks to new infrastructure investments, more Michiganders will have access to quality, affordable high-speed internet.","date":"Sat Apr 23 16:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS, our economy is on the move!","date":"Sat Apr 23 14:13:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I can’t let #EarthDay end without talking about our Great Lakes. I'm laser-focused on protecting them for our children and grandchildren.\n \nThe Infrastructure Investment &amp; Jobs Act made the single-largest investment in our Lakes to clean up pollution &amp; protect our MI way of life.","date":"Fri Apr 22 21:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good news for folks who rely on Medicare, Medicaid, or the VA for their health care. @POTUS’ budget will lower your health care costs.\nhttps://t.co/5yDz2cLWxk","date":"Fri Apr 22 19:35:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The climate crisis is here and we see its impacts in Michigan. Lake Superior is one of the five fastest-warming lakes in the world!\n \nMichigan workers are the best in the world and are leading the way to move quickly on clean energy and electric vehicles. #EarthDay","date":"Fri Apr 22 18:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Here is a list of just some of the great things @POTUS and @SenateDems accomplished last month:\n• Confirmed the first Black woman to the Supreme Court\n• Passed bipartisan legislation to strengthen the @USPS\n• Lowest unemployment insurance claims in 50 years","date":"Fri Apr 22 17:30:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What happened to Patrick Lyoya was not only a tragedy but just plain wrong. While it will not bring back their son, the family deserves justice.","date":"Fri Apr 22 16:20:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today’s #EarthDay announcement from @POTUS is a win-win that helps protect our forests so they can continue to trap and hold planet-warming CO2, and at the same time ensures local economies that count on our forests and forest products can thrive. https://t.co/3MSMXK2KWo","date":"Fri Apr 22 16:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats @GM! Great way to celebrate Earth Day! One step closer to an all-electric future where we don’t have to worry about price gouging at the pump! https://t.co/N7vYHEWT9W","date":"Fri Apr 22 14:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This #EarthDay, it’s never been more important to take action to protect our way of life for our children and grandchildren. Let’s keep Michigan in the driver seat of our clean energy future and protect our beautiful Great Lakes and waterways!","date":"Fri Apr 22 13:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Still ecstatic about the history @POTUS and @SenateDems have made. Ketanji Brown Jackson is our next U.S. Supreme Court Justice!","date":"Thu Apr 21 19:28:42 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan knows all too well the dangers of lead pipes. Thanks to the Infrastructure Investment and Jobs Act, we will replace lead pipes while creating good-paying American jobs.","date":"Thu Apr 21 15:37:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS’ budget lowers costs for Americans. The Republican plan raises taxes and ends Medicare, Medicaid, Social Security, and VA health care services.\n\nIt’s clear who is putting people first.\nhttps://t.co/iu7e9DI6CO","date":"Thu Apr 21 13:05:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I couldn’t agree more!","date":"Wed Apr 20 17:59:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: the Republican Tax Plan would raise taxes for millions of Americans.","date":"Wed Apr 20 12:54:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"For too long, health care above the neck has been treated differently than health care below the neck. @POTUS knows this needs to change. That’s why his budget invests in proven solutions I created to ensure Americans can get the behavioral health care they need.","date":"Tue Apr 19 19:29:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you @MiningJournal for those kind words.\nhttps://t.co/B1kRjswaSm","date":"Tue Apr 19 16:16:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As usual, @MitchAlbom and @saydetroit are creatively helping young people learn and grow. As a music lover, this sounds perfect! Thanks @DetroitPistons for being a great partner!\nhttps://t.co/UO3L1psYTe","date":"Tue Apr 19 14:47:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"When President Biden took office, over 18 million Americans were receiving unemployment benefits. Today that’s down by more than 90%. Thanks to @POTUS and @SenateDems, America is getting back to work.","date":"Tue Apr 19 12:59:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"To build a better America, we need to make things in America. @POTUS’ budget builds on the Infrastructure Investment and Jobs Act’s historic investment to create more good-paying American manufacturing jobs.","date":"Mon Apr 18 18:10:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s time to cap the price of insulin at $35 a month. Retweet if you agree.","date":"Mon Apr 18 13:04:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Equal opportunity is the bedrock of our democracy. Thanks to @POTUS we are creating a more equal and just federal government.","date":"Sun Apr 17 23:48:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Easter! Wishing everyone a blessed and joyous day. https://t.co/d2D0q4J6cN","date":"Sun Apr 17 14:23:56 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our national parks are some of our nation’s greatest treasures. This week, you can get into all of them for free! Click here to find a park to explore during #NationalParkWeek: https://t.co/NG7zAKJIwD","date":"Sat Apr 16 17:38:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS, American drivers will be able to save money at the pump.","date":"Sat Apr 16 13:22:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Chag Sameach to everyone celebrating #Passover in Michigan and around the world! https://t.co/f0cHGqR0Ng","date":"Fri Apr 15 21:29:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Statement on the shooting of Patrick Lyoya: https://t.co/qnOTFbwtjU","date":"Fri Apr 15 17:43:28 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree. Our families need us to cap the price of insulin.","date":"Fri Apr 15 13:09:28 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Vaisakhi! Wishing our Sikh friends and neighbors a festival full of love and joy.","date":"Thu Apr 14 18:15:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Child Tax Credit has already provided economic relief to so many Michigan families. Make sure to file your taxes this year to receive these benefits.","date":"Thu Apr 14 15:38:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Education is an investment in our nation’s future. @POTUS and @SenateDems are providing more help for low-income students and making it easier for students to afford college.\n \nThe Republican plan? Shut down the Department of Education.","date":"Thu Apr 14 13:07:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"President Biden made a massive push for COVID-19 vaccination and testing. The pandemic’s not over, but Americans have more tools than ever before to keep themselves and their loved ones safe.","date":"Wed Apr 13 22:06:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our resolution affirms Congress’ support for these families and commitment to research to find more effective treatments, better care and ultimately, a cure.","date":"Wed Apr 13 18:10:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many families, caregivers, and friends have experienced the impact of Parkinson’s disease.\n \nThat's why I introduced a bipartisan resolution with @SenJohnThune recognizing April as Parkinson's Awareness Month.","date":"Wed Apr 13 18:10:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Increasing home-grown cleaner fuel from farmers right here in America will help lower costs at the pump for everyone.\nhttps://t.co/GEkj4NV7hb","date":"Wed Apr 13 16:01:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS’ budget lowers costs for families and makes billionaires pay their fair share. The Republican plan raises taxes on over half of all Americans.\n \nIt’s clear who is focused on lowering costs for Americans.\n\nhttps://t.co/jNS4u2zhIr","date":"Wed Apr 13 14:44:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Kudos to Mayor Duggan for honoring these creative giants! And, thank you to each honoree for all you have given to Detroit and our state.\n\nhttps://t.co/YLSRYOklMz","date":"Wed Apr 13 13:02:22 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So many of our seniors rely on Social Security, Medicare, and Medicaid benefits. @POTUS’ budget strengthens these critical programs while the Republican plan ends all these federal laws in five years.","date":"Wed Apr 13 00:16:39 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I've been passionate about creating health care parity between mental health &amp; physical health care my entire career. I'm heartened by the progress we’ve made to get people the help they need. Thank you @namiofmi &amp; @NewOakland for this incredible honor.\nhttps://t.co/fUn15PVGHj","date":"Tue Apr 12 14:46:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Free COVID-19 tests are available to people on Medicare. Learn more about this program and how to get your free tests here ⬇️\n\nhttps://t.co/3OwlX5dIQo","date":"Tue Apr 12 13:07:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The price of insulin should be capped at $35 a month.","date":"Mon Apr 11 13:05:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If you want to know @POTUS’ values, just look at his budget. It includes historic investments to transform behavioral health care, make more things in America, and protect our Great Lakes.","date":"Sun Apr 10 15:18:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Debbies had a friendly bet: winner of the last @MSU_Basketball &amp; @umichbball game got a taste of Michigan. Today, I’m giving @RepDebDingell two pints of @dairystoreMSU ice cream. Enjoy Izzo’s Malted Madness and Spartan Swirl 🍨😀 https://t.co/Muwesqk9IW","date":"Sat Apr 09 21:36:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan’s World War II veterans sacrificed so much to serve our country and defend democracy. This memorial is a wonderful way to honor them.\nhttps://t.co/qMUtbupTyO","date":"Sat Apr 09 14:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This was a historic week for America:\n- The Senate confirmed Judge Ketanji Brown Jackson to the U.S. Supreme Court\n- Fewer Americans filed initial claims for unemployment insurance than at any time in our nation’s recorded history https://t.co/xKytrJZl6w","date":"Fri Apr 08 21:27:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we close out National Public Health Week I want to thank our public health workers. They have gone above and beyond to keep us safe and healthy during this pandemic. #NPHW","date":"Fri Apr 08 18:35:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@tigers Opening Day is finally here! Who is excited about baseball season? I know I am.","date":"Fri Apr 08 17:23:20 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Honored to receive the Visionary Award from @aao_ophth! Thank you for your great work and advocacy.","date":"Fri Apr 08 13:37:41 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From historic investments in behavioral health services to making more things in America, @POTUS’ budget puts American families and workers first.","date":"Thu Apr 07 22:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Let‘s go @umichhockey! Congrats on your record 26th Frozen Four game! #GoBlue","date":"Thu Apr 07 20:49:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"U.S. Supreme Court Justice Ketanji Brown Jackson! https://t.co/q8hISxzM7h","date":"Thu Apr 07 18:33:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson’s appointment is long overdue. Now Black girls across Michigan will see greater possibilities in their future – a true history-making moment.\nhttps://t.co/OoYztsBFDz","date":"Thu Apr 07 18:24:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s clear oil companies are taking advantage of consumers while making record profits. It’s time we hold them accountable and provide relief for Americans at the pump.","date":"Thu Apr 07 15:25:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What a wonderful and historic time to be an American. Judge Jackson’s confirmation to the Supreme Court will forever be an important part of history.","date":"Thu Apr 07 13:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today is a big day – @POTUS signed my friend @SenGaryPeters’ bill to protect the future of the Post Office. Michiganders use the mail to receive their prescriptions, keep in touch with their loved ones, and run their small business. \n\nWhat does the postal service mean to you?","date":"Wed Apr 06 20:56:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"When I first saw @POTUS’ budget, I jumped for joy over the historic funding to expand Community Behavioral Health Clinics and other critical mental health services. Step by step we are treating behavioral health care the same as physical health care. https://t.co/r01AraLRiG","date":"Wed Apr 06 18:39:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s about time we have a Supreme Court that looks like America. https://t.co/ROAfrFQnSD","date":"Wed Apr 06 15:57:48 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems inherited a mess, and yet we have been able to create record job growth and get Americans back to their normal lives. The bottom line is Democrats are delivering everyday! https://t.co/1FQTJnJACq","date":"Wed Apr 06 13:15:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree. Let’s make history!","date":"Tue Apr 05 22:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS' budget will transform mental health and addiction services in America by:\n- Increasing coverage   \n- Reducing costs   \n- Strengthening the behavioral health workforce\n- Expanding high-quality community services nationwide","date":"Tue Apr 05 19:42:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Just one of the many ways that @POTUS is putting Americans first.","date":"Tue Apr 05 18:43:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As the senior Republican in our Michigan delegation, @RepFredUpton has been a strong partner in working together on important issues for our state. I wish him the best as he retires – enjoy those grandkids, Fred!","date":"Tue Apr 05 17:22:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Big congratulations, Warren! What a wonderful honor for someone who's given so much to Wayne County.  https://t.co/JOr8LvOgNt","date":"Tue Apr 05 15:04:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I've said it for years: we've got to bring our jobs home &amp; make things here in America to fix our supply chains.\n \nMy Make It in America Act that passed earlier this year does just that. And @POTUS' budget builds on this.\n \nThis is great for our manufacturers and America!","date":"Tue Apr 05 12:39:22 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"At the beginning of this year, I led a group of Senators in urging the Biden Administration to require Medicare cover these COVID-19 tests. Appreciate @SecBecerra listening to our call and making this happen.\nhttps://t.co/s7YMhDYYhz","date":"Mon Apr 04 21:41:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news! People on Medicare can receive free COVID-19 tests starting today. Under the new initiative, you can receive up to eight home tests a month at no cost.\nhttps://t.co/2BlmOfx0OC","date":"Mon Apr 04 21:41:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is a historic week for our country. \n \nJudge Jackson will make an extraordinary Supreme Court Justice, and I can't wait to confirm her.","date":"Mon Apr 04 13:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's commonsense. Teachers shouldn't pay more in taxes than billionaires. @POTUS' budget makes billionaires pay their fair share.","date":"Sun Apr 03 18:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Great Lakes are part of our Michigan way of life, and @POTUS understands that. That's why his budget funds the Great Lakes Restoration Initiative to protect our lakes for generations to come!","date":"Sun Apr 03 14:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I look forward to voting to confirm Judge Jackson. Let’s make history!","date":"Sat Apr 02 19:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"- Schools will not be able to make substitutions if basic food items like apples and carrots are not available and will be penalized for supply chain issues.\n\n- Schools will spend their time bogged down in paperwork amid rising costs.","date":"Sat Apr 02 15:54:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Without flexibilities:\n- Our schools would have to make impossible choices and kids will miss out on meals.\n\n- Meal providers will have to scale back or close completely, making it harder to feed kids over the summer.","date":"Sat Apr 02 15:54:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"My bill will keep kids fed, keep school/summer meal programs open, and cut the red tape.","date":"Sat Apr 02 15:54:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Ramadan Mubarak, Michigan. Wishing you and your family a blessed holy month. https://t.co/4N5RtaB4xl","date":"Fri Apr 01 22:19:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS' budget puts Americans first.\n \nMeanwhile, the Republican plan raises taxes and ends Medicare &amp; Social Security. It's shocking.\n \nMy new reports lays this out: https://t.co/jNS4u2zhIr","date":"Fri Apr 01 20:39:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From creating 431,000 jobs in March to releasing a budget that lowers costs for Americans, reduces our deficit and helps create even more jobs, @POTUS is putting Americans first! https://t.co/kefWAQM3To","date":"Fri Apr 01 17:50:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers are the best in the world. This move from @POTUS keeps up our effort to make great vehicles in America while creating jobs and fighting the climate crisis.\n \nWhat a win-win-win for Michigan.\nhttps://t.co/7Lwvdj2UcW","date":"Fri Apr 01 17:00:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"BIG NEWS! The House just capped the out-of-pocket cost of insulin at $35 per month. Let's get this done!","date":"Fri Apr 01 15:32:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Jobs, jobs, jobs! 431,000 jobs were created in March. This is great news!\nhttps://t.co/ZC2Vdh30Cg","date":"Fri Apr 01 13:21:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"When our goods are stuck in our ports, that hurts Michigan farmers, businesses, and workers. The Senate just passed a bill to crack down on unfair shipping practices, which will lower costs for the American people. https://t.co/NlpLh6CKt6","date":"Fri Apr 01 01:33:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our schools need flexibility—not red tape—so they can keep feeding our children during the school year and into the summer months. Let’s do the right thing and put our children first!\nhttps://t.co/cAKyBc42ql","date":"Thu Mar 31 20:47:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We should make it easier for kids to get the meals they need. My bipartisan bill will cut red tape and keep kids fed throughout the year. https://t.co/HrxcPsOeZx","date":"Thu Mar 31 19:22:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree! It’s time we give Michigan manufacturers and workers the tools they need to make more semiconductor chips at home.","date":"Thu Mar 31 16:24:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Oil companies are making record profits. The Big Oil Windfall Profits Tax will stop this abuse by oil companies and provide Americans some help at the pump.","date":"Thu Mar 31 14:36:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news for the nearly 184,000 students in Michigan receiving Pell Grants! @POTUS’ budget makes a historic investment to expand the program and help students pay for college.","date":"Thu Mar 31 13:44:41 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's clear: @POTUS' budget puts Americans first while the Republican plan raises their taxes and shockingly, ends Medicare, Social Security, Medicaid and the VA. https://t.co/DDjosl3FIO","date":"Wed Mar 30 21:02:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Building a better America means making more things in America. @POTUS’ budget invests in American manufacturing, electric vehicles, and registered apprenticeship programs. This is a win-win for Michigan workers and businesses.","date":"Wed Mar 30 13:14:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks @POTUS for understanding we need to make things in America for America to be strong! https://t.co/NBxhZvPaem","date":"Tue Mar 29 23:52:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Throughout our history, Congress has tried more than 200 times to pass legislation making lynching a federal crime. Passing the Emmett Till Anti-Lynching Act was long overdue, and @POTUS’ signature today sends a strong message that hate and violence have no place in America.","date":"Tue Mar 29 20:49:56 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Billionaires should not pay lower tax rates than teachers and firefighters. @POTUS’ budget will make them pay their fair share.","date":"Tue Mar 29 17:04:42 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree! Thank you @chefjoseandres for all your incredible work.","date":"Tue Mar 29 15:18:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS’ budget includes a nationwide expansion of my transformational mental health and addiction initiative. We are one step closer to ensuring all Americans have what they need to take care of their mental health.","date":"Tue Mar 29 13:04:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"President Biden continues to deliver for our Great Lakes and Michigan’s way of life. His budget continues our investment in the Great Lakes Restoration Initiative. This will keep our Great Lakes healthy for generations to come!","date":"Tue Mar 29 01:12:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited to cheer on Michigan’s women tonight. Let’s go @umichwbball! #EliteEight #GoBlue","date":"Tue Mar 29 00:21:59 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From funding transformational mental health and addiction services to protecting our Great Lakes, @POTUS’ budget has Michigan on every page! https://t.co/jbOV3niGBT","date":"Mon Mar 28 23:28:39 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today’s a historic day! Thanks to @POTUS, for the first time, the federal budget is prioritizing mental health and addiction services in a way that’s never been done before. https://t.co/iqY2jczSBL","date":"Mon Mar 28 21:34:50 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From fixing our crumbling roads and bridges, to removing lead pipes, to providing access to high speed internet, the infrastructure bill we passed has helped so many Michigan communities.","date":"Mon Mar 28 16:47:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Retweet if you think insulin should be capped at $35 a month.","date":"Mon Mar 28 12:59:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, @umichhockey! Frozen Four 🏒","date":"Mon Mar 28 01:12:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We cannot rely on products made halfway around the world. That’s why I am laser focused on fixing our broken supply chains and bringing good-paying jobs home to America.","date":"Sun Mar 27 16:08:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Yeah, @umichwbball! On to your first-ever Elite 8! #GoBlue!","date":"Sun Mar 27 00:56:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Who is excited to watch @umichwbball in their Sweet 16 matchup today? I know I am!","date":"Sat Mar 26 21:28:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Cora Reynolds Anderson paved the way for so many Michigan women, including me, to hold public office. Naming this post office in the county she represented after her is one special way we can honor and remember her. https://t.co/xnfM6Vz9D2","date":"Sat Mar 26 12:59:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This week with @POTUS:\n• On ACA’s anniversary, premiums at all-time low, enrollment at-all time high\n• Lowest jobless claims since 1969\n• Over $1 billion in funding for humanitarian assistance to Ukraine https://t.co/QXzJv3zZQj","date":"Fri Mar 25 21:33:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We all know it—prescription drugs cost way too much. The good news is that Congress also has the ability to do something about it!\n\nWe should cap the price of insulin to $35 per month and allow Medicare to negotiate lower prices.","date":"Fri Mar 25 20:18:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So many Michigan sports today! Excited to watch #1 seed @umichhockey kickoff their playoff run! #GoBlue","date":"Fri Mar 25 18:28:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Infrastructure Investment and Jobs Act laid a great foundation for the U.S. to remain a global clean energy leader. We need to build on it! Our ability to compete with the world depends on it.","date":"Fri Mar 25 16:40:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wishing @WMUHockey good luck in their playoff game today!","date":"Fri Mar 25 15:05:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I know MI families are impacted by the rising gas prices. Oil companies need to stop withholding production just so they can raise prices &amp; pad the pockets of their shareholders. In Congress, I’m working to pass the Gas Prices Relief Act to give drivers a bit of help at the pump.","date":"Fri Mar 25 14:35:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson’s character has shown through during this week’s @JudiciaryDems hearings. In the face of Republicans’ baseless attacks, she has remained strong and continued to prove her top-notch qualifications.","date":"Fri Mar 25 13:09:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited to watch @umichbball continue their March Madness run tonight! #GoBlue","date":"Thu Mar 24 23:15:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson’s impeccable record proves that she will join our nation’s highest court as a fair and impartial member. She will make an exceptional Supreme Court Justice.","date":"Thu Mar 24 21:28:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Lowest jobless claims since 1969! Step by step we are building a better America.\nhttps://t.co/Gf85Q7gTFA","date":"Thu Mar 24 19:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck, @mtuhky!","date":"Thu Mar 24 18:22:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Everyone deserves access to quality, affordable behavioral health care in their community. That’s what the Certified Community Behavioral Health Clinic movement is all about. https://t.co/9GFZhWOMsW","date":"Thu Mar 24 16:14:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Here are the facts—the top 25 oil and gas companies raked in $205 billion last year. Oil companies are price gouging Michigan drivers at the pump! https://t.co/lDKuIGD8BS","date":"Wed Mar 23 16:39:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"@SenateDems have a plan to do just that. Our plan will:  \n• Cap the price of insulin at $35 per month\n• Allow Medicare to negotiate lower prices\n• Establish a $2,000 out-of-pocket cap for seniors","date":"Thu Mar 24 14:07:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Outrageous and unjustified price gouging has left too many Michigan seniors unable to afford life-saving prescription drugs.\n\nToday, I joined @SenGaryPeters and @AARPMichigan to discuss the need to lower prescription drug costs.","date":"Thu Mar 24 14:07:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems' economic plan is working. This past year we have created 6.7 million jobs and unemployment is down to 3.8%!","date":"Thu Mar 24 12:54:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"One of the most egregious examples of drug companies unfairly price-gouging Americans is insulin. Americans pay on average 800% more for insulin than other countries.\n \nWe should cap out-of-pocket costs for insulin at $35 per month.","date":"Wed Mar 23 21:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Refugee. Teacher. Trailblazer. Diplomat. Role model. Leader. There are so many ways Madeleine Albright impacted our nation and our world.\n \nWhat a profound loss. It was an honor to know and work with her. My heart is with the Albright family during this time.","date":"Wed Mar 23 19:35:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I continue to be impressed by how gracefully Judge Jackson responds to Republicans’ unwarranted attacks on her impeccable record. She is exactly what we need in a Supreme Court Justice.","date":"Wed Mar 23 19:18:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thrilled to speak to the first meeting of USDA’s new Urban Ag Advisory Committee today! This important committee enables @USDA to provide more support for urban and community farmers in Michigan and across the country.","date":"Wed Mar 23 17:47:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Here are the facts—the top 25 oil and gas companies raked in $205 billion last year. Oil companies are price gouging Michigan drivers at the pump! https://t.co/lDKuIGD8BS","date":"Wed Mar 23 16:39:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today marks 12 years of the Affordable Care Act!\n \nThis life-changing law has cut the number of Michiganders without health insurance in half!\n \nIt's also helped millions of people in Michigan with pre-existing conditions gain protection.","date":"Wed Mar 23 12:44:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The ACA has also helped millions become eligible for preventative services like flu shots, cancer screenings, and wellness visits with no out-of-pocket costs.\n \nThe ACA has transformed the lives of millions in Michigan!","date":"Wed Mar 23 12:44:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No American should have to decide between paying for rent or prescription drugs. Democrats have a plan to lower out-of-pockets costs and hold drug companies accountable.","date":"Tue Mar 22 19:36:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson is brilliant legal mind and is committed to ensuring the Constitution works for all Americans, not just the wealthy and powerful. That is exactly what she will prove during this week’s @JudiciaryDems hearings.","date":"Tue Mar 22 16:35:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Residents in our rural towns are resilient even when health care services or affordable child care are a little bit more out of reach. Our hearing today will focus on policies we are working on to make a doctors’ visit, using the internet, or getting to work easier for everyone.","date":"Tue Mar 22 13:17:59 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our friends living in rural towns in MI face different challenges than those in our cities. I know my family did when we lived in Clare. \n\nI’m leading a hearing for these MI residents. Tune in to learn a bit more about what the @SenateAgDems are doing: https://t.co/A0KG41U9sT","date":"Tue Mar 22 13:17:59 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I had a great time with @aemadvisor and @JohnBoozman today, celebrating the leadership of American agriculture and the innovative technologies that will help our farmers be even more effective and productive. https://t.co/jPIc4NbWGP","date":"Tue Mar 22 01:09:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Sweet 16! Keep the run going, @umichwbball!","date":"Tue Mar 22 00:00:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson is an outstanding Supreme Court nominee, and I know she will stand up for the rights of all Americans. I look forward to supporting her nomination. https://t.co/fuSIWB92z0","date":"Mon Mar 21 16:57:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy National Agriculture Week! I’m so fortunate to serve as Chairwoman of @SenateAgDems and support our farmers, foresters, and rural communities around the country who make the food and products we need.","date":"Mon Mar 21 13:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It was an honor to join with families, friends and supporters of Ukraine today at our State Capitol. Putin’s war is evil and must be stopped. I will continue to support every American effort to do so. https://t.co/OZ8SMpWxiY","date":"Sun Mar 20 21:31:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we continue to support Ukraine's government and its people in defending their democracy, we must close any loopholes that Russia might exploit to evade U.S. sanctions. This bill ensures that Russian nationals will not use digital assets to undermine sanctions.","date":"Sun Mar 20 15:49:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, @umichbball! Fifth straight Sweet 16!","date":"Sun Mar 20 00:06:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck, @umichwbball! I know you will make Michigan proud! #GoBlue","date":"Sat Mar 19 18:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We have no time to waste when it comes to tackling the climate crisis. I know American workers will lead us into the clean energy future as we make more things here at home. https://t.co/ukj9RDtU0f","date":"Sat Mar 19 17:15:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our farmers and foresters play a significant role in tackling the climate crisis through land and water conservation. With our support, they can do even more!  Great to talk to @punchbowlnews about the urgency of the climate crisis. https://t.co/sBFCh37oTy","date":"Sat Mar 19 13:55:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited to watch @MSU_Basketball kick off their #MarchMadness run! #GoGreen","date":"Sat Mar 19 00:08:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to Community Mental Health Authority of Clinton, Eaton, &amp; Ingham Counties CEO Sara Lurie, @CMHAMich CEO Bob Sheehan, and Ingham County Sheriff Scott Wrigglesworth for your leadership and for joining me today.","date":"Fri Mar 18 23:17:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is just one of 9 MI behavioral health projects I was able to get funded in the new federal budget. From Marquette, to Traverse City, to Battle Creek, to Detroit, this funding will make sure people have access to the mental health and addiction services they need.","date":"Fri Mar 18 23:17:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I am excited to announce new funding for the Community Mental Health Authority of Clinton, Eaton, &amp; Ingham Counties to create a critically needed Crisis Stabilization Unit. More people will have immediate help during a crisis instead of being taken to jail or the E.R. https://t.co/eJf7tELIwB","date":"Fri Mar 18 23:17:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to join @MillerMCPW, St. Clair County Commission Chair Jeff Bohm, @glwatermi Interim CEO Suzanne Coffey, @cityofpontiac Mayor Tim Greimel, @OakGov Commissioner Angela Powell &amp; @OakGov Deputy Water Resources Commissioner Anne Vaara to make this big announcement!","date":"Fri Mar 18 22:03:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our new federal budget is bringing over $10 million in funding to Southeast MI to improve our water quality!\n \nCommunities are working together to upgrade our water and sewer systems to stop basements and roads from flooding, keep our beaches open, and protect our drinking water. https://t.co/zSlin6pWIM","date":"Fri Mar 18 22:03:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From reauthorizing the Violence Against Women Act to providing additional security assistance for Ukraine, @POTUS is taking action to ensure we are protecting families at home and abroad. https://t.co/aBdhmOOfFP","date":"Fri Mar 18 18:25:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We keep hearing the same old excuses for why Americans have to pay the highest prices in the world for prescription drugs. Democrats have a plan to end outrageous price gouging.","date":"Fri Mar 18 17:04:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson is extremely qualified and has a long history of standing up for justice, democracy, and equal rights for all Americans. She is exactly what our country needs right now.","date":"Fri Mar 18 00:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Republicans and Democrats have already supported Judge Ketanji Brown Jackson for past judicial positions. Her qualifications, character, and integrity are clear.","date":"Thu Mar 17 21:45:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today I met with Judge Ketanji Brown Jackson. What an honor. Her extensive background and experience in public service make her extremely qualified to serve. \n \nJudge Jackson will make an excellent Supreme Court Justice. https://t.co/woGhYy7AJV","date":"Thu Mar 17 20:04:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It doesn’t matter what happens in the rest of these games. I already know the winner. #GoGreen https://t.co/AxIQqXzgNk","date":"Thu Mar 17 18:59:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wishing @umichbball good luck in their #MarchMadness opening game today! #GoBlue","date":"Thu Mar 17 15:58:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Celebrate St. Patrick’s day with Made in Michigan brew!\n\nhttps://t.co/DL5DH5f3wN","date":"Thu Mar 17 15:29:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"To the Michigan Ukrainian community: I am with you. I will do everything possible to help you and your families in Ukraine.","date":"Thu Mar 17 13:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s outrageous that the same drug that treats MS costs $100,000 more today than it did 30 years ago. https://t.co/EIiwEq28jD","date":"Thu Mar 17 00:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The price of drugs has risen 300% over the past 15 years. We wouldn’t accept price hikes like those in other areas of our life! \n \nOur plan will hold drug companies accountable, negotiate lower prices, and cap out-of-pocket costs for seniors. https://t.co/bx72WKkNIy","date":"Wed Mar 16 22:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Healthcare is healthcare, whether it is above the neck or below the neck. I’ll continue to make sure our children have the support they need.","date":"Wed Mar 16 20:31:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you to all the educators and mental health professionals in Michigan who are stepping up to support students and their mental health! \nhttps://t.co/zjGtJjpWbu","date":"Wed Mar 16 20:31:22 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"All we hear from drug companies is excuses for why we have to pay 3x more for our prescription drugs than any other country. \n \nThis price gouging is absurd and we have a plan to do something about it! https://t.co/25GXdPMUtM","date":"Wed Mar 16 17:56:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Tune in!","date":"Wed Mar 16 17:47:43 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s outrageous: Americans pay about three times more for their prescription drugs than other countries! This has to change.","date":"Wed Mar 16 16:27:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"President Zelensky has displayed incredible bravery and resilience throughout Putin’s unprovoked and relentless assault. The U.S. Congress stands with the people of Ukraine. https://t.co/SDNq06clPp","date":"Wed Mar 16 15:29:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"And it includes continuing to hit Putin and his oligarchs where they feel it most – in their bank accounts. The people of Ukraine are standing strong – and Americans are with them in prayer and in action.","date":"Wed Mar 16 14:00:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"@POTUS &amp; Congress must continue to do everything we can to help them defend their people &amp; democracy. That includes the billions in essential aid passed in the budget for military assistance to strengthen Ukraine’s air defense capabilities and critical humanitarian assistance.","date":"Wed Mar 16 14:00:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"President Zelensky just spoke to a joint session of Congress. I continue to be deeply moved by his astonishing courage and determination as well as that of the Ukrainian people in the face of an unprovoked, brutal, and relentless assault on their country.","date":"Wed Mar 16 14:00:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From protecting our Great Lakes and water, to providing critical mental health and addiction services, to lowering costs for families, to addressing the workforce needs of our employers, this federal budget has Michigan on every page!","date":"Tue Mar 15 18:52:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Women contribute so much to our workforce, families, and communities. It’s past time women get equal pay for equal work. I’m dedicated to closing the gender wage gap and ensuring all Americans have fair and equal opportunities! #EqualPayDay","date":"Tue Mar 15 16:59:22 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There are nearly 184,000 students in Michigan receiving Pell Grants. The budget bill increases Pell Grants by $400 to $6,895 to lower the cost of college for students in Michigan.\n\nThis is the largest increase in the maximum award in more than a decade! https://t.co/70PGyJn1Bn","date":"Mon Mar 14 19:14:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Something to look for in this budget bill—more funding for mental health and addiction services for people in Michigan.\n\nHealth care is health care – whether it is above the neck or below the neck. I’ll continue to make sure it’s funded that way. https://t.co/70PGyJn1Bn","date":"Sun Mar 13 20:30:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations! Well deserved!! https://t.co/gNBa9UADIe","date":"Sun Mar 13 15:33:31 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Protecting our Great Lakes is always at the top of my priority list in Congress.\n \nThis budget bill increases our investment in the Great Lakes Restoration Initiative so we can continue to protect our Michigan way of life. https://t.co/70PGyJn1Bn","date":"Sat Mar 12 18:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Violence Against Women Act has been a lifeline for many women in Michigan. Congress just reauthorized this law, which will continue to protect people from domestic violence and provide critical violence prevention and response resources. #VAWA","date":"Sat Mar 12 15:52:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we continue to witness Putin’s brutal and unprovoked assault on the Ukrainian people, Congress just passed essential aid to Ukraine to help them fight for their freedom. We will continue to stand united with the people of Ukraine.","date":"Sat Mar 12 00:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems are taking bold action to build a better America! https://t.co/5b1mG9GjOk","date":"Fri Mar 11 23:10:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s been one year since the American Rescue Plan became law. Thanks to this historic action, we have been able to get our kids safely back in school, support our small businesses and workers, and get more vaccines in people’s arms to save lives. https://t.co/VkAnZwbuoe","date":"Fri Mar 11 17:40:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No person struggling with mental health issues or addiction should go without treatment because an insurance company won’t cover it. Our bill would make sure workers get comprehensive coverage of mental health &amp; addiction care and other critical services.\nhttps://t.co/cLVo8t5c9U","date":"Fri Mar 11 15:33:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I couldn’t agree more!","date":"Fri Mar 11 13:47:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This budget will continue to fuel Michigan’s economic recovery and help communities in every region of our state. https://t.co/70PGyJn1Bn","date":"Fri Mar 11 03:49:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From protecting our Great Lakes and water, to providing critical mental health and addiction services, to lowering costs for families, to addressing the workforce needs of our employers, this bill makes significant investments in our future.","date":"Fri Mar 11 03:49:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Right now, 90% of schools across our country are relying on child nutrition waivers to feed their students. We must extend these waivers so our children have the nutrition they need to learn. https://t.co/BGJzXyNoIh","date":"Fri Mar 11 02:14:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Agree!","date":"Thu Mar 10 21:15:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I just finished meeting with ambassadors from Europe. There is 100% unity and commitment to stop Putin’s brutal war against the brave people of Ukraine. This is a very dangerous time and all of our efforts are needed together. https://t.co/0EZ9kmH6DF","date":"Thu Mar 10 19:25:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This pandemic has taught us that we cannot rely on semiconductor chips made halfway around the world. We must pass legislation ASAP to boost domestic semiconductor chip manufacturing. https://t.co/PfSRL2a7Em","date":"Thu Mar 10 15:50:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"No family should have to wonder if they can afford life-saving prescription drugs or food. @POTUS and @SenateDems are laser-focused on lowering high costs that keep Americans up at night.","date":"Wed Mar 09 18:50:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @terrelljstarr, for your critical work.\nhttps://t.co/HfNcYQYPZG","date":"Wed Mar 09 15:36:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This #InternationalWomensDay, I am inspired by the brave women of Ukraine standing up and fighting for their freedom and loved ones. https://t.co/PPYrAwJrou","date":"Wed Mar 09 00:32:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our families, businesses, and communities depend on our postal service. The bipartisan Postal Service Reform Act will ensure @USPS can continue to deliver mail to every corner of our country.","date":"Tue Mar 08 23:57:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Important news! The Senate passed the bipartisan Postal Service Reform Act to protect the future of the Post Office. Millions of Americans rely on the @USPS. Thank you to my partner @SenGaryPeters for leading this reform.","date":"Tue Mar 08 23:25:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy #InternationalWomensDay! I continue to be inspired by women around the world working to make a better future for all. #IWD2022","date":"Tue Mar 08 21:29:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Putin and his oligarchs make billions every year from Russian energy exports. Shutting down imports of Russian energy is the type of bold action we need to punish Putin. I support this strong move by @POTUS.","date":"Tue Mar 08 18:02:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This #WomensHistoryMonth, I’m thinking of all the exceptional women who stepped up during this pandemic. You juggled work, child care, school, and so much more. Our families, communities, and country are stronger today because of you!","date":"Mon Mar 07 22:01:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we mark the 57th anniversary of #BloodySunday, we must protect our freedom to vote. It’s time for the Senate to honor the brave souls who marched on the Edmund Pettus Bridge by passing the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.","date":"Mon Mar 07 19:39:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"March is Michigan Food and Agriculture Month! \n \nMichigan farmers and foresters: thank you for providing us with the food and products we need every day. #MIAgMonth","date":"Sun Mar 06 15:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Step by step, @POTUS is building back better! https://t.co/EctlU5u7Yi","date":"Sat Mar 05 22:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I was honored to be on a zoom call with President Zelensky and my colleagues today. It is so inspiring to see his personal courage and the courage of the Ukrainian people. We are united in our efforts to do everything we can to support their fight for freedom and democracy.","date":"Sat Mar 05 19:56:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Since @POTUS took office, the economy has added 7.4 million jobs. Together we are building a better America!","date":"Fri Mar 04 15:34:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news today: jobs are ⬆️ and unemployment is ⬇️\n\n678,000 jobs in February is a really big deal!\nhttps://t.co/X9jD2rd2Ml","date":"Fri Mar 04 15:34:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The unemployment rate fell to a new pandemic low of 3.8 percent last month! We are returning to where we were before the pandemic and building on that.\n \nStep by step, our economy is recovering.","date":"Fri Mar 04 15:34:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"My mental health and addiction services initiative has been the most significant step forward we have taken in decades to transform how we deliver behavioral health services in our community. Glad @POTUS is committing to making this permanent.\n \nhttps://t.co/hinYfIxcxg","date":"Thu Mar 03 21:20:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Two words: Electric @Jeep! Thanks, @Stellantis, for committing to tackle the climate crisis with new electric vehicles.","date":"Thu Mar 03 19:50:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news!!","date":"Thu Mar 03 15:40:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I can’t think of a better nominee for the Sixth Circuit Court than Judge Stephanie Davis! Judge Davis has spent her entire career serving the people of Michigan and I know she will continue her excellent work on the Sixth Circuit Court. https://t.co/DtrypzgCtx","date":"Thu Mar 03 00:56:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS' economic plan has Michigan on every page! https://t.co/BVdFLTyEI4","date":"Wed Mar 02 20:44:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What a way to start #WomensHistoryMonth! @SenateAgDems is considering four extremely qualified women from both sides of the aisle to be CFTC Commissioners. It's so important that our leaders bring different backgrounds and experiences. https://t.co/96D2oinxfs","date":"Wed Mar 02 18:27:11 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great speech from @POTUS tonight. Together we are building a better America! https://t.co/gF39vC85wu","date":"Wed Mar 02 04:45:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"My statement on @POTUS’ State of the Union address: https://t.co/SrKG1JcPSj","date":"Wed Mar 02 03:59:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We know that the pandemic has taken a toll on the mental health of Michiganders.\n \nCommunity behavioral health clinics that I created are getting people help they need in their communities.\n \nThanks, @POTUS, for making sure these clinics are in every corner of our country.","date":"Wed Mar 02 03:03:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Americans are sick and tired of corrupt special interests threatening our democracy.\n \nLet’s pass the DISCLOSE Act to get dark money out of our elections and put the power back in the hands of the American people.","date":"Wed Mar 02 02:55:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"When @POTUS took office, only 46% of America’s public schools were open. Today 98% of our schools are safely open. This was made possible by our American Rescue Plan. #SOTU","date":"Wed Mar 02 02:49:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So many folks are feeling squeezed by higher costs on everything from gas to groceries to prescription drugs. @POTUS and @SenateDems have plans to take on price gouging and lower these costs that are keeping people up at night. #SOTU","date":"Wed Mar 02 02:41:19 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The cost of insulin is outrageous. No one should have to choose between paying their rent or paying for insulin.\n \nIt’s time to cap the price of insulin at $35 per month!","date":"Wed Mar 02 02:35:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS understands we need to make things in America.\n \nIt’s no surprise over 369,000 manufacturing jobs have been created since he took office.","date":"Wed Mar 02 02:30:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There's no doubt that MI workers &amp; businesses are the best in the world. \n \nThat's why I worked with @POTUS to include my Make It in America Act in the Infrastructure Investment and Jobs Act!\n \nThis makes sure our tax dollars are spent on American products &amp; American jobs. #SOTU","date":"Wed Mar 02 02:26:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The bravery of the Ukrainian people has inspired the world. Thanks to @POTUS’ strong leadership, America is rallying the world to stand up for democracy and denounce Russia’s unprovoked aggression. #SOTU","date":"Wed Mar 02 02:13:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is awesome. Great to see Michigan represented!","date":"Tue Mar 01 22:46:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our arts venues &amp; theaters are critical to our local communities with many of them serving as the anchor for downtown renewal. The American Rescue Plan helped them keep the lights on and workers on the payroll during the pandemic. This is a real success story during a tough time.","date":"Tue Mar 01 13:18:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Scott Hammontree, President of the Michigan Independent Venue and Promoter Association, worked with me to secure funding to help 288 hard-hit arts venues and theaters in Michigan survive during the pandemic. \n \nThat's why I'm proud to bring Scott as my guest to this year's #SOTU. https://t.co/yDwoEBtM7X","date":"Tue Mar 01 13:18:09 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We only have a small window left to act for our children and grandchildren. Please look up now! \n\nhttps://t.co/9nSAmeTziP","date":"Mon Feb 28 22:57:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Every woman has the right to make her own reproductive choices. This right is at risk of being dismantled by the Supreme Court.\n \nTonight, the Senate will vote on the Women’s Health Protection Act to guarantee access to reproductive health care nationwide. We must pass this now.","date":"Mon Feb 28 21:07:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today marks the start of #GreatLakesWeek, which comes at a time when we just made the single-largest-ever investment in restoring our Lakes!\n \nThe Great Lakes are critical to our Michigan way of life. I will always protect our waters for future generations. https://t.co/BZ3Jb5lKX3","date":"Mon Feb 28 20:06:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Sending my love and prayers to my dear friend, @SenFeinstein, on the loss of her husband Dick. May he rest in peace.","date":"Mon Feb 28 15:52:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS, COVID-19 tests are now free and can be delivered to your home. Visit https://t.co/aNhPfR63C9 to order your tests.","date":"Sun Feb 27 23:19:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There is no reason for Americans to pay 800% more for their insulin than other countries. My Affordable Insulin Now Act would cap the out-of-pocket costs for this lifesaving drug to $35 a month. This is would a game-changer for Michiganders with diabetes. https://t.co/zwLfs8sm4Y","date":"Sat Feb 26 15:32:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What an exciting moment for our country! Thank you President Biden! https://t.co/FvPVCKkxKg","date":"Fri Feb 25 19:43:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Jackson is an extraordinary nominee to the U.S. Supreme Court and the right choice for this historic moment in our country.\n \nMy full statement: https://t.co/CmUeByi8Nt","date":"Fri Feb 25 16:35:24 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"More resources for small and midsized processors means better options for farmers and consumers. This will help lower prices and build a stronger and fairer meat and poultry supply chain that works for everyone. https://t.co/YuzfqDiy7W","date":"Fri Feb 25 12:54:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Shirley from Ann Arbor &amp; Shari from Alpena do critical work helping folks care for their diabetes. They know firsthand how expensive insulin can be. So grateful they joined me to support my bill to cap costs for insulin at $35/month. This would be life-changing for Michiganders! https://t.co/5KiRzhJshf","date":"Thu Feb 24 22:48:17 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I support @POTUS' decision to impose strong new sanctions on Russia. President Putin must face severe consequences.","date":"Thu Feb 24 21:20:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many folks have to make critical choices every day - paying for their life-saving medication, buying groceries, or paying their heating bill. Capping out-of-pocket costs for insulin at $35 per month will save lives and help people in Michigan breathe easier.","date":"Thu Feb 24 18:52:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I share the horror of the many Ukrainian-Americans in Michigan of this brutal, unprovoked, &amp; unjustified attack by President Putin on the people of Ukraine. America will stand strong with our allies to do everything we can to protect their freedom and independence and save lives.","date":"Thu Feb 24 13:32:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Did Senator Rick Scott and the Republicans just say they want to raise taxes on more than half of the American people??\nhttps://t.co/jXYaNqKCED","date":"Wed Feb 23 22:53:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I will work with my colleagues &amp; @POTUS to do everything we can to support Ukraine and our allies through this crisis.","date":"Tue Feb 22 17:47:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan is home to 39,000 Ukrainian Americans. I stand with them and others across the world who understand we have a shared responsibility to protect individual liberty and democracy.","date":"Tue Feb 22 17:47:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"COVID-19 vaccines and boosters are safe, free, and effective. Visit https://t.co/nimGKNCRq5 to find a vaccination site near you.","date":"Mon Feb 21 15:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wonderful to see how Detroiters are leading the way in urban agriculture and feeding our communities!\nhttps://t.co/dhqfmQVWoG","date":"Sun Feb 20 21:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news! It was just announced that another 16,000 Americans with student loans who were scammed by for-profit schools will receive debt relief. Thanks to @POTUS even more students who have been cheated won’t get stuck with the bill.\n \nhttps://t.co/sNHmcF7hnz","date":"Sun Feb 20 14:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"More than 50 million families have received free COVID-19 tests! If you need at-home tests visit https://t.co/4aJzwhdEE3.  \n \nhttps://t.co/p7rl5iKqaw","date":"Sat Feb 19 19:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"A nuclear waste spill near our Great Lakes would be catastrophic to our economy, environment, and Michigan way of life.\n\nOur neighbors in Canada need to make the right decision and stop plans to store nuclear waste near our Lakes.","date":"Sat Feb 19 15:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If you or a loved one uses baby formula, please see FDA’s advisory about a voluntary recall and what to watch for to keep our kids safe: https://t.co/VZ45hsa1KW","date":"Sat Feb 19 13:34:48 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It was great to have @EPAMichaelRegan back in Detroit—this time at the Dossin Great Lakes Museum. What a fun place to show him the history of our Great Lakes and how this investment will create cleaner, healthier lakes for future generations. https://t.co/v29Mdjqpzb","date":"Fri Feb 18 22:12:41 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The price of insulin is outrageous! No one should have to choose between paying their rent or paying for insulin.  \n \nI cosponsored @SenatorWarnock’s bill to cap insulin co-pays at $35 per month. We have to stop this price gouging.","date":"Fri Feb 18 22:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Infrastructure Investment and Jobs Act includes the single-largest-ever investment in the Great Lakes! This will clean up pollution in nine areas in Michigan by 2030—a game-changer for our tourism industry, fisheries, beaches, and outdoor recreation. https://t.co/EOAQHSirfh","date":"Fri Feb 18 21:27:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Flint Registry is connecting the people of Flint with the services they need to address the health impacts of lead contamination. This critical work must continue as families recover from the Flint water crisis.\nhttps://t.co/taV0fECWH9","date":"Fri Feb 18 15:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the Infrastructure Investment and Jobs Act:\n💻over 10 million households have enrolled to receive high-speed, affordable internet\n🌊we made the single-largest investment ever to clean up and restore our Great Lakes https://t.co/x7QJTMLioX","date":"Fri Feb 18 13:43:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our sea levels are rising at an alarming rate. We cannot wait any longer to take action on the climate crisis. \n \nhttps://t.co/NIm7D1jzQW","date":"Thu Feb 17 22:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"All Americans deserve access to quality, affordable healthcare. @HHSGov must act quickly to limit the sale of junk health care plans that don’t cover essential benefits like mental health and maternity care.","date":"Thu Feb 17 17:40:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"BIG NEWS: The Infrastructure bill included the single-largest-ever investment in the Great Lakes!\n \nFrom Muskegon Lake to the Detroit River, we're going to cleanup heavy pollution in 9 different areas in Michigan! https://t.co/dK0EMOe4YO","date":"Thu Feb 17 14:01:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many young people are struggling with mental health and addiction challenges. Community Behavioral Health Clinics are the model for providing quality, comprehensive care close to home. They are improving access so young people across the country get the help they need. https://t.co/HW1mCy6lMk","date":"Wed Feb 16 23:01:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today I introduced legislation that sends a strong message to our Canadian neighbors: make the right choice and stop any plans to store nuclear waste so close to the Great Lakes. Read more here ⬇️\nhttps://t.co/qwTRH2vH2c","date":"Wed Feb 16 20:24:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Placing a nuclear waste facility near one of the world’s largest supplies of fresh water makes absolutely no sense and is dangerous. Our Great Lakes are central to our Michigan way of life, and any nuclear waste spill would be devastating.","date":"Wed Feb 16 20:24:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats believe students who have been defrauded or cheated by shady schools shouldn’t be stuck with the bill. Under @POTUS, they won’t be. Already, 107,000 borrowers who attended ITT Technical Institute have received relief.","date":"Wed Feb 16 18:45:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@SenateDems and @POTUS have delivered for the American people by lowering costs, putting shots in arms, and getting kids back to school. And we’re not done yet. Republicans have done nothing to lower costs and continue to block our efforts. https://t.co/Boew34TvnL","date":"Wed Feb 16 14:44:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I always love attending @michigantech’s Winter Carnival. Congratulations on 100 years of amazing snow sculptures!! \n\nhttps://t.co/mjvhkHMQ42","date":"Wed Feb 16 02:08:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"People living with disabilities can face a lot of barriers – including paying off student loans. Thanks to @POTUS and @usedgov, 400,000 borrowers have already been provided relief minus the red tape.","date":"Tue Feb 15 23:19:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Alzheimer's is a heartbreaking disease for patients, families, and caregivers. Last week I met with Michigan advocates from the @alzassociation who are working hard to #EndALZ. I'm glad to have them as partners in this fight. https://t.co/Ay6xUCh5rY","date":"Tue Feb 15 21:20:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s a no-brainer. One way to fight the climate crisis is to buy steel, cement, and other materials that produce less carbon emissions. \n\nGreat work from the @WhiteHouse. \nhttps://t.co/vOpmZLH9H6","date":"Tue Feb 15 17:31:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations, Nick! Michigan proud!\nhttps://t.co/QEg5V3Gtom","date":"Tue Feb 15 13:31:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan’s own Dr. Lisa Cook has spent decades fighting for equity in the workforce and innovation to strengthen our economy. That's why I'm supporting her nomination.","date":"Mon Feb 14 22:30:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Valentine’s Day! Wishing everyone a day full of love and kindness. https://t.co/4ngjXnZkAB","date":"Mon Feb 14 21:04:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, @nickbaumgartner, on your historic gold medal! #TeamUSA","date":"Mon Feb 14 18:55:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Teachers, first responders and veterans selflessly serve our nation every day. With @POTUS’s overhaul of the Public Service Loan Forgiveness program, more than 965,000 of these public servants are expected to see their loans fully or partially forgiven.","date":"Mon Feb 14 14:39:41 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations, Gavin and Justin! What a special honor!\nhttps://t.co/0TFfroitnq","date":"Sun Feb 13 21:51:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wonderful news Ben Ray! Can’t wait to have you back with us!","date":"Sun Feb 13 18:01:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting tested for COVID-19 helps stop the spread. Thanks to @POTUS, these tests are free and can be delivered to your mailbox. Visit https://t.co/aNhPfQOsdz to order your tests.","date":"Sun Feb 13 16:32:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good news! @POTUS and @usedgov are helping Americans with student loan debt. So far, more than 70,000 borrowers have had their loans fully or partially forgiven through the Public Service Loan Forgiveness program.","date":"Sat Feb 12 22:01:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan is already leading the way in electric vehicle manufacturing. This new funding will build charging stations across our state and get more Michigan-made EVs on the road. https://t.co/R5XQ53KmFd","date":"Sat Feb 12 19:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Vaccines and boosters save lives. If you still need to get one visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Sat Feb 12 15:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck, @WinterVinecki. I will be rooting for you!\nhttps://t.co/Lv3hAn1MET","date":"Fri Feb 11 23:45:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Jobs, jobs, jobs!\n \nSince President Biden took office, over 6.6 million jobs have been created – 375,000 of those are manufacturing jobs! This is great news. https://t.co/YHDrRogiNG","date":"Fri Feb 11 22:25:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Today marks the 85th anniversary of White Shirt Day. We celebrate and honor the Flint autoworkers who put their lives on the line for better pay and working conditions. They made the @UAW what it is today and paved the way for better workers’ rights in our country.","date":"Fri Feb 11 21:32:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats @brendan_brisson, @Matty_Beniers10, and all of @usahockey on your win!\nhttps://t.co/YEITHu0Ymn","date":"Thu Feb 10 23:45:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Electric vehicles are a key part of our clean energy future. But you can’t drive one without access to charging stations. Thanks to the bipartisan Infrastructure Investment and Jobs Act, we will have more charging stations across Michigan.\nhttps://t.co/sD1hYSQi1C","date":"Thu Feb 10 21:52:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats are laser-focused on lowering costs that keep Americans up at night.","date":"Thu Feb 10 19:10:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is a long overdue win for survivors and one of the most significant workplace reforms in our lifetime. \nhttps://t.co/r99xwmgdX6","date":"Thu Feb 10 17:18:29 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is big. \n \nOver 375,000 manufacturing jobs have been created since @POTUS took office.\n \nThese good-paying jobs will help fix our supply chains here at home!","date":"Wed Feb 09 23:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"During the pandemic, violence against women has increased, and we can’t wait any longer to act. Reauthorizing the Violence Against Women Act would strengthen critical lifelines for survivors of domestic abuse. #VAWA https://t.co/Gts39KFGfF","date":"Wed Feb 09 21:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So many in Michigan rely on the post office for their bills, medications, and businesses.\n\nThis important bill will support our postal workers &amp; make sure folks can depend on the post office for reliable service.\n\nThe Senate should pass this ASAP!\nhttps://t.co/q9JBMWZRya","date":"Wed Feb 09 20:28:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck to all our Michigan Olympic athletes. I can’t wait to cheer you on. I know you will make Michigan proud. \nhttps://t.co/gacKHKEdSe","date":"Wed Feb 09 15:29:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, Evan Bates and Madison Chock! You've made Michigan proud.\n\nhttps://t.co/K50L0lTUx7","date":"Wed Feb 09 01:48:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Anxiety &amp; depression have become way too common in our kids, especially during the pandemic.\n\nSchool-Based Health Centers &amp; Certified Community Behavioral Health Clinics are making a real difference in our children's lives by getting them the help they need close to home. https://t.co/c1RTUVdZIt","date":"Tue Feb 08 22:18:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Child Tax Credit has already improved the lives of over 1 million Michigan families. If you're eligible for the expanded Child Tax Credit or the Earned Income Tax Credit, file your 2021 taxes to claim your benefits. Visit https://t.co/nup6deLZeG to learn more.","date":"Tue Feb 08 19:53:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We have no time to waste. The semiconductor crisis is devastating Michigan workers, families, and businesses.\n\nThe good news - my provision with @SenGaryPeters to invest in making semiconductor chips here at home is in the America COMPETES Act. We must pass this now to fix this!","date":"Tue Feb 08 18:11:22 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats are moving our economy forward.","date":"Tue Feb 08 00:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting your COVID-19 vaccine will help protect you and your loved ones. Visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Mon Feb 07 22:49:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Devastating news. Captain Birnie served our country his entire life both in the U.S. Marine Corps &amp; during his 26 years at the Flint Police Department. My heart goes out to his family, his colleagues at the Police Department and the entire Flint community.\nhttps://t.co/xBwfcTbrx4","date":"Mon Feb 07 21:13:40 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"So proud that Michiganders are leading the way in urban agriculture and feeding our families!\nhttps://t.co/nFQeIuRWCV","date":"Mon Feb 07 15:34:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Kudos to @BusLeadersforMI!\nhttps://t.co/DjQPoH4yiD","date":"Mon Feb 07 14:19:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"6.6 million jobs have been created since @POTUS took office. That's more than any President in history.","date":"Sun Feb 06 15:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Let’s not forget that Republicans had nothing to do with this. Our economic recovery is from @SenateDems and @POTUS taking intentional steps to help our economy get back on track. And there's still more work to do!","date":"Sat Feb 05 16:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As the founder of Detroit Dirt, Pashon Murray is finding solutions for everyday waste &amp; making composting easier. It was my pleasure to introduce this MI native at the @EPWCmte hearing!\n \nThank you, Pashon, for the great work you’re doing in our state and across the country. https://t.co/ePWDsLItTr","date":"Sat Feb 05 01:14:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@SenateDems and @POTUS are working hard for Americans:\n✅467,000 jobs created\n✅Medicare recipients will receive free at-home COVID-19 tests\n✅98% of America's public schools are open https://t.co/TKdzZC9dlZ","date":"Sat Feb 05 00:00:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"On Rosa Parks’ birthday, let’s honor her courage and determination that changed history forever. May we continue to celebrate her legacy every day, especially during #BlackHistoryMonth.","date":"Fri Feb 04 22:35:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news and a big deal for Michigan. The America COMPETES Act will help businesses make semiconductor chips for the auto industry in the USA!\nhttps://t.co/Z7K3ZuoLst","date":"Fri Feb 04 21:33:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great job President Biden!","date":"Fri Feb 04 18:14:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is great news! Step by step, our economy is moving forward.\nhttps://t.co/dnapCXZCAo","date":"Fri Feb 04 14:40:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck to all the Michiganders competing in the Beijing 2022 Olympics! I know you'll make our state and our nation proud. I can't wait to cheer you and the rest of @TeamUSA on!\nhttps://t.co/7tvVv39eRD","date":"Fri Feb 04 11:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Black Michiganders have contributed so much to our state and nation.\n \nThis month @POTUS will nominate the first Black woman to the Supreme Court. An exciting moment in history! Let's celebrate the accomplishments of Black Michiganders this #BlackHistoryMonth &amp; every month! https://t.co/feRh7vS30x","date":"Fri Feb 04 00:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Right-wing dark-money groups captured the courts to push their extreme agenda.\n\nNow, they are trying to flip the script. Too bad Americans won’t forget they altered the makeup of SCOTUS using hundreds of millions of dark-money dollars.","date":"Thu Feb 03 23:43:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is important news that will make a big difference in keeping people safe!\n\nLast week, I led my colleagues in urging the Administration to cover free over-the-counter COVID-19 tests for people on Medicare. I appreciate the Administration stepping up to work with us on this.","date":"Thu Feb 03 18:49:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's National School-Based Health Care Awareness Month. These centers mean kids can see a doctor or nurse at their school, which is so convenient! This keeps kids healthy in MI &amp; across the country, which is why I’ll keep working to make sure they have the funding they need.","date":"Wed Feb 02 20:41:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@SenateDems are taking actions to lower costs for Americans. Republicans love to talk about inflation, but they keep voting “NO” on actions to help Americans manage and lower their everyday costs. Here are some of the highlights…\nhttps://t.co/ujBGko0KpX","date":"Wed Feb 02 00:12:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @senatedems are lowering people’s costs and getting our economy back on track. Meanwhile, Republicans are too busy standing up for big corporations price-gouging Americans while making record profits. https://t.co/cDlWOY3pmo","date":"Tue Feb 01 22:11:46 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"From bringing high-speed, reliable internet to unserved areas of Michigan to funding fixes for our crumbling roads and bridges, the Infrastructure Investment and Jobs Act will impact every Michigander!","date":"Tue Feb 01 17:45:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks, @theTakeWithKM for having me on your show! Keep up the good work.","date":"Tue Feb 01 15:12:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It's common sense. American tax dollars should be used to create American jobs by purchasing American products, not products made overseas. I'm glad to partner with @POTUS to support American workers and manufacturers!","date":"Tue Feb 01 01:23:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS and Democrats, our farmers are recovering from the Trump administration’s trade wars. Step by step, producers and rural communities are getting back on track.\nhttps://t.co/W7B9ScV8Gg","date":"Mon Jan 31 22:08:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: You can order free at-home COVID-19 tests. Thanks to @POTUS, it’s easier to protect yourself and stop the spread of COVID-19. Visit https://t.co/4aJzwgW3Mv to order your tests.","date":"Sun Jan 30 16:05:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The climate crisis is very real and very serious. It’s way past time to tackle carbon pollution, which is damaging our economy and way of life and costing us billions in destruction.  Congress can and must act ASAP. \nhttps://t.co/f1z8jKzLUQ","date":"Sun Jan 30 14:54:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Vaccines and boosters are safe and effective. Protect yourself and your loved ones and visit https://t.co/kGAgAAOPJ5 to find a location near you.","date":"Sat Jan 29 15:00:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good News! @MichiganHHS is now offering free high-quality masks.\n \nhttps://t.co/ntoUUrvfYs","date":"Fri Jan 28 19:01:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"On International #HolocaustRemembranceDay, we honor and mourn the lives of the millions of Jews and others murdered by the Nazis. We must #NeverForget and stand against all forms of hatred and antisemitism. https://t.co/XYNcZL0GVB","date":"Thu Jan 27 21:58:04 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"A record 14.5 million people signed up for Affordable Care Act plans during open enrollment! Now even more people have affordable, quality health care. \nhttps://t.co/ucb0Oq6aBF","date":"Thu Jan 27 19:32:21 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is exciting!","date":"Thu Jan 27 18:23:25 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news! Democratic policies are working! But more to do. Top priority… tackling COVID inflation to bring down costs for Americans.\nhttps://t.co/EBeYocgQac","date":"Thu Jan 27 15:01:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@GovWhitmer is right! Health care above the neck should be funded the same as health care below the neck. #MISOTS22","date":"Thu Jan 27 00:57:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I know President Biden will choose a nominee who stands up for equal justice, democracy and the rule of law. I look forward to their consideration in the U.S. Senate.","date":"Wed Jan 26 22:17:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As new and important questions come before the Court, it’s critical we move forward, not backward, on workers’ rights, women’s rights, health care, voting rights, combatting the climate crisis and more.","date":"Wed Jan 26 22:17:02 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This Supreme Court vacancy comes at a consequential moment in our nation’s history – what we do at this moment will have a lasting impact on Michigan and our country.","date":"Wed Jan 26 22:17:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The semiconductor crisis is devastating MI workers, families &amp; businesses. The America COMPETES Act includes my provision with @SenGaryPeters to invest in semiconductor chips made in the U.S. \n\nThat will help Michigan workers lead our manufacturing future.\nhttps://t.co/IDv1B64beA","date":"Wed Jan 26 21:11:45 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy 185th birthday to the greatest state in the union!","date":"Wed Jan 26 18:24:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wonderful to learn more about Abby Roque’s impressive story!\n\nhttps://t.co/cd4xY2iMJq","date":"Tue Jan 25 23:33:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This announcement from @GM is a big win for Michigan. Electric vehicles are a vital part of our transportation future, and this historic investment will create good MI jobs and get more EVs on the road.","date":"Tue Jan 25 19:40:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@GM and @GovWhitmer have announced major investments in Michigan’s EV future that will create thousands of good-paying jobs!  A great partnership with state and local leaders, key businesses and the @UAW.  I’m proud to be leading the EV efforts in DC! https://t.co/u5KciDSXd0","date":"Tue Jan 25 18:21:54 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Step-by-step, @POTUS and Democrats are getting our economy back on track.","date":"Tue Jan 25 14:18:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan knows all too well the dangers of lead pipes. The Infrastructure Investment and Jobs Act makes a historic investment to replace lead pipes, which will change the lives of so many Americans.","date":"Tue Jan 25 00:04:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Seniors and people with disabilities on Medicare are at the highest risk of severe illness from COVID-19. That's why I am leading an effort to make sure Medicare covers free at-home COVID-19 tests.\nhttps://t.co/s7YMhDYYhz","date":"Mon Jan 24 21:35:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Whether it’s building the new lock at the Soo Locks, fixing our roads and bridges, or replacing lead pipes, the Infrastructure Investment and Jobs Act touches every part of our state. It’s a game-changer for Michigan. https://t.co/kUmcyV10Nu","date":"Mon Jan 24 02:24:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting vaccinated and boosted greatly reduces the risk of getting seriously ill from COVID-19. If you still need to get a vaccine or booster visit https://t.co/kGAgAB6qAD to find a location near you.\n \nhttps://t.co/k2qBxIYqZ9","date":"Sun Jan 23 15:30:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree! It’s time to get funding @SenGaryPeters and I authored to @POTUS' desk so we can make semiconductors here in America. Michigan workers and manufacturers can’t afford another chip shortage.\n \nhttps://t.co/JC0P5XEJTY","date":"Sat Jan 22 15:18:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There’s a lot of pieces to the bipartisan Infrastructure Investment &amp; Jobs Act, and it will do a lot of good for MI.\n \nOne example is the Soo Locks. We have needed a new lock for years &amp; this law secured us the funding to get it done as soon as possible.\nhttps://t.co/FOUFRtUkWb","date":"Fri Jan 21 21:24:28 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Whether it's investing in our nation's crumbling infrastructure or helping people get free at-home COVID tests and N95 masks, @POTUS, @VP and @SenateDems are putting people first every day. https://t.co/2rOayABf7M","date":"Fri Jan 21 19:35:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As a gateway for agricultural products and materials manufacturers &amp; the military depend on, the Soo Locks are crucial to our economy &amp; national defense. This new investment will allow @USACEHQ to complete the construction of a new lock!\nhttps://t.co/OOgHbXh0KX","date":"Fri Jan 21 15:04:20 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"One year ago, @POTUS and @VP were sworn into office and immediately hit the ground running with our new Senate majority. Since that time, @SenateDems have partnered with President Biden and his Administration to put people first in everything we do. https://t.co/xzZEgXXzeO","date":"Thu Jan 20 22:48:20 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I don’t have to tell Michiganders—we all know how devastating it would be for the economy if the Soo Locks shut down. Because of the Infrastructure Investment &amp; Jobs Act, we now have the funding needed to build the new lock &amp; stop a shutdown from happening!https://t.co/rwQSOhnHOi","date":"Thu Jan 20 22:40:32 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"In Michigan, Willie O'Ree's Hockey Is For Everyone program has changed the lives of so many young people. Now that the Willie O’Ree Congressional Gold Medal Act has passed, we can move forward on awarding Willie O’Ree the honor that he deserves!\nhttps://t.co/UOIrwH7KXM","date":"Thu Jan 20 16:42:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s been one year since President Biden took office, and businesses have created a record 6.4 million jobs! Our economy is recovering step by step thanks to Democrats and our partnership with @POTUS.","date":"Thu Jan 20 14:26:26 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I will continue both in Michigan and in the U.S. Senate to fight to protect our freedom to vote.\n\nMy full statement on the Freedom to Vote: John R. Lewis Act: https://t.co/eAZ3gsfHKM","date":"Thu Jan 20 03:50:48 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"In just a moment, Senators will have to choose…\n \nProtect Americans’ freedom to vote or allow those supporting the Big Lie to limit peoples’ freedoms &amp; undermine our democracy.\n \nI’m choosing to stand with our Founders &amp; our Constitution to preserve our freedom to vote.","date":"Thu Jan 20 01:25:13 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If we want to stop Asian carp from devastating our Great Lakes, we need to cut them off in IL at the Brandon Road Lock &amp; Dam. @SenGaryPeters, @SenatorDurbin, @SenDuckworth &amp; I secured $225M in the Infrastructure lnvestment &amp; Jobs Act to kickstart construction of this project.","date":"Wed Jan 19 21:53:30 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The filibuster is increasingly being used as a weapon to stop our nation from making progress. Now, Republicans are using it to block consequential voting rights legislation. We must pass voting rights—the nation we want for our children depends on it. https://t.co/diSjpwtOUq","date":"Wed Jan 19 20:51:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I am prepared to defend our right to vote. It’s time for the Senate to do the right thing and pass the Freedom to Vote: John R. Lewis Act.","date":"Wed Jan 19 17:09:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"After a hard-fought effort, we finally have full funding of the Army Corp’s budget to finish building the new lock at the Soo Locks as soon as possible.\nhttps://t.co/wZkQkjYPV5","date":"Wed Jan 19 16:04:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The assault on the freedom to vote is happening right in front of us. And we can’t wait any longer to stop it. \n\nWe must pass the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act. https://t.co/e90moauzz8","date":"Wed Jan 19 02:23:03 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is why I am leading the effort to award him the Congressional Gold Medal, Congress' highest honor to recognize his achievements. We are so grateful for the work Willie O'Ree has done for the sport of hockey and for Michigan families.","date":"Wed Jan 19 00:48:39 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"64 years ago, Willie O’Ree became the first Black player in the @NHL. Tonight, the @NHLBruins retired his jersey to honor this day in history. O'Ree was not only a trailblazer 64 years ago, but continues to make a difference in MI with his Hockey Is For Everyone program.","date":"Wed Jan 19 00:48:38 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The choice is clear: protect the right to vote or restrict voting rights. We cannot go backwards in history. We must pass the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.","date":"Tue Jan 18 23:42:06 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Voting is so fundamental to who we are as Americans. It shouldn’t be a divisive issue, but it is today. Democrats will keep fighting against the Republicans’ organized effort to restrict voting rights.","date":"Tue Jan 18 20:00:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"All 50 Republicans in the Senate oppose our voting rights bills, leaving our elections vulnerable and right to vote under attack. If they want to protect our democracy, they should join us.","date":"Tue Jan 18 15:49:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Wonderful article! Thank you, Dr. Jackson, for your years of caring for people!\n\nhttps://t.co/2reFKShHo6","date":"Mon Jan 17 22:11:28 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There is no doubt in my mind that he would be leading the effort to stop the Republican voter suppression efforts across our country, including in Michigan. We must do the same. #MLKDay","date":"Mon Jan 17 14:15:52 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As we honor and remember Dr. Martin Luther King Jr. today, let us recommit to the values and principles his life’s work represents…starting with the freedom to vote.","date":"Mon Jan 17 14:15:51 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"As omicron continues to spread across Michigan, it’s important that we are all vaccinated and boosted. Visit https://t.co/kGAgAB6qAD to find a location near you.","date":"Sun Jan 16 15:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"TODAY is the last day to visit https://t.co/pHg3ho8ZHT and sign up for quality, affordable health care for 2022. #GetCovered","date":"Sat Jan 15 18:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We cannot wait to fix Michigan’s crumbling bridges! This investment will transform how Michiganders get around the state and strengthen the safety of our bridges for future generations.\nhttps://t.co/E7V0qZNS6k","date":"Sat Jan 15 14:00:01 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: ONE more day to sign up for 2022 Affordable Care Act plans. Visit https://t.co/pHg3ho8ZHT and #GetCovered.","date":"Sat Jan 15 01:45:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This week, @POTUS and @SenateDems announced the largest investment ever to rebuild America's crumbling bridges and create good-paying jobs. https://t.co/buw70nyMh6","date":"Sat Jan 15 00:51:34 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Dr. Cook’s perspective &amp; experience is unmatched &amp; will be instrumental in our nation’s recovery. Her nomination is also historic, as she will be the first Black woman to serve on the Board. I’m proud to see Michigan’s diversity &amp; excellence be represented at the Federal Reserve.","date":"Fri Jan 14 22:12:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Dr. Lisa Cook is the right person at the right time to serve at the Federal Reserve. I’m glad President Biden recognized this. Her nomination comes at a moment when the Federal Reserve needs the best and the brightest to help us recover from the COVID-19 pandemic.","date":"Fri Jan 14 22:12:15 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"If Republicans truly want to protect our democracy, they should join us in passing the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.","date":"Fri Jan 14 17:27:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the leadership of @POTUS &amp; his partnership with Congress, we're making the largest investment ever to finally fix our bridges. This funding is a game changer for MI and one critical piece of the investments in infrastructure coming for our state.\nhttps://t.co/VB8BWRYQJX","date":"Fri Jan 14 13:32:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Asian Carp aren't waiting for us to finish the Brandon Road project before trying to damage the Great Lakes.\n \nThis project is crucial for our economy and we've got to get it done as soon as possible. https://t.co/xTWk0amlUy","date":"Thu Jan 13 19:36:27 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I agree with @BarackObama. It's time for the Senate to do the right thing and protect the freedom to vote.","date":"Thu Jan 13 17:10:36 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We're working on borrowed time to update the Soo Locks. Each day that goes by without action, we're closer to a devastating situation that impacts our economy and supply chain in Michigan and globally.\n \nWe can't wait any longer. https://t.co/o1neWCudoi","date":"Thu Jan 13 14:44:48 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@VP is right. Protecting our freedom to vote is one of the most important jobs we have. It’s time to get this done.","date":"Thu Jan 13 00:33:57 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"These projects will create good-paying union jobs right here in Michigan while tackling the climate crisis! This is a win-win for our workers, economy, and environment. It's going to ensure that Michigan continues to lead the clean energy future.","date":"Wed Jan 12 21:34:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"One more memorial for a lost Senate statesman. This one is even more personal to me… the passing of my dear friend, Senator Harry Reid. I will forever be grateful for his love and support. https://t.co/1Iz5moKc5Z","date":"Wed Jan 12 16:37:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The freedom to vote is under attack across our country. We need to pass the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act NOW.","date":"Wed Jan 12 16:15:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"This is such an exciting effort, @Ford! I can’t wait to celebrate it’s opening! \nhttps://t.co/vbn1MvwlOi","date":"Wed Jan 12 14:43:55 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We must do everything possible to protect our democracy and our freedom to vote. It’s time to pass the Freedom to Vote Act. https://t.co/Uay2d64j05","date":"Tue Jan 11 22:40:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Despite Republican opposition, step-by-step we are getting people back to work in record time.","date":"Tue Jan 11 19:49:58 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We cannot let Trump’s big lie continue to undermine our democracy. The Freedom to Vote Act will strengthen and protect our right to vote.","date":"Tue Jan 11 15:54:49 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s the last week to sign up for 2022 Affordable Care Act plans. Visit https://t.co/pHg3hnRoQl by January 15th to #GetCovered.","date":"Mon Jan 10 23:10:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Off to a great start! Best wishes @AHammoudMI for a healthy and successful 2022! I’m proud to be your partner.\nhttps://t.co/1wC0kYedXc","date":"Mon Jan 10 16:54:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our freedom to vote is currently under attack. Instead of holding us up, my Republican colleagues should join us in passing the Freedom to Vote Act.","date":"Mon Jan 10 15:11:23 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Good news, Detroiters: There are more places to get tested for COVID-19.\n\nhttps://t.co/IBmAl9xrKK","date":"Sun Jan 09 23:20:17 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Freedom to Vote Act and the John Lewis Voting Rights Advancement Act are critical to securing future elections and the ability to make your voice heard. https://t.co/rpb5k13zb2","date":"Sun Jan 09 20:56:44 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Protecting and strengthening our elections is the only way we maintain our great democracy. It’s time we pass the Freedom to Vote Act.","date":"Sat Jan 08 17:21:10 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Our vote is our voice. The Senate must pass the Freedom to Vote Act now to ensure that our voices are heard.","date":"Sat Jan 08 02:03:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems are taking steps every day to put families first and get our economy back on track. https://t.co/zokTuwZjuY","date":"Fri Jan 07 20:05:53 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"@VP is right. We have no time to waste when it comes to protecting our democracy. Let’s get this done.","date":"Fri Jan 07 16:12:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I'll forever be thankful for the bravery of the Capitol Police, National Guard, other first responders and Capitol staff who put their lives on the line to keep us safe on Jan. 6, 2021. I pray this never happens again. https://t.co/rcd7HoAuT3","date":"Fri Jan 07 01:38:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Threats against our democracy did not go away once the insurrection ended. The insurrectionists tried to overthrow our Capitol &amp; their sidekicks in suits are trying to overthrow our elections.\n\nWe must pass the Freedom to Vote Act to save our democracy.\nhttps://t.co/ZBo2r0OXTv","date":"Thu Jan 06 23:39:16 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Instead of making it harder to vote, Republicans should join us in passing the Freedom to Vote Act. This is a critical time for our country and we've got to act now.","date":"Thu Jan 06 21:37:18 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The freedom to vote is under attack across our country. \n\nWe must pass the Freedom to Vote Act now. Our democracy depends on it.","date":"Thu Jan 06 19:10:05 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"I will never forget that horrible day a year ago. We can’t afford to forget it, because the threats to our democracy continue across our country. https://t.co/zIA4f2dCpb","date":"Thu Jan 06 16:52:37 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The Capitol Police, National Guard, other first responders and Capitol staff who were there that day are heroes, and they deserve our thanks and our continuing support.","date":"Thu Jan 06 14:32:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"What we all witnessed on this day one year ago was nothing less than a violent insurrection against the very seat of our democracy and our American form of government.","date":"Thu Jan 06 14:32:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The violence that cost American lives was sparked by a Big Lie, concocted by someone who lost an election &amp; fueled by his supporters. Today is a day to be grateful for those who stood up for our Democracy on January 6, 2021, &amp; those who have the courage to stand up every day.","date":"Thu Jan 06 14:32:47 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Your vote is your voice and it needs to be protected. \n \nWe must pass the Freedom to Vote Act now!","date":"Wed Jan 05 22:56:56 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":".@SenatorWarnock is right. We've got to get this done ASAP.","date":"Wed Jan 05 20:16:56 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s so important to get vaccinated. Visit https://t.co/86PjRRcCmD to find an appointment near you.","date":"Wed Jan 05 19:14:14 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"… despite opposition from EVERY Senate Republican to support our actions to keep our economy moving!","date":"Wed Jan 05 16:07:41 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"We've worked together on many issues, including launching a behavioral health initiative to bring mental health &amp; addiction resources to Michiganders. While I'll miss working with my friend in 2023 &amp; beyond, I know she'll do so much good in MI in whatever she chooses to do next.","date":"Wed Jan 05 15:09:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Congress is losing an incredible public servant, trailblazer and leader. Congresswoman Lawrence arrived in Congress with an impressive record of public service. In Congress, this commitment to the people of MI shows in her work every day.","date":"Wed Jan 05 15:09:08 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"There are no limits. And Republicans are letting it happen.\n\nWe're at a critical moment for our country. We must pass the Freedom to Vote Act.","date":"Wed Jan 05 02:21:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Trump's Big Lie has fueled an entire movement – people who will stop at nothing to undermine our democracy. They attacked our Capitol on January 6th. They’ll use and incite violence to disrupt future elections. They’re changing the rules to take away people’s freedom to vote.","date":"Wed Jan 05 02:21:35 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"The future is made in Michigan! ⚡️","date":"Tue Jan 04 22:17:12 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: ZERO Senate Republicans voted for the American Rescue Plan that helped our struggling small businesses keep their doors open.","date":"Tue Jan 04 20:24:33 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Four huge meatpackers are raking in profits while families pay through the nose and farmers get shortchanged.\n\n@WhiteHouse + @USDA + @SenateDems are tackling this head on.","date":"Tue Jan 04 18:27:07 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy New Year! Here's to hope, good health, and lots of love for you and your family in 2022. https://t.co/uLsvlMQ1bF","date":"Sat Jan 01 13:00:00 +0000 2022","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s #CFBPlayoff time! Can’t wait to watch the B1G Champions @umichfootball compete in the #OrangeBowl #GoBlue","date":"Fri Dec 31 23:37:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck @CMU_Football! #BeatWSU","date":"Fri Dec 31 15:25:43 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Victory for MSU! #GoGreen !","date":"Fri Dec 31 04:37:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Excited to watch my @MSU_Football Spartans in the Peach Bowl. #GoGreen","date":"Thu Dec 30 22:06:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Open Enrollment for 2022 Affordable Care Act plans is still going on. Visit https://t.co/pHg3hnRoQl to sign up for quality, affordable health care.","date":"Wed Dec 29 18:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I am sending all of my love to Landra, their children, the entire Reid family and the state of Nevada.","date":"Wed Dec 29 02:14:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Harry Reid was Nevada—he loved his home state fiercely and was absolutely tireless in working for its people and its future. He cared deeply about the Senate and about our nation. Beyond that, he was a wonderful person and a special friend.","date":"Wed Dec 29 02:14:37 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Way to go Dash N Diners! Thanks for showing the best of Michigan in these challenging times!","date":"Tue Dec 28 01:32:11 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We have made great progress on getting shots in people's arms. More than 72% of American adults are vaccinated. If you still need to get vaccinated or boosted, visit https://t.co/kGAgAAOPJ5.","date":"Mon Dec 27 15:05:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Best of luck to @WMU_Football, in today’s Quick Lane Bowl game!","date":"Mon Dec 27 14:59:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"To all those celebrating, Happy Kwanzaa! https://t.co/ijI4DPLEei","date":"Sun Dec 26 14:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"From my family to yours, Merry Christmas! I hope your holiday season is filled with love and joy. https://t.co/jwXzs9rz6M","date":"Sat Dec 25 13:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The U.S. is experiencing the fastest economic growth in 40 years! Step by step, our economy is getting back on track.","date":"Fri Dec 24 15:00:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The number of containers sitting on the docks at ports for over a week has been cut by half since the beginning of November.","date":"Thu Dec 23 19:00:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Wishing everyone in Michigan and around the country a happy holiday season! https://t.co/pRoVfssez4","date":"Thu Dec 23 15:02:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news for Michigan families this holiday season!\n\nhttps://t.co/iuEX6Ym5GG","date":"Wed Dec 22 16:05:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to @POTUS and @SenateDems putting more money in people's pockets, retail sales in the U.S. are up by $90 billion!","date":"Wed Dec 22 13:55:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Whether it's been getting shots in arms, children back to school, fixing our broken supply chains or helping our economy get back on track, I've been focused on putting Michigan families and businesses first this year. https://t.co/yMRhjW8A0E","date":"Tue Dec 21 17:54:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers and our auto companies are the best in the world. Today’s announcement will create good paying jobs in our state and cut carbon pollution so we can tackle the climate crisis!","date":"Mon Dec 20 22:46:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Senate confirmed 40 federal judges during @POTUS' first year. That's more than any recent president!","date":"Mon Dec 20 18:06:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"As we get ready to spend time with family and friends this holiday season, it’s important that we are safe and healthy. The best way to protect you and your loved ones is to get vaccinated or boosted. Visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Mon Dec 20 14:49:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"There are many costs that Americans struggle with every day. The Build Back Better agenda is about helping people to cut those costs. \n\nAmericans are counting on us to get this done.","date":"Sun Dec 19 20:11:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Every Senate Democrat supports giving our children the best opportunity to succeed possible starting with universal pre-K for 3- and 4-year olds. Great for our children and great for our economic future. We can act—we must act.","date":"Sun Dec 19 20:02:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"FACT: Too many parents pay more for their child care than their mortgage or rent. This is not only unsustainable but stops parents from going back to work. Every Senate Democrat supports capping the cost of child care at 7% of a working family’s income. We can act—we must act.","date":"Sun Dec 19 20:01:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We agree Big Pharma’s price gouging must end. We can act—we must act.","date":"Sun Dec 19 19:56:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We agree we should cap out-of-pocket costs at $2000 per year for seniors under Medicare. We can act—we must act.","date":"Sun Dec 19 19:55:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We agree that the cost of insulin should be capped at $35 per month rather than the average $1,000 per month cost Americans pay now. We can act—we must act.","date":"Sun Dec 19 19:53:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"FACT: Americans pay the highest prescription drug prices in the world. And we have 50 Senate Democrats who want to do something about it. We can act—we must act.","date":"Sun Dec 19 19:50:29 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Senator Johnny Isakson was a special man. It was such a pleasure to work with him on the Finance Committee on important issues affecting our states. He was always a man of his word. Sending heartfelt condolences to Dianne, the rest of his family and the state of Georgia.","date":"Sun Dec 19 19:40:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, @FerrisFootball! National Champs!","date":"Sun Dec 19 13:19:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck, @EMUFB, in the LendingTree Bowl!","date":"Sat Dec 18 22:12:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the American Rescue Plan, we’ve cut child poverty by more than 40% in America. This is a big deal!","date":"Sat Dec 18 17:07:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Judge Kumar and Judge Beckering are two outstanding and highly qualified judges. Their confirmations are great news for Michigan.\nhttps://t.co/CTanRmF2cM","date":"Sat Dec 18 04:45:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems have been putting people first this year by:\n- Replacing all lead pipes and removing lead paint\n- Getting people back to work\n- Ensuring the future is electric\n- Making health care more affordable than ever https://t.co/GTcnD1NUwV","date":"Fri Dec 17 22:22:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Step-by-step we're getting our economy back on track. When @POTUS took office, over 18 million people were receiving unemployment benefits. Today only 2 million are!","date":"Fri Dec 17 17:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"In Michigan, we know how devastating lead contamination is to our children and communities. Thank you, @POTUS and @VP, for partnering to protect Michigan.","date":"Thu Dec 16 18:50:14 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #ChildTaxCredit is lifting millions of Michigan families out of poverty.\n \nToday is the last day for you and your family to receive this tax cut unless we pass the Build Back Better Act. We must get this done!","date":"Wed Dec 15 23:46:56 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"What a fitting honor for Tate Myre. Thank you, @MSU_Football. #OxfordStrong","date":"Wed Dec 15 21:41:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Dawn Ison’s historic confirmation is excellent news for Michigan. I’m confident in her ability to serve our state as the next U.S. Attorney for the Eastern District.\nhttps://t.co/v3I3JgMo4w","date":"Wed Dec 15 20:06:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"NEWS: The military budget bill just passed the Senate. It includes important MI priorities I secured:\n🇺🇸Pay raise for our men &amp; women in uniform\n🇺🇸Funding to upgrade &amp; enhance military bases &amp; training centers across Michigan\n🇺🇸Investments to address PFAS \nhttps://t.co/sLSqm8BqG8","date":"Wed Dec 15 19:13:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Kellogg’s plan to replace striking workers is completely unacceptable. Seeking better wages and benefits should never cost someone their job.\n \nhttps://t.co/CIxUpzcgGl","date":"Wed Dec 15 15:32:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the Build Back Better Act, millions of Americans will receive high-quality care at home and their caregivers will receive better pay and benefits.","date":"Tue Dec 14 21:22:33 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy 185th Birthday, UP!\nhttps://t.co/fkvCUSpmW7.","date":"Tue Dec 14 19:52:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"A year ago, the first COVID-19 vaccine was administered in the U.S. \n \nI'm so thankful for everyone who worked so hard to save lives during this pandemic - especially our @pfizer workers in Portage. Michigan workers impacted millions of lives across our country.","date":"Tue Dec 14 17:40:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you or a loved one needs to get vaccinated, visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Tue Dec 14 17:40:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS gets it—we can’t get Michigan-made electric vehicles on the road if there’s no place to charge them.\n \nWith the Infrastructure Investment and Jobs Act and this new plan, we will see more charging stations on our roads!\n\nhttps://t.co/5MIIMFqYjn","date":"Tue Dec 14 00:43:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday @USNationalGuard! I was honored to spend the morning with our National Air Guardsmen at Selfridge Air National Guard Base. #Guard385","date":"Mon Dec 13 22:18:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I was proud to show her the broad community support for our Hometown Air Base in Southeast Michigan and the dedicated men and women who serve our country.","date":"Mon Dec 13 21:21:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to host @DepSecDef with @SenGaryPeters at Selfridge ANGB. She saw the wide array of national defense assets here that support critical missions &amp; the partnerships with MI businesses &amp; universities that help our military meet current &amp; future national security challenges. https://t.co/M9agoiLpR4","date":"Mon Dec 13 21:21:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"200 million Americans are fully vaccinated! If you or a loved one needs to get vaccinated or boosted, visit https://t.co/U3MpEz9U0I to find a vaccine site near you.","date":"Sun Dec 12 17:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Reminder: Open enrollment for 2022 Affordable Care Act plans is still going on. Visit https://t.co/pHg3ho8ZHT by December 15th to start receiving quality, affordable healthcare on January 1st. #GetCovered","date":"Sat Dec 11 15:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, Abby…This is so beautiful in so many ways!","date":"Sat Dec 11 13:49:36 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"New business start-ups are up 30%. This is great news and another example of how we are building back better!","date":"Sat Dec 11 00:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS and @SenateDems are moving our economy forward step-by-step:\n• Historic job creation\n• Jobless claims at a 52-year low\n• New business start-ups are up 30% https://t.co/svnztGJRTK","date":"Fri Dec 10 21:57:43 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Fake report on a bill that doesn’t exist — brought to you by the Republicans who said their nearly 2 trillion tax cut would “pay for itself.” We all know how that turned out!","date":"Fri Dec 10 20:50:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"There's no doubt that every woman in this country should have the right to make her own reproductive health choices.\n \nThe new Texas law is an attack on these personal freedoms. That's why the Senate should pass the Women's Health Protection Act now.","date":"Fri Dec 10 18:01:17 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"⬆ Businesses are creating millions of jobs\n⬆ Wages are up\n⬇ Energy prices are coming down\n\nThe Republican plan to lower your costs?\n\n•Stand with Big Pharma to raise the cost of your medicine\n•Oppose tax cuts to help you pay the bills\n•Continue huge tax giveaways to the rich","date":"Fri Dec 10 15:38:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS's economic plan is working.\n \nNew unemployment claims have dropped to the lowest level in 52 years! Our jobs recovery is one of the strongest ever.","date":"Thu Dec 09 22:18:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"My friend @morethanmySLE and I want to make sure you know that health care is more affordable than ever thanks to the American Rescue Plan!\n \nVisit https://t.co/pHg3hnRoQl to find affordable, comprehensive coverage for you and your loved ones. #SignUpForHealth","date":"Thu Dec 09 20:35:17 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is what the Build Back Better Act is all about. https://t.co/NAsYIPFssA","date":"Thu Dec 09 17:50:33 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Honored to be part of the Capitol salute to a true American statesman, Senator Bob Dole. May he rest in peace. https://t.co/uByG32G85b","date":"Thu Dec 09 16:35:15 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will lower prescription drug costs for seniors by capping their out of pocket costs to $2000 per year. Another reason why this landmark legislation will help our families.","date":"Thu Dec 09 14:12:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Recently I urged @NRCgov to help stop these proposals. It’s the right thing to do for the people of Michigan and our Great Lakes.","date":"Thu Dec 09 01:54:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"For years, I've lead bipartisan efforts to oppose any attempt by Canada to permanently store nuclear waste near our Great Lakes. A nuclear waste spill would be absolutely devastating for Michigan's economy, environment and way of life. https://t.co/qp9xvnSFSD","date":"Thu Dec 09 01:54:24 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will lower the cost of prescription drugs by allowing Medicare to negotiate prices. It’s time to get this passed!","date":"Wed Dec 08 23:55:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Businesses have created nearly 6 million new jobs in 11 months! And they’re not done yet.","date":"Wed Dec 08 21:44:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The future is Michigan-made!⚡️","date":"Wed Dec 08 19:22:37 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Since day 1, Democrats have been putting people first. People are back to work, families are getting vaccinated and kids are back to school. Now we are going to pass the Build Back Better Act to lower costs that keep families up at night. Let’s get this done! https://t.co/8afJa7NxFm","date":"Wed Dec 08 18:24:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So grateful to have @chefjoseandres as my partner in the effort to make sure everyone has the food they need to eat and the jobs they need to grow and make it. https://t.co/LlNtiWSEi3","date":"Tue Dec 07 18:54:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today we commend the bravery and sacrifice of all the heroes who served at #PearlHarbor. Thank you to all our World War II veterans.","date":"Tue Dec 07 18:25:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS signed the Protecting Moms Who Served Act into law! This bipartisan bill will ensure our women Veterans have the highest-quality maternal health care. So important! https://t.co/L8UpX8DjyK","date":"Tue Dec 07 13:18:39 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan automakers and families are hurting because of the semiconductor chip crisis. \n\nMy provision with @SenGaryPeters will help American manufacturers make chips here at home so that this shortage doesn't happen again.\nhttps://t.co/8ThbADYETI","date":"Tue Dec 07 00:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Moving to see our state come together to honor Oxford High School. \nhttps://t.co/ARZrc8c1oT","date":"Mon Dec 06 22:39:59 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good news! The Build Back Better Act lowers drug costs for our seniors by:\n• Stopping outrageous price-gouging\n• Allowing Medicare to begin negotiating drug prices\n• Cutting out-of-pocket spending for seniors https://t.co/1OYtYTBwuG","date":"Mon Dec 06 21:21:13 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We can't wait any longer to address the climate crisis! We've got to use every tool we have to do something about it before it's too late.\n\nFirst step is passing the Build Back Better Act. Let's get this done NOW! https://t.co/J2Sbd6JQMW","date":"Mon Dec 06 17:55:43 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #ChildTaxCredit is a transformational tax cut for working families. \n \nThe Build Back Better Act extends this tax cut so that it can continue to make a difference in the lives of Michigan children! https://t.co/RljDIhEERD","date":"Mon Dec 06 15:56:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Bob Dole was a true statesman and a patriot who dedicated his life to serving his country and the world, especially through fighting hunger. Sending my deepest condolences to Elizabeth, the Dole family, and the state of Kansas.","date":"Sun Dec 05 22:38:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you need to talk to someone about this tragedy, visit https://t.co/YyoNzCqjYq to find your local county crisis line.","date":"Sat Dec 04 16:52:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"As a mom and grandma, I've been thinking a lot about how parents in Oxford and across our state are feeling this week. I'm heartbroken for everything that you are going through.","date":"Sat Dec 04 16:52:52 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"What a beautiful tribute for four young lives that were taken too soon. \nhttps://t.co/MvdOcXEGHi","date":"Sat Dec 04 03:13:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Please know that there’s help available if you need it.\n \n@MichiganHHS is offering free mental health services for families affected by the Oxford High School shooting.","date":"Sat Dec 04 01:51:24 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you @UMichFootball, for honoring these young lives. #OxfordStrong","date":"Fri Dec 03 19:50:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"What happened at Oxford High School is devastating. No community should have to fear sending their children to school. https://t.co/o03OUQLHQi","date":"Thu Dec 02 20:41:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Absolutely devastating. My heart goes out to the entire Oxford High School community. This news is a gut punch for parents and families in our state. \n\nhttps://t.co/idrZfPNak0","date":"Tue Nov 30 20:23:36 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Child care isn't affordable. The Build Back Better Act is going to change that by lowering child care costs for families! https://t.co/Q5mHJSsQvK","date":"Tue Nov 30 17:35:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act is going to fix our supply chains, bring jobs home to America and get our economy back on track. This is going to impact every American. https://t.co/uB0UMaSB7B","date":"Tue Nov 30 14:36:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Open enrollment for 2022 Affordable Care Act plans is available at https://t.co/pHg3hnRoQl. Protect you and your loved ones and #GetCovered.","date":"Tue Nov 30 00:00:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Farmers markets spur economic development and increase access to Michigan-grown fruits and vegetables. This is a win-win for families and local food producers in Buena Vista Charter Township. https://t.co/Y1dpOfXJBI","date":"Mon Nov 29 22:42:10 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to have @SecRaimondo in Taylor today to discuss how we can fix our broken supply chains and address the semiconductor shortage.\n \nWe're laser-focused on making sure more semiconductor chips are made right here in Michigan. https://t.co/VPohBzQFco","date":"Mon Nov 29 19:26:43 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Let's do this!","date":"Mon Nov 29 16:16:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Hanukkah to all those celebrating in Michigan and around the country. I hope these next eight days are filled with love and light. https://t.co/YHkoCpxOHJ","date":"Sun Nov 28 20:46:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"What a game! What a win! Congrats to @umichfootball! B1G East Champs!","date":"Sat Nov 27 20:53:56 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Finish strong, @MSU_Football! #GoGreen!","date":"Sat Nov 27 20:16:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck to @umichfootball! Let’s #BeatOhio!","date":"Sat Nov 27 16:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Small businesses are the backbone of our economy. This holiday season, it is so important that we support our wonderful Michigan small businesses. #ShopSmall https://t.co/EEz7lxtXmN","date":"Sat Nov 27 14:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Thanksgiving! Wishing everyone a day filled with joy and gratitude. https://t.co/4WBTSyhOat","date":"Thu Nov 25 13:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act lowers drug costs for our seniors by:\n• Allowing Medicare to begin negotiating drug prices\n• Cutting out-of-pocket spending for seniors &amp; capping the cost of insulin\n• Stopping outrageous price-gouging\n \nLet's get this done!","date":"Wed Nov 24 22:25:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers are the best in the world. The Build Back Better Act is going to bring jobs back home to Michigan!","date":"Wed Nov 24 20:00:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Across the country, families and workers are feeling the impact of our broken supply chains. The Build Back Better Act is going to bring jobs home to America and get our economy back on track.","date":"Wed Nov 24 18:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Remember when R's gave a BIG tax cut to the wealthiest Americans in 2017? A tax cut that wasn’t paid for…\n\nDemocrats have different priorities. We're putting people first. Making sure the wealthy finally pay their fair share while we cut costs &amp; taxes for hard-working Americans.","date":"Wed Nov 24 16:05:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act invests in our children and families by:\n- Lowering the cost of child care\n- Providing universal preschool to every 3 and 4 year old\n- Extending the Child Tax Credit\n- Increasing access to healthy food for our children","date":"Wed Nov 24 14:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"During the pandemic, many children in rural communities couldn't study at home because they didn't have access to high-speed internet.\n \nThe new infrastructure law changes that. It brings reliable, high-speed internet to communities all across our state.","date":"Tue Nov 23 21:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act is all about lowering costs and investing in the future for our kids and our economy.","date":"Tue Nov 23 18:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Child care shouldn't cost as much as your mortgage. The Build Back Better Act will dramatically cut your child care costs!","date":"Tue Nov 23 16:50:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday, @RepDebDingell! https://t.co/n8P9BMTHYD","date":"Tue Nov 23 15:45:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Instead of paying $600 or more a month for insulin, you will pay no more than $35 a month when our Build Back Better Act becomes law. That’s huge savings!","date":"Tue Nov 23 14:24:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the #AmericanRescuePlan, 4 out of 5 people can find health care coverage for $10 or less per month.\n \nYes, you read that right. $10 or less a month!\n \nVisit https://t.co/pHg3hnRoQl today to find affordable, comprehensive coverage! #GetCovered","date":"Tue Nov 23 01:36:09 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Since @POTUS took office, we've made so much progress to build back our economy after it was shut down for over a year during the pandemic.\n \nWe've created over 5.6 million jobs and there’s still more to be done. Let's pass the Build Back Better Act!","date":"Tue Nov 23 00:24:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #ChildTaxCredit has already had an incredible impact on the lives of so many Michigan children. \n \nThe Build Back Better Act is going to extend this tax cut for working families and invest in our children!","date":"Mon Nov 22 20:02:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers built the middle class in this country. \n \nThe Bipartisan Infrastructure Law is going to rebuild the middle class and invest in our country's future!","date":"Mon Nov 22 16:48:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our service members and their families sacrifice so much to make our country a better and safer place. Thank you for your unwavering strength and dedication to our country. https://t.co/MlOVB1v0tx","date":"Mon Nov 22 00:27:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act tackles the out of control costs that people face, starting with prescription drugs and child care. Our bill puts people first and invests in our future so everyone has a fair shot to succeed. https://t.co/86YOA7xggd","date":"Sun Nov 21 16:10:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is what Thanksgiving is all about! Thank you to the Islamic Center of Detroit and Ford Memorial United Methodist Church for partnering up so families have food this holiday season! https://t.co/lZl7ah6BYA","date":"Sat Nov 20 21:05:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday, @POTUS! https://t.co/W4wTAFULLO","date":"Sat Nov 20 15:21:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Glad to have a president who’s a car guy. I’m partnering with @POTUS and @RepDanKildee to make sure the future of electric vehicle manufacturing will be built right here in Michigan!\nhttps://t.co/V6R7x762kB","date":"Sat Nov 20 15:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Every family in every community should have safe drinking water. Period. The Bipartisan Infrastructure Law makes a historic investment to replace lead water pipes. https://t.co/LUfd7q7aCF","date":"Fri Nov 19 22:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the Bipartisan Infrastructure Law, we're going to rebuild our nation's crumbling roads and bridges, make reliable, high-quality internet available in every community and much more! https://t.co/fcs6BxnUlg","date":"Fri Nov 19 18:06:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So many Michiganders get stuck with expensive car repairs because of the condition of our roads.\n\nThe Bipartisan Infrastructure Law is going to make a big difference in our ability to repair and rebuild our crumbling roads and bridges! https://t.co/AJ2Bj4W3ZA","date":"Fri Nov 19 16:29:39 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations to House Democrats for passing the Build Back Better Act. This bill puts people first by lowering costs that are out of control &amp; investing in the future for our children. Now it’s time for the Senate to get it done so @POTUS can make this help real for Americans.","date":"Fri Nov 19 15:14:25 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Bipartisan Infrastructure Law is bringing reliable, high-speed internet to Michigan so that people can do their school work, get health care and run their businesses online! https://t.co/Uc7cfdktGU","date":"Thu Nov 18 22:00:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news for Michigan workers and businesses: the Bipartisan Infrastructure Law includes my Make It in America Act. \n\nThis means Michigan manufacturers and workers will be first in line to provide products purchased by the federal government! https://t.co/KPpjirseCR","date":"Thu Nov 18 18:09:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Bipartisan Infrastructure Law makes the single-largest ever investment in the Great Lakes! The Great Lakes are part of our DNA and by funding the Great Lakes Restoration Initiative, we're going to protect our Michigan way of life. https://t.co/tq9k6TWojb","date":"Thu Nov 18 14:39:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Electric vehicles are a key part of our transportation future. Thanks to @GM and @UAW, we're putting more on the road.\n \n@POTUS, @RepDanKildee and I are working to make sure electric vehicles create good-paying, union jobs right here in Michigan. https://t.co/bt1oamHYiu","date":"Thu Nov 18 02:37:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, Rev. Greenaway, for your many years of service. Under your leadership, the WIC program has grown and evolved to continue to meet the mission of providing healthy food for our nation’s moms and babies.","date":"Thu Nov 18 00:54:37 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will create the tax incentives to build our supply chains here and bring our jobs home.","date":"Wed Nov 17 23:02:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be in Detroit with 3 leaders partnering to help create our electric transportation future. \n\n@POTUS @mtbarra @UAW https://t.co/fC5qYyBCzR","date":"Wed Nov 17 22:51:25 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If unions are good enough for them in their home countries, then they are good enough for American workers.","date":"Wed Nov 17 22:08:24 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Foreign automakers led by Toyota are fighting our efforts. It takes a lot of nerve for a foreign auto company, who receives government funding &amp; has a union labor force everywhere except in America, to fight this.","date":"Wed Nov 17 22:08:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@RepDanKildee &amp; I worked to improve the EV consumer rebate so you can use it right when you purchase a new vehicle.\n\nWe want that rebate to be used for vehicles made in America. We want you to receive a bonus if it’s made by the workers who built the middle class of America.","date":"Wed Nov 17 22:08:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The global pandemic has shown us what happens when we are dependent on parts made halfway around the world.\n \nWe need semiconductor chips made here. We need battery cells and component parts made here.\n \nAnd that’s what the Build Back Better Act is all about.","date":"Wed Nov 17 21:43:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So fun to see @POTUS driving the Hummer EV! This is the future of American-made electric vehicles. https://t.co/RicW653CMw","date":"Wed Nov 17 21:10:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Just got off Air Force One with the Michigan delegation and @POTUS! Now we're on the way to @GM's Factory ZERO in the Hummer electric vehicle! So cool! https://t.co/lRFujzkP94","date":"Wed Nov 17 20:06:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Welcome to Michigan, @POTUS! Excited to have you back to tour @GM’s new Factory ZERO — an amazing facility building the next generation of electric vehicles! \n \nInvestments like this will create good-paying American jobs while combating the climate crisis head-on.","date":"Wed Nov 17 17:56:15 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The recently passed Bipartisan Infrastructure Law includes my Make It in America Act. This makes sure American companies and workers are first in line when it comes to federal government contracts.\n\nThis is huge for Michigan workers and businesses!","date":"Wed Nov 17 15:10:25 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act: \n• Lowers costs for families\n• Cuts taxes \n• Invests in the future of our children \n\nThis is all paid for by requiring the wealthy and largest corporations to pay their fair share. Let’s get this done for Michigan families.","date":"Tue Nov 16 17:39:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I had the honor of recognizing a true Detroit &amp; American hero, Lt. Col. Alexander Jefferson today. As a Tuskegee Airman, he went above and beyond for our country. It's so fitting that this airfield was rededicated to him.\n \nHappy 100th Birthday &amp; thank you for your service! https://t.co/aDApyd7ADm","date":"Mon Nov 15 22:14:17 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"🚨TODAY is the LAST DAY🚨 \n\nIf you are a family with children and haven’t received a payment yet, visit https://t.co/xhZ5myDjln today. It’s the last day for you to sign up for this tax credit that is already improving the lives of so many families in Michigan.","date":"Mon Nov 15 21:45:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We're going to rebuild and modernize America. \n \nFrom the largest single investment ever made in the Great Lakes, to rebuilding roads and bridges, to the removal of lead pipes, to high-speed internet in every corner of Michigan, there's so much in this bill for Michigan!","date":"Mon Nov 15 20:27:09 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We will miss him and his wife, Marcelle, dearly in the Senate, but I am looking forward to continuing our strong partnership through 2022.","date":"Mon Nov 15 19:26:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"And it’s been a joy to see him on the big screen in his beloved “Batman” movies.","date":"Mon Nov 15 19:26:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s been my honor to partner with him on so many crucial issues – better access to health care, protection for workers’ pensions, support for farmers and rural communities, and healthy food for hungry families.","date":"Mon Nov 15 19:26:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"My dear friend, @SenatorLeahy, is more than just a U.S. Senator – he’s an institution. For more than 45 years, he’s been a powerful voice for Vermonters and the American people.","date":"Mon Nov 15 19:26:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Senate must pass my bipartisan Comprehensive Care for Alzheimer's Act to support those with Alzheimer's &amp; caregivers. It will create a model for innovative planning, high standards of care &amp; support for caregivers while reducing costs through better coordination.","date":"Sun Nov 14 22:02:35 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Families face unique challenges when a loved one is living with Alzheimer’s. This National Family Caregiver Month, we recognize their hard work and dedication to providing care.","date":"Sun Nov 14 22:02:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today's a great day to sign up for affordable, comprehensive health care at https://t.co/pHg3hnRoQl!","date":"Sat Nov 13 22:13:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will lower costs for families and help make sure more children get healthy meals during the school year and through the summer. Michigan families need Congress to get this done.","date":"Fri Nov 12 16:55:15 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I’m so grateful for the service and sacrifice of all our Michigan veterans. Thank you for your service to our nation. https://t.co/FaRl6ZFcBd","date":"Thu Nov 11 15:06:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act gives our farmers and foresters the tools they need to continue tackling the climate crisis. Let’s get this passed so America can lead on climate.","date":"Wed Nov 10 19:08:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I am deeply saddened to hear of the passing of my long-time friend. Kelly was an amazing woman with great spirit and talent. My heart goes out to her family.","date":"Wed Nov 10 12:27:17 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Very sad that Sen. Max Cleland has died. He was passionate about Georgia and public service – in particular, serving his fellow veterans. My heart is with his friends and family today.","date":"Tue Nov 09 21:01:31 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan fruits and vegetables are not only a source of great pride – they are also critical to our state’s economy. This investment will help Michigan farmers get their products off the farm and onto our plates.\nhttps://t.co/9guCH65cEW","date":"Tue Nov 09 17:36:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This month is Native American Heritage Month. We celebrate and honor all of the great achievements Michigan’s Native Americans have contributed to our great state.","date":"Mon Nov 08 16:20:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will tackle the climate crisis while creating good-paying jobs here in Michigan. This is a win-win for our workers, economy, and environment.","date":"Sun Nov 07 15:04:10 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The only way to end this pandemic is to get vaccinated. If you or a loved one still needs to get vaccinated visit https://t.co/kGAgAAOPJ5 to find a location near you.","date":"Sat Nov 06 22:34:49 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I am also extremely pleased that my legislation to strengthen Buy American laws is included, to ensure that American tax dollars are spent on American products and services.","date":"Sat Nov 06 03:43:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We are one step closer to President Biden signing a historic bill to rebuild and modernize America.","date":"Sat Nov 06 03:43:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"There is so much in the Infrastructure Investment and Jobs Act of critical importance to Michigan—from rebuilding roads and bridges, to the removal of lead pipes, to high-speed internet in every corner of Michigan, to the largest single investment ever made in the Great Lakes.","date":"Sat Nov 06 03:43:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Child care isn't affordable. In MI, families are spending over $10,000 a year on child care for one toddler. A family with two kids will spend 21% of their income on child care in one year.\n\n\nGood news: The Build Back Better Act is going to lower child care costs for families.","date":"Fri Nov 05 22:31:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Transitioning to a clean energy economy creates good-paying jobs for Michiganders in key industries combatting the climate crisis. We can lead in EVs, solar, wind &amp; more! That's why I led the effort to put clean energy manufacturing tax credits in the Build Back Better Act.","date":"Fri Nov 05 20:35:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We made a big step in the fight against COVID-19 this week, thanks to @POTUS. Kids age 5-11 across the country are starting to receive the COVID-19 vaccine to protect themselves, others, and to help us beat this pandemic! https://t.co/Wdk224VCaP","date":"Fri Nov 05 19:34:11 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So sorry to hear that Rep. Barbara-Rose Collins has passed away. She broke barriers as the first Black woman to represent MI in Congress &amp; spent her life standing up for Detroit’s people. She will be deeply missed.\nhttps://t.co/8MMjWzLXhv","date":"Fri Nov 05 16:43:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Things really are getting Better with Biden!","date":"Fri Nov 05 16:21:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act is going to lower the cost of the things that keep people up at night like child care, health care, home care and more.","date":"Fri Nov 05 14:43:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Families &amp; workers across Michigan are feeling the impact of supply chain disruptions. That's why I'm laser-focused on fixing our supply chain, making things in America &amp; lowering costs.\n \nGlad to have @SecRaimondo, @RonWyden and @SenSchumer as my partners in this effort. https://t.co/NnVNRoTLjk","date":"Fri Nov 05 01:38:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act is going to lower costs, cut taxes, and invest in our children. And it’s all paid for by requiring the wealthy to pay their fair share. We’re going to get this done for Americans. https://t.co/jvqeO0xbrZ","date":"Fri Nov 05 00:07:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Act will make sure that millions of Americans can receive high-quality care at home and that their care givers receive better pay and benefits.","date":"Thu Nov 04 22:22:36 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"LIVE: @SecRaimondo, @SenSchumer, @RonWyden and I are discussing what Democrats are doing to improve our supply chains and lower costs for families.\n \nTune in ⬇️ https://t.co/diUEoURRvI","date":"Thu Nov 04 17:57:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"To everyone in Michigan and across the country celebrating the Festival of Lights, I wish you a happy Diwali. https://t.co/i07qQzjg8I","date":"Thu Nov 04 16:20:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"A teacher shouldn't pay more in taxes than a billionaire. Period.\n \nThe Build Back Better Act will make sure the wealthy finally pay their fair share.","date":"Thu Nov 04 16:10:11 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So glad I got to meet with another group of extraordinary Michigan educators. I’m so proud of Henry Ford College and Dearborn area principals for stepping up and going above and beyond for their students during these difficult times. https://t.co/tADsHyGJEA","date":"Thu Nov 04 14:05:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan has the best workers in the world. \n \nThe Build Back Better Act will fix our broken supply chains and bring jobs home to America. It’s about time!","date":"Thu Nov 04 00:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The expanded #ChildTaxCredit has made a difference in the lives of one million Michigan children in a just a couple of months.\n \nThe Build Back Better Act is going to extend this tax cut for families to make sure that they can pay their bills and put food on the table.","date":"Wed Nov 03 21:52:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news from @POTUS and @CDCgov! Children ages 5 to 11 are now eligible for the Pfizer COVID-19 vaccine. Visit https://t.co/6QaB8X9JDk to protect your child and community.","date":"Wed Nov 03 20:24:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"BREAKING: Republicans in the Senate just blocked the John Lewis Voting Rights Advancement Act. The attack on our freedom to vote is happening right in front of our eyes. It’s time for the Senate to pass this bill.","date":"Wed Nov 03 19:28:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We want families to have the opportunity to choose an American-made electric vehicle the next time they buy a car.\n \n@RepDanKildee &amp; I made sure the Build Back Better Act will do just that.\n \nThis will help address the climate crisis and support good-paying American jobs.","date":"Wed Nov 03 17:13:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats are committed to making sure the wealthiest Americans pay their fair share of taxes so we can lower the costs that keep families up at night - child care, prescription drugs costs, home care and more! It’s time you get a fair shot!","date":"Wed Nov 03 16:45:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @AARP for your strong voice for seniors for so many years. Lowering the costs of prescription drugs is at the top of my list! It’s time to pass our Build Back Better Act and finally get this done!","date":"Wed Nov 03 00:27:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Big vaccine news! 70% of U.S. adults are fully vaccinated, and 80% have received at least one shot. What an incredible milestone. If you still need to get vaccinated, please visit https://t.co/kGAgAAOPJ5 to find a location near you.\nhttps://t.co/JVawm11k3O","date":"Wed Nov 03 00:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Skyrocketing drug prices hurt so many in MI, but now the Build Back Better Act lowers costs for our seniors by:\n \n• Allowing Medicare to begin negotiating drug prices\n• Cutting out-of-pocket spending for seniors &amp; capping the cost of insulin\n• Stopping outrageous price-gouging","date":"Tue Nov 02 23:26:10 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We can't afford to wait any longer on the climate crisis.\n \nThe Build Back Better Act makes the most significant investments to combat the climate crisis in our country's history. It is essential that we make real progress before it's too late.","date":"Tue Nov 02 20:47:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@SenateDems' Build Back Better Act lowers costs, cuts taxes and invests in America’s future for our children.\n\nIt's paid for by requiring the wealthiest Americans and largest corporations to just pay their fair share of taxes.\n\nIt's time to get it done!","date":"Tue Nov 02 17:33:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @chefjoseandres. Glad to have you as a partner as we work to tackle hunger and the climate crisis.","date":"Mon Nov 01 23:17:58 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today marks the start of the Affordable Care Act’s open enrollment period! If you or a loved one is in need of quality, affordable health care, visit https://t.co/DhP2vaHwD9. #GetCovered","date":"Mon Nov 01 16:47:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Every woman in our country has the right to make her own reproductive health choices.\n \nWe've got to protect #RoeVWade and pass the Women's Health Protection Act.","date":"Mon Nov 01 14:24:16 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"#HappyHalloween! Wishing everyone a spooky and candy-filled evening. 👻 https://t.co/3jQcXpxuzd","date":"Sun Oct 31 13:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I’m ready for a top 10 showdown in East Lansing! Like many, my family is divided. My son says “Go Blue” but @MSU_Football, I say #GoGreen!","date":"Sat Oct 30 14:10:16 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our farmers and foresters play a key role in addressing the climate crisis. That’s why I fought to include them in the #BuildBackBetter Act's climate provisions. Let’s get this passed so they can continue to lead on climate.\nhttps://t.co/i1eyvVGXSX","date":"Fri Oct 29 21:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Across the country, we're seeing that things are getting #BetterWithBiden! https://t.co/5Lsd2ZW8fJ","date":"Fri Oct 29 19:20:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck @Coach_mtucker and @MSU_Football in tomorrow’s game! I will be rooting for you! #GoGreen https://t.co/SltY55BUAq","date":"Fri Oct 29 17:27:17 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our Build Back Better Act lowers costs, cuts taxes and invests in the future for our children.   \n\nIt’s all about putting people first.","date":"Thu Oct 28 18:53:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So fun to be at the @CWSoftballGame tonight cheering on my colleagues and supporting @YSCBuzz to beat breast cancer! https://t.co/kB8ZSiccOq","date":"Thu Oct 28 01:11:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Go Green – Literally! Proud of @michiganstateu for protecting the planet and growing the economy at the same time. \nhttps://t.co/neS89gmA88","date":"Tue Oct 26 23:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's time to build a better future for our children by passing the #BuildBackBetter Budget. https://t.co/J3rEXRBBvd","date":"Tue Oct 26 21:38:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @RepSlotkin!","date":"Tue Oct 26 19:22:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"You are right, @POTUS. It’s time for Congress to pass the #BuildBackBetter Budget.","date":"Tue Oct 26 17:22:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Over the past year, we’ve seen harmful decisions from right-wing judges on our courts. I teamed up with @SenWhitehouse and @SenSchumer to show what’s happening to the independence of our courts. Read our report: https://t.co/ql0C3AdJkL","date":"Tue Oct 26 15:04:10 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This month, MI started the process of funding mental health care like physical health care. This is a big deal for people needing help and will change the lives of so many families. https://t.co/Po82cXGemH","date":"Mon Oct 25 01:16:11 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This National Domestic Violence Awareness and Prevention Month, we thank all the advocates and service providers and honor the strength and resilience of survivors. If you or someone you love needs help, call 1-800-799-7233.","date":"Sat Oct 23 19:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Let’s put this pandemic behind us. Visit https://t.co/kGAgAAOPJ5 to find a COVID-19 vaccination site near you.","date":"Sat Oct 23 15:00:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Health care above the neck should be funded the same as health care below the neck. My transformational mental health and addiction initiative means we are finally going to begin treating them the same.\nhttps://t.co/VrSAuWfC6K","date":"Fri Oct 22 19:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Over 61 million children have received the expanded #ChildTaxCredit since July, thanks to the #AmericanRescuePlan! This tax cut has helped families put food on the table and afford clothing and child care. https://t.co/yM9oxkhzBV","date":"Fri Oct 22 14:56:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Everyone is touched by family or friends with mental illness or addiction challenges.\n\nThis is my story: https://t.co/IW9p61xXiq","date":"Fri Oct 22 13:27:31 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #ChildTaxCredit is already improving the lives of over 1 million Michigan families! Another incredible example of how the American Rescue Plan is lifting our kids out of poverty. https://t.co/rTFvIiKL9q","date":"Fri Oct 22 00:21:59 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our teachers go above and beyond for their students every day, especially during the pandemic. \n \nI'm so proud of our @CCSSO Michigan Teachers of the Year, Owen Bondono and Cara Lougheed. Thank you for all that you've done for our children during these challenging times! https://t.co/fhRgLCu5Uf","date":"Thu Oct 21 22:16:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Instead of working to make it harder to vote, Republicans should spend more time working across the aisle to solve problems and get things done for the American people.","date":"Wed Oct 20 19:41:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Freedom to Vote Act is common sense and would protect the same kind of voting rules that Michigan voters overwhelming voted to put into Michigan law in 2018—allowing people to vote by mail and modernizing voter registration.","date":"Wed Oct 20 19:41:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"They didn’t like the outcome of the 2020 election so they’re doing everything possible to tip the scales in their direction for the next election.","date":"Wed Oct 20 19:41:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today’s vote was deeply concerning but unfortunately, not surprising. We already know that Republicans are doing everything they can to block voters from exercising their fundamental freedom to vote.","date":"Wed Oct 20 19:41:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday to my friend, @VP! I'm so proud of you! https://t.co/3ZpAytmpM2","date":"Wed Oct 20 13:42:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Right now the freedom to vote is under attack in Michigan and across our country. \n\nThe Senate must pass the Freedom to Vote Act. Our democracy depends on getting this done. https://t.co/f3axAaDlIW","date":"Tue Oct 19 21:41:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"October is #BreastCancerAwarenessMonth.\n\nThank you to the @Ford workers in Troy &amp; Plymouth who designed and made these pink masks in support of breast cancer fighters and survivors! https://t.co/tMI7XiFXWO","date":"Tue Oct 19 20:09:59 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations @SCClemons for becoming a Chevalier in France's Legion of Honor! What a wonderful distinction.","date":"Tue Oct 19 14:00:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan families know the dangerous consequences of PFAS. This news is an important step forward, but there is still more to be done to improve the health and safety of our communities, including at military installations across our state. \nhttps://t.co/Oz7ZtCAORt","date":"Mon Oct 18 21:13:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday @RepLawrence! Michigan families are lucky to have a fierce advocate like you fighting for them. https://t.co/8CsN4v1njf","date":"Mon Oct 18 18:56:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I am deeply saddened to hear of the passing of Colin Powell, who broke barriers over and over again during a lifetime of public service. He was a man of strong principles and always put his country first.\n\nMy prayers are with his family and friends.","date":"Mon Oct 18 14:29:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"ICYMI, read more about how my new initiative will expand access to mental and addiction services for Michigan families.\nhttps://t.co/FYQpelxj2R","date":"Sun Oct 17 13:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Very sad to hear Dr. Dan Benishek has passed. My heart goes out to his wife, Judy, and his entire family.","date":"Sat Oct 16 22:15:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The COVID-19 pandemic has worsened the hunger crisis for so many families across the world. This #WorldFoodDay, I am thankful for all the food heroes who work tirelessly to feed their communities.","date":"Sat Oct 16 14:00:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you had a heart attack &amp; went to the emergency room, nobody would tell you they can’t treat you because grant money ran out. Unfortunately, this happens too often to a person seeking mental health &amp; addiction services. My new initiative changes that.\nhttps://t.co/1Qu6zEBQep","date":"Fri Oct 15 19:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Certified Community Behavioral Health Clinics are a game-changer for families and communities. Here’s how they are helping: https://t.co/uA5vXuPFlc","date":"Fri Oct 15 14:52:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, Sheriff Richard Fuller! I appreciate your dedication and support as we work to ensure no person sits in jail when they really need behavioral health care services. https://t.co/Dg1E2S02G7","date":"Thu Oct 14 18:35:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Certified Community Behavioral Health Clinics change lives and communities for the better. Thank you, Karen, for sharing your story. https://t.co/GGZxJ6cYs2","date":"Thu Oct 14 16:04:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@MichiganHHS Director Elizabeth Hertel knows firsthand the importance of having comprehensive mental health and addiction services in our communities. Thank you for your partnership! https://t.co/5LwvsZHMVA","date":"Thu Oct 14 13:51:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I am heartbroken to hear the news of the passing of my dear friend, Dale Kildee. Dale and I served together in the U.S. House and I witnessed every day how much he loved working for the people of Michigan. https://t.co/H8pWG0kpU2","date":"Wed Oct 13 20:39:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"He was a wonderful man—extremely kind, generous and committed to his home community of Flint and working men and women across Michigan. My heart goes out to his beloved wife Gayle and the entire Kildee family.","date":"Wed Oct 13 20:39:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @LtGovGilchrist, for your support as we take the biggest step in decades to transform how we deliver behavioral health services. https://t.co/QDPma3FciE","date":"Wed Oct 13 18:36:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Certified Community Behavioral Health Clinics across Michigan are working for patients and our communities. No more sitting in jail or the emergency room when what you really need is mental health or addiction help. https://t.co/rRwhV69xJH","date":"Wed Oct 13 17:54:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Health care is health care - whether it is above the neck or below the neck. Here in Michigan, we are finally going to begin treating them the same. Here is how: https://t.co/aC3pzFPaD8","date":"Wed Oct 13 15:57:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Read more about how my new mental health and addiction initiative will transform how we deliver community behavioral health care to Michigan families.\nhttps://t.co/FYQpelxj2R","date":"Wed Oct 13 13:33:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"October is officially Farm to School and Agritourism Month! This month is all about increasing access to healthy local food and supporting local producers and our rural communities.\nhttps://t.co/o2QvJNTcqH","date":"Tue Oct 12 18:48:29 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Around 1 in 8 women will develop breast cancer in their lifetime. This #BreastCancerAwarenessMonth I encourage all women to get their mammograms. Early detection saves lives. https://t.co/35ZCNXQjef","date":"Tue Oct 12 16:04:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This Indigenous Peoples’ Day, we acknowledge the significant sacrifices made by Native peoples and celebrate their many ongoing contributions to Michigan and our Nation. https://t.co/zZeZ9pemYR","date":"Mon Oct 11 14:15:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan is making great progress on vaccinations! Let’s keep this momentum going and put this pandemic behind us. Visit https://t.co/U3MpEzrvpi to find a vaccination site near you.","date":"Sun Oct 10 22:57:45 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #AmericanRescuePlan in action: another $1 billion for Michigan schools!\n\nhttps://t.co/VXTcO8671y","date":"Sat Oct 09 15:47:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #AmericanRescuePlan is continuing to help communities across our country during the COVID-19 crisis and #BuildBackBetter! https://t.co/Zbs1GPn1a8","date":"Fri Oct 08 22:36:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"You’re right, @SenatorWarnock. The attack on our freedom to vote is happening right in front of our eyes. It’s time for the Senate to pass the John Lewis Voting Rights Advancement Act.","date":"Thu Oct 07 21:14:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today, the @JudiciaryDems considered their nominations and they did a wonderful job. I'm confident they're ready to serve the people of Michigan and our country with great distinction!","date":"Thu Oct 07 01:18:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Very excited about our highly qualified federal district court nominees from Michigan, Judge Jane Beckering and Judge Shalina Kumar. https://t.co/r0wyzWiYmF","date":"Thu Oct 07 01:18:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This #NationalMentalIllnessAwarenessWeek, take the time to reach out to those struggling and let them know they are not alone. If you or a loved one needs help, call 800-950-NAMI, text \"NAMI\" to 741741, or call the National Suicide Prevention Lifeline at 800-273-8255.","date":"Wed Oct 06 13:24:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This pandemic has taken a toll on so many people's mental health. That’s why I continue to lead efforts to transform how we deliver high quality community mental health and addiction services to people in every corner of our country. https://t.co/FTuWcmPemF","date":"Wed Oct 06 13:22:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Investing in electric vehicle battery research and development is key to keeping MI in the driver’s seat on the road to a clean energy future. This new @GM facility is great news!\nhttps://t.co/yNf9OYdyQY","date":"Tue Oct 05 23:15:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Fadwa Hammoud made history in 2019 when she became the country's first Arab-American Muslim Solicitor General.\n\nShe made history again today as the first Arab-American Muslim woman to argue before the U.S. Supreme Court!\n\nFadwa, you've made Michigan so proud! https://t.co/XThcNnNkKR","date":"Tue Oct 05 21:58:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you, @POTUS! @RepDanKildee and I are working hard to make sure electric vehicles create good-paying, union jobs right here in Michigan. \n \nLet’s pass the Build Back Better Budget! https://t.co/hQjxle3OY1","date":"Tue Oct 05 21:10:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So excited to join @SenGaryPeters and @MIAttyGen in congratulating Michigan’s Solicitor General, Fadwa Hammoud, the first Arab-American Muslim woman to argue a case in front of the U.S. Supreme Court! https://t.co/26ncRHRn8f","date":"Tue Oct 05 19:09:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Welcome back to Michigan, @POTUS!","date":"Tue Oct 05 15:47:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"You’re right, @markrbassett! Michigan has always been a leader in manufacturing and technology. My Solar Energy Manufacturing for America Act will make sure Michigan workers continue to lead the way to a clean energy future.\nhttps://t.co/Xtag04eMrp","date":"Tue Oct 05 14:16:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the #BuildBackBetter agenda, we're going to invest even more to make sure folks have a home.","date":"Mon Oct 04 22:10:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Quality, affordable housing is a basic human need. That’s especially true for our seniors. @PVofMI's Thome Rivertown Neighborhood and Delta Manor are making sure this is a reality. https://t.co/Ydc6vgr1sq","date":"Mon Oct 04 22:10:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Safe, affordable housing is so important every day — especially during a pandemic. @POTUS and @SecFudge understand this.\n\nOver the past year, the American Rescue Plan has helped families keep a roof over their head during this crisis.","date":"Mon Oct 04 22:10:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It was so powerful to be with Aretha Franklin’s family today as we renamed a Detroit post office in her honor. We will never forget the Queen of Soul and everything she did for the city of Detroit! https://t.co/qCdEtzwNUs","date":"Mon Oct 04 18:23:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you everyone for standing strong to protect our reproductive rights! The stakes have never been higher for women across our country! #WomensMarch2021 https://t.co/dxx2mqFWXv","date":"Sat Oct 02 18:47:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting vaccinated is not just about protecting ourselves. It’s also about protecting those around us. Visit https://t.co/kGAgAAOPJ5 to find a vaccination site near you.","date":"Sat Oct 02 18:01:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I have always said Michigan manufacturers are the best in the world. Today we celebrate them and all of the manufacturers who create products and good jobs! #MFGDay21","date":"Fri Oct 01 21:45:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats secured significant investments for community health centers through the #AmericanRescuePlan to make sure our communities are healthy and safe. https://t.co/8fKOWebpDV","date":"Fri Oct 01 20:54:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy 97th birthday to President Carter. I’ve been so inspired by his lifelong dedication to putting his faith into action.\nhttps://t.co/G0JL31Fjyb","date":"Fri Oct 01 17:32:19 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Health centers are on the front lines of the COVID-19 pandemic and have been challenged like never before. That’s why securing this funding was a high priority for me. I’m grateful for their heroic work in keeping Michigan families safe.\nhttps://t.co/lAgGj2URtg","date":"Thu Sep 30 19:53:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@UAW is right. American workers are the best in the world. We should be investing in good-paying, union jobs here at home NOT rewarding foreign companies that don’t take care of their workers!","date":"Thu Sep 30 17:12:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats, @mtbarra! @BizRoundtable will be in excellent hands under your leadership.","date":"Wed Sep 29 18:37:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Every woman in our country has the right to make her own reproductive health choices. Our report shines a bright light on how well-funded groups are using our judicial system to take away the freedom of women to make their own health care decisions. https://t.co/NxUcMTsJf1","date":"Wed Sep 29 16:10:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"A fitting tribute for such a wonderful man, role model, and friend. \nhttps://t.co/vE5pAezA83","date":"Tue Sep 28 20:56:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"From wildfires out West, to violent hurricanes, to Michigan floods, we know the climate crisis is real. The solar manufacturing bill @SenOssoff and I introduced is one key part of fighting this crisis and creating good-paying jobs at the same time.","date":"Tue Sep 28 16:58:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our decisions today directly impact our children and grandchildren. Just imagine three times as many wildfires, floods, and droughts.\n \nWe must pass the #BuildBackBetter Budget to address this crisis. https://t.co/pzEDNW6DgY","date":"Tue Sep 28 12:43:47 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Access to mental health &amp; addiction treatment services is critical to recovery. That's why I've been leading the effort with @RoyBlunt to transform the way we deliver high-quality services in our communities. This #RecoveryMonth, know that recovery is possible &amp; you're not alone.","date":"Mon Sep 27 19:13:33 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"YES!\nhttps://t.co/UkxhEFINVL","date":"Mon Sep 27 16:11:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"In MI, 1 in 7 children struggle to find their next meal. This #NationalHungerMonth it’s critical we address the child hunger crisis. Passing the #BuildBackBetter Budget does just that &amp; will allow us to provide free school meals to many more children in school &amp; over the summer!","date":"Sun Sep 26 21:36:24 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Wearing a mask and getting vaccinated are the best defenses against the Delta variant. Visit https://t.co/kGAgAAOPJ5 to find a vaccination site near you.","date":"Sun Sep 26 14:30:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"2/ I strongly support Roe v. Wade and applaud the House of Representatives for passing the Women’s Health Protection Act. The Senate should move quickly to pass this legislation.","date":"Sat Sep 25 13:15:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Read my statement on House passage of the Women’s Health Protection Act: \n\n1/ Every woman in our country has the right to make her own reproductive health choices. The Supreme Court’s decision on Texas’ harsh abortion ban was an appalling attack on these personal freedoms…","date":"Sat Sep 25 13:14:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The climate crisis has impacted every state in our country. My Republican colleagues should join us to take real action to stop this crisis NOW before it's too late. https://t.co/AMfz9fUYGT","date":"Sat Sep 25 12:49:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"With the Bipartisan Infrastructure Package and the #BuildBackBetter Budget, we're going to make huge investments to address the climate crisis! https://t.co/JjLPivXemY","date":"Fri Sep 24 23:54:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We are feeling the devastating effects of 100 years of carbon pollution accumulating in the atmosphere. It's past time for Congress to act! A clean energy economy is within our grasp to create jobs and stop the disasters we're facing!","date":"Thu Sep 23 20:25:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news for Allegan! This important investment will help revitalize our downtown, support small businesses and boost our economy. \n\nSupporting our rural communities is one of my priorities as Chairwoman of @SenateAgDems! https://t.co/BnvaGWwAYt","date":"Thu Sep 23 19:54:13 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Reality check: We can't wait any longer to address the climate crisis. \n \nIt's time to pass the #BuildBackBetter Budget before it's too late.\n https://t.co/quf8skBGRN","date":"Wed Sep 22 21:41:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Electric vehicles are a key part of our future. And I'm glad to have @POTUS as a partner to get more of them on the road!\n \nWe're going to tackle the climate crisis, boost our economy, and create good-paying jobs. This is great for Michigan. https://t.co/fTF7yUlRBK","date":"Wed Sep 22 01:42:13 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We must pass the #BuildBackBetter Budget to address this crisis now!\n\nThe costs of inaction are simply too high to ignore.","date":"Tue Sep 21 19:57:21 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Because of the climate crisis, natural disasters are becoming more destructive, dangerous and expensive.\n\nLast year, the United States set an awful record: We had 22 separate billion-dollar weather and climate disasters in a single year.","date":"Tue Sep 21 19:57:21 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We can't wait any longer. Today I released a report with @SenSchumer &amp; @SenBooker detailing the immense cost of inaction on this crisis.\nhttps://t.co/lUez6BebAH","date":"Tue Sep 21 19:57:21 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@POTUS is right: we have no time to waste when it comes to tackling the climate crisis. We must pass the #BuildBackBetter Budget and save our future.","date":"Tue Sep 21 18:48:35 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"• Lowers costs for Americans\n• Cuts taxes for families \n• Creates millions of jobs while tackling the climate crisis \n• Makes the wealthy pay their fair share\n \nThis is what the #BuildBackBetter Budget is all about.","date":"Tue Sep 21 13:33:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Millionaires and billionaires should not pay lower tax rates than teachers, mechanics, and firefighters. The #BuildBackBetter Budget ensures they will pay their fair share.","date":"Mon Sep 20 21:14:36 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"My bill with @RepDanKildee will put more electric vehicles on the road while creating good-paying jobs here in Michigan! https://t.co/djBkbq8SgU","date":"Sun Sep 19 21:58:35 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The best way to protect your loved ones from COVID-19 is to get vaccinated. Now is the time to visit https://t.co/kGAgAAOPJ5 and find a vaccine site near you.","date":"Sun Sep 19 17:20:44 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is so important. @SenGaryPeters, @RepDanKildee and I made sure thousands of children and pregnant women in Flint will keep getting critical health coverage they need.\nhttps://t.co/NuSmdi5HYH","date":"Sat Sep 18 13:44:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"ArtPrize is back! Hope you can stop by and enjoy it! Love to see so many creative, beautiful pieces of art around Grand Rapids. https://t.co/Tof9KVARd8","date":"Fri Sep 17 23:57:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to join @GRAsepticMfg today to celebrate their expansion. They are making more of the medications people need while creating good Michigan jobs! https://t.co/sWQ5HmSr1G","date":"Fri Sep 17 22:16:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Senate passed the Bipartisan Infrastructure Bill to make the largest investment in fixing our crumbling roads and bridges, tackling the climate crisis, and so much more. \n \nThis is the first step in the #BuildBackBetter agenda! https://t.co/zRADf3A64f","date":"Fri Sep 17 19:15:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you or someone you know needs help, call the National Suicide Prevention Lifeline at 800-273-8255 for free, confidential crisis counseling 24/7/365.","date":"Fri Sep 17 15:17:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The stress of the COVID-19 crisis has taken a toll on our mental health &amp; has hit our health care workers especially hard.\n\n@RepHaleyStevens &amp; I introduced a resolution designating today as #NationalPhysicianSuicideAwarenessDay, to remember all the lives we've lost to suicide.","date":"Fri Sep 17 15:17:56 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Electric vehicles are the future of innovation, and we want families to have the opportunity to choose electric the next time they buy a car.\n \nGood news - @RepDanKildee and I have a bill to do just that.","date":"Thu Sep 16 22:07:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our bill will help address the climate crisis, support American jobs, and make electric vehicles more affordable while ensuring they are built right here! This is a win-win for Michigan.","date":"Thu Sep 16 22:07:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I've driven the @Ford electric F-150 and trust me  —  it's pretty awesome.\n \nI’m not surprised so many people want this great Michigan-made truck — that just means more good-paying, union jobs! https://t.co/i9HUY5mMUT","date":"Thu Sep 16 20:20:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The incredible F-150 Lightning is being made right here in Michigan by the best autoworkers in the world.\n \nThanks to @Ford, we'll be able to make even more F-150's in our great state! \nhttps://t.co/wVfZdn35Wm","date":"Thu Sep 16 19:12:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is big. When we put America's families first, instead of the wealthy and well-connected, great things happen.\n \nWith our #BuildBackBetter Budget, we're going to do even more.\nhttps://t.co/7F8F9kF5Oq","date":"Thu Sep 16 16:50:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's #SmallBusinessWeek! Small businesses are the backbone of our communities and economy. And they have been hit hard by the pandemic. We need to support them now more than ever!\n \nMake sure you #shopsmall this week!","date":"Thu Sep 16 13:26:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We're working hard with our partners in the White House to protect our freedom to vote and to pass the #BuildBackBetter budget to lower costs for Americans, cut taxes for families, and create millions of jobs while tackling the climate crisis.","date":"Wed Sep 15 23:52:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Always great to host Michiganders for our @TheBlackCaucus event. Happy to join them in celebrating their 50th anniversary!\n \nOver the past 50 years, we've made progress thanks to the leadership and hard work of so many Black leaders. But there's still so much to do. https://t.co/de8iWqZh56","date":"Wed Sep 15 23:52:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Wishing all those observing Yom Kippur a meaningful day. https://t.co/Mj8ZAWOOkb","date":"Wed Sep 15 22:33:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Powerful moment. I continue to be inspired by the bravery and courage shown by these survivors.","date":"Wed Sep 15 16:45:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"#HispanicHeritageMonth starts today! This month we celebrate the wonderful contributions of Hispanic Michiganders to our state! https://t.co/I4dm0cp0BP","date":"Wed Sep 15 14:04:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@RepDanKildee and I are working to make electric vehicles more affordable so we can create jobs and tackle the climate crisis. This is one way the #BuildBackBetter Budget is delivering for Americans.","date":"Wed Sep 15 02:39:25 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting vaccinated is so important and saves lives. Visit https://t.co/kGAgAAOPJ5 to find a location near you.","date":"Tue Sep 14 13:47:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The #BuildBackBetter Budget is a game changer for American families:\n \n• Lowers costs for Americans\n• Cuts taxes for families \n• Creates millions of jobs while tacking the climate crisis \n• Makes the wealthy pay their fair share","date":"Mon Sep 13 23:56:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This September 11, I’m thinking of all the lives we lost 20 years ago and the families who loved them. We will never forget the first responders and military members who sacrificed so much then and continue to do so to this day. https://t.co/aB9aNNXSKG","date":"Sat Sep 11 13:03:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan businesses and workers are producing the basic materials and the important parts for solar panels and are ready to make more! This plan from @POTUS is needed to transform our future, create jobs and combat the climate crisis!\nhttps://t.co/carJ6S2CJJ","date":"Sat Sep 11 00:45:32 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Did you know the @michiganstateu mass-timber building used to be an old coal plant? Now, it represents a future where we can boost our economy and tackle the climate crisis at the same time. Once again, @michiganstateu is leading us into this future! https://t.co/EOoREuXWWD","date":"Fri Sep 10 21:03:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be back at @michiganstateu to celebrate the first mass-timber building in MI! This building is first and foremost about STEM education and teaching the next generation of leaders.\n\nI'm excited to follow these students and see how they make our world a better place. https://t.co/mq0bcmZU4V","date":"Fri Sep 10 21:03:31 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So grateful you’re OK, my friend! Thank you for sharing this important reminder not to put off health screenings, including mammograms.","date":"Thu Sep 09 19:25:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Over a million Michiganders have health care because of the #ACA. Over the past 11 years, I've talked to so many people whose lives were transformed because of our work.\n\nThe #BuildBackBetter Budget continues our commitment to lower health care costs &amp; make people's lives better.","date":"Wed Sep 08 21:44:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations Reggie! Michigan is proud of you!\nhttps://t.co/xNhchPWwJJ","date":"Wed Sep 08 12:18:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Always great to see my friends at @hotsamsdetroit! This incredible small business has outfitted Detroit for over 100 years! https://t.co/H0teDj7cQY","date":"Tue Sep 07 22:31:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Shana Tova to all those celebrating Rosh Hashanah! Wishing you a wonderful New Year. https://t.co/Mq818lWtob","date":"Mon Sep 06 21:13:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today we honor all of the hardworking men and women who have built Michigan’s and America’s middle class. Happy #LaborDay! https://t.co/zuk6RvVGyc","date":"Mon Sep 06 13:30:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"As we see the Delta variant surge across our country, it's important to make sure that you and your family are protected against #COVID19. Get vaccinated, and wear a mask. Visit https://t.co/kGAgAAOPJ5 for more information.","date":"Sun Sep 05 17:06:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you or someone you know needs help, call the National Suicide Prevention Lifeline at 1-800-273-8255 for free, confidential crisis counseling 24/7/365.","date":"Sat Sep 04 14:01:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"September is Suicide Prevention Month. Too many lives are lost every year to suicide. And we know that the stress of COVID-19 has had a huge impact on people’s mental health.","date":"Sat Sep 04 14:01:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"What a beautiful tribute to true American heroes, the Tuskegee Airmen.\nhttps://t.co/ddxXdfxY3N","date":"Tue Aug 31 20:10:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats to Laura Dickerson on your new role with @UAW! Looking forward to working with you.\nhttps://t.co/NTpiu9ogTp","date":"Tue Aug 31 13:16:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I’m praying for those in Louisiana impacted by Hurricane Ida and proud of all of the Michigan first responders who are on their way to help.\nhttps://t.co/fe7uiRmx5R","date":"Mon Aug 30 21:27:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thanks to the #BuildBackBetter agenda, we're going to lower costs for Americans, cut taxes for families, and create millions of jobs while tackling the climate crisis.\n \nAll of this will be paid for by the wealthy paying their fair share! This is going to be huge for our country.","date":"Sun Aug 29 23:25:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats to Taylor North! First Michigan Little League champs since 1959! ⚾ 🏆","date":"Sun Aug 29 21:34:18 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Today's a great day to get your #COVID19 vaccine! Visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Sun Aug 29 15:00:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats to Taylor North on your big win! Can't wait to see you beat Ohio tomorrow!\nhttps://t.co/ut6sFkrM0p","date":"Sat Aug 28 22:45:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"On the 58th anniversary of the #MarchOnWashington, I'm reflecting on MLK's powerful \"I Have A Dream\" speech and recognizing that the fight to end systemic racism in our country is far from over. https://t.co/UvtwVnXfQX","date":"Sat Aug 28 14:51:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you were impacted by the flooding in Southeast Michigan in June, you have until September 13th to apply for @fema disaster relief!\n \nCall 800-621-3362 or visit https://t.co/SHYpcABkOf for more information.","date":"Fri Aug 27 18:34:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This week, the House passed the John Lewis Voting Rights Advancement Act, putting us closer to restoring and expanding the Voting Rights Act. It’s time for the Senate to honor Congressman Lewis and pass the bill.","date":"Fri Aug 27 14:59:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I’m closely monitoring the situation. My office and I will continue to assist Americans and those who've helped our country in Afghanistan.","date":"Thu Aug 26 19:32:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Heartbroken to hear the news of U.S. service members who lost their lives in Kabul. I'm praying for their families, those who were injured and the safety of our service members &amp; Afghan allies.","date":"Thu Aug 26 19:32:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"On #WomensEqualityDay, we recognize all those who have fought hard to break barriers and resolve to keep up the fight for full equality!","date":"Thu Aug 26 13:43:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday @NatlParkService! Thank you to all the park rangers, employees and volunteers who keep our public lands in Michigan so beautiful. https://t.co/LjtZOP1Tsk","date":"Wed Aug 25 23:57:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Getting your COVID-19 vaccine helps keep you and your community safe. Visit https://t.co/kGAgAAOPJ5 to find one near you.","date":"Wed Aug 25 21:03:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Special thanks to @MichiganMilk + @fbcmich for leading the charge and joining @DepSecBronaugh &amp; me for the kickoff.","date":"Wed Aug 25 17:28:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Exciting news! @USDA is launching the Dairy Donation Program, which makes it easier for farmers to donate milk, cheese and other dairy products. This means more families will have these foods on their tables. A win-win for Michigan farmers and families!\nhttps://t.co/GobV2Pks16","date":"Wed Aug 25 17:28:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Wow! So proud of Taylor North!\n\nhttps://t.co/Ipiwz6H7lo","date":"Wed Aug 25 15:17:54 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"If you haven’t received the child tax credit, it is not too late to register and receive payments!  \n \nTo learn more visit: https://t.co/Vs5v6rbOZT.\nhttps://t.co/y7kmmWHX0G","date":"Tue Aug 24 21:29:52 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"COVID-19 vaccines are safe, free, and effective. Visit https://t.co/U3MpEzrvpi to find a vaccination site near you. #MIDoseofHope","date":"Tue Aug 24 15:08:31 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck to the 7 Michiganders representing @TeamUSA in the Paralympic Games! I know you'll make our state and nation proud! #TokyoParalympics","date":"Tue Aug 24 10:46:53 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Good luck @Chris00Hammer! Michigan is rooting for you.\n\nhttps://t.co/Fo2Qbsh9UD","date":"Mon Aug 23 21:44:21 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy Birthday to my great friend, @GovWhitmer! Thank you for all you do for the state we both love—Michigan! https://t.co/pom68c8IYn","date":"Mon Aug 23 17:52:16 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"He did it!! Way to go @MiguelCabrera! Michigan is so proud of you!! @tigers \n\nhttps://t.co/GoWp8Dzkfn","date":"Sun Aug 22 22:12:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"My deepest condolences to all of Steve’s family and friends. He was a very special man who will be greatly missed. https://t.co/QdObs04QLN","date":"Sun Aug 22 15:47:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's so important to get your COVID-19 vaccine to protect yourself and your loved ones. Visit https://t.co/kGAgAAOPJ5 to find an appointment near you.","date":"Sun Aug 22 14:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Modernizing the Soo Locks is a top priority of mine. Thanks to the bipartisan infrastructure bill and the Build Back Better Budget, we will be able to make this a reality. https://t.co/ynMEFVDpsR","date":"Sat Aug 21 20:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is great! If you're near Jackson, stop by for fresh, local fruits and vegetables!\nhttps://t.co/pADut67rD5","date":"Sat Aug 21 13:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations, Liz! I'm excited to partner with you and the @AFLCIO as we fight for American workers and good-paying, union jobs!","date":"Fri Aug 20 22:45:57 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan’s own Iron Mountain VA was ranked the #1 VA hospital in the nation this week for patient experience! It’s always great to visit and it was special to be there in person to congratulate and thank them for their dedication &amp; service to our veterans. https://t.co/0epIN9g0ch","date":"Fri Aug 20 15:50:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be back at Dickinson County Health System &amp; see the progress made after helping them secure funding. These new investments ensure great care will continue for the community. It’s exciting to see new state-of-the-art technology to diagnose &amp; treat patients close to home! https://t.co/c0IpJhpwJR","date":"Fri Aug 20 14:32:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It was great to speak with local manufacturers and tech entrepreneurs about our Build Back Better Agenda and my Make It In America Act, which ensures that our tax dollars are spent on American-made products &amp; services.","date":"Thu Aug 19 22:09:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"After helping to establish and supporting the @mtecsmartzone for so many years, it’s always great to check in and see their good work. Exciting things happening in Houghton! https://t.co/FwPtf1aOmO","date":"Thu Aug 19 22:09:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Our economy is getting better, but the semiconductor chip shortage continues to cause layoffs and hurt Michigan auto workers. @SenGaryPeters, @SenSherrodBrown and I are working to fix this shortage and get people back to work.\nhttps://t.co/rqnnSNX2P5","date":"Thu Aug 19 17:51:55 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan Tech is also leading the way with its work on cross-laminated timber. It was great to see this carbon-neutral and sustainable construction method up close. https://t.co/9j0ThtGeKj","date":"Thu Aug 19 16:28:32 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@michigantech is leading the way on innovative research on the impact of carbon pollution on clouds. \n\nTheir Pi Cloud Chamber is cutting-edge and will help us learn more about how the climate crisis affects our weather! https://t.co/9qsndoZ8QE","date":"Thu Aug 19 16:28:30 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":".@NorthernMichU is doing great work to expand high-speed internet in the Upper Peninsula and Northern Michigan and to prepare students to address cyber threats. \n \nGreat to tour this one-of-a-kind facility and hear more about these programs. https://t.co/jmkCTvlmtB","date":"Wed Aug 18 18:49:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It was great meeting with health care leaders in Marquette to hear more about their work to bring quality health care services to the UP. I'm so grateful for their work during these difficult times. https://t.co/vHPl4RhHCF","date":"Wed Aug 18 17:53:39 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Calvin Shepard of Inkster was a patriot and a barrier-breaker. I'm so glad that he and his fellow Montford Point Marines received Congressional Medals of Honor in 2012. My prayers are with the Shepard family.\nhttps://t.co/MdUuPckrsj","date":"Wed Aug 18 01:51:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Lake Superior is one of the five fastest-warming lakes in the world. At Pictured Rocks National Lakeshore today, I was able to talk to park leaders about how the climate crisis is accelerating erosion and what that means for the Lakeshore. https://t.co/2sjwAXmxu3","date":"Tue Aug 17 22:18:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's a beautiful day at Pictured Rocks! It was so great to be back at the park and talk with Park Superintendent Horne and other leaders about their record-breaking number of visitors – over 1.2 million visitors last year and growing! https://t.co/x7KwDAJReo","date":"Tue Aug 17 21:47:25 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This morning, I was at the Soo Locks reviewing the progress we have made and what more needs to be done. This project is creating hundreds of jobs and will strengthen our economy and national security for the future. https://t.co/vd3fjyAIAx","date":"Tue Aug 17 17:50:35 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Soo Locks are a crucial gateway for freighters carrying agricultural products and materials our manufacturers and military depend on. I’m leading efforts to build a new Lock to prevent disruptions of the stone, grain, iron ore and more that pass through the Locks. https://t.co/klRgrVGHE3","date":"Tue Aug 17 17:50:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s great to be in Sault Ste. Marie at the Soo Locks today!\n\nIt’s a top priority for me to modernize the Locks. Thanks to the #BuildBackBetter agenda, we’ve got the funding to do this even faster. https://t.co/MaxIrplAKW","date":"Tue Aug 17 14:30:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"For the families struggling to find enough time to prepare and share meals or afford enough nutrition for their growing kids, or the seniors on fixed incomes now navigating complicated dietary health needs, this will be a welcome improvement.","date":"Mon Aug 16 19:48:47 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This long overdue update finally takes into account the time constraints, nutritional needs, and budgets of working families in America today.\nhttps://t.co/cTnavAb5yR","date":"Mon Aug 16 19:48:46 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"So sad to learn that Rep. Paul Mitchell has died. It was an honor to work with him to protect our Great Lakes &amp; advocate for Selfridge ANG Base and our servicemen &amp; women. He was principled to the end, and my heart goes out to his wife, Sherry, their 6 children &amp; 6 grandchildren.","date":"Mon Aug 16 17:48:03 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"TODAY is the last day to sign up for health care during open enrollment! Head over to https://t.co/QH1oX182Xg to get quality, affordable health care.","date":"Sun Aug 15 12:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan’s infrastructure has been neglected for far too long. The bipartisan infrastructure bill will give us the tools we need to build a better Michigan. https://t.co/noXcbUkItl","date":"Sat Aug 14 22:51:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great article! Well deserved! Thanks for everything Ed!\nhttps://t.co/f84AYGVzE6","date":"Sat Aug 14 17:58:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Social Security has lifted millions of senior citizens out of poverty. Today marks 86 years of this life-changing legislation. https://t.co/vY1sPFWjDP","date":"Sat Aug 14 12:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news! There are now more places in Michigan to get vaccinated and tested for COVID-19.","date":"Fri Aug 13 18:17:12 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Heads up, Michigan families! The second expanded #ChildTaxCredit payments are going out today. They’re already helping families put food on the table: https://t.co/Xdg29zVEsu","date":"Fri Aug 13 16:07:38 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Thank you to all of the first responders and workers helping address the power outages across Michigan. Stay safe everyone!","date":"Fri Aug 13 14:57:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The bipartisan infrastructure bill provides historic investments for Michigan’s infrastructure and communities. https://t.co/AzrrRp70Yp","date":"Thu Aug 12 16:46:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"One thing you may have missed last night: Dems continued our work to protect the freedom to vote. Republicans blocked us from even discussing voting rights!\n \nThis isn’t the end of our work. Every American must be able to vote &amp; we will keep fighting for our democracy.","date":"Wed Aug 11 18:43:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Under the Build Back Better Budget, trips to the dentist will be covered by Medicare. It’s about time! https://t.co/GWIrvLRWX0","date":"Wed Aug 11 03:33:48 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Because of the Build Back Better Budget, for the first time, seniors will be able to get their hearing aids and glasses through Medicare! https://t.co/rYAt4rWWTn","date":"Wed Aug 11 03:07:16 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It’s time to reward work – not just wealth. It’s completely unacceptable that some of the world’s most profitable companies &amp; billionaires pay little or no taxes.\n \nThe Build Back Better Budget puts hardworking American families first. https://t.co/9UHYatHm9F","date":"Wed Aug 11 02:34:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"China is investing billions in the production of EVs &amp; clean-energy technologies. We must move quickly or get left behind. The budget will ensure that the U.S will not only compete, but lead the world’s race toward a clean energy future and bring jobs home! https://t.co/UUl1mW02wQ","date":"Wed Aug 11 01:12:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Last month, the families of 1.8 million Michigan children received a big tax cut! The Build Back Better Budget doubles down on this, resulting in one of the largest tax cuts for Americans ever! https://t.co/E9rNACnvMr","date":"Tue Aug 10 23:22:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The budget will cut costs for the things that keep Americans up at night – like child care, the price of medicine, home care and the cost of college. https://t.co/ZMkHhmgHn4","date":"Tue Aug 10 20:14:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Budget is focused on keeping historic economic growth going. And it’s a game changer for Michigan families! https://t.co/qABPBUMCEj","date":"Tue Aug 10 19:27:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Senate just passed the bipartisan infrastructure bill, and Michigan is on nearly every page! https://t.co/6NQ2fBq14B","date":"Tue Aug 10 16:45:05 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Big news! We just passed step one of the Build Back Better agenda. This bill will -\n✅Provide the single-largest investment in the Great Lakes\n✅Fix our roads &amp; bridges\n✅Make sure American tax dollars are spent on American-made products \n✅Fix our spotty internet https://t.co/g0J2kWggjl","date":"Tue Aug 10 15:57:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congratulations @Kasie! Your home state of Michigan is very proud of you!","date":"Tue Aug 10 14:31:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The Build Back Better Budget is a game-changer for Michigan families. I’m speaking right now on the ways it will lower costs, cut taxes and create millions of jobs while tackling the climate crisis. Tune in! https://t.co/jwiGeKJuEF","date":"Mon Aug 09 22:37:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"MI is receiving a 31% increase in funding to fix our highways, roads, and bridges.\n\n@GovWhitmer - you can finally fix the damn roads!","date":"Mon Aug 09 01:26:40 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many Michiganders have had to get their cars repaired because of the condition of our roads. The good news is our infrastructure bill tackles that problem. https://t.co/3PTSGAT1y7","date":"Mon Aug 09 01:26:39 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"You can't drive an electric vehicle without enough charging stations! The infrastructure bill makes charging stations convenient &amp; helps combat the climate crisis. https://t.co/Gkc0Bbik8C","date":"Sun Aug 08 23:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"ICYMI: The Senate passed my bipartisan bill to award Willie O'Ree the Congressional Gold Medal!\n \nAs the first Black @NHL player, he was a trailblazer for Americans across the country and a leader in Detroit.","date":"Sun Aug 08 21:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"No family should have to question whether their water is safe to drink.\n\nThe bipartisan infrastructure plan makes a historic investment to replace lead water pipes. https://t.co/bBWSNRTSP7","date":"Sun Aug 08 20:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The infrastructure bill makes the single largest investment yet in the Great Lakes Restoration Initiative.\n \nThis will help protect our beautiful Great Lakes by cleaning up contamination, restoring wetlands, and fighting invasive species! https://t.co/zV3kiPQ30k","date":"Sun Aug 08 19:20:29 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's not too late to sign up for health care at https://t.co/pHg3hnRoQl! You have until August 15 to find an affordable plan for you and your family. Sign up today!","date":"Sun Aug 08 19:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Access to high-speed internet is a necessity, not a luxury.\n \nThe infrastructure bill makes a big investment in high-speed internet to help people connect to healthcare, do their school work, run their small business or farm, and more. https://t.co/AHqsbzwS3i","date":"Sun Aug 08 18:18:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's National Immunization Awareness Month! There's no better time to get your COVID-19 vaccine. Visit https://t.co/kGAgAB6qAD to find a location near you. https://t.co/H9GhNOg3Cs","date":"Sun Aug 08 14:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Big news for Michigan: the bipartisan infrastructure plan includes my Make It in America Act to make sure our manufacturers &amp; workers are first in line to provide services &amp; products purchased by the federal government!\n \nThis is huge for Michigan workers and businesses! https://t.co/kjcrczns6t","date":"Sun Aug 08 00:00:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We can't wait any longer to modernize the Soo Locks. Making sure we update this aging infrastructure is crucial to keep Michigan's economy moving.\n \nThanks to the bipartisan infrastructure bill, we're making a huge investment to do this now! https://t.co/qOITuGRVHL","date":"Sat Aug 07 22:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Democrats are focused on cutting the costs that keep Americans up at night, extending tax cuts for American families and creating millions of jobs while tackling the climate crisis.\n \nAnd we're going to pay for it by making the wealthy pay their fair share. https://t.co/yGtAQ2HJyw","date":"Sat Aug 07 21:37:04 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"With the delta variant on the rise, it's important to get vaccinated. Visit https://t.co/kGAgAAOPJ5 to find an appointment near you!","date":"Sat Aug 07 18:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"8 days left to sign up for health care during @POTUS' special enrollment period! Visit https://t.co/pHg3ho8ZHT to find an affordable plan for you and your family.","date":"Sat Aug 07 15:30:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"On Purple Heart Day, we remember all those who sacrificed so much for our country. We are forever grateful for your service. https://t.co/n9vv2vd39S","date":"Sat Aug 07 13:00:02 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"You have 9 days left to sign up for affordable, comprehensive health care at https://t.co/pHg3hnRoQl! Visit today to make sure you have the coverage you need.","date":"Fri Aug 06 22:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan leading the way on electric vehicles like... https://t.co/a1uohY1E6S","date":"Fri Aug 06 20:08:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great news! Things are getting better with Biden.","date":"Fri Aug 06 17:03:29 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Yes! One million jobs is a lot. And more jobs are coming as we Build Back Better! Pass it on…","date":"Fri Aug 06 16:36:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"On the 56th anniversary of the #VotingRightsAct, we celebrate all who've fought to protect our freedom to vote. And we know this fight is far from over!\n\nIt is critical to pass our voting rights bill ASAP to make sure every American's voice is heard at the ballot box. https://t.co/JGuYTuvqdY","date":"Fri Aug 06 16:22:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It really was fun today at the White House celebrating Michigan leadership and innovation. Great to have a “car guy” as President! https://t.co/XuNIcqpnoX","date":"Fri Aug 06 01:28:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Great to be with our @VP today at the White House! So proud of you! https://t.co/tMFT3QlIni","date":"Thu Aug 05 22:25:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The world isn’t waiting on electric vehicles, &amp; neither can we. MI workers &amp; companies are leading the way to get this done!\n\nGreat to be with @POTUS &amp; MI leaders today to announce new standards that will combat the climate crisis, boost our economy &amp; create good-paying jobs. https://t.co/d0wnNYQ5IX","date":"Thu Aug 05 20:48:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"America’s working people have lost a legend. Richard Trumka knew their stories, because it was his own story. He was a vibrant leader who never stopped fighting to create good-paying jobs, keep workers safe, protect their benefits and the right to organize.","date":"Thu Aug 05 17:25:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Beyond that, he was a really wonderful person, and I will miss working with him on so many issues. My prayers and love are with his wife, Barbara, the rest of his family and the entire labor community today.","date":"Thu Aug 05 17:25:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michigan workers are the best in the world and this is their moment.\n \n@POTUS' announcement, paired with Congress' work on the Build Back Better agenda, will put people to work, lower costs for families, and tackle the climate crisis. A win-win-win for Michigan!","date":"Thu Aug 05 15:06:58 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Happy 231st birthday @USCG! There’s no better place to celebrate than in Coast Guard City USA! #SemperParatus https://t.co/ZgRlXgFpwD","date":"Wed Aug 04 22:29:50 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Katherine Nye from Berkley is truly an inspiration! At 22, she is already a silver medalist and is combating the stigma around mental health. #Tokyo2020\nhttps://t.co/CNy96ZdeQI","date":"Wed Aug 04 14:41:28 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Light the Lamp: last week the Senate passed my bill to award 🏒hockey-legend🏒 Willie O'Ree the Congressional Gold Medal! #WillieForTheGold","date":"Tue Aug 03 22:18:51 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It also invests in our Great Lakes, high speed internet, electric vehicles &amp; tackling the climate crisis. Win-win-win!","date":"Tue Aug 03 20:56:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Too many Michiganders have had to get their cars repaired because of the condition of our roads. The good news is our infrastructure bill tackles that problem.  https://t.co/sMsWAymizy","date":"Tue Aug 03 20:56:27 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"All Americans want is a fair shot to take care of their families and get ahead.\n \n@SenateDems aren't leaving until we get key things done to help them do that. https://t.co/ssdEw1owMi","date":"Tue Aug 03 18:55:26 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The @CapitolPolice work hard to protect members of Congress every day. I will always be thankful for their bravery and sacrifice on January 6.\n \nI'm honored to support this bill.\nhttps://t.co/N0UuHpv5gT","date":"Tue Aug 03 17:19:22 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Congrats @hannah_bmx1! We're so proud!","date":"Tue Aug 03 02:37:20 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Americans just want a fair shot to be able to take care of their families and get ahead.\n \nThe Build Back Better agenda is cutting their taxes and lowering the cost of the things that keep them up at night. https://t.co/NwEsy0sZ9M","date":"Tue Aug 03 02:24:23 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Heartbroken to learn that another officer who responded on Jan. 6 has died by suicide. My heart goes out to Officer Hashida’s family, friends and colleagues.\n\nhttps://t.co/6ZcGoR05VW","date":"Tue Aug 03 00:30:36 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I can't end this thread without talking about roads and bridges! This bill gives Michigan about a 31% increase in funds to rebuild our roads and bridges. It is great news for Michigan!","date":"Mon Aug 02 23:27:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Michiganders know all too well the dangers of lead water pipes and our families are still dealing with these problems today. This bill will invest billions to replace lead pipes across the country to protect our drinking water.","date":"Mon Aug 02 23:27:08 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This bill also includes my Make It in America Act, which will make sure our manufacturers &amp; workers are first in line when it comes to government contracts. It's common sense! American tax dollars should be spent on American-made products.","date":"Mon Aug 02 23:27:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"There’s $65 billion for high speed internet connections, including in small towns and rural communities. This funding will help people connect to healthcare, do their school work, run their small business or farm, and more!","date":"Mon Aug 02 23:27:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Republicans and Democrats came together to invest in electric vehicles in this bill. It will help us build charging stations across the country so it's easier for Americans to drive the great electric vehicles being made in Michigan!","date":"Mon Aug 02 23:27:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"There's SO much in this infrastructure bill that is good for Michigan. Where do I start?\n\nThere is $1 billion for the Great Lakes—the single-largest investment ever! It will combat invasive species and protect the lakes for our kids &amp; grandkids.\nhttps://t.co/ywhfa4AeAG","date":"Mon Aug 02 23:27:06 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"1,655 days after President Trump promised to rebuild our infrastructure, “Infrastructure Week” has finally begun! Thanks to President Biden and bipartisan leadership in the Senate!","date":"Mon Aug 02 13:00:52 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"This is great news for Michigan! @Ford's investment in Romulus will ensure Michigan workers lead our country's automotive future!\nhttps://t.co/YNnlQGdLuy","date":"Mon Aug 02 01:55:07 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"The bipartisan infrastructure plan and our building back better agenda are going to create jobs, cut taxes for families, and bring down costs for families. Paid for by having the wealthy pay their fair share!\n\nWe're going to be here until we get it done. https://t.co/i3xWQJpKpQ","date":"Sun Aug 01 16:52:01 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"It's Buy Michigan Week! \n \nSmall businesses are the backbone of our communities and make our state so special. Make sure you get out and support a small business this week!\nhttps://t.co/tw8HtqGCop","date":"Sat Jul 31 18:00:00 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"We've got to fix the weaknesses in our supply chains that are hurting Michigan workers &amp; businesses.\n\nThe good news: the Senate passed my long-term fix for our semiconductor shortage and @RepDebDingell introduced it in the House- let’s get this done!\nhttps://t.co/i4pDbIM1jb","date":"Sat Jul 31 14:35:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Carl Levin was bright, kind, and tenacious all at the same time.\n \nHe was courageous and strong when it came to standing up for consumers and families. He was loved by so many in the Senate and Michigan.","date":"Fri Jul 30 22:24:34 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"Carl loved everything about Michigan, from the lakes to the dunes to Detroit’s neighborhoods. It was an honor to be his partner representing our great state for 14 years in the Senate. https://t.co/s46UN7oklx","date":"Fri Jul 30 21:11:16 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"I learned so much by watching Carl Levin in the Senate.\n \nI will miss my mentor, role model and friend. https://t.co/m2XwZrZE4T","date":"Fri Jul 30 19:44:41 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"For 56 years, #Medicaid and #Medicare have provided millions of Americans with the health care they need. This is a great American success story!\n \nThank you President Johnson and Democrats for bringing Americans affordable, comprehensive health care. #56Covered https://t.co/cU38hCd0Az","date":"Fri Jul 30 16:48:42 +0000 2021","user_id":"76456274"},{"handle":"SenStabenow","text":"My statement on the passing of my friend Senator Carl Levin: https://t.co/hyeJjL07aK","date":"Fri Jul 30 01:59:05 +0000 2021","user_id":"76456274"}]