[{"handle":"SenToddYoung","text":"Good news today - My bill with @SenDuckworth to provide TSA Pre√® to disabled veterans just passed the Senate. This is long overdue.\nhttps://t.co/aZdgjq3K9P","date":"Thu Jun 16 21:34:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @BloombergTV to discuss the situation in Ukraine and the national security imperative of passing my legislation to help the U.S. outcompete and out-innovate the Chinese Communist Party. https://t.co/zTnfeBAAcb","date":"Thu Jun 16 19:27:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must not allow the presumptions of exposure that are extended under this legislation to overwhelm the VA system. The VA must be provided with the resources necessary to prevent any veteran covered under this legislation from waiting for care.","date":"Thu Jun 16 18:42:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I voted for legislation that will provide new and important benefits to thousands of veterans who have been exposed to toxic substances. It includes authorization for a new medical lease in Lawrence, IN to help better serve our Hoosier veterans. \n\nhttps://t.co/UEPaRbiqiq","date":"Thu Jun 16 18:42:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"When this bill becomes law, oversight will be essential. It was only a few years ago that veterans were dying on waitlists, unable to access VA health care.","date":"Thu Jun 16 18:42:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to everyone who attended this week’s Hoosier Huddles in DC. Fun to see some familiar faces and make new connections. https://t.co/2bUjPNkwqg","date":"Wed Jun 15 21:39:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We have an urgent national security imperative to get my bipartisan #USICA bill across the finish line. As @BillGalston writes in today’s @WSJopinion, this is “America’s best chance in decades to boost domestic innovation and manufacturing...\"\n\n https://t.co/1XijoxVvWC https://t.co/htP10FWgNJ","date":"Wed Jun 15 18:27:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"NEW: The bipartisan #EmergencySavingsAct I introduced with @CoryBooker passed the Senate HELP Committee yesterday. Our bill will help Americans better save for emergencies and preserve retirement savings.\n\nhttps://t.co/tmiIVog8aa","date":"Wed Jun 15 17:12:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Israel continues to position itself as a key player in the global energy market by agreeing to export natural gas to Europe for the first time. This is a milestone as Europe moves away from dependence on Russia while deepening ties w/ the State of Israel.\n\nhttps://t.co/VRWGt1RIhG","date":"Wed Jun 15 16:40:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Yesterday, I joined @WOWOFORTWAYNE to discuss 40-year high inflation rates and steps we need to take to ease the burden for Hoosiers families.\n \nListen here🔽 https://t.co/ZOabdsYU95","date":"Wed Jun 15 13:49:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good news: Bipartisan legislation I co-sponsored &amp; voted for in the Senate, the Ocean Shipping Reform Act, passed the House and will now be signed into law. It will help Hoosier farmers and retailers move their products to market in a more timely manner.\n\nhttps://t.co/U6kgU2HX2H","date":"Tue Jun 14 20:28:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Since President Biden took office, gas prices in Indiana have more than doubled and continue to reach historic highs.\n \nIt’s time to take real action to lower prices and unleash American energy. https://t.co/yJvkfMRXqF","date":"Tue Jun 14 16:31:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Since 1777, the Stars and Stripes have united Americans and represented our freedoms at home and around the world. #FlagDay https://t.co/2pMRRAdXYX","date":"Tue Jun 14 14:29:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy 247th Birthday to the @USArmy. \n\nWe are grateful for every Soldier who has defended our nation. https://t.co/D77QdqY0pF","date":"Tue Jun 14 12:30:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to Keagan Rothrock of Roncalli High School on being named Gatorade National Player of the Year. #WorldSoftballDay \n\nhttps://t.co/xRzmeDHWXg","date":"Mon Jun 13 18:14:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week, we celebrate the 247th birthday of the @USArmy.\n \nDuring WWII, an Army manufacturing plant in Clark County provided critical support to the war effort and employed thousands of Hoosiers. #MarkerMonday https://t.co/KefZQkSVN0","date":"Mon Jun 13 15:24:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I fought hard against OMB’s proposed change to MSA designations, which would have excluded several Indiana cities from this important designation. Changing this definition without consulting those impacted is misguided.  \n\nhttps://t.co/cX31spWf64","date":"Sat Jun 11 14:01:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is now at a 40-year high, hitting 8.6% in May.  \n \nOver and over, we’ve been told by this administration that it is “transitory,” but every day, Hoosiers are facing a damaging, hidden tax due to President Biden’s unrestrained fiscal and monetary policies. https://t.co/V5hKQ5gtPO","date":"Sat Jun 11 12:49:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to my friend Dr. Mung Chiang on this well deserved opportunity. I look forward to partnering with you. \nhttps://t.co/qCL9gQPlmR","date":"Fri Jun 10 17:49:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As one of America’s most innovative college presidents, Mitch Daniels has made a lasting impact on higher education in Indiana and the nation. We are grateful for his leadership at @LifeatPurdue.","date":"Fri Jun 10 17:49:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation rose 8.6% over the last year, the largest price hikes in 40 years. Rising prices are felt most by working families and those on fixed incomes.\n\nThis is the direct result of policy choices by Washington Democrats. \nhttps://t.co/RReVuHtLo6","date":"Fri Jun 10 14:50:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Early childhood education is fundamental in the development of students.\n \nThanks to members of the @ECEConsortium for sharing insights on how we can best support children, families, and providers. https://t.co/2Za8bwYQqg","date":"Fri Jun 10 13:13:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Read more about my efforts to expand child care options for Hoosier families here: https://t.co/aLC9AsnRRd","date":"Fri Jun 10 13:13:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"One of several steps we can take to protect students &amp; teachers is allowing schools to repurpose unspent COVID funds to keep everyone safe.\n\nThe Safe Schools Act would permit shifting these already available resources toward important security measures.\n\nhttps://t.co/bBAq32risz","date":"Thu Jun 09 20:19:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We have a national security imperative to get #USICA across the finish line. It must remain a priority. https://t.co/SC7giKpun5","date":"Thu Jun 09 19:11:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This training accident is a tragic reminder of the risks our Marines face everyday as they serve our nation. I join their families in mourning their loss. Their service and sacrifice will not be forgotten.","date":"Thu Jun 09 19:00:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"With #SummitoftheAmericas starting this week, I joined a bipartisan resolution to deepen economic relations with Latin America and the Caribbean by relocating global supply chains.","date":"Thu Jun 09 13:03:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"China, Russia, &amp; COVID have demonstrated the significant threats facing our global supply chains. Partnering with allies in our own hemisphere &amp; here at home to build the economy of the future will reduce these risks and bolster our national security.\n \nhttps://t.co/26Hsj0GUOt","date":"Thu Jun 09 13:03:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Started off my day with Hoosiers visiting Washington, D.C. during our Hoosier Huddle. https://t.co/IplZogPe2b","date":"Wed Jun 08 22:22:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last year, my #DRIVESafeAct became law. This program will address the truck driver shortage, provide career opportunities, &amp; make roads safer. \n\nToday, in @SenateCommerce, I pressed our @FMCSA nominee on the agency’s commitment to the program &amp; reducing our truck driver shortage. https://t.co/qDJjivmlYS","date":"Wed Jun 08 20:08:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As evidenced by the high number of recent missile tests by the Kim Regime, the Biden Administration needs a more comprehensive, coherent strategy for dealing with the threat of a nuclear North Korea.\n\nRead more about my discussion on North Korea here 🔽\n\nhttps://t.co/2EJbucVsIp","date":"Wed Jun 08 19:17:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I met WWII veteran, Ralph, and his brother, George, who served in the Vietnam War.\n\nIt was an honor to spend time with these brothers and the many Hoosier veterans who traveled to D.C. with Honor Flight Northeast Indiana.\n\nWe are grateful for their service and sacrifice. https://t.co/mNpVAmIZaB","date":"Wed Jun 08 17:09:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to @IHCATweet members for the discussion this morning on legislation affecting long-term care in Indiana and the workforce shortage in this critical industry. https://t.co/lK3AbolrcA","date":"Tue Jun 07 22:07:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Once again, another record high for gas prices. Today, the average gallon of gas is 15 cents higher for Hoosiers than it was yesterday.","date":"Tue Jun 07 21:53:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"With the Chinese Communist Party threatening Taiwan, securing our supply of semiconductors is of vital importance to our national security. We need to pass my #USICA legislation in order to make critical investments in homegrown chips manufacturing.\n\nhttps://t.co/L9RetrnQ1v","date":"Tue Jun 07 20:01:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed seeing students from Delphi Community Schools during their DC trip. https://t.co/edACLl4reb","date":"Tue Jun 07 19:15:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I led a resolution with @SenSherrodBrown to recognize June 6th as CASA/GAL Volunteers’ Day.\n\nToday, we honor these advocates across the country for their life-changing work with children experiencing abuse or neglect.\n\nhttps://t.co/JIEjILuJ1a","date":"Mon Jun 06 23:41:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Gas prices continue to soar for Hoosier families, reaching an average of $5 per gallon. To take real action and lower prices, we need more domestic energy resources right now and to incentivize production for the future. https://t.co/3Rdj5Pqi2q","date":"Mon Jun 06 22:04:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I visited @NotreDame today to celebrate the opening of two research facilities that will contribute to our economic and national security future. https://t.co/eLJnOfTkBJ","date":"Mon Jun 06 20:26:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana’s research universities, business community, and state government have come together to create a hypersonics corridor, ensuring our state is a leader in this cutting-edge technology. https://t.co/p0Gtfn9YPs","date":"Mon Jun 06 20:26:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"78 years ago today, the Greatest Generation landed on the beaches of Normandy altering the course of World War II. On #DDay, we remember their bravery, selfless service, and commitment to freedom. https://t.co/ygqFMLJjWP","date":"Mon Jun 06 13:57:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"On May 27, a new historical marker for Eagle Cotton Mill was designated in Madison. The mill began production in the 1880s and shipped goods via the Ohio River. Last year, the revitalized mill reopened as a hotel and conference center. #MarkerMonday https://t.co/NostxDqUtT","date":"Mon Jun 06 13:01:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined with @SenJackyRosen on a bipartisan bill to help ensure medical devices are protected from cyberattacks and used safely and securely in order to reduce risks and vulnerabilities for patients.\n \nhttps://t.co/Vo5ivzNgdv","date":"Fri Jun 03 16:54:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Medical devices are increasingly connected to the Internet or other health care facility networks to provide features that improve the ability of health care providers to treat patients.","date":"Fri Jun 03 16:54:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Gas prices are at record highs across the nation and there is no relief in sight.\n\nIt’s time to unleash American energy.\n\nhttps://t.co/7y6bbONYlz","date":"Thu Jun 02 19:42:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"America is almost entirely reliant on other nations for high-tech computer chips that power our smart phones, automobiles, household appliances, and military platforms. U.S. semiconductor production, once accounting for nearly 40% of the world’s supply, has dropped to just 12%.","date":"Thu Jun 02 16:03:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is a very real economic and national security vulnerability. My #USICA bill would increase American research and development in domestic semiconductors, artificial intelligence, quantum computing, robotics, cybersecurity, and hypersonic technology.\n\nhttps://t.co/LMYug6RwnD","date":"Thu Jun 02 16:03:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Gas prices continue to soar in Indiana and across the country. It’s time to unleash American energy to help bring down the price at the pump. https://t.co/YaUbQsQxYe","date":"Wed Jun 01 21:28:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Read👇a bipartisan message from @GovHolcomb &amp; @GovWhitmer on why Congress needs to pass my #USICA legislation. This critical bill will bolster domestic chips manufacturing and bring new cutting-edge jobs to Indiana.\n \nhttps://t.co/eGcoIquT9d","date":"Wed Jun 01 14:09:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Americans are facing a severe housing supply and affordability crisis.\n\nI led a bipartisan group of lawmakers with @SenatorBennet urging @USTreasury &amp; @IRSnews to finalize a new rule to support expansion of affordable housing:\n\nhttps://t.co/bacBAe87H7","date":"Tue May 31 20:52:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am proud to join my fellow #Marines in Congress to reinforce our support for #ForceDesign2030. @CMC_MarineCorps is right over the target with his vision for the future.\n \nhttps://t.co/w4aIQBZbjz","date":"Tue May 31 19:20:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Last week, I joined @Indiana_EDC’s Global Summit in Indianapolis to share how my #USICA bill will help the U.S. outcompete and out-innovate China through critical national security investments, including regional tech hubs. https://t.co/C6MfhplaCY","date":"Tue May 31 17:43:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today we honor those who made the ultimate sacrifice so we can be free. #MemorialDay https://t.co/5exfJ0yEK2","date":"Mon May 30 11:20:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to @IMS on another great race and to @Ericsson_Marcus and @CGRTeams on winning the 500 in an exciting finish.","date":"Sun May 29 20:31:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fun to stop by @IMS during Carb Day. Looking forward to a great race tomorrow. https://t.co/TrrXaMWair","date":"Sat May 28 16:20:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @Indiana_EDC’s Global Summit in Indianapolis this morning to discuss the national security imperative of incentivizing domestic semiconductor manufacturing and how my #USICA bill will help. https://t.co/dK4fZMRu8K","date":"Fri May 27 19:55:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana continues to position itself as a leader in domestic semiconductor ecosystem. Congratulations to @LifeAtPurdue on creating a new Semiconductor Degrees Program. #USICA","date":"Fri May 27 18:11:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This Sunday is the 106th running of the Indianapolis 500, and another chapter in Indy history will be written. Whether you are at @IMS , watching at home, or listening on the radio, I hope you enjoy this year’s race. https://t.co/Wrpl9JGKvh","date":"Fri May 27 13:02:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: @LillyPad plans to invest $2.1 billion to build two manufacturing sites in Lebanon, creating 500 jobs. Great to see this long-time Hoosier company expanding at home.\n\nhttps://t.co/RWb63l16qX","date":"Thu May 26 23:06:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Charles Garrigus of Gibson County paid the ultimate price during the Korean War and never returned home to Indiana. This Memorial Day weekend, we honor Sergeant Garrigus and all those gave their lives in service to America. https://t.co/b1lktRxAik","date":"Thu May 26 18:07:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Unexpected expenses can cause families to dip into their retirement savings. I joined with @SenBooker to introduce a bill that would help create stable emergency savings for unforeseen expenses, keeping retirement accounts intact.\n\nRead more here 🔽 https://t.co/jfLxsuPCHA","date":"Thu May 26 14:26:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I pressed @Rob_Malley on why the Biden Administration trusts Iran in light of today’s @WSJ reporting on Iran’s extensive noncompliance with the JCPOA. https://t.co/2CGclsn5DL","date":"Wed May 25 20:40:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Judge Pryor is a public servant of the highest caliber. Her legal experience &amp; expertise would make her an asset to the 7th Circuit. I look forward to introducing Judge Pryor to my colleagues &amp; supporting her nomination once it comes to the Senate floor.\n\nhttps://t.co/g92eX7rNYQ","date":"Wed May 25 19:20:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It was a privilege to spend time with Hoosier veterans who traveled to Washington with Honor Flight Northeast Indiana. We are grateful for their service and many sacrifices. https://t.co/sTd0ZIm5EP","date":"Wed May 25 18:20:42 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am deeply saddened by the horrific shooting today at an elementary school in Uvalde, Texas. Our nation mourns the innocent lives taken in this senseless tragedy.","date":"Wed May 25 00:30:59 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The transatlantic alliance has never been more crucial to global security &amp; stability. The addition of these two important allies to NATO will ensure the alliance’s resilience and readiness, &amp; we look forward to welcoming Sweden and Finland to NATO. https://t.co/yAO2lx5mke","date":"Tue May 24 21:10:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @BloombergTV to discuss the baby formula shortage affecting Hoosier families and why Congress must pass my #USICA bill to outcompete the Chinese Communist Party. https://t.co/hTwfyJ3VJV","date":"Tue May 24 20:25:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana has the workforce, expertise, and business environment needed to attract projects like Stellantis’ new battery plant with Samsung.\n\nhttps://t.co/M5EjOGo6GZ","date":"Tue May 24 19:39:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must continue to invest in frontier technologies to create more opportunities for future workers. Congrats to state and local leaders for making this happen.","date":"Tue May 24 19:39:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Powerful evidence released today by @VoCommunism &amp; @adrianzenz revealing the horrors occurring in Xinjiang. These are nothing short of modern day concentration camps masquerading as “vocational training centers.” #XinjiangPoliceFiles #BeijingBehavingBadly https://t.co/dIIxB5BXm5","date":"Tue May 24 15:03:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @wane15 to discuss my Yes In My Backyard Act, which will help solve our housing affordability crisis by increasing transparency around local zoning and land use policies across the country.\n \nRead more here🔽\nhttps://t.co/z5IT2AIspl","date":"Mon May 23 20:47:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m glad the court made the decision to keep #Title42 in place for now, but @POTUS is appealing, meaning his Administration will waste even more time &amp; taxpayer dollars pursuing this disastrous plan. \n\nWe must keep #Title42 in place if we want to secure our southern border.","date":"Mon May 23 18:58:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Title 42 is one of the best tools our border enforcement has to stem the tide of illegal immigration. It is no surprise that the Biden Administration met bipartisan opposition when it threatened to end #Title42.","date":"Mon May 23 18:58:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Indiana Racing Memorial Association dedicated this marker in Shelbyville to honor Wilbur Shaw, a native Hoosier and three-time Indy 500 winner. Following World War II, Shaw helped rescue the speedway and served as @IMS president. #MarkerMonday https://t.co/vQRGTogi8z","date":"Mon May 23 12:30:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our police officers on the front lines make sacrifices every day to keep Hoosiers safe.\n \nDuring #NationalPoliceWeek, several legislative proposals that I cosponsored in support of Indiana’s law enforcement community advanced in the Senate. https://t.co/pbUMA4EuE9","date":"Sat May 21 20:37:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We are grateful for our law enforcement officers.","date":"Sat May 21 20:37:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Americans are struggling to buy groceries, pay for record high gas prices, and find baby formula, and now the Biden administration says it needs $2 billion because of its own decision to unnecessarily lift Title 42.\n\nhttps://t.co/YygKpHaUq0","date":"Fri May 20 19:44:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I also commend the individuals and families in Indiana and across our country who provide safe and loving homes to foster children.","date":"Fri May 20 16:02:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I helped introduce a resolution recognizing #NationalFosterCareMonth to raise awareness about the challenges foster youth face and express my commitment to supporting those in foster care.","date":"Fri May 20 16:02:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As President Biden visits Asia, it is crucial that he emphasizes the need to support Taiwan’s defense and build upon the lessons learned from Ukraine. Together we must deter China’s aggression toward Taiwan. \n\nhttps://t.co/UPnvZRnrrY","date":"Fri May 20 14:12:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined with a group of colleagues to express our opposition to DHS’s Disinformation Governance Board and urge that any funding for such board be prohibited in the FY 2023 appropriations bill.\n\nhttps://t.co/ZMl7FE23Xc","date":"Fri May 20 12:58:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed a few minutes with @KelleySchool Physician MBA students at the Capitol yesterday. https://t.co/m8iMwVwUbb","date":"Thu May 19 16:02:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed coffee and conversation during this week’s Hoosier Huddles. https://t.co/BzHxfmtI3Q","date":"Thu May 19 14:30:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The United States is facing a global challenge from the Chinese Communist Party.\n \nI discussed why passing #USICA is critical to ensuring the U.S. leads the world into the future. @fdd\n\nWatch: https://t.co/dOmM8ZN2xM https://t.co/dVKCT2Ugmx","date":"Thu May 19 13:29:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @foxnewsradio to discuss America’s growing inflation crisis and how to bring down rising costs.\n \nListen here --&gt; https://t.co/ETajhuTPDa https://t.co/FrO2E9GMpD","date":"Wed May 18 21:35:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, DHS announced that it is pausing its proposed Disinformation Governance Board. This pause should be permanent. https://t.co/RWpyp2A2We","date":"Wed May 18 20:22:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Another mother made a life-saving decision to use the Carmel Safe Haven Baby Box and help another baby find his forever home. @SafeHavenBox1\n \nhttps://t.co/ND1aebKbyM","date":"Wed May 18 15:39:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As Russia’s invasion of Ukraine continues, we must stand with the Ukrainian people. Today, I met with members of the Ukrainian Parliament. \n\nAs they fight for their country, it was good to discuss our partnership and what reforms are necessary to enable their future security. https://t.co/Rm4xQ0DUl7","date":"Tue May 17 22:18:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"If President Biden lifts #Title42 next week, these record numbers will only go higher.","date":"Tue May 17 17:36:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party is not a partner or merely a competitor. The CCP is an adversary who manipulates the rules to grow its power and influence.\n\nI spoke about how my #USICA bill will hold China accountable &amp; reinforce America’s global leadership.\n\nhttps://t.co/dOmM904DWm https://t.co/cC0sx0q9PJ","date":"Tue May 17 16:54:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited with Southport Mayor, Jim Cooney, to hear how the city is expanding housing opportunities and supporting local law enforcement. https://t.co/bQSpySkhE5","date":"Mon May 16 20:57:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"American leadership in science and technology is vital to out-competing and out-innovating China. My #USICA bill will ensure the U.S. is leading the world into the future.\n \n@LTGHRMcMaster said it best – we need to “work together and get this darn thing done.” https://t.co/izotTvb7Op","date":"Mon May 16 15:27:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"If under a national security waiver, what is the justification? If it is alleged that groups have changed their conduct, where is the evidence of that?","date":"Mon May 16 14:30:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Why is the Administration delisting Terror Groups that have targeted our Spanish, Japanese, Israeli, and Egyptian allies? \n\n@SecBlinken must answer for this. https://t.co/95csPpuOgJ","date":"Mon May 16 14:30:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As practice begins this week for the Indy 500, we remember Hoosier entrepreneur and visionary Carl Fisher, who co-founded @IMS and served as the track’s president from 1909 to 1923. #MarkerMonday https://t.co/TR4J2qculz","date":"Mon May 16 12:56:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @LTGHRMcMaster in a conversation hosted by @FDD to discuss how we can leverage American innovation to counter the Chinese Communist Party and advance our national security. https://t.co/B34bJ7Baw5","date":"Fri May 13 20:30:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed my visit with 8th graders from @HTCS_Saints in Jasper this week. https://t.co/6rktEmFULO","date":"Fri May 13 20:02:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Charter schools promote innovation &amp; excellence in public education, including throughout the state of Indiana. \n\nThe Senate passed a bipartisan resolution I helped introduce that celebrates the students, parents, teachers, &amp; leaders of charter schools during #CharterSchoolsWeek","date":"Fri May 13 18:48:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we debate this next round of significant funding for Ukraine, I look forward to working with my colleagues to ensure the bill accomplishes precisely what Hoosiers expect.","date":"Fri May 13 15:06:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Without audit requirements, reports to Congress, and diligent oversight, American tax dollars could be squandered. I also strongly support proposals to appoint a special inspector general to oversee U.S. assistance to Ukraine.","date":"Fri May 13 15:06:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our support to Ukraine must not be governed by emotions and blank checks, but must be tailored – in accordance with our own economic resources and appropriate guardrails to ensure the support is used effectively and accounted for.","date":"Fri May 13 15:06:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Like all Hoosiers, I continue to be inspired by the heroic resistance of the Ukrainian people in the face of Russia’s invasion. \n \nWhile this war of aggression could end tomorrow if Putin decided to change course, tragically, he seems set on continuing this fight.","date":"Fri May 13 15:06:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must support the Ukrainian people not only to repel Russia, but also to demonstrate our resolve that authoritarians – whether in Moscow, Beijing, Tehran, or elsewhere – will never be permitted to unilaterally redraw borders as they see fit.","date":"Fri May 13 15:06:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke during today’s first conference committee meeting on my #USICA bill to outcompete the Chinese Communist Party.\n\nWe have a national security imperative to ensure that we continue to lead the world in the development of cutting edge technology. https://t.co/mtyCZpfYqK","date":"Thu May 12 21:03:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wish I could have attended in-person but great to join the annual RV Industry Power Breakfast in Elkhart this morning. The benefits of the RV industry spread to every corner of Indiana and across our country. https://t.co/CrbaEI0ZzD","date":"Thu May 12 17:42:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden administration’s energy policies are hurting Hoosiers at the pump. To take real action and lower gas prices for Hoosier families, we need more oil supply right now and to incentivize production for the future.","date":"Thu May 12 14:48:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed meeting with @indianastate President Deborah Curtis. Go Sycamores! https://t.co/tdiwq6Gcu3","date":"Thu May 12 12:52:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fun visit with over 100 students and staff from @SSCRaiders in Middletown this morning. https://t.co/595D36nNZs","date":"Wed May 11 19:43:11 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fentanyl coming through our southern border is affecting all ages, all backgrounds, and all Indiana communities.\n \nOne essential step we should take to help with this crisis and support our law enforcement officials? Secure the border. https://t.co/NKbo5xVSvP","date":"Wed May 11 17:41:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s #NationalPoliceWeek.\n \nI want to thank the brave men and women in blue, who put themselves at risk daily to serve and protect others.\n \nTo our entire law enforcement community, please know you have my support and gratitude. https://t.co/MAeP5yJHO7","date":"Wed May 11 15:28:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Looking forward to joining tomorrow.","date":"Tue May 10 22:22:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tomorrow, the Senate will vote on a bill to block states from protecting the unborn &amp; enshrine late-term abortion into federal law.\n \nAs Americans, we believe in the dignity &amp; value of every human person. We must ensure mothers &amp; unborn children are cared for, loved, &amp; supported. https://t.co/nClVEmRW7Q","date":"Tue May 10 21:53:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Since President Biden took office, prices have risen faster than wages, leaving the average family with less purchasing power. An example is the rising cost of travel.\n\nI'll continue to oppose White House proposals that further increase prices.\n \nhttps://t.co/kGLXqr4Pi4","date":"Tue May 10 20:08:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inspired by the passion for science shown by Hoosier students like the middle schoolers at @sycamoreschool. You will help lead the future.","date":"Tue May 10 18:57:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"\"Improving American statecraft should begin with an audit of the institutions that formulate and implement policy.\" This is why I applaud @CMC_MarineCorps visionary plan for future of the @USMC. https://t.co/F70CGn2Idp https://t.co/iWvnSngQTt","date":"Mon May 09 21:39:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I met Billy and James Ward in Martinsville. Their father, PFC William Ward, earned a Bronze Star fighting in the Pacific Theater in WWII, but the medal was lost long ago. My office helped replace that medal. https://t.co/hhr0GfBlGV","date":"Mon May 09 19:08:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Obtaining medals is one of many services we provide for Hoosier veterans. Visit https://t.co/fBH1AV0jLc if you or a loved one needs assistance.","date":"Mon May 09 19:08:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My friend @WFPChief is sounding the alarm. We must get the port of Odessa opened to move Ukrainian wheat to the world. Failure to do so will lead to the starvation of millions around the globe. An attack on Odessa is an attack on the world.","date":"Mon May 09 16:28:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In May, we celebrate Indiana’s racing heritage. Salem Speedway, located in Washington County, has challenged many of the nation’s best short track drivers since 1947. #MarkerMonday https://t.co/xKbkD5n8OC","date":"Mon May 09 12:46:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wishing a very happy #MothersDay to my mom, my wife Jenny, and all mothers across Indiana. We celebrate you today! https://t.co/cNWjw6ZdjE","date":"Sun May 08 12:29:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fun to spend time with students from St. Richard’s Episcopal School in Indianapolis during their DC trip this week. https://t.co/hXTr55KlLn","date":"Fri May 06 21:07:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Met with the Turkish Ambassador @HMuratMercan to discuss NATO’s response to the Russian invasion of Ukraine and the enduring threat posed by Iran. https://t.co/EmcOPGODNA","date":"Fri May 06 16:51:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I know the entire family makes sacrifices when someone serves in uniform. Thank you to military spouses for sharing your loved ones with our country and for all you do to support your spouse and the military. #MilitarySpouseAppreciationDay https://t.co/g0j1XaTYBJ","date":"Fri May 06 15:41:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"94 percent of Americans say they are upset or concerned about inflation.\n\nRising prices are the direct result of policy choices made by Democrats. We need to go a different direction.\n \nhttps://t.co/njHsFURVDg","date":"Fri May 06 13:22:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed meeting with @PresidentFeller of @WabashCollege this morning. https://t.co/sEUc1Hk8nO","date":"Thu May 05 21:19:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I kicked off my morning by visiting with Hoosiers during my weekly #HoosierHuddle.\n \nWe try to hold these on Wednesdays when the Senate is in session. \n\nMore information here: https://t.co/LyTRlAUghA https://t.co/rPM8For34h","date":"Thu May 05 21:03:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"May is Military Appreciation Month. Thank you to all our men and women in the Armed Services. https://t.co/deTjgibxcm","date":"Thu May 05 17:54:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to Hoosier members of the @ACEPNow for meeting this week to discuss issues facing Indiana emergency physicians.","date":"Thu May 05 16:37:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must not lose out on innovation and production to China.","date":"Thu May 05 13:45:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We cannot compete with China without robust domestic R&amp;D.\n\nLast night, in a bipartisan vote, the Senate passed a motion I sponsored with @SenatorHassan to restore incentives for long-term R&amp;D investment &amp; expand the refundable R&amp;D tax credit for startups &amp; small businesses. https://t.co/DDJ6wMcgYE","date":"Thu May 05 13:44:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Skilled trade workers are integral to Indiana’s economy. Today, we celebrate the critical contributions of Hoosiers employed in a skilled trade. #NationalSkilledTradesDay https://t.co/uYpg8IFctY","date":"Wed May 04 22:54:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to @IndianaREALTORS for the discussion on the current state of the housing market, zoning and land use policies, and other issues affecting our 16,000 Hoosier realtors and the many current and future homeowners they assist. https://t.co/RQ3YDLHXp6","date":"Wed May 04 21:49:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As @MarcoRubio and I requested in March, the SEC is investigating @DidiGlobal. Good. We need more action protecting Americans from Chinese surveillance and unfair business practices.\n\nhttps://t.co/0WYHqg0SUy","date":"Wed May 04 20:50:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"94% of Americans say they are upset or concerned about inflation. Rising prices are the direct result of policy choices by President Biden and Washington Democrats. https://t.co/c3cRB9rnyK","date":"Wed May 04 20:29:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I will continue to support efforts to help those in the foster care system find the safe, loving, and permanent homes they deserve.","date":"Wed May 04 17:06:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the Senate, I’ve joined efforts to protect foster youth and ensure they are placed in the best settings based on their life circumstances. I’ve also worked to help those facing abuse or neglect receive the advocacy and support they need.","date":"Wed May 04 17:06:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"May is #NationalFosterCareMonth and, in Indiana, more than 15,000 children are currently in foster care. I recognize the challenges these foster youth face and am committed to supporting these young Hoosiers.","date":"Wed May 04 17:06:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed visiting with students from Holy Cross Lutheran School in Indianapolis during their trip to Washington. https://t.co/cL0MWgwQZy","date":"Wed May 04 15:39:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The idea that a “disinformation board” of unelected government bureaucrats should enforce speech rules is both radical &amp; unconstitutional. Hoosiers shouldn’t have to answer to a govt bureaucracy when exercising their First Amendment right to free speech.\n\nhttps://t.co/5dBKDU3orR","date":"Tue May 03 20:33:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m committed to standing for life and supporting pregnant women.","date":"Tue May 03 18:10:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I do believe that Roe v Wade was wrongly decided, and that the American people should be able to decide, through their elected officials, what our laws are when it comes to protecting life and protecting women.","date":"Tue May 03 18:10:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m awaiting the official decision by the Supreme Court. A leak like this is unprecedented, and we need to ensure that Supreme Court justices are not subject to intimidation.","date":"Tue May 03 18:10:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s time to pass the #USICA so we can harness the incredible talent across our country, not just Silicon Valley.\nhttps://t.co/V8X0TJLHcF","date":"Tue May 03 17:47:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Caroline from Whitley County &amp; Jonathan from Marion County assisted our D.C. staff with daily activities &amp; special projects. We’re grateful for their hard work on behalf of Hoosiers. https://t.co/oO5OIEAK5g https://t.co/4zs4qZhVMk","date":"Mon May 02 16:51:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Each semester my office welcomes Hoosier students who are eager to learn more about the legislative branch and serve Indiana. This spring internship class was no different. https://t.co/6cA7b2aC8i","date":"Mon May 02 16:51:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party continues its aggressive attempts to acquire U.S.-based technology, particularly for semiconductors. \n\nThe Biden Administration must use the tools Congress has given it to protect our country from these subversive efforts. https://t.co/nz10tOIOPX","date":"Mon May 02 15:42:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The month of May is a special time in Indiana. First held in 1911, the Indianapolis 500 is known worldwide as The Greatest Spectacle in Racing. @IMS hosts the event annually on Memorial Day weekend, and the 106th running is May 29. #MarkerMonday https://t.co/DAHkxFFhZ4","date":"Mon May 02 13:05:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I always enjoy visiting with @JeromeAdamsMD","date":"Sat Apr 30 21:52:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Had a blast at the annual @LifeAtPurdue Fish Fry https://t.co/GlACTpsfzA","date":"Sat Apr 30 16:44:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I appreciate the work the Indiana Barn Foundation is doing to preserve our Hoosier farm history. https://t.co/I1nJUW3X8G","date":"Fri Apr 29 18:08:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Community health centers play a critical role in Indiana. Thanks to @NACHC for the Distinguished Community Health Center Advocate Award. My legislation to extend current telehealth flexibilities offers Hoosiers continued access to quality care they’ve come to rely on. https://t.co/sUeMS3LULh","date":"Fri Apr 29 14:29:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"New 📄: Sent a letter to @SecBlinken to engage with Lebanon in support of free, fair &amp; transparent elections.\nhttps://t.co/pJzZOUd8Gl https://t.co/fQSVMxB07T","date":"Fri Apr 29 13:47:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Spoke at today’s @medicaldevices annual meeting on critical issues impacting medical device manufacturers in Indiana and provided an update on my #USICA legislation. https://t.co/gGrw6YWmq1","date":"Thu Apr 28 21:42:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to East Tipp Middle School’s Sharita Ware on being named @CCSSO’s Indiana Teacher of the Year. Your passion for shaping the next generation of Hoosiers is inspiring. #NTOY22 https://t.co/eHrvfZ6t1H","date":"Thu Apr 28 21:04:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to Elkhart Mayor Rod Roberson and community leaders for sharing updates on several local issues, including housing and workforce training. https://t.co/Eu5L5tky2Q","date":"Thu Apr 28 19:38:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Nice to meet you and go @Pacers!","date":"Thu Apr 28 13:08:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our weekly #HoosierHuddles are back. Nice to visit with Hoosiers from Lafayette, Indianapolis, Lawrenceburg, and more this morning. https://t.co/aXbpVgMIQX","date":"Wed Apr 27 21:31:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden Administration needs to do what a bipartisan majority of United States senators is now calling for – keep Title 42 in place and secure our border. https://t.co/2vzfZspVFA","date":"Wed Apr 27 19:24:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It was a privilege to greet an Honor Flight from Northeast Indiana today in Washington. The service and stories of these 85 veterans is truly inspiring, and we are grateful for each of them. https://t.co/8S1nvWgKor","date":"Wed Apr 27 16:09:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Productive meeting with the Korea International Trade Association on keeping the U.S.-Korea alliance strong and working together to advance technology innovation. https://t.co/XwnAdsbAsB","date":"Tue Apr 26 23:03:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our goal in Ukraine should not be a slow defeat. Our goal should be ensuring Ukraine wins this conflict. @TheLeadCNN @jaketapper https://t.co/KhC4zRThtR","date":"Tue Apr 26 22:00:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited with @IHAConnect members from across our state, including @Reid_Health, Rush Memorial Hospital, @ParkviewHealth, and @SchneckMed. Thanks for sharing insights about your hospitals and how we can better protect the health of Hoosiers. https://t.co/o3qIzT2S1x","date":"Tue Apr 26 16:59:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is an important step that sends a message both to our Ukrainian partners and Vladimir Putin – the United States isn’t going anywhere and Kyiv is worth protecting.","date":"Tue Apr 26 00:09:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Assaults on police officers continue to rise, &amp; departments across the country are struggling to fill open positions. If we turn our back on prevention efforts &amp; supporting law enforcement officers, violent acts are bound to happen. We must support our law enforcement community.","date":"Mon Apr 25 21:52:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosier abolitionist &amp; businessman Levi Coffin &amp; his wife Catharine provided food, clothing, &amp; shelter to fugitive slaves. They helped thousands escape to freedom &amp; the Coffin home in Wayne County was known as the \"Grand Central Station of the Underground Railroad.” #MarkerMonday https://t.co/LNtDrVm5zz","date":"Mon Apr 25 17:49:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today we celebrated the investiture of Zachary Myers as US Attorney for the Southern District of Indiana. I’m grateful for his service and his commitment to justice in Indiana. @USAttyMyers https://t.co/SAoHpusg6z","date":"Mon Apr 25 15:22:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Elkhart area is the nation’s best job market among metro areas with fewer than a million residents, according to @WSJ annual rankings. \n\nhttps://t.co/97BtygssDE","date":"Mon Apr 25 12:45:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great event yesterday in Evansville to help veterans in the Tristate area. \n\nHuge thanks to @RepLarryBucshon, @SenatorBraun, and their teams for partnering on this joint event. \n\nIf you couldn’t make it, feel free to contact my office for more information. https://t.co/I5o2uS46RV","date":"Sat Apr 23 15:17:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Authoritarians continue to make up false narratives to justify their aggression. Taiwan is a sovereign nation and a critical partner. #StandWithTaiwan","date":"Thu Apr 21 19:24:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Exciting news today for Bloomington and the surrounding region. \n\nCatalent is expanding its operations and will hire more than 1,000 new employees. Indiana’s life sciences industry continues to grow. https://t.co/qnaKfAPIk9","date":"Thu Apr 21 19:00:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My bill is a sensible option to make strides in child care access and quality, while being cognizant of the fiscal challenges facing our country.\nhttps://t.co/C8iDHibNEu","date":"Wed Apr 20 17:15:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is the highest monthly total in over 20 years. \n\nThe Biden Administration has created a de facto open Southern Border, which is taxing our Border Patrol and threatening the safety and security of our nation.","date":"Wed Apr 20 14:50:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Read my @thehill op-ed on why the U.S. Innovation and Competition Act is critical to American leadership in the 21st century.\n \nhttps://t.co/d1fp7lTfX3","date":"Tue Apr 19 18:58:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must be clear-eyed about the threats China and Russia pose to America and our allies. A great power struggle is underway. \n\nIf we fail to prepare for it or build a plan to win it, America will forfeit the future.","date":"Tue Apr 19 18:58:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Reminder: Next week, I’ll be hosting a virtual #AcademyDay for Hoosier students interested in the U.S. Service Academies. More information here: https://t.co/QrRFJYgjpj","date":"Tue Apr 19 17:44:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I've pressed the Biden administration for over a year to take this threat seriously and be transparent with the American people. \n\nRather than downplay these numbers, now is the time to secure the border.","date":"Tue Apr 19 15:13:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":".@CBP apprehended at least 23 people in our terrorist database crossing the southern border last year. Others may have passed through undetected. https://t.co/DEQAj2wWQc","date":"Tue Apr 19 15:12:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Located in Clark County, this sign marks the site of Fern Grove, a popular amusement park more than a century ago. Later renamed Rose Island, the resort entertained 135,000 annually at its peak. #MarkerMonday https://t.co/SfY2qlBqV4","date":"Mon Apr 18 18:45:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s #NationalParkWeek and a great time to celebrate the Hoosier state’s first National Park. @IndianaDunesNPS is not just a state treasure, it’s a national treasure as well.","date":"Mon Apr 18 15:54:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is a great example of the private sector pitching in to address our workforce housing shortage. https://t.co/25pGhi30cV","date":"Mon Apr 18 13:05:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the crisis at the southern border worsens, terrorists crossing the border is a growing concern. We must have consistent and accurate information to ensure the U.S. is positioned to counter any threats from terrorism. https://t.co/BxIQlhUT3n https://t.co/m22slv9FXL","date":"Tue Mar 23 15:26:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@IndianaDunesNPS has officially become our state’s first National Park. I was proud to take part in the ribbon cutting last week in northwest Indiana. https://t.co/rR3Fczytp9","date":"Mon Jun 03 16:58:58 +0000 2019","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wishing you a blessed and restful day with family and friends. Happy Easter! https://t.co/l7Tz0LHHMj","date":"Sun Apr 17 12:04:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today I join with fellow Christians in reflecting on the ultimate love and sacrifice of Jesus Christ. May it be a meaningful day for all Hoosiers observing Good Friday. https://t.co/3WQpgUWa25","date":"Fri Apr 15 18:23:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’ve introduced bipartisan legislation to require @HUDgov to identify and address lead contamination at the source to protect communities in Indiana and across the country. https://t.co/OrLXgWZCT0","date":"Thu Apr 14 20:08:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Families in federally-assisted housing shouldn’t have to face the threat of lead contamination in their drinking water or homes.","date":"Thu Apr 14 20:08:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I extend warm #Vaisakhi greetings to my Hoosier Sikh friends and neighbors who are celebrating. We should also pause to remember the eight individuals—four of whom were Sikh—who were killed one year ago tomorrow in the mass shooting at the FedEx Ground facility in Indy.","date":"Thu Apr 14 18:57:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Reminder: On April 28th I’ll be hosting a virtual #AcademyDay for Hoosier students interested in the U.S. Service Academies. More information here: https://t.co/Q19dZ0hgB1","date":"Wed Apr 13 16:03:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"For years, I have advocated for @122fighterwing to be authorized to move forward with its desire to transition from the A-10 to the F-16. \n\nI will be aggressively advocating for this to be preserved in the upcoming NDAA and Appropriations process. https://t.co/S4nR9HmQyx","date":"Wed Apr 13 13:34:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The predominant theme of the Biden Presidency has been skyrocketing costs that are squeezing the budgets of every single American. This is not the Putin Price Hike, it’s the Biden Budget-Buster. https://t.co/dTksCOI9Nh","date":"Tue Apr 12 19:31:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Read my op-ed ⬇️","date":"Tue Apr 12 19:05:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited with students at @IUBloomington’s Helene G. Simon Hillel Center. I proudly stand with the strong Jewish Hoosier community against antisemitism. https://t.co/dUhpcwaPw2","date":"Tue Apr 12 16:50:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The president came into office promising a \"longer and stronger\" deal with Iran, but this is weaker and shorter. \n\nRead why we need to reject this proposed agreement here: https://t.co/FIrj3hvuFj","date":"Tue Apr 12 12:59:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This sign in Goshen marks the site where Howard Hawks lived as a child. Hawks is recognized as one of Hollywood’s most accomplished film directors. #MarkerMonday https://t.co/qjDoEfyspe","date":"Mon Apr 11 20:11:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited Charlestown to present a Bronze Star to Specialist Gary Prather for his meritorious service in Vietnam. We are forever grateful to all our Vietnam veterans. https://t.co/EgGFZWqplD","date":"Mon Apr 11 19:11:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Had a great conversation with the folks at One Southern Indiana about how to supercharge the local economy with #USICA and address lingering supply chain and inflation concerns. https://t.co/rFaZ93CMh9","date":"Mon Apr 11 17:33:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I look forward to working with my colleagues to ensure the final #USICA legislation reflects the Senate bill and secures American leadership for decades to come. https://t.co/dlfyivxJaY","date":"Mon Apr 11 16:55:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Outgrowing, out-innovating, and outcompeting China by unleashing the talents of American innovators and workers in all parts of the country is a national security priority.","date":"Mon Apr 11 16:55:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"“The 23 nations that voted with Russia included the usual suspects Cuba, North Korea, Syria, Iran, Belarus—and China.” #BeijingBehavingBadly\nhttps://t.co/DEXcfzcDds","date":"Sat Apr 09 16:38:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Capitol building is opening back up, and I enjoyed visiting with Hoosiers from Zionsville, Carmel, and South Bend this week. Thanks for stopping by and saying hello. https://t.co/NYhfj23yU5","date":"Sat Apr 09 14:44:42 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#OpportunityZones serve as a critical tool to create jobs, revitalize neighborhoods, and lift Hoosiers out of poverty. \n\nI helped introduce a new bill to build upon previous efforts to invest in these communities and strengthen transparency: https://t.co/XOgv3LxrQ1","date":"Fri Apr 08 17:07:42 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We are proud to display it in our office.","date":"Fri Apr 08 15:28:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to @IUMcKinneyDean Karen Bravo and Vice Dean Mike Pitts for sharing updates on @IUMcKinney school and its students. https://t.co/Osi816VE2A","date":"Fri Apr 08 14:46:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Spoke with the @MedicalAlley’s Board of Directors this week about the initiatives I’m working on – including the#PASTEURAct to create antibiotic-resistant medication &amp; the #USICAChina competition bill – as we consider the future of healthcare and innovation. https://t.co/cLBjkgxWrs","date":"Fri Apr 08 13:10:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to @Fopstate, @IndyFOP86, @INSheriffAssn, @IVFA_Online, @TOS_Mitchell, @911VoiceIsBest, @MHAofINDIANA, @PFFUI, @BartholomewCou6, @ispa1974, @IndianaEMS &amp; more for the Hoosier support.","date":"Thu Apr 07 20:41:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our first responders put their lives on the line every day to ensure the safety &amp; security of Hoosier families. \n\nHow I’m working to increase the resources for public safety officers dealing with job-related post-traumatic stress disorder: https://t.co/c9W5dunRRO","date":"Thu Apr 07 20:41:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to @nstayellowbuses for the School Bus Champion Award. My Stop for School Buses Act, signed into law last year, will help keep our kids safe on the way to and from school. https://t.co/Wm8VP8SVex","date":"Thu Apr 07 16:45:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Baby boxes are saving lives across Indiana and giving mothers a place to turn. Thanks to all those who support the baby box movement. @safehavenbox1\nhttps://t.co/sjAKdufbVF","date":"Thu Apr 07 14:59:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"There’s growing bipartisan support for keeping Title 42 in place and securing our border. \n\nI urge @POTUS to heed the warnings coming from members of his own party.  \nhttps://t.co/OofvY6YlGa","date":"Thu Apr 07 12:21:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Appreciated an update from the @ToyotaIndiana team today. I was pleased to learn more about their partnerships with school districts and commitment to providing job opportunities for Hoosiers. https://t.co/QlwQAGrvSc","date":"Wed Apr 06 20:18:59 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fun to spend a few minutes with students from St. Charles Middle School in Bloomington this afternoon. Hope you enjoy the rest of your time in DC. https://t.co/HDRXN5dA4Y","date":"Wed Apr 06 19:02:11 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Met with Scott Brand of Subaru of Indiana for an update on their operations in Lafayette &amp; efforts to continue expanding their Hoosier workforce. \n\nDiscussed the impact of the global semiconductor shortage on the auto industry &amp; the pressing need to increase domestic production. https://t.co/hNxwuiNYOn","date":"Wed Apr 06 13:00:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today I met with Indiana Adjutant General Dale Lyles and members of @INGuardsman to discuss issues affecting them and our national security.\n\nIt’s vital they are equipped with the resources necessary to continue supporting our state and nation. https://t.co/sm004Vfdn3","date":"Tue Apr 05 22:16:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed meeting with Taiwan’s Representative to the U.S. @bikhim this morning. Taiwan is on the frontlines of Chinese aggression in the Indo-Pacific, and I’m proud to stand in support of this important ally both today and in the future. https://t.co/17oPeIPzeu","date":"Tue Apr 05 19:46:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The need to crack down on the #CCP is apparent. \n\nJoined @KeithJKrach at @cpa_tradereform’s conference to talk about how my China competitiveness bill will accelerate our growth in technology &amp; manufacturing so the U.S. can lead the 21st century. #USICA https://t.co/4msCa6pWhh","date":"Tue Apr 05 18:34:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"On #GoldStarSpousesDay, we honor and thank the surviving spouses of our fallen service members. \n\nWe are forever grateful for the ultimate sacrifice made by those who wore the uniform and the families who keep their legacy alive. https://t.co/FJJuWF2fy1","date":"Tue Apr 05 17:51:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s time for Putin to be tried for his war crimes. https://t.co/H9dDVXnBYV","date":"Mon Apr 04 20:23:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The images that emerged from Bucha over the weekend are horrific. Putin and his forces who committed these abuses are the embodiment of pure evil. These atrocities are almost unspeakable, but they must be called out to ensure that this evil does not continue.","date":"Mon Apr 04 20:23:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Despite warnings from both Republicans and Democrats about a surge in border crossings if Title 42 is lifted, the Biden administration announced it is eliminating one of the last remaining tools in our toolbox to stem the tide of illegal immigration.","date":"Mon Apr 04 18:38:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Lifting the Title 42 order, which has been an important backstop over the last two years, ties the hands of our hard-working border patrol agents and makes their jobs even more difficult. \n\nhttps://t.co/aUG6nnPheE","date":"Mon Apr 04 18:38:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Elwood Haynes was a brilliant Hoosier inventor and pioneer in Indiana's automobile industry. \n\nOn July 4, 1894 in Kokomo, Haynes conducted a test run of his “Pioneer” machine, one of the first fully operational vehicles powered by a gasoline-engine. #MarkerMonday https://t.co/4qeZ8QlK9M","date":"Mon Apr 04 14:44:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m open to speaking with any of these generals who disagree with the direction our Corps is heading.","date":"Fri Apr 01 21:34:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is the wrong decision and will only exacerbate the already out-of-control crisis we have at our southern border.","date":"Fri Apr 01 17:38:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"After carefully reviewing Judge Jackson’s judicial record and statements, I will be a no vote when her nomination comes to the Senate floor. https://t.co/a3a2EgI3VW","date":"Fri Apr 01 15:13:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m proud to be an original cosponsor of the Ocean Shipping Reform Act, which passed the Senate today. This bipartisan bill will address shipping delays and protect Indiana exporters from unfair practices.","date":"Thu Mar 31 21:37:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to receive the “True Blue” award from @FRCAction for supporting pro-life and pro-family policies in the Senate. I will continue to support legislation that affirms these values on behalf of Hoosiers. https://t.co/RhSXGF2dkq","date":"Thu Mar 31 20:27:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our Border Patrol agents can only do so much. We need to give them the resources to do their jobs. Yet the budget released by @POTUS this week shifts money away from border protection and cuts – by 25 percent – the number of beds at ICE detention centers. https://t.co/OP1E3jN7j1","date":"Thu Mar 31 15:01:08 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My heart goes out to those killed in this week’s horrible terror attacks in Israel. 11 people killed in three attacks in eight days. \n\nI condemn these senseless attacks. \n\nhttps://t.co/HBf6pLIkhm","date":"Thu Mar 31 14:08:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Data is one of our most valuable commodities, we must ensure it is protected and not exploited by authoritarians in China or Russia. https://t.co/p1NJ6p7Ug9","date":"Wed Mar 30 21:06:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @marcorubio in a letter to @SecBlinken, @SecDef, and @SECGov about the risks posed by ride-hailing firm @DidiGlobal’s links to the Chinese Communist Party. https://t.co/oytW7pKkCN","date":"Wed Mar 30 21:06:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"U.S. Border Patrol anticipates that the U.S. will soon reach one million encounters since October 2021 with illegal immigrants crossing our southern border. \n\nThat’s more than the entire population of Marion County. \n\nWe must address this growing crisis. https://t.co/WHLruEwQXr","date":"Wed Mar 30 19:49:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I enjoyed welcoming Hoosiers in Washington to our first in-person #HoosierHuddle in over two years this morning. https://t.co/syZiMDA1zv","date":"Wed Mar 30 17:06:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The role of a Supreme Court justice is to interpret the law as written and uphold the Constitution. This is what I am considering as I evaluate Judge Jackson’s judicial record and philosophy.","date":"Wed Mar 30 16:39:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Restoring comity to the Supreme Court confirmation process is in our national interest. Every nominee to our nation’s highest court deserves a thorough and fair vetting, and I am approaching this process with the seriousness it deserves.","date":"Wed Mar 30 16:39:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning, I met with Judge Ketanji Brown Jackson, the President’s nominee to the United States Supreme Court. I appreciated Judge Jackson taking time to share about her background and answer my questions. https://t.co/O93AW7aSqz","date":"Wed Mar 30 16:39:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to receive a Khata, a Tibetan welcome scarf, during my meeting with leaders from #Tibet &amp; the Representative of @DalaiLama. \n\nWhether in Bloomington or Washington, I’m always proud to stand with Tibet in the face of aggression by the #ChineseCommunistParty. #FreeTibet https://t.co/tvrFYTSXIf","date":"Tue Mar 29 21:37:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My new bill will help to address the shortage of mental health providers in schools. This is critical for the safety, well-being, and academic performance of Hoosier students. https://t.co/wghdaOX5rT","date":"Tue Mar 29 18:42:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"On #VietnamVeteransDay we pause to remember and thank our Vietnam War veterans and their families. Our nation remains deeply grateful for your service and sacrifice. https://t.co/Tyv2RWi1MV","date":"Tue Mar 29 17:31:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Glad to see #USICA move forward last night with a strong bipartisan vote in the Senate of 68-28. As we get closer to beginning a formal conference on this important national security bill, let’s maintain the urgency to get this finished and to the President’s desk.","date":"Tue Mar 29 14:52:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The budget proposal released yesterday by @POTUS ignores inflation, overspends, and fails once again to prioritize our national defense. \n\nThe economic policies pursued by this Administration are failing the American people, and Hoosiers are paying the increasingly high price. https://t.co/1OWs90yiT6","date":"Tue Mar 29 13:28:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke on the Senator floor about the life and legacy of my friend Ray Lindsey of Mitchell. One of the most selfless people I have met, Ray donated a kidney and saved another man’s life in 2014. Ray passed away yesterday after a courageous battle with cancer. https://t.co/qDa1LJFuOU","date":"Mon Mar 28 21:36:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Grace Julian Clarke studied at @butleru and was a leader in the women's suffrage movement. Clarke advocated for Indiana’s 19th Amendment ratification and co-founded the Woman’s Franchise League. #MarkerMonday #WomensHistoryMonth https://t.co/h7GTdlj5GX","date":"Mon Mar 28 20:20:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to all who supported this project and helped honor one of the greatest teams in Indiana basketball history. #MarkerMonday","date":"Mon Mar 28 19:08:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Gimmicks won’t solve high energy costs or bring down the price at the pump. \n\nThe only real and lasting solution is to support American energy production. https://t.co/pG2fK6hMhl","date":"Sat Mar 26 20:10:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Another reason to root for the Boilers tonight. We continue to think about the family and friends of Capt. Tomkiewicz.","date":"Sat Mar 26 00:08:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Two auto plants in Indiana are idling due to the chip shortage. \n\nWe must pass #USICA to safeguard our workers and our economy from global disruptions and stay ahead of the Chinese Communist Party by making investments at home. https://t.co/CUjKeCUm6S","date":"Fri Mar 25 17:49:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"New 📄: I asked @SecBlinken to help unite Ukrainian children going through the adoption process with their American adoptive families. \n \nRegardless of where they are within the adoption process, protecting vulnerable children should remain a top priority.\nhttps://t.co/9KD3mvi06V https://t.co/WgGFxqDOFF","date":"Fri Mar 25 14:34:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to meet with 4-H members from Indiana and learn about their projects. I am always impressed with their leadership skills and knowledge of agriculture, technology, robotics &amp; much more. https://t.co/1kqYfvRjFh","date":"Thu Mar 24 18:31:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Dr. Madeleine Albright served our country at a pivotal moment in American history. Her remarkable accomplishments were a testament to both her endurance and bravery. Dr. Albright's legacy will hopefully guide aspiring diplomats and scholars for generations to come.","date":"Thu Mar 24 14:42:40 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Russia invaded Ukraine one month ago. \n\nThe courage and resilience of the Ukrainian people and President Zelensky have inspired the world. \n\nWe should continue to provide Ukraine with the tools necessary to prevail. https://t.co/1j61PnJlyQ","date":"Thu Mar 24 13:16:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined with @SenatorTimScott and @SenatorBurr to introduce a bill that would expand child care options for families. Parents should have maximum choice in selecting child care and preschool providers.\n\nhttps://t.co/aLC9AsnRRd","date":"Thu Mar 24 12:55:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"High gas prices are affecting every Hoosier family. Rather than gift card governance, we should increase American energy production to help bring down the price at the pump. https://t.co/ZI5JTpX9x8","date":"Wed Mar 23 20:31:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Grateful to @MarineDelivers for this award and for their advocacy on behalf of the Great Lakes economy. Ensuring the year-round flow of goods on the Great Lakes is vital to Indiana and the United States, and we must ensure the Coast Guard is prioritizing this critical mission.","date":"Wed Mar 23 17:42:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"IRS customer service has hit an all-time low and Hoosiers deserve better. See my column in the @SBTribune about the steps I am taking to help.\nhttps://t.co/xJxMhcGeUl","date":"Wed Mar 23 15:15:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"NEW 📄: I sent a letter to @SecYellen requesting that @USTreasury provide an update on the status of the Social Security and Medicare Trustees Reports. My constituents deserve timely information about these programs, as required by the law. https://t.co/Vzq6gD6QyS","date":"Tue Mar 22 20:13:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Over the weekend, we lost the founding member of the Congressional Young Caucus. @RepDonYoung served the state he loved for decades and was a tireless advocate for Alaska. He will be missed. #ForeverYoung https://t.co/GTguuUtvMb","date":"Tue Mar 22 15:27:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Removing the Iranian Revolutionary Guard’s designation as a terrorist group and unfreezing its assets would be like pouring gasoline on a fire. Iran will use these additional resources to foment terror around the world. https://t.co/4cIg8FX6aG","date":"Tue Mar 22 15:04:38 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Agriculture contributes an estimated $31.2 billion to Indiana’s economy each year. Today, we celebrate #NationalAgDay and recognize the hard work of Hoosier farmers and producers. https://t.co/CllyTgKpIJ","date":"Tue Mar 22 12:22:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks @SecRaimondo for inviting me to join this important bipartisan discussion with national security leaders from previous Administrations. We have a national security imperative to ensure we don’t fall behind China in our technological innovation.","date":"Mon Mar 21 22:00:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tonight’s vote is the next procedural step for #USICA which preserves U.S. leadership in emerging tech &amp; prevents China from prevailing. To my colleagues, join me in voting to advance the bill and let’s work to improve the final product in a conference committee.","date":"Mon Mar 21 21:03:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#Madison native Irene Dunne appeared in 42 films, was nominated for five Academy Awards, and was named a Kennedy Center Honors awardee in 1985. #MarkerMonday #WomensHistoryMonth https://t.co/RS04RAOH31","date":"Mon Mar 21 18:23:59 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you @SecBlinken for making this designation. For years, I've worked with @HolocaustMuseum to call for this to occur as the Rohingya have suffered unspeakable abuses at the hands of the Burmese military. It's now time to ensure those responsible are held accountable.","date":"Mon Mar 21 16:31:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good to catch up with State Treasurer Kelly Mitchell last week to talk about how #INvestABLE Indiana accounts help Hoosiers with disabilities. https://t.co/l6Vs92JPtx","date":"Mon Mar 21 14:09:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We mourn the loss of four Marines who tragically perished during a training exercise in Norway, including Capt. Matthew Tomkiewicz of Fort Wayne. We will never forget their sacrifice and service, and I offer my deepest condolences to their loved ones.","date":"Mon Mar 21 01:21:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke with @INFocusIndiana about the situation in Ukraine and additional steps we can take to help the Ukrainian military fight back.\n \nhttps://t.co/dRixMBj5lz","date":"Sun Mar 20 21:54:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am supporting a bill that makes it clear that there can be no safe haven, no financial off-ramps for Putin and his cronies to evade sanctions through Chinese financial channels. https://t.co/AlM8GIpeMK","date":"Sat Mar 19 16:05:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited American Resources Corporation in Noblesville today, where they are recycling &amp; purifying rare earth materials used in everything from wind turbines to weapons systems, using a process that began at Purdue. Passing #USICA will help Hoosiers continue to innovate &amp; succeed. https://t.co/kBTKADwhKW","date":"Fri Mar 18 18:28:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana is home to over 2,000 sheep farms. Thanks to David Trotter, a Hoosier member of @SheepUSA, for the update this week on issues affecting the Indiana sheep industry. https://t.co/3FG4fbaA8Z","date":"Fri Mar 18 17:51:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"From weapons to farming to manufacturing, the opportunities &amp; applications for biotechnology are vast. I am excited to serve on this Commission &amp; look forward to examining the serious questions about the role biotech plays in our rapidly changing world. https://t.co/WAxP8j7d1H","date":"Fri Mar 18 14:26:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Dr. Una Osili of @IUPhilanthropy testified before @SenFinance today about ways Indiana is leading the way in philanthropy. Dr. Osili is a leading expert on charitable giving, and I’m grateful she shared her expertise with us. https://t.co/7evrONnz0U","date":"Thu Mar 17 20:15:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Ukraine must remain a porcupine that is difficult for Russia to swallow, but a slow defeat is not success. We must give Ukraine the tools necessary to fight back and win. https://t.co/vmpijRBKFj","date":"Thu Mar 17 18:18:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"A great way to begin #StPatricksDay\n \nCongrats to @IndianaMBB and @NDmbb on winning their opening #MarchMadness games","date":"Thu Mar 17 14:56:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I enjoyed talking with students from The Orchard School in Indianapolis yesterday. They asked insightful questions about the Senate and some fun ones, including my preference in fries (curly). https://t.co/urdv3M5QkP","date":"Wed Mar 16 23:21:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Zelensky is asking us to support the Ukrainian people in their fight to save their country. We can’t wait another day to facilitate the transfer of MiG jets and empower Ukraine to control its airspace. https://t.co/97RjNKjeH0","date":"Wed Mar 16 18:31:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Trade &amp; national security are inextricably linked, &amp; pursuing meaningful trade negotiations in the Indo-Pacific region is a national security priority. During yesterday's @SenFinance hearing, I raised concerns about recent actions by China to increase its influence in the region. https://t.co/vOByF0Jr2j","date":"Wed Mar 16 16:18:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Zelensky made it clear that the key to battlefield success is controlling the airspace. The obvious step @POTUS must take is to transfer MiG fighter jets to Ukraine immediately.","date":"Wed Mar 16 13:56:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We can’t wait another day to transfer these jets. Every hour we wait is a missed opportunity to help the Ukrainian people fully counter Russian aggression.","date":"Wed Mar 16 13:56:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning Congress will be updated virtually by President Zelensky. His communication has been incredibly helpful to understand exactly what his country needs. We will continue to support the Ukrainian people.","date":"Wed Mar 16 12:45:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @NCSHAhome today to discuss my Affordable Housing Credit Improvement Act that would increase affordable housing across the U.S. and my #YIMBYAct that encourages localities to cut harmful regulations &amp; sheds light on discriminatory land use policies. https://t.co/gUtD2H6eeD","date":"Tue Mar 15 21:39:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s the time of year we love as Hoosiers – #MarchMadness. Good luck @IndianaWBB, @IndianaMBB, @BoilerBall, @IUPUI_WBB, @ndwbb and @NDmbb. https://t.co/qhucjOfrrK","date":"Tue Mar 15 18:58:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":".@SouthShoreLine President &amp; GM Mike Noland stopped by to update me on construction of the Double Track &amp; West Lake Corridor projects. These game-changing investments that I helped secure federal funding for will make NW Indiana an even better place to live, work, &amp; do business. https://t.co/O7OnRVJAOD","date":"Tue Mar 15 15:51:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"According to public reports, this new agreement will weaken sanctions on Iran’s support for terror groups and lessen restrictions on Iran’s nuclear program. The Administration must follow the law and consult with Congress on a deal of this magnitude. https://t.co/HOGg7DuFmR","date":"Tue Mar 15 13:29:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Mark Rapp was one of 65 Hoosier firefighters on Indiana Task Force One who went Ground Zero after the 9/11 terrorist attacks. Mark served the city of Indianapolis as a firefighter for 37 years, and we are forever grateful for his courage, bravery, and leadership. https://t.co/ltr3L4BY1v","date":"Mon Mar 14 22:41:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our newest state historical marker commemorates the Indiana woman’s suffrage movement. Dedicated earlier this month, the marker is the only one on the grounds of the Indiana Statehouse. #MarkerMonday #WomensHistoryMonth\n\nMore here:\nhttps://t.co/mdK1LhmTxK https://t.co/uovH3xri6D","date":"Mon Mar 14 18:02:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Despite earlier promises to the contrary, the administration has failed to adequately consult with Congress on its attempts reach a new agreement with Iran. A major agreement that does not have strong bipartisan support in Congress will not survive. https://t.co/msPMZZmKqM","date":"Mon Mar 14 16:11:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Securing the funding for the South Shore Double Track and West Lake Corridor projects was one of the highlights of my first four years in the Senate. Construction has now begun on these game-changing projects for Northwest Indiana. https://t.co/6CcB3kx8fc","date":"Mon Mar 14 13:34:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats @BoilerBall @IndianaWBB @IndianaMBB @IUPUI_WBB @NDwbb @NDmbb on making the NCAA tournament. We’ll be rooting for you. #MarchMadness","date":"Mon Mar 14 00:51:38 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden Admin is negotiating a nuclear deal with Iran that is likely even weaker than 2015 agreement. Meanwhile Iran is targeting our service members and diplomats. \n\nWe need to walk away from this very bad deal that will make us even more vulnerable. https://t.co/lHA4jHo779","date":"Sun Mar 13 19:03:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I enjoyed meeting with Indiana University and Purdue University MBA students participating in The Washington Campus program this week. A great group of future leaders. https://t.co/CMuhQTUseh","date":"Sat Mar 12 18:56:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good luck to @IndianaMBB @BoilerBall in the Big Ten tourney this afternoon. We’d all like to see a third IU/Purdue matchup tomorrow.","date":"Sat Mar 12 14:23:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My #CADETSAct passed the Senate this week. This bipartisan bill expands the eligibility age for maritime cadets seeking assistance for tuition, living costs, and uniforms – incentivizing our veterans and service members to continue careers serving our nation’s maritime industry.","date":"Fri Mar 11 21:46:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/tzLTQQLoWJ","date":"Fri Mar 11 21:46:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fostering American private sector innovation in digital finance is the solution, not Chinese Trojan horses. #crypto @FinancialCaucus\n\nhttps://t.co/80NDf1t7Fq","date":"Fri Mar 11 18:09:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"China hopes its centralized digital currency and blockchain networks will provide new opportunities for financial surveillance and control. The Say No to the Silk Road Act will help us better understand these risks and identify ways to protect the American people.","date":"Fri Mar 11 18:09:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We need to support Ukraine’s fight for freedom. I joined my colleagues in urging @POTUS to work with Poland and our NATO allies on expediting the transfer of aircraft and air defense systems to Ukraine. https://t.co/UVYDliAspv","date":"Thu Mar 10 22:47:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Xi Jinping is closely watching how the United States supports Ukraine against Putin’s aggression as China plots its own moves against Taiwan. In today’s @SenateForeign hearing, I urged the Biden Admin to prioritize the defense of Taiwan in security assistance programming. https://t.co/jh38lE8fX5","date":"Thu Mar 10 21:04:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation soared to 7.9% in February and is at a 40 year high. The price of household goods is consistently outpacing increases in wages, across income groups and across geographies. https://t.co/Z59fa9xcxG","date":"Thu Mar 10 18:26:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our goal in Taiwan should be to deter an attack in the first place, not respond if China takes action. \n\nWe should help Taiwan shore up its defenses now to thwart the Chinese Communist Party’s ambitions. https://t.co/4jhGVVfnaa","date":"Thu Mar 10 13:49:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden Administration is negotiating alongside Putin’s Russia and the Chinese Communist Party to revive the Iran Nuclear Deal. No deal is better than a very, very bad deal. https://t.co/eIbFD44Flo","date":"Wed Mar 09 21:55:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My friend @WFPChief is doing incredible work responding to the crisis in Ukraine. We are fortunate to have him serving in this critical position.","date":"Wed Mar 09 19:55:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":".@IndianaHistory’s new exhibit honors Eva Kor’s life and legacy. Eva taught so many about the horrors of the Holocaust and, just as importantly, the power of love and forgiveness. https://t.co/RFOIHNMveO","date":"Wed Mar 09 18:49:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The price increases facing every American at the pump can be mitigated by accelerating production of our domestic energy resources.","date":"Tue Mar 08 19:33:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I urge the Administration to reverse its policies of the past fourteen months that have led to steadily increasing domestic energy prices and take sensible steps like reopening the Keystone pipeline and eliminating restrictions on U.S. oil and gas production.","date":"Tue Mar 08 19:33:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today’s announcement is a needed step, but we must do more to help American consumers and strike a blow against Russia’s war machine. https://t.co/BWZEzxQfnM","date":"Tue Mar 08 19:33:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy #InternationalWomensDay. Today, we celebrate the achievements of women across the world. I want to say a special thanks to our Hoosier women leaders shaping our state’s future. https://t.co/3N6nuug4Ge","date":"Tue Mar 08 18:28:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The courage and resilience of the Ukrainian people and President Zelenskyy continues to inspire the world, and we need to support them as they fight for their freedom. https://t.co/TGkOySrQcN","date":"Tue Mar 08 16:06:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party is censoring media coverage of Russia's invasion of Ukraine and amplifying pro-Putin talking points. This Axis of Authoritarians cares more about control than its citizens. #BeijingBehavingBadly https://t.co/3V6xBV62hW","date":"Tue Mar 08 15:26:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I led a letter opposing the Admin’s anti-competitive EO mandating project labor agreements. Over 87% of the U.S. construction workforce does not belong to a union, &amp; mandating PLAs will prevent qualified contractors from fairly competing for contracts. https://t.co/s3olpkNDV4","date":"Tue Mar 08 00:29:06 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Before turning to Russia sympathizers like Iran or Venezuela to increase oil supplies, we need to open the spigot on American energy. Through smart energy production, we can fulfill our domestic needs while simultaneously exporting oil &amp; gas to our allies.https://t.co/c0uNiChpZr","date":"Mon Mar 07 18:56:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana’s first convention focused on women’s rights was held in 1851. Women and men who favored abolition and suffrage attended and resolutions were adopted in support of more rights for women. #MarkerMonday #WomensHistoryMonth https://t.co/RdfdcSIlps","date":"Mon Mar 07 17:45:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is at a 40-year high and costing the average Indiana household an additional $276 a month. Read more about what I'm doing to ensure that runaway spending by the Biden Administration doesn't make the problem worse for Hoosier families. https://t.co/TMdsfsREck","date":"Sat Mar 05 15:52:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Principals play a pivotal role in the lives of Hoosier students. This week, I had a great meeting with school leaders from Northeastern Wayne Schools, Batesville Middle School, and Slate Run Elementary School. https://t.co/G7xqLDzMj2","date":"Fri Mar 04 21:31:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers are showing our support for the Ukrainian people in many unique ways.\nhttps://t.co/GZiVU7tPE5","date":"Fri Mar 04 18:04:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"India remains on the front lines of Chinese aggression. They are a vital partner in our strategic competition with China and we must continue to strengthen the relationship between our countries. https://t.co/O750EbglRH","date":"Fri Mar 04 16:36:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Russia earns almost half of its revenue through its energy sector, and we need to smartly target Russian energy production and tighten the economic noose on Vladimir Putin. \n\nhttps://t.co/ynAdn83sPD","date":"Thu Mar 03 20:09:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I had a great meeting with new @INDOT Commissioner Mike Smith. We discussed the many ways we can work together to ensure the Crossroads of America remains a national leader in the transportation sector. https://t.co/UgwOa4lVjc","date":"Thu Mar 03 19:32:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"During #SOTU, @POTUS asked for additional COVID-19 funding. Before we would even consider supporting this request, my colleagues &amp; I have asked for a full accounting of how the government has allocated trillions in taxpayer funds to combat the pandemic. https://t.co/wFT7Q8hHTk","date":"Thu Mar 03 18:33:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Innovation Agenda America Needs https://t.co/LcexkljJnn","date":"Thu Mar 03 15:37:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"“Under [USICA], federal investment would take us from a few isolated examples of this kind of innovative leadership to hundreds that can go to scale and become sustainable…Americans will see the return on investment in their pocketbooks.” https://t.co/LcexkljJnn","date":"Thu Mar 03 15:37:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great meeting with members of the Indiana Broadcasters Association today. This group of nearly 300 radio and television broadcasters is essential to the flow of local news and civic education in Hoosier communities. 🎙📺 @IBAtweet https://t.co/LE5SvaTfdt","date":"Wed Mar 02 22:52:42 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to meet @AmbHerzog to discuss the importance of the special relationship between the United States and Israel. Our mutual security interests are under threat and we must stand together. 🇺🇸🇮🇱 https://t.co/Ee62I79xKM","date":"Wed Mar 02 19:27:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"One step Congress can take is authorizing additional foreign military sales to Taiwan for items like anti-ship missiles to shore up its defenses. Our unified response in Ukraine should send a message of deterrence to Beijing of what will await if they invade Taiwan.","date":"Wed Mar 02 16:50:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we support the courageous Ukrainian people, we cannot afford to take our eyes off other dangerous spots around the world. We should take immediate steps to deter Xi Jinping and the Chinese Communist Party from further aggression in Taiwan.","date":"Wed Mar 02 16:50:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The conflict in Ukraine will likely last for months and potentially longer. The U.S. must continue working with our allies to ensure Ukraine becomes a porcupine that the Russian snake cannot swallow.","date":"Wed Mar 02 16:50:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tonight I attended the #SOTU.\n \nDespite the numerous challenges we face, I believe in this country and I believe in our people.\n \nI will continue fighting for policies that will get us back on track. https://t.co/TMUuRpiT7i","date":"Wed Mar 02 04:02:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"My U.S. Innovation and Competition Act will invest in emerging technologies important for our national security to help us outcompete China. We need to get it across the finish line. #SOTU","date":"Wed Mar 02 02:45:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Glad to hear the need for China competitiveness legislation raised during #SOTU. We are in a generational conflict with China and must prioritize 21st Century national security investments.","date":"Wed Mar 02 02:45:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Energy security is a key component of our national security. It is vital that we unleash domestic energy production. #SOTU","date":"Wed Mar 02 02:24:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is a hinge point in history, and the United States must lead the international community in defending the freedom-based global order. #SOTU","date":"Wed Mar 02 02:17:40 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It is encouraging to see Republicans and Democrats join together to send the message that the United States is united against Vladimir Putin’s aggression in Ukraine. #SOTU","date":"Wed Mar 02 02:14:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Heading in to #SOTU https://t.co/F7ZhtricBN","date":"Wed Mar 02 01:55:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s time we bring our banking systems into the 21st century and allow more Hoosiers to access their financial information from a computer or electronic device. I am supporting legislation to give consumers access to more options.\nhttps://t.co/qiC5A1TpEm","date":"Tue Mar 01 23:16:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"🇺🇸🇺🇦","date":"Tue Mar 01 18:10:59 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I was proud to join my colleagues in introducing the bipartisan Dr. Lorna Breen Health Care Provider Protection Act to reduce &amp; prevent suicide &amp; burnout among health care professionals. The Senate honored Dr. Breen &amp; other health care workers by passing this important bill.","date":"Tue Mar 01 16:56:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We all must do our part to counter Putin, and I’m glad @GovHolcomb took this action. Hoosiers are proud to stand with Ukraine. https://t.co/9Z9MSinYXr","date":"Tue Mar 01 15:15:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @WNIN Lawmakers to discuss Russia’s invasion of Ukraine and how inflation is hurting Hoosier families.\n\nhttps://t.co/B37N6BnWeR","date":"Mon Feb 28 20:13:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Senate Avenue YMCA in #Indianapolis served as a center of community life for African Americans. Many prominent national leaders visited the YMCA, including Dr. Martin Luther King, Jr. in 1958. #MarkerMonday #BlackHistoryMonth https://t.co/b9j5R0wcHn","date":"Mon Feb 28 17:06:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Removing certain banks from SWIFT is an important step but still leaves the door open to a workaround with other Russian banks. We must cut off all Russian banks.","date":"Sun Feb 27 14:00:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This bill reinstates the Freedom of Information Act rules for NTIA’s new broadband program to help us do just that. https://t.co/pwbwRzcukn","date":"Sat Feb 26 20:02:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It is vital that we close the digital divide and deploy broadband to unserved Hoosiers. At the same time, we must ensure proper oversight of federal broadband programs to avoid some of the waste, fraud, and abuse that has occurred in the past.","date":"Sat Feb 26 20:02:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is a positive step. We must deliver lethal aid immediately.","date":"Sat Feb 26 16:49:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"While in Columbus earlier this week, I enjoyed a quick visit to Zaharakos for some ice cream. You can’t go wrong with any flavor. 🍨 https://t.co/tteo2jtMmN","date":"Sat Feb 26 14:37:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I will raise this in Monday night’s briefing with @SecBlinken &amp; @SecDef. We must expedite lethal assistance to Ukraine now!","date":"Sat Feb 26 03:31:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the face of relentless and barbaric attacks, the courage and resolve of the Ukrainian people is inspiring the world #StandWithUkraine","date":"Sat Feb 26 02:02:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I spoke with Pat Miller on @WOWOFORTWAYNE about Russia’s invasion of Ukraine and how we should respond. One critical step to counter Russia: immediately open the spigot on American oil and gas. https://t.co/vTAns4kdqK","date":"Fri Feb 25 21:33:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Supreme Court nominees deserve a thorough and fair vetting, and I will approach this process with the seriousness it deserves.","date":"Fri Feb 25 19:08:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I look forward to reviewing Judge Ketanji Brown Jackson’s record to evaluate whether she is committed to upholding the Constitution and to ensure she will not legislate from the bench on our nation’s highest court.","date":"Fri Feb 25 19:08:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Senate passed a bipartisan resolution I introduced with @ChrisCoons recognizing this week as National FFA Week. @NationalFFA plays a critical role in the development of students through ag education, including more than 11,600 Hoosier FFA members. https://t.co/xOhRyX79s8","date":"Fri Feb 25 16:45:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to Columbus Mayor Jim Lienhoop and community leaders for a great discussion this morning. https://t.co/YN8k9bbYEF","date":"Thu Feb 24 20:12:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Chinese state media doesn’t like it when the truth is spoken. The CCP can silence its own people, but they will never silence the voices of freedom loving Americans #BeijingBehavingBadly","date":"Thu Feb 24 17:02:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"With Russia and China content to chart their own paths, despite the costs, we must examine what credible deterrence means – both for Putin in Moscow &amp; Xi in Beijing. The goal should not be preparing for the next response, but to deter attacks in the first place.","date":"Thu Feb 24 14:51:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The stakes extend beyond Europe, as China is watching us and clearly has the same ambitions for Taiwan. It is essential that America sends an unequivocal message: invading sovereign, democratic nations will never be tolerated.","date":"Thu Feb 24 14:51:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Leaders of the free world must awaken to the challenges that come with the return of great power conflict and a multipolar world.","date":"Thu Feb 24 14:51:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"American strength and leadership in this moment is critical. The weak response from the United States following Russia’s previous invasions of Georgia and Crimea left Putin undeterred in his perverse ambition of rebuilding the Soviet Union.","date":"Thu Feb 24 14:51:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We should immediately impose the strongest possible economic sanctions to make Putin a global outcast. We must cut off Russia from SWIFT and freeze the life of luxury enjoyed by Putin and his oligarchs.","date":"Thu Feb 24 14:51:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the face of Russian aggression in Ukraine, the United States must be united and resolute. Sanctions announced earlier this week by @POTUS are a positive step, as are ongoing efforts to rally our NATO allies.","date":"Thu Feb 24 14:51:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Vladimir Putin is attacking the democratic, rules-based order that has benefitted countless Americans &amp; millions around the globe since WW II. The US must stand with the Ukrainian people by immediately providing additional assistance, including military equipment and lethal aid.","date":"Thu Feb 24 14:51:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Many Hoosiers are employed in the gig economy, which provides workers with needed flexibility. I joined with @MarkWarner to introduce a bipartisan bill that would test out models to better connect these workers to portable benefit options.\n\nhttps://t.co/u2ozaplB28","date":"Wed Feb 23 21:31:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good discussion with @INLawrenceCOC members about supporting Hoosier businesses, strengthening our communities, and how our leadership overseas affects us back home. https://t.co/eqygLTKNi9","date":"Wed Feb 23 17:55:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We must project strength in dealing with the conflict in Ukraine. China is watching us &amp; clearly has the same ambitions for Taiwan. It is essential for us to send a strong message that invading sovereign, democratic nations will never be tolerated.","date":"Wed Feb 23 17:22:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week’s #HoosierHighlights newsletter recaps my visit with @EnesFreedom, the cost of inflation on Hoosier families, and customer service challenges at the IRS.\nhttps://t.co/2OInjQDfpd https://t.co/oS7hgkLFfi","date":"Wed Feb 23 15:11:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to the Overbeck family for welcoming me to your farm today. #RemingtonSeeds https://t.co/QgQVAjg35b","date":"Tue Feb 22 21:21:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our farmers face many challenges right now, like inflation and supply chain disruptions. I had a great discussion in Jasper County this morning with @INFarmBureau members on issues affecting Hoosier agriculture. https://t.co/S7bdzVuLum","date":"Tue Feb 22 21:21:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: Last week, I joined with @SenBobCasey to introduce bipartisan legislation that would ensure individuals have access to the information necessary to make more informed decisions as they approach Medicare eligibility. https://t.co/vv7vBxGAvL","date":"Tue Feb 22 20:04:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed a great conversation with Hoosier farmers this morning in Jasper County. https://t.co/gzy5sHbiVO","date":"Tue Feb 22 18:22:38 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I strongly support Germany’s decision to halt #NordStream2 and we should help meet their needs with American energy.","date":"Tue Feb 22 14:46:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the conflict in Ukraine roils energy markets and puts more strain on Americans at the gas pump, the Biden Administration should be focused on energy independence. When the U.S. is a net exporter of oil, we blunt the manipulation of energy markets by authoritarians.","date":"Tue Feb 22 14:46:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"On #PresidentsDay, we celebrate George Washington’s vision that in America any ambition can be met through merit. Let this remain our aspiration today. https://t.co/PXDTwNBGJd","date":"Mon Feb 21 13:27:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: My constituents are understandably quite frustrated with IRS delays and backlogs. I questioned the National Taxpayer Advocate on the IRS’s ongoing customer service challenges. https://t.co/TUAALmghWw","date":"Sun Feb 20 20:44:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Olympic Games in Beijing are ending, but we must continue to hold the Chinese Communist Party accountable. #BeijingBehavingBadly https://t.co/vEVHIdVdQm","date":"Sun Feb 20 15:24:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Paying to receive preferential access to the IRS should not be permitted. I am pressing for answers. https://t.co/oPRuesU6PY","date":"Sat Feb 19 20:46:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/LIbRyF7eg1","date":"Sat Feb 19 15:39:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The lessons, tools, &amp; resources gained through the FFA program equip Indiana’s future agriculture leaders with the skills needed to succeed. I’m proud my resolution recognizing National FFA week passed the Senate on behalf of the 11,600+ FFA members in Indiana.","date":"Sat Feb 19 15:39:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am supporting the #NYETAct – legislation to hold Russia accountable and provide the critical support Ukraine needs to defend itself and deter Russian aggression. https://t.co/cFCTgqejRl","date":"Fri Feb 18 22:49:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to cut the ribbon on the new Great Dane facility in Terre Haute, which will create 125 skilled manufacturing jobs and equip our truckers with high-quality products. https://t.co/wvaj19AOum","date":"Fri Feb 18 18:16:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana’s workforce needs the right skills and training for the jobs of tomorrow. I’m proud that the Senate passed my bipartisan resolution to recognize February 2022 as Career and Technical Education Month.\n\nhttps://t.co/tsY5JtAQ9I","date":"Fri Feb 18 14:40:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"With the Olympics coming to an end soon, the Chinese Communist Party is showing its true colors #BeijingBehavingBadly https://t.co/gMPcLRhtM7","date":"Fri Feb 18 14:03:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I questioned the National Taxpayer Advocate on the IRS’s ongoing backlogs and delays. We need improved customer service for Hoosiers who are simply doing what the law requires of them – filing their taxes. https://t.co/8LwlizMNM9","date":"Thu Feb 17 22:45:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks @HuntingtonU, we will proudly display in our DC office. https://t.co/0e2lvqMEHV","date":"Thu Feb 17 21:26:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed speaking with Hoosier advocates from the Alliance for Headache Disorders Advocacy yesterday.","date":"Thu Feb 17 20:44:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is a stealth tax on all Americans. https://t.co/UVhiWnDjHw","date":"Thu Feb 17 19:30:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined my colleagues in a letter to AG Garland seeking his commitment that @TheJusticeDept will respect the prosecutorial independence of Special Counsel John Durham and ensure he is provided the resources needed to complete his investigation. https://t.co/pPxKtTYdyg","date":"Thu Feb 17 17:26:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @KHBlakeslee on @WOWOFORTWAYNE to discuss the situation in Ukraine, inflation at a 40 year high, and a potential Supreme Court nominee https://t.co/go1KotuXqU","date":"Thu Feb 17 14:00:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The courage and conviction of @EnesFreedom is inspiring. I enjoyed hearing how he’s using his voice to call out the abuses of the Chinese Communist Party. It’s vital that we shine a light on #BeijingBehavingBadly. https://t.co/V87IA95sFh","date":"Wed Feb 16 22:34:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is at a 40-year high, and inflation is costing the average American household $276 per month. https://t.co/eelkfoWM0a","date":"Wed Feb 16 20:02:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inspired after meeting with @EnesFreedom, a true champion for human rights. #BeijingBehavingBadly https://t.co/bN1QTotC1u","date":"Wed Feb 16 16:59:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to Nick Goepper of Lawrenceburg on winning a silver medal at the #Olympics. https://t.co/O4l7YTy331","date":"Wed Feb 16 15:14:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Corrupt business practices &amp; opaque accounting by major Chinese companies are putting Americans at risk of financial harm. I sent a letter to @GaryGensler &amp; @SECGov highlighting these dangers and requesting that they prioritize transparency and due diligence. https://t.co/ODCtf0q5RH","date":"Tue Feb 15 23:33:33 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is at a 40-year high and hurting Hoosier families and businesses. I joined my @SenFinance colleagues to press the @USCBO for information on inflation’s harmful effects on the federal budget. https://t.co/MtLPT7JblH","date":"Tue Feb 15 22:50:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Supporting workforce training opportunities for Hoosiers is vital to our state’s economic prosperity and future. As co-chair of the Senate Career and Technical Education Caucus, I joined a webinar today to discuss the long-term benefit of these programs. https://t.co/OGHKj8h8Vm","date":"Tue Feb 15 21:04:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you Ambassador Fareed Yasseen for meeting today to discuss my #AUMF legislation and the role Iraq plays as a regional partner. As the Ambassador prepares to retire, I applaud his dedication to a democratic Iraq and to strengthening the relationship between our two nations. https://t.co/0uMDoCeYzu","date":"Tue Feb 15 20:36:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you Dr. Bernhard for your kind words. @NotreDame @UNDResearch","date":"Tue Feb 15 19:34:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to my friends at @IndianaUniv for your kind words.","date":"Tue Feb 15 19:07:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Fake Chinese athletes pair perfectly with the fake snow China manufactured by starving farmers of water #BeijingBehavingBadly #FakeOlympics https://t.co/SbknCpo0oI","date":"Tue Feb 15 13:59:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese men’s hockey team is symbolic of these Olympics – what we see on TV isn’t the real China #BeijingBehavingBadly https://t.co/LDaYt8PHpt","date":"Tue Feb 15 13:59:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Read about how I’m fighting to ensure Hoosiers receive good customer service from the IRS and more in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/E5TE4iICLh https://t.co/vZDU2sDuc6","date":"Mon Feb 14 22:37:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"A fun read on why we love fried pork tenderloin sandwiches in Indiana. https://t.co/6CJFFInrha","date":"Mon Feb 14 21:14:27 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#Elkhart native Charles Gordone was an acclaimed actor, director, &amp; playwright. He was the first African American to win the Pulitzer Prize for Drama for his play, No Place to Be Somebody. His work helped increase Black representation in the arts. #MarkerMonday #BlackHistoryMonth https://t.co/74uMaGJagg","date":"Mon Feb 14 16:25:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosier seniors deserve access to medical care – whether it be in person or online. My bipartisan Telehealth Extension and Evaluation Act will extend telehealth services for seniors no matter where they reside. https://t.co/CC7ncA79KD","date":"Sat Feb 12 19:27:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @WEHTWTVWlocal in Evansville this week to discuss the upcoming vacancy on the Supreme Court. https://t.co/sLEsvrAEtj","date":"Sat Feb 12 17:23:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy birthday to Abraham Lincoln, born on this day in 1809. Our 16th President grew up in southern Indiana and his character was forged on Hoosier soil. https://t.co/JDwPaJVli3","date":"Sat Feb 12 16:34:49 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited Messer Construction today in Indianapolis to hear about some of their exciting projects and Employee Stock Ownership Plan. https://t.co/QzC5f8VWb5","date":"Fri Feb 11 23:49:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I encourage all Hoosiers to take advantage of this free service. Click below to learn more.","date":"Fri Feb 11 19:49:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our interns do a fantastic job serving Hoosiers. I enjoyed spending some time with our Indy office interns today. https://t.co/TnQ3qIS4ah","date":"Fri Feb 11 19:05:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"What is the cost of inflation? $276 a month for the average American household. \n\nWe need trade and deregulation policies that lower prices, not more regulation and spending. https://t.co/Z24gQtba5A","date":"Fri Feb 11 16:17:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers – this tax filing season is expected to be one of the most challenging and frustrating in recent memory. I am calling on the IRS to use its existing authority to provide maximum relief to taxpayers. My constituents deserve top quality service. https://t.co/u3CrimAdiK","date":"Fri Feb 11 14:22:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: The Biden-Harris Administration’s botched withdrawal from Afghanistan left behind a massive humanitarian crisis. Watch my opening remarks below from yesterday’s @SenateForeign hearing. https://t.co/PT6EPqFvK7","date":"Thu Feb 10 23:00:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to Justin Schoenefeld of Lawrenceburg on winning the gold.🥇 https://t.co/UELlhtvlXO","date":"Thu Feb 10 19:35:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @DanSpehler on @INFocusIndiana to discuss my #BeijingBehavingBadly campaign and the authoritarian Chinese Communist Party. More below: https://t.co/eXMF2CCWOC","date":"Thu Feb 10 18:59:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/dYQTAqCzJq","date":"Thu Feb 10 16:59:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is up 7.5% over the past year, a four-decade high. \n\nFilling up at the gas station, buying groceries, and paying energy bills are straining family budgets. \n\nThe economic policies of the Biden Administration aren’t working, and Hoosiers are paying the price.","date":"Thu Feb 10 16:58:59 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning, I met with Hoosiers representing @NASLdc to learn more about their priorities and the importance of professional medical services supporting long term care. https://t.co/iXdWK2o1ud","date":"Thu Feb 10 01:00:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the Winter Olympics continue in Beijing, I spoke on the Senate floor about why the world must hold the Chinese Communist Party accountable. #BeijingBehavingBadly https://t.co/8V6vbSmcle","date":"Wed Feb 09 22:36:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party’s repression and censorship does not stop at China’s border. Thanks @JoshRogin for shining a light on this issue. #BeijingBehavingBadly","date":"Wed Feb 09 19:13:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Marcenia “Toni” Stone played for the Indianapolis Clowns in 1953, taking the roster spot of a young player named Hank Aaron. Aaron later said of Stone, \"She was a very good baseball player.\" Read more about Stone and the Clowns: \nhttps://t.co/FBfG79nvND \n\n#BlackHistoryMonth","date":"Wed Feb 09 16:50:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to catch up with college presidents from @ICIndiana and hear updates on their campuses and students. https://t.co/T0B3CasTId","date":"Wed Feb 09 14:31:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Reports of athletes being treated poorly at the Winter Olympics are just the latest example of #BeijingBehavingBadly. https://t.co/VXy2ERyGK9","date":"Tue Feb 08 20:30:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The IRS should focus on protecting the data of Hoosiers and preventing fraud, not exposing taxpayers to unnecessary facial recognition.","date":"Tue Feb 08 19:45:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: My colleagues and I sent a letter to the IRS last week opposing its plan requiring taxpayers to use third-party facial recognition technology to access online resources. Yesterday, the IRS rightly announced that it is transitioning away from this intrusive practice. https://t.co/FVrwt8Zhk9","date":"Tue Feb 08 19:45:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We are thinking of Gary police officer Sgt. William Fazekas this morning, who was shot and wounded last night while on duty. I thank Sgt. Fazekas and all Hoosier law enforcement officers for their service and dedication to protecting our communities. https://t.co/MUrJ3QOlRF","date":"Tue Feb 08 15:34:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoying watching skiing?  China starved farmers of water to manufacture snow for the events. #BeijingBehavingBadly\nhttps://t.co/SbknCpoyeg","date":"Tue Feb 08 14:16:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/Nd7xtsIXDY","date":"Mon Feb 07 23:04:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @SenCortezMasto to introduce bipartisan legislation to temporarily extend telehealth flexibilities put in place during the early days of the COVID pandemic. Congress should act now to ensure the most vulnerable Hoosiers continue to benefit from these important services.","date":"Mon Feb 07 23:04:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The #Olympics are in full swing, and the Chinese Communist Party is off the rails. No nation with such a poor human rights record should host the Olympics. #HoosierHighlights #BeijingBehavingBadly. \n\nhttps://t.co/Agw1sENZ7G https://t.co/97bfZgmJZz","date":"Mon Feb 07 22:29:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last week, my @SenateFinance Republican colleagues and I sent a letter to the IRS opposing its recently-announced plan requiring taxpayers to use third-party facial recognition technology to access the IRS’s online resources.","date":"Mon Feb 07 21:35:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today the IRS heeded our call and announced that it is transitioning away from this intrusive practice. Read the letter here: https://t.co/bY7cxjTRvR","date":"Mon Feb 07 21:35:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BeijingBehavingBadly","date":"Mon Feb 07 19:05:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Evangeline Harris was an African American educator, author, and vocalist from #TerreHaute. Her master’s thesis identified the need for illustrated literature featuring Black children. She later published a three-part primary-grades series. #BlackHistoryMonth #MarkerMonday https://t.co/ZouKDMA20e","date":"Mon Feb 07 17:55:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BeijingBehavingBadly","date":"Mon Feb 07 16:37:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke with @WISH_TV about the importance of holding the Chinese Communist Party accountable as the world watches the Winter Olympics. #BeijingBehavingBadly \n\nhttps://t.co/D1GuDXppSX","date":"Mon Feb 07 14:54:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the world watches the Olympics in Beijing, the actions of Chinese Communist Party cannot go unchecked. We must hold the CCP accountable. #BeijingBehavingBadly https://t.co/GErB0ZN5j1","date":"Sun Feb 06 15:44:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Olympic Games in Beijing, spit and polished, even carbon-neutral, may present the face of a humane and caring world power, but we are not fooled. We see through the charade. Read my @FoxNews op-ed: https://t.co/pxbp2USWfn","date":"Sat Feb 05 19:42:12 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We’re rooting hard for Team USA and our American Olympians. But we cannot normalize a regime like the Chinese Communist Party hosting the Olympic Games. #BeijingBehavingBadly https://t.co/GuiJ9ZfBNN","date":"Sat Feb 05 16:52:03 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Follow along this month as @SenateForeign spotlights dissenters the Chinese Communist Party has imprisoned. #CCPrisoners #BeijingBehavingBadly","date":"Sat Feb 05 15:13:11 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"To our Hoosier Olympians and all of Team USA, best of luck at the Winter Games. Our state is cheering for you. #Olympics https://t.co/uwscRv3YyD","date":"Fri Feb 04 23:03:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Enjoyed meeting with Hoosier students from @Simon_Youth participating in @CloseUp_DC during their visit to Washington this week. https://t.co/WIslGhjTxx","date":"Fri Feb 04 20:35:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"To outgrow, out-innovate, and out-compete China, we need to work together and take the fight to the CCP. As we head to a conference process, my hope is that the final legislation will reflect the Senate bill and give House Republicans a much better option to support.","date":"Fri Feb 04 17:12:52 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last year the Senate followed regular order and an open process to pass the USICA with strong bipartisan support. I am disappointed that the House did not follow a similar process. https://t.co/wWgpkMj0n5","date":"Fri Feb 04 17:12:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined all @SenateGOP members to fight the Administration's resurrection and revision of the WOTUS rule. This bureaucratic overreach would impose unfair, confusing, and costly regulations on Hoosier farmers and builders who manage their own private land. https://t.co/huZJbZO2aZ","date":"Fri Feb 04 16:02:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined with a group of my colleagues in asking @SecMayorkas to address reports that ICE has been releasing illegal immigrants across the country via “midnight flights.” More below: https://t.co/vZxcmJdfKO","date":"Thu Feb 03 23:18:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to have the support of so many trusted national security leaders from different Administrations who all agree that Congress should act on my U.S. Innovation and Competition Act as we take the fight to the Chinese Communist Party. https://t.co/xU0EtVOO2F","date":"Thu Feb 03 21:48:48 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week, the Senate passed my bipartisan resolution expressing solidarity with the Burmese people’s aspirations to rule themselves rather than be ruled by force. I’m proud to stand with the people of Burma. https://t.co/XDu0SiVw03","date":"Thu Feb 03 21:18:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana is home to one of the largest communities of Burmese Americans in the United States. It has been heartbreaking to sit with these valued members of our community and hear how the lives of their loved ones were disrupted a year ago by the military coup in Burma.","date":"Thu Feb 03 21:18:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"If there were a gold medal for the most egregious human rights violator, Xi Jinping would be the most decorated Olympian of our time. More below from my interview with @LizMacDonaldFOX on @FoxBusiness. #BeijingBehavingBadly https://t.co/6WRJpNiRbf","date":"Thu Feb 03 20:46:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"February is #BlackHistoryMonth. Throughout this month, we celebrate Black Americans and their important contributions to Indiana and our nation. https://t.co/C2YcdXVRsT","date":"Thu Feb 03 17:03:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This diplomatic boycott is our effort to lead by example and show the world that the Chinese Communist Party’s mistreatment of its citizens is unacceptable. But the best way to show Beijing that they are failing their own people is for American athletes to win. Win often.","date":"Thu Feb 03 13:00:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"And force the Chinese authorities in attendance to hear America’s National Anthem over and over again for our athletes who live in the land of the free and home of the brave. Good luck. https://t.co/S5IgFK7nnZ","date":"Thu Feb 03 13:00:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 10 of #BeijingBehavingBadly. https://t.co/jK9xfl3mKQ","date":"Thu Feb 03 13:00:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Your country is behind you. To protest China’s abysmal record on human rights, U.S. officials – as well as government officials from Canada, Australia, and the U.K. – will not be at the games.","date":"Thu Feb 03 13:00:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Rather than hold Israel to a gross double standard, @amnestyUK should focus on the bad behavior of real human rights abusers, like China. https://t.co/tsLJ0Sf6S3","date":"Wed Feb 02 23:37:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"If bad behavior was an Olympic sport, the Chinese Communist Party would win the gold medal hands-down #BeijingBehavingBadly @AmericaNewsroom https://t.co/tNvbifYwP0","date":"Wed Feb 02 23:11:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke with @DanaPerino on @AmericaNewsroom about the latest on the situation in Ukraine. https://t.co/4Vf4Qo5m6X","date":"Wed Feb 02 21:03:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎙: On @93wibc this AM with @tonykatz to dive into my #BeijingBehavingBadly campaign. We need to hold the Chinese Communist Party accountable. \n\nhttps://t.co/YWUW3tKcuh","date":"Wed Feb 02 17:11:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Olympics in Beijing, spit and polished, even carbon-neutral, may present the face of a humane and caring world power, but we are not fooled. Read my op-ed on how the Olympics veneer can't hide China's atrocities. #BeijingBehavingBadly https://t.co/pxbp2USWfn","date":"Wed Feb 02 16:39:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers – stay alert and stay safe as winter weather hits today. Visit https://t.co/xcXv3N0vyi for information on your part of the state.","date":"Wed Feb 02 14:36:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"But killing the Commissioner didn’t stop contamination fears. The U.S. Olympic Committee brought its own food to Beijing in 2008. Athletes, be careful. Tainted food could disqualify you from the games.  https://t.co/fOkWlWf1Ml","date":"Wed Feb 02 13:00:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Pack your own lunch. In 2007, the Chinese Communist Party faced a crisis when tainted food products entered the United States, and Chinese authorities EXECUTED their own Food and Drug Commissioner as a result.","date":"Wed Feb 02 13:00:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 9 of #BeijingBehavingBadly. https://t.co/0L7kX3sIbf","date":"Wed Feb 02 13:00:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the lead-up to the Winter Olympics in Beijing, I’ve been calling attention to the Chinese Communist Party’s worst human rights abuses. The actions of the CCP cannot go unchecked. #BeijingBehavingBadly https://t.co/pOSeM9UDMw","date":"Tue Feb 01 19:02:39 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"All data and communications at the Olympics will be monitored by the CCP. The FBI is encouraging our Olympians to keep their personal cell phones at home and use a temporary phone while in Beijing. #BeijingBehavingBadly https://t.co/bXfyfpiDOU","date":"Tue Feb 01 15:28:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I hope many sponsors join the ranks of those who are willing to take a stand against this authoritarian regime. https://t.co/WL6xjlZJcL","date":"Tue Feb 01 13:00:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Beijing has famously retaliated against businesses that dared to speak out or refused to toe the CCP line on any number of issues.","date":"Tue Feb 01 13:00:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Choose your sponsors wisely. While the Chinese Communist Party works to eliminate Uyghur Muslims, persecute other minorities, and silence their own citizens, many Olympic sponsors are staying silent.","date":"Tue Feb 01 13:00:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 8 of #BeijingBehavingBadly. https://t.co/2R1lc5Gwpe","date":"Tue Feb 01 13:00:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"A Supreme Court vacancy, #BeijingBehavingBadly, and more in this week’s #HoosierHighlightsNewsletter.\n\nhttps://t.co/SI8CJcKkOt https://t.co/hPt0dDQa0c","date":"Mon Jan 31 23:24:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"For IU fans, Chuck Crabb is the voice of Assembly Hall. Congratulations @CharlesKCrabb2 on your storied career and best wishes on retirement. https://t.co/ZrkLni4pml","date":"Mon Jan 31 23:17:14 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BeijingBehavingBadly","date":"Mon Jan 31 19:35:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The historic Wolcott House was built in 1859 by Anson Wolcott, a prominent businessman and attorney. He founded the town of #Wolcott and the house still remains in White County today. #MarkerMonday https://t.co/vJEv1LuEem","date":"Mon Jan 31 18:54:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Support fellow athletes. When Chinese tennis star Peng Shuai went missing after accusing a Chinese official of sexual assault, the world took notice. In an extraordinary show of solidarity, her competitors &amp; the Women’s Tennis Association called for action.","date":"Mon Jan 31 13:00:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This prompted Peng to be seen in a video, but questions remain about her treatment.","date":"Mon Jan 31 13:00:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 7 of #BeijingBehavingBadly. https://t.co/Pv523sk36M","date":"Mon Jan 31 13:00:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/3uAdCDVCf2","date":"Sun Jan 30 22:22:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Headlines ahead of the @Beijing2022 Olympic Games aren’t looking good for the Chinese Communist Party. #BeijingBehavingBadly https://t.co/5TRY0XfbVT","date":"Sun Jan 30 20:07:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is despite frantic efforts by Beijing to clear the air through forced business closures and other draconian measures. But after the Games end? Expect China to go right back to polluting. https://t.co/v96UMO0DFV","date":"Sun Jan 30 13:00:38 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Hold your breath. Beijing’s air pollution problem may not only make for smoggy games, it could be hazardous to an athlete’s health. The concentration of lung cancer-causing PM2.5 particles is six times higher than the standard recommended by the @WHO","date":"Sun Jan 30 13:00:38 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 6 of #BeijingBehavingBadly. https://t.co/7DElMewCVy","date":"Sun Jan 30 13:00:37 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @WOWOFORTWAYNE to discuss my #BeijingBehavingBadly campaign and more. Listen here: https://t.co/pQbuuCERtq","date":"Sat Jan 29 18:41:34 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"But cybersecurity experts say the app creates a backdoor to users’ data and leaves all visitors open to cyberattacks.  https://t.co/Kv4vNjb416","date":"Sat Jan 29 13:00:19 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Journalists &amp; Olympians: Protect your data. Athletes &amp; members of the press attending the games are required to download a China-developed app called “My 2022.” The app must be used to upload travel plans, passport details &amp; health information each day for monitoring.","date":"Sat Jan 29 13:00:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 5 of #BeijingBehavingBadly. https://t.co/79HlmoYdT0","date":"Sat Jan 29 13:00:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The world is watching how the U.S. responds to the situation in Ukraine. If the Biden Administration is opposed to what Ukraine is requesting, they need to explain their reasoning before the Senate votes on new sanctions legislation.","date":"Fri Jan 28 23:22:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/WjJ3KwCaBq","date":"Fri Jan 28 20:25:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"No one should be discriminated against when it comes to medical care. I sent a letter to HHS Secretary Becerra urging him to reverse the Biden-Harris administration’s flawed national liver distribution policy, which is disproportionately harmful to patients in the Midwest.","date":"Fri Jan 28 20:25:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Journalists: Be on guard. China has a terrible record when it comes to free press. In 2021, China jailed 50 journalists – more than any other nation.","date":"Fri Jan 28 13:00:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"During the 2008 Summer Games, there were at least 30 cases of CCP officials interfering with reporting, including police assaulting journalists. Journalists reporting on the Olympics will be strictly confined to the Olympic Village. https://t.co/GTVwTHEKhE","date":"Fri Jan 28 13:00:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 4 of #BeijingBehavingBadly. https://t.co/EKWwgGgb3J","date":"Fri Jan 28 13:00:15 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Parents should be allowed to choose the type of education that best suits the needs of their children. I am proud to join my colleagues in recognizing this week as #NationalSchoolChoiceWeek.\n\nhttps://t.co/8JKJ9biSJc","date":"Thu Jan 27 22:08:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Eva Mozes Kor’s remarkable legacy lives on through her work with legislators, schools, &amp; the @candlesmuseum in Terre Haute. Today, we remember Eva and all Holocaust victims and survivors. #HolocaustRemembranceDay","date":"Thu Jan 27 20:28:32 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I look forward to seeing who the President nominates and will give his nominee a thorough but fair vetting, which Democrats did not afford to Pres. Trump’s SCOTUS nominees. https://t.co/6meMPAE1f8","date":"Thu Jan 27 14:53:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I encourage the President to select a qualified nominee with an unwavering commitment to upholding the Constitution &amp; respecting our nation’s system of checks &amp; balances. I won’t support a nominee who wants to legislate from the bench, which isn't the role of a SCOTUS justice. https://t.co/SWnYGEG1sy","date":"Thu Jan 27 14:53:02 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BeijingBehavingBadly","date":"Thu Jan 27 14:45:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"SOON: I’m joining @WOWOFORTWAYNE this morning to discuss my #BeijingBehavingBadly campaign. Tune in at 8:38 AM.","date":"Thu Jan 27 13:20:00 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Now, it appears Olympic gear made in China is also at risk. https://t.co/gqkFCQeyNz","date":"Thu Jan 27 13:01:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Know before you buy. The International Olympic Committee has not attempted to stop apparel made with forced labor from being sold. It has already been announced that China’s Olympic team will be wearing apparel manufactured in Xinjiang.https://t.co/TvlKswdNzA","date":"Thu Jan 27 13:01:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"If Xinjiang sounds familiar, that’s because it’s where the Chinese Communist Party has been pushing Uyghur Muslims into forced labor camps. Recently, the U.S. banned imports from Xinjiang due to the region’s use of forced labor.","date":"Thu Jan 27 13:01:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 3 of #BeijingBehavingBadly. https://t.co/77iFsR01i7","date":"Thu Jan 27 13:01:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @WOWOpatmiller on @WOWOFORTWAYNE to discuss the reported SCOTUS vacancy and China’s bad behavior. #BeijingBehavingBadly Listen: https://t.co/tvQEWMJKkq","date":"Thu Jan 27 00:01:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎥 SOON: I’m joining @AmericaRpts on @FoxNews to discuss my #BeijingBehavingBadly campaign and why we need to hold the Chinese Communist Party accountable. Tune in at 2:30 PM ET.","date":"Wed Jan 26 19:17:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BeijingBehavingBadly","date":"Wed Jan 26 15:00:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Additionally, security experts expect all data and communications will be monitored and athletes who speak out could be punished for violating local laws against critical speech. https://t.co/fHbQXxinmF","date":"Wed Jan 26 13:00:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Don’t be fooled by China’s “open” internet. The Chinese Communist Party famously censors the internet so that its citizens and visitors cannot access unflattering (read: truthful) portrayals of the regime.","date":"Wed Jan 26 13:00:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"While they are claiming athletes and press will have uncensored access to the internet through special SIM cards, Chinese citizens do not enjoy the same freedoms.","date":"Wed Jan 26 13:00:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 2 of #BeijingBehavingBadly. https://t.co/Z4sm1CQrm7","date":"Wed Jan 26 13:00:21 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers know we need to address the current semiconductor shortage by boosting U.S. chip manufacturing. #USICA works to accomplish this important national security goal. @PunchbowlNews https://t.co/Wj2BL0o7sA","date":"Tue Jan 25 21:15:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"After overwhelming passage in the Senate, #USICA awaits House action. This is the boldest and most comprehensive China competitiveness legislation that our country has ever passed. @PunchbowlNews https://t.co/FvIwtLLgEF","date":"Tue Jan 25 21:14:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎥 #ICYMI: Went live with @PunchbowlNews this morning to discuss my legislative efforts on #USICA – also known as the #EndlessFrontierAct – and my #BeijingBehavingBadly campaign. https://t.co/aiBsJi1MYF","date":"Tue Jan 25 21:13:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The digital yuan can be used to surveil athletes and visitors while putting your personal data at risk. https://t.co/74tmfMU3tv","date":"Tue Jan 25 17:09:16 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Advice to Olympians: Watch your bank account. China has shut out most forms of payment in and around the Olympics, in hopes of forcing athletes, companies, members of the media, and others attending the games to use their new app-based digital yuan.","date":"Tue Jan 25 17:09:05 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Day 1 of #BeijingBehavingBadly https://t.co/34ETYzmxQ1","date":"Tue Jan 25 17:08:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the world watches the Olympics in Beijing, the actions of Chinese Communist Party cannot go unchecked, and I’m ready to hold them accountable. Follow along for the next ten days. #BeijingBehavingBadly https://t.co/wNz0Er5XSG","date":"Tue Jan 25 15:17:55 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We are rooting hard for @TeamUSA but it’s important for them to know what our athletes are walking into as they compete.","date":"Tue Jan 25 15:17:54 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The opening ceremonies for @Beijing2022 are just days away. Due to the Chinese Communist Party’s record of human rights abuses, the U.S. – along with other nations – is imposing a diplomatic boycott. No government official will attend these Games. https://t.co/bs8ZPvFjYh","date":"Tue Jan 25 15:16:07 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Saving the Senate, standing for the unborn, and more in this week’s #HoosierHighlights newsletter\n\nhttps://t.co/yT4LwaPGUQ https://t.co/x2vazoY0qN","date":"Mon Jan 24 22:23:10 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"C.G. Conn Company's innovations shaped the music industry. Based in #Elkhart, the company invented the rubber mouthpiece &amp; employed many skilled workers in Northern Indiana. C.G. Conn Company promoted school band programs &amp; started one of the first musical instrument labs. https://t.co/Y9miY5tfNt","date":"Mon Jan 24 18:08:20 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"📄 LETTER: Joined GOP @SenFinance in a letter to our colleagues emphasizing the wide-ranging drawbacks of the drug price control mandates contained in the #BuildBackBetter Act. These innovation-killing mandates must not become law.https://t.co/Er8bJeT2T4","date":"Sat Jan 22 17:59:22 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Russia’s pressure in Ukraine opens the door for other bad actors to do the same. More here from my conversation with @news_ntd: https://t.co/Bto4xiUdRC","date":"Fri Jan 21 18:42:01 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Interested in interning for the U.S. Senate and helping Hoosiers? My office is hiring interns for our Summer 2022 Internship sessions in both my Washington, DC and Indianapolis offices. For more information about the application process, click here: ⬇️ https://t.co/5FYdEcULwW","date":"Thu Jan 20 20:11:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I helped introduce the Inflation Prevention Act to address the current #inflation crisis that is wreaking havoc on Americans’ wallets. More here: https://t.co/tu4zg0YoBq","date":"Thu Jan 20 17:40:36 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Superb essay by @BWallaceMP on the urgent threat posed by Putin in Ukraine. It is time for the Biden Administration to follow the UK’s lead and to expedite the delivery of  security assistance to Ukraine to help them deter Putin's aggression. https://t.co/8LPbgCP2ti","date":"Thu Jan 20 00:30:09 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Proud to be recognized by @SBAList with an A+ rating for #ProLife leadership. I will always stand up and fight for the unborn. https://t.co/NOkznlDxJ3 https://t.co/0vLOXAHrof","date":"Wed Jan 19 23:19:42 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"For the last 20 years, Putin has used thuggish, autocratic behavior to get his way. As Russia continues to threaten Ukraine, the Biden administration must respond with strength and deter Putin from unleashing his 100,000 troops at the Ukrainian border. https://t.co/7z5xSPXO7E","date":"Wed Jan 19 21:44:18 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great meeting with @GovHolcomb at the Indiana Statehouse yesterday to discuss the top issues facing Hoosiers. https://t.co/vcPOEJ8Wuf","date":"Wed Jan 19 17:41:43 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"SOON: I’m joining my GOP colleagues to discuss the deteriorating situation in Ukraine. Watch below⬇️","date":"Wed Jan 19 16:00:35 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Left-wing Democrats are on a one-way track to breaking the Senate filibuster, a move that members of their own party aren’t even willing to support. More here in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/9ohQIHqQSv https://t.co/aGwuSImNSv","date":"Tue Jan 18 22:05:50 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"We have faced a truck driver shortage for years, but it has now reached a crisis level as we witness major supply chain bottlenecks across all sectors. I commend the @FMCSA for acting swiftly to establish my #DRIVESafeAct pilot program for 18 to 21-year-old truck drivers.","date":"Tue Jan 18 21:38:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/dxFSnAyrrD","date":"Tue Jan 18 21:38:46 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to meet with interns at the Indiana Statehouse this morning. I am confident our state’s future is in great hands with these young Hoosiers leading the way. https://t.co/RXJSFcV3xx","date":"Tue Jan 18 18:20:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Dr. Martin Luther King Jr.’s words and actions still inspire us more than 50 years later. Today, we honor his message. #MLKDay https://t.co/zRPP8VZigW","date":"Mon Jan 17 16:40:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 1968, Robert F. Kennedy spoke to crowds in #Indianapolis following Martin Luther King Jr.’s death. Kennedy echoed MLK’s message of love, wisdom, compassion, and justice. May we all remember the lessons of MLK today. #MarkerMonday #MLKDay https://t.co/dukJhA1gaK","date":"Mon Jan 17 14:59:40 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wage increases are not keeping up with #inflation. The American standard of living is decreasing on the Biden-Harris administration’s watch.\nhttps://t.co/Ar3Q4MaEsb","date":"Sun Jan 16 18:57:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/6oCdKga0b3","date":"Sat Jan 15 15:22:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Biden’s administration finalized $201B in new regulatory costs in 2021 alone. This administration is unapologetically focused on spending and regulatory activism to expand federal power. https://t.co/NNQASrrUj7","date":"Sat Jan 15 15:22:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Trump made meaningful progress cutting job-killing regulations with his “one-in, two-out” EO, but now red tape is being added week-by-week. I reintroduced the REINS Act to reassert Congress’ authority, and the Biden-Harris admin has proven it’s necessary.","date":"Sat Jan 15 15:22:23 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I said it in my first speech on this floor, and I will repeat it until my last speech. We are, above all else, the custodians of the common good. Remember that before you take a hammer to one of the Senate’s signature means of advancing it. https://t.co/D2ldgzVTmX","date":"Sat Jan 15 13:57:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we work to repeal the #AUMF for Iraq, we recommit ourselves to work to defend Iraq as a partner &amp; friend. More here: https://t.co/l5dU0bOOVo","date":"Fri Jan 14 20:35:25 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Following yesterday’s attacks by Iran-backed terrorists, the American people stand with members of our military &amp; diplomatic corps stationed in Iraq, &amp; Iraq’s democratically elected government.","date":"Fri Jan 14 20:35:24 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"India is an ally in our competition against the Chinese Communist Party. I am strongly supportive of waiving CAATSA sanctions against India. More here: https://t.co/PlxgYe16UE","date":"Fri Jan 14 19:47:44 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s been 40 years since we’ve seen #inflation this high. Hoosiers are hurting. https://t.co/JmCA2ijBBG","date":"Thu Jan 13 19:34:26 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"NEW: I joined my colleagues in introducing the Inflation Prevention Act. For months, Democrats have ignored the problem, blaming everything instead of their spending agenda. Our proposal would ensure that the bills we are voting on in Congress do not make this problem worse.","date":"Thu Jan 13 19:02:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"More here: https://t.co/c1jU2nB4Ni","date":"Thu Jan 13 19:02:41 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"I have questioned and will continue to put pressure on IRS Commissioner Rettig to explain and fix delays too many taxpayers are experiencing. It’s time for the IRS to get their act together and get Americans the help they need.\nhttps://t.co/2gCYDpfZmQ","date":"Wed Jan 12 22:01:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"1982 was the last time #inflation was this high. That year, the movie E.T. was in theaters. https://t.co/sSi0zIQHz8","date":"Wed Jan 12 21:01:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"BREAKING – new data from @BLS_gov shows that inflation has reached a 40-year high. It’s time for the Biden-Harris admin to shift their focus to American families, and not their own partisan interests.","date":"Wed Jan 12 17:43:45 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Trying to change the rules when you’re behind on the scoreboard is no way to govern. The Senate rules have been effective in ensuring there are not extreme swings in policy from one Congress to another &amp; ensuring minority views are represented. https://t.co/WWoadzoI3P","date":"Tue Jan 11 23:49:58 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎥 SOON: I’ll be joining @LizMacDonaldFOX on @FoxBusiness tonight to discuss the Democrats’ plan to break the Senate and silence millions of Americans. Tune in live at 6 PM.","date":"Tue Jan 11 22:51:13 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Changing the Senate’s rules in order to seize control of America’s elections isn’t simply short-sighted. It’s clueless and the exact opposite of what the people who sent us here want. https://t.co/gFEhmN0bAl","date":"Tue Jan 11 22:38:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The G7 issued a statement committing support for antibiotic research and development and my #PASTEURAct. More here: https://t.co/8y03YrAjAS","date":"Tue Jan 11 19:24:47 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As your Senator, I'm committed to helping Hoosiers when it comes to navigating the federal government. My office set records for the number of constituents helped in 2021. More here in this week's #HoosierHighlights newsletter.\nhttps://t.co/ESzEmZqSnG https://t.co/x1PE3kZKBI","date":"Mon Jan 10 22:04:40 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Frank Hohenberger was known for his photographs that captured the beauty of #BrownCounty. He took over 15,000 photos during his career. The @IULillyLibrary at @IndianaUniv has preserved some of his most popular photos. #MarkerMonday https://t.co/2OgRSIhirR","date":"Mon Jan 10 17:32:51 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Sadly, Drake passed away last Friday. I will never forget standing with him in that gymnasium while his classmates chanted “We love Drake!” He was only 16, but Drake made a big impact on all those who knew him.","date":"Mon Jan 10 15:22:17 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Welcome to Indianapolis, @CFBPlayoff football fans. We are excited to have you here for the 2022 National Championship. While you wait for the game tomorrow, check out these must-see sites in Indy #VisitIndy. https://t.co/oIhQZYqdQN","date":"Sun Jan 09 19:56:40 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"The race to dominate emerging technologies is on. It's imperative for the U.S. to lead from a position of strength and pass my #EndlessFrontierAct so that we can go on offense before it’s too late.","date":"Sun Jan 09 15:13:29 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 2021, my office resolved 2,500 constituent cases and returned $46 million owed to Hoosiers by various government agencies. If you need help navigating a federal agency, my office is here to help – visit https://t.co/rrOv82kiEp and click “Help for Hoosiers”. https://t.co/Ri6OqbDL8C","date":"Fri Jan 07 20:01:28 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"Always good visiting with you, Ambassador @SandhuTaranjitS. I look forward to continuing our work to deepen the partnership between our two countries. 🇮🇳🇺🇸","date":"Thu Jan 06 20:53:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: China’s use of data from popular social media sites to target their international foes is a prime example of #BeijingBehavingBadly. More from the @washingtonpost: ⬇️","date":"Thu Jan 06 16:54:53 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 2017, 30 Democrats signed a pledge to keep the filibuster. Now Democrats want to gut it to push their far-left agenda. Great take from the @WSJ.\nhttps://t.co/SwqlGil9AE","date":"Wed Jan 05 20:32:57 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In order for the United States to lead the world, we must invest in the 10 key technologies that will drive us into the next century. The #EndlessFrontierAct is good for Americans, and bad for the Chinese Communist Party. https://t.co/BJSHwP9ZlL","date":"Wed Jan 05 19:42:31 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we head into 2022, read about last year’s legislative wins in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/4e7Rd5EI4v https://t.co/D0ftLOxcU2","date":"Mon Jan 03 22:47:04 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"This #MarkerMonday is dedicated to Elwood Mead, an engineer from Patriot, Indiana, who oversaw the construction of the Hoover Dam on the Colorado River. He served in various capacities under Presidents Coolidge, Hoover, and Roosevelt. https://t.co/GhOypYhVO8","date":"Mon Jan 03 18:24:30 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"#HappyNewYear, I wish all Hoosiers good health, prosperity, and joy in 2022. https://t.co/i3MB1pr5eH","date":"Sat Jan 01 17:19:56 +0000 2022","user_id":"234128524"},{"handle":"SenToddYoung","text":"In November, the #DRIVESafeAct became law. This legislation addresses the truck driver shortage by allowing those older that 18 to obtain a CDL after extensive training. #AYearInReview https://t.co/PwjlHXu9sp","date":"Thu Dec 30 17:31:30 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This year, the Senate advanced my #EndlessFrontierAct which would help the United States out-innovate, out-compete, and outgrow China. We must finalize the bill in 2022 so we can win the 21st century. #AYearInReview https://t.co/9F4G4hoeKe","date":"Wed Dec 29 19:26:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Drake Price has spent his life lifting up others. He has more than 5,000 police patches from around the world. Today, I presented him with a patch from the U.S. Capitol Police and made him an honorary officer. #DrakeStrong https://t.co/JTlNa7VmIT","date":"Thu Aug 29 22:08:18 +0000 2019","user_id":"234128524"},{"handle":"SenToddYoung","text":"The funding of the South Shore Line is a win for the Region and the entire state. I’m proud to have worked with @FTA_DOT to secure this important investment. #AYearInReview https://t.co/xWNCvhj7FJ","date":"Tue Dec 28 21:44:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Helen Gougar of #Lafayette advocated for women’s suffrage and prohibition. She challenged the legal system as a lawyer, writer, and lecturer. Gougar argued for “The Constitutional Rights of the Women of Indiana” before the Indiana Supreme Court in 1897. #MarkerMonday https://t.co/8KF8AeM6uu","date":"Mon Dec 27 18:14:07 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"From my family to yours, #MerryChristmas. https://t.co/4tRfj1hRtM","date":"Sat Dec 25 17:02:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Moms and dads, @NoradSanta is keeping us up-to-date on Santa’s journey around the globe tonight. https://t.co/9mPx10JNdn","date":"Fri Dec 24 21:11:01 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Democrats’ Build Back Better bill doesn’t prioritize preventing another pandemic. Thanks @RepDrewFerguson for partnering on the #PASTEURAct that would help combat future public health crises. https://t.co/cyU8tO0uZV","date":"Thu Dec 23 17:41:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’ve joined my colleagues in the Senate to cosponsor legislation to posthumously award the Congressional Gold Medal to Emmett Till and Mamie Till-Mobley. Emmett’s brutal lynching and Mamie’s courage were important moments in the fight for civil rights.","date":"Wed Dec 22 18:12:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: The Indiana senator with a bipartisan streak on the Middle East https://t.co/PJVv5cstiy","date":"Tue Dec 21 19:57:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"From my family to yours, Merry Christmas and a happy new year. Check out what’s new in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/a8Nb1pAgVJ https://t.co/EK6J74nbMP","date":"Mon Dec 20 22:35:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Mitchell’s prompt response lead General McClellan reposition his troops block Lee’s first invasion of the Union. #MarkerMonday #Hartsville https://t.co/Ok6uwZ1ytT","date":"Mon Dec 20 22:05:48 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Private Barton Mitchell found a wrapped up piece of paper in a clover field and quickly realized that they were Confederate orders from General Lee to invade the north and defeat the Union.","date":"Mon Dec 20 22:05:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Senator Isakson earned the respect and admiration of all he encountered. He was a friend to me and countless others. I will be praying for his friends and family during this time. Thank you for your service to this great nation.","date":"Sun Dec 19 21:04:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"A Purdue student from China spoke out against the Chinese Communist Party. His parents were visited and threatened by Chinese officials, and he was harassed on campus. \n\nGrateful to @PurdueMitch for supporting free speech. #BeijingBehavingBadly\n\nhttps://t.co/qUS7P8Hqyu","date":"Fri Dec 17 22:45:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden-Harris administration and Democrats’ “gifts” in #BuildBackBetter help everyone but hard-working taxpayers. https://t.co/4wWKdCVpcn","date":"Fri Dec 17 20:12:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“Fertilizer prices have more than doubled over the past year, frustrating U.S. farmers, who now are adjusting spring planting plans and warning about the potential for higher food prices.” - @WSJ https://t.co/Mz6zR1uma1","date":"Fri Dec 17 18:51:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Spoke to @USGLC on why leadership in foreign policy is important to me, and our country. https://t.co/GOuFzwqJO7","date":"Thu Dec 16 21:40:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosier businesses need efficient supply chain processing at our nation’s coastal ports. I sent a letter to the Biden-Harris administration calling for action to address port congestion so families and communities can get the goods they need:\n\nhttps://t.co/4HJJ9MI1pU","date":"Thu Dec 16 20:24:22 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As I have called for, Treasury &amp; Commerce are finally taking important action to protect our national security &amp; American business from Chinese surveillance &amp; biotech. \n\n$ for these companies = $ for Uyghur genocide &amp; #CCP repression. #BeijingBehavingBadly https://t.co/RkLvqFTYdh","date":"Thu Dec 16 18:00:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Inflation is rising to record levels. Hoosiers back home are hurting. But President Biden and Senate Democrats won’t listen. https://t.co/C5WmWLzzaI","date":"Thu Dec 16 00:17:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last time #inflation was this high, I was in third grade. https://t.co/Mu06TzsQZe","date":"Wed Dec 15 23:56:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"SOON: I’ll be joining @LizMacDonaldFOX on @FoxBusiness to talk about #inflation as it spikes to out of control. Tune in.","date":"Wed Dec 15 22:45:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tuberculosis is a preventable, treatable, and curable disease. \n\nWe must demonstrate U.S. leadership by passing our End Tuberculosis Now Act to find and treat TB, reduce the stigma, and better target this disease: https://t.co/DjXHW5BLCc","date":"Wed Dec 15 22:00:01 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Working Americans should be able to afford a working American lifestyle. But that’s not the Democrats’ plan for addressing child care access in #BuildBackBetter. https://t.co/3syKZexcdg","date":"Wed Dec 15 20:26:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m proud to have secured key provisions in this bill to strengthen cybersecurity cooperation with Israel, invest in emerging technologies, and create a nonpartisan commission to examine the war and failed withdrawal in Afghanistan.","date":"Wed Dec 15 19:21:07 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The #NDAA we passed today is far stronger than President Biden’s original plan. https://t.co/fhPQVjj8zu","date":"Wed Dec 15 19:21:07 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last time #inflation was this high, the first episode of Late Night with David Letterman debuted. https://t.co/MCzgOmawmF","date":"Wed Dec 15 18:00:49 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana is one of nine states to have Medicaid waiver provisions canceled by the Biden Administration. \n\nToday I joined colleagues in introducing a bill to ensure states are allowed to innovate under Medicaid and help recipients return to the workforce. https://t.co/Hmyjj7fGrz","date":"Tue Dec 14 23:19:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"While concerns grow for American families, Democrats plan to give $80 billion in their #BuildBackBetter plan directly to the IRS. Once again, the Biden Administration and Democrats in the U.S. Senate are out of touch with the real challenges and experiences of everyday Americans. https://t.co/oMkwspJpou","date":"Tue Dec 14 22:26:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The last time #inflation was this high, the Indianapolis Colts were still in Baltimore. https://t.co/jGcazn2nqq","date":"Tue Dec 14 20:35:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"NEW: #Inflation is causing wholesale prices to increase faster than ever. Americans need a break, not a reckless tax-and-spend proposal like the Democrats are trying to force across the finish line. https://t.co/WSUZWegIQY https://t.co/ltZVkg2g1G","date":"Tue Dec 14 19:31:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Journalists in China should be able to challenge you on this if you didn’t have so many behind bars. #BeijingBehavingBadly https://t.co/QqyBE1g5hE","date":"Tue Dec 14 18:16:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"SOON: I’m joining my GOP colleagues to discuss a provision in #BuildBackBetter that would supersize the IRS. Watch here","date":"Tue Dec 14 16:57:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy birthday to the @NationalGuard. Thank you to our citizen-soldiers for standing ready to serve your communities and your country for the last 385 years. #Guard385","date":"Mon Dec 13 23:39:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Biden and the Democrats promised #BuildBackBetter would be paid for. To no one’s surprise, the bill would add $3 trillion to the deficit. More in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/laMu3XJFIm https://t.co/VswVGMoWI2","date":"Mon Dec 13 22:58:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hannah Toliver, a courageous African American woman from #Jeffersonville, was sentenced to 7 years in the Kentucky Penitentiary after aiding a fugitive slave on the underground railroad. After several months in jail, she was pardoned and released. #MarkerMonday https://t.co/qriG1FGNB4","date":"Mon Dec 13 21:02:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I sat down with @WTHRcom to discuss the need for @SocialSecurity to fully reopen their field offices so that Hoosiers can get the help they need. I sent a letter to Acting SSA Commissioner Kilolo Kijakazi on this important matter. https://t.co/vedqFmliBT","date":"Sun Dec 12 18:20:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana became a state 205 years ago today. It is an honor to represent Hoosiers and the great State of Indiana in the United States Senate. https://t.co/M1R3PhKZi2","date":"Sat Dec 11 15:17:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"If the policies in Democrats’ tax-and-spend bill are made permanent, the deficit will take a $3 trillion hit over the next 10 years from this bill alone. With inflation at the highest level in 40 years, setting our country up for this level of spending is reckless.","date":"Fri Dec 10 19:27:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/UpnjlYlsEU","date":"Fri Dec 10 19:27:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Randy Frederick of Charles Schwab said, “There's no question no matter how you look at it, even if you take out the extremes caused by the pandemic, it's still very high inflation.\"","date":"Fri Dec 10 19:27:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last week when Federal Reserve Chairman Jerome Powell was asked if he still believed inflation wasn't very large or persistent, he said, \"No, that is no longer my view.”","date":"Fri Dec 10 19:27:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"There are plenty of tools at the President’s disposal, such as direct engagement with OPEC + leaders to match supply with demand. Hoosiers continue to face a real-life impact from higher gas prices that is casting a shadow over our economic recovery. https://t.co/XaQRfXHdXj","date":"Fri Dec 10 17:45:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This news confirms what Americans already know — thanks to the policies of the Biden-Harris Administration, prices are through the roof and middle class families are struggling to afford a middle class life.","date":"Fri Dec 10 15:25:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Democrats are handing out gifts in the Build Back Better Act, but they aren’t what the American people have asked for. https://t.co/VZdPfQiEzm","date":"Thu Dec 09 21:25:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/XjL8PoNYFb","date":"Thu Dec 09 17:41:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, the Senate voted to reject President Biden’s ill-timed and ill-conceived vaccine mandate. The House needs to pass this measure soon to send a message to the Biden Administration that workers and their employers are struggling with the mandate’s disastrous effects.","date":"Thu Dec 09 17:41:02 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"On @FoxBusiness with @larry_kudlow tonight, I discussed why my U.S. Innovation and Competition Act – also known as the #EndlessFrontierAct – is good for the United States, and bad for China. https://t.co/X8ypngI6Du","date":"Wed Dec 08 22:16:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I will be on with @larry_kudlow on @FoxBusiness shortly to talk about why we need to pass the U.S. Innovation and Competition Act to ensure this does not happen. https://t.co/98QikFah6I","date":"Wed Dec 08 21:14:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden-Harris administration’s failed policies have made inflation skyrocket while Americans are left to pay the price. \n\nhttps://t.co/bk072xu8E5 https://t.co/CCu5dKmD94","date":"Wed Dec 08 20:07:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, we remember a date that lives in infamy even 80 years later. We will never forget the sacrifice of those lost and the courage of those in the greatest generation who went forward to defend our nation. #PearlHarborRemembranceDay","date":"Tue Dec 07 17:44:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This afternoon I spoke at @NAIFA’s Leadership Conference to discuss the importance of retirement security. I reintroduced a suite of retirement bills this year to help more people save for their golden years. https://t.co/MyZcrJRH2Z","date":"Tue Dec 07 01:02:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to catch up with Supt. Pat Mapes from @PerryTwpSchools and hear how they use Teacher and School Leader grants to improve outcomes for students and benefit teachers.","date":"Mon Dec 06 23:52:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Across Indiana, Hoosiers are concerned about high prices and empty shelves. I’ve introduced legislation and committed to taking action to combat the supply chain crisis. More here:\nhttps://t.co/4zCeyUHNnm","date":"Mon Dec 06 22:54:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Catch up with the latest news from Washington, DC in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/H4dEAHN3sn https://t.co/bngSrnbLGB","date":"Mon Dec 06 22:11:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Union Literary Institute was one of the first schools to offer higher education to all, regardless of gender or race before the Civil War. Hiram Revels, the first black U.S. Senator, was among the notable attendees of the institute. #UnionCity #MarkerMonday https://t.co/gioWcQU4qq","date":"Mon Dec 06 19:41:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Gil Hodges was already a Hall of Fame Hoosier and Marine. Now, he’ll be enshrined in Cooperstown, where he should have been all along. Semper Fi. https://t.co/4bCXIzl77q","date":"Mon Dec 06 16:43:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"One of the greats of the Greatest Generation, courageous in war, humble and civil in peace, Senator Bob Dole believed in the American people, our system, and our way of life. He spent a lifetime working through institutions to serve others, especially his fellow veterans.","date":"Sun Dec 05 19:00:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"His life should remind us all that common decency and public virtue is not a hindrance to political success. May peace be with Mr. Dole’s family, and may Bob Dole – an authentic American Hero – forever Rest In Peace.","date":"Sun Dec 05 19:00:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m working to get the supply chain crisis under control. My GOP colleagues &amp; I on @SenateCommerce have requested the Biden-Harris admin provide a briefing for the committee to discuss the challenges and opportunities facing our supply chain. More here from @IBJnews:","date":"Sat Dec 04 20:47:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/gpXDpNL86b","date":"Sat Dec 04 20:47:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Studies show almost half of U.S. households are struggling under the Biden-Harris administration’s lack of response to the inflation crisis sweeping the nation. \nhttps://t.co/6LfU487EpK","date":"Sat Dec 04 17:48:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Important column by @JoshRogin. It is time to crack down on the Chinese Communist Party for their horrific human rights abuses &amp; concentration camps. The Biden Administration, Congressional Democrats, &amp; corporate interests must stop blocking this bill. https://t.co/O7vZwYll1N","date":"Fri Dec 03 20:02:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"More bad news for consumers – the Biden-Harris administration’s mishandling of the supply chain crisis is affecting another American favorite.\nhttps://t.co/lXQUoxTsNQ","date":"Fri Dec 03 16:05:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#BuildBackBetter will not pay for itself like the Democrats promised. In fact, it will add hundreds of billions, if not more, to our growing deficit. Americans can’t afford this bill.","date":"Thu Dec 02 22:54:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Americans are worried about inflation, empty shelves, and too many unfilled jobs. Instead of working to fix these issues, Democrats are arguing amongst themselves while trying to pass a partisan wish-list that will only hurt consumers‘ wallets.","date":"Thu Dec 02 22:54:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Americans should be concerned that executive branch employees appear to be leaking private taxpayer information and the IRS, @USTreasury, @FBI, and @TheJusticeDept have all failed to identify the source or sources of the leaked information.\nMore here: https://t.co/w2Q0cPhAX9","date":"Thu Dec 02 21:37:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to visit with Hoosier students from Illiana Christian High School in Dyer who are visiting DC this week to learn more about how our government works. Thank you for taking an active role in our democracy. https://t.co/GwrtDL4Uxa","date":"Wed Dec 01 20:54:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Always good to catch up with my friend, and winner of the Nobel Peace Prize, @WFP Executive Director David Beasley. His leadership around the globe in war torn countries and humanitarian disasters has saved countless lives. https://t.co/vF1ebOcMjE","date":"Wed Dec 01 19:59:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Stomach cancer is the fifth most common type of cancer worldwide and one of the most difficult to detect in its early stages. Yesterday, the Senate passed my bipartisan resolution marking November as #StomachCancerAwarenessMonth.\n \nhttps://t.co/SDY6tIwjF2","date":"Wed Dec 01 16:45:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Soon, a scrape on the playground could lead to amputation or even death. Read more about what I’m doing to prevent a superbug pandemic: https://t.co/Ewex0iHkwo","date":"Tue Nov 30 23:03:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The U.S. is facing a dire supply chain crisis. I helped introduce the #FREIGHTAct to reduce congestion throughout the entire supply chain and help Hoosiers get the goods they need. More in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/UDJXGMASgd https://t.co/gsC2EkQ7Sy","date":"Mon Nov 29 23:23:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wishing Hoosiers and all those celebrating #Hanukkah a happy holiday filled with peace, love, and light.","date":"Mon Nov 29 22:27:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The great Hoosier artist T.C. Steele captured the beauty of Indiana’s landscapes and brought the Impressionism movement to the Midwest. His home-studio in the hills of Brown County, House of The Singing Winds, is now a museum. #Belmont #MarkerMonday https://t.co/helKn3S12v","date":"Mon Nov 29 18:29:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: Congress must work to reduce congestion throughout the entire supply chain by alleviating pressure points at our ports and in our freight transportation system that are harming Hoosier businesses. The FREIGHT Act will do just that. More here: https://t.co/8YgylG2HLJ","date":"Sat Nov 27 19:48:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: China doesn’t want Congress to pass my #EndlessFrontierAct. In fact, they are lobbying against it. Read more here:\n\nhttps://t.co/q21WfaIqkf","date":"Fri Nov 26 14:51:48 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"From my family to yours, Happy #Thanksgiving. https://t.co/XN8NAY058Y","date":"Thu Nov 25 19:56:18 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers can expect to pay more for Thanksgiving dinner and see less on the shelves this year due to record high levels of inflation. And yet, just last week, House Democrats voted to spend trillions more in taxpayer dollars on their reckless tax-and-spend agenda.","date":"Wed Nov 24 19:34:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/qCA2kIBFyu","date":"Wed Nov 24 19:34:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"China is strengthening their military by testing out hypersonic missiles. The U.S. must go on offense with China before it’s too late. My #EndlessFrontierAct would help us do just that.\nhttps://t.co/pDXws0A6rL","date":"Tue Nov 23 21:22:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"A Congressional award for a Hoosier hero, why China is lobbying against my bill, and more in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/QsvFCSLs03 https://t.co/WA2Qz1mtPN","date":"Mon Nov 22 22:10:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Cataract Falls Covered Bridge in #Owen County was finished in 1876. Hoosiers and visitors to the state have used the bridge for leisure, convenience, and travel.  In 2005, the bridge was added to the National Register of Historic Places. #MarkerMonday https://t.co/BFtk2rTyj7","date":"Mon Nov 22 16:39:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/xlh5txvknh","date":"Sun Nov 21 19:55:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to receive the Edward F. Snyder Award for Peace this year. My #AUMF legislation reasserts Congress’ constitutional role in deciding when our country goes to war. Repealing these authorities will keep our men &amp; women in uniform more safe at home and abroad.","date":"Sun Nov 21 19:55:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Did you know 35,000 people die each year as a result of antibiotic-resistant infections? Antibiotic resistance affects millions each year. My  #PASTEURAct would help address this growing public health crisis. #WAAW21 https://t.co/MNYARtCL2u","date":"Sun Nov 21 16:05:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week, I’ll be sharing resources and information about how our next public health crisis is already here, and how we can stop it. #WAAW21","date":"Sat Nov 20 15:29:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s World Antibiotics Awareness Week, and I’ve been working to create solutions to combat antibiotic misuse and resistance through my #PASTEURAct. Read more about this important legislation here: https://t.co/Z50QeOAUIv","date":"Sat Nov 20 15:29:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"See the list of young Hoosier men and women I have nominated to attend United States service academies next year. Each one of these students should be proud of their accomplishments. I wish them the best of luck in their application process.\n\nhttps://t.co/xst8gbWiBv","date":"Fri Nov 19 19:12:14 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Bert gave his life protecting strangers thousands of miles from home. He was the best, not just of the Marine Corps, but of this country. It is fitting that we award these heroes the Congressional Gold Medal. More here: https://t.co/aHJ21aQH7M","date":"Thu Nov 18 23:07:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Senate passed my bill to honor the bravery and selfless service of the 13 service members who made the ultimate sacrifice in Afghanistan, including Indiana’s own Corporal Humberto ‘Bert’ Sanchez.","date":"Thu Nov 18 23:07:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Access to the IRS should be free and equal. I joined my colleagues on a letter to investigate reports that a private company is charging taxpayers a premium to speak to an IRS representative. \n\nhttps://t.co/QHtJrcTkZK","date":"Thu Nov 18 19:16:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“If the EFA succeeds, it will ignite chain reactions of creativity from a critical mass of gifted individuals.”\nhttps://t.co/s48BYF6XdQ","date":"Thu Nov 18 16:32:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning, I joined @Morning_Joe to discuss the need to pass my #EndlessFrontierAct &amp; for the U.S. to continue leading the world in the development of emerging technologies. The Chinese Communist Party is lobbying against my bill, but I’m confident that we will prevail.","date":"Thu Nov 18 16:12:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/y8y6T3inJO","date":"Thu Nov 18 16:12:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Proud to honor our selfless heroes in Fishers and Beech Grove last week. Our veterans have given us so much, let us never grow ungrateful. https://t.co/JNXvGkslGz","date":"Thu Nov 18 12:44:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My statement regarding the announcement of an agreement to conference the Senate-passed United States Innovation and Competition Act, also known as the #EndlessFrontierAct. https://t.co/GdQLX4rKIE","date":"Thu Nov 18 01:54:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In August, 97 of my Senate colleagues committed to the Biden-Harris pledge by voting for my Not One Penny amendment. Now, Democrats are going back on their word &amp; insisting on raising taxes on folks making less than $400k to pay for their leftist wish-list.https://t.co/u4T6qoe6YW","date":"Wed Nov 17 19:23:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"NEW: The Joint Committee on Taxation confirms that #BuildBackBetter violates the Biden-Harris tax pledge to not raise a penny or more in taxes on Americans who make less than $400k a year. https://t.co/qv6VhRFSRF","date":"Wed Nov 17 19:23:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“The Endless Frontier Act would provide a visible, focused and sustained commitment to U.S. research, education and technology transfer, as well as to economic development — precisely the combination of remedies that will secure the nation’s future.”\nhttps://t.co/kvw8KuvTNF","date":"Wed Nov 17 15:53:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“This is exactly the kind of approach needed to meet today’s challenges. Taking its name from the title of Bush’s report, the “Endless Frontier Act” proposes equally bold and novel steps, thoughtfully based on what has worked in the past.”\nhttps://t.co/jkDcL9L6RA","date":"Wed Nov 17 15:53:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As Congress moves toward passage of the Endless Frontier Act, and as China lobbies against it, here are some reminders of what’s at stake for Indiana and the nation. #ICYMI","date":"Wed Nov 17 15:53:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“We applaud Young’s energized, and energizing, commitment to the passage of the Endless Frontier Act. Indiana has everything to gain from this visionary legislation.”\nhttps://t.co/mY5AoidtYs","date":"Wed Nov 17 15:53:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am working to expand access to and enrollment in retirement savings plans so that Hoosiers – and all Americans – can have financial security in their golden years. https://t.co/B3yXLWVEPq","date":"Wed Nov 17 14:28:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I spoke at the Empower Retirement Partner Forum. Fewer than half of Hoosier workers participate in an employer-sponsored retirement plan.","date":"Wed Nov 17 14:28:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"American leadership is how we defeat the Chinese Communist Party. It is time for the Senate to pass the #EndlessFrontierAct as a part of the #NDAA.","date":"Tue Nov 16 22:56:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party is scared of my bill – and for good reason. @FoxNews covers why my #EndlessFrontierAct is the answer to supercharging the innovation that America needs: https://t.co/q21WfaIqkf","date":"Tue Nov 16 20:37:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Productive conversation with @Ayelet__Shaked where we discussed opportunities for expansion of the historic #AbrahamAccords, ways for the U.S. to partner with Israel on emerging technology, and how to enhance the security of Israel in the face of Iranian aggression. https://t.co/GY4XdtIVOO","date":"Tue Nov 16 20:20:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The U.S. must make strategic investments in innovation so we can continue to lead the world and prevent China from advancing their authoritarian agenda. Congress must pass my #EndlessFrontierAct. https://t.co/Sb0EICr9zF","date":"Tue Nov 16 17:57:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party doesn’t want my #EndlessFrontierAct to pass. We won’t let China hold U.S. innovation back. Read more in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/JSKj5Va7wc https://t.co/KAZy6SZqnA","date":"Mon Nov 15 23:16:19 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Madison’s James F.D. Lanier was a prominent lawyer and businessman. He loaned Indiana’s government over $400,000 during the Civil War, helping the state avoid bankruptcy and do its part to preserve the Union. #MarkerMonday #Madison https://t.co/Fom3ZLQ5h1","date":"Mon Nov 15 20:58:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Communist Chinese Party wants to stop my United States Innovation and Competition Act, also known as the #EndlessFrontierAct, from becoming law. The CCP knows that when we invest in American ingenuity, no one in the world can out-innovate us:\nhttps://t.co/ejvwU0Fh7Z","date":"Mon Nov 15 20:12:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The supply chain crisis is hitting Gared hard. The warehouse is filled with parts that can’t be assembled or delivered to the customer, and their business, like many others, is suffering. https://t.co/j5OOo45OCB","date":"Mon Nov 15 15:35:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@garedsports is a manufacturer of athletic equipment and custom design solutions to schools and other institutions. Last week, I toured their Noblesville facility. https://t.co/Sg0BPOWpUi","date":"Mon Nov 15 15:35:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Consumers are not optimistic that inflation is going away. America continues to suffer as the Biden administration insists upon spending more taxpayer dollars on his leftist wish list, with no end in sight. \n\nhttps://t.co/ARWZhdxbiS","date":"Sun Nov 14 16:39:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I spoke at the @EconomicClubIN in Indianapolis Tuesday and shared stories about Hoosiers I’ve met who have overcome obstacles to succeed. Our leaders need to work together to help more Americans release what Emma Lazarus called their “imprisoned lightning” of potential. https://t.co/ifkvduvA49","date":"Sat Nov 13 20:48:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Medical device manufacturers create thousands of jobs across Indiana. I met with @ImdmcOrg this week to talk about my efforts to prevent China from hurting this important American industry. https://t.co/P7C1Q4m20M","date":"Sat Nov 13 18:01:37 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Chinese Communist Party is lobbying against my bill. A clear sign passage of USICA puts us on track to outcompete the CCP and win the 21st century. https://t.co/ILJJstZB8q","date":"Sat Nov 13 16:31:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#YemenCantWait \n\nhttps://t.co/iWQfqVvg22","date":"Fri Nov 12 22:21:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My colleagues are often quick to blame US partners for fighting in Yemen. It’s time we wake up to the reality on the ground that the Houthis are not interested in de-escalation.","date":"Fri Nov 12 15:54:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden Admin must respond to this crisis with more than stern statements &amp; immediately reimpose sanctions on Iran and their proxy, the Houthis.","date":"Fri Nov 12 15:54:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"We can protect our state’s great natural resources and wildlife while creating new economic opportunities. My bipartisan Great Lakes Restoration Initiative Act is helping to preserve wetlands and marshes for generations of wildlife to come. https://t.co/0YRQtf4QPz","date":"Fri Nov 12 14:53:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Medaryville hosts the largest fall congregation of Sandhill Cranes during their southbound migration from the Midwest. Sandhill Cranes depend on high-quality wetlands to survive. I enjoyed seeing these birds with members of the @audubonsociety. https://t.co/uMauj2gbz8","date":"Fri Nov 12 14:53:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you for inviting me to your community gatherings to honor our heroes. https://t.co/CLu9XB4ecp","date":"Thu Nov 11 22:22:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Veterans Day ceremonies in Fishers and Beech Grove today were humbling reminders of the sacrifices our service members have made and of how proud Hoosiers are of our veterans. https://t.co/afSwMaw8bb","date":"Thu Nov 11 22:22:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited Northwest Health La Porte to thank them for their work during this global pandemic and to meet with some of the international nurses my office has helped. https://t.co/hjmN7WFEgD","date":"Thu Nov 11 18:04:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I would like to personally thank our active-duty service members, who continue to protect the values and democratic pillars of our nation. I am especially proud to honor our Hoosier veterans. #VeteransDay2021","date":"Thu Nov 11 16:38:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Veterans Day is a day we honor our service members. We acknowledge and commend their steadfast bravery, their undeniable patriotism, and the countless sacrifices they and their loved ones have made.","date":"Thu Nov 11 16:38:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My time in the military taught me a lot of important lessons about life and the values we hold dear. It allowed me to better understand the great sacrifices made by the men and women in uniform. https://t.co/oTOZcveIKP","date":"Thu Nov 11 16:38:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"At our roundtable in Valparaiso, the community is deeply concerned about inflation, labor shortages, and the runaway spending in Washington. https://t.co/tFC4CO2Ldg","date":"Wed Nov 10 21:35:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In La Porte, I sat down with Mayor Dermody and community leaders to talk about how we can work together to help their community emerge stronger than ever. https://t.co/JR1Z7yvAjf","date":"Wed Nov 10 20:38:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today marks the @USMC’s 246th birthday. Last week, I celebrated this momentous day with a cake cutting. Always an honor to recognize our brave Marines. #SemperFi https://t.co/mebODNLKWO","date":"Wed Nov 10 19:21:19 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Interested in interning for a U.S. Senator? My office is accepting internship applications for the spring of 2022 through November 19th. For more information on how to apply, click below: https://t.co/5FYdEcULwW","date":"Tue Nov 09 20:11:30 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"For decades, China has been ripping off American businesses by stealing their IP and forcing them to give up trade secrets in exchange for market access.","date":"Tue Nov 09 15:42:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden-Harris administration should hold bad actors accountable through strong digital trade provisions and forging trade agreements with allies in the Indo-Pacific region. The time to act is now.\nhttps://t.co/S06nxio6JI","date":"Tue Nov 09 15:42:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great speaking at the @EconomicClubIN in Indianapolis this afternoon. I shared how we can work together to help unleash the “imprisoned lightning” in everyone &amp; spark human potential across Indiana. https://t.co/Te8qxDXik7","date":"Mon Nov 08 23:58:02 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The #BidenBacklog is holding up the #NDAA and my #EndlessFrontierAct. Read more about these important bills in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/JuKAzSu8cD https://t.co/Mis306Uqm6","date":"Mon Nov 08 22:04:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Atterbury Army Air Field in #Columbus played a major part in training pilots during WWII, tending to wounded Korean War veterans, and was later memorialized for Women’s Air Service Pilot, Jean Norbeck. #MarkerMonday https://t.co/if20O6YguE","date":"Mon Nov 08 20:24:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: The longer the #BidenBacklog holds up the #NDAA, the less safe we will be. Bring the NDAA to the floor now: https://t.co/kNgsokbY5V","date":"Sun Nov 07 15:52:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“This game is not just another game. It is a matchup between institutions founded on the bedrock of respect, honor, service, and love of country that share a bond forged in blood. That still means something.” #NavyvsND \n\nhttps://t.co/sDZKH7Ml3C","date":"Sat Nov 06 20:55:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The #YIMBYAct promotes access to affordable housing by forcing communities to start to address discriminatory housing barriers. More on YIMBY from the @CATOInstitute here: https://t.co/NerJdCNvP7","date":"Sat Nov 06 18:27:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Great Lakes play a crucial role in Indiana’s ecosystem. On Thursday, I introduced the Great Lakes Fish and Wildlife Restoration Act to help restore wetlands, watersheds, and grasslands that add to the diversity of Hoosier wildlife. More here: https://t.co/8cbhZKJdCq","date":"Fri Nov 05 19:16:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The global semiconductor shortage is getting worse. If you use an on/off switch, you’ll be affected. The CHIPS Act – part of my U.S. Innovation and Competition Act –would address this shortage, but it’s being held up by the #BidenBacklog. \nhttps://t.co/D9kjeswQNU","date":"Thu Nov 04 20:38:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I met with utility contractors from Indiana to discuss how Congress can continue to support their work to build and maintain Indiana’s infrastructure to provide access to broadband, water, sewer, and gas utilities.","date":"Thu Nov 04 19:49:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Don’t miss this thread on why passing my #EndlessFrontierAct is critical. We can’t fall behind to China as they test hypersonic weapons.","date":"Thu Nov 04 15:32:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @ChrisCoons last night at @AspenSecurity’s event to discuss my bipartisan #EndlessFrontierAct. This legislation is essential to spur innovation and invest in this country’s future as we work to outcompete China. #AspenSecurity https://t.co/I2tjmT1Xes","date":"Wed Nov 03 19:40:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My thoughts are with @SenatorRounds and his family as they mourn the loss of Jean. She was a valued part of the Senate family and will be missed.","date":"Wed Nov 03 18:40:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"To miss this opportunity to compete with China would be a strategic disaster, both for our military and investments in key technologies.","date":"Wed Nov 03 15:01:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"China has gone on offense with hypersonics, while the U.S. is in danger of being left behind. The #EndlessFrontierAct is the answer.","date":"Wed Nov 03 15:01:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Research into hypersonics is a key focus area of my #EndlessFrontierAct. Passage of this bill would directly compete with the Chinese Communist Party’s development in emerging technologies.","date":"Wed Nov 03 15:01:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"China’s successful hypersonic missile tests this summer must push the American people and Congress forward in innovation, just as the launch of Sputnik in 1957 moved President Eisenhower and Congress into action.","date":"Wed Nov 03 15:01:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@INDairport is noted as one of the best airports in the nation. I met with Indianapolis Airport Authority staff this morning to discuss upcoming projects and initiatives IND is working on to make North America’s #1 airport even better. https://t.co/ojoiL013fq","date":"Wed Nov 03 13:30:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Last night, I joined @LizMacDonaldFOX on @FoxBusiness. The American people want answers as to why President Biden chooses to attend a U.N conference, but neglects traveling to our Southern Border where the humanitarian and security crisis only worsens. https://t.co/G9tVIQa1uG","date":"Tue Nov 02 20:29:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The NDAA funds our military and other crucial national security projects. Because of the #BidenBacklog, the NDAA is delayed. Every day the NDAA is not brought to the Senate floor, Americans are less safe. https://t.co/fab4ODn21G","date":"Tue Nov 02 19:44:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In addition to the #NDAA, my bipartisan #EndlessFrontierAct, which would help the U.S. out-compete, out-innovate, and outgrow China, is also being held up by the #BidenBacklog.","date":"Tue Nov 02 18:22:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The National Defense Authorization Act #NDAA that funds the U.S. military and keeps us safe and secure, has yet to be brought to the Senate floor this year due to the #BidenBacklog. Democrats have failed to prioritize national defense.","date":"Tue Nov 02 18:22:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the wake of China testing hypersonic missiles, Democrats need to step up and work with Republicans to pass this NDAA and put aside this multi-trillion dollar tax-and-spend bill that they are trying to ram through an equally divided United States Senate.","date":"Tue Nov 02 18:22:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"While Democrats argue among themselves over the largest tax-and-spend bill in history, crucial legislation is getting left in the dust. We cannot afford to let the #BidenBacklog go on any longer.","date":"Tue Nov 02 18:22:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My #EndlessFrontierAct, holding China accountable, and internships in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/DcdCU7y8p2 https://t.co/OPHeHGXMAO","date":"Mon Nov 01 22:31:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#NewTrenton native, Lester Lake, developed notable magic tricks and illusions and toured Europe with USO during World War II. This #MarkerMonday, we reflect on his monumental contribution to entertainment. https://t.co/sqikQMFWMR","date":"Mon Nov 01 20:32:30 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Wishing all Hoosiers a happy and safe Halloween.","date":"Sun Oct 31 20:28:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the supply chain crisis continues, consumers continue to be hit by high prices. More here:\nhttps://t.co/OXq0KaocoC","date":"Sun Oct 31 17:06:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: My bipartisan Social Determinants Accelerator Act would empower states and local governments to improve health outcomes by addressing the economic and social conditions in which people live, learn, and work. More here: https://t.co/dSaUdSGSOH","date":"Sat Oct 30 13:36:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"From funding the South Shore Line to making Indiana Dunes our state's first National Park, I've worked to ensure the success of Northwest Indiana. Today, at the One Region Luncheon, I discussed how the Region can benefit from my #EndlessFrontierAct. https://t.co/T2EvwPMOwf","date":"Fri Oct 29 19:56:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As prices soar, carving the turkey will cost you more this Thanksgiving thanks to Bidenflation. More bad news for consumers:\nhttps://t.co/souaqwNQZJ","date":"Thu Oct 28 18:06:49 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I applaud the House passage of H.R. 5142 honoring the 13 service members killed in Afghanistan in August. Indiana’s own Marine Cpl. Sanchez will be among the recipients of a Congressional Gold Medal for his sacrifice. More here: https://t.co/I5R9asw9oB","date":"Thu Oct 28 14:23:49 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I sent a letter to @AmbassadorTai encouraging action to prevent China from deploying unfair practices that threaten over 400k American jobs in the medical device manufacturing industry. More here: https://t.co/CkvcVpKBrd","date":"Wed Oct 27 21:51:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to the Hoosier members of the Associated Equipment Distributors for stopping by today. We discussed the harmful impact that the Dems’ $3.5T reckless tax-and-spend proposal would have on Hoosier farmers and small businesses, as well as efforts to address the skills gap. https://t.co/KqpIXdXOjl","date":"Wed Oct 27 19:45:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you @IndianaUniv President Pam Whitten for joining me today to discuss efforts to expand opportunities for Hoosier students and communities in need. https://t.co/1D4NrLbmZ4","date":"Tue Oct 26 21:01:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last week, I joined my Republican colleagues in introducing the Prohibiting IRS Financial Surveillance Act. This legislation would prevent Democrats from turning local financial institutions into IRS agents. More here: https://t.co/ptDAoxY4Dz","date":"Tue Oct 26 19:34:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Crown Hill Cemetery in #Indianapolis is the 4th largest cemetery in the U.S. The cemetery is the final resting place to several famous Hoosiers, including President Benjamin Harrison, 3 vice-presidents, and poet James Whitcomb Riley. #MarkerMonday https://t.co/MFKeKuVne9","date":"Mon Oct 25 20:16:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Stopped by @MarianUniv over the weekend, where I did the coin toss at the football game. Happy to report the Knights won the toss and the game. https://t.co/nJV1peN9G1","date":"Mon Oct 25 18:31:43 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Last week, I asked @djheakin about the economic effects of @CMSGov’s proposal to repeal Medicare coverage for innovative technologies. Watch below: https://t.co/8UQNkceYZM","date":"Mon Oct 25 14:56:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m working on a resolution that will outline key principles of digital trade between the U.S. and our partners. I asked @RNicholasBurns, nominee to be Ambassador to China, how he will work to ensure countries like China play by the rules.\n \nhttps://t.co/nmIVPoSDbD","date":"Sun Oct 24 20:53:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Over the years, China has been stealing our intellectual property and forcing companies to hand over trade secrets in exchange for market access. It’s time to hold bad actors accountable.","date":"Sun Oct 24 20:51:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden-Harris administration has adopted an open borders policy in all but name – and it needs to end. Restore security and order at our Southern Border – end this crisis now.","date":"Sun Oct 24 16:36:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"On Friday, @DHSgov quietly released data showing that 1.7 million illegal immigrants crossed our Southern Border in fiscal year 2021 – the highest level ever reported. https://t.co/Ac9tfNxuY9","date":"Sun Oct 24 16:36:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"On Tuesday, when I questioned Biden’s CBP Commissioner nominee, he refused to call our border crisis a “crisis.” https://t.co/C67OP5FyLC","date":"Sun Oct 24 16:36:09 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Lots of great questions in Ellettsville from Hoosiers who are ready for smart solutions to the challenges we face, not just more taxes and spending. https://t.co/F8LqScblhC","date":"Fri Oct 22 20:01:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I led an amendment to the Dems’ budget proposal that passed 98-1 &amp; binds Congress to Biden’s tax promise. However, Dems in Congress are still proposing tax hikes on the middle class to finance their leftist wish-list. https://t.co/wKLAs0ld9W","date":"Fri Oct 22 16:11:08 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Biden has repeatedly promised not to raise one penny in taxes on anyone making less than $400k/year, but he isn’t holding up his end of the deal. This week, I asked @djheakin to explain how everyday Americans will foot the bill for Democrats’ reckless proposed spending. https://t.co/BGs7l2I4as","date":"Fri Oct 22 16:10:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Ms. Katie Pourcho teaches at North Elementary School in Danville and is Indiana’s 2020 Teacher of the Year. Katie gifted me drawings from her students. Passionate teachers like Katie make Indiana schools great. https://t.co/OVjvspUdgY","date":"Thu Oct 21 21:42:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"China has successfully tested two nuclear-capable hypersonic missiles. I asked @RNicholasBurns, nominated to be Ambassador to China, how we can best communicate with China to ensure this incident and other Chinese actions do not escalate into a crisis. https://t.co/bnhHvt1KNn","date":"Thu Oct 21 20:41:09 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Glad to see @AmherstCollege abandoning legacy admission preferences. This is something I’ve advocated for doing at military service academies as well. Every student deserves access to higher education &amp; eliminating legacy preferences will provide opportunities for more students.","date":"Thu Oct 21 17:51:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Semiconductor manufacturing is virtually non-existent in the U.S. My #EndlessFrontierAct will help bring these manufacturing jobs back to the United States so we aren’t relying on other countries for this critical tech.\n\nhttps://t.co/D9kjeswQNU","date":"Thu Oct 21 00:06:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"If you use products with an on/off switch, the global chip shortage affects you. Today, I joined @CapehartJ on @PostLive to discuss the global semiconductor shortage, which is both an economic and a national security issue.","date":"Thu Oct 21 00:06:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I was proud to introduce a resolution recognizing National 4-H Week which passed the Senate yesterday.  4-H is a vital part of teaching real-world skills to our future ag leaders. #headhearthandshealth @4H","date":"Wed Oct 20 22:14:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It was an honor to welcome Hoosier veterans to Washington, DC this afternoon on the National Mall during their Honor Flight. After delaying flights for two years due to COVID, I am glad these veterans were able to make the trip. Thank you all for your service to our great nation. https://t.co/mkYYIy0O8o","date":"Wed Oct 20 21:11:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Democrats’ reckless $3.5 trillion tax-and-spend proposal represents a massive leftward shift in the way our country operates and threatens the financial security of American families. https://t.co/YRsVPBOc87","date":"Tue Oct 19 22:15:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The men and women in the health care industry have been on the frontlines of the COVID-19 pandemic. Today, I joined a virtual discussion with Quest Diagnostics employees to thank them for their tireless service.","date":"Tue Oct 19 21:13:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Despite our appeals, despite Americans’ outrage, and despite warnings from local banks, Democrats are insisting that we turn our local banks into IRS agents. https://t.co/bC0r8UFrtP","date":"Tue Oct 19 20:03:24 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Remembering Colin Powell and more in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/pPt3K1ornE https://t.co/62wy5WaGdI","date":"Mon Oct 18 21:14:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As a member of the Lewis and Clark Expedition, John Shields helped discover portions of the western United States. After the expedition, he moved to Harrison County, Indiana. #MarkerMonday #Corydon https://t.co/WYno6LTUrL","date":"Mon Oct 18 20:11:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Powell left behind a legacy of unimpeachable integrity. May his example of statesmanship continue to mentor this and future generations to recall how true public leaders lead a nation.","date":"Mon Oct 18 14:58:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Powell was a selfless patriot, a dignified statesman, and a pioneer. As a public servant, Powell embodied the meaning of duty, honor, and country. He uplifted the institutions he touched by serving others.","date":"Mon Oct 18 14:58:22 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am saddened by the news of Colin Powell’s passing. I will be praying for his family, he was a faithful husband and a devoted father.","date":"Mon Oct 18 14:58:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“Simply flooding the IRS with more data and burdening taxpayers, financial institutions, and already overwhelmed IRS service centers with more paperwork is of questionable value, especially when the IRS does not effectively use data already in its possession.”","date":"Sun Oct 17 20:17:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It was true then and is still true now. Read the full letter here: https://t.co/10h3TZG7tE","date":"Sun Oct 17 20:17:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My GOP @SenFinance and @BankingGOP colleagues and I wrote the following in a letter to Sen. Schumer weeks ago:","date":"Sun Oct 17 20:17:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Speaker Pelosi and congressional Democrats are doubling down on passing a law to let the IRS snoop through your private banking information.","date":"Sun Oct 17 20:17:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tune into @INFocusIndiana on @CBS4Indy and @FOX59  today for my conversation with @KristenEskow on the border, IRS reporting, and more.","date":"Sun Oct 17 13:38:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Discriminatory local zoning and land use policies drive up housing costs in communities across America. My #YIMBYAct would require municipalities to cut harmful regulations and improve transparency. https://t.co/0zPiMNS4jD","date":"Sat Oct 16 16:21:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My American Innovation and Jobs Act will bolster economic growth and high-quality job creation by incentivizing both established companies and innovative startups to invest in research and development here in the United States.  https://t.co/KEPI29KLno","date":"Sat Oct 16 16:21:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks @NTU for including my American Innovation and Jobs Act and #YIMBYAct in this year’s No Brainers list. More here: https://t.co/68cv9Shzyj","date":"Sat Oct 16 16:21:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good to meet you too, Hoss — the LPD Therapy K-9! https://t.co/9DzxESpYlT","date":"Fri Oct 15 20:31:08 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited @Lawrence_Police with Police Chief David Hofmann to discuss how we can continue to keep Hoosiers in the community safe and secure. https://t.co/U10hlr7HEg","date":"Fri Oct 15 20:31:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Nice to see the City of Lawrence Mayor Steve Collier to discuss issues important to Hoosiers in Marion County. @LawrenceINcity https://t.co/GNImWdc9LM","date":"Fri Oct 15 19:04:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Good conversation with leaders from the Burmese community across Indiana. It is sobering to hear the latest actions by the junta on the ground in Burma &amp; I appreciated their substantive feedback on ways to strengthen the pending Burma legislation. https://t.co/JcgkT8tzo3","date":"Fri Oct 15 18:15:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Abraham Accords vision of prosperity, peace, and security are coming into fruition. This week, I joined @SenRobPortman, @SenatorCardin and @SenBooker in urging other countries to deepen relations with Israel after this week’s historic meeting with the UAE.","date":"Fri Oct 15 14:35:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Nice to touch base with the City of Muncie Mayor Dan Ridenour to discuss how we can keep Hoosier businesses and communities strong as we reemerge from this pandemic. https://t.co/Xdozc8FD1j","date":"Thu Oct 14 22:09:49 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined the Muncie-Delaware County Chamber of Commerce today to discuss ways to strengthen our Hoosier workforce and concerns about the forthcoming employer vaccine mandate from the Biden Administration. https://t.co/QMqw6Dq9nF","date":"Thu Oct 14 20:06:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today we honor the @USNavy on its 246th birthday. Thank you to the brave Sailors who have served and continue to serve around the globe. #246NavyBirthday https://t.co/6OAm27JVUn","date":"Wed Oct 13 23:04:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Biden-Harris administration needs to show some leadership and secure the border as an influx of migrants are coming into the U.S. illegally. Read more in this week’s #HoosierHighlights newsletter.\n \nhttps://t.co/EHJl61S4zm https://t.co/cWuKhcgb6t","date":"Tue Oct 12 21:05:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"With China’s increasing military power and the threat to Taiwan growing, I fully support the training of Taiwanese military forces by the United States Marine Corps. More here: https://t.co/WQ77qoq1nM","date":"Tue Oct 12 20:14:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In July, I introduced bipartisan legislation that would establish a partnership between the U.S. National Guard and Taiwanese defense forces to ensure a well-integrated defense force capable of fast deployment during a crisis. \nhttps://t.co/zyO1xmouV2","date":"Tue Oct 12 20:14:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Taiwan is a sovereign nation, valuable ally, and a critical partner in deterring Chinese aggression in the Indo-Pacific.","date":"Tue Oct 12 20:14:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to my former colleague and fellow Hoosier Joe Donnelly on his nomination to serve as ambassador to the Vatican. Joe is a devout Catholic and longtime public servant, and I know he will serve our nation well and represent the best of our Hoosier values.","date":"Sat Oct 09 17:01:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I penned an op-ed for @TheHill on the unseen problems with the Biden-Harris administrations’ Afghanistan withdrawal. Read it here: https://t.co/SOyyAKxaDT","date":"Sat Oct 09 15:50:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This afternoon I joined @IndianaInnovate’s annual conference to discuss how we can advance tech &amp; innovation here in Indiana — including my #EndlessFrontierAct to outcompete the Chinese Communist Party. https://t.co/qtaUMhKjRz","date":"Fri Oct 08 19:32:55 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"3 Hoosier women joined “Operation HerStory”, the first all-female honor flight to Washington, DC. These heroes spent Wednesday touring the national mall with their sisters-in-arms. Thank you for your service.\nhttps://t.co/f4YzXH3KCw","date":"Fri Oct 08 18:08:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Taiwan is a flourishing democracy and we must stand with them at this critical time. Today, I joined my colleagues on a letter to @SenateForeign @SFRCDems pushing for classified updates on the situation.\nhttps://t.co/GCwJ0WQqGN","date":"Thu Oct 07 21:43:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today is #NationalDepressionScreeningDay. Taking care of your mental health is important, especially during the pandemic when most people have experienced some type of stress and worry. @FSSAIndiana has valuable resources to help Hoosiers care for their mental health here:","date":"Thu Oct 07 20:52:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/TIKTInWsbA #BeWellIndiana","date":"Thu Oct 07 20:52:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined 37 of my colleagues on a letter asking @SecMayorkas to address reports that thousands of migrants in Del Rio, Texas, were released into the interior of the U.S. instead of facing removal as the Biden-Harris Administration had previously pledged. https://t.co/HUdHeSl2JK","date":"Thu Oct 07 18:40:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"More bad news from the Democrats’ reconciliation bill. Giving @SBAgov the power to run its own direct lending program will hurt job creators. More on our letter to Leader Schumer &amp; Speaker Pelosi: https://t.co/YZ66mnau2e https://t.co/3QQhfMTHGH","date":"Thu Oct 07 00:10:08 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The crisis at our Southern Border is surging to levels not seen since I was a Marine stationed along the border in the mid-1990s. Today, I reiterated my call on the Biden-Harris Administration to get this situation under control and secure the border. https://t.co/OCRx6lTX6b","date":"Wed Oct 06 21:20:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to the Home Builders Institute for inviting me to their Industry Workforce Roundtable yesterday to discuss important issues facing the construction industry and the need to prepare more people for these great paying jobs.","date":"Wed Oct 06 13:20:19 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As a co-chair of the Senate Career and Technical Education Caucus, I have long valued the importance of hands-on experience and real world skills to prepare students for jobs in demand in the workforce.","date":"Wed Oct 06 13:20:18 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"LIVE: I’m joining @WOWOpatmiller on @WOWOFORTWAYNE soon. We’ll be discussing the Democrats’ plan to make banks hand over your confidential account information to the IRS.","date":"Tue Oct 05 20:00:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you @SandhuTaranjitS for the warm hospitality and discussion. The U.S. – India relationship is the strongest it has ever been and I look forward to working together to strengthen it further.","date":"Tue Oct 05 13:45:08 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Democrats want to force banks to give the IRS your financial information. Read about how I’m fighting back in this week’s #HoosierHighlights newsletter.\n\nhttps://t.co/XVDfNII6qT https://t.co/76VaEvYg99","date":"Mon Oct 04 21:21:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana’s oldest state forest can be found in #ClarkCounty. The Clark State Forest was established in 1903 during the conservation movement in the U.S.  The forest became a beacon of forestry and botanical experiments in the state. #MarkerMonday https://t.co/h6cZges21J","date":"Mon Oct 04 20:50:30 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great visit to the @CarrierAtHome facility in Indianapolis, which employs over 1,000 Hoosiers, to discuss how efforts like my #EndlessFrontierAct would help to boost Indiana manufacturers. https://t.co/eXQExOkoBE","date":"Mon Oct 04 19:50:09 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosier farmers know what they are doing. Every year, our agriculture industry feeds Indiana, the nation, and the world. Read my op-ed in the @KokomoTribune on why Congress should help farmers improve conservation efforts. https://t.co/uCnfQTlYM9","date":"Mon Oct 04 19:11:04 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Biden may wish to be done with Afghanistan but it is clear Afghanistan is not done with us. \n\nRead my op-ed in @thehill about the unseen challenges that remain after our calamitous withdrawal from Afghanistan. https://t.co/SOyyAKxaDT","date":"Mon Oct 04 15:21:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The @USTreasury currently holds billions of dollars in unclaimed savings bonds that have been forgotten or lost. I introduced legislation to help Americans get their hard-earned money back.\nhttps://t.co/L0fn0ty2aY","date":"Sun Oct 03 16:13:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"More here: \nhttps://t.co/ILpemhqkZk","date":"Sat Oct 02 17:30:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined my GOP colleagues on @SenFinance on a letter to Leader Schumer to oppose the Biden-Harris administration’s proposal to require financial institutions to report the private financial data of law-abiding Americans from financial institutions to the IRS.","date":"Sat Oct 02 17:30:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today is #ManufacturingDay. Manufacturers in the Hoosier state account for over 500,000 jobs and over $100 billion in economic output. To all Hoosier manufacturers, thank you for the important role you play in our state. https://t.co/RYE31Wjy77","date":"Fri Oct 01 17:23:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I reintroduced the UI Systems Modernization Act that would help upgrade these systems &amp; reduce fraud. More here: https://t.co/xEdJ4rZy12","date":"Fri Oct 01 13:32:16 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The COVID-19 pandemic exposed the real problems with outdated unemployment insurance (UI) systems.\n\nThese antiquated systems caused delays and errors affecting many workers in need of assistance during the pandemic.","date":"Fri Oct 01 13:32:16 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great to meet with @IndianaLatino emerging leaders this morning during a Q&amp;A session on federal government leadership. Thank you for your insight and positive influence in Indiana. https://t.co/fOG3UYag7q","date":"Thu Sep 30 17:12:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Democrats’ reckless tax-and-spend bill is full of priorities that don’t resonate with middle-class Americans, and certainly not Hoosiers.\n\nhttps://t.co/wQLWaF3lzS","date":"Thu Sep 30 14:26:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@WSJOpinion “Democrats are grasping for ways to finance their cradle-to-grave welfare state, with the left demanding what they claim is $3.5 trillion over 10 years. The truth is that even that gargantuan number hides the real cost of their plans.”","date":"Thu Sep 30 14:26:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Democrats want to access your bank account information and turn it over to the IRS. I joined a letter to Sen. Schumer urging Democrats to drop this unprecedented proposal that would compromise the private financial information of law-abiding Americans. https://t.co/10h3TZG7tE","date":"Wed Sep 29 13:31:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning I met with @AllisonTrans, a leading Hoosier manufacturer. Indiana is the most manufacturing intensive state in the country and we discussed the significant supply chain and labor constraints that Allison and so many of our job creating manufacturers face today. https://t.co/stCyIrjD9p","date":"Tue Sep 28 21:31:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I appreciate @TOS_Mitchell’s effort on this issue as we work to help Hoosiers get funds that are rightfully theirs. More here: https://t.co/f3MS6AXWol","date":"Tue Sep 28 16:05:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@USTreasury currently holds billions of dollars in unclaimed savings bonds. This money belongs to the people. I joined @SenJohnKennedy in introducing the Unclaimed Savings Bond Act which would help Americans identify and access their unclaimed savings bonds.","date":"Tue Sep 28 16:05:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"That's why I voted against advancing legislation that would raise the debt ceiling. A vote to raise the debt limit is a vote to co-sign on the Democrats’ partisan and unprecedented spending spree.","date":"Mon Sep 27 22:32:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Instead of working on clean, bipartisan legislation to fund the federal government &amp; avoid a shutdown, Democrats forced a vote on a bill that ties government funding to a two-year suspension of the debt limit that will enable Democrats’ $3.5 trillion reckless tax-and-spend bill.","date":"Mon Sep 27 22:31:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m a ‘No’ vote on raising the debt limit. Read why in this week’s #HoosierHighlights newsletter. \n\nhttps://t.co/nlJR8lfiR5 https://t.co/2uybwhWpdt","date":"Mon Sep 27 21:29:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Terry said to attendants of the ceremony \"We want you to know that you have pierced a dark cloud of injustice with a ray of light and hope.”  \nhttps://t.co/ARr80x14Ds","date":"Mon Sep 27 18:14:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana’s newest historical marker was unveiled yesterday in #TerreHaute. In 1901, George Ward was lynched by a mob. Terry Ward, George's great grandson, spoke at the ceremony yesterday. #MarkerMonday","date":"Mon Sep 27 18:14:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"From job-killing tax hikes to small business money grabs and hidden tax increases on the middle class, the Democrats’ plan will punish job creators and workers. I will not help the Democrats in their reckless tax-and-spending boondoggle.\nhttps://t.co/aXXZWwJ1Y6","date":"Sun Sep 26 15:50:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Proud of our Hoosier educators that make Indiana a great place to learn. 7 Indiana schools were named National Blue Ribbon Schools. \nhttps://t.co/1iP1HQnlUv","date":"Sat Sep 25 16:09:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to Democrats’ reckless spending, Hoosier workers are getting burned as the cost of living outpaces wage gains.\nhttps://t.co/2qFSt7dWVu","date":"Fri Sep 24 17:01:18 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I met with @indianafamily’s leadership series. We discussed strategies to support families, like my legislation to address the cost of college through income share agreements – all without burdening taxpayers. https://t.co/X87SMyi2UT","date":"Thu Sep 23 18:04:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana is a top turkey producing state, raising about 20 million turkeys per year.  Great to catch up with Farbest Foods and @natlturkeyfed to hear how they are serving Dubois County, providing jobs, and leading the industry with high standards. https://t.co/o3l0TOZqcf","date":"Thu Sep 23 13:43:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Here’s a #BehindTheScenes look at my meeting with the @IndianaChamber this morning. Indiana business owners and I discussed legislative priorities that will spark economic and job growth in Indiana—like my #EndlessFrontierAct. https://t.co/l7htFvsWKh","date":"Wed Sep 22 20:40:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"A vote to raise the debt limit is a vote to co-sign on the Democrats’ partisan and unprecedented spending spree. Republicans will not be complicit. https://t.co/3Hj2uTWgbB","date":"Wed Sep 22 20:08:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you @PurdueSports Athletics Director Michael Bobinski for meeting with me yesterday. It should be a great year for Purdue athletics. #BolierUp https://t.co/tm67B71ZvV","date":"Wed Sep 22 17:15:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Always a pleasure to meet with members of @GetLinkdMadison. Representing over 500 businesses and organizations, the Madison County Chamber works to help businesses grow and expand – driving economic growth and community success. https://t.co/JsrGa3y5MJ","date":"Wed Sep 22 15:03:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Republicans have stood up to socialism again and again. We must continue to do so by opposing this reckless tax-and-spend bill. https://t.co/tPqx9lQyEH","date":"Tue Sep 21 21:58:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Americans should be outraged by the process Democrats are using to ram through their liberal agenda and radically expand the government.","date":"Tue Sep 21 21:54:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Democrats’ $3.5 trillion reckless tax-and-spend bill would have harmful consequences across the board for our country and the freedoms we enjoy.","date":"Tue Sep 21 21:54:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This bill will incentivize R&amp;D in fields such as artificial intelligence, quantum computing, robotics, and biotech. The EFA also creates regional tech hubs, bringing jobs in these sectors right here to the heartland. Thanks #Concordia21 for the timely and important discussion.","date":"Tue Sep 21 20:05:49 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I joined @TechDiplomacy and @ConcordiaSummit this morning for a discussion on my #EndlessFrontierAct, which will change the way we invest in key technologies.","date":"Tue Sep 21 20:05:48 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Meanwhile, neither China, our number one geopolitical rival, nor Putin’s NordStream 2 pipeline, which aims to take over Europe’s energy markets, were mentioned by name in the President’s speech.","date":"Tue Sep 21 18:11:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In addition to the reassurances he’s offering, words will have to be met with concrete actions to build back trust and strengthen our alliances as we seek to address the threats facing our nation with clarity and strength.","date":"Tue Sep 21 18:11:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"President Biden’s @UN speech today vowed a shift from “endless war” to “endless diplomacy.” Unfortunately, the President’s rhetoric does not match reality.","date":"Tue Sep 21 18:11:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"One look at the streets of Kabul and it is clear that the war has not ended. Additionally, France, our oldest ally, just took the unprecedented step of recalling their Ambassador after a diplomatic mistake by the Biden Administration.","date":"Tue Sep 21 18:11:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It’s time to uncover what went wrong in Afghanistan. The days ahead demand a deep examination of how this happened and those responsible must be held accountable. Read more in this week’s #HoosierHighlights newsletter. \nhttps://t.co/xNXgcQ0p7G https://t.co/UbfkAvUeeu","date":"Mon Sep 20 22:00:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Steve Davisson was a public servant Hoosiers could always count on. He will be missed throughout Southern Indiana, particularly in his beloved hometown of Salem. https://t.co/LCu7LqrVwb","date":"Mon Sep 20 21:33:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My #EndlessFrontierAct invests boldly in technology and manufacturing. This legislation will allow for more people to innovate and pave the way for the next generation, just like Robert did. https://t.co/ixX8Tf9Dn5","date":"Mon Sep 20 20:10:01 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today’s #MarkerMonday is dedicated to Robert Graham whose commitment to innovation helped better his community of #Washington and is responsible for turning Evansville into an industrial powerhouse through establishing the Graham-Paige motor company.","date":"Mon Sep 20 20:09:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This morning I joined @GovHolcomb, @RepGregPence, and @Greensburg_IN Mayor Joshua Marsh at the Greensburg Honda plant. Thank you to the talented men and women who work every day to manufacture high quality vehicles. https://t.co/11mC61kH7H","date":"Mon Sep 20 17:04:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I visited the new site for L3 Harris Technologies’ Farnsworth Innovation Center. Thank you for your commitment to innovation and moving our country forward to the next frontier. \nhttps://t.co/g1vlfnpalS","date":"Sun Sep 19 17:25:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week, I helped introduce legislation to honor the 13 heroes who were killed in Afghanistan while protecting Americans and our allies. More here: https://t.co/MTtofARpxl","date":"Sat Sep 18 15:53:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy to see this journey come to a close for Dr. Singh. More here: https://t.co/swb8DuXnYg","date":"Fri Sep 17 22:13:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Had a great visit in Wabash yesterday. I visited with Mayor Scott Long and Assistant Police Chief Bob Pilgram to discuss worker shortages, inflation, and supporting our men and women in uniform. https://t.co/jvka4649JN","date":"Fri Sep 17 19:14:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 1979, this day was declared #POWMIARecognitionDay. Today we renew our promise to #NeverForget those who haven’t returned home and those who endured immense sacrifices for our nation.","date":"Fri Sep 17 18:13:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today I met with business owners and community leaders at the Huntington Chamber of Commerce meeting. Thank you for the important work you do with your community, and NE Indiana. https://t.co/Bf3XdXjVlg","date":"Thu Sep 16 20:32:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Investments in emerging technologies like artificial intelligence and quantum computing will be key for companies like L3Harris going forward. That’s why passing the Endless Frontier Act is so important for the future of our workforce. https://t.co/LZxzNBXuNw","date":"Thu Sep 16 19:05:37 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosiers welcome the expansion of L3Harris Technologies’ facility in Fort Wayne. The campus will address the @DeptofDefense’s urgent need for satellite programs and invest in innovative technologies, while also bringing new jobs to the Northeast Indiana workforce.","date":"Thu Sep 16 19:05:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"If there’s anything we’ve learned from 2020, it’s that we must take every reasonable measure to prevent future public health crises. 🎙 My conversation w/ @G17Esiason on how the common sense #PASTEURAct would help: https://t.co/FJuIlEv1DP","date":"Thu Sep 16 16:56:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/gsAuyNiwu8","date":"Wed Sep 15 20:26:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today I joined 29 bipartisan colleagues to introduce legislation awarding Congressional Gold Medals to the 13 American service members who lost their lives during the terrorist attack in Kabul, Afghanistan, including Indiana’s own Corporal Humberto ‘Bert’ Sanchez.","date":"Wed Sep 15 20:26:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I enjoyed meeting with members of the Indiana Agricultural Leadership Program this morning. We discussed trade, conservation, infrastructure, and the Farm Bill.  Thanks to these talented leaders for making a difference in their communities and supporting Hoosier ag. https://t.co/N4zs8ocYXx","date":"Wed Sep 15 20:20:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Since its creation in 1991, @INDOT’s Good Samaritan Hoosier Helpers program has assisted over 350,000 motorists in need on Indiana interstates. @INDOT’s leadership should serve as a model for auto safety across the country. More here:\nhttps://t.co/NBqER8b6gc","date":"Wed Sep 15 14:34:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we witnessed during  @SecBlinken's appearance before the @SenateForeign Committee, there is bipartisan outrage over the events in Kabul. The days ahead demand a deep examination of how this happened and that those responsible be held accountable. https://t.co/6Do7TyAuET","date":"Tue Sep 14 21:11:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I’m saddened by the passing of USS Indianapolis survivor Richard “Dick” Thelen. Mr. Thelen was admired for his sense of humor and vital role in planning USS Indy survivor events. Sending my thoughts and prayers to his family, friends, and the many lives he touched. https://t.co/UBtHhV4koT","date":"Tue Sep 14 19:45:02 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I'm encouraged by how Republican &amp; Democratic Senators are coming together to get answers and work with me to bring Congress back to the table on critical matters of war and peace. Having a strong group of supporters on my #AUMF repeal illustrates the importance of this issue.","date":"Tue Sep 14 17:26:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to @SenMikeLee @ChuckGrassley @RandPaul @lisamurkowski @JerryMoran @RogerMarshallMD @SenatorBraun @SenatorCollins @SenLummis for standing with me to ensure Congress speaks with a loud voice when it comes to matters of when and how to use our troops.","date":"Tue Sep 14 17:26:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks @PKCapitol for highlighting the important legislation @TimKaine &amp; I are working on to repeal outdated #AUMF. As events in Afghanistan indicate, it's time for Congress to reclaim war making powers &amp; decide how, when &amp; where our troops are utilized.\nhttps://t.co/fASkJSR12i","date":"Tue Sep 14 17:26:09 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"There are no words we can speak, no gestures we can make, no gratitude we can summon that will be ever be worthy of his sacrifice. #SemperFi.\nhttps://t.co/x12ri2ZynT","date":"Mon Sep 13 23:01:16 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Tomorrow, we will honor @USMC Cpl. Humberto Sanchez from Logansport, Indiana, who made the ultimate sacrifice in defense of our nation.","date":"Mon Sep 13 23:01:16 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Had a great week in Indiana visiting Hoosiers across the state. Read all about it in this week’s #HoosierHighlights newsletter.\n \nhttps://t.co/eajfD0mB4R https://t.co/96B55P7LVw","date":"Mon Sep 13 22:19:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 1898, Clinton Beckett introduced football to Pine Village High School helping spark the popularization of football statewide. #PineVillage #MarkerMonday https://t.co/V20EI0TJ4B","date":"Mon Sep 13 20:04:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @INFocusIndiana yesterday to discuss the botched exit from Afghanistan and the need for answers from the Biden-Harris Administration. More here: https://t.co/kwpRvtef6Y","date":"Mon Sep 13 18:51:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Indiana is one of the largest ag states in the nation. Thank you Hoosier farmers for all the hard work you do. https://t.co/Yd6vckOibn","date":"Sun Sep 12 19:57:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Great visit with the Brocksmith family farm this week in Vincennes. I enjoyed learning how they boost soil health through sustainable conservation practices. https://t.co/47F8A04DGb","date":"Sun Sep 12 13:35:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"https://t.co/Dcll8whiQ6","date":"Sat Sep 11 14:37:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This is a somber anniversary. We can celebrate, though, that at its worst hour, the world saw America at its best. No matter how many Septembers pass, let us never forget that. #September11","date":"Sat Sep 11 14:37:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It is difficult to believe that 20 years have passed since September 11, 2001. No matter the distance, it remains equally difficult to revisit the images and emotions of that day. The shock, grief, and anger. The Twin Towers, the Pentagon, and the field in Shanksville, PA.","date":"Sat Sep 11 14:37:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"SUNDAY: I’ll be on @INFocusIndiana with @DanSpehler on @Fox59 and @CBS4Indy. https://t.co/ABjffxBGUS","date":"Fri Sep 10 17:52:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"We already have a worker shortage, and this overreach will only exacerbate the problem. President Biden’s vaccine mandate will not stand up in court.","date":"Fri Sep 10 16:11:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I received the COVID vaccine and I encourage Hoosiers to do the same, but the President has no right to force private employers to intervene in their employees’ personal health decisions.","date":"Fri Sep 10 16:11:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Want to know more about my #PASTEURAct? I broke down the bipartisan bill to incentivize development of new antibiotics &amp; prevent future public health crises in a Q&amp;A with @pewtrusts: https://t.co/4Mh7uvG1MJ","date":"Thu Sep 09 19:15:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I led nine of my Republican colleagues on a letter to the Biden-Harris administration pressing for more details on their Afghanistan evacuation strategy. The American people deserve answers.  https://t.co/0PkhqH7Aq1","date":"Thu Sep 09 16:41:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Spent some time talking to farmers at the Wyss family farm in Fort Wayne last week. Our ag community reminds us what it means to be a Hoosier. https://t.co/kOmQK4MYVh","date":"Thu Sep 09 15:43:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This afternoon, I joined business and community leaders at the Danville Chamber Luncheon. We were able to discuss legislation facing Congress – like the Democrats’ reckless spending plan. This plan would raise taxes on hard working Hoosiers and hurt the middle class. https://t.co/KDNc7bsXSg","date":"Wed Sep 08 19:58:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"While at Purdue, I had the opportunity to thank members of the @NROTCPurdue @Purdue_AFROTC for their service. Americans are forever thankful for selfless patriots like these. https://t.co/hPkgJg1spd","date":"Wed Sep 08 14:52:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to @purduemitch for welcoming me to Purdue’s campus this week. https://t.co/CH26VX1IqH","date":"Wed Sep 08 14:24:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Honored to have presented Chad Clisby, the son of Larry Clisby, with a Congressional Record in honor of his late father. Larry was best known as the “Voice of the Boilermakers”. He will forever be remembered for his talents and dedication to @BoilerBall. https://t.co/JbaVfVI6cV","date":"Tue Sep 07 22:09:14 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Seeking answers from the Biden-Harris administration, a Hoosier’s inspiring story, and a visit to a family farm in this week’s #HoosierHighlights newsletter. https://t.co/ghgwS6zDJo https://t.co/KkGdkKvhah","date":"Tue Sep 07 21:13:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined my Republican @Senfinance colleagues to call for a thorough examination and debate of any forthcoming reckless tax-and-spend proposals from Senate Democrats. The American people deserve an open and transparent process. https://t.co/hAQGoCyZLM","date":"Tue Sep 07 19:00:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"#ICYMI: Spoke with @WOWOFarm during my visit to the Wyss family farm in Fort Wayne last week. Covered many issues facing Hoosier farmers today. https://t.co/cEgcrvzjHI https://t.co/szX3qkuydV","date":"Tue Sep 07 17:22:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the face of great challenges over the last year-and-a-half, Hoosier workers continue to create, adapt, and lift our economy. Today, we celebrate them. #LaborDay https://t.co/gvxE7oP6tk","date":"Mon Sep 06 13:04:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"September is National Workforce Development Month. Supporting workforce training is vital to businesses, workers, and the economy. More here: https://t.co/LTbQVLpihY","date":"Sun Sep 05 14:32:02 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I penned an op-ed for @USAtodayopinion on President Biden’s broken promise in Afghanistan. More here: https://t.co/uPUjdYrYM8","date":"Sat Sep 04 19:28:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to Indiana native @jeffpbutler and the @usawchrugby team for winning sliver at the #TokyoParalympics.","date":"Sat Sep 04 16:26:54 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Our brave men and women in uniform know you never leave an American behind. However, the Biden-Harris administration withdrew our troops and left Americans and our allies behind in Afghanistan. My thoughts in @fwbusiness:\nhttps://t.co/RhhwaKzkdl","date":"Fri Sep 03 22:03:55 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"📄NEW LETTER: Nine colleagues joined me in a letter to @POTUS seeking answers on how the Administration plans to evacuate the Americans and Afghan allies still on the ground in Afghanistan. Read it here: https://t.co/0PkhqH7Aq1","date":"Fri Sep 03 15:37:01 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks to the Wyss Family for hosting an agriculture roundtable in Fort Wayne. Great discussion on issues facing Hoosier farmers today like trade, conservation, climate, &amp; the next Farm Bill. https://t.co/oVOnjKaKDB","date":"Thu Sep 02 18:48:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to Fishers’ Noah Malone for winning a silver medal in the Track and Field 100m T12 event. #TokyoParalympics","date":"Thu Sep 02 17:32:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎙 #ICYMI: Stopped into @LafayetteQ1067 this week to talk to Gina about the latest issues important to Hoosiers: https://t.co/6wPrR33cAN https://t.co/p2vbb69iki","date":"Thu Sep 02 15:32:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Interested in joining a service academy? Join us tonight in Fort Wayne to learn more about the service academy nomination process. https://t.co/s2Txj8CdBF","date":"Thu Sep 02 15:29:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you Sarah for welcoming me to @INGuardsman today and sharing the tribute to our 76th Infantry Brigade combat team fallen heroes. https://t.co/NsfOah96Ns","date":"Wed Sep 01 21:49:40 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Two Academy Days in the books. Looking forward to seeing more young Hoosiers eager to serve tomorrow night in Fort Wayne. https://t.co/3lsmuD8sId","date":"Wed Sep 01 21:48:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Join us tonight in Indianapolis to learn more about our nation’s service academies and how to apply. Tomorrow, we will be hosting our third Academy Day in Fort Wayne. https://t.co/ObTkPfGhaR","date":"Wed Sep 01 18:24:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"America can no longer with a straight face say we leave no one behind. And the people I’ve spoken with are seething, embarrassed, ashamed. Read my thoughts on Afghanistan in @USAToday: https://t.co/uPUjdYrYM8","date":"Wed Sep 01 14:48:35 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to @E_A_swim from Terre Haute on his bronze medal finish in the 400m freestyle S7 at the #TokyoParalympics.","date":"Wed Sep 01 13:01:37 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Spoke to @IndianaUniv during their Artificial Intelligence Week about bold investments in frontier technologies. My #EndlessFrontierAct will help Hoosiers lead the way as we out-innovate, out-compete, &amp; outgrow China in the competition to win the 21st Century. https://t.co/q1riIYqkbZ","date":"Tue Aug 31 22:06:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you to @lifeatpurdue EVPRP Theresa Mayer and @PurdueEngineers Arvind Raman for welcoming me to campus. Appreciate your work to help Hoosiers lead the way in #innovation. https://t.co/N4vnq2svj1","date":"Tue Aug 31 21:01:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My first of three Academy Days this week is tonight in Hammond. Join my staff to learn more about the service academy nomination process. https://t.co/cxBWEWVsga","date":"Tue Aug 31 18:06:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Jennifer found it in Seymour. She's been sober for six years and is now a Celebrate Recovery leader, administering to women in the Jackson County Jail. Her story is inspiring. Let's make sure others can live it. https://t.co/xvqa8p3x5p","date":"Tue Aug 31 15:25:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy to visit with the Seymour Rotary Club yesterday and hear the great stories coming out of Jackson County. One of them is Jennifer Hopkins. Struggling with addiction, she came to Indiana from California in search of a second chance and a fresh start.","date":"Tue Aug 31 15:25:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Feeling called to serve? I’m hosting three Academy Days this week in Hammond, Indianapolis, and Fort Wayne to inform young Hoosiers about the service academy nomination process. https://t.co/r3ooOrOzJn","date":"Mon Aug 30 22:47:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As we approach #InternationalOverdoseAwarenessDay tomorrow, it’s important that we support struggling Hoosiers and provide them the services that they need. Learn more about the Stride Center’s work here:https://t.co/yVBdEdRX8U. #StrideMC https://t.co/VQF2Y368Yk","date":"Mon Aug 30 22:00:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"We need to support facilities like the Stride Center that provide needed resources like telehealth, support groups, and outreach to individuals suffering from addiction and mental health challenges.","date":"Mon Aug 30 22:00:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I visited the Stride Center in Bloomington to learn more about their important work helping Hoosiers struggling from substance use and mental health disorders.","date":"Mon Aug 30 21:59:59 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My prayers go out to our troops in Afghanistan during this trying time. More in this week’s #HoosierHighlights newsletter.\nhttps://t.co/Cw9EIe2mGb https://t.co/5xxQed9beo","date":"Mon Aug 30 21:34:29 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This #MarkerMonday is dedicated to the 80 Sisters of the Holy Cross who were among the first in the Navy Nurse Corps, which still exists and serves our heroes in uniform today. #Mishawaka https://t.co/o6ouGZrfm7","date":"Mon Aug 30 17:26:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Stop playing word games. You know that the Taliban are stopping Americans from reaching the gates. It is time to put a stop to that and lead with strength. #BringAmericansHome","date":"Mon Aug 30 13:38:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I send my heartfelt condolences to Cpl. Sanchez’s family and friends as we all grieve the loss of an American hero and Hoosier son.","date":"Sat Aug 28 02:43:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I am deeply saddened to learn that Cpl. Humberto Sanchez of Logansport, Indiana, was among the 13 U.S. service members killed in Afghanistan.","date":"Sat Aug 28 02:43:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In the Marines, our motto is Semper Fidelis, meaning always faithful. Humberto Sanchez embodies this commitment, and we must never forget his bravery and his sacrifice.","date":"Sat Aug 28 02:43:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Over the last 4 years, Congress and the Trump administration took significant steps to stop the U.S. from working with Chinese Communist Party companies that set out to steal our intellectual property.","date":"Fri Aug 27 20:17:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Now the Biden administration has given in to one of these companies, which could also worsen vulnerabilities in our own chip supply chain. https://t.co/ZkS8fEohGs","date":"Fri Aug 27 20:17:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As a graduate of the Naval Academy, I take great pride in nominating young Hoosiers to our nation’s service academies. Join my staff at one of our Academy Days next week in Hammond, Indianapolis, and Fort Wayne to learn more. https://t.co/mhs9NP7Uw5","date":"Fri Aug 27 18:32:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Every American patriot grieves as we witness this tragically avoidable crisis unfolding in real time. My full statement on the deadly attacks in Afghanistan: https://t.co/OlZ8jMRc6J https://t.co/f6YzubEKO5","date":"Thu Aug 26 23:09:19 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Please keep our brave service members in your prayers as they risk their lives to evacuate Americans and our Afghan allies.","date":"Thu Aug 26 15:06:44 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I reintroduced four bipartisan bills to help Hoosiers save and prepare for retirement. More here: https://t.co/xX9kXJvOGn","date":"Wed Aug 25 18:52:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Interested in joining one of our nation’s service academies? Join my staff next week at one of our Academy Day events in Hammond, Indianapolis, and Fort Wayne to learn more. https://t.co/hGhoDeHGBK","date":"Wed Aug 25 12:54:34 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The House just passed Democrats’ reckless $4.2 trillion budget resolution. This will enable Democrats to ram their tax-and-spend spree full of liberal wish list priorities through Congress in the coming weeks, hurting families for generations to come. https://t.co/OxT5kqwhwo","date":"Tue Aug 24 22:00:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My office is working to help Americans in need of assistance in Afghanistan. Email evacuation@Young.senate.gov to get in touch with my office.","date":"Tue Aug 24 17:12:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Joined @tonykatz on @93wibc yesterday to discuss the horrifying situation in Afghanistan. The Taliban are terrorists and it is critical that our country work day and night to evacuate all US citizens. https://t.co/V6b2W9JMwa","date":"Tue Aug 24 17:12:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Visited Notre Dame last week. Always impressed by the impact they are making in South Bend and across the globe. https://t.co/TomuicZ1R9","date":"Tue Aug 24 16:43:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Best of luck to #TeamUSA as the #Paralympics begin. I’ll be cheering on all the remarkable Hoosier athletes competing in this year’s games. https://t.co/k5ov0UDOWr","date":"Tue Aug 24 15:14:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Rising gas prices, protection for our Afghan allies, and opportunities for young Hoosiers in this week’s #HoosierHighlights newsletter.\nhttps://t.co/7Yq4zhi41s https://t.co/24OCQ3gaUA","date":"Mon Aug 23 21:23:55 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This #MarkerMonday is dedicated to Indiana’s newest historical marker in #Logansport. Before railroads and highways, the Wabash and Erie Canal connected Indiana to the world. Read more about this new marker honoring the Wabash and Erie Canal below.\nhttps://t.co/VuKk2Qz88b","date":"Mon Aug 23 18:21:11 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Interested in learning more about the United States Senate and the opportunity to earn a $10,000 scholarship? Juniors and seniors in high school are encouraged to apply to the United States Senate Youth Program. More here: https://t.co/edLwe5RCSU","date":"Sun Aug 22 18:36:02 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hoosier farmers are planting cover crops at a record rate to improve soil health and help the environment. My Conservation and Innovative Climate Partnership Act will build on these great efforts and support opportunities for innovative farming techniques. https://t.co/lGJiNe36lW","date":"Sat Aug 21 15:37:18 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Antibiotic resistance is a serious and growing threat to public health. Thank you @G17Esiason and @emmuhdag for sharing your story in @thehill and the importance of passing my #PASTEURAct to prevent another health crisis.https://t.co/hnAGdlzhOz","date":"Fri Aug 20 19:18:36 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Well said @CMC_MarineCorps &amp; @USMCSgtMaj. For all of those brave men and women — and their families — who have fought, and sacrificed so dearly, on behalf of our great nation, read: https://t.co/5mbYOsfAS1","date":"Fri Aug 20 13:09:57 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I spoke with @BMontgomeryWSBT this morning about the situation in Afghanistan. I’ll remind Hoosiers: if you need help getting a loved one home, contact my office at evacuation@young.senate.gov","date":"Thu Aug 19 21:31:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Over the past two decades, our service members have served with Afghan allies who courageously risked their lives to support the United States and our allies. Now, as we withdraw, their lives and the lives of their families are threatened by the Taliban because of that service.","date":"Thu Aug 19 17:52:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"We have a moral obligation to stand with them just as they stood with us. That’s why I supported and helped enact the Afghan Allies Protection Act: https://t.co/9xYdEdPNtf","date":"Thu Aug 19 17:52:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I was able to sit with a true American hero. Carver McGriff participated in the D-Day invasion. This summer, my dedicated staff helped facilitate his return to Utah Beach. I’ll always remember this visit. https://t.co/socmPl9uyc","date":"Thu Aug 19 13:42:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"By tapping our nation’s affordable and reliable energy resources, we can effectively place downward pressure on oil and gas prices for the benefit of American consumers. https://t.co/c0XtL1mB7L","date":"Tue Aug 17 17:35:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Yesterday, I joined a letter urging President Biden to reverse his decision to call upon OPEC and their allies to increase foreign oil production.","date":"Tue Aug 17 17:35:43 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @SenRubioPress, @SenRickScott, and @RoyBlunt to reintroduce the Protect Our Disabled Heroes Act of 2021 to protect disabled veterans from unethical practices when applying for VA claims. More on the bill here: https://t.co/1Y6PRYgGcz.","date":"Tue Aug 17 16:30:48 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My statement on the disaster in Afghanistan and more in this week’s #HoosierHighlights newsletter. https://t.co/UDu7WN1TSm https://t.co/0Cu8ITPr9q","date":"Mon Aug 16 21:08:46 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The @DeptofDefense &amp; @StateDept are working overtime to get Americans out of Afghanistan. \n\nIf you are a Hoosier and having trouble getting through, please reach out to my office.  \n\nEmail evacuation@Young.senate.gov and we will do everything possible to assist.","date":"Mon Aug 16 02:47:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The days ahead demand strategic clarity as we seek to realign our national security priorities to confront and deter a rising China while ensuring that Afghanistan does not once again become a safe haven for terrorists.","date":"Sun Aug 15 19:24:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"It is tragic how quickly those hard fought gains have been lost to the Taliban.","date":"Sun Aug 15 19:24:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"For 20 years, brave Hoosiers and other Americans have made significant sacrifices in an effort to transform the country of Afghanistan. We owe those who have served and sacrificed a deep debt of gratitude.","date":"Sun Aug 15 19:24:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I joined @TimPhillipsAFP in @NRO to discuss my #YIMBY act that would encourage localities to cut harmful regulations to drive down housing costs. More here:\nhttps://t.co/jXunMrMchU","date":"Sat Aug 14 16:16:47 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"“Em­ploy­ers are pay­ing more and wages are ris­ing, but in­fla­tion swamps those gains and erodes the stan­dard of liv­ing of the mid­dle class.” – @WSJopinion\nhttps://t.co/TJnwJbR3cs","date":"Fri Aug 13 18:47:20 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Someone should ask the President why he thinks oil produced by foreign dictators in Russia, Iran, or Saudi Arabia is more desirable than oil drilled by American entrepreneurs.https://t.co/MRUno6kgws","date":"Thu Aug 12 19:14:37 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Senate passed my bipartisan resolution honoring September as National Workforce Development Month. More here: https://t.co/LTbQVLpihY","date":"Thu Aug 12 17:55:25 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"At today’s Franklin Chamber lunch, nearly every hand went up when when I asked who was having trouble hiring and who was hurting from growing inflation. This is playing out across the state of Indiana. https://t.co/f16Dr1he1v","date":"Thu Aug 12 17:21:19 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"More on my decision to vote against the infrastructure bill: https://t.co/u5Dqn0bXGP","date":"Thu Aug 12 14:19:03 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I penned a piece in @NRO honoring the life of my friend and former professor Gary L. McDowell. His work in academia and the conservative movement will impact generations to come. https://t.co/Yo61pA0ACl","date":"Wed Aug 11 18:38:26 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I voted against Democrats’ reckless $4.2 trillion spending spree. This left-wing wish list will only raise taxes and hurt American families. https://t.co/wKLAs0ld9W","date":"Wed Aug 11 13:48:53 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"By passing my amendment, Democrats have the chance to keep the tax pledge President Biden and Vice President Harris have made to the American people. As President Biden said, ‘Not one penny. It’s a guarantee.’ https://t.co/cMQZ0rgjKP","date":"Wed Aug 11 02:08:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"If Democrats move forward with their $3.5 trillion wish-list, it will be working and middle-class families that bear the brunt of the costs and the Biden-Harris tax promise will be broken.","date":"Wed Aug 11 02:08:05 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"More than 60 times, President Biden &amp; Vice President Harris have pledged not to raise a single penny in taxes on anyone making less than $400,000 a year. I’m speaking on the @SenateFloor about my amendment to hold them to it: https://t.co/zH7NcFUbJG https://t.co/7t3LHc6wBY","date":"Wed Aug 11 01:35:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The @NTU voiced their support for my amendment that is now on the @SenateFloor. This will preserve and expand key research and development (R&amp;D) incentives for job creators as we rebound from the pandemic. https://t.co/1iTbcb7e1z","date":"Tue Aug 10 20:06:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Bob Jenkins was a motorsports icon. Sending my prayers to his family and loved ones. https://t.co/NHgodVHOJf","date":"Tue Aug 10 14:44:15 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today I spoke at @LifeatPurdue’s event with @GovHolcomb and @PurdueMitch announcing the construction of a new hypersonic testing center. This advancement will strengthen innovation in the U.S. and enhance our national security. https://t.co/K2rEYWZiNW","date":"Tue Aug 10 00:08:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My latest #HoosierHighlights newsletter is live. Read it here:\nhttps://t.co/YSCi0oysNr https://t.co/ASZK6sokvy","date":"Mon Aug 09 20:18:58 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My statement on the infrastructure bill: https://t.co/LAyk2wnUUU","date":"Mon Aug 09 00:39:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the #TokyoOlympics come to a close, I want to congratulate all the #TeamUSA athletes who represented our country at the games.","date":"Sun Aug 08 15:39:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Grateful to have more of my colleagues join my bipartisan legislation to finally repeal this outdated #AUMF and restore war powers back to the Congress. Read about this effort in the @WSJ.\nhttps://t.co/84rnThxASj","date":"Sat Aug 07 13:23:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Burdensome local zoning &amp; land use regulations drive up housing costs in communities across America. My #YIMBY Act encourages localities to cut these harmful regulations to help drive down prices. Learn more in my joint op-ed with @TimPhillipsAFP in @NRO: https://t.co/E5C0LeKHvV","date":"Fri Aug 06 19:31:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to Indiana native @monalynna_smile for winning a bronze medal at the #TokyoOlympics for the mixed 4x400 relay. #TeamUSA","date":"Fri Aug 06 17:06:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to the @PurdueResFound and @KeithJKrach on the launch of @TechDiplomacy. The intersection of tech innovations and our national security is vital to the future of the U.S. and a cornerstone of my Endless Frontier Act. #EndlessFrontierAct\n\nhttps://t.co/UJbLlKBrD6","date":"Thu Aug 05 17:44:06 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"SOON: I’ll be on the @SenateFloor to discuss the rising cost of living that is hurting Hoosier families. Watch here: https://t.co/zH7NcFUbJG","date":"Thu Aug 05 16:48:52 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thanks @Thomas_A_Berry and @CatoInstitute for this thoughtful piece on urgent judicial emergencies that my JUDGES Act would address.","date":"Thu Aug 05 15:00:27 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Ultimately, outdated AUMFs put America’s service men and women at risk and deprive them of the political support they deserve. I look forward to this important legislation coming before the full Senate. #AUMF https://t.co/n9L1CvO5jf","date":"Wed Aug 04 22:42:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My bipartisan bill to repeal the 1991 &amp; 2002 AUMFs passed the @SenateForeign Committee today. Repealing outdated AUMFs reasserts Congress’ role in authorizing military action &amp; taking away the blank check that multiple presidents have used to fight wars across the Middle East.","date":"Wed Aug 04 22:42:12 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Many Hoosier families are financially unprepared for retirement. This week, I reintroduced four bipartisan bills that would help boost retirement security. More here: https://t.co/aFPFBsyhi5","date":"Wed Aug 04 21:39:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Happy Birthday to the @USCG. Hoosiers are thankful for your commitment to ensure safety in the Great Lakes and beyond. https://t.co/tCZxJ58i8H","date":"Wed Aug 04 19:55:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Ahead of today’s @SenateForeign markup, @ConcernedVets shared their support for my legislation to repeal outdated AUMFs and reclaim congressional war powers. More here: https://t.co/45afx4YcQb","date":"Wed Aug 04 14:19:10 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to #Hoosier @lazorlaze on your bronze medal finish at #TokyoOlympics.  #TeamUSA\nhttps://t.co/mOBmll5ZYf","date":"Wed Aug 04 13:30:56 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I look forward to tomorrow’s @SenateForeign mark up of my legislation to repeal the outdated 1991 and 2002 AUMFs: https://t.co/3iE8ycThcG","date":"Tue Aug 03 21:40:43 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In today’s @SenateForeign hearing, I pressed @DeputySecState on whether these authorizations were still needed. Watch here: https://t.co/5Hoay4iiUO","date":"Tue Aug 03 21:40:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"For years I’ve been leading the charge to repeal outdated Authorizations for Use of Military Force in Iraq. The government of Iraq is now a partner. They're not an enemy of the United States.","date":"Tue Aug 03 21:40:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today we honor renowned WWII correspondent Ernie Pyle. Mr. Pyle dedicated his career to telling the story of the common solider, and it’s important that we remember this remarkable Hoosier journalist.\nhttps://t.co/NE2uosyEZa","date":"Tue Aug 03 21:28:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The Left’s latest $3.5 trillion tax-and-spend budget proposal is loaded with partisan pet projects and out of touch with taxpayer priorities. Learn more in this week's #HoosierHighlights newsletter:\nhttps://t.co/8g5JEKAvQp https://t.co/EGW8MTWs13","date":"Mon Aug 02 21:30:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week’s #MarkerMonday highlights an American favorite, Coca-Cola. The world-famous trademark for the Coca-Cola bottle was created in #TerreHaute at the Root Glass Company. https://t.co/qw3tSVDio6","date":"Mon Aug 02 18:34:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Thank you for your service to @IndianaUniv and @IUPUI. Congrats on your retirement.","date":"Sun Aug 01 17:01:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"ICYMI: I cosponsored a bill to help communities across the nation prepare and recover from disasters. More in @RiponAdvance’s article below:\nhttps://t.co/028LC7txCq","date":"Sat Jul 31 16:47:39 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Hundreds of Hoosier workers are needed for a new manufacturing facility in Indianapolis, and some lives have already been changed by being hired for this project. \nhttps://t.co/pvap4F7D3k","date":"Fri Jul 30 19:51:43 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today is opening day at the @IndyStateFair – one of the best events of the year. Learn more about this year’s festivities here:\nhttps://t.co/cFB9Id09BT","date":"Fri Jul 30 16:28:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In June, Indiana’s Lake Michigan Port saw a 52 percent spike in cargo compared to last year. This port plays an essential part in boosting our economy and helping Hoosier industries recover from the pandemic. \nhttps://t.co/pL6LVAPQNn","date":"Thu Jul 29 19:29:17 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"The current judicial emergency is hindering Hoosiers’ opportunity to have their day in court due to an overload of cases &amp; a shortage of judges. Just reintro'd my bill to increase the number of federal district judges in overworked regions of the country. https://t.co/HNdD810nmZ","date":"Thu Jul 29 17:00:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"My statement on the infrastructure bill below: https://t.co/grizWyjZOM","date":"Wed Jul 28 23:24:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"🎥 SOON: I’m joining @JackieDeAngelis to discuss the Biden-Harris administration’s tax-and-spend spree and the rising cost of living in America. Watch live on @FoxBusiness.","date":"Wed Jul 28 22:00:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to #Princeton native @JackieYoung3 for winning a gold medal at the #TokyoOlympics in women’s 3 on 3 basketball. #TeamUSA\nhttps://t.co/L08OeS19q3","date":"Wed Jul 28 16:07:50 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In light of the United States-Mexico-Canada Agreement’s first anniversary, we must address biotech issues with Mexico so our Hoosier farmers can have reliable markets. Watch today’s @SenFinance hearing below: https://t.co/RHsLHb8KY8","date":"Tue Jul 27 21:34:51 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Novelis’ continued investment in Terre Haute is great news for the workers and economy of West Central Indiana.\nhttps://t.co/ExWrNrc9J2","date":"Tue Jul 27 19:05:22 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congrats to #Evansville native @_king_lil for winning a bronze medal in the 100m Breaststroke at the #TokyoOlympics last night. #TeamUSA","date":"Tue Jul 27 17:25:07 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to Israel and Morocco. I hope normalization of relations with Israel will continue to transform the region. Shared economic activity and deeper understanding will result in peace and prosperity for both. 🇮🇱🇲🇦","date":"Tue Jul 27 15:34:07 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"During my time in the Senate, I’ve held great respect for Senator Mike Enzi. Mike was not only a former colleague, but a model of decency and collegiality. He was also my friend. I’m deeply saddened by the news of his passing, and I’m praying for his dear family and loved ones.","date":"Tue Jul 27 14:33:33 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"This week’s #HoosierHighlights newsletter features 3 new bills, my op-ed, and a recovered tax return. Read about these below: \nhttps://t.co/GSchXnqo1C https://t.co/3au1nP7gzz","date":"Mon Jul 26 22:17:41 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Praying for my former colleague @SenatorEnzi. I have great affection and respect for Mike and I wish him a fast recovery.","date":"Mon Jul 26 21:42:21 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"In 1913, Edgar Charles “Sam” Rice enlisted in the Navy. In 1915, he made his professional baseball debut with the Washington Senators. Rice missed most of the 1918 season after being drafted into WWI, but he helped the Senators win the World Series in 1924. #MarkerMonday #Morocco https://t.co/1NLyds9OG5","date":"Mon Jul 26 19:58:13 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Congratulations to Hoosier Olympians @apple_zach and @BPieronigold for their gold medal finish during the 400 freestyle relay at the #TokyoOlympics. Go #TeamUSA. https://t.co/b5NyyyUQWm","date":"Mon Jul 26 15:05:42 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"A great night with the family at Victory Field. Let’s go @indyindians! https://t.co/6tNK1EWBNv","date":"Sun Jul 25 23:16:32 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":".@Time ranked Indianapolis as one of the world’s greatest places in 2021. Our capital city is teeming with great restaurants, museums, and “Hoosier Hospitality”.\nhttps://t.co/g4cMVSxu0x","date":"Sun Jul 25 16:16:37 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"I helped introduce bipartisan legislation to strengthen @HUDgov's disaster recovery grants for states, local governments, and tribes. More on my Reforming Disaster Recovery Act below:\nhttps://t.co/wyt1e6LBIJ","date":"Fri Jul 23 19:44:28 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As the #TokyoOlympics commence, I applaud the talented Hoosiers representing #TEAMUSA. Good Luck!\n\nhttps://t.co/4R1GNy7lz5 https://t.co/22I3XV5Sf5","date":"Fri Jul 23 16:03:31 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"As I shared with @ForeignPolicy’s @RobbieGramer, we are very pleased that Qatar has pledged a $100 million contribution to @WFP to help end the world’s worst humanitarian crisis in #Yemen. https://t.co/paORyihEBu","date":"Thu Jul 22 22:39:45 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Today, I introduced bipartisan legislation that would repeal the archaic federal excise tax on heavy trucks and trailers, encouraging investment in safer and cleaner trucks while benefiting the economy and environment. More below:\n \nhttps://t.co/3di3AQ48gz","date":"Thu Jul 22 19:55:55 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"\"It could mean billions of dollars in funding for Indiana industry and the establishment of a technology hub in the state.\" @IIB #EndlessFrontierAct https://t.co/zC9Lbe6jGJ","date":"Thu Jul 22 17:08:00 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"After leading this effort for several years, I’m pleased that @HHSGov finalized a rule modeled after my legislation to reform the organ procurement system. More accountability to this system will help Hoosiers in need receive lifesaving organs. https://t.co/GAX27Cc4jL","date":"Wed Jul 21 21:41:23 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Taiwan is a valuable ally and a critical partner in deterring Chinese aggression in the Indo-Pacific. I am proud to join my colleagues in introducing the Taiwan Partnership Act to create a stronger security relationship with the Taiwanese armed forces.\n\nhttps://t.co/zyO1xmouV2","date":"Wed Jul 21 21:25:38 +0000 2021","user_id":"234128524"},{"handle":"SenToddYoung","text":"Social Security Administration commissioners are nonpartisan and serve 6-year terms. President Biden’s firing of SSA Commissioner Andrew Saul is a partisan ploy &amp; violates a 1994 law that shields the SSA from partisan political behaviors.\nhttps://t.co/jyEleafLh6","date":"Wed Jul 21 17:37:41 +0000 2021","user_id":"234128524"}]