[{"handle":"SenTomCotton","text":"The reason we have $5 gas is because of Joe Biden. This was his plan all along. https://t.co/0vZp8VU3qC","date":"Thu Jun 16 14:44:16 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Happy 186th Birthday to the Natural State! On this day in 1836, Arkansas became the 25th state.","date":"Wed Jun 15 15:39:19 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"The Chinese Communist Party and other foreign entities shouldn’t have access to sensitive government information. Our bill will prioritize American requests and prevent our adversaries from stockpiling U.S. government information.\nhttps://t.co/esxr0juZ2w","date":"Tue Jun 14 21:26:54 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Joe Biden shut down American energy to satisfy the radical left. Now gas prices are skyrocketing and he’s forced to beg for oil. Shameful. https://t.co/FKa7rB80d6","date":"Tue Jun 14 19:07:18 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"On Flag Day we pause to honor our national symbol of freedom and those who have served to protect it.","date":"Tue Jun 14 14:09:41 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Congratulations, @RazorbackBSB! WPS!","date":"Sun Jun 12 23:30:31 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"WPS!","date":"Sat Jun 11 18:20:33 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Violent felons commit the vast majority of gun crimes and should be held accountable for their actions. Instead of releasing criminals onto the streets to commit more crime, our bill will establish mandatory minimum sentences for repeat offenders.\nhttps://t.co/Xuo61mz8Qj","date":"Thu Jun 09 20:05:28 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"The only acceptable level of illegal immigration is zero. https://t.co/nalbkWKOBD","date":"Thu Jun 09 15:38:57 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Nothing to see here.","date":"Thu Jun 09 14:41:35 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"A Democratic hit man tried to kill Justice Kavanaugh today. Now, left-wing street militias have again announced their intent to protest his home in direct violation of federal law. Merrick Garland must arrest every single one tonight or resign in disgrace.","date":"Thu Jun 09 00:43:21 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Violent felons commit the large majority of gun crimes. \n\nIf Democrats are serious about stopping gun crime, they’ll support my bill to increase penalties and mandatory minimums for gun offenses. https://t.co/QiEzhh4DYs","date":"Tue Jun 07 16:34:30 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"If President Biden thinks it’s unethical for his staff to enrich themselves at the expense of the taxpayer, then why are his aides—many of whom have large amounts of college debt—designing a plan to transfer their debt to Americans who never went to college? https://t.co/y3gejOnqKl","date":"Mon Jun 06 23:30:04 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Today marks 78 years since the Allied forces stormed the beaches of Normandy. D-Day reminds us of the courage and heroic sacrifices our troops have made for freedom.","date":"Mon Jun 06 22:09:16 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"33 years ago, the Chinese Communist Party rolled tanks into Tiananmen Square, killing thousands of peaceful protestors seeking freedom. We will never forget the true face of Chinese communism that we saw that day or the bravery and sacrifice of those Chinese students.","date":"Sat Jun 04 16:18:24 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Upcoming travel? Friendly reminder to check your passport expiration date and contact my office if you need help with an expedited renewal before you leave!\nhttps://t.co/v549ZXoMTR","date":"Thu Jun 02 20:57:45 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"For nearly 250 years, Americans in uniform have fought and died so we could be free. Their legacy and our gratitude will live forever. We will never forget their sacrifice.\nhttps://t.co/XuNiI8S7UZ","date":"Mon May 30 14:03:40 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"China wants to gain power by manipulating the market and undercutting American businesses. Our bill makes it easier to investigate whether companies are making decisions to please their foreign investors.\nhttps://t.co/0Qa8PVa3x1","date":"Thu May 26 20:37:20 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"The Chinese Communist Party will use its digital currency to control and spy on anyone who uses it. We can’t give China that chance—the United States should reject China’s attempt to undermine our economy at its most basic level.\nhttps://t.co/gn5kHfLumj","date":"Thu May 26 19:12:57 +0000 2022","user_id":"968650362"},{"handle":"SenTomCotton","text":"Anna and I join all Arkansans in praying for the victims and the childrens’ families in Uvalde.\n\nAnd we’re grateful for law enforcement and the first responders who are helping in the face of this unimaginable evil.","date":"Tue May 24 22:12:33 +0000 2022","user_id":"968650362"}]