[{"handle":"SenWhitehouse","text":"I’m proud of my home state. These sensible reforms will save lives, and we have got to do our part at the federal level to prevent more carnage.","date":"Thu Jun 16 22:22:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This week, the RI General Assembly passed bills to:\n- Ban high-capacity magazines \n- Raise the minimum age to buy a firearm to 21 \n- Ban open carrying of loaded shotguns/rifles","date":"Thu Jun 16 22:22:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must shine light on the dark forces driving our addiction and overdose crisis, and recommit ourselves to supporting those fighting their own personal battle against substance use. My resolution with @ChuckGrassley ⬇️⬇️⬇️\nhttps://t.co/kY3H5GDbaK","date":"Thu Jun 16 20:11:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"You can’t say the Court should take care of its own ethics problems and then not take care of the Court’s ethics problems.","date":"Thu Jun 16 18:02:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Millions of U.S service members were harmed by toxic chemicals &amp; burn pits, but accessing care can be difficult. Today, we changed that. The bipartisan Honoring Our PACT Act is the kind of support our vets deserve, and I was proud to help this historic bill pass the Senate.","date":"Thu Jun 16 16:40:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court has been unwilling to look at its own problems regarding Justice Thomas. I'm looking forward to seeing what the Jan. 6 Committee has found. https://t.co/lcKG3IF10c","date":"Thu Jun 16 15:23:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Yet again. Still no serious action in Congress. Still negative corporate effort in Congress.  Still heavy fossil fuel hostility in Congress. Still enormous fossil fuel dark money spending around Congress.\nhttps://t.co/7P9Z2LX6ZR","date":"Thu Jun 16 13:39:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’ll be joining @Lawrence in a few minutes to discuss keeping our kids safe from gun violence &amp; the actors behind Jan. 6. Tune in soon.","date":"Thu Jun 16 01:45:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"These Scheme doctrines would hamstring federal agencies, undercut public health &amp; safety, and open up our government to even greater corporate political influence. This is what’s at stake when we talk about the captured Court.","date":"Wed Jun 15 23:54:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Then, they create an echo chamber of approval for their cultivated fringe ideas. The ideas get bounced around through other anonymously-funded affiliate groups, through law school clubs and conservative conferences - and ultimately to the Supreme Court.","date":"Wed Jun 15 23:54:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"How do they do it? First, they spawn an array of legal think tanks &amp; phony “institutes.” These are hothouses in which the deconstruction theories are grown; the factories where doctrines are crafted, reverse-engineered from the results the big donors want.","date":"Wed Jun 15 23:54:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"These donors need justices who will do what they ask, but they also need legal theories that enable justices to get around longstanding precedent. When you’re spending more than half a billion dollars on a Scheme, you can find solutions.","date":"Wed Jun 15 23:54:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Right-wing donors spent millions on a Scheme to capture our Supreme Court. Now it’s payday, and the Scheme is out to destroy established precedent and dismantle American government. Thread -&gt;","date":"Wed Jun 15 23:54:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel interests behind WV v. EPA are hoping for a big fixed win, and they’ve spent millions to get there. Unless you’re Big Oil, this could be incredibly bad news.    \nhttps://t.co/GLZXmNJSDO","date":"Wed Jun 15 21:21:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Perhaps at last answers on who prompted the Clark letter: it wasn’t his area of expertise, and his colleagues clearly didn’t respect him, so he’s an unlikely instigator. \nhttps://t.co/If1fER9M4D","date":"Wed Jun 15 19:34:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I'm chairing a Senate Caucus on International Narcotics Control hearing titled \"Oversight of the Office of National Drug Control Policy and its 2022 National Drug Control Strategy.\" https://t.co/0u1cSJQa1W","date":"Wed Jun 15 18:00:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Seniors have earned the promise of Social Security benefits by paying into the system over a lifetime of hard work. We cannot break that promise. In these uncertain times, our Social Security Expansion Act would ensure seniors get the dignified retirement they deserve.","date":"Wed Jun 15 15:44:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Many American manufacturers have worked hard to limit their greenhouse gas emissions, but their overseas competitors undercut them by polluting. \n\nA carbon border adjustment would level the playing field, and I have a plan to get us there.","date":"Wed Jun 15 13:24:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corporations should face consequences for price gouging. My colleagues and I introduced a bill to stop companies from charging unconscionably high prices. \n\nEnough is enough.","date":"Wed Jun 15 00:18:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I can’t think of a more important protection for the American people than a livable planet, but the fossil fuel industry is desperate to keep polluting for free. This brings me to the ruling expected from SCOTUS in a case called West Virginia v. EPA. https://t.co/ghJcMpFcle","date":"Tue Jun 14 21:32:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Will politicians with states under heat warning connect the dots? https://t.co/YCgjpASkm3","date":"Tue Jun 14 20:05:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court has been captured by special interests, and they aren’t going to stop with overturning Roe v. Wade. Here’s what West Virginia v. EPA could unleash: https://t.co/VDKWVrj0IM","date":"Tue Jun 14 17:39:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"North Carolina editorial supporting my windfall profits tax — good takedown of gas prices! The conservative government passed one in UK, too. Let’s do it.  \nhttps://t.co/D3RAnqm8YO","date":"Tue Jun 14 15:29:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A carbon border adjustment will incentivize American industry to set the international standard for clean production.\n\nIt’s why I introduced the Clean Competition Act, which is smart, market-based approach that will continue our proud tradition of global industrial leadership.","date":"Tue Jun 14 13:28:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I have a bill that would set things right. Let’s pass my Big Oil windfall profits clawback to return those excess gains to the American people.","date":"Mon Jun 13 23:25:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@SenJackReed and I are glad to deliver a $3 million investment in Pawtucket’s future that will make the area around the soon-to-be transit hub more inviting and accessible – a key to attracting more private investment and creating jobs. Congrats, Mayor @dongrebien! https://t.co/EkYXV2OMX7","date":"Mon Jun 13 20:42:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks @ProvChamber for your partnership as we continue working to grow RI’s economy and create jobs.","date":"Mon Jun 13 19:39:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good list, @DanMcGowan! \nhttps://t.co/YG6lJpzT3Q","date":"Mon Jun 13 17:25:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good piece by Dana Milbank on how climate denial has moved from “it’s a hoax” to “here’s our (phony-baloney) ‘plan.’”  Notable is its absence of actual emissions reductions.\n\nThe fossil fuel funding flows, and Republicans feel fine.\nhttps://t.co/Lk53QclbTv","date":"Mon Jun 13 15:36:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"High gas prices are not your local gas stations’ fault. This is being driven by Big Oil which has chosen to follow international cartel prices and gouge domestic consumers to make mega-profits.","date":"Mon Jun 13 12:59:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need real action to halt the grim regularity of gun violence. I look forward to learning the details of this proposal, particularly how it will handle juvenile records.","date":"Sun Jun 12 22:21:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Microplastics are everywhere. It’s time Congress stepped up. This is a plague. \nhttps://t.co/0Cx0muIzII","date":"Sun Jun 12 15:42:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Soon, the Court will release a decision in West Virginia v. EPA. This is a chance for the Court to advance a fringe right-wing theory and dismantle the core of modern government that protects you, your family, your community, and the environment.","date":"Sat Jun 11 22:32:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Cooked-up doctrines like the “major questions doctrine” make it easier for corporations to pollute your air and water, sell you dangerous products and tainted food, and get away with deceptive practices.","date":"Sat Jun 11 22:32:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The deregulatory campaign is driven by dark money, channeled through right-wing organizations that seek to influence the Court. \n\nWe need to pass my DISCLOSE Act to undo this corruption and make sure our institutions actually serve the American people.","date":"Sat Jun 11 22:32:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Overturning Roe is just one goal for the Supreme Court’s Republican justices. For decades, far-right donors have wanted to gut the EPA and weaken the federal government’s regulatory powers. THREAD -&gt;","date":"Sat Jun 11 22:32:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Lots of fun at the 250th anniversary Gaspee Days in Pawtuxet. Long before some tea was pushed off the docks up in Boston, Rhode Islanders blew up a British ship. Happy celebrating, RI! https://t.co/WE61ngM5Dl","date":"Sat Jun 11 18:51:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Affordable child care changes lives, strengthens families, bolsters our workforce, and builds brighter futures. Better pay is key. I was glad to bring to DC the lessons I heard last week from RI’s Beautiful Beginnings Child Care Center. https://t.co/3QebXbnZyv","date":"Sat Jun 11 16:56:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As we pursue a cleaner future, we can’t risk losing jobs to countries with bogus climate policies. I’ve introduced a carbon border adjustment that’ll hold foreign polluters to the same standards as American producers. \n\nThat's a win for both our economy and our environment.","date":"Sat Jun 11 13:32:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Successful investigations often \"follow the money.\" But when the money flows through anonymizing channels, investigators hit impenetrable dead ends. \n\nIt doesn't have to be this way. Our political system doesn't need to aid and abet the destruction of our democracy.","date":"Sat Jun 11 00:45:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":":-)","date":"Fri Jun 10 23:24:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If we want to fulfill America’s promise to our children, we need to use every tool at our disposal to ease the student debt crisis. Here are some policies I’m pushing for: \nhttps://t.co/91MgcubJwj","date":"Fri Jun 10 21:01:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Unfortunately the fossil fuel industry puts its own profits ahead of national security concerns, preferring to pollute whatever the cost to everyone else. \nhttps://t.co/R1Ogmd1u6D","date":"Fri Jun 10 17:29:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A glance at this chart shows how the U.S. produces the same goods with less CO2. That’s why I’m pushing for a carbon border adjustment to encourage clean production – at home and abroad. https://t.co/phXGjSpJqa","date":"Fri Jun 10 14:54:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Your utility bill could be funding shady anti-climate lobbying. My colleagues and I are trying to put a stop to that.\nhttps://t.co/mRs6AmOwAJ","date":"Fri Jun 10 13:10:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Oil chose to crush consumers and rake in huge profits. Now the White House joins me in saying we need to stand up to corporate greed and send money back to working Americans.\nhttps://t.co/qjBmplaoLH","date":"Thu Jun 09 23:13:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must look beyond the individuals who stormed the Capitol to the planners and funders who stoked the violence. Tonight, the House’s Jan. 6th Committee will shine a light on one of the darkest days in American history - and those who organized it.","date":"Thu Jun 09 22:08:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans pay into Social Security on the sacred promise of protection if disability strikes &amp; a dignified retirement in their golden years. Our Social Security Expansion Act delivers for seniors by expanding benefits to cover rising costs &amp; ensuring long-term solvency.","date":"Thu Jun 09 20:45:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It is notable how desperate the fossil fuel industry is to get these climate cases into federal courts, where they can be appealed to justices the industry paid to get appointed.\nhttps://t.co/IDWDtbc6k8","date":"Thu Jun 09 18:01:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/7nffm59je5","date":"Thu Jun 09 16:38:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Sotomayor calls out how “a restless and newly constituted Court sees fit to refashion“ rules and standards of law — in this case even the touchstone rule that on appeal from summary judgment the facts must be read in the light most favorable to the losing party.","date":"Thu Jun 09 16:38:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/9pzxqki3pc","date":"Thu Jun 09 14:20:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our bipartisan small business bankruptcy act is going to help working families regain their financial footing after a difficult few years. I’m glad that it will soon be the law of the land.","date":"Thu Jun 09 14:20:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/n4lMautHam","date":"Thu Jun 09 12:44:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My DISCLOSE Act would require groups that spend money in elections to disclose donors who gave $10,000 or more during an election cycle. Pass this law and the American people might find out who funded the Jan. 6 insurrection.","date":"Thu Jun 09 01:51:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The NRA has flooded American politics with dark money to defend their twisted ideology. That’s why the gun violence epidemic remains unaddressed.","date":"Wed Jun 08 22:56:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dr. Marcia McNutt of National Academy of Sciences accepts lifetime achievement award at CHOW, warning of “catastrophe for mankind in the future” if we don’t learn and change.","date":"Wed Jun 08 21:12:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our oceans have made life on land possible for billions of years. Now, as temperatures rise, they’re absorbing over 90% of the excess heat trapped by greenhouse gasses. If we want a livable planet, we must protect &amp; preserve our oceans. #WorldOceansDay","date":"Wed Jun 08 19:08:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Oil chooses to keep prices high &amp; gouge working Americans. I want to send those windfall profits back where they belong: your pocket.","date":"Wed Jun 08 17:21:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I met with a group of advocates from @Everytown who are calling on Congress to take action on gun violence. I am committed to taking on the NRA, bringing about real reforms, and making sure Americans feel safe going about their daily lives. https://t.co/572pmRuKYB","date":"Wed Jun 08 15:23:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/nqUyDM5xL0","date":"Wed Jun 08 13:10:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our Clean Competition Act will give clean American companies a step up in the global marketplace while lowering carbon emissions at home and abroad.","date":"Wed Jun 08 13:10:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good move. The climate crisis is at hand, and the United States needs to respond as we would to any disaster affecting our homes, jobs, and lives.\nhttps://t.co/Y8lXGKLg7U","date":"Tue Jun 07 23:37:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Live on the Senate Floor – how Rhode Island’s Gaspee Affair helped spark the American Revolution\n https://t.co/3Tkq8L4GOK","date":"Tue Jun 07 22:25:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It was a Tuesday in June 1772, and the Royal Navy’s H.M.S. Gaspee patrolled Narragansett Bay…tune in soon to watch my remarks on the Gaspee Affair. https://t.co/yBQsBNtcba","date":"Tue Jun 07 21:59:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Arrows keep pointing to Georgia: Trump’s pressure calls; plot from inside Trump DOJ; fake electors scheme.\nhttps://t.co/tNW9fMQ5qA","date":"Tue Jun 07 21:36:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":":-)","date":"Tue Jun 07 18:32:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The dark channels of influence that have corrupted our politics for years were used to plan and execute the Jan. 6 coup attempt. \n\nThe American people ought to know who the planners are and what they wanted — and we ought to help them find out.","date":"Tue Jun 07 17:20:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/6X2GA7KF1v","date":"Tue Jun 07 15:50:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We live this problem every day in Congress:  \n“Almost all CEOs say they believe the science of climate change. But behind the scenes they’re blocking everything …. [via their] lobbying and unlimited political spending, which is what’s blocking meaningful climate legislation.”","date":"Tue Jun 07 15:50:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hysterical, given Republican AGs funded by fossil fuel who are fossil fuel’s de facto agents; viz. Republican AG Pruitt sending out on his official letterhead a fossil fuel company letter virtually unedited.\nhttps://t.co/QkpLYAtTsw","date":"Tue Jun 07 13:36:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s a great remembrance of Walter.    Mark Patinkin captures him well.  \nhttps://t.co/aWYOCcARZT","date":"Tue Jun 07 01:37:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"International oil cartel prices soar, and Big Oil takes a Big Profits ride, on the same gasoline they sold two bucks cheaper not long ago. \nhttps://t.co/IXbvpeInRm","date":"Mon Jun 06 23:02:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In Congress, the fossil fuel armada of lies &amp; obstruction still operates full tilt; other companies talk big but send trade assocs. &amp; lobbyists to Congress who are silent or hostile on climate action; Republicans take fossil fuel $$$ and block anything serious. That’s the status.","date":"Mon Jun 06 20:47:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For all the big talk and corporate BS re caring about climate change, it’s still getting worse not better.  We know how to solve this (carbon price/clean energy investments); we choose not to. Why?\nhttps://t.co/601H1A8Kzf","date":"Mon Jun 06 20:47:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"How dark money hides the hands responsible for the attack on the United States Capitol on January 6.   \nhttps://t.co/CY9ZqVaood","date":"Mon Jun 06 17:59:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We’re trying to keep global heat increase below 1.5 degrees C (2.7 F). Look where Rhode Island already is. https://t.co/hv7bdtZddv","date":"Mon Jun 06 15:25:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republican Chuck Hagel on Big Oil: \n\n“What we now know about some of these large oil companies’ positions … they lied. And yes, I was misled.”","date":"Mon Jun 06 13:41:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/iUtbtmZJP3","date":"Mon Jun 06 00:28:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/YCjfxobEPm","date":"Mon Jun 06 00:28:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Funny how alike these two columns are, in separate papers on opposite coasts. It says a lot about where the Captured Court stands right now. Time to clean up the mess.","date":"Mon Jun 06 00:28:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Some of the court’s conservatives seem eager to assist polluting industries by undercutting the power of agencies to regulate in the public interest.”\n\nGuess whose dark money put them on the Court?   \nhttps://t.co/hjXdXarFEw","date":"Sun Jun 05 23:03:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is a Supreme Court determined to knock down regulations, overturn precedent, and cater to Republicans’ dark money donors. Soon, WV v. EPA will give them a long-awaited chance to do even more damage. Watch closely.","date":"Sun Jun 05 20:26:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts, where dark money and political influence don’t rule. \n\n(Which doesn’t mean law firms can’t aid and abet polluters by producing delay and burdensome costs, but at the end of the day there is a trial.)\nhttps://t.co/S2G6XfDbMt","date":"Sun Jun 05 18:19:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans are demanding commonsense gun safety laws. The gun industry will fight like hell, but we still hold the power to act.","date":"Sun Jun 05 15:24:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We could get a climate package via reconciliation with most of the Finance tax credits, the EPW methane price, and a border adjustment; which we probably need to do before August recess.\nhttps://t.co/n791nWY8D7","date":"Sun Jun 05 13:45:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"That could make a real difference in emissions, opening a pathway to climate safety.","date":"Sun Jun 05 13:45:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Small wonder that the CIA interfered with our Intelligence Committee report, and has never reconciled itself with its torture program’s failure.  \nhttps://t.co/mupjXExFO8","date":"Sat Jun 04 22:48:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Total Republican flim-flam on climate. Try measuring it for emissions reductions, guys. What a joke.\nhttps://t.co/J45h37cdq7","date":"Sat Jun 04 19:14:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corporations are raising prices simply because they can. I’m fighting back – to keep Americans’ money in their pockets.","date":"Sat Jun 04 16:48:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Popular Science goes to Quonset to watch EB’s master craftsmen build the most formidable vessels ever to sail the sea. Go, Rhody! \nhttps://t.co/cry64Xu6Wp","date":"Sat Jun 04 14:35:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans are fed up with secret donors influencing our elections. Democrats are fighting to pass the DISCLOSE Act to get dark money out of politics – so Americans can feel confident that Congress works for them.","date":"Sat Jun 04 13:13:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This proves the point that there’s no “energy independence” when the energy is oil. No way.\nhttps://t.co/6O192jwBfl","date":"Sat Jun 04 00:06:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I am thrilled @RIDOTNews won its largest federal grant ever from the INFRA program I created, and that the funding will support major upgrades to Rte. 146, like the elimination of the dangerous Sayles Hill bottleneck. Driving Rte. 146 will soon be more pleasant and efficient. https://t.co/SRFCn73j3p","date":"Fri Jun 03 18:55:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Still no explanation of how Exxon arrived at that projection. https://t.co/6scrj94TtT","date":"Fri Jun 03 16:37:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Someone needs to tell Exxon, who told shareholders there would be zero electric heavy duty trucks and buses in the world by 2040.  (Seemed fishy, since RI had already ordered three electric buses, and China had thousands in use.)","date":"Fri Jun 03 16:36:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Public Service Loan Forgiveness program has let down too many borrowers, including Peace Corps volunteers who deferred their payments while serving abroad. @SenJeffMerkley and I introduced a bill to fix that &amp; support our nation’s public servants.","date":"Fri Jun 03 13:33:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must pass the DISCLOSE Act to shine the light of transparency on dark-money power. Congress should work for the American people - not special interests.\nhttps://t.co/3J5hhobTVs","date":"Fri Jun 03 01:54:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"American companies are finding smart ways to reduce their carbon emissions. In fact, our manufacturers are 40% more carbon-efficient than the global average. Let’s reward them for that innovation through a carbon border adjustment.","date":"Thu Jun 02 23:34:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Let’s break the cycle of market concentration &amp; regulatory capture by big corporations. \n\nAmericans are sick of their greed.","date":"Thu Jun 02 21:29:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry lies for a living, deliberately and purposefully, and they lie to steal from you your future for their present profits, and they lie to hide from you their culpability for the evil they have wrought.","date":"Thu Jun 02 19:36:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Remember fossil fuel’s lie that climate action has big costs? “Yes, we should do something about climate but not wreck the economy”?","date":"Thu Jun 02 19:36:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Well, corporate analyst Deloitte says it’s a present value $43 trillion gain to address climate, and a $178 trillion loss if we fail to — a $220+ trillion dollar difference!  \nhttps://t.co/Kc5hcS1fVh","date":"Thu Jun 02 19:36:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Never, ever.","date":"Thu Jun 02 17:06:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"All the fossil fuel lies in the world can’t change the fact that there CANNOT be “energy independence” with a commodity whose price is set by OPEC and international speculators, and a domestic industry that has hooked itself to that international price.\nhttps://t.co/opEQ8LmD06","date":"Thu Jun 02 17:06:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This week, I visited Beautiful Beginnings Child Care Center in Providence to meet with staff and understand the challenges they face as care providers. This is important work that strengthens communities and prepares children for success, so we need to be investing in it. https://t.co/AieK7vizZg","date":"Thu Jun 02 15:49:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For scale, humans first appeared in North America about 23,000 years ago.  \nhttps://t.co/2htuFMfHQE","date":"Thu Jun 02 13:49:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"#PrideMonth represents decades of advocacy, activism, and hard-won progress. Americans deserve to be themselves and live the lives they choose, and I will fight to defend that freedom by passing the Equality Act.","date":"Thu Jun 02 00:54:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Excess profits could be $100 billion dollars, a bit of which will be plowed back into dark-money political spending for Republicans, rewarding them for their role in helping Big Oil gouge consumers.","date":"Wed Jun 01 23:03:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"They can do it in UK, under a conservative government; but today’s Republican Party is the political tool of the fossil fuel industry, so we meet “conservative” (read: fossil-fuel-funded) opposition. \nhttps://t.co/H7zoShvLy5","date":"Wed Jun 01 23:03:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Public Service Loan Forgiveness program has landed many Americans in a bureaucratic nightmare with no relief in sight. @SenJeffMerkley and I just introduced a bill to build on the Biden administration’s fixes &amp; help more people work for the public good.","date":"Wed Jun 01 21:02:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/x2FrKO2yew","date":"Wed Jun 01 21:02:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"When wealthy donors call the shots, it’s no surprise that Republicans plan to raise taxes for millions of hard-working Americans while protecting corporate interests.","date":"Wed Jun 01 18:58:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@EPA Brownfields funding from our bipartisan infrastructure law will put vacant, polluted lots back to productive use and breathe new life into neighborhoods in Woonsocket and across the state. https://t.co/WGtpFx2sqp","date":"Wed Jun 01 16:52:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The one through-line for Mitch is the political money.   It’s always about the political money, and the NRA is the conduit for masses of political money — $100 million in dark money alone.\nhttps://t.co/CwJFgB67gI","date":"Wed Jun 01 15:54:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"But the fossil fuel propaganda machine charged forward anyway.","date":"Wed Jun 01 14:12:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“In late March, AFP Fact Check, a global fact-checking organization, debunked the assertion that climate policies from the Biden administration somehow restrained oil and gas output, or undermined American energy security, calling it ‘misleading.’”\nhttps://t.co/UAaTSmwiBH","date":"Wed Jun 01 14:12:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Morale rises once you realize your own strength.”\nhttps://t.co/bz6umPHcEC","date":"Wed Jun 01 12:59:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"While we know ~$2.5B will come to RI through the bipartisan infrastructure law, a lot more funding is available through competitive grant programs, like the INFRA Program I created. Grateful to Partnership for RI for organizing to make RI even more competitive as we apply. https://t.co/K33Oc9ws8t","date":"Wed Jun 01 00:48:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If the decision to block the in-state merger leads to an out-of-state acquisition, it will have been a tragedy, and likely start a cascade of lost local control of Rhode Island hospitals.  \nhttps://t.co/mUY2tRKetO","date":"Wed Jun 01 00:11:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thus comes to its ignominious end this walking-zombie part of Trump’s political effort to use the DOJ to make war on Hillary Clinton.   \nhttps://t.co/fetO4aRweO","date":"Tue May 31 22:29:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Double-speak from fossil fuel industry — what a surprise.\nhttps://t.co/eE94ysWi9A","date":"Tue May 31 20:30:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We used to have an assault weapons ban in this country. The ban expired in 2004, and Congress – at the direction of the NRA – refused to reinstate it.\n\nSince then, mass shootings have become regular fixtures of American life.","date":"Tue May 31 18:27:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To those who knew Walter, he was an unforgettable Rhode Island character. I am sorry to learn of his death.  \nhttps://t.co/L9TSd8nRlN","date":"Tue May 31 16:47:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Oil’s effort to “remove” Rhode Island’s climate fraud lawsuit to federal court fails in First Circuit. They even tried to pretend this was an admiralty case, involving shipping. Anything rather than face the consequences of their misconduct.\nhttps://t.co/ckQC0tveCD","date":"Tue May 31 14:32:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s the longer version: the carbon footprint of cash sitting in banks that aid and abet fossil fuel pollution is a big contributor.  \nhttps://t.co/ixXnTlG45Y","date":"Tue May 31 13:22:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Beautiful day for the Lincoln Memorial Day parade. https://t.co/vcoHbHasFn","date":"Mon May 30 23:33:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/VQHXElqnC9","date":"Mon May 30 22:15:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rhode Island National Guard deployment send-off on Memorial Day at Quonset. https://t.co/ZVPmry1uQG","date":"Mon May 30 16:11:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hmmm. I wonder what the common theme here could be?","date":"Mon May 30 14:19:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Voter suppression and gerrymandering use enormous amounts of hidden political money to limit who goes to the polls, defeat majority rule, and thus control legislative action.","date":"Mon May 30 14:19:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court has been packed like some crooked railroad commission, using enormous amounts of hidden political money, to rule over us by going around legislative action.","date":"Mon May 30 14:19:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The NRA dominates Republicans, using enormous amounts of hidden political money to enforce a blockade of legislative action.","date":"Mon May 30 14:19:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry rules Republicans, using enormous amounts of hidden political money to blockade any serious legislative action on climate change.","date":"Mon May 30 14:19:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I can assure you he’s not the only one. Other judges are appalled at what they see on the Supreme Court. Let the deluge begin.\nhttps://t.co/WMbukHQgrn","date":"Sun May 29 23:47:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court’s Republican justices are determined to remake America - that shouldn’t surprise anybody, given the amount of dark money that far-right donors spent to put them there.","date":"Sun May 29 20:24:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This should tell you all you need to know.  https://t.co/TuwJRFvy3x","date":"Sun May 29 14:41:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The massacre of children &amp; teachers in Uvalde was a preventable tragedy, but laws to prevent such horrors are blocked by the gun manufacturers’ ruthless lobbying campaigns. Gun safety legislation is the only way forward, and breaking the grip of the NRA is the key.","date":"Sat May 28 16:07:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/u1h4lVfJc0","date":"Fri May 27 22:50:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is apparently not a hoax but actually from the company that made the weapon that massacred the children in Uvalde. https://t.co/KPTUJnplvF","date":"Fri May 27 22:50:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There is a lot Congress can do to prevent mass shootings: assault weapon bans, better background checks, high-capacity magazine bans. But Senate Republicans won’t act because of NRA money. The gun problem won’t be fixed until we fix what’s broken in our politics.","date":"Fri May 27 20:04:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our hearts are broken for the families of the little children and teachers who were massacred in their classroom in a Texas elementary school this week. This is not normal – Americans do not need to accept mass carnage in schools and grocery stores. https://t.co/lg39pxJUod","date":"Fri May 27 20:03:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Capitalism’s suicide machine” — banks still funding Big Oil.\nhttps://t.co/OvghbSJ0Cp","date":"Fri May 27 17:29:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need to fight for an America where you don’t have to have active shooter drills in schools. @MomsDemand @StudentsDemand @Everytown https://t.co/lPqdf20RGO","date":"Fri May 27 15:52:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congress won’t listen to them because the scientists just, you know, know what they’re talking about and tell truth, but don’t have SuperPACs and dark money front groups and lobbyists like the fossil fuel liars have.  \nhttps://t.co/uSZXr7TLTH","date":"Fri May 27 13:56:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If we could expose dark money in our politics, we could see how deep right-wing billionaire influence has become — including capturing the Supreme Court as its tool. My DISCLOSE Act would do that.\nhttps://t.co/0ooAktS1zU","date":"Fri May 27 01:12:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, Senate Republicans blocked a domestic terror bill that would have given us a chance to address gun violence in our schools. The NRA barks an order, they comply.","date":"Thu May 26 22:04:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And here’s the confession of a former gun industry executive, confirming the malign influence exercised by the gun industry through an absolutist NRA.  \nhttps://t.co/y8K0RPEdnb","date":"Thu May 26 19:33:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"…funded by gun manufacturers, building an empire of dark money influence as a political firewall against responsible action.","date":"Thu May 26 18:04:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In the wake of horrific massacres our rage &amp; grief are justified. But as time goes by, &amp; emotions pass, the NRA plows on relentlessly…\nhttps://t.co/wfm3A85iZn","date":"Thu May 26 18:04:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There’s a simple reason why we haven’t made progress on preventing mass shootings. https://t.co/mR4YkvsaqJ","date":"Thu May 26 16:11:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The NRA wants to talk about “reasonable” responses to massacres and murders, but there’s nothing about the NRA’s position that is “reasonable.” \n\nIt has an absolutist ideology about guns that is driven by economic motivation – to keep gun manufactures making profits.","date":"Thu May 26 14:00:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I’ll join @JoyAnnReid to discuss gun safety legislation and the gun industry playbook for blocking action.","date":"Wed May 25 23:28:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Remember: the NRA has a cynical playbook for moments like this. Don’t fall for it.","date":"Wed May 25 20:55:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It is intensely frustrating, to the point of sickening, to serve in this body while massacres of children and others take place in venues like grocery stores and elementary schools, and we do nothing.","date":"Wed May 25 18:10:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We are all too familiar with this kind of tragedy in America. Uvalde joins a long list of American communities torn apart by gun violence in our schools. The slaughter of our students happens with grim regularity, and it is met with equally grim inaction here in Congress.","date":"Tue May 24 22:15:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Those who stand against progress on common-sense gun protections should take stock.  We must do something.","date":"Tue May 24 22:15:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, we sustained another mass murder of innocent children. My heart breaks for the families of those killed, and for the community of Uvalde. I wish them comfort.","date":"Tue May 24 22:15:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It makes one wonder why we let corporations have such a dominant role in our politics.\n\nTheir climate behavior is showing corporations to be unprincipled and untrustworthy, a menace not a friend, in dealing with climate change.","date":"Tue May 24 19:10:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I was just in Davos, hearing lots of corporate happy talk on climate, and trying to explain the actual political effort from corporate America in Congress.  Basically, it’s the disinterested, the opposed, and the rabidly opposed, which sums to huge negative pressure.","date":"Tue May 24 19:10:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Add up the lobbying, the election spending and the trade associations, and you have huge anti-climate pressure in Congress from corporate America — led by the @USChamber, but it’s only one of a hundred negative corporate forces.","date":"Tue May 24 19:10:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Behind climate change inaction in Congress is climate change obstruction by corporate America. \nhttps://t.co/dmzAP6npzx","date":"Tue May 24 19:10:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A corporate climate pledge means nothing – absolutely nothing – if the company is still giving money to @USChamber. Their anti-climate lobbying has ost us precious years and brings us closer to disaster. \nhttps://t.co/KU5QNxNoug","date":"Tue May 24 17:30:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you, Rolling Stone and @Jaymichaelson, for digging into what dark money did to our court system. Infuriating. Unpatriotic. Corrupt.\nhttps://t.co/rlW8r2IXGr","date":"Tue May 24 15:15:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Or you could consider DOING SOMETHING ABOUT CLIMATE, for God’s sake!\nhttps://t.co/hasGGaO193","date":"Tue May 24 13:25:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Last week, we strengthened the enforcement tools the U.S. govt. uses to go after dirty money &amp; hunt down the international criminals who prop up Putin. We’ll keep making it harder for oligarchs to support Russia – nobody is getting off the hook for the invasion of Ukraine.","date":"Tue May 24 01:02:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Met with NATO military &amp; civilian leadership last week to discuss freedom for Ukraine. Every day, the Ukrainian people fight bravely; our support must match their courage. https://t.co/PYfOqmfYX6","date":"Mon May 23 21:39:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There are few individuals who’ve made a bigger difference in the lives of Rhode Islanders than @NeilDSteinberg. Under Neil’s energetic and thoughtful leadership, @RIFoundation has stepped up as a force for good every time the state needed it. We are grateful. He’s been a friend.","date":"Mon May 23 19:20:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Read the rest here – more to do, but this part is moving in the right direction.\nhttps://t.co/cqs6rDZ971","date":"Mon May 23 18:11:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s some good news - the Biden administration’s Justice40 Initiative is making progress. That means: \n- Replacing polluting diesel school buses \n- Creating public transit hubs \n- Removing barriers to employment in the green workforce","date":"Mon May 23 18:11:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Meanwhile, it is actually SNOWING IN BRAZIL.","date":"Mon May 23 16:32:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Nothing going on here. Please believe fossil fuel funded climate deniers.\nhttps://t.co/EppcM69YIK","date":"Mon May 23 16:32:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Long article, but a strong reminder of the disgusting effect dark money has had in our politics.⬆️","date":"Mon May 23 14:40:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I always expect American ingenuity and innovation to win the day — but particularly where we start with a 3x carbon intensity advantage!","date":"Mon May 23 12:58:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This @TheCLCouncil report shows how a carbon border adjustment levels the playing field &amp; rewards businesses that are doing things right. I’ll introduce my own soon.\nhttps://t.co/151mLuBvfN","date":"Mon May 23 12:58:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans are slashing carbon emissions &amp; making manufacturing cleaner. A border adjustment can help us benefit from that.","date":"Mon May 23 12:58:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The rotten Big Oil cartel is holding up the whole world, while trying to brainwash people that the solution is more oil. Can we truly be that stupid?\nhttps://t.co/y4ixnbH48k","date":"Sun May 22 22:04:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oh, dear. I’ve been sanctioned by a mass-murdering kleptocrat.","date":"Sun May 22 19:08:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Angus and Josh raise an important question: how is it that across the entire national security establishment (not just the IC), there was no dissenting voice anywhere suggesting Ukraine might win? Why such a blind spot? How to fix that?\nhttps://t.co/ELJJDyCmHu","date":"Sun May 22 17:38:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This week, I met with a group of Ukrainian writers &amp; human rights defenders who experienced Russian’s brutal invasion firsthand. Thank you, @PENamerica, for facilitating this visit and defending free expression. https://t.co/59Xh6mENud","date":"Sun May 22 15:36:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Smells like message-massaged masquerade to me. It’s not enough to “accelerate the energy transition,” particularly not in tandem with more fossil fuel; we need to avoid a looming full-on catastrophe, while we still can. https://t.co/dCYnO2j00I","date":"Sun May 22 13:34:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money spending for the 2022 election cycle already totals more than $115 million – I’d like to knock that number down to zero. Let’s pass my DISCLOSE Act to empower voters and bring big donors out of the shadows.\nhttps://t.co/bEHoApXq5U","date":"Sat May 21 23:51:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big corporations are pouncing on this moment to boost profits and enrich their buddies on Wall Street. It’s time to stop them from jacking up prices for working Americans.","date":"Sat May 21 20:05:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fun visit with @AnchorToffee, Rhed’s Hot Sauce, and all the amazing food businesses set up at @FarmFreshRI Food Hub. I’m glad to support the work Farm Fresh does to get healthy food into the community by delivering $581k in federal funding to help complete its Harvest Kitchen. https://t.co/qS87TvE2B7","date":"Sat May 21 17:12:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Proud to announce that @universityofRI has been awarded funding from Sea Grant, DOE, and NOAA to advance the stakeholder engagement process for future offshore wind projects. This is important work for our fishing &amp; coastal communities, and I’m glad to see it happen in RI.","date":"Sat May 21 15:59:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Happy birthday to my pal @alfranken! Miss you.","date":"Sat May 21 13:27:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Drip, drip, drip...\nhttps://t.co/sxyYRGSCT8","date":"Fri May 20 23:06:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Great news! Under @RichGlickFERC's leadership, @FERC has begun really important efforts, like looking at ways to build more transmission infrastructure. That will boost our resiliency to extreme weather and better serve American consumers.\nhttps://t.co/Fro1YbVx1a","date":"Fri May 20 21:45:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"You could knock a dollar off the price of gas tomorrow and the fossil fuel industry would still make money – that’s how grotesque their excess profits are. The industry is riding high on cartel prices, and it’s time to bring them back down to earth. https://t.co/71rO154xnq","date":"Fri May 20 19:00:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Pretty astounding that the Department of Justice turns a blind eye to this, to abundant academic research documenting the fraud, to litigation under way all around the country, and to its own successful tobacco case — an obvious litigation template.  \nhttps://t.co/vMkF2gmoaK","date":"Fri May 20 16:54:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"These stories are real. These programs are good. They lifted Rhode Island families. We need permanent child tax credit and robust child/elder care support.\nhttps://t.co/90U8opyKjt","date":"Fri May 20 15:24:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/F3kRmhcnY5","date":"Fri May 20 13:13:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/mo2HRnV9Jw","date":"Fri May 20 13:13:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s not just North Carolina. Rhode Island is losing homes to the sea, and if you go to StormTools you can see how much worse it’s going to get.  \nhttps://t.co/6CVPzuJMLH","date":"Fri May 20 13:13:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Understanding what’s happening at the Court requires understanding the problem of “regulatory capture” (often called “agency capture”).","date":"Thu May 19 23:54:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To say the Court is “conservative” misses the role of dark-money interests in packing the Court, their record of partisan wins at the Court, and the variance from “conservative” doctrine in so many of those wins.","date":"Thu May 19 23:54:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Unitary executive theory in the 5th Circuit ruling: https://t.co/jF41IXkfWK","date":"Thu May 19 19:36:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is what the Trump justices were appointed for. They auditioned for Senate Republicans &amp; big conservative donors by writing fringe opinions like this one. They want to see radical doctrines accepted by the Court that Dark Money Built – and imposed on the American public.","date":"Thu May 19 19:18:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Embracing this framework would grant a President nearly unchecked authority to use the government to do his political bidding. https://t.co/OFaaK07lKU","date":"Thu May 19 19:18:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"But the court didn’t stop there. Anticipating a Republican president, it weaponized another far-right legal doctrine that gained steam under Trump—the “unitary executive theory.”","date":"Thu May 19 19:18:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"That means environmental protections would go out the window. It means predatory behavior from lenders. It means an America where corporations can buck off regulations and make life worse for everybody who isn't a shareholder or a CEO.","date":"Thu May 19 19:18:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If these judges had their way, corporations &amp; special interests would be free of most regulation by agencies with political independence &amp; subject-matter expertise. Consumer safety &amp; well-being would be an afterthought, beholden to the agenda of right-wing dark money groups.","date":"Thu May 19 19:18:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The 5th Circuit Court of Appeals just used one of those hothouse theories to limit the SEC’s power to crack down on investment fraud. Known as the \"non-delegation doctrine,\" it would gut public-interest regulations and make life in America look very different.","date":"Thu May 19 19:18:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The right-wing scheme to control our courts just scored a big win in the 5th Circuit – a win that threatens a huge array of protections for Americans’ health, safety, and environment. Here’s how -&gt; THREAD","date":"Thu May 19 19:18:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"First, you need know it isn’t enough for right-wing donors to pack the courts with reliable judges; those judges need legal theories to justify their rulings. Enter the Scheme’s legal theory hothouse.","date":"Thu May 19 19:18:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our asset seizure plan will send a signal to Putin’s oligarchs that their days of thievery are numbered. All of their ill-gotten gains will be auctioned off, and the proceeds will be sent to aid Ukraine. https://t.co/dnxzUW3Kqt","date":"Thu May 19 17:38:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s Quahog Week here in Rhode Island, which means our local businesses &amp; markets are featuring this delicious mollusk on their menus. Check out @RhodeIslandDEM’s list of participating businesses here: https://t.co/96z7r9OpIe https://t.co/gg3znMRRrH","date":"Thu May 19 16:23:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There’s a lot the administration can do, right now, to cut emissions and expand renewable energy in this country. Let’s get moving!","date":"Thu May 19 15:10:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Full funding for FinCEN enforcement means better enforcement of my Corporate Transparency Act, which will help bring kleptocrats, drug traffickers, and other bad actors to justice.","date":"Thu May 19 13:24:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This was not a real contest, it was an operation.","date":"Wed May 18 23:58:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Please stop talking about this as a “win.” That implies something no longer true about the Court.  In fact, Republican senators and the Roberts Six are working in tandem to change American democracy for right-wing, dark-money oligarchs.\nhttps://t.co/7vMHXMkejn","date":"Wed May 18 23:58:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And the folks funding that Court-packing effort, and the folks funding Senate Republicans, and the folks who benefit from the decision, are the same folks.","date":"Wed May 18 21:28:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Talk about a closed loop: McGahn and McConnell get Gorsuch, Kavanaugh and Barrett onto the Court, then do a brief together telling them to unleash more special interest money and influence, which they then do.","date":"Wed May 18 21:28:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Sad but true. It’s institutional — there’s no place in the great Democratic cat-herd where long-term strategy is the day-to-day job.\nhttps://t.co/EBxaodNZ7G","date":"Wed May 18 19:41:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Happy Birthday to #HeadStart! These programs have helped children and families succeed for 57 years – it’s an investment in our future that keeps paying off, and generations of Americans are better off for it.","date":"Wed May 18 17:20:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is not a  “one bad apple” problem; it’s a problem of a Court captured by special interests, full of judges chosen by big donors in back room of Federalist Society.\nhttps://t.co/MeKtIsuYl7","date":"Wed May 18 16:16:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Court pretends that’s no problem, while helping the secret donors with more and more secrecy: won’t fix amicus disclosure; won’t enforce spending transparency; opened the door to new constitutional right to dark money for political group.","date":"Wed May 18 16:16:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Very glad to meet with advocates from @alzassocri to discuss ways Congress can support patients &amp; caregivers. You’re doing important work - thank you. https://t.co/5lGvGzgCKb","date":"Wed May 18 15:04:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A great overview here from @RFF on how to craft what’s called a carbon border adjustment – a way to cut carbon pollution and boost cleaner American manufacturing. It’s a clear win-win. I’ll be putting this idea to use in a new bill – stay tuned.\nhttps://t.co/fv1m73HJvJ","date":"Wed May 18 13:24:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Those right-wing forces spread the white supremacist hate that fueled the violence in Buffalo.  They should answer for it.","date":"Wed May 18 01:39:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts, where the victims of this horror can hold accountable news outlets, politicians and far-right leaders who foment violence by amplifying racist messages. \nhttps://t.co/uwnVSoEnRl","date":"Wed May 18 01:39:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We ought to be the City on a Hill; instead, we’re a dark repository for dirty money. We need to close the loopholes, end the secrecy, and fund our enforcement agencies like Treasury’s FinCEN. \nhttps://t.co/nMpn5qu17P","date":"Wed May 18 00:35:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@ZEROTOTHREE reports that in Rhode Island, 67% of infants &amp; toddlers have moms who work. Affordable child care can change lives and open doors for families – let’s make it happen.","date":"Tue May 17 22:34:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is a far longer story of Republican justices creating avenues for corporate political power, making it unlimited, and letting it be clandestine.","date":"Tue May 17 21:32:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Please, for God’s sake look behind the curtain. Look at who funds Republican senators; look at who funded the Court-capture operation. \nhttps://t.co/EVfyXKbub1","date":"Tue May 17 21:32:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Ukraine’s recent success in pushing Russian troops out of some occupied territory has prompted leaders from France to Germany to Italy to conclude that a once-unthinkable Ukrainian victory is now a distinct possibility.” \nhttps://t.co/0yn9R6t0GB","date":"Tue May 17 19:20:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Russia’s oligarchs are part and parcel of how Putin has manipulated his country and accreted enormous wealth to himself. We’re poised to pass nearly $100M to target those oligarchs and their dirty assets. https://t.co/28bE5AJkR0","date":"Tue May 17 16:43:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The “dark money maze” extends well beyond Trump. It packed the Supreme Court; it foments climate denial; it funds Republican politics.\n\nTime to clean the swamp. Start with disclosure—a little daylight will get the cockroaches scuttling.\nhttps://t.co/i7hvAMNWbX","date":"Tue May 17 15:29:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Affordable child care is one of the best things we can do for American families. They’re counting on us, so let’s get this passed.","date":"Tue May 17 14:05:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Want a peaceful and interesting ten minutes? Check out these deep sea images. \nhttps://t.co/aGjny9Mcoo","date":"Tue May 17 13:25:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Watch for more on carbon border pricing. I have a good feeling about this solution, especially as the European Union moves toward similar measures. Meanwhile, I’ll keep pushing ahead.  \nhttps://t.co/b9Gmwhwh4g","date":"Mon May 16 21:36:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need to stop the kind of price gouging we’ve seen from Big Oil and other corporate bad actors during this global health crisis, and help Americans afford groceries and transportation. I’m glad to join @SenWarren in offering the Price Gouging Prevention Act of 2022.","date":"Mon May 16 20:07:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"@ChrisVanHollen Very relieved to hear that my friend @ChrisVanHollen is on the mend. My thoughts are with him and his family.","date":"Mon May 16 19:57:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@RI_infrabank will put funding from our bipartisan infrastructure law to good use improving Rhode Islanders’ drinking water and cleaning up Narragansett Bay.","date":"Mon May 16 19:39:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks @rikidscount for creating an amazing resource to help get kids off to a stronger start. I’m working hard in Washington to invest in RI kids by improving child care, education, and support for families.","date":"Mon May 16 18:44:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Republican donor interests built their supermajority to deliver wins like this one – wins that help special interests skirt our democratic process to achieve what they want. The Court’s reputation cannot withstand much more of this.","date":"Mon May 16 16:57:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Justice Kagan has it right in her dissent: greenlighting the payment schemes at issue in this case \"bring[s] this country’s political system into further disrepute.\"","date":"Mon May 16 16:57:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republican donors’ biggest booster, Mitch McConnell, gave away the game in his brief in this case - he called for gutting our campaign finance laws altogether. He made clear he wants an America where corporations &amp; the wealthiest few wield near-total control over our politics.","date":"Mon May 16 16:57:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court’s ruling in FEC v. Cruz is another victory for right-wing donors in their assault on our campaign finance system, and another step toward unlimited special-interest spending in our elections.","date":"Mon May 16 16:57:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’d love to see how much of that money goes to front groups to buy political obstruction of climate legislation, but they keep it secret for a reason. \nhttps://t.co/VxB0BUaT2o","date":"Mon May 16 15:39:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/zpA04G7qkT","date":"Mon May 16 13:51:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Annihilating Roe means women with the least will suffer the most. That’s flat wrong.","date":"Mon May 16 00:39:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Even BoJo is looking at clawback of Big Oil’s grotesque price-gouging and excess profits! Time to stand up for consumers. https://t.co/06TQ6OWSSO","date":"Sun May 15 19:43:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Tremendously bad” isn’t justices picked in Federalist Society back room, isn’t dark money campaigns to confirm them, isn’t right-wing front group amicus flotillas, isn’t 80-0 partisan win rate for Republican donor interests. Nope, it’s a leaked draft.  \nhttps://t.co/fZshMCV6ba","date":"Sun May 15 17:45:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One weekend, two horrific shootings in America. We must act to rid ourselves of gun violence, and we must reckon with the unbridled hate that too often drives it.","date":"Sun May 15 16:08:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Image from the Law Enforcement Officers Memorial candlelit vigil this week. Thank you for your service and sacrifice. https://t.co/rkv82QTUo0","date":"Sun May 15 01:38:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congrats to all of today’s @CollegeUnbound graduates! Glad to be there for a joyous occasion and to announce $750k in federal funding to create new opportunities for adult learners at College Unbound’s future Community Learning Center in South Providence. https://t.co/lrHsml2GsR","date":"Sat May 14 21:57:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Last year, my colleagues and I published a report detailing the Republican takeover of our judiciary. The consequences for reproductive rights are dire.\nhttps://t.co/lt4YRDGPht","date":"Sat May 14 21:50:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A political party violated every norm to achieve their majority on the Supreme Court, overturn Roe, and impose their ideology on millions who don’t agree with them. How are Americans supposed to have any faith in this system?","date":"Sat May 14 21:28:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/yORtBuuaEu","date":"Sat May 14 17:36:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Pretty good thumbnail summary of “how it works” over at The Court That Dark Money Built (it’s actually even worse): https://t.co/ucUHqUNRxj","date":"Sat May 14 17:36:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Plastics recycling is a joke because plastics industry takes no interest. They treat it as the public’s problem, don’t invest, and take no responsibility. “Privatize the profit, socialize the harm” is too often industry’s motto.\nhttps://t.co/mzgBqkbsa6","date":"Sat May 14 15:36:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Time for results. Look where talk and pledges got us. https://t.co/unNyUz60hV","date":"Sat May 14 13:34:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@RIPTA_RI will be able to run its busiest route entirely with electric buses once this new charging station is complete - lower emissions and cleaner air in communities that have borne the brunt of pollution for too long.","date":"Fri May 13 22:25:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We can’t tolerate a system that lets dark money groups operate without oversight – not when they spend 100s of millions per election cycle without disclosing their donors. \n\nCitizens are denied the basic right to know what is going on around them in their democracy.","date":"Fri May 13 21:38:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The infant formula shortage demands immediate action, and my colleagues and I are pressing manufacturers for solutions. I will keep fighting on behalf of the parents, caregivers, and children affected.","date":"Fri May 13 19:02:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Back in 2020, we published a Captured Courts report that charts the path ahead:\nhttps://t.co/IFKzhnoRif","date":"Fri May 13 17:41:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Roe is just one target for the far-right organizations that captured the Supreme Court - our democracy is also in peril. Remember, this is the same crew that unleashed dark money with Citizens United and gutted the Voting Rights Act to permit widespread restrictions.","date":"Fri May 13 15:36:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Brutal. The price of fossil fuel isn’t just at the pump. https://t.co/KevAz0WY0G","date":"Fri May 13 13:35:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Chosen in a Federalist Society back room; powered through confirmation on waves of dark money; listening to flotillas of phony front groups; and delivering constantly for right-wing special interests — what could people possibly find wrong with that? \nhttps://t.co/xSgkA4CuNA","date":"Fri May 13 01:18:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To understand how much climate change is warming our oceans, you need to understand what a zettajoule is. Here’s the breakdown: https://t.co/1kYrjlEugP","date":"Thu May 12 23:28:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I hope the Appropriations Committee ends this harmful rider and permits the IRS to set regulations that clarify what 501(c)(4) organizations can and cannot do. That will make a real difference in the fight against dark-money influence. https://t.co/V5IOKpXlpg","date":"Thu May 12 21:50:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Since Citizens United, Republicans have stopped at nothing to protect dark money. A big part of their defense is blocking the IRS from setting clear rules for dark money organizations.","date":"Thu May 12 21:50:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We’re calling on Congress to take action to help federal authorities seize oligarch assets – like the mega-yachts, jets, &amp; mansions belonging to Putin &amp; his cronies – and use the proceeds from the sale of those assets to aid the people of Ukraine.   https://t.co/Byy9KvAfkk","date":"Thu May 12 19:49:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I’ll be on the floor with Sen. Blumenthal and Sen. Graham to speak about the importance of holding Putin &amp; his oligarchs accountable for their aggression toward Ukraine. Tune in soon.","date":"Thu May 12 19:24:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/Tybuil4WxC https://t.co/31DB92eIl7","date":"Thu May 12 18:39:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/gDD6VBVErc","date":"Thu May 12 18:39:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/upwOTRfwmW","date":"Thu May 12 18:39:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/dXjxNZ9Cps","date":"Thu May 12 18:39:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It wasn’t crickets everywhere – I was sounding the alarm on this case from the beginning. https://t.co/ehI0bNEVf4","date":"Thu May 12 18:39:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Around for millennia.  \nWonder of the world.  \nVisible from space.   \nAnd fossil fuel industry is killing it off.  \nhttps://t.co/mbIbSC0rE8","date":"Thu May 12 16:31:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"He is right. It’s still unexplained how the entire national security establishment — officialdom, think tankery, media, the whole “Blob” — all unquestioningly got this so colossally wrong. It’s a cautionary tale.\nhttps://t.co/wiYH21EzgC","date":"Thu May 12 14:56:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My bipartisan CARA 3.0 would expand the drug prevention, treatment, and recovery programs we need to turn the tide of this public health crisis. My previous CARA bills are boosting those efforts already, but there’s lots more to do.","date":"Thu May 12 13:25:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The CDC report on drug overdose deaths is heartbreaking – over 100,000 Americans lost to the addiction crisis in 2021. This must be a call to action. \nhttps://t.co/si5j596VPz","date":"Thu May 12 13:25:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Taking away the constitutionally protected right to abortion isn’t about compassion – it’s about control.","date":"Wed May 11 23:03:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Republican Party used to defend individual liberty and the right to privacy. This vote shows those days are over. That is a shame.","date":"Wed May 11 20:34:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must also shine a light on the right-wing special interests that packed the Supreme Court with the current Republican majority – a majority that is enacting an extreme agenda at the expense of the Constitution and the American people.","date":"Wed May 11 20:34:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, I cast my vote to protect access to abortion nationwide, and to stand up to a Supreme Court intent on tearing down a constitutional right of every woman in this country. We must fight back against this assault on women’s right to choose if and when to have a child.","date":"Wed May 11 20:34:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Looking forward to seeing @RICNews put this federal designation to work creating new opportunities for students.","date":"Wed May 11 19:32:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Ukrainians also expressed strong confidence that they will defeat Russia in the current conflict. When asked if they will win the war, 97% of Ukrainians said yes. Further, 83% believe that the war will end before the end of 2022.”","date":"Wed May 11 18:52:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"#Janus was the result of a yrs-long effort by a network of ultra-wealthy, conservative ideologues to cripple the political power of public employee unions. @AFTunion President Randi Weingarten &amp; hard-working union members fighting back. Proud to join them to highlight that fight.","date":"Tue Jul 10 19:17:18 +0000 2018","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Nice to see our own national security establishment coming around to treating Ukrainian victory seriously.   \nhttps://t.co/CMPIR8m7EH","date":"Wed May 11 18:52:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This was a right-wing enterprise - an enterprise of building a Supreme Court that will overturn Roe v. Wade https://t.co/kB9OUkS58T","date":"Wed May 11 16:53:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A new search for an important piece of RI’s history just as we get ready to celebrate the 250th anniversary of the burning of the Gaspee. Let’s see what Dr. Abbass can find!","date":"Wed May 11 14:09:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Over a year ago, my colleagues and I laid out the damage they’ve already done to civil rights protections in this country. Read more here:\nhttps://t.co/Rj83ffDGCS","date":"Wed May 11 12:17:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court's Republicans won’t stop with Roe - they are poised to weaken anti-discrimination laws and reverse what progress this country has made towards equal justice. The societal costs will be devastating and immense.","date":"Wed May 11 01:14:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A captured Court – that is delivering for the special interests that stacked it, and helping to keep their secrets – has had its integrity and independence pretty well demolished.  https://t.co/sJyPOJT2zz","date":"Wed May 11 00:01:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m heading to the Senate floor to unmask the scheme to control our Supreme Court – a scheme now poised to destroy a woman’s right to make decisions about her body.","date":"Tue May 10 23:40:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I’ll be on with MSNBC’s @JoyAnnReid to discuss the captured Supreme Court and the path ahead for Roe. Tune in soon.","date":"Tue May 10 22:47:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts.  https://t.co/5GBtwVgLCJ","date":"Tue May 10 21:43:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“The justices...never told us they thought Roe was wrongly decided. On the contrary, they spoke of their great respect for precedent, often at length. Whether you call this lying or not, it was certainly intentional misdirection and evasion.”\nhttps://t.co/zkEx6TKPXW","date":"Tue May 10 19:57:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hohn is right. “Engagement” is mostly window dressing. Just look at “engagement” of #ChamberofCarbon with its “climate-friendly” members — stall tactic/no result.   \nhttps://t.co/7tMb7oWHPh","date":"Tue May 10 18:20:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans deserve the basic freedom to determine if and when to have a child.","date":"Tue May 10 16:26:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Jennifer Rubin is a conservative columnist driven from the party by Trump. Freed of Trumpery, she has a candid and laser-focused analysis of the “partisan, radical majority” on the Court.   \nhttps://t.co/KD5I2CKRUT","date":"Tue May 10 14:28:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The damage is profound, offsetting as much as half of all new clean power anticipated from offshore wind. Ouch.\nhttps://t.co/tlSGXQ1miF","date":"Tue May 10 13:33:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congratulations to @washingtonpost on this well-earned recognition. You’ve shined important light on a very dark day for our democracy.\nhttps://t.co/L7b9nZGkdo","date":"Tue May 10 01:26:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Private equity will remain a haven for international criminals until we enforce real anti-money laundering requirements. Wall Street needs to step up and consider national security.\nhttps://t.co/ghMcCpVDGw","date":"Tue May 10 00:33:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Remember zettajoules. https://t.co/3wSY8DvFMR","date":"Mon May 09 23:04:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Pharmaceutical companies are hiking insulin prices just because they know people with diabetes will go to lengths to find a way to pay for the lifesaving drug. Joined @SenJackReed to call on Congress to fix this once and for all by capping out-of-pocket insulin costs at $35. https://t.co/BtT1rMjHZC","date":"Mon May 09 20:46:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/AF6qTjSsCe","date":"Mon May 09 19:31:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oh my, such conservative leaking going on, about private Court deliberations. Surely Republicans will be outraged... https://t.co/OuILdtmu8y","date":"Mon May 09 19:31:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukrainians show as much guts on rebuild as they do on resist. Impressive!   \nhttps://t.co/NRluC3l5fn","date":"Mon May 09 17:55:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Samuel Alito’s antediluvian draft opinion is the Puritans’ greatest victory since they expelled Roger Williams from the Massachusetts Bay Colony.”\nhttps://t.co/4V4QJm1Xr1","date":"Mon May 09 17:02:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Carbon pricing, most effective climate repair, requires “business leaders actively pushing for them, or at the very least not standing in their way.”  Guess who’s doing neither?  Start w #ChamberOfCarbon.\nhttps://t.co/bUqawJqkHu","date":"Mon May 09 14:56:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Plastics industry needs to own its mess, build real recycling, and go get the plastic waste all over the world into proper disposal.  \nhttps://t.co/Cxhw5gGeds","date":"Mon May 09 13:33:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I have enormous respect for Mary Ann’s courage and accomplishments — a trailblazer.  \nhttps://t.co/zPGg4q6lXR","date":"Sun May 08 23:03:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oh, please.\nhttps://t.co/Shja992rSM","date":"Sun May 08 19:38:20 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As we voted on motions to instruct on COMPETES bill, I noted that almost half of Republican motions were anti-climate.  Even now, with all we know.","date":"Sun May 08 18:31:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Well done, Madam First Lady!!\nhttps://t.co/74Ez4BoTAt","date":"Sun May 08 15:00:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Happy Mother’s Day! I support the moms (and dads) across the country who are fighting for affordable child care – it’s time to stand up for working families, support care providers, and create better lives for American children. #SolveChildCare","date":"Sun May 08 13:27:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"No, much better to be an institution bought into giving just the outcomes they want to the dark money donors behind the Federalist Society and Judicial Crisis Network.","date":"Sun May 08 03:47:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thomas: “We can’t be an institution that can be bullied into giving you just the outcomes you want.”\nhttps://t.co/PirLRdU41D","date":"Sun May 08 03:47:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"What a moment for Rich Strike in the Derby. Cinderella story!","date":"Sat May 07 23:53:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Next, DOJ should give a serious look at climate litigation, including an investigation of wrongdoing by fossil fuel industry. DOJ seems too often behind the v. and then losing to environmental groups in court. Hello? Anyone home? Oh, right, no nominee for Civil Chief position...","date":"Sat May 07 23:24:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is good news. For too long, big polluters have run roughshod over our neediest communities, exposing them to dangerous levels of pollution. It’s time for this to stop.\nhttps://t.co/EUhBsoJxYD","date":"Sat May 07 23:24:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Pausing to honor the memory of RI firefighters lost in the line of duty. Our state is forever grateful for the courage and sacrifice of our first responders and their families. https://t.co/uEsTbmg2lv","date":"Sat May 07 20:46:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And don’t think this ends with abortion. This is also about polluters getting to pollute for free, big corporations being deregulated, dark money being baked into our politics, and minority voters kept out. Buckle up.","date":"Sat May 07 17:36:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is why the apparatus exists of dozens of front groups to write “amicus” briefs in chorus instructing the Court what to do.","date":"Sat May 07 17:36:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is why they eliminated the filibuster for Gorsuch.\n \nThis is why they pressured the FBI to tank the Kavanaugh investigation.\n \nThis is why they broke the “Garland rule” to stuff Barrett on the Court mid-election.\n \nThis is why $580 million was spent to capture the Court.","date":"Sat May 07 17:36:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is why the Federalist Society was the turnstile for Supreme Court nominees.\n \nThis is why anonymous donors wrote checks as big as $17 million to the Judicial Crisis Network for ad campaigns for right-wing nominees.","date":"Sat May 07 17:36:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"No one should be surprised at what the leak of Alito’s opinion taking away abortion rights revealed. There is a plan, and this is just one part of it.\n \nThis is why Mitch McConnell refused to let the Senate consider Judge Merrick Garland.","date":"Sat May 07 17:36:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We shouldn’t turn a blind eye to oil companies overcharging American consumers. It’s time to pass my windfall profits clawback and fix this broken system. https://t.co/6lXT87oXZ1","date":"Sat May 07 14:33:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Another day has gone by, and I still haven’t heard from any of my Republican colleagues. Voters on both sides of the aisle want to get dark money out of politics, but that bipartisanship doesn’t seem to extend to Congress.","date":"Fri May 06 22:54:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@SenJackReed and I secured $5M in federal funds to realize Warwick leaders’ vision for a new plaza to serve as the cultural and economic centerpiece of the city. With an ice skating rink and event space, it will be a destination city center. Congrats Mayor Picozzi and team. https://t.co/5Q2YpPoKIB","date":"Fri May 06 22:27:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The past two years have been very difficult for families with young children, and child care workers stepped up. On Provider Appreciation Day, I’d like to thank America’s child care workers for all the important work that you do. #ThankYouChildCare","date":"Fri May 06 19:22:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Interesting. Like Ruth Marcus, he surmises the Supreme Court leak came from the conservative right, not the liberal left. If so, some of my outspoken Senate colleagues have a lot of standing down to do.\nhttps://t.co/ik97ahFmTu","date":"Fri May 06 18:12:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dennis has had an outstanding record of public service, and leaves the State House with an impeccable reputation and many, many friends. I wish him well.\nhttps://t.co/MrZmAfdltA","date":"Fri May 06 16:22:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For single use, they achieve 2% recycled content — to say there is no room for improvement is a wild understatement.","date":"Fri May 06 14:27:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Plastics industry needs to clean this mess up, pronto. Or accept my recycling fee on new plastic destined for single use, to give recycling a fighting chance.\nhttps://t.co/HiuduIRBUZ","date":"Fri May 06 14:26:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dahlia nails it. (Again.) My bill would fix a lot of this - we did our hearing this week in my committee. Watch for House action soon.\nhttps://t.co/KcC3DHKp19","date":"Fri May 06 00:55:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need two things right now: \n1. Codify Roe\n2. End special-interest control of the Court","date":"Thu May 05 21:59:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good. Let’s keep the pressure on Putin’s allies who help launder the regime’s crimes. \nhttps://t.co/wOPcv4mXar","date":"Thu May 05 20:26:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s simple - American consumers shouldn’t be bankrolling excessive profit margins that pad the pockets of CEOs and shareholders. Let’s rein in corporate profiteering and deliver relief for consumers. \nhttps://t.co/r7ZZt83Pl8","date":"Thu May 05 18:54:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"None that I’ve heard of, @ChrisVanHollen. Lots more Republican talk about dark money in Judiciary this morning, though. The DISCLOSE door is wide open, and Americans want us to get this done.","date":"Thu May 05 17:03:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Roe helps women to set their own course through life. We cannot let that freedom fall away. https://t.co/h0cuK9O4RN","date":"Thu May 05 14:43:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If they're so worried about dark money, why aren't they helping us clean it up? https://t.co/ovtnSr7NHY","date":"Thu May 05 00:33:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My thoughts are with every American who has lost a loved one to this virus. These past two years have brought so much tragedy, and so much courage.\nhttps://t.co/fafjNBPzGr","date":"Wed May 04 22:44:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Senator McConnell well knows, it’s the right that has done all of the work to “discredit the institution” of the Supreme Court. https://t.co/HucYaLfuPZ","date":"Wed May 04 20:54:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time for some real oversight of dark money groups that continue to flout the rules. Watch my hearing:  https://t.co/MT0xqusawX","date":"Wed May 04 18:07:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Swarms of tax-exempt groups have been allowed to flood American politics with dark money, and our democracy is suffering for it. Even worse, the IRS has barely attempted oversight or enforcement. I’ll be chairing a hearing on this issue in a few minutes– tune in soon.","date":"Wed May 04 17:34:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is why it’s right to go after the oligarchs.  \nhttps://t.co/DFcuQnC38D","date":"Wed May 04 16:15:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A determined crowd at the Court. Americans won’t go quietly as women’s constitutional rights are stripped away. https://t.co/qpRn5PNc5L","date":"Wed May 04 14:37:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One of Congress’s great friendships was forged between Sec. Norman Mineta and Sen. Alan Simpson in a detention camp for Japanese Americans in WWII.  Norm was a lovely guy.  My condolences to his family on his passing. \nhttps://t.co/F55Mw6wDQR","date":"Wed May 04 13:23:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The implications for Obergefell are chilling. Right-wing donors captured the Supreme Court, and this decision proves that anything they want is on the table.","date":"Tue May 03 23:58:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/sHjs0AyKIB","date":"Tue May 03 22:21:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ruth Marcus is no fool. https://t.co/QYQCPldQ2x","date":"Tue May 03 22:21:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The real SCOTUS outrage is the breach of precedent and confirmation hearing promises to trample on women’s established rights, not the leak. \n\nPlus, we don’t even know who leaked it yet or why; let the Marshal of the Court sort that out.\nhttps://t.co/KG9nzkK7iP","date":"Tue May 03 21:49:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Climate change demands American leadership - the only true measure of our global legacy on climate will be passing a substantial climate bill out of this chamber.  https://t.co/tpRAJizzlD","date":"Tue May 03 20:27:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need to root out problems with our judiciary’s ethics practices so that we can protect the public’s trust in our federal judges. \n\nIt's time for a binding Code of Conduct for the Supreme Court – the only court in the country that doesn’t have one.","date":"Tue May 03 17:54:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I wonder if anyone is having any second thoughts now about that insipid “nothing to see here folks” Supreme Court commission.","date":"Tue May 03 16:09:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, we consider what Congress can do to address judicial ethics and assure that the Supreme Court’s rules and practices merit the confidence and trust of the American people. https://t.co/3LQsfhc780","date":"Tue May 03 13:59:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I’ll be chairing a hearing on the need for real transparency and accountability in our nation’s courts. Tune in soon.","date":"Tue May 03 13:55:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I hope the Republican justices seriously reconsider a decision to upend nearly 50 years of precedent and harm millions. It would be a blow from which the Court may not recover, and which would fall squarely on women of this country.","date":"Tue May 03 13:37:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is exactly the kind of deliverable they had in mind when they packed the Court with Federalist-Society-chosen justices.","date":"Tue May 03 13:37:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This decision would wipe that well-established precedent away, to give right-wing ideologues a political victory. The right-wing goal has been to control the Court, to achieve policy gains against the will of the American public.","date":"Tue May 03 13:37:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Roe v. Wade has stood firm in the law for decades, guaranteeing women the freedom to decide if and when to have a child – one of the most profoundly personal and life-altering decisions a person can make.","date":"Tue May 03 13:37:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If the majority Republican justices stay the course, this decision will go down as one of the most supremely political acts in Supreme Court history.","date":"Tue May 03 13:37:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A lot of money got spent to build a Court that would do this, so it should come as no surprise. “The Court That Dark Money Built” knows how to deliver for the donor coalition. \nhttps://t.co/AP4QE1YmVv","date":"Tue May 03 12:22:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"American families used their #ChildTaxCredit payments to cover bills &amp; put food on the table. We made a straightforward investment in our future, and achieved a historic drop in child poverty. Let’s keep pushing.","date":"Mon May 02 23:13:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This needs to be fixed, rapido. One estimate is that it is killing 16 gigawatts of solar, offsetting almost half the investment in offshore wind, now targeted for 30 gigawatts.  \nhttps://t.co/ivCtwDOMIm","date":"Mon May 02 20:28:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/YZIqic0hgq","date":"Mon May 02 18:46:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m committed to doing everything in my power to keep the jobs recovery going and support the small businesses that Rhode Island’s economy depends on.","date":"Mon May 02 17:25:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Glad to recognize this year’s @SBA_RhodeIsland Small Business Week awardees, who showed grit and resourcefulness in the face of unprecedented challenges. https://t.co/22xuqH3Xae","date":"Mon May 02 17:25:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s the back story: single-use plastics average a whopping 2% recycled content; over 90% of plastic never gets recycled. This scam must end, and the fossil fuel/plastics industry must get serious at last about “faux recycling.”","date":"Mon May 02 15:00:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oh my, what a difference being under oath makes!   Thank goodness for courts and discovery!!\nhttps://t.co/7R72quRDpa","date":"Mon May 02 15:00:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My bill is getting more and more popular.   \nhttps://t.co/lpYWNzKQIP","date":"Mon May 02 13:40:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good for you, Madam Speaker — bravo.  \nhttps://t.co/VLE0FVY3vU","date":"Mon May 02 03:03:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/fUWJGG24wI","date":"Sun May 01 16:59:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fossil fuel companies &amp; their front groups talk incessantly about the costs of transitioning to clean energy, pretending it’s too expensive. \n\nTheir narrative of course ignores the costs of not taking action — which are almost unthinkably immense.","date":"Sun May 01 15:45:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The NRA is infamous for its lobbying and political engagement, but, under the penalty of perjury, it reported absolutely ZERO political spending to the IRS for 5 years. Dark money groups continue to flout IRS rules. We need to do better.","date":"Sun May 01 13:35:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Nice to hear former Ukrainian President Poroshenko‘s confidence in victory, live from Ukraine.","date":"Sat Apr 30 23:51:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time to extract aid for Ukraine from Putin &amp; his oligarchs. The U.S. needs the tools to find their hidden wealth – plus the authority to redirect it towards the victims of this unjust war. Let’s get moving.","date":"Sat Apr 30 21:01:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One wonders what DOJ will do in this case — defend USPS’ indefensible position? Where is DOJ on climate and energy litigation? Sixteen months in and no sign of due diligence even commenced.  \nhttps://t.co/ytGxyp02XM","date":"Sat Apr 30 17:36:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money groups are saying one thing to election regulators and another thing to the IRS about their political spending, but the IRS seems to have thrown in the towel on enforcement. @CREWcrew’s new report highlights some of the most blatant violations.\nhttps://t.co/SYvBk64Odq","date":"Sat Apr 30 15:22:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This weekend, I’ll be carrying on my friend John McCain’s work at the #SedonaForum2022. As the climate crisis unfolds, I am determined to find common ground and work towards solutions.","date":"Sat Apr 30 12:50:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It was an honor to meet members of the Rhode Island Air National Guard serving at Al Udeid Air Base in Qatar last week. One of those members was Staff Sergeant Morin. Staff Sergeant Morin brings his son’s beloved stuffed animal, Charlie, everywhere he goes on his deployment. https://t.co/8JYvua5k0h","date":"Sat Apr 30 00:27:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"So when @SenBooker and I met Charlie, we were very happy to take a photo to send home to his family in Rhode Island.","date":"Sat Apr 30 00:27:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A historic moment for @RIStatePolice. Best wishes to Col. Weaver as he takes the helm, and thanks to Col. Manni for his dedicated service.","date":"Fri Apr 29 21:39:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time we take on the pharmaceutical industry’s greed to lower prescription drug prices and help Americans afford the care they need.","date":"Fri Apr 29 20:33:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is not just unique in human history, its comparables can only be found in geologic time. And it doesn’t even count the ocean acidification. Yet we proceed on our way oblivious, beguiled by the lies of the fossil fuel industry and its skeezy front groups.","date":"Fri Apr 29 16:11:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The segment of human energy use derived from fossil fuels creates climate conditions that pump 14 zettajoules of excess heat into our oceans every year—that is multiple Hiroshima-sized nuclear blasts worth of heat per second, nearly 30x our total global human energy use every yr.","date":"Fri Apr 29 16:11:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s a more practical reference:  all the energy used annually by all the people in all the world — all of it — amounts to half a zettajoule (yup, it’s a big number). So what does that mean for oceans?","date":"Fri Apr 29 16:11:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Bear with me while I tell you what a zettajoule is: a joule is a unit of heat energy, a zettajoule is that unit with 21 zeros behind it: 1,000,000,000,000,000,000,000 joules. It’s a lot of heat energy.","date":"Fri Apr 29 16:11:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks to fossil fuels, we are veering toward mass oceanic extinctions. As Pope Francis said, we do not have the right to do that to our fellow creatures, particularly not for our waste.\nhttps://t.co/Q4nGC7vC2g","date":"Fri Apr 29 16:11:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"100 U.S. top corporations: median net profits up 49%; customers saddled with higher prices; 90 did stock buybacks or increased dividends.\nhttps://t.co/6U7uFDJBPQ","date":"Fri Apr 29 14:17:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The assets we seize from Putin’s oligarchs should be auctioned off, and the proceeds put towards Ukraine’s resistance and reconstruction. I can’t think of a better way to spend such tainted money - and President Biden agrees. \nhttps://t.co/r5NtqWDnLY","date":"Fri Apr 29 00:37:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More on how Big Oil and its international cartel are driving up prices for their own ends; never mind consumers, never mind Ukraine.\nhttps://t.co/evCdgDIa3U","date":"Thu Apr 28 22:13:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Why the sudden barrage of abortion bans? Because this Supreme Court has signaled its willingness to torpedo nearly 50 years of precedent in Roe v. Wade. The Court is on the cusp of fulfilling a major demand of the right-wing donor class, and lawmakers are pouncing.","date":"Thu Apr 28 20:02:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"…and the power to move proceeds from the sale of those assets to help Ukraine recover from the war. That’s exactly what my colleagues &amp; I have been pushing for in Congress. The House passed legislation similar to my bill to advance these goals, but there is much more to do.","date":"Thu Apr 28 17:55:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In the days ahead, I will work with the Biden team and my bipartisan group here in Congress to achieve the objectives our Munich \"McCain\" delegation outlined in February—to assure that the dictator Putin and his corrupt oligarchs pay a devastating price for their aggression.","date":"Thu Apr 28 17:55:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The U.S—as a leader of the transatlantic alliance and a beacon for democracy &amp; rule of law—should take a more active role in that mission. Atop the list of requests from the President is streamlined authority for the seizure of assets...","date":"Thu Apr 28 17:55:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I am thrilled the Biden administration has come out forcefully in favor of our bipartisan proposal to seize oligarch assets to supply aid to Ukraine. Putin and his oligarchs should be held to account for their unprovoked aggression against a peaceful neighbor.","date":"Thu Apr 28 17:55:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Last night, Republicans set their sights on #TitleX – the program that helps Americans access birth control, preventative screenings, &amp; reproductive health care. I voted to defend these essential services and prevent further backsliding.","date":"Thu Apr 28 16:49:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Delighted the Biden administration has come around to my bill. Oligarch assets should go to Ukraine.  \nhttps://t.co/EBTj6hnrZA","date":"Thu Apr 28 12:58:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Tonight marks the start of Yom HaShoah - Holocaust Remembrance Day. We honor the lives of the Jewish people murdered by the Nazi regime, and recommit ourselves to fighting the dangerous forces of anti-Semitism.","date":"Wed Apr 27 23:18:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Gas prices are up, and the gains are going straight to CEOs and shareholders. Instead of further enriching top executives, we should pass my Big Oil windfall profits clawback and return half of that money to working Americans.","date":"Wed Apr 27 21:53:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“So what, it’s not our $2 trillion,” says fossil fuel industry. “And for more like $2 billion we’re paying Republicans to block any real solution while we make a killing. Wheee!!”\nhttps://t.co/xfMp9ONELG","date":"Wed Apr 27 19:17:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"They said it, at last: \"'We want Ukraine to win,' a National Security Council spokesman responded.\"\nhttps://t.co/k6Tbd8BzKJ","date":"Wed Apr 27 17:03:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"International thugs shouldn’t be able to park their cash in American hedge funds or private equity firms. I’m pushing for some basic anti-money laundering safeguards to protect our financial system &amp; give our sanctions more bite.","date":"Wed Apr 27 15:03:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m very pleased at President Biden’s nomination of Lara Montecalvo to the First Circuit, continuing the great Rhode Island tradition of Bruce Selya and Rogeriee Thompson!","date":"Wed Apr 27 12:59:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"High gas prices are making CEOs and shareholders richer at everybody else’s expense. I’m fighting to level the playing field and send 50% of those excess profits back to working families.","date":"Wed Apr 27 01:04:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A remarkable Rhode Islander is turning 100 next month, and he’d appreciate some birthday cards. If you’d like to wish him happy birthday, address your letter to Victor W. Butler, C/O Gary Butler, P.O. Box 3523, Cranston, RI 02910.\nhttps://t.co/pEqDeybvvf","date":"Tue Apr 26 22:32:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It can be very rewarding to pollute.  \nhttps://t.co/5EaBsqZDVL","date":"Tue Apr 26 19:09:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Why should Kirill not be sanctioned?  \nhttps://t.co/tvnJ6NGbLA","date":"Tue Apr 26 17:33:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kicking kleptocrats and criminals out of our financial system is a smart move for national security. Let’s do some spring cleaning and crack down on the dark economy.","date":"Tue Apr 26 15:17:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is one of the “climate taxes” fossil fuel makes us all pay.\nhttps://t.co/9twSIknGqJ","date":"Tue Apr 26 14:01:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money robs voters’ of their basic right to know who is talking to them and what that person wants.","date":"Mon Apr 25 23:16:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good step by FERC. Better grid planning will allow more clean energy sources to come online.\nhttps://t.co/yO84x0xwy6","date":"Mon Apr 25 21:15:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Ukraine battles the onslaught, ordinary Ukrainians – and Russians – should see oligarchs’ yachts, jets and Picassos auctioned off by American authorities.","date":"Mon Apr 25 17:22:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I circulate my “This Week in Climate” newsletter whenever the Senate is in session – sign up if you’d like to learn more about my priorities and keep up with the latest climate news.\nhttps://t.co/0gcHkofULd","date":"Mon Apr 25 15:08:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m thrilled that @SecBlinken and @SecDef are going to Ukraine and hope they pack in their vocabulary bags the word “victory.” Victory for Ukraine.","date":"Sun Apr 24 21:42:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Russia’s fossil fuel industry is helping Putin bankroll his invasion of Ukraine. Global investments in clean energy will diminish the power of these corrupt petro dictators &amp; their regimes.","date":"Sun Apr 24 14:06:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m sorry to learn that Senator Orrin Hatch has passed away. I send condolences and best wishes to Elaine and the Hatch family.","date":"Sun Apr 24 02:27:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money is poison to a free &amp; fair democracy. It’s time to pass my DISCLOSE Act and close this wretched chapter of American politics.","date":"Sat Apr 23 22:04:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We can’t tackle climate change until we electrify our cars, homes, and businesses. Let’s free ourselves from fossil fuels and #ElectrifyEverything","date":"Sat Apr 23 16:26:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry knew about climate change for decades – they lied until they couldn’t anymore, and they’re still trying to wring the last dollars out of their polluting product. It’s time to invest in clean energy and leave Big Oil behind.","date":"Sat Apr 23 14:14:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Happy Birthday to my friend and colleague @JimLangevin! You've done incredible things for Rhode Island, and I'm sure you'll do many more. https://t.co/H1AxvTckuh","date":"Sat Apr 23 01:21:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans fought, bled and died to create this republic. President after president, of both parties, have spoken of America as a beacon of democracy. To that noble experiment, corporate power comes as predators come at prey.","date":"Fri Apr 22 21:27:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"…and more and better cooperation with our international partners to reduce the supply of precursor chemicals used to manufacture illicit drugs, along with tougher sanctions against transnational drug syndicates.","date":"Fri Apr 22 17:04:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m pleased to see my priorities reflected in this new strategy, and I look forward to working with the Biden administration to deliver on those priorities.","date":"Fri Apr 22 17:04:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I also stressed tearing down barriers to treatment, including expanding access to life-saving naloxone &amp; medication-assisted treatment; improving our data collection systems to better understand the effects of our intervention efforts…","date":"Fri Apr 22 17:04:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’ve been clear that the plan must include a more coordinated approach to cracking down on transnational criminal organizations, especially the ways in which they launder and protect their ill-gotten gains using U.S. rule of law &amp; financial networks.","date":"Fri Apr 22 17:04:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Illicit drugs cause immeasurable pain &amp; loss in our communities. As the Chairman of the Senate Caucus on International Narcotics Control, I’ve pressed for an updated federal plan to tackle them. Yesterday, @ONDCP released one.","date":"Fri Apr 22 17:04:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Happy Earth Day! We Rhode Islanders are lucky to live in such a beautiful state and it’s up to all of us to do our part to leave it a better place for the next generation. This is our only planet – let’s take care of it. https://t.co/KZJStlvXDq","date":"Fri Apr 22 14:58:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If we're going to help Americans with long COVID, we need to speed up research and make sure patients get the disability benefits they need. People deserve answers &amp; support, and I’ll keep pushing for both.","date":"Fri Apr 22 13:32:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To preserve this great American experiment, we will need to quickly get out the pruning shears &amp; the weed-whacker, and cut back the corporate influence which has infiltrated Congress and the Supreme Court.","date":"Fri Apr 22 01:53:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corporations have proven themselves faithless stewards of political power. Greed trumps principle. Corporate power today is a weed that has grown out of control and ruined the garden.","date":"Thu Apr 21 23:23:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I wonder if anyone at DOJ will watch this.  \nhttps://t.co/gt4cghKeWB","date":"Thu Apr 21 19:59:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"America is in a death spiral of corporate power deployed — often covertly — to create more corporate power. Corporate power rules.    \nhttps://t.co/RwBtg2pHe2","date":"Thu Apr 21 17:43:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Everyone wins when electronic health records are easily accessible to different providers. The Rhode Island Quality Institute has made a real difference over the past 2 decades, and I’m pleased to deliver federal funds so that its services can reach more patients.","date":"Thu Apr 21 15:51:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/tTBYbKEfAA","date":"Thu Apr 21 15:51:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/VrJaBoONOu","date":"Thu Apr 21 13:32:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Celebrate #NationalParkWeek by visiting Rhode Island’s two beautiful National Parks! The Blackstone River Valley National Historic Park and the Roger Williams National Memorial are only a short drive apart, and always worth the trip. https://t.co/T7r4tuNUYB","date":"Thu Apr 21 13:32:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Mariupol Marines deserve an epitaph as noble: https://t.co/KVEGNhcRo4","date":"Wed Apr 20 23:40:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"High gas prices are helping Big Oil and hurting working families. @RepRoKhanna and I have a simple solution: return 50% of those excess profits to consumers. Let’s set this right.","date":"Wed Apr 20 20:11:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A good reminder from @SenMarkey. The fossil fuel industry keeps on lying about their reckless pollution and endless climate obstruction.","date":"Wed Apr 20 17:49:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The international dark economy allows oligarchs/kleptocrats, criminals, rogue nations, and terrorists to finance their crimes and stash their pelf behind rule of law protections. Keeping these bad actors out of our financial system is a national security imperative.","date":"Wed Apr 20 15:59:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Democrats are fighting to rid our politics of the dark-money donor influence that Americans hate – to make sure our democracy is for the people.","date":"Wed Apr 20 02:22:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I think of his bravery, and I compare Congress cowering before fossil fuel dark money. Pathetic contrast. “There will be a dawn. The night, as you know, is darkest just before the light.” The light can’t come too soon. \nhttps://t.co/OQza3ngnXv","date":"Tue Apr 19 21:50:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s hard to imagine the U.S. returning Russian oligarchs' ill-gotten assets. A half-billion-dollar yacht could rebuild a lot of schools, hospitals &amp; apartment buildings in Ukraine…","date":"Tue Apr 19 19:23:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"But don’t overlook that the “tower fell” in 2011, the first year post-Citizens-United of unlimited dark money corroding our politics. It may not be just social media.","date":"Tue Apr 19 16:47:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good point: “a small number of jerks” can dominate social media “because nonjerks are easily turned off” by them, thus “public square is governed by mob dynamics.”\n https://t.co/slGwgZBgxn","date":"Tue Apr 19 16:47:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The problem is “alienating progressive Democrats and climate activists”? So lame. Read the IPCC report!!\nhttps://t.co/Jvle7hIwGo","date":"Tue Apr 19 14:46:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Is it conceivable that the “climate president’s” DOJ has done no due diligence to see if litigation about climate fraud is in order? Debriefed experts? Talked to tobacco case victors? Checked with suing state AGs? Requested documents?\nhttps://t.co/A6g3hL1hYT","date":"Tue Apr 19 12:43:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Jane Mayer skewers the dark-money “slime machine” behind the Republican Party. The question is, who is behind the slime machine? The same dark money that picked Gorsuch, Kavanaugh &amp; Barrett?\nhttps://t.co/TEi4cqrisk","date":"Mon Apr 18 22:50:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The same dark money behind Mitch McConnell’s political operation?","date":"Mon Apr 18 22:50:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We let this fester because U.S. lawyers, realtors, investment advisors, etc. were making a fortune in this filthy business, so it was a long battle through the U.S. Chamber of Commerce, the American Bar Assn, &amp; the NFIB to even clean up shell corps.\nhttps://t.co/lc7zjPqsw4","date":"Mon Apr 18 20:37:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our tax system is riddled with loopholes benefiting the ultra-wealthy. Working families shouldn’t pay higher tax rates than billionaires – it’s time to fix this problem and hold everybody to fair standards. #TaxBillionaires","date":"Mon Apr 18 18:28:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"France reportedly seized 41 properties from sanctioned Russians, market value estimate $620 million. What has US seized?","date":"Mon Apr 18 17:07:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is my bill in the Senate and I’m eager to get it passed!\nhttps://t.co/a8LZWbt2og","date":"Mon Apr 18 14:56:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin complains we’re sending arms to Ukraine. Russians manned anti-aircraft batteries against U.S. pilots in Vietnam. The equivalent would be putting Patriots with American technical advisors into Ukraine to engage Russian aircraft.  \nhttps://t.co/sJQWKRsWfU","date":"Mon Apr 18 12:47:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fox News/Russian propaganda overlay is increasingly weird. What is going on?  \nhttps://t.co/1SmIQTHmQl","date":"Mon Apr 18 00:04:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republicans across the country are attacking Americans’ rights, from reproductive freedoms to ballot access. Lurking behind those efforts? Right-wing billionaires using gobs of dark money to push their corrupt agenda.","date":"Sun Apr 17 14:28:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republicans devised a decades-long scheme to capture our Supreme Court. Their reward is The Court That Dark Money Built, which delivers wins for corporate special interests – every single time.","date":"Sun Apr 17 00:44:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans ought to be confident that Supreme Court rulings are fair and objective. My 21st Century Courts Act would make justices sit out cases where their objectivity is in question.","date":"Sat Apr 16 19:46:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"America’s 15 highest income earners pay a lower average tax rate than teachers &amp; firefighters. That isn’t fair, which is why I’m fighting to close loopholes and fund the hollowed-out IRS. \nhttps://t.co/uK1c5ZSp50","date":"Sat Apr 16 15:48:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good of Anne to go in to Ukraine for this story.\nhttps://t.co/uuGfqt9XkO","date":"Sat Apr 16 13:41:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I can’t wait to see police tape around the mansions of Russian oligarchs. That’s why I’m pushing for quicker asset seizures &amp; real financial transparency for kleptocrats. Putin &amp; his allies should face consequences.","date":"Fri Apr 15 21:31:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@USChamber works the will of the fossil fuel industry and blocks climate progress in Congress, and it does so with corporate America’s acceptance &amp; financial support. When @pepsi &amp; @cocacola pay dues to the Chamber, their climate impact goes negative.","date":"Fri Apr 15 19:32:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Uh-oh: “A methane feedback loop that is beyond humans' ability to control may have begun, scientists with the National Oceanic and Atmospheric Administration (NOAA) have said.” Yet we dawdle.\nhttps://t.co/wxEnucGlv1","date":"Fri Apr 15 16:36:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It is long past time for a reckoning for the fossil fuel industry’s dark-money political mischief, that truly “put us firmly on track toward an unlivable world.”\nhttps://t.co/m9elDcXKCW","date":"Fri Apr 15 14:03:20 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"URI/CRC at the oceans meeting — big URI and GSO presence overall Good to see. https://t.co/jp4qj9ekTK","date":"Fri Apr 15 11:50:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@RBReich agrees that our Big Oil Windfall Profits Tax is good policy - let’s get it passed!","date":"Thu Apr 14 23:51:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Every year, more dark money gushes through the Citizens United floodgates. People have had enough. Let’s pass the DISCLOSE Act to shine a light on those trying to manipulate our democracy from behind closed doors.","date":"Thu Apr 14 20:52:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kara-Murza and I were pallbearers for John McCain, and he’s been a brave critic of Putin. Thank you to the editorial board for spotlighting his “arrest.”\nhttps://t.co/f47aHHJOdH","date":"Thu Apr 14 19:23:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@RepMalinowski and I agree - the wealth that supported Putin’s regime should be used to rebuild the country he is destroying. Here’s our take:\nhttps://t.co/m76AVQP9jd","date":"Thu Apr 14 17:10:20 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"John Kerry (@ClimateEnvoy) started Our Oceans, this is the 7th, and it has gathered $16.35 billion in oceans commitments. https://t.co/WFKHycU5Ar","date":"Thu Apr 14 15:30:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin &amp; his oligarchs stash property, yachts, and art all over the world. My Asset Seizure for Ukrainian Reconstruction Act would let us confiscate &amp; sell those ill-gotten luxuries and send the $$$ to the people of Ukraine. Sounds pretty good, right?","date":"Wed Apr 13 21:00:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must “rectify decades of weak to nonexistent real (inflation-adjusted) wage growth” and take on “oil, technology, pharmaceutical, and other corporate giants [making] a killing from the crisis.” \nhttps://t.co/p0svxRLFx2","date":"Wed Apr 13 18:03:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good. Yesterday, please.  \nhttps://t.co/YwjX83KeUz","date":"Wed Apr 13 15:17:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It seems our goal should be Ukraine victory. \n\nEven if our goal were “improved negotiating position,” it seems our stated goal should still be Ukraine victory. https://t.co/upZ2i6RXg9","date":"Wed Apr 13 13:05:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Superman building coming back to life is huge news for downtown Providence.","date":"Wed Apr 13 01:37:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The pandemic &amp; supply chain disruptions have left lots of Americans &amp; small businesses in financial trouble. This bipartisan legislation extends our improvements to the bankruptcy process for small businesses, to help business owners and employees stay afloat through hardship.","date":"Tue Apr 12 23:38:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/najm8sKpPG","date":"Tue Apr 12 23:38:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"American real estate can’t be a dark repository for oligarch money. \n https://t.co/19xQNVi5w1","date":"Tue Apr 12 21:39:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Without swift, sharp reductions in carbon emissions, the earth will accelerate toward climate catastrophe. America could lead the charge, but it won’t happen unless Congress passes major climate legislation.","date":"Tue Apr 12 17:47:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The track record is special interest wins, “conservative” legal theories be damned.","date":"Tue Apr 12 15:45:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The writer assumes that the “purely political and possibly corrupt” Court is just a strategic Democratic talking point, and not the fact of the matter; and that the Court is “conservative,” not captured. https://t.co/FFkFhiGyBn","date":"Tue Apr 12 15:45:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To take the next step, we need to add a public option.","date":"Tue Apr 12 13:53:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My vote for the Affordable Care Act is still one of the most important votes I’ve taken in the Senate. 12 yrs on, Democrats are hard at work strengthening the ACA and continuing to bring affordable health care within reach for more Americans. https://t.co/kzKVprXIiy","date":"Tue Apr 12 13:53:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Citizens United super-charged the schemes of big corporate and right-wing donors to rig our government in their favor. Now we need my DISCLOSE Act to clean it up.","date":"Tue Apr 12 00:01:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kinda fun I guess secretly to run a country generations fought, bled, and died to build, steering the Court and Republican Party around like your pet ponies.","date":"Mon Apr 11 22:27:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is a nice summary of what billionaires are secretly doing in our politics, thanks to The Court That Dark Money Built.\nhttps://t.co/azRt1qgLgH","date":"Mon Apr 11 22:27:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We can end this travesty by passing the DISCLOSE Act, so citizens can identify the players pitching them, and so sleaze pays a price.","date":"Mon Apr 11 22:27:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"$55.9 million from our bipartisan infrastructure law is en route to @RIPTA_RI  to improve public transportation in RI and grow our economy.","date":"Mon Apr 11 20:12:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Crushing blow to solar industry. We are hearing clean energy losses running up to 16 gigawatts. Brutal. That would wipe out half of expected offshore wind gains.\nhttps://t.co/QeKBoOcPQ2","date":"Mon Apr 11 18:37:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Technology has made it easy for criminals &amp; terrorists to produce untraceable firearms. I am glad to see the Biden Administration institute commonsense safeguards to rein in ghost guns.","date":"Mon Apr 11 17:15:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And last week Senate Republicans badgered the EPA Administrator about efforts to limit methane emissions:  \n“The concentration of methane in the atmosphere is higher now than any time in at least 800,000 years.”\nhttps://t.co/4rX8QtWBN7","date":"Mon Apr 11 16:07:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Nice kudos for RI Hospital ER from Letterman. Particularly after all they’ve done through covid.   \nhttps://t.co/p4KeghM2RN","date":"Mon Apr 11 12:59:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Indeed we showed dark-money groups feeding the “child porn leniency” and “judicial philosophy” attack lines to Republican Senators.","date":"Sun Apr 10 20:52:44 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Senate process will never be normal while this massive operation is at work. The operation will attack nominees it hasn’t chosen; we will oppose nominees it has.","date":"Sun Apr 10 20:52:44 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"CMD puts the secret funding behind this operation at $580 million.  Massive funding implies massive motive.  Single donations ran as high as $17 million dollars.","date":"Sun Apr 10 20:52:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A related armada of dark money front groups communicates the donors’ wishes to the Court and has a near-100% win rate.","date":"Sun Apr 10 20:52:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Marcus’s wise analysis omits one component: the vast right-wing apparatus out to “capture” the court. (See “agency capture” or “regulatory capture.”)\nhttps://t.co/1fDwyjFP7J","date":"Sun Apr 10 20:52:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As we celebrate humanities, consider Hilary Mantel’s observation: “We must think, and to think we need context, and to have context we need history, history at the center of our teaching and learning.” \nhttps://t.co/p4OHp4FCfw","date":"Sun Apr 10 17:19:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/8INfeYMWYb","date":"Sun Apr 10 15:29:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The oil &amp; gas industry, though brute political power, has blocked action on climate change for decades. We will rue the day we let Big Oil have that kind of control over Congress.","date":"Sun Apr 10 13:54:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks, EU President von der Leyen, for visiting Bucha to witness the Russian atrocities. Outright victory for Ukraine must be our goal. https://t.co/N4YAxAcogY","date":"Sat Apr 09 20:44:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The far-right’s dark money network is good at covering its tracks, but it isn’t perfect. Let’s follow some of these claims about Judge Jackson to the source. https://t.co/OKl54WLhsr","date":"Sat Apr 09 16:07:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The creation of the Marine Debris Foundation was a key goal of our bipartisan Save Our Seas 2.0 law. These board members have the know-how to make a big difference in cleaning up the harmful plastic trash filling the oceans. https://t.co/kpUqmrsCqL","date":"Sat Apr 09 13:32:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you, Slovakia!\nhttps://t.co/WBKZLbDn5p","date":"Fri Apr 08 23:14:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"RI at the event in @GabeAmo46, myself, and nice shout-out to Bruce Selya! https://t.co/tkwq1EVMrA","date":"Fri Apr 08 21:04:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/XHjspNztOE","date":"Fri Apr 08 20:10:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans are feeling the effects of corporate profiteering &amp; inflation, and some have taken on credit card debt to get by. @Senwarren, @SenSanders, @SenJackReed, @SenJeffMerkley &amp; I want to give states the power to rein in rates &amp; protect citizens from Wall Street greed.","date":"Fri Apr 08 20:10:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rhode Island’s Fire Chiefs do remarkable work to keep our communities safe. They are real heroes, and my colleagues and I will keep pushing to get them the resources they need. https://t.co/CKpyYNHWro","date":"Fri Apr 08 18:55:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"KBJ takes the podium and speaks. https://t.co/hNSTbX0dC0","date":"Fri Apr 08 17:17:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Macabre: Russians wrote “for the children” on a missile fired into train station packed with civilians. Time to set our national goal as victory for Ukraine, with every effort toward that goal.\nhttps://t.co/PGQiMw3agf","date":"Fri Apr 08 16:31:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The beast is loose: https://t.co/T3iGE5AjIa","date":"Fri Apr 08 14:52:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/2Q0Pcrea9M","date":"Fri Apr 08 14:52:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/lYnxxpCXZ2","date":"Fri Apr 08 13:38:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"How skeezy the unregulated carbon offsets market is right now — a Wild West of greenwashing fakery: https://t.co/pDPAq2HxVG","date":"Fri Apr 08 00:07:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Senate has confirmed the next Supreme Court justice, and I know she will serve this country with great care &amp; dedication.\n\nIt might be raining in Washington today, but I can celebrate with a picture of the Court from sunnier times.\n\nCongratulations, Justice Jackson. https://t.co/cW6ZEKnPuj","date":"Thu Apr 07 21:48:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court remains enmired in dark-money influence, which corrodes public confidence in the institution and strengthens special-interest power at the public’s expense. But Judge Jackson proves that it doesn’t have to be that way.","date":"Thu Apr 07 18:24:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"She also shows the American people that their justices can ascend to the Supreme Court bench through their own merit, not through a process built by anonymous donor interests seeking policy wins via the courts.","date":"Thu Apr 07 18:24:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And as a Black woman facing down many obstacles to arrive at this moment, she will be a shining example of perseverance and hope for generations to come.","date":"Thu Apr 07 18:24:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, I proudly cast my vote to confirm Ketanji Brown Jackson to be the next Associate Justice of the U.S. Supreme Court. She will bring tremendous experience and skill to the Court, and will serve with distinction, as she has throughout her career in public service.","date":"Thu Apr 07 18:24:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Important new analysis from @BudgetHawks: whether you want to cut emissions or stabilize the nation’s fiscal position, a price on carbon is the answer.","date":"Thu Apr 07 18:00:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Judge Jackson showed us the meaning of perseverance in that hearing room. She is on her way to the Supreme Court, and I am proud to say she has my vote. #ConfirmKBJ","date":"Thu Apr 07 15:59:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Just three days ago, Justice Barrett told us to “read the opinion” before drawing any conclusions about the justices’ motives. But in this case, there is no majority opinion to read!\nhttps://t.co/TCdykYxDS5","date":"Thu Apr 07 14:27:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Bob Brulle, now at Brown, nails it. Talking about climate without mentioning the nefarious political role of the fossil fuel industry is  “like Star Wars without Darth Vader.” Who plucked mention of it out of the policymakers summary? \nhttps://t.co/4j3TbOa8VY","date":"Thu Apr 07 01:26:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Right-wing donors and their Republican allies launched an onslaught of smears against Judge Jackson in her SCOTUS hearings. They'll do anything to defend their mighty prize: The Court That Dark Money Built.\nhttps://t.co/yBPbQsS27J","date":"Wed Apr 06 23:27:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The #ChamberofCarbon works the will of the fossil fuel industry with corporate America’s backing. Corporate America should no longer tolerate this.  https://t.co/s23UPcdkZR","date":"Wed Apr 06 22:22:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Going to the Senate Floor to call on my colleagues – and corporate America – to wake up to the threat of climate change.","date":"Wed Apr 06 22:01:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Captured Supreme Court uses shadow docket to help out polluters. I wonder how much polluter money went into capturing the Court.\nhttps://t.co/CUYRLfShcM","date":"Wed Apr 06 21:12:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Ukraine fights for survival, a Koch front group pushes a “partial” Russian victory to keep Koch Industries’ Russian factories open. Heedless greed rarely puts anybody on the right side of history.","date":"Wed Apr 06 18:53:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our bicameral bill would help hold judges to account and restore Americans’ faith in their courts. \nhttps://t.co/BXLioWuPHi","date":"Wed Apr 06 17:04:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There’s a reason Americans are losing confidence in the Supreme Court's independence – special interests are spending millions to rig the judiciary in their favor, and Supreme Court justices have the least stringent ethics &amp; transparency rules of any senior federal officials.","date":"Wed Apr 06 17:04:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Join me and my colleagues for a live press conference on the 21st Century Courts Act.  https://t.co/6vseaCKalL","date":"Wed Apr 06 15:43:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"HAPPENING TODAY: Rhode Islanders can learn about important filing season considerations and how to get help from the IRS and Taxpayer Advocate Service.\n\nRegister here: https://t.co/GPzNfGh0M5","date":"Wed Apr 06 14:50:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Wanna know why prices are high at the pump? $205 billion in Big Oil profits. (How much of that will go to buying influence in Congress, do you suppose?) https://t.co/7Qef1BL26h","date":"Wed Apr 06 13:33:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"From Sen. Schumer: “As Majority Leader, I am committed to holding a Senate vote on the DISCLOSE Act, so we can end the dark money machine and show who stands with the big donors and special interests and who stands with the American people.”","date":"Wed Apr 06 02:20:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/5NOOWbtQSL","date":"Wed Apr 06 02:20:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I joined @SenWarren’s effort to extend the student loan moratorium, and I’m glad to see it pushed through August. This makes a real difference for students &amp; their families.","date":"Wed Apr 06 01:25:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Oklahoma abortion ban is a direct result of the Supreme Court undercutting its own precedent on Roe. This is how the far-right pushes its agenda – counting on captured courts.","date":"Tue Apr 05 23:32:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Judicial Crisis Network lurks at the center of a web of right-wing front groups built to control the Supreme Court and launch ugly smears against Biden nominees like Judge Jackson. It’s all an attempt to distract from their own dark-money operation.","date":"Tue Apr 05 21:33:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our report shows how the Judicial Crisis Network and its dark-money donors operate, and reveals why it’s time to end anonymous special interests’ hold on the Court. Read the full text here: \nhttps://t.co/2RJ3BEZ7Ae","date":"Tue Apr 05 21:33:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s National Library Workers Day, and I’d like to recognize the people working hard to keep our communities reading. Thank you for all that you do! #LoveLibraryWorkers https://t.co/ouOc1D9WOP","date":"Tue Apr 05 19:45:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Massive corporate price hikes yield massive corporate profits, while corporate front groups blame Biden. Numbers don’t lie.\nhttps://t.co/6dolcSGs9s","date":"Tue Apr 05 16:22:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The IPCC notes that “pricing carbon has been one of the most widely used and effective options to reduce GHG emissions,” but that “the power of incumbent fossil fuel interests… block[s] initiatives towards decarbonization.”","date":"Tue Apr 05 14:11:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The grip of the fossil fuel industry over the Republican Party blocks simple solutions like charging polluters for the costs of their pollution. The answers are at hand.  When we break the hold of those fossil fuel interests, we can move quickly to save our planet.","date":"Tue Apr 05 14:11:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry maintains a massive dark-money apparatus to obstruct all meaningful efforts toward decarbonization and to block and harass competing technologies like wind, solar, batteries and hydrogen.","date":"Tue Apr 05 14:11:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The new @IPCC_CH report lights a pathway toward climate safety. It also confirms what I’ve been saying in Time to Wake Up speeches for years: that the challenge of tackling climate change is more political than technological or economic.","date":"Tue Apr 05 14:11:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oil industry sets gas prices, blames Biden; FoxNews faithfully plays oil industry narrative; no one mentions climate change. That’s fossil fuel rule in a nutshell. https://t.co/jvDvIh0xik","date":"Tue Apr 05 13:11:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I’ll be live with MSNBC’s @Lawrence to discuss the path ahead for President Biden’s historic and supremely qualified SCOTUS nominee, and the process she’s endured. Tune in soon!","date":"Tue Apr 05 01:43:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Let's not pretend that “judicial philosophy” is a neutral thing. “Originalism” works pretty well for you if you want to look back before the Civil Rights Movement to make decisions about civil rights. https://t.co/j2mzcRiSV4","date":"Mon Apr 04 22:55:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We have Collins, Romney, and Murkowski all yeses on motion to proceed on Jackson – bravo!","date":"Mon Apr 04 22:47:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I regret the ordeal that certain Republicans chose to put her through during this process, but I am gratified to help advance a nominee who will serve the American people well in her time on the Court.","date":"Mon Apr 04 21:52:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And she carries with her a story of perseverance and hope stretching beyond her own life and work into the experience of Black women in this country – a story that illuminates a brighter American future.","date":"Mon Apr 04 21:52:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today, I voted to advance a highly qualified and accomplished nominee to the Court. Judge Jackson possesses a keen legal mind, the ideal judicial temperament, and more courtroom experience than any of the sitting justices at their confirmations.","date":"Mon Apr 04 21:52:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"She arrived at her nomination through merit and ability, not via a dark-money turnstile controlled by right-wing donors seeking special influence.","date":"Mon Apr 04 21:52:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Right wing dark money doesn’t just pick and plant and instruct the Republican Supreme Court justices, it drums up the Republican objections to Democratic nominees!  #LookBehindTheCurtain","date":"Mon Apr 04 20:43:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Carbon removal a must because we will overshoot safety marks, but it’s no excuse for failing to get off fossil asap. https://t.co/svoXZBFirZ","date":"Mon Apr 04 18:55:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Setting the conditions for that switch requires price on carbon to drive economics and political transparency to strip mask off industry’s fraud and bullying.","date":"Mon Apr 04 18:55:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"What plays out here in the Judiciary Committee with Supreme Court nominations is often driven and directed in other places, and the real action is too often offstage, in an archipelago of right-wing, dark money front groups that are out to capture the Court. https://t.co/xugmNQ02lj","date":"Mon Apr 04 17:08:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A fascinating piece about RI’s role in the “Ghost Army” during WWII. These men have finally been recognized with a Congressional Gold Medal.\nhttps://t.co/HwJ2oDQfoC","date":"Mon Apr 04 13:59:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Quite a letter, and from an exceptionally experienced prosecutor: https://t.co/MzvABHWOqi","date":"Sun Apr 03 20:51:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/6PtAQqe8wk","date":"Sun Apr 03 18:35:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Judge Jackson is a walking reminder of what the Supreme Court ought to be. She didn’t pass through the dark-money-funded turnstile at the Federalist Society. She arrived, after a lifetime of accomplishment, through her merit &amp; abilities.","date":"Sun Apr 03 15:40:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Free democracies cannot allow countries governed by corruption to trample the rule of law.","date":"Sat Apr 02 19:47:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For a guy who likes to do a lot of talking, he doesn’t seem to want to talk much under oath.   #ThankGodForCourts\nhttps://t.co/176KiIDQ1O","date":"Sat Apr 02 16:43:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Blob was worse than doom-and-gloomy about the prospects of Ukrainian victory, it presumed that they did not exist at all, on a par with Martian intervention.","date":"Sat Apr 02 13:46:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The problem of the national security “Blob” is not what they don’t know, it’s what they do know that just ain’t so.\nhttps://t.co/uFiyzfVvOI","date":"Sat Apr 02 13:46:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"During the pandemic, @USDA's school meal flexibilities helped 30 million children get the nutrition they needed. It's time to extend those flexibilities, and I've joined @SenStabenow's Support Kids Not Red Tape Act to make sure RI kids stay healthy &amp; cared for.","date":"Fri Apr 01 22:17:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@CommerceGov is considering ramped-up solar tariffs that would cost 70K American jobs &amp; cut solar deployment by 16 gigawatts annually, which is 2/3s of what we installed last year. We can’t delay our renewable transition, and their probe could be the start of a big setback.","date":"Fri Apr 01 20:12:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good to meet Amy and Angel, two hyacinth macaws, at @RWPZoo’s 150th birthday celebration. I also checked in on Sheldon the armadillo while I was there and have been assured he is doing well. https://t.co/Da3hYS8Gex","date":"Fri Apr 01 17:50:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I hope the FTC takes a careful look at the Microsoft-Activision deal. We need to guarantee accountability for tech employees – and employees everywhere – who’ve sustained serious abuse at the hands of their employers.","date":"Fri Apr 01 16:21:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I wish Bob DiMuccio well on his retirement, after 17 years as one of RI’s most engaged and community-minded CEOs. He sets the standard.","date":"Fri Apr 01 13:38:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We can’t rely on Chinese imports to power America’s clean energy revolution. With strong environmental safeguards in place, the Defense Production Act can be a useful tool for getting more American-made renewables on the market. https://t.co/KqukRALH6o","date":"Fri Apr 01 12:39:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"While I agree with most of this, I think the article gets the motivation wrong. It’s not Thomas’s views on abortion. To Mitch, that’s just another issue. It’s Thomas’s views on dark money. That’s Mitch’s life support system and the source of his power.  https://t.co/YHHUQt7IQv","date":"Fri Apr 01 01:31:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Republican majority on the Supreme Court has delivered over 80 5-4 partisan wins for big corporate &amp; partisan donors. \n\nThe American people see those decisions and understand that the Court is rigged – that it’s now The Court That Dark Money Built.","date":"Thu Mar 31 23:26:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Well before the Trump presidency, powerful right-wing donor interests began spending massive sums of money to install justices on the Supreme Court - justices whom they expected to rule reliably in their favor. https://t.co/Tq2rXcFqRX","date":"Thu Mar 31 22:27:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"New report from @LungAssociation estimates that wide-spread transition to zero-emission vehicles in Rhode Island could prevent 6,500 asthma attacks and have a public health benefit of $3.8 billion. Another good reason to make the switch.","date":"Thu Mar 31 20:57:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There were persistent efforts in the Judiciary Committee to rewrite Judge Jackson’s own history, but she dispensed with those attempts very effectively. There were other attempts to rewrite history that I’d like to correct here today. https://t.co/7xV21xpRbL","date":"Thu Mar 31 19:34:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republicans tried to rewrite history during Judge Jackson’s hearing, and I’m headed to the Senate floor to set the record straight. Tune in soon.","date":"Thu Mar 31 19:13:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Decode: “No one has been better to my right-wing dark money donors. He has been impeccable at helping them. So no one had better mess with him.”\nhttps://t.co/5CP0DEsLVm","date":"Thu Mar 31 18:04:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Yesterday, I met students from North Kingstown High School who traveled to DC to learn about our democracy firsthand. I’m glad to see young Rhode Islanders engaging in civic life! https://t.co/s7g4CqZm4o","date":"Thu Mar 31 15:10:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Generations of Rhode Islanders have used Pell Grants to unlock opportunities in higher education. In his budget, @POTUS renewed the noble vision of the late Senator Pell by including a plan to double the grant’s maximum award, and I’ll fight to see this through in Congress.","date":"Thu Mar 31 13:30:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It could also reveal if members of Congress were in on the plot, and objected to ballots intending to extend the process out purposefully to allow time for the assault on the Capitol to disrupt the ballot count. I hope that’s not true, but it needs to be settled.","date":"Thu Mar 31 01:38:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Okay, this is really important. Investigative tools can now be brought to bear to secure evidence of intent of funders and organizers, and distinguish between protected speech and an illegal plot.  \nhttps://t.co/CX2r5gTHSD","date":"Thu Mar 31 01:38:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"America watched Judge Jackson carry herself with strength and composure. She is a remarkably qualified nominee, and it showed.","date":"Thu Mar 31 00:03:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark-money Kochs just can’t resist, it seems. No one loves autocracy more than a wannabe autocrat. \nhttps://t.co/CcWdkdIkAZ","date":"Wed Mar 30 22:43:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Oil is doing great – they’re bragging about their profits to investors, while American families face higher &amp; higher gas prices. @RoKhanna and I introduced the Big Oil Windfall Profits Tax to send half of those gains back to consumers. Let's fix this. https://t.co/2k4GmaJDrs","date":"Wed Mar 30 21:12:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hedge funds &amp; private equity firms shouldn’t be able to help oligarchs dodge sanctions. @SenWarren and I are calling on @USTreasury and the SEC to close this dangerous loophole and keep illicit cash out of our financial system.\nhttps://t.co/PvmR2shh47","date":"Wed Mar 30 19:11:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My colleagues and I propose sending Big Oil’s massive windfall profits to the hardworking people who paid for them at the gas pump. https://t.co/7OQ4soHMXY","date":"Wed Mar 30 17:01:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rhode Island's @meganranney is right - health care workers are burned out, and our entire system is under strain. It's time to invest in our health care workforce, get serious about public health, and support the people who perform this important work. https://t.co/HcWKZdObbn","date":"Wed Mar 30 13:41:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Court’s 6-3 Republican majority regularly hands big wins to right-wing donor interests, and the fossil fuel industry is probably the biggest donor interest of all. I'll keep fighting to expose the dark-money networks that corrupt our courts and block action on climate.","date":"Wed Mar 30 01:31:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you @POTUS and congratulations to @SenBooker for his leadership and determination in seeing this long-overdue bill over the finish line. We must continue to confront hate and bigotry in all its forms.","date":"Tue Mar 29 23:49:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The president’s budget makes the investments we need to crack down on corruption and keep criminals out of our financial system. Strengthening @USTreasury’s FinCEN is a win for national security and bad news for oligarchs.","date":"Tue Mar 29 21:19:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big oil &amp; gas companies are on track for record profits due to sky-high oil prices, while production costs are flat. Let’s pass my Big Oil Windfall Profits Tax and send half of those gains back to Americans.","date":"Tue Mar 29 19:17:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The ultra-wealthy should play by the same rules as everybody else. I’ve spent years fighting to ensure that billionaires can’t pay lower tax rates than teachers and firefighters, and I’m glad to see the administration take this important step. https://t.co/HHBFpCF0d2","date":"Tue Mar 29 17:09:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Max Boot was an early member of the Ukraine Victory Chorus.\nhttps://t.co/H89Z7YdwGI","date":"Tue Mar 29 13:24:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry has held Congress hostage while it stifles renewables. We can’t keep paying the hostage-takers – America would be better off without their profiteering.","date":"Tue Mar 29 00:31:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need to get dark money out of politics to stop big donors &amp; special interests from trampling voters. I will keep fighting to pass my DISCLOSE Act and protect our democracy from corruption.","date":"Mon Mar 28 22:37:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/DEUCVXOyJa","date":"Mon Mar 28 21:29:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As their invasion drags on, Russian forces are trying to suppress resistance by abducting Ukrainian’s political leaders &amp; journalists. @KremlinRussia_E must answer for this – what did they do to these civilians? #TheTaken","date":"Mon Mar 28 21:29:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks Mayor @MariaForCF for moderating our Women’s History Month panel today with @davidcicilline. We're grateful for your leadership and were proud to work with you and the delegation to secure $2M in the recent funding bill to bring a community and senior center back to CF.","date":"Mon Mar 28 19:45:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Well, well:\n“Based on the evidence, the Court finds it more likely than not that President Trump corruptly attempted to obstruct the Joint Session of Congress on January 6, 2021.”\nhttps://t.co/TRnmWeHcD2","date":"Mon Mar 28 19:10:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/IMqsSDpk27","date":"Mon Mar 28 17:35:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Talk about grace under pressure — in this case, under bombardment. https://t.co/7KCVhs7GGU","date":"Mon Mar 28 17:35:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s what the experts had to say: https://t.co/6xHpnGJhsi","date":"Mon Mar 28 15:12:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My legislative solution to Big Oil’s profiteering has received strong endorsements from economists and environmental groups.","date":"Mon Mar 28 15:12:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Another Russian general killed. Another good sign for the victory chorus.        \nhttps://t.co/zJMhW1Z6bw","date":"Mon Mar 28 13:29:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"…Ukraine’s Ministry of Defense said that yesterday it destroyed 8 tanks, 17 armored personnel carriers, 11 transport trucks and 170 soldiers in the Donbas.  Yesterday Germany delivered to Ukraine 1500 low altitude surface to air missiles, 100 heavy caliber machine guns…","date":"Mon Mar 28 01:29:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More news from sources in Ukraine — note the positivity.  \n\n”Ukraine’s military air command announced that yesterday it shot down 3 fighter bombers, five cruise missiles, an attack helicopter and three tactical drones…","date":"Mon Mar 28 01:29:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"…8 million rounds of ammunition, 350,000 ration packs, 50 medical vehicles and medical equipment.”","date":"Mon Mar 28 01:29:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Something beautiful about the sea in springtime. https://t.co/mhPFDKj3Bx","date":"Sun Mar 27 23:04:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Guess who the three wild activists are who want Court in military chain of command: yup, Thomas, Alito, and Gorsuch.\nhttps://t.co/pKTUwvSARx","date":"Sun Mar 27 19:03:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The oil &amp; gas industry’s cost of production hasn’t gone up, but the war in Ukraine, compounded by speculation and the OPEC cartel, has caused the price of oil to surge.","date":"Sun Mar 27 16:28:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congress should stand up to Big Oil profiteering and pass my Big Oil Windfall Profits Tax, which would send half of those excess billions back to consumers in quarterly checks.","date":"Sun Mar 27 16:28:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I hope it’s smoother sailing. https://t.co/jC8dLYwGxD","date":"Sun Mar 27 14:13:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Week is asking the right question! https://t.co/cKn0fAfo1f","date":"Sat Mar 26 23:33:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If Republicans had any honest concerns about dark money, they’d support my DISCLOSE ACT to put an end to it.  \n\nBut they won’t – Mitch McConnell knows dark money is too important to his right-wing donors.\nhttps://t.co/cP9ETD6y4g","date":"Sat Mar 26 19:39:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We have this oil cartel &amp; a small group of big oil companies that are setting prices &amp; reaping unbelievable profits. What are they doing with those profits? They’re passing the gains to shareholders – none of it is going back to consumers. https://t.co/vxuMerMAsv","date":"Sat Mar 26 15:35:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"David’s advocacy for this project was important and I congratulate him!  \nhttps://t.co/qDZHRYT0Av","date":"Sat Mar 26 13:56:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We underestimated them and must upgrade our thinking and planning to include the prospect that they can outright win.","date":"Fri Mar 25 23:13:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukraine is winning because of better tactics and anti-tank equipment, but also because in battle “the moral is to the physical as three is to one.”\nhttps://t.co/JsqP3eCfis","date":"Fri Mar 25 23:13:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"International criminals chose to use the United States as a safe haven for their loot - let's make them regret that decision. \n\nI'm pushing to streamline the asset seizure process for Russia's oligarchs so we can use their hoarded wealth to aid Ukraine.\nhttps://t.co/T56D0eQ48L","date":"Fri Mar 25 21:17:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There is strong public support for climate action and clean energy development. The public is already with us.\nhttps://t.co/jIrpQEK0k3","date":"Fri Mar 25 17:51:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I am proud to have taken part in considering Judge Jackson’s historic nomination. She set a new bar for patience, courtesy, &amp; dignity from a Supreme Court nominee.","date":"Fri Mar 25 15:52:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oh, great.\nhttps://t.co/7j5NzdOjWQ","date":"Fri Mar 25 13:13:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a word, the hunt for corrupt oligarch assets will be much more dynamic and energetic, and that is welcome and indeed overdue.","date":"Fri Mar 25 00:53:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good move by Biden administration announcing “initiative to share information about and coordinate responses related to evasive measures intended to undercut the effectiveness and impact of our joint sanctions actions.”","date":"Fri Mar 25 00:53:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"NATO has released an estimate that as many as 15,000 Russian soldiers have been killed in four weeks of war in Ukraine. Russia lost about 15,000 troops over 10 years in Afghanistan before its retreat.","date":"Thu Mar 24 23:56:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"👀\nhttps://t.co/TuA5ET2tpm","date":"Thu Mar 24 22:40:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And yet another voice joins the victory chorus — the very knowledgeable Anne Applebaum, who was a guest of our bipartisan Munich Security Conference delegation. “The goal has to be victory in Ukraine.”\nhttps://t.co/ZNlssq2Q60","date":"Thu Mar 24 20:21:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If you cannot accept the results of a free and fair democratic election, you have no grounds to criticize or evaluate a Supreme Court nominee. https://t.co/fU6aCeeWvF","date":"Thu Mar 24 18:08:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In case you missed it, here’s the rundown I gave @JoyAnnReid on the dark money organizations that worked to capture our Supreme Court. \nhttps://t.co/mYhKseKryj","date":"Thu Mar 24 17:41:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In the Annals of Hypocrisy Exposed, this article deserves a place.  Well done, Dana Milbank.  \nhttps://t.co/Ey4MBrGmRf","date":"Thu Mar 24 15:29:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"...and that everyone was suffering from mild to medium frostbite.”","date":"Thu Mar 24 14:09:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In confirmation the Ukrainian Ministry of Defense released intercepted communication from Russians encircling Mykolaiv. Soldiers on the recording were complaining that half of their force was dead or not operational, that they were sleeping in dugouts because they had no tents...","date":"Thu Mar 24 14:09:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More news for the Ukraine victory chorus:   \n“The Pentagon issued a statement yesterday that said the invading Russian army is on the verge, maybe a day or two, of completely running out of food and fuel. The statement went on to say that the Russians did not bring warm clothes.","date":"Thu Mar 24 14:09:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Check out @InfluenceMap’s new report. @USChamber continues its climate obstruction despite claims to the contrary – time for #ChamberOfCarbon members to wake up. https://t.co/8omYgs2xmI","date":"Thu Mar 24 13:15:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Maybe the name for this preposterous yacht becomes “Elba.”\nhttps://t.co/rp3dnOv81F","date":"Thu Mar 24 01:59:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"By the way, don’t blame your gas station. Often, they barely make money on gas, versus coffee and snacks. They too are on the receiving end of the exorbitant prices set by big corporations.","date":"Thu Mar 24 01:13:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Big Oil could drop U.S. gas prices tomorrow; but Big Oil chooses not to, because it prefers to charge the exorbitant prices set by the international oil cartel and speculators, and pocket wild windfall profits. https://t.co/wWZNnSaoKd","date":"Thu Mar 24 01:13:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There is nothing that makes a court immune to capture. https://t.co/sAiDVJbL2E","date":"Thu Mar 24 00:08:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/7fhm8KVit7","date":"Wed Mar 23 22:59:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Glad to have this be #1 reason for Senators to make in-person opening statements: https://t.co/81AQ4SpX05","date":"Wed Mar 23 22:59:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you, Cory, for the moral reset after so much cynical poison.","date":"Wed Mar 23 22:01:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Madeleine Albright was a trailblazing diplomat whose expertise took her from the United Nations to the helm of the State Department. She was a true public servant, and I was sorry to hear of her passing.","date":"Wed Mar 23 20:40:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Even as a prosecutor, I’d be disturbed to have some of my showboating colleagues doing an actual sentencing, given the self-righteous demagoguery they’re displaying here. \n\nThat’s precisely why they shouldn’t be judges, and Judge Jackson should be.","date":"Wed Mar 23 19:56:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"@JoyAnnReid Kind words, and they mean a lot coming from @JoyAnnReid!","date":"Wed Mar 23 19:45:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’ve been through lots of these hearings and I’ve never heard Republicans worry so much about a nominee’s “judicial philosophy.” Here’s what’s going on. https://t.co/FCiMKVh3Dp","date":"Wed Mar 23 18:22:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"President Biden said it best 12 years ago – the ACA is a big deal. We slashed costs, protected Americans with pre-existing conditions, &amp; made quality health care a reality. This legislation changed lives, and I'll continue building on its vision for better care &amp; lower costs","date":"Wed Mar 23 16:18:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One of my Republican colleagues just said he’s concerned with dark-money influence over the Court. Glad to hear it! We have a bill for that – I hope Republicans join us to pass the DISCLOSE Act.","date":"Wed Mar 23 14:30:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It gets worse. The right-wing donor network spent over $400M on this Scheme, enabling groups like the Judicial Crisis Network to run million-dollar ad campaigns against Garland and for Gorsuch, Kavanaugh, &amp; Barrett. Their paths to the Court were paved with dark money.","date":"Wed Mar 23 00:25:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We now have The Court that Dark Money Built. A small, wealthy, donor elite can use the Court to manufacture the appearance of justice, and do it all in secret. The American people deserve better, and we must set it right.","date":"Wed Mar 23 00:25:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s the final telltale: amicus briefs. Big donors signal their wishes through dark money-funded amicus briefs, a vehicle for lobbying. The number of briefs has exploded since the 1990s – a lot of money has been spent, and these donors want payback.","date":"Wed Mar 23 00:25:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Right-wing donors keep getting what they want from the Court. Beneath it all, the Federalist Society operated a turnstile, selecting conservative nominees while accepting massive anonymous donations.","date":"Wed Mar 23 00:25:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There it is again – Republicans fired another dark money allegation at Judge Jackson. Here are the facts:","date":"Wed Mar 23 00:25:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republicans used dark money to capture the Supreme Court, in secret, channeling funds through fictitious front groups. If you look carefully, though, a pattern emerges.","date":"Wed Mar 23 00:25:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It matters that the public know who is trying to influence the makeup of the Supreme Court. I want to make sure it’s clear how this game is played. https://t.co/kCBYppCCNx","date":"Tue Mar 22 23:05:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Committee Republicans grouse about “the troubling role of far left dark money group…in this Administration’s judicial selection process” they conspicuously overlook the more troubling role right wing dark money played in selecting 3 justices. Oops!\nhttps://t.co/vLfw5Mi3Rm","date":"Tue Mar 22 22:07:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"McConnell is the operative of the billionaires behind those “well-funded outside groups,” and the “spigot” for their political dark money. Which is why he protects dark money and Republicans protect him.\nhttps://t.co/eUdEzd8jbr","date":"Tue Mar 22 21:02:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There are definitely “rational reasons” for dark money:  with dark money, creepy billionaires and massive polluters can manipulate politics without accountability — definitely rational; also evil.","date":"Tue Mar 22 20:01:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The goal of CRC and its backers is “deregulation” writ large – getting rid of any and all government. That means attacking public education. https://t.co/QQyhjh0m6h","date":"Tue Mar 22 18:59:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"So what’s the game here? 1. It’s an ugly dog whistle. 2. It’s the convergence of right-wing donors’ anti-government agenda and a need to distract from a qualified, experienced, skill nominee. Bear that in mind as you watch.","date":"Tue Mar 22 18:59:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The front group that helped pick Trump justices under one fictitious name, then did voter suppression under another fictitious name, has a third fictitious name to rev up critical race theory.","date":"Tue Mar 22 18:59:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In 2020, Leo moved from running his donors’ court-packing operation to another group called CRC Advisors. CRC works on a number of “projects” on behalf of right-wing donors, like voter suppression and – you guessed it – “critical race theory” in schools. https://t.co/qxajRsFZzb","date":"Tue Mar 22 18:59:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Start at the beginning: Under Trump, Republicans jammed right-wing donors’ preferred nominees onto the Court with the help of a guy named Leonard Leo. Leo commands a massive dark-money Court-capture operation that’s been at work for decades. More here. https://t.co/iK4JUgLJFZ","date":"Tue Mar 22 18:59:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A colleague just alleged that critical race theory guides Judge Jackson’s rulings. That’s not true -- and it’s a reminder of what drives Republican behavior during these hearings. Let’s unpack the allegation.","date":"Tue Mar 22 18:59:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"But for them, the right “judicial philosophy” is the path to outcomes big donors want, so the Republican Justices all say they have one.","date":"Tue Mar 22 18:17:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"All the Republican questioning about “judicial philosophy” presumes she needs one. “Follow my oath, precedent (ordinarily), and the Constitution,” would seem sufficient.","date":"Tue Mar 22 18:17:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Rhode Islander Judge Bruce Selya put it, Judge Jackson has “the capacity to inspire by example and the force of...reason.” That is on display here today.","date":"Tue Mar 22 17:41:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a few minutes, I will ask questions of an accomplished, experienced, highly-qualified Supreme Court nominee in Judge Ketanji Brown Jackson. It will be an honor.","date":"Tue Mar 22 16:01:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Such tender feelings from Putin, a man committing mass murder by military means.\nhttps://t.co/SOVM4qiZsX","date":"Tue Mar 22 14:42:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’d say, grab it and sort it out later in court. What’s he going to say, “I’m here to say it’s not mine”? Then why are you here? Or send in a flunky to say “It is mine”? Great, let’s see the receipts. \nhttps://t.co/PGb1m7on0P","date":"Tue Mar 22 01:41:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/P9PoRvA0SN","date":"Tue Mar 22 00:26:44 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The most powerful tool companies have to fight climate change – and reduce investors’ exposure to climate-related risk – is their political influence. The SEC’s failure to require disclosure of corporate political influencing activities is an enormous missed opportunity.","date":"Tue Mar 22 00:25:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"That means you can “be consistent in a way you are analyzing the issues, and you can set aside any thoughts about who is making the arguments, [and] what advantages any side might take away from your opinions.”","date":"Mon Mar 21 22:29:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“If you have fidelity to the rule of law that is grounded in looking at only those inputs,” she said, “then I think you can rule without fear or favor.”","date":"Mon Mar 21 22:29:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Her guiding principle is to “consistently appl[y]” the “same level of analytical rigor” to a case “no matter who or what is involved in the legal action.”","date":"Mon Mar 21 22:29:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We heard a lot of performance theater from Republican presidential aspirants today, including vague worries about “judicial philosophy.” \n\nWell, if they actually ask her, Judge Jackson will say what she’s said before:","date":"Mon Mar 21 22:29:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The present Court is The Court That Dark Money Built. Anonymous donations funded the Federalist Society while it housed the selection turnstile run by dark-money donors.\n\nJudge Jackson is before us on her own merit, not at the request of a secretive right-wing donor operation. https://t.co/0HBdYtyw3w","date":"Mon Mar 21 17:39:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is refreshing. We are holding a hearing for an accomplished and highly-qualified nominee to the Supreme Court – a nominee who came to us through a fair and honest selection process, not through a dark-money-funded turnstile.","date":"Mon Mar 21 16:05:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m heading to the Judiciary Committee for a historic hearing. Judge Ketanji Brown Jackson has led a remarkable career, and today is an opportunity for the American people to see that.","date":"Mon Mar 21 14:59:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Nice to see it catch on to hold a space in our hearts — and our planning — for outright Ukrainian victory.   Victory. It has a nice ring to it. Let’s help all we can toward victory.","date":"Mon Mar 21 13:27:55 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Sad to say this is totally unsurprising: “Lacking any grounds for opposition, Republicans are resorting to slime.”\nhttps://t.co/iTowaDmDIx","date":"Mon Mar 21 01:41:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corruption must have corruption.","date":"Sun Mar 20 23:03:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As I keep saying, this was a clash of civilizations, but the clash is rule of law v. despotism. This was the dead hand of kleptocracy reaching out to crush a modernizing neighbor, because it can’t stand the competition of rule of law.\nhttps://t.co/25ddoYcU81","date":"Sun Mar 20 23:03:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Meanwhile, on the other end of the planet: ‘On Wednesday, temperatures near the North Pole catapulted 50 degrees above normal, close to the melting point.’”","date":"Sun Mar 20 20:44:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Saw this in Politico - “Eastern Antarctica has been 70 degrees warmer than normal for three days and counting. ‘The warmth has smashed records and shocked scientists,’ report WaPo’s Jason Samenow and Kasha Patel.”\nhttps://t.co/Bph9YebFNe","date":"Sun Mar 20 20:44:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Very soon, Judge Ketanji Brown Jackson will appear before my colleagues and me on the Judiciary Committee. She is an excellent nominee with impeccable qualifications, and I am looking forward to her hearing.","date":"Sun Mar 20 17:46:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/MRrAdoK1bW","date":"Sun Mar 20 15:03:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m glad to have secured $15M in our funding measure to bolster research in the push for a cure for pancreatic cancer. Bit by bit, we will move the needle.","date":"Sun Mar 20 12:59:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Gasoline prices (and Big Oil profits) are way up. We need a windfall tax to take some of those gains and send them back to the American people.","date":"Sun Mar 20 01:36:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"First, corned beef sandwich and a Guinness at Patrick’s Pub after parade; then zeppole at Original Italian Bakery after Polisena/Langevin announcement of soccer field funds. That’s a great Rhode Island day! Happy St. Patrick’s/St. Joseph’s to all. https://t.co/SHkOZtDfAV","date":"Sat Mar 19 23:50:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Quote to consider: \n\n\"Nothing will ever be attempted if all possible objections must first be overcome.\"\n― ‌Samuel Johnson","date":"Sat Mar 19 22:16:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"St. Patrick's Day continues on Smith Hill and inside Patrick's Pub. https://t.co/Kym3bxp08B","date":"Sat Mar 19 19:46:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I was just reading this—it’s a great takedown of bogus Republican attacks on Judge Jackson.\nhttps://t.co/mxPQxprmKB","date":"Sat Mar 19 17:35:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In a strange alliance, Don was the Republican House lead on my ocean plastic waste bills. He got stuff done. RIP, Don, and thank you.   \nhttps://t.co/eXlHHexG27","date":"Sat Mar 19 15:27:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"St. Joseph’s Day has a special history here in Rhode Island – be sure to line up at our great local bakeries for some zeppole to celebrate the occasion!","date":"Sat Mar 19 13:11:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Republicans lobbied the Supreme Court to create loopholes for dark money spending. They'll complain when dark money is turned against them, but they won't lift a finger to stop it – it’s just too useful.\n \nLet's pass my DISCLOSE Act and clean up their mess.","date":"Sat Mar 19 00:47:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The American Bar Association has unanimously rated Ketanji Brown Jackson as “well qualified” to serve on the Supreme Court. She has prepared extensively for this moment, and I know her experience will be made evident in these upcoming hearings.","date":"Fri Mar 18 22:17:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We’ve got to keep oligarchs &amp; criminals out of our financial system. I pushed to increase funding for @USTreasury’s Financial Crimes Enforcement Network, and I’m glad to see them get a $34 million boost in appropriations – they’ll need more. I’ll keep pushing.","date":"Fri Mar 18 20:13:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This week, President Biden signed a budget agreement that drives down expenses for working families and boosts programs that millions of Americans rely on, like Pell Grants and child care. \n\nThere’s more to do, but this is a win.","date":"Fri Mar 18 18:01:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Note the headline, as if the blame did not belong on the fossil fuel industry:\nhttps://t.co/ZYbiksYjkw","date":"Fri Mar 18 16:01:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We owe so much to our health care workers and teachers. I introduced a pair of bills to honor the contributions of these public servants by helping them to wipe the slate clean of student loan debt. \nhttps://t.co/AUJoKXmuJQ","date":"Fri Mar 18 14:52:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Bravo Matunuck Oyster Bar making RI proud!  https://t.co/pZeCKZNION","date":"Fri Mar 18 13:23:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Typical. Right-wing extremists can’t bear a justice they didn’t secretly pick, so the smears fly. \nhttps://t.co/f22zQOS1QS","date":"Fri Mar 18 02:03:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time for American planning to contemplate the prospect that Ukraine might win outright. Is it a long shot? Probably. But planning should contemplate the possibility.","date":"Fri Mar 18 01:02:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Speaking of victory, local militia and Ukrainian army troops just bloodied Russia’s nose protecting the town of Voznesensk.  \nhttps://t.co/ievKXhZ9A5","date":"Thu Mar 17 23:25:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I meant it then, and I mean it now. Ukraine can achieve victory. https://t.co/JjKYwGgNGe","date":"Thu Mar 17 22:24:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Look how Big Oil follows “price” up, but not down, with charges at the pump. Note also that “price” is not cost, but driven by foreign cartel decisions. Costs did not spike with “price.” https://t.co/6q5Lli0oxF","date":"Thu Mar 17 20:55:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congratulations to Brown’s own Ashish Jha, and thank you to Jeff Zients for leading us through the teeth of the pandemic to a safer place.\nhttps://t.co/gY1k2KQI9P","date":"Thu Mar 17 20:49:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Too bad. Some fights are worth having even if you don’t win, so everyone can see what’s going on and who is behind the evildoing.\nhttps://t.co/CGTcVOWrNe","date":"Thu Mar 17 19:24:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rule-of-law nations face a difficult challenge in tracking down and seizing Putin &amp; his oligarchs’ dirty assets. I applaud the Biden administration on its leadership in standing up new efforts to hold Putin’s corrupt regime accountable. https://t.co/QjWtjm7UAx","date":"Thu Mar 17 18:22:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fifth Circuit panel blows up Trump judge’s nationwide injunction against “Social Cost of Carbon” analysis. For good reason.   \nhttps://t.co/AFhuWX2FrU","date":"Thu Mar 17 17:18:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In case Koch dark-money obstruction on climate isn’t evil enough, now this.  \nhttps://t.co/WgWYt8XcLm","date":"Thu Mar 17 15:58:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"At some point, do companies in the corral realize they are being had by #ChamberofCarbon? Or are they in on the scam, able to tell folks they’re in the climate conversation, but happily doing nothing at the end of the day?","date":"Thu Mar 17 14:31:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"U.S. needs to keep up here and join the club, and stop listening to fossil fuel interests‘ relentless climate denial and political bullying. A world carbon price is our pathway to climate safety. \nhttps://t.co/XJkkOW90P2","date":"Thu Mar 17 13:21:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We actually win in this contest against China and India; fossil fuel interests are blocking us from a contest we would win economically.","date":"Thu Mar 17 13:21:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fossil fuel market manipulation is driving up gasoline prices around the world. We need the Big Oil Windfall Profits Tax to end Big Oil profiteering and help American consumers.","date":"Thu Mar 17 01:48:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin’s oligarch cronies are complicit in his cruel and savage conduct. Let’s give them a reason to worry by putting bounties on their ill-gotten assets. \n\nThrough them, we get to him.","date":"Thu Mar 17 00:07:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The biggest auditioner of all was Brett Kavanaugh. He made clear that he would be on the team of right-wing donors if on the Court. https://t.co/B2aeegqMC7","date":"Wed Mar 16 22:56:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’ll be taking part in this live discussion on oligarch asset seizure &amp; financial transparency tomorrow at 11am EST. Tune in.","date":"Wed Mar 16 21:51:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need to start accounting for the fact that Ukraine can achieve victory over Putin. I’m headed to the floor to talk about that now.","date":"Wed Mar 16 20:46:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you President Biden for decades of leadership on VAWA! https://t.co/tzTyInlSW3","date":"Wed Mar 16 20:09:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If you let that happen, interests that can gin up “controversy” can cause DOJ to flinch, and escape legal accountability. That’s not justice.","date":"Wed Mar 16 19:18:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here’s the test for DOJ: will it avoid doing anything hard or controversial, as proxy for avoiding doing anything political?\nhttps://t.co/3mn53gT7uh","date":"Wed Mar 16 19:18:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin and his oligarchs stow their dirty money in rule-of-law nations by purchasing mansions, mega-yachts, artwork, and other high-value assets. We ought to seize those ill-gotten luxuries and put them to use helping the Ukrainian people.\nhttps://t.co/kv18AwkOwC","date":"Wed Mar 16 17:43:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"They have power. As members, they’re entitled (indeed have due diligence) to ask about fossil fuel funding in the last decade: Chamber was likely paid millions to be top climate obstructor. Are they even asking that question? For sure, #ChamberofCarbon doesn’t want to answer!","date":"Wed Mar 16 16:42:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In sum, they remain a bad net negative against getting on a pathway to climate safety. They are still a top U.S. obstructer.","date":"Wed Mar 16 16:31:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"All the Chamber’s fossil-fuel-funded evil bypasses that “conversation” and goes straight into operations, including #ChamberofCarbon attack right now on climate-aware Fed nominee Raskin and opposition to climate-friendly reconciliation bill.","date":"Wed Mar 16 16:31:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Outside HFC legislation (which doesn’t trigger fossil fuel interests), the “climate” stuff #ChamberofCarbon has supported has no significant effect on emissions reduction.","date":"Wed Mar 16 16:31:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Let’s review the bidding on the #ChamberofCarbon climate efforts. It started when InfluenceMap nailed @USChamber as “worst climate obstructor in the U.S.” Some companies griped about being associated with that brand and demanded better climate performance from #ChamberofCarbon.","date":"Wed Mar 16 16:31:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"#ChamberofCarbon responded by corralling those companies into a climate “conversation” that has now been going on for over two years. Every good climate thing goes to climate conversation, where it dies. But not the bad stuff.","date":"Wed Mar 16 16:31:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It was a pleasure meeting with students from @universityofri’s Service Corps, who came to DC to learn about federal advocacy. https://t.co/DXPxR5hHgN","date":"Wed Mar 16 15:38:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Jane Mayer gets it right again about fossil fuel dark-money thuggery. Sickening. There’s a special corner in Hell...\nhttps://t.co/V7uXaRQLeI","date":"Wed Mar 16 13:51:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This morning, President Zelenskyy will address Congress from Kyiv, where Ukrainians have mustered their strength to defend their homes &amp; lives. \n\nIt is an honor to hear him speak at this critical moment, and I will keep pushing to secure help for his people.","date":"Wed Mar 16 12:52:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oligarchs &amp; kleptocrats should be terrified of bringing their dirty money anywhere near the United States. Instead, our financial system has become a haven for corruption. We need reforms to enforce transparency &amp; punish those who hide criminal assets. \nhttps://t.co/MrndR6bSgk","date":"Wed Mar 16 02:05:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This talented woman was attacked with lies by the dark-money “flying monkeys” of the fossil fuel apparatus. They can’t bully their way out of climate responsibility, but they sure do try.","date":"Wed Mar 16 00:51:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"She deserves a medal; she’ll probably get the gulag.\nhttps://t.co/A8WtGYbPht","date":"Tue Mar 15 23:42:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The right-wing Supreme Court auditioning continues for the next time a Republican president is in office.  Scheme donors expect stand-out candidates who wear their commitment to the cause on their sleeves. Watch closely. https://t.co/eHSreCHn1p","date":"Tue Mar 15 22:30:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m heading to the Senate Floor to deliver remarks on the Scheme that captured and now controls America’s Supreme Court. \n\nSet up a machine like that, and pretty soon you see would-be justices “auditioning” for the bench. Tune in soon.","date":"Tue Mar 15 22:17:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/Zq7HXsqxDj","date":"Tue Mar 15 21:29:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More info here: https://t.co/wulqEukCbs","date":"Tue Mar 15 20:25:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Our new bicameral, bipartisan bill allows rewards to those who come forward and disclose secret ownership and facilitate seizures of corrupt oligarch assets.    \nhttps://t.co/2f1HX8pSkw","date":"Tue Mar 15 20:05:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Sunshine Protection Act just passed the US Senate with unanimous consent. This is a big, sensible step forward. \n\nLong live Daylight Saving Time!","date":"Tue Mar 15 18:42:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time for Congress to take up our bipartisan legislation to make Daylight Saving Time permanent and brighten the coldest months with an extra hour of afternoon sun. https://t.co/Mtow6aHYsz","date":"Tue Mar 15 18:25:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"On my way to the floor to call for a vote on my Sunshine Protection Act and keep Daylight Saving Time around for good. Live remarks coming soon!","date":"Tue Mar 15 17:54:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"If the “Big 4” audit firms (E&amp;Y, PwC, KPMG &amp; Deloitte) leave Russia it will impede big Russian firms’ investors’ and counterparties’ reliance on audits under due diligence requirements.","date":"Tue Mar 15 16:38:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The gender pay gap isn’t just unfair to working women – it hurts families and our economy, too. Now is the time to level the playing field. This #EqualPayDay, I’m pushing to pass the Paycheck Fairness Act to help make sure women earn equal pay for equal work.","date":"Tue Mar 15 15:12:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I fought to secure more funding for the Residential Substance Abuse Treatment Program and I’m glad to see it passed. Incarcerated individuals on the long &amp; noble path to substance use recovery are less likely to reoffend if we ensure access to care once back in their communities.","date":"Tue Mar 15 13:08:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I just filed a bill to reclaim the windfall profits that Big Oil is raking in. Here’s how it works: https://t.co/KlzXMMUmgE","date":"Tue Mar 15 00:50:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Seizing ostentatious wealth from corrupt oligarchs is not just  “schadenfreude” but a “little bit of justice.”\nhttps://t.co/XtYsuCXp3m","date":"Mon Mar 14 22:20:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Deleting this tweet because it won’t be happening tonight. But stay tuned – we’re determined to see our bill passed.","date":"Mon Mar 14 21:09:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Skyrocketing child care costs are a huge stress on Rhode Island families. That’s why Democrats boosted the 2021 Child and Dependent Care Tax Credit to record levels. \n\nParents – check out how to get thousands back in your pocket this filing season:\nhttps://t.co/knnyjXGcka","date":"Mon Mar 14 18:44:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Koch Industries has decided to continue its business operations in Russia, while the Koch Foundation runs its dark money operation here in the United States. Does that surprise anybody?","date":"Mon Mar 14 16:39:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fukuyama shares my view: outright Ukrainian victory is possible — and would change the world. Great piece.\nhttps://t.co/ZdW7AiVUYz","date":"Mon Mar 14 15:12:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin’s Ukraine attack is fossil-fuel funded, fossil fuel is his leverage over Europe, and — oh, yes — fossil fuel emissions are destroying habitability of Earth; so fossil fuel lies in overdrive.\nhttps://t.co/HzzfLOVv6f","date":"Mon Mar 14 12:52:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good story about regular news buckling under pressure from immense fossil fuel propaganda machine.","date":"Mon Mar 14 12:52:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Shareholders deserve to know that.","date":"Mon Mar 14 02:14:42 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"At last. Disgraceful this wasn’t done under previous administrations. One aspect: reputational risk to companies that say one thing on climate publicly, while privately (and through trade associations) telling Congress to do nothing. \nhttps://t.co/2VXGPWw41W","date":"Mon Mar 14 02:14:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As always, Dowd writes beautifully, here about beautiful writing put into political service. My only cavil is that Putin is not “irrational,” his premises and values are warped; his salient fact is that Russia is in hopeless decline.\nhttps://t.co/pRrM1tslqp","date":"Sun Mar 13 22:21:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court opened the door for dark money, and we’ve been drowning in it ever since. Let’s pass my DISCLOSE Act and restore a democracy by the people, for the people.","date":"Sun Mar 13 19:02:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s more than a sideline drama. It’s a pain point for Putin when oligarchs’ (and his) assets get the squeeze. And it’s a “stand up” moment for the West against kleptocracy, with national security significance. And as Finley says, it’s justice.\nhttps://t.co/Kcfwu5kweR","date":"Sun Mar 13 16:17:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"(3) it was reasonably foreseeable that interstate wire communications would be used; and (4)  interstate wire communications were in fact used.","date":"Sun Mar 13 14:19:25 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Wire fraud elements: (1) the defendant voluntarily and intentionally devised or participated in a scheme to defraud another out of money; (2) the defendant did so with the intent to defraud;\nhttps://t.co/jSDLfmeMXM","date":"Sun Mar 13 14:19:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Where can we go buy this stamp!?  :-)\nhttps://t.co/c5cUh5gBF4","date":"Sun Mar 13 02:37:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The fossil fuel industry is using the crisis in Ukraine to jack up prices and rake in cash. @RoKhanna and I introduced a windfall profits tax to send that money back to the American people through quarterly checks. It’s time to make this right.","date":"Sun Mar 13 00:48:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Tomorrow, we’re going to change our clocks to gain an hour of daylight. If we pass my Sunshine Protection Act and make Daylight Saving Time permanent, we’ll never have to lose that hour - let's get it done! https://t.co/793kpo2Soh","date":"Sat Mar 12 23:39:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We know oligarchs and international criminals use our financial system to hide their stolen wealth. Now, we've passed over $350M to help @FinCEN and @USTreasury track down these bad actors and cut them off. I'll keep pushing for more funding to clean up this mess.","date":"Sat Mar 12 21:22:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans are tired of changing their clocks twice a year. When winter comes, nobody wants to be sitting in the dark. Let’s make Daylight Savings Time permanent and free ourselves from this outdated ritual.","date":"Sat Mar 12 19:01:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good call but now we need DOJ transparency about what led to Antitrust Section mischief against those car companies under Trump.  \nhttps://t.co/yh8GffGDdF","date":"Sat Mar 12 17:03:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m thrilled to deliver more than $68 million in omnibus funding to the Ocean State to create jobs, expand opportunity, &amp; make Rhode Island a better place to live. This will make a difference in every corner of our state.","date":"Sat Mar 12 14:24:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukraine’s Minister of Defense says Russians have now killed more Ukrainian civilians than they have killed Ukrainian military, border guard and police casualties combined. It’s a war on civilians.","date":"Sat Mar 12 04:01:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Another blow to reproductive freedom: state Supreme Court blocks a challenge to Texas’s unconstitutional abortion bounty-hunting scheme. Copy-cat bills are popping up across the country, while precedent flies out the window. Very grim.","date":"Sat Mar 12 01:36:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Now that it’s clear that the international dark economy is a threat to U.S. national security, maybe it will be given less “aid and comfort” by U.S. firms.  \nhttps://t.co/OcTkOKBHeY","date":"Sat Mar 12 00:00:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Milbank calls out Republican “gusher of mendacity” on oil prices. No shame in GOP.  \nhttps://t.co/YKPL49LRwf","date":"Fri Mar 11 22:26:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Here is what BlackRock says elsewhere, the other face:","date":"Fri Mar 11 21:43:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"\"'BlackRock believes that climate change has become a defining factor in companies’ long-term prospects,' it said in January in a document indicating how it will decide how to vote in shareholder elections.\"  https://t.co/uCWeJGi5mL","date":"Fri Mar 11 21:43:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"IPCC North America section begins: “these risks have been made more urgent by delays due to misinformation about climate science that has sowed uncertainty and impeded recognition of risk.” That’s Big Oil. \nhttps://t.co/4R0iqHVOkQ","date":"Fri Mar 11 19:34:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oil companies never let a good crisis go to waste. My windfall profits tax will make them share the excess billions they are charging American drivers, and put that money back into Americans’ pockets.","date":"Fri Mar 11 17:38:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"\"Vladimir Putin has given us another powerful reason to kick the fossil fuel habit with his murderous invasion of Ukraine.”\nhttps://t.co/AuMvyAqw6W","date":"Fri Mar 11 15:45:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/XeyAEsat8n","date":"Fri Mar 11 14:48:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Remember that Justices on whom Americans for Prosperity spent millions all failed to recuse in AFPF case, and corporate veil between AFP/AFPF could be pierced with a banana. #TheCourtThatDarkMoneyBuilt\nhttps://t.co/8wPbT6H7mR","date":"Fri Mar 11 01:47:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Trump press secretary Stephanie Grisham says, “I think [Trump] feared [Putin]. I think he was afraid of him. I think that the man intimidated him.”\nhttps://t.co/SJUYRud697","date":"Thu Mar 10 23:43:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“For decades, the American people have been told energy independence…would insulate us from the vagaries of global markets and geopolitics. This is and always has been a myth.” — Cullen Hendrix, senior fellow at the Peterson Institute for International Economics","date":"Thu Mar 10 22:43:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Senate must wake up to the urgent threat of climate change. Indolence in the face of known danger is a particularly stupid form of cowardice. https://t.co/VXwqdGihSj","date":"Thu Mar 10 21:11:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We cannot allow the fossil fuel industry to collect a massive payout by taking advantage of an international crisis. I propose sending Big Oil’s big windfall back to the hardworking people who paid for it at the gas pump.","date":"Thu Mar 10 19:05:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts! That’s where the truth counts and the BS ends.\nhttps://t.co/nWTWvOl5lJ","date":"Thu Mar 10 18:08:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We have no other planet standing by. It’s time to take self-rescue seriously, by every available means, and fast. https://t.co/9ray4rkNss","date":"Thu Mar 10 16:36:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I wish I was done with my climate speeches. \n\nI wish I’d never had to deliver a single one. \n\nIn a few minutes, I’ll be back on the Senate floor to give another.","date":"Thu Mar 10 16:26:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Watch any ad for a fossil fuel company and you’ll spot one of these deceptive tactics. If @BCWGlobal, @Ogilvy, and @EdelmanPR are serious about climate action, they’ll #StopPolluterPR. https://t.co/MHbDX5Rmny","date":"Thu Mar 10 16:20:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"PR firms that work with polluters are holding us back at a critical moment and legitimizing the fossil fuel industry’s empty promises. We need bold climate action, not deception &amp; delay. 3/3","date":"Thu Mar 10 16:11:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Firms like @EdelmanPR make big climate pledges while raking in millions from fossil fuel clients. Instead of outright denial, PR firms greenwash these polluters by broadcasting their pitiful investments in clean energy. 2/3\n#StopPolluterPR","date":"Thu Mar 10 16:07:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fossil fuel companies have to maintain an illusion of sustainability. They pay lawyers, think tanks, and front groups to bury the truth – but it falls to the PR industry to hide the whole mess and give polluters the cover they need. 1/3\n#StopPolluterPR https://t.co/IhjuTtgxY6","date":"Thu Mar 10 16:05:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Some of America’s biggest PR firms are helping the fossil fuel industry get away with destroying our planet. Honest companies don’t spread disinformation, so it’s time for @BCWGlobal, @Ogilvy, and @EdelmanPR to stand up and #StopPolluterPR.","date":"Thu Mar 10 16:00:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The danger of losing local control is very real, and the vultures have already begun circling\nhttps://t.co/Vn9tFLfwxO","date":"Thu Mar 10 14:17:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukrainians blow up Russian armored convoys. Russians blow up Ukrainian children’s hospitals. Keep alive in your hearts the prospect that Ukrainians actually win this thing.\nhttps://t.co/BtgwRqGW8Q","date":"Thu Mar 10 02:47:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Feel like government isn’t listening to you? Billionaire political spending up 70x from around $17 million in 2008 cycle to around $1.2 billion for 2020 cycle. Think they wanted tax fairness? Climate action? Drug price reform? Pass DISCLOSE Act.","date":"Thu Mar 10 01:22:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today’s budget agreement renews the Violence Against Women Act and secures needed funding for #VAWA programs. This long-overdue reauthorization will strengthen a critical lifeline for victims of domestic abuse and secure justice for survivors.","date":"Thu Mar 10 00:02:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rampant gerrymandering endangers democracy. Power taken from voters doesn’t just go away; it goes to special interests, and the results are predictably rotten.","date":"Wed Mar 09 22:41:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money uses sophisticated mapping to weaponize gerrymandering for special interests. SCOTUS decisions opened the door for gerrymandering, worsening partisanship and dysfunction.","date":"Wed Mar 09 22:41:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Partisan gerrymandering, corrosive and undemocratic, is fueled by dark money groups with big-donor agendas too unpopular to win a fair fight. It’s that simple.","date":"Wed Mar 09 22:41:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"SCOTUS did NOT strip state courts of power to review rigged maps; BUT at least 4 conservatives launched a wacky theory to make courts subservient to legislatures as to gerrymandering.","date":"Wed Mar 09 22:41:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Americans hate politicians picking their voters by gerrymandering. SCOTUS just decided a big case on this issue, and it’s good news/bad news.","date":"Wed Mar 09 22:41:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Why are Republicans urging Biden to ban Russian oil and gas, then slamming him for price hikes that causes?","date":"Wed Mar 09 21:14:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/TPmHnTgUj0","date":"Wed Mar 09 20:04:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Unfortunately our climate predicament has a lot to do with this sort of two-faced corporate behavior:  \nhttps://t.co/s3XKSLWggQ","date":"Wed Mar 09 20:04:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"OMG they found Shackleton’s Endurance!!\nhttps://t.co/A7LvNq2d0q","date":"Wed Mar 09 18:30:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hate crimes have spiked and become a top national threat priority. @kristenclarkejd explains why we need to charge these offenses appropriately. https://t.co/i9dPBEXHQq","date":"Wed Mar 09 17:31:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is Putin’s gas price increase. There can be no \"energy independence\" as long as we power our economy with commodities whose value is determined by global events beyond our control.","date":"Wed Mar 09 15:34:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Furthermore, the fossil fuel industry should not be allowed to take advantage of a crisis by hiking prices and collecting a massive windfall. Switching to renewables over the longer term will lower costs, insulate consumers from price spikes, &amp; protect our national security.","date":"Wed Mar 09 15:34:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"With huge dollars like this flowing around, it’s important to treat fishermen fairly.\n\nThey were there first, but the little guy often gets overrun in the big-money scramble.\nhttps://t.co/umIkWcqk45","date":"Wed Mar 09 14:31:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A new @AmRevMuseum exhibit helps tell the important story of the First RI Regiment, the nation’s first integrated military unit. @davidcicilline and I have a bill to finally recognize the First RI Regiment’s contributions with a Congressional Gold Medal. https://t.co/ENOaNuJTVd","date":"Wed Mar 09 13:31:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good. Sends an important message as war criminal bombards Ukraine’s civilians.\nhttps://t.co/I59WJfbLCr","date":"Wed Mar 09 01:41:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Rhode Islanders need a @USPS that can reliably deliver medications, checks, mail ballots, &amp; correspondence on time. This bipartisan legislation will finally solve some of the agency’s longstanding financial issues &amp; better support our hardworking letter carriers.","date":"Tue Mar 08 23:43:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Keep alive in your heart the possibility that Ukraine could actually win: columns stalled, defense fierce, casualties high, morale low, deserters surrendering, food and fuel snafu, population uncowed.","date":"Tue Mar 08 22:41:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"They’ve been lying: “fossil fuel interests have been successful in misleading Americans…in a decades-long campaign to question climate science and delay action, enlisting conservative think tanks and public relations firms”. \nhttps://t.co/gQW9Tzwk2N","date":"Tue Mar 08 20:40:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Out-of-state acquisition is a predictable and deeply unfortunate consequence of the in-state merger failing.   We need a plan to keep RI hospitals owned and controlled in Rhode Island.\nhttps://t.co/Jv2igMTUZF","date":"Tue Mar 08 18:52:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Special unit of Ukrainian National Police take out Russian armor.\nhttps://t.co/vLdIFgmg6I","date":"Tue Mar 08 17:41:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I just met with Judge Jackson, who will soon appear before the Judiciary Committee as a Supreme Court nominee. She brings deep experience and expertise to the table, and I look forward to the confirmation process. https://t.co/OZYu5Wmr1u","date":"Tue Mar 08 16:09:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Cartels have their own dark financial networks, and @ONDCP has to go after them in their national drug control strategy. That means clear goals, real metrics, and serious prioritization.","date":"Tue Mar 08 14:18:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Would they be refugees or hostages?\nhttps://t.co/93r7srpjfo","date":"Tue Mar 08 02:53:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money poisons democracy by allowing special interests, corporations, and foreign governments to operate anonymous influence campaigns. In the United States, we must pass my DISCLOSE Act and slam the floodgates shut.","date":"Tue Mar 08 00:59:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good positivity from Tony Blinken. Positive thinking matters in conflict.\nhttps://t.co/9FlZnkD32c","date":"Mon Mar 07 23:32:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The United States has to stand up to kleptocrats &amp; oligarchs, which means keeping their ill-gotten gains out of our financial system. Tomorrow, I’ll join @ACEurasia to discuss what Congress can do to enforce transparency &amp; crack down on money laundering.\nhttps://t.co/WFg0GD5ZwY","date":"Mon Mar 07 20:51:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today we’re launching a new federally funded @RIPTA_RI pilot program that will make riding the bus free if you get on in @CentralFalls_RI. It’s good for working families, the economy, and our environment. Congrats @MariaForCF and all who helped make this happen. https://t.co/4BMlj3CSqj","date":"Mon Mar 07 19:15:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Germany gets that renewable energy is a “no-brainer for any government with any form of foresight.” Fossil fuel obstruction campaign still hampers U.S. \nhttps://t.co/K7gKD5frYb","date":"Mon Mar 07 17:26:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To the 16k+ Rhode Islanders who signed @AARPRI’s petition in support of allowing Medicare to negotiate drug prices, thank you for making your voice heard. I am with you – we have to get this done for our seniors this year.","date":"Mon Mar 07 15:20:51 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Will can be a pretty abject fossil-fuel flunky, but he’s got a way with words: \n\n“Trump, the suppurating wound on American life, and…those who share his curdled venom.”\nhttps://t.co/xoNlvjLrzt","date":"Mon Mar 07 13:52:33 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Per Zelenskyy: American (and international) companies should close up their stores in Russia, stop sending their goods to Russian stores, and cease all maintenance and support of equipment located in Russia.","date":"Mon Mar 07 01:25:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For every dollar of drugs sold, a dollar of revenue is hidden. Yet only a fraction of government resources are used to address money laundering &amp; the dark economy of the drug trade. Now, the Senate Narcotics Caucus is focused on attacking the financing schemes run by cartels.","date":"Sun Mar 06 22:13:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Celebrated 178 years of independence for the Dominican Republic on Friday night. RI's vibrant Dominican community continues to lead the way. https://t.co/qtlOnbXrL3","date":"Sun Mar 06 19:31:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Prices are low — fossil fuel industry: “we need to pump more because prices are low.”\nPrices are high — fossil fuel industry: “we need to pump more because prices are high.”","date":"Sun Mar 06 18:29:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"And another! (Don’t forget the mansions and artworks.)  \nhttps://t.co/vYQJZbubea","date":"Sun Mar 06 16:23:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Important update for Rhode Islanders: the American Rescue Plan expanded the Child and Dependent Care Tax Credit for 2021. That means you could get up to $4,000 for one qualifying dependent, or $8,000 for two. Learn more here: https://t.co/jHDqHx2fig https://t.co/3ShviVMitO","date":"Sun Mar 06 14:38:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/1Nkv0rlTvu","date":"Sun Mar 06 00:44:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Scientists (and Congress) have recognized carbon emissions as harmful pollutants for decades. If the Supreme Court makes up false facts to give fossil fuel a big win in WV v. EPA, here’s a timeline everybody should see from @BostonGlobe: https://t.co/xWJ7z0A4UW","date":"Sat Mar 05 22:39:05 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Plus does he want to? When your crew is in the house shoveling the loot out the windows do you really want a ruckus on the front lawn? 6/3 before; 6/3 after.\nhttps://t.co/a2v9C6dwPw","date":"Sat Mar 05 20:40:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"By keeping secret, dark-money influence paths open for their fossil fuel funders, Republicans open the same paths to secret foreign influence. Some priorities.","date":"Sat Mar 05 19:11:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Stunning to be on with Zelenskyy in the midst of all this. God bless him and his people. https://t.co/FLYvyzyzlD","date":"Sat Mar 05 17:03:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"President Biden is right - fighting the opioid epidemic requires bipartisan cooperation. I introduced CARA 3.0 with @SenRobPortman to boost existing programs, expand prevention &amp; treatment efforts, and make recovery possible for more Americans. It's time to get this done.","date":"Sat Mar 05 15:43:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Pile it on.\nhttps://t.co/9xxswpwJqQ","date":"Sat Mar 05 00:30:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good to be back at the State House celebrating #InternationalWomensDay a few days early with Hope and Change for Haiti. https://t.co/MzKNPWhxDI","date":"Sat Mar 05 00:13:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today’s drug cartels are hulking multi-national conglomerates, run on a massive dark economy. To weaken kleptocrats and criminals, we have to dismantle their financial networks and stay ahead of their tactics. https://t.co/moE8mHcbbM","date":"Fri Mar 04 22:16:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Wonderful takedown of right-wing dark money hypocrisy by Dana Milbank. Laugh or cry?\nhttps://t.co/eX6JGsndMB","date":"Fri Mar 04 21:22:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oops!  Fact checker blows up dark-money “fictitious” group Judicial Crisis Network complaining about dark money. Like Putin, the “fictitious name” group accuses others of doing what it is actually doing, as a propaganda strategy. Busted!!\nhttps://t.co/xhPqNffFAh","date":"Fri Mar 04 20:35:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Polluter front groups (w pliant polluter-funded AGs) in Supreme Court asked justices they put on the Court to tear down regs limiting pollution, without an actual regulation to complain about.  Some would say no “case or controversy,” but money talks — and dark money whispers.","date":"Fri Mar 04 18:59:22 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The bipartisan Postal Service Reform Act will put USPS on solid financial footing and better support the hardworking letter carriers who deliver six days a week, no matter what. We look forward to passing it next week in the Senate. https://t.co/dy80bxwRzu","date":"Fri Mar 04 17:53:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The numbers are in - US economy added 678,000 jobs in February. That’s good news for our country and a testament to our resilience. We have more to do, so this is a sign to keep pushing.","date":"Fri Mar 04 15:30:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin chose this senseless war. Now, the Biden administration is standing up an international task force to put Russian oligarchs in a vice grip by seizing assets and imposing punishing costs. \n \nThere must be accountability and justice for the people of Ukraine.","date":"Fri Mar 04 01:15:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Prosecutors should never confuse “not angering anyone” with “doing their jobs”; particularly where strategic faux outrage is used to deter them from doing their jobs.","date":"Thu Mar 03 23:32:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"That’s the spirit!\nhttps://t.co/ahRY5vfyhI","date":"Thu Mar 03 21:00:44 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank you, @POTUS, and thank you, @SenSchumer! Onward to passing DISCLOSE and ending dark money’s hold on our democracy.","date":"Thu Mar 03 19:57:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Meanwhile, the oil and gas propaganda machine are saying more oil and gas is answer for Ukraine crisis. Shameless.\nhttps://t.co/DzFCTkzZba","date":"Thu Mar 03 17:59:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need an immediate windfall profits tax. Exxon et al will profit by billions off Ukraine’s misfortune and Putin’s cruelty, and plow that money back into climate denial and political dark money, extending their vicious cycle of profit and corruption.\nhttps://t.co/Srtyg4Q4XK","date":"Thu Mar 03 15:42:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A good start. Needs hooks to Treasury/FinCen, State/sanctions, DOD/DNI (intel and seizure), and NSC.\nhttps://t.co/PEJQsfnGt2","date":"Thu Mar 03 14:25:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kleptocrats like Putin and his oligarchs can be defeated. With a little sunlight, we will vanquish them. Free societies and the rule of law win the longer battle against kleptocracy and corruption.","date":"Thu Mar 03 01:40:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukraine’s representative, Svitlana Krakovska, pointed out: “Human-induced climate change and the war on Ukraine have the same roots—fossil fuels—and our dependence on them.”\nhttps://t.co/QYUsOaU5DT","date":"Thu Mar 03 00:01:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin and his oligarchs seek the protection of our rule of law and our secure financial system to stow their illicit money. To gain that protection, they need anonymity.  https://t.co/2zC3ykc7q4","date":"Wed Mar 02 21:33:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m headed to the Senate floor to address the march of Putin’s kleptocracy in Europe - we must consider how we arrived at this moment.","date":"Wed Mar 02 21:18:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Drug manufactures’ price hikes mean more Americans face impossible choices – like whether to buy medicine or groceries. My colleagues and I are demanding answers from @PhRMA. \n\nThe profiteering has to stop.","date":"Wed Mar 02 19:53:20 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"PR firms help the fossil fuel industry do their dirty work, and it’s time to hold them accountable. I hope the “winners” of today’s F-List awards take notice.","date":"Wed Mar 02 18:25:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"On three separate occasions, Judge Ketanji Brown Jackson has been confirmed by the Senate with bipartisan support. \n\nHer qualifications were outstanding then, and they’re more outstanding now.","date":"Wed Mar 02 17:52:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"At last WH attention to:\n“climate delayism intended to extend the use of [natural gas]”\n“forces arrayed against climate action”\n“deliberate disinformation campaigns as insidious as they are invidious”\n“special interests sowing doubt” \nhttps://t.co/qoiVapC45d","date":"Wed Mar 02 16:34:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“fake ‘grassroots’ organizations staffed with fake experts” \n“manipulating public opinion”\n“targeted delayism intended to extend the use of methane”\n“transition from denial to division, deflection, distraction, delay”\n“this eco-chamber of restating climate facts”","date":"Wed Mar 02 16:34:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I have admired Judge Lynch since my days arguing before her. I wish her many years of productive senior status, and hope to help rapidly confirm her successor.","date":"Wed Mar 02 14:57:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The President is right – it’s past time to end special interest control of our democracy.","date":"Wed Mar 02 04:11:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"President Biden just condemned dark money in our politics, and he identified my DISCLOSE Act as the solution. It’s time to strengthen our democracy, cast out anonymous special interests, and build a country that works for its people.","date":"Wed Mar 02 02:57:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m glad to have Bob Billington, the head of the Blackstone Valley Tourism Council, as my virtual guest for the #SOTU. Our American Rescue Plan saved the Tourism Council’s Polar Express, a beloved tradition &amp; an important economic engine for local businesses.","date":"Wed Mar 02 00:12:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We’ve missed this as a national security imperative for too long. The international dark economy sustains our enemies and degrades our values. \nhttps://t.co/1n4mAVW69c","date":"Tue Mar 01 22:59:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"These scientists lay out important facts. Dark-money Justices make up their own facts.  We’ll see if facts or “facts” prevail in The Court That Dark (Polluter) Money Built.  \nhttps://t.co/Q4B56E2ZCJ","date":"Tue Mar 01 21:01:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Struggling businesses don’t report record profits while increasing CEO pay. \n \nUsing inflation as cover for price gouging and collusion is dishonest and wrong.","date":"Tue Mar 01 18:46:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Yesterday, I met with Oleksandra Ustinova, a Member of Ukraine’s Parliament, to discuss the best possible ways to support the Ukrainian people as they fight for their democracy. https://t.co/D9hHt9gLuS","date":"Tue Mar 01 17:06:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Oil and gas industry refuses to clean up its act, underreports instead. Typical.  \nhttps://t.co/RnAZYZ0RjX","date":"Tue Mar 01 14:26:24 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More out-of-state ownership is NOT what Rhode Island needs.   \nhttps://t.co/2iKqyl4RSZ","date":"Tue Mar 01 13:28:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I support grabbing oligarchs’ assets as the people of Ukraine fight for their lives and for their country. Putin launched this savage attack, and he and his corrupt cronies must pay dearly for it.","date":"Tue Mar 01 01:47:31 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Warning GRAPHIC: The weeping father’s hands are bloody, but it’s the “genius” Putin who truly has this little girl’s blood on his hands.  \nhttps://t.co/UhFnzU4R5V","date":"Tue Mar 01 00:02:56 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In America’s national security and economic interests, we must free consumers from dangerous dependence on volatile oil and gas markets, by shifting to secure renewables, whose fuels are free. \"Energy independence\" based on fossil fuels is an illusion.","date":"Mon Feb 28 21:51:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The UN is blasting out science’s alarm to the world, making clear that we have a narrow window for action to lead the planet to safety. Humankind has the power to prevent the worst of what is projected in this report, but we must get going immediately. https://t.co/vKOqDM5hZO","date":"Mon Feb 28 21:51:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Court shouldn’t heed the will of right-wing special interests at the expense of established law and the good of the American people.","date":"Mon Feb 28 20:16:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Today’s oral arguments in West Virginia v. EPA are part of a massive, anonymously-funded influence campaign by the fossil fuel industry to torpedo public health and environmental protections.","date":"Mon Feb 28 20:16:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts, when polluter influence hobbles the other branches.\nhttps://t.co/uCZoqQLWHu","date":"Mon Feb 28 18:25:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I am very sorry to hear that Senator Feinstein’s husband, Richard Blum, has passed away. My thoughts are with Dianne and their family.","date":"Mon Feb 28 16:55:58 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In climate speeches I’ve discussed the pteropod, another key link in the ocean food chain also getting walloped by climate change (severe shell damage from ocean acidification).   \nhttps://t.co/yqV80wUGFK","date":"Mon Feb 28 14:13:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Update from Senior Administration official: “we will launch a multilateral transatlantic task force to identify, hunt down, and freeze the assets of sanctioned Russian companies and oligarchs.\"","date":"Mon Feb 28 01:38:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Judge Ketanji Brown Jackson has led a remarkable career, and her work on the DC Circuit Court is a testament to her expertise. She has the makings of an outstanding justice.","date":"Sun Feb 27 23:57:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"How groups like Bellingcat explode Russian propaganda (as well as exposing Russian murders/attempts).   \nhttps://t.co/eZqtcemRSz","date":"Sun Feb 27 22:05:39 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Great news: White House and allies announce “transatlantic task force that will identify and freeze the assets of sanctioned individuals and companies — Russian officials and elites close to the Russian government, as well as their families, and their enablers.” Bravo.","date":"Sun Feb 27 19:50:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I am hearing from friends with direct on-the-ground knowledge that the Ukrainian resistance is strong and is surprising many in the American media. This is just the beginning. We will continue to push for massive, punishing sanctions on Putin’s regime and all necessary aid.","date":"Sun Feb 27 18:00:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Seeing corrupt Russian oligarchs’ mega-yachts seized, mansions behind police tape, art works sold off, all to benefit Ukraine relief and resistance — wouldn’t that be nice!","date":"Sun Feb 27 16:42:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"NYT/Krugman and WSJ Ed Page agree with me re targeting oligarchs – not usually much overlap there! https://t.co/EEOTuIE39V","date":"Sun Feb 27 15:45:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I will try to send the best articles on Ukraine. Ignatius is excellent and was also on our Codel McCain.  \nhttps://t.co/Ua3EV0SdEY","date":"Sun Feb 27 01:45:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There goes Mitch on “far-left dark-money groups.” They can’t attack Judge Jackson’s stellar record or qualifications, so they’ll use SCOTUS nom to fog the far-right dark-money apparatus that packed and captured the Court.","date":"Sat Feb 26 23:13:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"To do this, we have to “take on our own corruption.” Who opposed my transparency bill? First U.S. Chamber, then American Bar Association, then NFIB. Why? Some people make lots of money giving aid and comfort by hiding corrupt foreign dollars.\nhttps://t.co/3NqnXrKy87","date":"Sat Feb 26 19:12:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Right-wing donors spent hundreds of millions of dollars to stack the Supreme Court with anti-abortion justices, and the Court now appears poised to strike at the heart of Roe. With #RoevWade hanging in the balance, it’s time to pass the Women's Health Protection Act.","date":"Sat Feb 26 16:53:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Congratulations to Dr. David Cash on his appointment as Administrator for @EPAnewengland. Looking forward to working with him on issues affecting the Ocean State.","date":"Sat Feb 26 14:58:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Judge Jackson’s qualifications are impeccable. She will serve with distinction on our nation’s highest court.","date":"Sat Feb 26 01:02:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This ruling greenlights a maneuver to help big corporations on solid financial footing shirk responsibility for hurting Americans. The Texas Two-Step is neither efficient nor fair for victims - we need to find a sensible way to fix it.\nhttps://t.co/wd4bIoVTw0","date":"Fri Feb 25 23:31:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Aeroloft (Russian Airlines) has these flights to NATO countries scheduled in February. UK has already banned them from British airspace – we should do the same, and seize the aircraft. https://t.co/V1J2rosG08","date":"Fri Feb 25 21:37:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In the strange ways of the Senate, Jim Inhofe was perhaps my worst foe on climate change issues, yet a key ally on my oceans and infrastructure measures. When he’s decided to push for something, he’s had an astounding ability to get it done. I wish him well in his retirement.","date":"Fri Feb 25 20:32:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s important to push back the secrecy that lets foreign thugs and criminals shelter looted property behind our rule of law. It’s a national security issue.\nhttps://t.co/DeIrDuWhBZ","date":"Fri Feb 25 18:34:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The industry and those who take its money to facilitate lies and fraud need to be held accountable.  Let’s hope this is a first step.","date":"Fri Feb 25 16:52:04 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s great that scientists are included who study the fossil fuel industry Web of Climate Denial, like Oreskes and Farrell. They need to be heard.   \nhttps://t.co/eDjyocDfX1","date":"Fri Feb 25 16:52:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The courts have told @FERC repeatedly to improve how it accounts for greenhouse gas pollution and other environmental harms.  I’m glad its new policy statements heed those calls. Pollution has consequences, and our communities deserve better. https://t.co/BOOS21jiwk","date":"Fri Feb 25 16:05:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Even before this nominee was named, the right-wing donors who packed the Court under President Trump sought to disparage Justice Breyer’s replacement, alleging the same dark-money scheme that they, themselves, hatched and executed.","date":"Fri Feb 25 15:04:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I urge my Republican colleagues not to give in to those false attacks, and to perform their constitutional duty faithfully.","date":"Fri Feb 25 15:04:48 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I hope my colleagues across the aisle consider Judge Jackson in good faith, as our Founders envisioned when entrusting the Senate with the responsibility to provide advice and consent.","date":"Fri Feb 25 15:04:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Judge Ketanji Brown Jackson is a thoroughly qualified nominee. She will bring to the Court a wealth of experience, a sharp legal mind, and a firm commitment to equal protection under law. I look forward to considering her nomination in the Judiciary Committee in the weeks ahead.","date":"Fri Feb 25 15:04:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We need an aggressive op center coordinating DOD, Treasury, DOJ, DNI and State to effect rapid, real-time seizure of assets belonging to Putin, his oligarch cronies, and the big Russian corporations they corrupted — all consistent with sanctions and international law.","date":"Fri Feb 25 02:43:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Jewish bomber pilots were not popular with Nazis. My boss and mentor Governor Bruce Sundlun got out of Nazi-occupied Belgium and through France to safety in Switzerland, a five-month journey, thanks to help from people like Mme. Hanotte. https://t.co/IDd7KfFizJ","date":"Fri Feb 25 00:52:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One we let get away.  \nhttps://t.co/loy4cMxnw2","date":"Thu Feb 24 23:52:57 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Come on, guys. Let’s see some action. We’re all behind you on this.","date":"Thu Feb 24 22:14:09 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Ukraine comment from within Russia:  “Navalny, Russia’s imprisoned opposition leader, has condemned the attack as Putin’s attempt to divert the Russian people from festering misgovernance and kleptocracy.”","date":"Thu Feb 24 20:23:11 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Another great Applebaum piece; glad she joined our Codel McCain. \nhttps://t.co/jfcdO5WRYZ","date":"Thu Feb 24 19:13:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The blood money &amp; stolen assets of Putin’s oligarchs must be seized, and the oligarchs shut out of Western society. \n\nAmerica and our allies have to use every economic tool available to isolate this rogue regime and defend Ukrainian democracy.","date":"Thu Feb 24 17:23:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"My heart stands with the people of Ukraine, who face unprovoked violence and bloodshed at the hands of a brutal, corrupt regime. Putin and his cronies must pay dearly for this.","date":"Thu Feb 24 13:29:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Free democracies are in a clash against kleptocracy and international crime. To win, we need to stop kleptocrats and criminals from exploiting our rule of law.","date":"Thu Feb 24 01:20:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hard to say I’m surprised. When a party prioritizes corporations and the ultra-rich, it’s probably open to jacking taxes for millions of Americans.","date":"Wed Feb 23 23:27:32 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Facebook @META is enabling climate denial by failing to label a huge amount of disinformation, most of which comes from a handful of publishers. @CCDHate research exposed this glaring oversight. Here, at least, the truth won out.\nhttps://t.co/HtbmVkGCNp","date":"Wed Feb 23 21:45:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More of McConnell seeking to lower the temp around his donor-captured Court.\nhttps://t.co/KTwBCrhT18","date":"Wed Feb 23 19:56:17 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts!\nhttps://t.co/in1akbxQPv","date":"Wed Feb 23 16:37:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kleptocrats &amp; criminals launder illicit gains through anonymous real estate transactions in rule-of-law countries. @USTreasury should bolster anti-money laundering safeguards in the U.S. property market to plug the holes through which corrupt cash flows.\nhttps://t.co/n8ILBxJQ4F","date":"Wed Feb 23 13:49:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Putin has attacked a peaceful, democratic nation to expand his corrupt power. This warrantless aggression demands a swift and forceful response from the NATO alliance. It is an enormous test of our resolve – but one I expect we will pass.","date":"Wed Feb 23 01:48:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Russia’s corrupt dictator will pay an enormous price for this attack, as will his oligarchs and other enablers in Russia and throughout the globe.","date":"Wed Feb 23 01:48:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The pressure on Putin is through his oligarchs. We should pound them.","date":"Tue Feb 22 23:50:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There’s a stink of partisanship in the Supreme Court, where big conservative donors fight to influence our judiciary. It’s time to take a look at the bigger picture. \nhttps://t.co/6sfdtUGn4Q","date":"Tue Feb 22 21:56:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Marcus calls out strategic judicial activism from right-wing plants in the court, and does it well.  \nhttps://t.co/jBpA2sG2w9","date":"Tue Feb 22 20:14:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We get headlines like these when criminals are allowed to hide their loot in rule-of-law financial systems. Enough.\nhttps://t.co/PS0YGAkbDc","date":"Tue Feb 22 18:12:45 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Bellingcat is on the case again.  \nhttps://t.co/U4RjDk8rJU","date":"Tue Feb 22 15:54:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/Ke8OIsQPJn","date":"Tue Feb 22 02:43:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Wow: fossil-fuel front group…wants fossil-fuel-captured Court…to undo statutes fossil fuel industry doesn’t like. Vot surpriz!\nhttps://t.co/DbUTKyys3j","date":"Mon Feb 21 23:54:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/4rEYzLHNkO","date":"Mon Feb 21 21:53:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The American delegation I led to Munich has pledged to support the freedom and safety of the people of Ukraine. As Russian hostilities appear increasingly likely, we are determined to aid our allies with unity and resolve.","date":"Mon Feb 21 21:53:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"“Here on the 6th June 1944 Europe was liberated by the heroism of the Allied forces.” https://t.co/U2KdenQvVj","date":"Mon Feb 21 20:41:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Great call by the administration. We ignore the social cost of carbon at our own peril - this was the right move. \nhttps://t.co/oI4T1bRAx4","date":"Mon Feb 21 18:23:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We should pause fossil fuel licenses, permits and leases while this gets resolved. As courts have said, we may not be sure what the social cost of carbon emissions is, but we know it isn’t zero.\nhttps://t.co/B0KSeb3QoR","date":"Mon Feb 21 18:23:37 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Excellent piece by Anne Applebaum, who was part of our “Codel McCain” to the Munich Security Conference.   \nhttps://t.co/vVGUVqUCOA","date":"Mon Feb 21 16:42:23 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"By the way, the IMF reckons fossil fuel subsidies top $5 trillion globally every year.","date":"Mon Feb 21 13:55:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"With subsidies for polluting industries (that pay politicians to subsidize them), “humanity is financing its own extinction.”\n https://t.co/zQpMGTGUOG","date":"Mon Feb 21 13:55:41 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Drug traffickers, kleptocrats, and other bad actors pull elaborate tricks to stow their loot behind American rule of law. My bipartisan bill with @ChuckGrassley arms law enforcement with tools to tackle new methods of money laundering and counterfeiting.\nhttps://t.co/hwiwPKsBLR","date":"Mon Feb 21 00:09:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"A business deal as shady as it is unsurprising. \nhttps://t.co/Beq9K58fxh","date":"Sun Feb 20 21:09:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thinking of the victims and families whose lives were forever changed by the Station Nightclub fire. Hard to believe it’s been 19 years since that dark night.","date":"Sun Feb 20 18:36:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts — judge denies Trump effort to wriggle away from accountability for January 6 assault on the Capitol. \nhttps://t.co/jMWtLbumXB","date":"Sun Feb 20 16:28:03 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Good RI news: @USMint is releasing a $1 coin honoring our Ocean State history of shipbuilding, innovation, and craftsmanship. Nice to see Nathaniel Herreshoff’s Reliance celebrated, over a century after she won the America’s Cup. Visit Bristol’s Herreshoff Museum to learn more! https://t.co/0rAb9BgdM6","date":"Sun Feb 20 14:14:18 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"For-profit colleges that lie to their students and burry them in debt must be held accountable. I’m glad to see the Department of Education taking action – justice at last.\nhttps://t.co/x2RfQqhrwL","date":"Sun Feb 20 01:12:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Supreme Court poisoned itself with dark money, and special interests have been winning ever since. It’s a rigged game that delivers for polluters, big donors, and conservative ideologues.\nhttps://t.co/RcnmlVhjfV","date":"Sat Feb 19 23:09:12 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s not just that they don’t actually do “judicial restraint”; it’s that you can usually pick the winner by knowing big Republican donor interests.\nhttps://t.co/Q35APeAcoe","date":"Sat Feb 19 21:54:44 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"President Zelensky: “No matter what, we are going to protect our beautiful land.” https://t.co/R1n3ODbXpm","date":"Sat Feb 19 20:14:30 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Great Munich Security Conference speech by Vice President Harris as Russian invasion of Ukraine looms.  “Our strength must not be underestimated.”","date":"Sat Feb 19 17:48:38 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Joined @JohnKerry for a climate diplomacy panel today in Munich to discuss a path forward for carbon pricing. We can get this done, but corporate America has to drop the obstruction and pitch in. https://t.co/6MxebfV1HE","date":"Sat Feb 19 15:50:52 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@POTUS called in to Munich yesterday to thank the delegation for standing together in support of the transatlantic alliance – Democrats and Republicans, House and Senate.","date":"Sat Feb 19 14:28:08 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As attacks on reproductive freedom continue, the Senate teed up a vote on the Women’s Health Protection Act. \n\nWith the Supreme Court aiming torpedoes at Roe, it’s more important than ever to safeguard abortion rights.","date":"Sat Feb 19 00:25:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Honored to attend John McCain Dissertation Award Ceremony tonight. Sen. McCain helped make the Munich Security Conference what it is today, and led the U.S. Congressional Delegation to Germany for many years. His passion for diplomacy lives on.","date":"Fri Feb 18 22:36:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Recent attacks on the next Supreme Court nominee, launched by the same right-wing donor interests that captured the Court under President Trump, are an attempt to distract from their own dark-money operation. My new op-ed exposes the scheme:\nhttps://t.co/PdHSVzPwpv","date":"Fri Feb 18 19:59:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Long but well done overview of extent of fossil fuel disinformation operation, and PR firm complicity.  Political dark money is a whole separate department.   \nhttps://t.co/tIfh7pPYWk","date":"Fri Feb 18 17:43:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Kleptocrats and criminals thrive in secrecy, and America has a duty to expose them. Today in Munich, I shared the progress we’ve made in the U.S. and called for transparency across all sectors. https://t.co/6nxLrTrWpy","date":"Fri Feb 18 16:28:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The Ocean State’s seafood industry was hit hard early in the pandemic and still faces lingering challenges. This federal funding will help hardworking local fishermen keep delivering some of the world’s best seafood for Rhode Islanders to enjoy. https://t.co/5AMtLgxIWf","date":"Fri Feb 18 14:25:59 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"As Russia continues to escalate this crisis, I am leading a U.S. Congressional Delegation to Munich to stand with our allies that have helped ensure peace in Europe since WWII. I hope to find common ground on climate issues &amp; work to rein in international corruption.","date":"Fri Feb 18 02:40:20 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"When big Republican donor interests come before the Court, they win - it looks like every time. It’s currently at more than 80 to 0. \n\nWhen the evidence is bad, what do you do? You blow smoke.","date":"Fri Feb 18 00:05:10 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Being “tough on crime” doesn’t mean convicting innocent people. If we denounce those working to keep our justice system fair, criminals will walk free while the wrongly-convicted sit in prison. https://t.co/b7NxmB90CS","date":"Thu Feb 17 21:39:53 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The other thing that changed after 2008 was Republican justices’ 2010 Citizens United decision, unleashing unlimited and hidden fossil fuel money into politics, buying Republican Party, and ending climate bipartisanship. #ReckoningWillCome\nhttps://t.co/igq4rbGvV8","date":"Thu Feb 17 19:45:28 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The other side of the story is how expertly, graciously and fearlessly Ms. Morrison responded to them — sort of like a super-smart kindergarten teacher dealing with unruly boys. She never batted an eye; they never laid a glove. Great job her.\nhttps://t.co/uVBaYHCt3z","date":"Thu Feb 17 17:49:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Wonderful remembrances of a lovely man. And a great American lawyer. RIP, Walter.\nhttps://t.co/shAGsOR0z0","date":"Thu Feb 17 16:21:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"One more foot of sea level rise coming, and it accelerates after that. Check out StormTools to see what it does to our RI map.   \nhttps://t.co/7hXyznosNK","date":"Thu Feb 17 14:25:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"https://t.co/bp7nHGOP14","date":"Thu Feb 17 14:25:27 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Dark money spending has rigged our politics for big secretive donors, and the American people are sick of it. Voters, not special interests, should be the loudest voices in the room.","date":"Thu Feb 17 00:56:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"An investment in quality child care is an investment in America’s future. Let’s get that done and give working families a boost.","date":"Wed Feb 16 22:25:36 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The results of the supernarrow straw they’ve all been drawn through have been terrible for the Court.","date":"Wed Feb 16 20:18:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This one’s already underway, and we’ll get the best nominee for the job, but for next vacancy, he’s right. When O’Connor left, it was first Supreme Court in history with no election experience.\n https://t.co/JsOHcWQtK5","date":"Wed Feb 16 20:18:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"While people around the world battle demand surges and supply-chain issues, multinational corporations are jacking up prices, boosting CEO pay, and making life hard for consumers. That’s just wrong.","date":"Wed Feb 16 18:15:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This is really about Raskin, and it’s driven by fossil fuel polluters, for whom too many colleagues are mere minions.\nhttps://t.co/oSwuB41I1D","date":"Wed Feb 16 16:06:06 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":".@RIAudubon has tips on how to view this beautiful visitor without causing undue stress or harm. See: https://t.co/aOxlbhcAnS","date":"Wed Feb 16 14:19:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Way better picture of the Sachuest snowy owl in RI Monthly by Wolf Matthewson (there are actually two there now): https://t.co/c0YiKHI7kG","date":"Wed Feb 16 14:19:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Snowy owl (on post) on snowy day. https://t.co/pVYZ95gzfx","date":"Wed Feb 16 14:19:43 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Fossil fuel fingers creep in everywhere. \nhttps://t.co/BE19HPAQGP","date":"Wed Feb 16 01:19:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s not in the Constitution, by the way. Corporate political power was slowly and steadily invented and grown by Republicans on the Supreme Court.","date":"Tue Feb 15 23:05:14 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Open question why corporate forces should have controlling clout in Congress; so long as they do, they should have some modicum of public responsibility; climate effort proves that they don’t. We should reconsider letting them have that clout when it’s used for evil.","date":"Tue Feb 15 23:05:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"This overlooks another fact: corporate politics/lobbying remains net OPPOSED to climate legislation. No safe pathway on climate without a serious bill; no net corporate support (near-zero individual corporate support) for serious bill; do the math.\nhttps://t.co/F6Ta8m7rON","date":"Tue Feb 15 23:05:13 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thank goodness for courts.\n https://t.co/pF7hlIlR01","date":"Tue Feb 15 21:20:02 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I’m pushing Treasury to swiftly &amp; decisively end kleptocrats and criminals’ access to rule-of-law financial systems. Strong anti-money laundering measures protect our national security. \nhttps://t.co/BaNnpmeRau","date":"Tue Feb 15 18:47:16 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corrupt leaders who rob their own people shouldn’t be able to protect their loot using our laws and financial system. I’m fighting for more transparency and stronger penalties to make sure they can’t.","date":"Tue Feb 15 16:21:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Driest since Charlemagne. Yet fossil fuel still obstructs, as do some politicians from the area (not the era).    \nhttps://t.co/JMR8f02zgz","date":"Tue Feb 15 14:25:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Out-of-state dark money organizations have spent the last year pushing voter suppression laws through state legislatures. \n\nVoters deserve to see the players behind this campaign, and my DISCLOSE Act would pull back the curtain.","date":"Tue Feb 15 01:06:21 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Amicus briefs have become a Trojan Horse for special interests seeking to influence the Supreme Court, and big Republican donors keep on winning. My AMICUS Act would close this loophole and enforce real financial disclosures.\nhttps://t.co/nO5F3J8S2c","date":"Mon Feb 14 22:52:26 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Corporations that advertise sustainability should make sure their plans measure up. Too many belong to trade associations ignoring or fighting climate legislation. It’s time to commit.","date":"Mon Feb 14 21:08:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"But worst of all is that those companies spend zero political capital on climate effort in Congress: fossil fuel is up to its usual misdeeds; the rest of corporate America is still below net-zero on effort.","date":"Mon Feb 14 16:21:47 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Lots of carbon offsets are bogus. There’s not enough integrity.  https://t.co/wW1C9pMz2t","date":"Mon Feb 14 16:21:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Thanks to $22 million over five years from the bipartisan infrastructure law, it’s about to get a lot more convenient to drive an electric car around Rhode Island.","date":"Mon Feb 14 14:09:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I can bear sad witness to our “listless Democratic party” in face of “power grabs...to enshrine corporate prerogative as a first-order principle of constitutional rule.”\nhttps://t.co/B1vltI56pL","date":"Sun Feb 13 23:34:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We must protect our democracy by restoring our Supreme Court to the impartial arbiter of constitutional outcomes it once was before right-wing capture.","date":"Sun Feb 13 23:34:50 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"We’ll all be thrilled to have you back, Ben Ray!","date":"Sun Feb 13 19:43:29 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Hunting for hand-blown glass orbs has become a tradition on Block Island – it’s a great excuse to enjoy its beautiful coastal trail network. Here’s an interesting piece about the Rhode Islanders who make it all happen.  \nhttps://t.co/oYivRJHzpT","date":"Sun Feb 13 17:41:46 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Breton Point sunrise. https://t.co/HgK7Zl8gKa","date":"Sun Feb 13 14:55:07 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"I look forward to a prompt &amp; respectful confirmation process for President Biden’s Supreme Court pick. The dark money organizations that captured the Court will attempt to disrupt the confirmation, but we’re prepared to push back very hard against that false pressure.","date":"Sun Feb 13 00:26:15 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Less happy news: a friend is waiting for a medical procedure because hospitals are clogged with people who didn’t get vaccinated. Please get vaccinated and spare our hospitals.","date":"Sat Feb 12 22:05:35 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The “truth telltale” of when you can start trusting Big Oil is when they come clean on their secret funding through the last decade of climate obstruction. Confession is good for the soul.  \nhttps://t.co/WTIjCIZj1b","date":"Sat Feb 12 19:40:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"In U.S. it’s 68-16 for fossil fuel accountability. But fossil fuel dark money assures the public isn’t heard. https://t.co/jH88pn8QVn","date":"Sat Feb 12 17:07:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"More than 150 yrs before the Armed Forces were integrated, the 1st Rhode Island Regiment fought valiantly for the nation's independence. Finally, our bipartisan legislation recognizes the Black &amp; Indigenous men who enlisted with a Congressional Gold Medal. https://t.co/4kXXYSE0fN","date":"Sat Feb 12 14:18:00 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"It’s time to call out the fossil fuel industry’s dark money mischief. People don’t like being lied to, especially not by big, corrupt, polluting interests.\n \nThey’ve been lied to for decades, and they need to know that.","date":"Sat Feb 12 00:56:49 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Trump Federalist Society (fossil-fuel approved) judge disapproves social cost of carbon. You cannot make this up. The rot runs deep.  \nhttps://t.co/6P8YiLCMFH","date":"Fri Feb 11 22:44:01 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Seniorest and juniorest Judiciary members in Roosevelt Room for SCOTUS meeting with Biden. \n@SenatorLeahy @ossoff https://t.co/vGISnvqJmQ","date":"Fri Feb 11 20:38:19 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Each year, finches come, to nest in our shutters. Today there were six pairs in the trees nearby where they socialize. Happy harbingers of spring!","date":"Fri Feb 11 18:02:40 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Central banks around the world, including Fed, warn of “carbon bubble” global crash. Freddie Mac warns of national economic crash from coastal property values crash.\nhttps://t.co/rlwn8eyrtC","date":"Fri Feb 11 16:16:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"The SEC should require strong climate risk disclosures, including “crash protection” against these mega-risks.","date":"Fri Feb 11 16:16:54 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"There’s evidence that private student loan companies lied to borrowers by telling them their loans couldn’t be discharged in bankruptcy. Now, my colleagues and I are urging @CFPB to investigate.","date":"Fri Feb 11 14:27:34 +0000 2022","user_id":"242555999"},{"handle":"SenWhitehouse","text":"Had a great meeting with @POTUS and my Judiciary Committee colleagues tonight about SCOTUS. We were all excited by the candidates we’ve heard about. Here’s my readout. https://t.co/PMzQGx2s1L","date":"Fri Feb 11 02:18:57 +0000 2022","user_id":"242555999"}]