[{"handle":"SteveDaines","text":"Grateful for the opportunity to speak at the MT @VFWHQ in Billings this afternoon. \n\nOur Montana heroes have brought so much honor to our state and nation. https://t.co/YMoyN6FdLv","date":"Thu Jun 16 23:41:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is still open for business! The Treasure State has many beautiful destinations, and our small businesses are ready to welcome folks with open arms.\n\nCome see what Montana communities — big and small — have to offer.","date":"Thu Jun 16 21:43:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m glad to see @JoeBiden approve my request with @SenatorTester &amp; @RepRosendale to grant Montana a major disaster declaration. \n\nThe damage from this week’s floods is catastrophic and this support will help Montana communities rebuild and recover.","date":"Thu Jun 16 21:43:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Met with @FEMA_Deanne, MT Lt. Governor Juras, local law enforcement, the @GuardMontana and community members in Red Lodge today to survey the damage from the terrible flooding in Montana this week.\n\nMontanans are strong—we will get through this. https://t.co/groJgjSl5z","date":"Thu Jun 16 21:43:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today the U.S. Senate passed the \"Honoring Our PACT Act\" to ensure that Montana veterans who have suffered from toxic exposure while bravely defending our country receive the care and support they need. \n\nI look forward to seeing this important bill signed into law. https://t.co/lLeMO9aWP6","date":"Thu Jun 16 18:20:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is facing catastrophic flooding, and our communities need help.\n\n@JoeBiden — @SenatorTester, @RepRosendale and I are urging you to approve Montana's request for a major disaster declaration immediately.","date":"Wed Jun 15 22:32:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Lights on but nobody’s home. \n https://t.co/kKA8OjWb6i","date":"Wed Jun 15 21:21:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Pro-family. Pro-marriage. Pro-life. Fully paid for.","date":"Wed Jun 15 17:01:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent the morning with some top-notch Montana students from schools across Missoula. https://t.co/2KrbnQMZ4x","date":"Wed Jun 15 16:38:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, Senate Democrats blocked my bill with @RogerMarshallMD to end the gas price hikes bankrupting MTns.\n\nThey’re saying the quiet part out loud: they don’t care about high gas prices so long as they’re able to push their radical climate agenda. https://t.co/UohvDSX7fs","date":"Tue Jun 14 23:54:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Productive meeting with @ConcernedVets this afternoon discussing how to best serve Montana veterans! https://t.co/gW9todJBB8","date":"Tue Jun 14 19:45:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy 247th Birthday to the @USArmy! Thank you to the brave soldiers who keep Montana and our nation safe. #ArmyStrong 🇺🇸","date":"Tue Jun 14 14:45:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"For nearly 250 years the American flag has served as a symbol of freedom &amp; a beacon of hope.\n\nIt's waved boldly atop the Moon, it hangs proudly from  front porches and it has followed our brave men &amp; women into battle.\n\nToday we remember all that our flag stands for. #FlagDay https://t.co/bb6mXtIEVH","date":"Tue Jun 14 14:02:44 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The @USPS provides critical services to Montanans across our state, especially veterans, seniors and folks in rural areas. \n\nI’m pushing for a speedy review of the bid to continue service in Coram, MT so that folks can continue to stay connected. https://t.co/5y3H8RRXrd","date":"Mon Jun 13 22:31:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m closely monitoring the severe flooding in south central Montana. \n\nI encourage all Montana families to remain vigilant at this time and to not walk or drive through flooded areas.","date":"Mon Jun 13 18:01:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week’s Montana “On The Rise” Economic Summit in Bozeman was a spectacular success. Thank you to everyone who joined us. https://t.co/52KgHanUPi","date":"Sat Jun 11 20:26:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Just filled up my pickup in Montana.   ⁦@POTUS⁩ - please explain why you cancelled the Keystone Pipeline, and stopped new leases for American energy production? https://t.co/6m1pvMRo0w","date":"Sat Jun 11 03:49:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While @JoeBiden is busy blaming others for his actions that have resulted in an energy crisis, he’s still caving to the woke Left greenies &amp; pushing their radical Green New Deal ideologies.\n\nWe need an all-of-the-above energy strategy—that includes renewables AND oil, gas &amp; coal.","date":"Sat Jun 11 01:15:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden—no matter how much you try to blame energy companies for record high prices at the pump, the energy crisis is on you.\n\nYou killed the KXL pipeline, cancelled oil &amp; gas leases &amp; and have done all you can to hinder American energy production.","date":"Sat Jun 11 01:15:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hey @CoryBooker, if you change your mind, let me know!","date":"Fri Jun 10 19:10:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Mark your calendar because Sunday is National Jerky Day!\n\nGot a chance to spread the word in the U.S. Senate that Montana is home to the best beef jerky around. https://t.co/5qMKcGdHW3","date":"Fri Jun 10 17:45:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to @RyanZinke on his victory in the GOP primary for Montana’s Western U.S. House District. Can’t wait to see you back in Congress, working for Montanans!","date":"Fri Jun 10 14:22:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation hit a brand new 40-year high today at 8.6%. \n\nMontanans can’t afford the cost of Biden’s irresponsible policies and reckless spending. Something must change.","date":"Fri Jun 10 14:20:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana FFA-ers are the future leaders of our state &amp; country. \n\nNice spending time with Savannah, Sydney and Trevor from Stevensville FFA today. https://t.co/N05hCMpczR","date":"Thu Jun 09 21:00:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hunters &amp; anglers are the original conservationists.\n\nAny move to ban lead ammo and tackle is a slap in the face to all the sportsmen who care about the environment — but of course @JoeBiden would rather cave to the green radicals than follow the science. https://t.co/SbPIN1Eh7b","date":"Thu Jun 09 20:04:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a full office today with students from Butte High School. These students represented their hometown well — Butte, America! https://t.co/Wke0KJPRjJ","date":"Thu Jun 09 18:29:42 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana kids deserve better than story time with a drag show. \n\nLet’s let kids be kids, not tools of this destructive woke ideology.  https://t.co/CvBRtRCZHs","date":"Thu Jun 09 16:44:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Tony Incashola Sr. was a father, a veteran, and a tribal leader who fought tirelessly to preserve the Salish and Pend d’Oreille language and culture. \n\nMy prayers are with the Incashola family and the Confederated Salish and Kootenai Tribes. https://t.co/rg7P6aFb36","date":"Thu Jun 09 00:45:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great meeting with MT farmers &amp; ranchers with the @MTFarmBureau today. We discussed important issues facing MT ag like the upcoming Farm Bill and the need for forest management reform. https://t.co/m3Cq1zcF07","date":"Wed Jun 08 22:55:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"For @JoeBiden and the Democrats, green is the new red, white and blue. \n\nThey need to wake up, stop appeasing the woke green radicals and unleash American energy.","date":"Wed Jun 08 21:17:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT law enforcement seized more fentanyl in the first 3 months of 2022 than in the past 4 years COMBINED.\n\nMT is a northern border state with a southern border crisis. We must secure our southern border &amp; stop the flow of illegal drugs into our state. https://t.co/ZFLrlgakCZ","date":"Wed Jun 08 20:07:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats are living in a fairytale — the high prices Montana families are paying today is the result of reckless spending &amp; policies from the Left. https://t.co/Oz6kfgbIVW","date":"Wed Jun 08 16:36:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Meanwhile, House Democrats have spent the last month sitting on the Senate’s unanimously passed bill to boost security for Justices and their families. \n\nUnacceptable.  https://t.co/PpzDXXiMv5","date":"Wed Jun 08 14:50:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to @RepRosendale on winning the GOP nomination for Montana’s Eastern U.S. House District! I look forward to continuing to work with you on behalf of Montanans.","date":"Wed Jun 08 02:54:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"@bradmwarren Happy birthday, @bradmwarren!","date":"Tue Jun 07 21:45:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Delusional. \n https://t.co/Xowb5T8qRL","date":"Tue Jun 07 21:16:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Washington, D.C. has a lot to learn from these Grass Range School students! https://t.co/PRvWDDtsIu","date":"Tue Jun 07 21:11:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The answer is NOT and should NEVER be asking Montanans to spend tens of thousands of dollars on an electric car because @JoeBiden &amp; the Democrats manufactured an energy crisis.","date":"Tue Jun 07 19:17:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Cindy and I are extending our heartfelt prayers to the family and loved ones of Navy pilot Lt. Richard Bullock of Montana who tragically died in a plane crash last Friday. We are so grateful for his service. https://t.co/tIC01jW9XH","date":"Mon Jun 06 21:55:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s gas price hike is not exclusive to gas — more expensive fuel leads to higher prices for all kinds of goods &amp; services Montana families need.","date":"Mon Jun 06 20:36:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"My bipartisan SAFE Banking Act is about increasing public safety. \n\nWe need to pass it. https://t.co/IBlsH85Frw","date":"Mon Jun 06 18:52:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"78 years ago today, brave Americans stormed the beaches of Normandy. May we never forget their selflessness, valor, and sacrifice.","date":"Mon Jun 06 14:27:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Gas prices have officially DOUBLED since @JoeBiden took office. This is unacceptable. \n\nAnd no, the answer is NOT to force Montanans to buy an electric vehicle—it’s to unleash American energy. https://t.co/czEKxCXzjq","date":"Sat Jun 04 17:26:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"There's no such thing as “cancelling” debt. Biden’s plan just makes hardworking MT taxpayers foot the bill for others' student loans. \n\nAmid skyrocketing inflation, record high gas prices and crippling food shortages, hasn’t Biden’s incendiary spending cost Montanans enough?","date":"Fri Jun 03 19:59:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"That’s a wrap, folks. The Montana “On the Rise” Economic Summit was a great success. \n\nAppreciate all the guests and speakers who joined today and the two Deputies and Cuddles from the Gallatin County Sheriff’s Department. https://t.co/VzaR5GqHAy","date":"Thu Jun 02 23:07:47 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Funds flow to the path of least resistance. The dollar doesn’t vote — it just knows where to go. It’s coming here, to Montana, because of the good leadership in both the Senator and Governor and the lifestyle that’s amazing here. It’s a good place.” — @kevinolearytv https://t.co/cVRreokyJp","date":"Thu Jun 02 22:52:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“It’s not a political thing — some things are just common sense. Montana’s been an amazing place to grow a business.” — Tim Sheehy with @BridgerAerospa1","date":"Thu Jun 02 22:33:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Another big jobs announcement out of the Economic Summit today. \n\n@aurora_inno is expanding their operations in Bozeman &amp; creating new jobs for hardworking Montanans.\n\nMT continues to be a hot bed for visionary innovation &amp; next generation technology.","date":"Thu Jun 02 21:42:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"BIG NEWS out of the Economic Summit.\n\nI joined @kevinolearytv, @GovGianforte, @bitzerodotcom CEO Shamji &amp; CSKT Secretary Charlo to announce a new data center in MT w/ clean hydropower produced by the CSKT.\n\nLooking forward to the new opportunities this will bring to MT. https://t.co/f2blBmlfl0","date":"Thu Jun 02 21:07:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Most business owners I know are not looking for the government to solve their problems. They want the government to stay out of the way. We’re going to stay out of the way.” — @GovGianforte","date":"Thu Jun 02 20:19:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Semiconductors are part of every sector of the economy. It’s critical that the U.S. leads the world in semiconductor manufacturing &amp; design. \n\nGreat chat today with Cristiano Amon, President and CEO of @Qualcomm, talking about the importance of MT leading in this sector. https://t.co/wpg7lNRUiL","date":"Thu Jun 02 20:10:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Montana figured out something long ago that we’re figuring out today — work life balance. It doesn’t mean you’re working less hard, it doesn’t mean that you’re less productive. It actually just means you’re more productive with your own time.” William Tanona with SoFi","date":"Thu Jun 02 17:20:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“One message that came out of my conversations in Montana was that the local business community wanted to see a future for their kids. And so they made a tremendous difference for us — it’s the kind of business community we wanted to be part of.” — Bill Moseley with GL Solutions","date":"Thu Jun 02 17:18:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Through made ready technologies, we can shave off the time it takes to connect households by months or years. Bottom line is, we’re trying to get to 100% connectivity in rural areas.” — Manish Jindal with Charter Communications","date":"Thu Jun 02 16:15:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“In the event of a pandemic or bio attack, we can’t rely on other countries. That’s why we’ve made a very significant investment in Montana. We should be able to make new vaccines within 100 days of training a new sequence.” — Seth Lederman, Tonix","date":"Thu Jun 02 15:44:37 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@VoicesofMT is going LIVE from the Economic Summit. https://t.co/tkNtvaESwF","date":"Thu Jun 02 15:10:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Montana, as Senator Daines and Governor Gianforte said, is very business friendly. Montana is a net energy exporter for the rest of the nation.” — Bruce Fleming, Calumet Refinery out of Great Falls","date":"Thu Jun 02 15:07:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Montana “On The Rise” Economic Summit kicks off today. \n\nStay tuned for updates from our exciting speakers and guests. https://t.co/vhZNPfeZhW","date":"Thu Jun 02 14:25:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats want to make the American taxpayers foot the bill for their radical abortion agenda. \n\nNot on our watch. https://t.co/U3OwAv0my9","date":"Wed Jun 01 22:12:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today marks the beginning of Great Outdoors Month! I got to celebrate a little early with the opening of a new road in Yellowstone last week which will help increase access to public lands. \n\nMake sure to get outdoors this month! https://t.co/ZJb4ip1DYu","date":"Wed Jun 01 19:48:52 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Let’s set the record straight — our energy crisis is a man made dilemma…by @JoeBiden &amp; the Democrats.","date":"Tue May 31 23:41:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana’s new Gold Star Family Memorial Monument. https://t.co/YGl3VHD4KE","date":"Mon May 30 20:10:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Through the work of the Hershel “Woody” Williams Foundation, Montana now holds its first Gold Star Family Memorial Monument. https://t.co/yGSar67aL3","date":"Mon May 30 19:55:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"During today’s ceremony, I presented a tribute in the Congressional Record in honor of World War II veteran and Medal of Honor recipient Hershel “Woody” Williams. https://t.co/Gzb4Vt0r3D","date":"Mon May 30 19:55:52 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Honored to join so many Montana veterans and Gold Star families in Bozeman today for the Memorial Day parade &amp; ceremony. https://t.co/2cEUG3Enyp","date":"Mon May 30 19:37:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, we pause to reflect on the brave men and women who have made the ultimate sacrifice to protect our freedoms and nation. We must always remember, freedom is not free. #MemorialDay2022","date":"Mon May 30 14:19:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden, prices have skyrocketed since last Memorial Day weekend. This year looks a little different:\n\n🥓 up 17.7%\n🐓 up 16.4%\n🌭 up 6.9%\n🐄 up 14.8%\n\nAnd if you’re planning on driving, gas is up 43.6%.","date":"Sun May 29 15:55:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Yellowstone Park Superintendent Cam Sholly has invested in employee housing which has helped raise employee morale. \n\nWe need to build upon this good work and pass my bipartisan bill with @SenAngusKing  to support gateway communities. https://t.co/4rLdUlH2qz","date":"Fri May 27 20:41:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to join folks today to celebrate @YellowstoneNPS’ 150th birthday &amp; for the unveiling of the Tower-Roosevelt to Chittenden Road which will help expand public access to public lands. \n\nOur parks help set us apart from the rest of the world, and Yellowstone was the very first! https://t.co/CzBM5wB3PL","date":"Fri May 27 20:05:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m a proud Beer Champion! Thank you, @beerinstitute, for honoring me with this award — and thank you to Montana farmers for growing enough barley to make 17 BILLION bottles of beer each year.\n\nNo barley, no beer! https://t.co/ARKIbUKeUv","date":"Fri May 27 01:16:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As a fifth generation Montanan and avid sportsman, I’m glad to see the Senate pass my bipartisan resolution with @SenGaryPeters to designate June as Great Outdoors Month.\n\nI encourage folks to get outside and experience everything our national parks &amp; public lands have to offer!","date":"Thu May 26 21:02:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans are feeling the sting of Biden and the Democrats’ wasteful policies. We must rein in reckless spending &amp; unleash American energy for the sake of Montana families.","date":"Thu May 26 13:39:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hear from the Mayors of Plains and Kalispell about how @JoeBiden’s inflation crisis is hurting Montana communities. \n \nAs Kalispell Mayor Mark Johnson says: \"without a strong economy, we don’t have a strong America.\" I agree. https://t.co/vWBbtN7nu0","date":"Thu May 26 13:39:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Good time chatting with @saylor yesterday at the 2022 DC Blockchain Summit. https://t.co/lkn2oxG9lG","date":"Wed May 25 23:41:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Too many Montanans struggle with the terrible health implications of brain tumors.\n\nI’m glad the Senate passed my bipartisan resolution with @SenMarkey designating May as Brain Tumor Awareness Month. We must continue to raise awareness about brain tumors, research and treatment.","date":"Wed May 25 20:21:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to be with the folks of @GDSFoundation last night to accept the Quincy Jones Exceptional Advocacy Award.\n\nEvery life is created with God-given dignity and potential. I’ll keep fighting to protect &amp; improve the lives of Americans, no matter how many chromosomes they have. https://t.co/XcgHVBFtuI","date":"Wed May 25 13:03:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today’s shooting in Texas was horrible and evil. Cindy and I are praying for the families and loved ones of the victims of this terrible act of violence.","date":"Tue May 24 23:02:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Just how BAD is the Biden border crisis?\n\nPresident Biden’s administration is already deporting 80% fewer illegal immigrants than President Obama. Now, he wants to end Title 42 and give illegal immigrants a rubber stamp upon entry. \n\nUnacceptable.","date":"Tue May 24 15:33:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The early draft letter from the NSBA suggested using the military to silence parents for standing up for their children. Unbelievable. https://t.co/CYJZaIcIAa","date":"Mon May 23 22:38:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans have suffered through two straight weeks of record high gas prices.\n\nI don’t think “incredible” is the first word they’d use to describe the experience.","date":"Mon May 23 19:19:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"If there’s one thing the past few months have shown us, it’s that energy security is national security. \n\nThe Denbury pipeline in Baker will help support &amp; expand Made in Montana &amp; Made in America energy.\n\nWe need more pipelines! https://t.co/Gf4lLtIfg7","date":"Sun May 22 20:31:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On this #ArmedForcesDay, I want to thank the brave men &amp; women in uniform who selflessly serve our nation. It’s because of Montana service members that we can live in this beautiful state in our great nation, peacefully.","date":"Sat May 21 17:30:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Can’t think of a better way to spend a Saturday morning than with folks in Miles City. \n\nIt’s world famous for a reason—great to be at the Bucking Horse Sale Parade today! https://t.co/yf6yAASmA8","date":"Sat May 21 16:49:48 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Yeah, it’s called the men’s team.","date":"Sat May 21 02:43:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As Montanans are facing record high gas prices, Biden &amp; the Democrats want to chokehold American energy production. Instead, we should be empowering refineries like CHS to produce energy right here in MT.\n\nEnergy security is national security. Time to unleash American energy! https://t.co/aXDen3tCyE","date":"Fri May 20 23:13:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While I’m glad to see a Trump-appointed judge block Biden’s senseless decision, the President needs to wake up, face reality and secure our southern border for the safety of MT communities.\n\nhttps://t.co/WiZ4ThO4uH","date":"Fri May 20 22:03:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s outrageous that @JoeBiden even considered rescinding Title 42 in the midst of a historic crisis at our southern border that’s left our country wide open to an influx of illegal drugs &amp; illegal immigrants.","date":"Fri May 20 22:03:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This morning I had the honor of presenting Major Daniela Ragen with an official tribute in the Congressional Record. \n\nMajor Ragen served in the Army National Guard and as state coordinator for the Montana National Guard Counterdrug Program. She makes Montana proud! https://t.co/ZaBmlURzrl","date":"Fri May 20 21:30:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"For 100 years, the Fort Harrison VA hospital has provided care for Montana veterans who selflessly served our great nation in every war and humanitarian mission since World War I.\n\nGlad to be with Montana heroes today to celebrate this historic milestone. https://t.co/ppQgfPOIbU","date":"Fri May 20 18:36:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden handing over the US’ sovereignty to the @WHO—which has spent the past two years acting as an arm of the Chinese Communist Party—is unimaginable. \n\nThis is a direct threat to Americans’ rights, &amp; I’m glad to work with @SenTomCotton to stop it. \nhttps://t.co/OuWIf3B5bT","date":"Fri May 20 18:07:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The very point of the First Amendment is to ensure your government will never tell you what you can and can’t say — this Orwellian “Ministry of Truth” does just that.\n\nWe must NEVER allow Biden or anyone else to censor speech on the taxpayers’ dime. https://t.co/HZIOqYiYoH","date":"Thu May 19 20:32:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Over a week of record high prices at the pump, and Montanans are paying the price. \n\nAre we lights on, no one home at the White House? \n\nUnleash American energy!","date":"Thu May 19 19:16:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Sat down with Ambassador Brink this morning to discuss her plans to restore U.S. diplomatic presence in Ukraine and support their efforts to help defeat Russia's brutal invasion.\n\nShe is an excellent pick to lead the U.S. Embassy in Kyiv. https://t.co/7z6aNMWjHg","date":"Thu May 19 18:14:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to Ambassador Brink for her confirmation as U.S. Ambassador to Ukraine. Her experience and leadership will be an asset for the United States as we continue to stand with Ukraine against Russia.","date":"Thu May 19 02:42:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"From selective censorship of conservative viewpoints to policies that prop up the far-left’s agenda, Big Tech giants have become the newest arm of the Democrat Party.\n https://t.co/dAe0EvookW","date":"Wed May 18 23:52:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"After returning from Ukraine, I called on the Biden admin to reopen the Embassy in Kyiv &amp; restore our diplomatic presence in the country.\n\nToday, it finally happened. We must continue to show Ukraine that America stands with them in their fight for freedom.https://t.co/o0qEM1yxEF","date":"Wed May 18 21:06:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Insanity.","date":"Wed May 18 19:48:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Just got off the phone with Jesse Laslovich and thanked him for his willingness to serve. \n\nCongratulations to Montana’s new US Attorney.","date":"Wed May 18 00:51:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"April saw the highest number of migrants ever recorded.\n\nNext week, @JoeBiden will reverse another commonsense border policy that will only make this crisis worse. \n\nBiden needs to wake up and face reality. https://t.co/w1jwniy4fs","date":"Tue May 17 20:21:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I introduced the bipartisan “Putting First Responders First Act” so that first responders like Ladd won't have to pay taxes on injury-related compensation when hurt in the line of duty.\n\nIn honor of #NationalPoliceWeek, I'm calling on the Senate to pass this commonsense bill now!","date":"Tue May 17 18:40:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Was a privilege to meet with Ambassador Brink while visiting Slovakia earlier this month.  \n\nFirst serving under Trump &amp; now Biden as @USEmbassySK, she’s an effective diplomat &amp; an excellent choice to lead the U.S. Embassy in Ukraine. https://t.co/YcsC4UvVuB","date":"Mon Apr 25 15:50:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today I sat down with Heidi and Ladd Paulson from Billings. In 2002, Ladd was hit by a car while on duty as a MT police officer.\n\nNow, the Paulsons advocate on behalf of all of our Montana heroes that serve and protect our communities. https://t.co/axxQGJS5ar","date":"Tue May 17 18:40:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The @WHO spent the last two years acting as an arm of the Chinese Communist Party to help cover up information on COVID-19. \n\nUnder no circumstances should @JoeBiden allow it to have control over the lives of Americans.","date":"Tue May 17 15:43:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT is a northern border state with a southern border problem, &amp; our communities are directly impacted by @JoeBiden’s incompetent handling of the crisis at our southern border &amp; rising crime.\n\nBiden must be held accountable. Glad to work with @SenBillCassidy to make certain he is.","date":"Mon May 16 21:39:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to Colombia for joining the Geneva Consensus Declaration and standing up for the universal principles of life, family &amp; sovereignty.\n\nWith 37 member countries, this coalition shows an unwavering commitment to the Declaration's core values.","date":"Mon May 16 19:04:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Make filling up your gas tank affordable again. #UnleashAmericanEnergy","date":"Mon May 16 15:48:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Energy security is national security, and refineries like Calumet in Great Falls are helping drive Made in Montana energy production. https://t.co/qg4DnbuN5W","date":"Sun May 15 17:30:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans are left paying the price for @JoeBiden’s anti-American energy agenda. Unacceptable. \nhttps://t.co/Q2V5RbBXlz","date":"Sat May 14 17:16:47 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The baby formula shortage is a strain on families across the country, especially Montana. \n\nWe must prioritize the needs of moms and babies—I’m working to find much needed solutions. \nhttps://t.co/crkoeglg2I","date":"Fri May 13 21:09:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Can’t wait to see what the future holds for these Montana students! https://t.co/PBXkgYWQJI","date":"Fri May 13 19:04:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s easier to get a crack pipe than baby formula in @JoeBiden’s America.","date":"Fri May 13 01:28:10 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We should be preventing drug use, not enabling it—especially on the taxpayers dime. Craziness.","date":"Fri May 13 01:16:10 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a full office today with students from Heritage Christian School! It’s great to see young Montanans strong in their faith and eager to learn about Congress. https://t.co/88Oqm8Aibb","date":"Thu May 12 20:09:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats will blame anyone for inflation except themselves — including the innocent unborn.\n\nThe “solution” to the economic crisis they created is NOT abortion.","date":"Thu May 12 19:15:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is choking out American energy left &amp; right. He is not serious about American energy security or lowering costs for Montana families. When will he learn? https://t.co/jvLeWFjVef","date":"Thu May 12 14:19:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Sat down with folks from @DEPAUSA today to talk about the importance of supporting Made in Montana &amp; Made in America energy. https://t.co/ECRQYDNrLs","date":"Wed May 11 22:02:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/1Dq35gFp56","date":"Wed May 11 20:35:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden &amp; the Democrats’ watch, Montana families are struggling to make ends meet.","date":"Wed May 11 20:17:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Over a century of folks backpacking, mountain climbing, sight-seeing and enjoying Montana’s great outdoors. Happy birthday, @GlacierNPS!","date":"Wed May 11 17:29:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Liberal Twitter mob throwing a turtle tantrum are the same people who believe men can get pregnant.","date":"Wed May 11 16:46:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana law enforcement officers put their lives on the line every day to protect our families and communities. This week, and every week, we’re thankful.\n \nI’m proud to Back the Blue. #NationalPoliceWeek https://t.co/dLorNoFbZJ","date":"Wed May 11 14:45:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation remains near a 40-year high once again. \n\nWhen will @JoeBiden and the Democrats wake up and stop pushing their reckless policies &amp; wasteful spending?\n\nMontanans are suffering because of them. https://t.co/hKv3BjmBiO","date":"Wed May 11 12:52:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden today said inflation is his “top domestic priority.” \n \nIf he’s serious, then he should stop pushing his reckless policies &amp; wasteful spending.","date":"Tue May 10 21:41:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Under the Democrats' radical abortion bill, an unhatched sea turtle would have more protections than an unborn human baby.\n \nIs that the America the Left wants? https://t.co/YrUNa0czrt","date":"Tue May 10 20:56:13 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden has a choice to make: side with hunters &amp; sportsmen or keep siding with far-Left green decoy groups. \n \nIt shouldn’t be hard—hunters are conservationists and care deeply about these issues whereas radical groups just care to obstruct. https://t.co/w29w35UJfo","date":"Tue May 10 19:17:38 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Violence is never the answer. \n \nThe Left resorting to outrageous actions in an attempt to intimidate the Justices and scare the American people is despicable. https://t.co/D4UZOr3gCt","date":"Tue May 10 17:27:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In @JoeBiden's America, Montana families can't even find baby formula because of the supply chain crisis. \n\nUnacceptable.","date":"Tue May 10 13:56:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This week, the Democrats will try once again to pass their radical bill to impose abortion on demand across the entire country, even up to the moment of birth. \n\nThey want every state to be a late-term abortion state, aligned with brutal regimes like North Korea and China.","date":"Mon May 09 13:58:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy Mother’s Day to all the Montana moms that are raising the next generation. I’m very grateful for my wonderful mom Sharon and sweet wife Cindy! We are thankful for all you do! https://t.co/3a7vGN6E3r","date":"Sun May 08 15:00:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s student loan policy will grow the national debt and make the inflation crisis much worse. https://t.co/Tmddv1RXdn","date":"Sat May 07 18:34:15 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana nurses are on the frontlines keeping our families and communities healthy. Montana is thankful for all that our healthcare heroes do! #NationalNursesWeek https://t.co/ZbKFqJle44","date":"Fri May 06 17:00:58 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Honored to receive the James D. Range Conservation Award from @TheTRCP last night for my work on conservation and protecting public access to public lands. https://t.co/vCB3xQl3DQ","date":"Thu May 05 20:22:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I grew up hunting &amp; fishing with my dad, and I raised my kids the same way—you can bet I look forward to the day I can put a fishing pole in the hands of my grandkids. \n \nI know the importance of protecting the MT outdoor way of life firsthand, and I’ll continue working to do so.","date":"Thu May 05 20:22:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While I’m a proud Bozeman Hawk, it was fun spending time with some future Belgrade Panthers! https://t.co/sClCU7kD9e","date":"Thu May 05 18:47:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Mickey Mouse’s clubhouse isn’t quite like it used to be folks.\n\nDisney decided to stop producing content suitable &amp; appropriate for children &amp; instead churns out the Left’s woke gender ideology.\n\nParents deserve to know — I’m glad to join my colleagues in pursuing accountability.","date":"Thu May 05 18:01:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On National Day of Awareness for Missing and Murdered Indigenous Women &amp; Girls, we remember the lives tragically taken &amp; the communities torn apart by this crisis plaguing MT.\n\nWe must continue working on solutions to increase public safety &amp; protect our MT tribal communities.","date":"Thu May 05 14:52:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is definitely breaking records — just not the good kind. \n\nDemocrats need to wake up — their policies are bankrupting Montanans. They need to listen to what Republicans have been saying all along and unleash American energy. https://t.co/hD8bvNxWT3","date":"Wed May 04 20:43:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thoughtful questions from Sheridan High School and Carter County High School students today! https://t.co/ejmRB1KEjp","date":"Wed May 04 19:36:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Always a treat to show the U.S. Capitol to Montana students. This group from Anderson Middle School was top-notch. https://t.co/WQJ3GZcp63","date":"Wed May 04 16:16:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/obZ0M8mxqC","date":"Wed May 04 00:49:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While @JoeBiden's still gung-ho on masking toddlers &amp; forcing MT teachers &amp; workers out of a job because of his arbitrary mandates, I’m working to get MTns’ lives back to normal.\n\nGlad the Senate passed my effort w/ @SenJohnThune to end the mask &amp; vaccine mandates for Head Start.","date":"Tue May 03 22:29:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The folks from Montana’s electric co-ops sure do have a lot of energy when it comes to issues they care about.💡 https://t.co/PAAfIWuF5J","date":"Tue May 03 21:12:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed meeting these outstanding Montana students from Billings today! https://t.co/r3uvKBxLXi","date":"Tue May 03 20:11:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"To all Montana teachers who are supporting, inspiring and educating the next generation—thank you. \n\nHappy #TeacherAppreciationDay to all of Montana’s great teachers, including my daughter Annie! https://t.co/lRlseiq9ea","date":"Tue May 03 16:22:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Leaking a draft opinion by the Supreme Court is unprecedented and reprehensible. \n\nThere should be an immediate investigation into who is responsible as it is a clear attempt to intimidate the Court.","date":"Tue May 03 13:16:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As founder and chair of the Senate Pro-Life Caucus, my statement on the leaked draft opinion of the Dobbs case:","date":"Tue May 03 13:16:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"With that said, if the draft opinion stands, the Court will have righted an historic injustice and returned the power to the American people and their elected officials to enact laws to protect unborn children and mothers.","date":"Tue May 03 13:16:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is home to so many brave men &amp; women who answered the call to serve and put country above self.\n\nAs we celebrate #MilitaryAppreciationMonth, let us always remember that we are the land of the free BECAUSE of the brave. Thank you for your service.🇺🇸 https://t.co/Zc8fehzI4e","date":"Mon May 02 21:33:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is hurting Montana farmers and ranchers. https://t.co/P1pPkuZZGO","date":"Mon May 02 20:21:44 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats are out of touch with rural Montana. \n\nUsing their inflation crisis as an opportunity to advance their woke green agenda is a slap in the face to hardworking Montana farmers and ranchers.","date":"Mon May 02 19:39:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"What an achievement! Congrats to the Hamilton HS Science Olympiad team for earning the state campion title for the fourth year in a row!\n\nhttps://t.co/SRnVEcvB2m","date":"Mon May 02 16:06:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Unleash American energy.","date":"Mon May 02 15:44:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Outrageous. \n\nWe need to secure our southern border NOW, and until we do, we should send the thousands of illegal immigrants coming through @JoeBiden’s open border to the blue states that supported him. \nhttps://t.co/9bKLyFwvaG","date":"Sun May 01 22:33:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“Ministry of Truth?” \n\nThis isn’t Communist China. This is America. \n\n@JoeBiden and his cronies don’t get to choose what speech is really free. We have the First Amendment for that.","date":"Sun May 01 15:26:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Go CATS!","date":"Sat Apr 30 21:36:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Tragic loss for the Great Falls community. Cindy and I are praying for the family of  MAFB Airmen First Class Montanucci.\n\nhttps://t.co/FTsQZUdUAv","date":"Fri Apr 29 20:19:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Earlier this year, I got to visit IND Hemp in Fort Benton to see the work they’re doing at their new fiber plant. Yesterday they officially opened their doors! \n\nGreat news for Montana ag. https://t.co/xPkJgVgGHq","date":"Fri Apr 29 15:07:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today on Yom HaShoah, we reflect on a very dark time in history and remember the six million Jewish people that were murdered during the Holocaust. #NeverAgain","date":"Thu Apr 28 18:41:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Stopped building the wall. Suspended the Remain in Mexico policy. Ended Title 42. \n \nPretty clear that @JoeBiden cares more about illegal immigrants than he does Americans.","date":"Thu Apr 28 15:00:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great meeting with you all! https://t.co/z14OAs3m1R","date":"Wed Apr 27 21:19:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Ending Trump’s Title 42 policy would make @JoeBiden’s already catastrophic southern border crisis even worse. \n\nThe President knows this.\n\nHe just doesn’t care.","date":"Wed Apr 27 19:44:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Caught up with Montana students from Sidney, White Sulphur Springs, Red Lodge and West Yellowstone high schools this morning! https://t.co/9p4EoAl3Qw","date":"Wed Apr 27 18:35:48 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana small businesses that line our main streets are the heart &amp; soul of our communities. A big congratulations to two that just received some big recognitions!","date":"Tue Apr 26 23:12:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Natalie Van Dusen &amp; Deejay Newell from Treeline Coffee Roasters in Bozeman were named Montana’s Small Business Persons of the Year, and Angela Matsen of Foundation Therapy Services Inc in Bozeman received the SBA’s Montana Women-Owned Small Business of the Year award!\n \nCongrats!","date":"Tue Apr 26 23:12:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Sidney High School students are eager to learn! I look forward to seeing what their future holds. https://t.co/XZR1vrkffg","date":"Tue Apr 26 22:28:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We already know Montana ranchers produce the best beef in the world—so let’s make sure they have the support they need to do what they do best! \n \nGreat catching up with folks from the Montana Stockgrowers Association today. https://t.co/NroOQnqszm","date":"Tue Apr 26 19:39:12 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Big Tech censorship of conservative voices has been going on for far too long—it's shameless and wrong.\n\nLet’s hope @elonmusk's Twitter takeover brings a future that facilitates free speech.","date":"Tue Apr 26 18:50:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see @MTAGKnudsen investigating cattle feed scams that could be hurting Montana ranchers. \n\nAlways stay vigilant and continue reporting any suspicious behavior so that we can hold bad actors accountable.\nhttps://t.co/5dN7WqnL1s","date":"Tue Apr 26 02:16:58 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"A couple come to mind... \n \n✖️Achieving a historic southern border crisis\n✖️Diminishing American energy security &amp; killing American jobs\n✖️Wasting trillions of taxpayer dollars \n✖️Reaching the highest inflation in 40 years","date":"Mon Apr 25 22:36:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Under her watch, the world will know that America has confidence in President Zelenskyy &amp; the people of Ukraine.","date":"Mon Apr 25 15:50:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Was a privilege to meet with Ambassador Brink while visiting Slovakia earlier this month.  \n\nFirst serving under Trump &amp; now Biden as @USEmbassySK, she’s an effective diplomat &amp; an excellent choice to lead the U.S. Embassy in Ukraine. https://t.co/YcsC4UvVuB","date":"Mon Apr 25 15:50:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s about time—glad to see @JoeBiden listen to my calls to resume diplomatic operations in Ukraine. The world needs to know that the U.S. has confidence in Ukraine to prevail in their fight to end Putin’s war of aggression. https://t.co/ET0dsi4xMV","date":"Mon Apr 25 14:40:13 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Heartbroken to hear of the passing of Senator Orrin Hatch. He was a good man &amp; a patriotic voice in the United States Senate that helped our country live up to the ideals set forth by our Founding Fathers. Cindy and I are praying for his family &amp; friends in this difficult time.","date":"Sun Apr 24 03:30:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Energy security is national security.","date":"Sat Apr 23 16:51:47 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Emily Pennington &amp; her family never backed down in the face of a challenge. I’m so glad that Emily will be able to attend her senior year and graduate with her peers! https://t.co/w3gx6p5B24","date":"Fri Apr 22 18:51:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s absurd.","date":"Fri Apr 22 16:06:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must unleash Made in Montana &amp; Made in America energy! https://t.co/9HavnQMpsQ","date":"Thu Apr 21 20:49:42 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Energy security is economic &amp; national security. Montana refineries like Calumet are on the cutting edge of new technology that will help unleash America’s energy potential.\n\nEnjoyed getting an up-close look at the work Calumet is doing to drive MT energy production. https://t.co/Z2uYvuhzIb","date":"Thu Apr 21 15:24:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s plain &amp; simple: @JoeBiden and the Democrats’ backwards economic policies &amp; wasteful spending have resulted in the highest inflation in over 40 years.\n\nThe inflation crisis is hitting mountain states like MT harder than the rest of the country at 10.4%. This is unacceptable.","date":"Wed Apr 20 20:13:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This National Park Week, I’m pushing the Senate to pass my bipartisan bill with @SenAngusKing that will help communities like Gardiner, and our parks, thrive for years to come.","date":"Wed Apr 20 16:44:13 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana’s gateway communities know firsthand the benefits &amp; challenges that come with increased visitation to our parks. \n\nIn honor of #NationalParkWeek, hear from Terese of Gardiner, MT on the importance of supporting the communities that help make our parks special. https://t.co/Mqu09fx65M","date":"Wed Apr 20 16:44:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must secure our southern border.","date":"Tue Apr 19 23:42:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I'll never forget the bloodshed and evil that I witnessed in Ukraine at the hands of Putin—America and the rest of the world must not either. \n\nWe must get Ukraine the lethal aid and weapons they need to win the war against Russia.","date":"Tue Apr 19 23:06:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Met with several Ukrainian leaders including the Mayors of Bucha and Kyiv. Mayor Fedoruk of Bucha's house was demolished by the Russians. They are both incredible leaders and their strength is inspiring. https://t.co/IEPtGPvKfc","date":"Tue Apr 19 23:06:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Holding the fins of a rocket that destroyed this Russian tank 20 miles outside of Kyiv. https://t.co/edseDjIMan","date":"Tue Apr 19 23:06:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We saw the remnants of Russian military equipment from their failed advances. https://t.co/i5n9rWrhbh","date":"Tue Apr 19 23:06:10 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Mountains of destruction that were once family homes, apartments or buildings. I found a child's small wooden toy in the rubble. https://t.co/QAYKc7fL2T","date":"Tue Apr 19 23:06:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Shallow graves filled with innocent civilians, women and children murdered by Putin. I will never forget the stench of death from the mass graves of innocent civilians. https://t.co/qOLQlTEdiR","date":"Tue Apr 19 23:06:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week, I was the first United States Senator to step foot in Ukraine since Russia's invasion. I saw indisputable, chilling evidence of Putin's war crimes everywhere.\n\nHere's what I saw — warning it’s graphic:","date":"Tue Apr 19 23:05:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"#ArmUkraineNow \nhttps://t.co/nJbvzjGQgz","date":"Tue Apr 19 22:09:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Energy security is national security, and now more than ever we need to be supporting more Made in Montana energy. \n\nGreat morning celebrating the opening of Denbury's pipeline in Baker that’s supporting jobs &amp; bringing in critical tax dollars. \n\nWe need more pipelines! https://t.co/cGAATPPctD","date":"Tue Apr 19 19:14:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Putin’s atrocious war crimes in Ukraine will not end until the war ends. The war will not end until Ukraine gets the lethal aid they need. https://t.co/qb5Xwbw5G3","date":"Tue Apr 19 13:35:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The classic Biden White House adage: rules for thee, not for me!","date":"Mon Apr 18 22:02:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Big victory and about time!\n\nAll of @JoeBiden’s unscientific and unconstitutional mandates HAVE to end! https://t.co/k1xC88TfCB","date":"Mon Apr 18 18:31:47 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“The angel said to the women, “Do not be afraid, for I know that you are looking for Jesus, who was crucified.  He is not here; He has risen, just as He said.” Matthew 28:5-6.  Christ the Lord has risen today!","date":"Sun Apr 17 12:33:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today marks the start of #NationalParkWeek, and in Montana, enjoying the great outdoors isn’t just a favorite pastime, it’s part of our way of life.\n\nTo kick off this week, entrances to all national parks are free today! Find your park here: https://t.co/h9XQCetwOv","date":"Sat Apr 16 15:52:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Wishing a Happy Passover to all Montanans celebrating!","date":"Fri Apr 15 18:50:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"\"For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.”—Mark 10:45 #GoodFriday","date":"Fri Apr 15 18:45:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden doesn’t think illegal immigrants at the southern border should be subject to COVID-19 restrictions but he does think American families need to wear masks on planes. \n\nThe hypocrisy is rich.","date":"Wed Apr 13 17:58:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Outrageous. It’s time we let Montanans get their lives back to normal and get rid of these arbitrary mandates once and for all. https://t.co/YwqlYz9RkY","date":"Wed Apr 13 16:29:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"📸: Prime Minister @eduardheger","date":"Tue Apr 12 22:58:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you Prime Minister @eduardheger for your leadership &amp; support for the people of Ukraine. \n\nSlovakia provided Ukraine with over $60 million in security assistance including the S-300 air defense system needed to help fight back against Putin’s war of agression. https://t.co/lry46RxvnQ","date":"Tue Apr 12 22:58:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On top of sky-high prices at the pump, Montanans' weekly grocery trips are costing more under @JoeBiden. https://t.co/yZj7kqLbW3","date":"Tue Apr 12 16:19:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation hit another 40-year high under @JoeBiden &amp; the Democrats wasteful spending agenda. \n\nInflation is a tax on all Montanans, and those who can afford it the least, feel it the most. https://t.co/nSsdwappFh","date":"Tue Apr 12 13:22:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Absolutely ludicrous. \n\nIt’s high time to end these mandates — FOR GOOD. https://t.co/VCUpi9TMpR","date":"Mon Apr 11 21:37:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is a crushing weight on Montanans and Americans everywhere. It’s time to get real about stemming inflation at the source: reckless federal spending.","date":"Mon Apr 11 19:09:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is a northern border state with a southern border problem. These alarming numbers should serve as a wake up call for @JoeBiden’s administration. https://t.co/A6gMtX4gln","date":"Sat Apr 09 20:12:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@MayorBowser’s response to the horrific discovery of babies brutally slaughtered is to investigate those who revealed the crime. \n\nChilling. We demand #JusticeForTheFive.","date":"Sat Apr 09 00:47:10 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hi-Country beef jerky is a staple in the Daines household! It was fun to finally get to see their operation firsthand and learn more about their Montana business. https://t.co/qux5PcDhMK","date":"Fri Apr 08 19:05:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see NATO allies like Slovakia sending Ukraine the tools they need to defeat Putin in his war of aggression. Thank you for your leadership Prime Minister @eduardheger &amp; Ambassador @RadovanJavorcik.","date":"Fri Apr 08 17:10:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Nice catching up with Council Members from Fort Belknap this morning. https://t.co/qDnGK36PyM","date":"Thu Apr 07 18:36:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great time meeting with Bozeman Fire Chief Josh Waldo &amp; Columbus Fire Chief Rich Cowger today. Montana firefighters do so much to keep our families and communities safe. #MontanaProud https://t.co/4dljng9mCq","date":"Thu Apr 07 17:11:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Last night, the Senate passed my public lands bill, the MAPland Act, and now it’s set to be signed into law. \n\nMy bill with @SenatorRisch will help increase access to public lands by ensuring maps and other helpful information for exploring the great outdoors is digitized.","date":"Thu Apr 07 14:06:42 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Fun fact: Each year Montana farmers grow enough barley to make 17 billion bottles of beer.\n\nCheers to all of Montana’s farmers who help make beer so great!","date":"Thu Apr 07 13:34:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In Montana, we know it’s #NoBarleyNoBeer. Happy #NationalBeerDay to all of Montana's farmers and breweries! https://t.co/WJcTjMOdHp","date":"Thu Apr 07 13:34:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@EPAMichaelRegan—for the sake of hardworking Montanans already facing soaring energy costs, I urge you to immediately grant the exemptions needed to keep Montana refineries operating and supplying the critical energy and jobs needed for this country. https://t.co/RCRjoGKHfR","date":"Wed Apr 06 23:57:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s always a good day when I get to meet with young Montanans. Powell County and Arlee High students represent Montana well, and it was great to have them in DC today. https://t.co/FzqcXmVqbP","date":"Wed Apr 06 19:31:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Digital assets are part of the future—let’s embrace them!","date":"Wed Apr 06 16:36:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is the best state in the greatest country in the world. I’m lucky to call it home. \n\nHappy #406Day to the Last Best Place. https://t.co/ryGr7FN1eH","date":"Wed Apr 06 12:51:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"All lives are created with God-given dignity and potential. The five babies that were brutally killed at a late term abortion center in DC deserve justice, and the abortionist responsible should be investigated and held accountable. #JusticefortheFive https://t.co/O8Z8RhamDM","date":"Tue Apr 05 23:08:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"A perfect tribute honoring the brave men and women of the 341st Missile Wing. GBSD destined for @malmstromafb will now be called \"Sentinel.\"","date":"Tue Apr 05 22:35:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana beer distributers with the @NBWA are really raising the bar when it comes to their support for Montana breweries &amp; Montana ag. https://t.co/CKlcE3I6jw","date":"Tue Apr 05 21:21:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Jefferson High students help make Montana’s future bright! https://t.co/hWPa4UTlls","date":"Tue Apr 05 20:41:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The @SECGov should stick to overseeing markets and protecting investors. They should not be choking off access to capital for credit worthy energy businesses at the request of woke green activists.","date":"Tue Apr 05 19:06:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed chatting with students from Hamilton High School this morning! https://t.co/uvrC62GoIS","date":"Tue Apr 05 18:05:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On #GoldStarSpousesDay we remember the sacrifices made by not only our brave men and women in uniform, but the countless Montana families who know firsthand the cost of our freedom.","date":"Tue Apr 05 14:10:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"A few weeks ago, I heard from some of these incredible Ukrainian leaders in Poland, and today, welcomed them to DC. Their knowledge on the war and their strength in the face of unimaginable circumstances is inspiring. https://t.co/H5V8nx9WUq","date":"Mon Apr 04 23:32:44 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden—secure our southern border!","date":"Mon Apr 04 22:32:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@SecBecerra is taking funds away from the State of Montana as a loophole to get around state law and funnel millions to pro-abortion groups that backed @JoeBiden’s election. Montanans don’t want to their tax dollars to bankroll the abortion industry.\n https://t.co/Dagrusjmiq","date":"Mon Apr 04 14:46:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden — the solution to your energy crisis is not tapping into oil reserves. The solution is unleashing American energy. https://t.co/hA6D7eJat1","date":"Sun Apr 03 16:25:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@Montana_FFA helps prepare young Montanans for future jobs in ag &amp; helps carry on Montana’s rich agricultural legacy. \n\nGrateful to receive an Honorary State FFA Degree this morning at the State Convention. https://t.co/4wH4LOGii3","date":"Sat Apr 02 18:21:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a busy March meeting with Montanans in DC! https://t.co/01CtRcSIm5","date":"Fri Apr 01 21:57:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Students like Emily make Montana proud. Let her graduate! https://t.co/XqYMJFdTE9","date":"Fri Apr 01 19:47:56 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This is the LAST place we want to see 406 represented.\n\nUnfortunately, @JoeBiden's disastrous energy policies are no April Fool's joke. https://t.co/hnTWBN53ZN","date":"Fri Apr 01 15:14:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s trying to put a band-aid on a bullet wound. We need to unleash American energy.","date":"Thu Mar 31 20:49:38 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"There are two genders—X is not one of them. The Left's woke agenda has no end.\nhttps://t.co/GZwG1kq4ee","date":"Thu Mar 31 19:05:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Rock Creek Mine in Montana has been caught up in permitting &amp; litigation for over 35 YEARS. This is outrageous. We need to be increasing American mineral production, not blocking it. https://t.co/Wln6K2t9Vl","date":"Thu Mar 31 16:56:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It's true!","date":"Thu Mar 31 15:31:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"TSA won’t check your ID for gender but they’ll still tell you to wear a mask. They’ve gone full woke.","date":"Thu Mar 31 13:41:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Wokeness over national security. This is outrageous. https://t.co/evBnj3GrRz","date":"Thu Mar 31 12:37:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/6gGR0YTTvv","date":"Thu Mar 31 01:20:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I'm disappointed that @JoeBiden's White House cancelled my meeting with Judge Jackson this week, taking away the opportunity to ask the SCOTUS nominee important questions about her record ahead of the first votes on her nomination.\n\nMy full statement here: https://t.co/z7msouYeqO","date":"Wed Mar 30 21:30:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m thankful for Montana service members and their families like the Heppners and the Lamoreauxs.🇺🇸 https://t.co/BMYQPPLsZ3","date":"Wed Mar 30 20:24:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana families will be spending $5,200 more this year on daily needs because of @JoeBiden’s inflation crisis. Inflation is a tax on Montana families, and those who can afford it the least, feel it the most.\n \nWake up Biden. Enough wasteful spending. Enough reckless policies.","date":"Wed Mar 30 18:00:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Washington D.C. felt a little bit more like home this morning with Montana students visiting from Cut Bank, White Sulphur Springs and Ennis. https://t.co/qUltOeGrZQ","date":"Wed Mar 30 17:22:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent yesterday afternoon with the folks from Montana Rural Water Systems to talk about the important work they do every day to ensure Montanans have reliable and clean water. https://t.co/uDXvZeS0hp","date":"Wed Mar 30 14:15:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana's Vietnam War veterans like John Quintrell served our nation honorably. \n\nOn #VietnamVeteransDay we honor their commitment, dedication and bravery.🇺🇸 https://t.co/STP3ocMXCa","date":"Tue Mar 29 15:47:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Prices are soaring and Montana families are paying the price. \n\n@JoeBiden’s solution? Spend more money we don’t have and hike taxes on hardworking Montanans and businesses.","date":"Tue Mar 29 14:28:37 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must keep the bipartisan provisions to support semiconductor manufacturing, level the playing field for trade, increase IP protections for Americans, create high-paying tech jobs and advance research in states like MT that are leading the quantum computing revolution.","date":"Mon Mar 28 22:15:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today the Senate is advancing my bipartisan bill to launch America forward in high-tech, manufacturing and advanced research that is critical to win the race against China.","date":"Mon Mar 28 22:15:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While the Senate passed the bipartisan “US Innovation and Competition Act” last year, the House passed their own partisan bill that is a step back, not a leap forward.","date":"Mon Mar 28 22:15:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's budget pours fuel on his inflation dumpster fire with more big government, wasteful spending.\n\nAt a time when Montanans are feeling the sting of the Democrats’ wasteful tax and spend agenda, we should be reining in government spending, not spending more.","date":"Mon Mar 28 19:20:09 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is soaring and Montana families are suffering. @JoeBiden’s wasteful spending policies put American families last.","date":"Sun Mar 27 18:33:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The future of Montana ag is bright with businesses like IND HEMP! https://t.co/QOCxpm7z6E","date":"Fri Mar 25 22:32:58 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"From raising cattle to growing wheat and everything in between, Montana women in ag are working hard from sun up to sun down. Happy #NationalWomeninAgDay! https://t.co/UlA6uXbaFw","date":"Thu Mar 24 17:29:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Taxpayer dollars should not be used for abortion.","date":"Thu Mar 24 16:15:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Chairman Davis is right—one death is too many. \n\nThe drug crisis is tearing Montana families and communities apart. We must do everything we can to combat it, and that starts with securing our southern border. https://t.co/P26eB0uRxa","date":"Thu Mar 24 15:24:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Remember when the Democrats huffed and puffed about passing this partisan “COVID-19 relief” bill? I do.\nhttps://t.co/ksA4YndMdR","date":"Wed Mar 23 21:24:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"What a complete and utter waste of taxpayer dollars. \n\n@JoeBiden &amp; the Democrats are the party of fiscal insanity—they opened the floodgates of inflation and haven’t stopped since.\nhttps://t.co/ksIJv7BnSB","date":"Wed Mar 23 21:17:12 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Those who can afford @JoeBiden’s inflation crisis the least, are feeling it the most.","date":"Wed Mar 23 19:02:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a full office today with Montana students from Shields Valley, Twin Bridges, Roundup, Terry and Broadwater high schools! https://t.co/o6R16Qvoe8","date":"Wed Mar 23 16:24:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Every day is #NationalPuppyDay in the Daines house! https://t.co/lSnVdAs1YP","date":"Wed Mar 23 14:55:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT is home to strong, influential Native women that make our state proud. \n\nGlad to see the Senate pass my bipartisan resolution w/ @lisamurkowski &amp; @SenBrianSchatz recognizing the contributions of Native women to our great nation.","date":"Wed Mar 23 01:10:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Peace through strength. Peace through energy security.","date":"Tue Mar 22 18:08:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Going LIVE on @AmericaRpts on Fox News soon. Tune in! https://t.co/TGapzaGjyH","date":"Tue Mar 22 17:18:15 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana has a rich legacy of agriculture. It's what sets us apart and makes Montana the best place to live, work and raise a family.\n\nOn #NationalAgDay, and every day, we thank our hard working farmers and ranchers for all they do for our state, nation and the world. https://t.co/QduXkas1ZZ","date":"Tue Mar 22 13:37:38 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As @JoeBiden continues to stonewall American oil &amp; gas production, @GovGianforte continues to stand up for Made in Montana and Made in America energy.","date":"Mon Mar 21 23:48:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"My stance has been clear, and it will remain clear: we must unleash American energy. https://t.co/uJKvA8ZDaK","date":"Mon Mar 21 21:57:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to join my colleague @SenatorHick in designating March as World Down Syndrome Month to help raise awareness and celebrate the joy that those with Down syndrome bring to our lives and families.","date":"Mon Mar 21 18:14:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"All lives are precious and created with God-given dignity and potential, no matter how many chromosomes they may have. #WorldDownSyndromeDay https://t.co/sOQNsDRNWd","date":"Mon Mar 21 18:14:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This is a great win for Montana ag and small businesses. \n\nThanks for your leadership and hard work, @GovGianforte!","date":"Mon Mar 21 16:26:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s continued assault on Americans’ constitutional rights is unacceptable.\n\nI’m leading my colleagues in defending the Second Amendment as we demand answers for the Administration’s latest infringement. https://t.co/Q1umZyhBEj","date":"Mon Mar 21 14:25:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Was an honor to spend time with a Montanan serving in special ops in Germany. #MontanaProud https://t.co/8cnybtufrE","date":"Fri Mar 18 20:05:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In Germany with a bipartisan group of my Senate colleagues meeting with the U.S. military Special Operations Command to discuss Russia’s ongoing invasion of Ukraine. https://t.co/syxS9fwphx","date":"Fri Mar 18 19:19:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Did you know the mascot for Chinook High School is the Sugarbeeters? \n\nFun time catching up with some of Montana’s best &amp; brightest students today! https://t.co/xFQFuNzvuM","date":"Thu Mar 17 20:41:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see Montanans like Dennis joining the Freedom Convoy. 🇺🇸 https://t.co/xrXMQvagN6","date":"Thu Mar 17 17:48:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Dennis came all the way from Helena, MT to stand up for FREEDOM. \n\nEnd @JoeBiden’s vaccine mandates! https://t.co/Sx5vMG3a2W","date":"Thu Mar 17 16:15:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hope everyone has a happy, fun and safe St. Patrick's Day. Can’t think of a better place to celebrate than Butte, America!","date":"Thu Mar 17 14:18:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s no wonder Putin wants to pull the plug. According to Meta: \n\nPresident Zelenskyy’s inspiring videos have been viewed over 55 million times by over 20 million Russian Instagram users since the Russian invasion began.","date":"Thu Mar 17 01:33:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Met with folks from the Montana Wool Growers Association today to discuss important issues facing Montana ag like returning the management of grizzly bears back to the State of Montana. https://t.co/vk14wtz79y","date":"Wed Mar 16 21:18:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"President Zelenskyy and the people of Ukraine are warriors inspiring the world in their fight for freedom against Putin’s evil regime. \n\nUkraine needs more help to combat Putin’s lethal attacks — more planes, more drones, more support.\n#StandWithUkraine️ 🇺🇸🇺🇦 https://t.co/E99m68zKAo","date":"Wed Mar 16 14:05:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Putin will do everything he can to stop the flow of information and sell his twisted propaganda. \n\nPulling the plug on social media is the latest attempt for Putin to brush his atrocities under the carpet. https://t.co/Tp2YqkQoml","date":"Wed Mar 16 12:44:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Putin will do everything he can to stop the flow of information and sell his twisted propaganda. \n\nPulling the plug on social media is the latest attempt for Putin to brush his atrocities under the carpet. https://t.co/Tp2YqkQoml","date":"Wed Mar 16 12:44:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats need to wake up.\n\nWe must unleash American energy.","date":"Wed Mar 16 00:11:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"@bradmwarren Butte, America!","date":"Wed Mar 16 00:03:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s travel mask mandate has been in place for far too long. \n\nI’m glad to see my effort with @RandPaul to get rid of this overreaching mandate pass the U.S. Senate. Time to get back to normal.","date":"Tue Mar 15 22:32:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is the president of crises. \n\nInflation. Energy. Southern border.","date":"Tue Mar 15 20:50:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Pleased to help lead the effort designating this week as National Tribal Colleges and Universities week. \n\nIt was great meeting with @aihec today to discuss the importance of TCUs across Montana and the nation! https://t.co/rWGnjkUW1J","date":"Tue Mar 15 19:40:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I stand with Montana truckers and all who stand for freedom. 🇺🇸 https://t.co/5w6oiTW5Jf","date":"Tue Mar 15 17:36:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanks to @GovGianforte's leadership, Montana is open for business and folks are back to work!","date":"Mon Mar 14 19:29:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"American families everywhere are feeling the sting of higher prices as inflation continues to soar but it's hitting folks in mountain states the hardest. \n\nInflation is up a jaw-dropping 9.7% in states like Montana. Families can't keep up.","date":"Mon Mar 14 15:05:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Go Cats Go!","date":"Sun Mar 13 17:25:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Go CATS!","date":"Sat Mar 12 00:33:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Nice visiting with CSKT leaders this week. https://t.co/3mwxRQWOGa","date":"Fri Mar 11 22:53:12 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"CDC is now mandating masks be worn over the eyes at the gas station to prevent risk of heart attack.","date":"Fri Mar 11 19:17:38 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a productive conversation with Montana Grain Growers yesterday. What’s happening in Ukraine and Russia serves as a stark reminder that we must enhance America’s food &amp; energy security. We must support our farmers and ranchers. https://t.co/72QakTwsnU","date":"Fri Mar 11 15:24:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I'll be voting NO on the massive, bloated spending package chock-full of liberal policies and earmarks that will make inflation worse.\n\nHere's a look at just some of the earmarks tucked in to this wasteful spending bill. https://t.co/jlaNe2WUgR","date":"Fri Mar 11 02:38:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Earmarks are exactly what’s wrong with Congress—they allow shady back room deals that reward special interests and make lobbyists rich.\n \nThere are over 4,000 earmarks in the 2,700 page, massive $1.75 TRILLION spending package about to be voted on.","date":"Thu Mar 10 23:40:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent the afternoon talking to folks from the Montana Petroleum Association. We must support our American energy producers and unleash American energy development. https://t.co/nc9hDIO6XW","date":"Thu Mar 10 22:23:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's inflation crisis and anti-American energy policies are hurting MT small businesses.\n\nHear from Randyn, a White Sulphur Springs business owner, about the impacts the Biden administration’s policies are having on his business. https://t.co/BmPVXM7usA","date":"Thu Mar 10 20:10:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is blaming his inflation crisis on the Russian invasion.\n\nWe’ve had NINE consecutive months of inflation over 5%. \n\nAmericans see right through you, Mr. President.","date":"Thu Mar 10 19:12:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The United States has an abundance of energy. We should use it as a tool—not only for our own energy security, but also for supporting our overseas partners. https://t.co/LgmFTfihcA","date":"Thu Mar 10 18:02:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great meeting with Chairman Davis today to talk about important issues facing Blackfeet veterans and the community. https://t.co/b2ORDQuoIb","date":"Thu Mar 10 17:07:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Another crushing inflation report.\n\nAs prices rise, paychecks shrink. Montanans can't afford @JoeBiden's policies. https://t.co/aOKK3KJDV3","date":"Thu Mar 10 13:55:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Rising gas prices aren’t just hurting Montanans at the pump. They're driving up costs for producers too, and folks will feel it at the grocery store. \n\nWe need to be supporting made in America products—from oil to wheat and everything in between.","date":"Wed Mar 09 21:03:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Oil. Natural Gas. Coal. Hydro. Nuclear. Wind. Solar.\n\nWe need an all-of-the-above energy approach. And we need to produce it here in America.","date":"Wed Mar 09 18:27:48 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/YofDxyqqj1","date":"Wed Mar 09 15:52:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Here’s an idea — unleash American energy production.\nhttps://t.co/3nO6uFUA4g","date":"Wed Mar 09 01:45:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This will be the most significant postal reform we’ve had in over a decade. Part of the package included my bipartisan bill, the “USPS Fairness Act” with @SenBrianSchatz.","date":"Wed Mar 09 00:24:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The @USPS provides critical services to Montana seniors, veterans &amp; rural communities.\n\nGlad to see my bipartisan postal reform bill pass the Senate and head to the President's desk. It will ensure the USPS can better serve Montanans across our state.","date":"Wed Mar 09 00:24:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As a proud Bobcat myself, I always enjoy talking about @montanastate —especially when it involves supporting Montana farmers and ranchers! \n\nGreat to visit with folks from MSU's College of Ag today. https://t.co/FujcWeAeKZ","date":"Tue Mar 08 22:17:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden—No to the Iran deal. No to Venezuelan or Iranian oil. \n\nWe need to unleash AMERICAN energy.","date":"Tue Mar 08 21:32:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Kicked off my morning showing some Montana firefighters around the U.S. Capitol. I’m grateful for all they do to protect Montana families &amp; communities. https://t.co/7S0ZEzQW9S","date":"Tue Mar 08 18:58:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Replace Russian oil with American oil.","date":"Tue Mar 08 16:52:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great. Now instead of looking to Iran and Venezuela for oil—unleash American energy production!","date":"Tue Mar 08 13:35:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Try telling that to hardworking Montana families, farmers and ranchers. \n\nThis isn’t going to cut it—we must unleash American energy and bring costs down for Americans.","date":"Mon Mar 07 19:52:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden has ignored the crisis at our southern border for far too long.","date":"Mon Mar 07 14:47:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Unleash American energy.","date":"Sat Mar 05 16:25:58 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Currently on a zoom call with President Zelenskyy. #StandWithUkraine️ https://t.co/ZtGjyWITwN","date":"Sat Mar 05 14:53:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Insane. Twitter continues to block the speech of Americans while allowing Putin and the Kremlin to spew out propaganda on their platform as Russia's war against a sovereign and independent Ukraine continues.","date":"Thu Mar 03 23:26:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent my afternoon with Montana potato farmers! I always enjoy hearing from Montana farmers about how we can promote Montana ag in the United States Senate. https://t.co/RyCZU0jANn","date":"Thu Mar 03 21:58:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, the United States Senate had the chance to pass my \"SMART Energy Act\" to support an increase in traditional and renewable Made in America energy. \n\nDemocrats blocked it.","date":"Thu Mar 03 19:48:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the United States need to unleash American energy production and stop funding Putin’s ruthless war chest.","date":"Thu Mar 03 15:49:56 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thankful for all that Montana principals and school leaders do to support young Montanans. https://t.co/oH2RjTRPX5","date":"Thu Mar 03 01:27:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a productive conversation with folks representing Montana's Credit Unions today. https://t.co/2WObFvR9v1","date":"Thu Mar 03 00:03:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today the @forestservice announced the Anaconda Job Corps won the \"Center of the Year\" award!\n\nThe students, faculty and staff at Anaconda Job Corps are some of the best in our state! I’ve enjoyed visiting with them in the past and hearing about the skills they're learning. https://t.co/b7HdKF9VVb","date":"Wed Mar 02 21:54:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"NEWS: My effort with @RogerMarshallMD to end @JoeBiden's overreaching mandate for healthcare workers has passed the U.S. Senate. \n\nThis is a great step forward for Montana's healthcare heroes &amp; our rural hospitals that have been on the frontlines throughout this pandemic.","date":"Wed Mar 02 20:50:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Sugarbeet farming is an important part of Montana’s ag economy. Great to chat with sugarbeet producers on how we can help our Montana farmers by leveling the playing field and supporting the sugar program and robust disaster relief. https://t.co/LpZtpwtg3A","date":"Wed Mar 02 20:21:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Was a pleasure spending time with @DAVHQ National Senior Vice Commander Joe Parsetich and Montana DAV Commander Ken Weinheimer yesterday. I’m proud of the hard work that DAV does to help Montana veterans. https://t.co/g04mwLSlBw","date":"Wed Mar 02 17:35:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must unleash American energy production to help lower energy costs and help our allies be less reliant on Putin and Russia.","date":"Wed Mar 02 16:50:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Tonight @JoeBiden should've taken responsibility for his first year of failures. He didn't. \n\nBiden must serve all Americans, not just the liberal elite. #SOTUinCrisis https://t.co/tjAPuRQ0xO","date":"Wed Mar 02 03:54:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden: “You think the deer are wearing kevlar vests?”\n\nMr. President… the Second Amendment is not about hunting, it’s about liberty.","date":"Wed Mar 02 03:13:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today marks the beginning of Women’s History Month! Montana has a rich history of trailblazing women including Jeannette Rankin who was the first woman to serve in Congress. https://t.co/avpj25dn6f","date":"Tue Mar 01 22:52:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Foreign policy is hard for the Biden administration.","date":"Tue Mar 01 22:44:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"If @JoeBiden is serious about stopping Putin, he would unleash American energy production.","date":"Tue Mar 01 21:46:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Local TV &amp; radio is so important for keeping folks across Montana informed! Always glad to catch up with @MTBroadcasters. https://t.co/lpMsJuc2hk","date":"Tue Mar 01 21:12:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Secure our southern border. #SOTU","date":"Tue Mar 01 19:43:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Unleash American energy. #SOTU","date":"Tue Mar 01 17:47:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In Montana, we’re lucky to have the first national park right in our backyard. @YellowstoneNPS will always be a treasure and part of your Montana way of life. https://t.co/GoIBHU4pw6","date":"Tue Mar 01 17:16:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While @JoeBiden may try and sugarcoat his failures in his #SOTU Address, the American people won’t be fooled. The President can’t hide the crises he’s created.","date":"Tue Mar 01 15:18:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today marks @YellowstoneNPS’s 150th anniversary! Cindy and I always enjoy our visits to the park. https://t.co/iMFblFBsMG","date":"Tue Mar 01 14:19:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats’ “Abortion on Demand Until Birth Act” would impose a horrifying abortion regime across the country that violates the right to life and is completely contrary to the kind of nation America is and aspires to be. https://t.co/VlSMGxE14D","date":"Tue Mar 01 00:25:17 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The woke Left doesn’t just want to ignore the science about human life, it also wants to erase women.","date":"Mon Feb 28 23:38:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This afternoon, the Democrats’ radical abortion agenda will be on full display. \n\nTheir “Abortion on Demand Until Birth Act” would mandate one of the most extreme abortion regimes in the WORLD.\n\nWe must stand strong for ALL life, no matter how small.","date":"Mon Feb 28 20:09:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Ukrainian military in Mariupol. The photo by Dmytro Muravsky, was posted on his Facebook page. Pray for the brave freedom loving people of Ukraine. https://t.co/EfXZZNTEMT","date":"Sun Feb 27 00:48:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"“The fight is here; I need ammunition, not a ride.” \n\nGot bless President Zelensky and the people of Ukraine. https://t.co/PLr369SCVr","date":"Sat Feb 26 17:27:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/k7TZoK9H9Z","date":"Sat Feb 26 16:51:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"With that said, I’m disappointed that President Biden chose to appeal to his far-Left base with this nomination, rather than listen to voices on both sides of the aisle calling for a Supreme Court nominee who would enjoy strong bipartisan support and consensus.","date":"Fri Feb 25 21:57:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’ll be closely examining Judge Jackson’s record and interpretation of the Constitution. Any Supreme Court Justice must understand the importance of not legislating from the bench and upholding the Constitution.","date":"Fri Feb 25 21:57:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"One of the most important things we can be doing right now for our country and our allies is unleashing American energy.","date":"Fri Feb 25 20:52:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden — for the sake of American energy independence and global dominance, we must restart the Keystone XL pipeline NOW!","date":"Fri Feb 25 14:31:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Energy security is national security.","date":"Fri Feb 25 13:59:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Congress must pass my bill, the SMART Energy Act, that requires @JoeBiden to immediately restart oil and gas leasing on federal lands. \n\nWe must support America's energy independence, American energy jobs &amp; American energy production. Especially during these times.","date":"Thu Feb 24 18:00:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I do not support sending American troops to Ukraine.","date":"Thu Feb 24 15:37:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The skyrocketing price of oil and resulting inflation are stark reminders of the importance of increasing, not decreasing, made in America energy.","date":"Thu Feb 24 15:37:15 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Putin is a thug, and he has been empowered and emboldened by Biden’s disastrous withdrawal from Afghanistan and his approval of Russia’s Nord Stream 2 pipeline while killing America’s Keystone XL pipeline.","date":"Thu Feb 24 15:37:15 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m praying for the people of Ukraine and condemn Putin’s outrageous attack on their sovereignty and independence.","date":"Thu Feb 24 15:37:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Praying for the people of Ukraine.","date":"Thu Feb 24 05:07:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must bring accountability and transparency to the meatpacking industry. It's time to pass my bill to return fairness to the cattle markets &amp; support Montana ranchers.","date":"Wed Feb 23 20:33:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Ranchers are barely breaking even selling their cows, and shoppers are breaking the bank buying beef in grocery stores.\n\nHear from Maggie, a 4th generation MT rancher, about the impacts of market manipulation in the cattle markets. https://t.co/cIbf3kzIFO","date":"Wed Feb 23 20:33:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden should’ve never given the green light to Putin’s pipeline in the first place especially while killing the Keystone XL pipeline at home. \n\nBiden killed American jobs &amp; energy while supporting and empowering Russia. His actions have consequences.\nhttps://t.co/qhiLOXZgdU","date":"Wed Feb 23 16:45:57 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"What’s happening in Russia &amp; Europe will put the impacts of @JoeBiden and the Democrats’ obsession with radical green energy policies and their war on Made in America energy on center stage. \n\nSadly, American families and the free world will suffer the consequences.","date":"Wed Feb 23 16:10:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to welcome @IsraelinSF Shlomi Kofman to Montana today and meet with him and Rabbi Bruk of Bozeman to talk about the importance of maintaining a strong relationship between the United States and Israel. 🇺🇸🇮🇱 https://t.co/kXRdgTJYP8","date":"Wed Feb 23 00:59:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"With the passage of my Senate resolution, this week is officially National #FFAWeek!\n\nI’m glad to recognize the important work that FFA does to support young Montanans and prepare them for their future jobs in ag!","date":"Tue Feb 22 18:22:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While @JoeBiden has done everything he can to continue his war on Made in America energy at home, he was the one who gave the green light for Russia to move forward with the Nord Stream 2 pipeline. \n\nBiden should have never given the OK in the first place.","date":"Tue Feb 22 14:53:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today we celebrate the great presidents who chose to serve our nation.\n\nOn this #PresidentsDay let us recognize the many leaders who came before us and honor them by always protecting freedom, liberty &amp; justice for all.🇺🇸","date":"Mon Feb 21 16:00:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Always enjoy meeting with Montanans in DC. https://t.co/kt8kPtJssg","date":"Sun Feb 20 16:03:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Biological men should not be competing in women’s sports.","date":"Sat Feb 19 17:31:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"A big congratulations to the Bozeman High School speech &amp; debate team for winning the state championship for the second year in a row!\n\nAs a former member of the Bozeman High team myself, I’m so glad to see these young Montanans take home the title! https://t.co/krsp1cqey4","date":"Fri Feb 18 23:52:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Twice in the past 24 hours @JoeBiden's admin has proposed woke climate policies that'll hurt Montana’s growth.\n\nPoliticizing pipeline approvals isn't in the best interest of jobs or the climate, and this “environmental justice” funding screen will be a barrier to MT investments.","date":"Fri Feb 18 22:33:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Biden admin has failed the American people yet again—this time by falling short of its vetting promises of Afghans which has created a serious public safety risk for our communities.\n\nAnother result of @JoeBiden's disastrous withdrawal from Afghanistan.https://t.co/DvaLunVxMg","date":"Fri Feb 18 20:15:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"End the mandates!","date":"Fri Feb 18 19:35:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Last night the U.S. Senate passed my bipartisan resolution to recognize the 150th anniversary of @YellowstoneNPS! \n\nIf you haven’t had the chance to visit Yellowstone, you’re missing out. It is one of America’s crown jewels!","date":"Fri Feb 18 16:10:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to give my colleagues a taste of Montana and show off what our great state has to offer! https://t.co/YH25f3W5uL","date":"Thu Feb 17 23:28:56 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Ag is Montana's number one economic driver but it’s also part of our way of life. Always great to have members of the @MTFarmBureau in D.C. to discuss how to continue supporting our Montana farmers and ranchers. https://t.co/yA0ktDxghO","date":"Thu Feb 17 21:43:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great news for the Pro-Life movement! This is just the beginning. The Supreme Court has the opportunity to restore the Constitution and defend our most fundamental right—the right to life. https://t.co/JiuayIe6sK","date":"Thu Feb 17 18:28:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to have @EnesFreedom standing tall for human rights, free speech &amp; liberty.\n\nThere's a reason he changed his name to Freedom! https://t.co/SVCgTMY6Th","date":"Wed Feb 16 23:47:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT is lucky to have dedicated, passionate leaders serving as County Commissioners.\n\nEnjoyed hearing from Missoula County Commissioners Juanita Vero and Dave Strohmaier and Cascade County Commissioner Joe Briggs about issues important to our MT communities. https://t.co/A1FkMRQykS","date":"Wed Feb 16 22:24:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Stand for freedom—end the mandates!","date":"Wed Feb 16 18:46:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Democrats have played politics with our schools &amp; children for too long. Time to end all mask and vaccine mandates. https://t.co/FKyYTdKNQq","date":"Wed Feb 16 16:02:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Since @YellowstoneNPS was established, it has inspired folks from across the world to come see the great outdoors and what Montana &amp; the West have to offer. \n\nGlad to join my colleagues on a Senate resolution celebrating Yellowstone’s 150th anniversary!","date":"Wed Feb 16 01:24:42 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Biden admin is dragging its feet on releasing a report detailing the thousands of American jobs lost when @JoeBiden killed the Keystone XL pipeline.\n\n@JoeBiden—you must take responsibility.\nhttps://t.co/aScIA8qoMj","date":"Tue Feb 15 19:33:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"How does @JoeBiden expect Montana families to keep up with these rising prices? They can’t.\n\nhttps://t.co/0mDP0osExX","date":"Tue Feb 15 14:44:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The bombshell stories of election interference from the Clinton campaign against Trump are jaw-dropping. Clinton’s people need to be held accountable.","date":"Tue Feb 15 00:34:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today I led a letter with @RepRosendale and our colleagues urging the Biden administration to resolve challenges stemming from the disastrous Cottonwood decision which threatens Montana forest management project. We must manage our forests before they manage us!","date":"Mon Feb 14 23:35:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In order to protect Montana communities and families from wildfires, we must increase active forest management and prevent extreme environmentalists from using frivolous litigation to block important forestry projects. https://t.co/SOWnferFKe","date":"Mon Feb 14 23:31:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s almost as if @JoeBiden’s administration is afraid to confirm how many jobs they killed on Day One in office by cancelling the Keystone XL pipeline.","date":"Mon Feb 14 17:32:38 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thankful to always have my sweet wife Cindy by my side. Happy Valentine’s Day! https://t.co/DWsLHthqB6","date":"Mon Feb 14 16:59:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Grateful for the folks at @WDSfire and the work they do to protect Montana communities from wildfires. https://t.co/xOBSDvUgCN","date":"Sun Feb 13 21:03:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana farmers and ranchers don’t need the federal government regulating their puddles and ditches.","date":"Sun Feb 13 15:49:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Always a good time talking public lands and national parks with my friend from across the aisle, @SenAngusKing.","date":"Sat Feb 12 16:36:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As Montana communities are being devastated by drugs and crime fueled by the southern border crisis, it’s outrageous that the Biden administration would even think about using taxpayer money to fund and distribute crack pipes. Crazy.","date":"Fri Feb 11 20:03:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Meeting with athletes from the Montana Special Olympics always puts a smile on my face. https://t.co/DmxitbvvDW","date":"Thu Feb 10 23:17:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a great conversation with Montanans representing @ruralhealth yesterday talking about the importance of telehealth. Telehealth is more than just an innovative option for accessing services—it’s a vital lifeline to care for Montanans. https://t.co/MnkZOZa0on","date":"Thu Feb 10 22:15:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Can’t think of a better way to celebrate #WorldPulsesDay than with some Farver Farms Lentils from Scobey, MT! https://t.co/ZhOoXAJlch","date":"Thu Feb 10 20:00:48 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is a tax on ALL families.","date":"Thu Feb 10 16:38:16 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana families are continuing to suffer from rising prices with @JoeBiden and the Democrats in charge.\n\nWhen will Montanans catch a break, Mr. President?  https://t.co/QNSK301UNU","date":"Thu Feb 10 13:58:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to see @RepRosendale and @RepJayapal leading on this issue in the U.S. House.","date":"Wed Feb 09 21:48:31 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Americans have lost trust in Congress. We’re here to serve, not be served—the public should have faith in that.\n\nGlad to team up w/ @SenWarren @MarshaBlackburn &amp; @SenStabenow to ban Members from trading &amp; owning individual stocks. Time we restore confidence in this institution.","date":"Wed Feb 09 21:29:01 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"As the only Chemical Engineer in the United States Senate, I understand the importance of STEM education as it helps support Montana energy and jobs and helps us stay competitive in the global economy.","date":"Tue Feb 08 23:33:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, TWO Montana teachers received the highest award in STEM education today—Shianne Schmidt from Whitefish and Christina Pavlovich from Livingston. What an achievement! \n \nThank you for everything you do to ensure young Montanans receive an education in STEM.","date":"Tue Feb 08 23:33:19 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud\nhttps://t.co/69uk8Td7P3","date":"Tue Feb 08 18:13:46 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Should've never gone forward in the first place.","date":"Tue Feb 08 14:30:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Let’s not forget it was @JoeBiden who killed the Keystone XL pipeline while giving the green light to Putin’s Nord Stream 2 pipeline, weakening America on the world stage and empowering Russia.","date":"Tue Feb 08 13:37:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"A terrible &amp; invasive idea from the get-go that would've put taxpayers at risk. Montanans shouldn’t have to use biometric data or facial recognition to access their own tax info.\n\nGlad the IRS listened to my concerns &amp; backed down from this absurd plan.https://t.co/asE3cNZkwt","date":"Mon Feb 07 21:23:15 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Couldn’t be happier to walk my sweet girl Caroline down the aisle today in Montana. https://t.co/0XHc5d77dd","date":"Sun Feb 06 02:08:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@gofundme’s decision to take down Freedom Convoy’s page is unacceptable. We must stand with Americans and our neighbors to the north as they fight for FREEDOM!","date":"Sat Feb 05 19:58:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden created an out-of-control crisis on our southern border &amp; now he's using taxpayer dollars to send illegal immigrants to cities across our nation. \n\nThis is unacceptable.","date":"Fri Feb 04 20:55:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Looking forward to cheering on the four Montanans competing in the 2022 Olympics. Best of luck to Maggie, Bradley, Darian and Jake!  You make #MontanaProud 🇺🇸","date":"Fri Feb 04 15:54:13 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Tony Hudson, a rancher from Stevensville, MT, shares how under the status quo, ranchers and families are hurting while meatpackers are getting rich. \n\nWe need a thorough investigation into market manipulation by the packers. https://t.co/4coN3wf10B","date":"Thu Feb 03 21:08:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Yet another reminder that there must be a thorough investigation into the meatpacking industry. \n\nWe can't allow ranchers to lose, families to pay &amp; meat packers to win big. https://t.co/dTR7GcHFSS","date":"Thu Feb 03 20:01:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"We must stand with our brave border patrol agents doing everything they can to protect our nation. \n\n@JoeBiden—secure our southern border!","date":"Thu Feb 03 18:39:48 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Violent crime is soaring across our country and it’s because of the Democrats’ soft-on-crime policies.","date":"Thu Feb 03 15:23:36 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Trudeau brushing off the truckers standing up for freedom by calling them a \"fringe minority\" that only reflects \"conspiracy theorists\" &amp; \"tinfoil hats\" is shameful. \n\nMontanans and our neighbors to the north are sick &amp; tired of overreaching mandates! https://t.co/PQkglzoaWN","date":"Wed Feb 02 21:33:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today is National Girls and Women in Sports Day — another opportunity to protect the integrity of women's sports and reaffirm that biological men have no place competing on women's teams. #NGWSD","date":"Wed Feb 02 20:40:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In @JoeBiden's America, every day feels like Groundhog Day.  \n\nEmpty shelves, high gas prices, and never-ending crises. When will it end? https://t.co/ARDb15a4Ux","date":"Wed Feb 02 17:46:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed spending time with Montana students from Shepherd High School this afternoon! https://t.co/bBYRZ21MON","date":"Wed Feb 02 01:02:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Wishing @SenatorLujan a speedy recovery.","date":"Tue Feb 01 23:46:52 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The national debt has surpassed $30 trillion! This is fiscal madness.\n\nCongress needs to get its fiscal house in order and stop proposing wasteful spending that will fall onto our children and grandchildren.","date":"Tue Feb 01 23:11:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to chat with Montanans and folks with the American Pulse Association &amp; the USA Dry Pea &amp; Lentil Council today to discuss how we can support MT farmers like leveling the playing field for our pulse producers. https://t.co/lKb9zSuWAh","date":"Tue Feb 01 18:47:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Claims that Israel is an apartheid state are ignorant and biased at best and vile and antisemitic at worst. I’m proud to stand with Israel and the Jewish people. https://t.co/Qlt6l9aX6S","date":"Tue Feb 01 17:19:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is allowing droves of illegal immigrants to infiltrate our country. We must put a stop to this madness. #BidenBorderCrisis","date":"Tue Feb 01 16:53:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Freedom &gt; Wokeness","date":"Tue Feb 01 13:59:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s administration is tracking law-abiding gun owners through an ILLEGAL federal firearms registry. We cannot allow this blatant attack on our Second Amendment rights.https://t.co/UGIr74RtSN","date":"Tue Feb 01 00:14:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Expecting parents begin providing for their child the minute they learn they’re having a baby. Pregnant moms should qualify for the Child Tax Credit to help with everything from prenatal care to baby supplies. https://t.co/xiDd5f5MTq","date":"Mon Jan 31 22:25:45 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I stand with all Montanans, Americans and our neighbors to the north who are fighting for FREEDOM against overreaching vaccine mandates! https://t.co/a09WaIbZpV","date":"Mon Jan 31 21:40:54 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This is insane. Men can't get pregnant.","date":"Mon Jan 31 20:45:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s an honor to recognize Montana heroes. 🇺🇸 https://t.co/sKMaqloaaO","date":"Mon Jan 31 18:27:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"https://t.co/dfRZEAoA8p","date":"Sat Jan 29 19:32:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m proud to be named an honorary Wolfhound by two Montana heroes! https://t.co/rdMp2sY5BZ","date":"Fri Jan 28 23:11:32 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT is proud to claim Vietnam veteran John Quintrell as our own. He bravely served our nation &amp; has been giving back to his fellow veterans ever since.\n\nToday I was honored to present this legendary Wolfhound with a tribute to his lifetime of service in the Congressional Record. https://t.co/83T2mIvVtB","date":"Fri Jan 28 23:11:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans' pocketbooks can't keep up with @JoeBiden's runaway inflation.\nhttps://t.co/iAA2wx6Bf2","date":"Fri Jan 28 17:34:24 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"No better way to start a Friday than with @RadioDaveMT live on KSKY. https://t.co/iNoIu02RMN","date":"Fri Jan 28 15:52:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana families are continuing to pay more for groceries because of @JoeBiden’s inflation crisis. Prices are up across the board compared to one year ago:\n\n🥩 21.4%\n🥓 18.6%\n🥚 11.1%\n🍗 10.4%\n🍊 9.9%\n☕️ 6.3%\n🥛 4.2%","date":"Thu Jan 27 22:35:55 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I'm encouraging all Montanans to consider donating blood to support rural hospitals and make a difference in the lives of our fellow Montanans. \n\nLearn more:\nhttps://t.co/BP4vhebNGo","date":"Thu Jan 27 18:01:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On the 77th anniversary of the liberation of Auschwitz-Birkenau, let us reflect and honor the millions of victims and survivors of the Holocaust. #HolocaustRemembranceDay","date":"Thu Jan 27 16:04:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s overreaching vaccine mandate for healthcare workers is jeopardizing the ability for Montana hospitals to provide care, especially in rural MT. \n\nGlad to stand with @GovGianforte &amp; @RepRosendale to fight for MT’s hospitals and healthcare heroes.","date":"Wed Jan 26 22:35:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden, families have been stuck with an inflation crisis, a supply chain crisis and a southern border crisis. Americans deserve better.","date":"Wed Jan 26 16:18:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The #BidenBorderCrisis is only getting worse, and alarming new stats show there is no end in sight. When will @JoeBiden do something about it?! https://t.co/MNB1QXE8ia","date":"Tue Jan 25 20:28:47 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"While Montana’s jobs numbers are thriving thanks to @GovGianforte — @JoeBiden’s inflation crisis is still hurting the pocketbooks of Montana families. \n\nBiden and the Democrats must stop their reckless spending agenda.","date":"Tue Jan 25 16:00:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanks to @GovGianforte's leadership &amp; his support for commonsense policies like less taxes and less regulations, Montana is open for business.","date":"Tue Jan 25 15:39:04 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I stand with Montanans against @JoeBiden’s overreaching vaccine mandates. https://t.co/BH137cTIDJ","date":"Tue Jan 25 00:50:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Parents know what's best for their children. In rural states like MT, it's critical to support &amp; empower parents w/ the flexibility to choose how &amp; where their child is educated.\n\nGlad to join forces w/ @SenatorTimScott to intro a resolution naming this week #SchoolChoiceWeek.","date":"Mon Jan 24 16:32:40 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week I had the chance to tour IND HEMP’s brand new fiber processing facility in Fort Benton. This Montana business is providing good-paying jobs, boosting the local economy &amp; supporting Montana farmers. We need to be supporting MT ag, not hindering it. https://t.co/ydMkMcvz6Z","date":"Sun Jan 23 17:05:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Another blow to @JoeBiden’s overreaching vaccine mandates. I hope to see this decision upheld. https://t.co/okPzKBy2RN","date":"Fri Jan 21 22:55:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Brilliant idea @TomCottonAR!","date":"Fri Jan 21 22:39:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to have businesses like @WDSfire in MT helping with wildfire suppression and mitigation and supporting communities dealing with the aftermath of wildfires.\n\nWe must increase forest management to help reduce the risk of catastrophic wildfires, protect families &amp; support jobs. https://t.co/QfahtudAGE","date":"Fri Jan 21 19:57:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m proud to stand with the thousands of Americans who will be marching in our nation's capitol today for the 49th @March_for_Life in our fight for life. \n\nIt was an honor to join so many Montanans last week for Helena’s March for Life. https://t.co/0JMoKcTuIh","date":"Fri Jan 21 15:46:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Every day the Texas heartbeat law is in effect countless lives are saved. Our fight for life is just beginning!\nhttps://t.co/6EwZEOqy9C","date":"Fri Jan 21 14:38:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today I visited with young Montanans from Helena visiting D.C. for the @March_for_Life! It is so encouraging to see the next generation passionate about protecting life. https://t.co/VSezUh1ftZ","date":"Thu Jan 20 23:28:10 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Well, @SenJohnHoeven, a bet is a bet. \n \nWhile I hope you enjoy those MT steaks from Sidney &amp; MT beef jerky from Lincoln...I’ll be sticking with MT State blue and gold moving forward. \n \nThe @MSUBobcats will be back to beat the @NDSU Bison next year! https://t.co/u7qGM9Qg0O","date":"Thu Jan 20 21:06:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"365 days of failures from @JoeBiden. https://t.co/xlPQxWVLD3","date":"Thu Jan 20 19:52:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"In just one year, @JoeBiden has created crisis after crisis &amp; has failed the American people on every front.","date":"Thu Jan 20 15:08:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Several Senate Democrats spoke on the Senate floor today to challenge the commonsense laws Montanans put in place to make it harder to cheat in elections.\n\nThey should get their facts straight—MTns want safe &amp; secure elections, not weak laws that undercut election integrity.","date":"Thu Jan 20 01:23:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"If @JoeBiden were honest, he would tell the American people: I've been a complete failure in my first year as president.","date":"Wed Jan 19 21:30:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's first year in office has been a failure for Montana and America.\n\n📈Highest inflation in 40 years\n⛽️War on Made in America energy\n❌Out-of-control southern border crisis\n🌍Failed withdrawal from Afghanistan \n🛒Supply chain crisis\n💉Overreaching vaccine mandates","date":"Wed Jan 19 16:38:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Left's federal election takeover bill has never been about voting rights, it’s always been about power and ensuring one party rule forever.","date":"Wed Jan 19 14:42:02 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"With @JoeBiden’s plummeting approval ratings, I think we all know how the American people feel about his first year in office.","date":"Wed Jan 19 00:27:06 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"No better place to be than a Montana rodeo. https://t.co/2PfmRa9rLW","date":"Tue Jan 18 22:03:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Biological males should not be allowed to compete in women’s sports. https://t.co/LIy0luFAru","date":"Tue Jan 18 20:17:14 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The 49th annual @March_for_Life finds us at a turning point in our nation’s history.\n\nNow more than ever, we must remain united in our fight to protect the precious lives of the unborn—a fight we are winning. #whywemarch","date":"Tue Jan 18 18:36:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's overreaching vaccine mandate won't only hurt Montana trucking businesses and workers, but it will cost Montana families more at the grocery store.\nhttps://t.co/TRf0ZY9f6q","date":"Tue Jan 18 16:19:43 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Dr. Martin Luther King, Jr. sparked a movement that inspired America to live up to the higher ideals laid out in the Declaration of Independence—that all men are created equal. \n\nToday, we honor him &amp; reflect on his legacy of peace, love, freedom and justice. #MLKDay","date":"Mon Jan 17 16:58:03 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"America stands as a beacon of hope &amp; a symbol of religious freedom around the world. We wouldn’t be the land of the free without our right to worship freely. \n\nWe recognize today as #ReligiousFreedomDay so we never forget the importance of protecting this fundamental freedom.","date":"Sun Jan 16 17:18:07 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a blast at the MT PRCA Circuit Finals Rodeo in Great Falls last night! https://t.co/Uuct1Jpwft","date":"Sat Jan 15 18:31:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to join so many Montanans for the #MarchforLife in Helena. \n\nAmazing to see what we can do when we stand together in the fight for life and give a voice to the most vulnerable. https://t.co/SLPeEBHh9z","date":"Fri Jan 14 21:06:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@SenatorRounds is a man of his word and settled up on an important wager after SDSU lost to the Bobcats. \n\n@MSUBobcats colors look good on you, Mike! https://t.co/95VKEY7dUD","date":"Thu Jan 13 23:25:44 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Very disappointing to see #SCOTUS uphold @JoeBiden's overreaching vaccine mandate for healthcare workers. \n\nIt's threatening Montana hospitals and limiting patient access to essential care. I won't stop working to protect our healthcare heroes against this harmful mandate.","date":"Thu Jan 13 20:46:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"#SCOTUS just struck down @JoeBiden's overreaching vaccine mandates for Montana small businesses that would've forced Montanans out of work &amp; forced businesses to shut their doors. \n\nBIG win for small businesses, workers and freedom.","date":"Thu Jan 13 20:46:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"MT’s grain growers are an essential part of our economy. Great sitting down with them to discuss reducing burdensome regs and leveling the playing field for MT ag. https://t.co/wjTWToKOEA","date":"Thu Jan 13 17:28:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats' power grab isn't about voting rights—it's about controlling Washington, D.C. forever. https://t.co/hiCKMNdQEf","date":"Thu Jan 13 15:13:50 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats are failing on every front. Red wave here we come. https://t.co/uxMXUHOpHm","date":"Wed Jan 12 23:26:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"With skyrocketing inflation, the on-going southern border crisis &amp; empty shelves across the country, this is no surprise. The American people deserve better.\nhttps://t.co/L9XXLhLx2D","date":"Wed Jan 12 22:08:37 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great chatting with #Crypto visionary last night, Michael @saylor. https://t.co/MUlikbDUtY","date":"Wed Jan 12 15:32:33 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Gas, groceries, energy — everything under @JoeBiden costs more. https://t.co/Tmf0zOYKSq","date":"Wed Jan 12 14:09:21 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation under @JoeBiden just hit a 40 YEAR high. Montana families cannot continue to afford to pay more for everything because of Biden’s reckless policies.","date":"Wed Jan 12 13:40:59 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"@2019MTTOY @SenatorTester Great question! Moose Tracks is my favorite.","date":"Tue Jan 11 22:44:08 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats’ “election reform” bill isn’t about making our elections more secure—it’s a far-Left power grab &amp; it must be stopped.","date":"Tue Jan 11 19:58:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hydropower provides good-paying jobs and safe, reliable &amp; affordable energy to Montanans across the state—we need more of it. https://t.co/zxYfjskBfU","date":"Tue Jan 11 17:47:23 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Thankful for @GovGianforte’s leadership and work to help give our brave wildland firefighters a much deserved pay raise.","date":"Tue Jan 11 01:07:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's supply chain crisis is hitting grocery stores across the country. \n\nNobody wins with the #BareShelvesBiden crisis.","date":"Mon Jan 10 22:54:25 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Democrats want to diminish the voice of Montanans by passing their radical federal election takeover bill that would steamroll the commonsense laws that Montana passed that make it harder to cheat.\n\nIt must be stopped.","date":"Mon Jan 10 17:49:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"The brave men &amp; women of law enforcement put their lives on the line every day to protect our families and communities. \n\nOn this #NationalLawEnforcementAppreciationDay take a moment to say thank you to these heroes. #BacktheBlue https://t.co/FYmm4jOSIA","date":"Sun Jan 09 17:43:51 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Tough, heartfelt loss today — but proud of the Cats and all the fans that showed up. Congrats to @mccutcheonlance on the single season receiving yards record and the entire @MSUBobcats team on the deepest playoff run in 37 years. \n\nWe’ll be back next year.","date":"Sat Jan 08 20:14:22 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Let’s go CATS! #FCSChampionship https://t.co/IjVN9aUzMs","date":"Sat Jan 08 16:58:39 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":".@MSUBobcats fans have taken over Frisco, TX for the #FCSChampionship. \n\nWe’re just minutes away from the Cats beating the @NDSU Bison! https://t.co/zluwOvesJS","date":"Sat Jan 08 16:24:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Catching up with some @MSUBobcats fans before the big game. Go CATS! #FCSChampionship https://t.co/fYlzcKBFfl","date":"Sat Jan 08 16:10:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud","date":"Sat Jan 08 03:10:20 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great night kicking off #FCSchampionship weekend with @GovGianforte and MSU President @WadedCruzado. Go Cats! https://t.co/gINwEZhccC","date":"Sat Jan 08 02:36:29 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"It was a good game, @SenatorRounds!  I’ll see you next week in a @MSUBobcats_FB hat.\n\nOne Dakota down, one to go. Let’s go Cats! #FCSNationalChampionship","date":"Sat Jan 08 00:39:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great story! https://t.co/8MmXd1WHjk","date":"Fri Jan 07 18:37:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, Americans will be tuned in to #SCOTUS as they hear arguments on @JoeBiden’s overreaching vaccine mandates. \n\nFor the sake of MT businesses &amp; health care centers, these mandates must be struck down.","date":"Fri Jan 07 14:05:28 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana ranchers produce the best beef in the world—they should be treated fairly in the marketplace and MT families should be getting fair prices in the grocery store. https://t.co/14XuFDZ7HT","date":"Thu Jan 06 20:11:11 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"On Friday, #SCOTUS will hear oral arguments on @JoeBiden’s overreaching vaccine mandates for businesses &amp; health care workers.\n\nBiden’s mandates are hurting MT small businesses, threatening rural health care centers &amp; forcing workers out of jobs—they must be reversed immediately.","date":"Wed Jan 05 23:29:27 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Hey @SenJohnHoeven—it takes a herd of bison to take down a single bobcat. \n\nYou’ll look great rockin’ a @MSUBobcats_FB jersey after we beat @NDSUfootball in the #FCSChampionship this weekend. \n\nGo CATS! https://t.co/WcjF8lclqm","date":"Wed Jan 05 19:39:26 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Touchdown ⁦@Tommy_Mellott⁩! Go CATS!  https://t.co/sIFjA4jOoR","date":"Wed Jan 05 15:23:41 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Schumer &amp; the Dems are trying once again to pass a federal takeover of our elections that would undermine voter ID laws &amp; spend taxpayer dollars on elections—efforts the American people don’t support. \n\nIt’s not about \"voting\" rights, it never was. It's a power grab by the Left.","date":"Tue Jan 04 20:10:30 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"This is the first year the @MSUBobcats will be playing in the national championship since 1984—the year I graduated from MSU! Go CATS — Beat the Bison!","date":"Tue Jan 04 17:29:53 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Let’s GO CATS!","date":"Tue Jan 04 17:08:18 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Great news for our Navy SEALs and for the defense of freedom of religion.","date":"Tue Jan 04 00:16:49 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Former @FDICgov Chair Jelena McWilliams was a strong and well-qualified leader. It is unacceptable that CFPB Director @chopracfpb abused his power and forced her out against her will, which destroys the 88-year history of political independence at the FDIC.","date":"Mon Jan 03 23:24:34 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana ranchers must be able to compete on a level playing field. \n\nWe need to fully investigate allegations of price fixing and market manipulation, increase transparency in the cattle markets and hold big packers accountable — all things I’m working to get done.","date":"Mon Jan 03 17:10:05 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana’s open for business!","date":"Sun Jan 02 22:40:35 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy New Year! May you and your family have a happy &amp; healthy year.","date":"Sat Jan 01 16:05:00 +0000 2022","user_id":"11651202"},{"handle":"SteveDaines","text":"One year with @JoeBiden &amp; America got:\n\n⛽️A war on Made in America energy\n📈Highest inflation in nearly 40 years\n❌A southern border crisis \n🚘Sky-high gas prices\n💉Overreaching federal vaccine mandates","date":"Thu Dec 30 16:20:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@GovGianforte knows—we must manage our forests before they manage us. \n\nVery glad to see that under Gianforte’s leadership, Montana doubled forested acres treated to prevent catastrophic wildfires and support timber jobs.","date":"Wed Dec 29 20:01:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats’ reckless “Build Back Broke\" tax and spending spree will make the inflation crisis much worse and leave Montana farmers &amp; ranchers like Susan in the dust. https://t.co/bopOYzD5zi","date":"Wed Dec 29 18:48:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"So thankful to call Montana home. https://t.co/6dEXu7LTz7","date":"Wed Dec 29 15:55:33 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Ya don’t say, @JoeBiden. \n\nNow it’s time to reverse all of your overreaching federal vaccine mandates.","date":"Tue Dec 28 21:18:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"New analysis shows gas prices will continue to soar in 2022. \n\n@JoeBiden &amp; the Democrats’ inflation crisis and war on Made in America energy is costing Montana families. Big time.","date":"Tue Dec 28 16:39:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s simple—U.S. citizens should be the only people voting in U.S. elections. \n\nSadly, far-Left states and cities have moved to disenfranchise Americans by allowing non-citizens to participate in our elections. Glad to work with Senator @marcorubio to put a stop to this.","date":"Mon Dec 27 19:26:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s inflation crisis is shrinking the paychecks of all Montanans.","date":"Mon Dec 27 15:11:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Merry Christmas from the Daines family to yours! https://t.co/gWGklBJs53","date":"Sat Dec 25 15:00:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Christmas Eve in Montana today. Santa’s starting line-up getting rested up. #picfromthepickup https://t.co/AgzvmLY29g","date":"Fri Dec 24 21:21:32 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s overreaching vaccine mandates are unlawful, unconstitutional &amp; harmful to Montana businesses and our economy. \n\n#SCOTUS must reverse Biden’s big government mandates.","date":"Thu Dec 23 12:42:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Was an honor to visit with Montana service members at @341MissileWing this afternoon. \n\nWe cannot thank them enough for their sacrifice and dedication to protecting our great nation.🇺🇸 https://t.co/40GICN5BeC","date":"Thu Dec 23 00:33:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent the afternoon with @SecAFOfficial at @341MissileWing in Great Falls. We must do all we can to support the mission at Malmstrom &amp; the brave men and women protecting Montana &amp; our nation. https://t.co/GR3bNhTj6T","date":"Wed Dec 22 23:47:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Met with MT truckers in Helena this morning &amp; heard firsthand how catastrophic @JoeBiden’s vaccine mandates will be for their businesses, employees &amp; our nation's inflation and supply chain crisis. \n\nI won't stop fighting back against Biden’s overreaching mandates. https://t.co/ZjuP7kgiR9","date":"Wed Dec 22 18:41:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’d take Manhattan, MT over Manhattan, NY any day. Broadus &amp; Chester over Brooklyn &amp; Chicago, and so on. \n\nI’m glad to stand with every single one of my Republican colleagues and @Sen_JoeManchin to oppose @JoeBiden’s reckless “Build Back Broke” tax and spending spree.","date":"Tue Dec 21 19:00:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The disdain liberal Hollywood elites have for hardworking American families and Rural America is unconscionable.","date":"Tue Dec 21 18:53:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I proudly #BacktheBlue. \n\nWe must do everything we can to defend not defund the brave men and women in law enforcement.","date":"Mon Dec 20 23:41:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Walls work. @JoeBiden’s open border policies don’t. \n\nWe need to finish building the wall and secure our southern border.","date":"Mon Dec 20 15:04:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Early Christmas present for MT families! \n\nWhile @JoeBiden’s multitrillon dollar reckless tax &amp; spending spree bill has hit the toughest road block yet, we’ve got to keep up the fight against Biden and the Left’s big government, wasteful spending agenda. https://t.co/GRJ9ENv7XX","date":"Sun Dec 19 18:43:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Heavy heart this morning to hear about the passing of Senator Isakson. Cindy and I send our condolences to his family, friends and loved ones. He was a good man.","date":"Sun Dec 19 16:03:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@MSUBobcats are heading to Texas for the National Championship! @GovGianforte https://t.co/bkKeELFNpw","date":"Sat Dec 18 22:37:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Go Cats!   ⁦@MSUBobcats⁩ https://t.co/W4E6Je0hVu","date":"Sat Dec 18 19:02:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is a huge blow to Montana businesses. @JoeBiden’s overreaching vaccine mandates will crush the private sector and force workers out—they are unconstitutional and the Supreme Court must hear this case. https://t.co/G2NfkApiXL","date":"Sat Dec 18 02:43:28 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is open for business under @GovGianforte’s leadership.","date":"Fri Dec 17 19:09:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you @ToysForTots_USA for bringing the joy of the Christmas season to children across America! https://t.co/wCLu4s50Ys","date":"Fri Dec 17 16:12:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This move by the Biden admin to make dangerous do-it-yourself abortions by mail available without medical oversight is reckless. It's yet another attempt to put the agenda of the abortion industry above innocent lives &amp; women’s safety.\nhttps://t.co/1EIcWPhvif","date":"Fri Dec 17 00:24:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"No, @JoeBiden. Montana families don’t want to pay for your woke, big government agenda.","date":"Thu Dec 16 22:09:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden — build the wall. Secure our southern border.","date":"Thu Dec 16 19:48:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"About time. \n\nGlad my call to end the outrageous idea of giving hundreds of thousands of taxpayer dollars to illegal immigrants who broke the law was successful. \nhttps://t.co/mESI8g9SWu","date":"Thu Dec 16 19:28:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"NEWS: My bill to honor the 13 American heroes who gave the ultimate sacrifice to defend our freedoms during the chaotic withdrawal from Afghanistan has been signed into law.\n\nThese brave men &amp; women will forever be remembered with Congressional Gold Medals.","date":"Thu Dec 16 17:48:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hey @SenatorRounds—big game this weekend between @MSUBobcats and @GoJacksSDSU.\n\nI'll tell ya one thing, I’ve never seen a bobcat run away from a jackrabbit. Go CATS! https://t.co/51Ehivo6N2","date":"Wed Dec 15 23:13:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This morning I honored Hunter Jones from Will James Middle School with a tribute in the Congressional Record. \n\nFor 20 years, Mr. Jones has been supporting Montana veterans and teaching his students to honor those who serve our country and defend our freedoms. #MontanaProud https://t.co/9H3BOfJ7hg","date":"Wed Dec 15 21:13:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The bipartisan defense bill, the NDAA, will give our troops a much-deserved pay raise, help support @341MissileWing &amp; the @GuardMontana, and ensure our Montana servicemembers remain the best equipped forces in the world. \n\nThis bill is good for Montana &amp; good for America","date":"Wed Dec 15 18:46:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Preview of Saturday’s game in Bozeman GO CATS!  ⁦@MSUBobcats⁩ ⁦@montanastate⁩ https://t.co/X10jF6S15h","date":"Wed Dec 15 18:21:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Always great meeting with @MTFarmBureau to discuss what needs to be done to help support MT farmers and ranchers. One important thing we must do is stop @JoeBiden and the Democrats’ multitrillion dollar reckless tax and spending spree. https://t.co/Oj5fqknXob","date":"Wed Dec 15 17:52:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s America: Overreaching vaccine mandates hurting small businesses &amp; workers. Skyrocketing inflation. Supply chain crisis. https://t.co/dJopD54sG8","date":"Wed Dec 15 15:33:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@aaronflint @erikjiverson @ThielmanJason I stand with Aaron Flint. #gloveboxstrong","date":"Wed Dec 15 14:05:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@aaronflint @ThielmanJason Hard to find good help","date":"Wed Dec 15 13:58:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@aaronflint @ThielmanJason Glove box","date":"Wed Dec 15 13:43:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Fiscal madness. \n\nA reality created by @JoeBiden and the Democrats.","date":"Tue Dec 14 22:44:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The “Build Back Broke” bill is a liberal wish list for @JoeBiden, Pelosi and Schumer—not the American people.","date":"Tue Dec 14 14:33:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden &amp; the Democrats’ “Build Back Broke” plan, the cost of childcare for many hardworking Montana families will increase by $13,000.","date":"Mon Dec 13 22:39:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy 385th birthday to the @USNationalGuard! Today &amp; every day we are thankful to all who serve our great nation, especially those serving in the @GuardMontana. https://t.co/U3dJ2QWDXc","date":"Mon Dec 13 20:45:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s southern border crisis is still wreaking havoc on our families &amp; communities.","date":"Mon Dec 13 15:15:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"CATS WIN!! Touchdown Tommy leads the way to a great 42-19 victory!  Headed for the semifinals.","date":"Sun Dec 12 04:52:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's overreaching vaccine mandate will hurt our workers &amp; jack prices even higher by making our ongoing supply chain crisis worse. https://t.co/7vTXJ6OP5M","date":"Sat Dec 11 16:41:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"To the Democrats who claim they’ll only vote for @JoeBiden’s reckless tax &amp; spending spree if it’s “paid for” — the American people are looking at you, and they know it’s not.","date":"Fri Dec 10 16:47:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The @USCBO shows that the true cost of @JoeBiden &amp; the Democrats’ reckless tax &amp; spending spree will increase the national debt by $3 TRILLION. \n\nThe Democrats cannot continue to lie to the American people that this is “paid for.” It’s NOT.","date":"Fri Dec 10 16:47:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m grateful that #SCOTUS's decision allows the Texas Heartbeat Act to stand as litigation continues. This law is saving countless lives each day it stays in effect. Our fight to protect all life, no matter how small, is only just beginning.","date":"Fri Dec 10 15:27:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This morning's new inflation numbers are the worst we've seen in nearly 40 years. \n\nOutrageous that @JoeBiden &amp; the Democrats are trying to throw gasoline on this inflation fire with their reckless tax &amp; spending spree.","date":"Fri Dec 10 14:53:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is up 6.8%. \n\nMake no mistake—this is a direct result of @JoeBiden &amp; the Dems wasteful spending policies, and their multitrillion reckless tax and spending spree bill will make matters much, much worse.\n\nMT families cannot afford this. https://t.co/mRI1k9lR4T","date":"Fri Dec 10 13:44:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is a tax on ALL families, and those who can afford it the least, feel it the most.","date":"Thu Dec 09 22:25:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats want to pass their multitrillion dollar reckless tax &amp; spending spree filled with liberal policies that will bankrupt our communities &amp; families.","date":"Thu Dec 09 19:44:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed catching up with @MTAGKnudsen today to talk about issues impacting Montana like @JoeBiden’s overreaching vaccine mandates &amp; the Democrats' reckless tax and spending spree.\n\nAlways a pleasure to spend time with Montana leaders in Washington, D.C! https://t.co/Yq4CAMeGNP","date":"Thu Dec 09 18:51:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to the men and women serving at the @341MissileWing for being honored with this high distinction for the fourth year in a row! Your hard work does not go unnoticed and all of us in Montana are grateful for your service.","date":"Thu Dec 09 17:26:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Dems want to pass their multitrillion dollar reckless tax &amp; spending spree filled with liberal policies that will bankrupt our communities &amp; families.","date":"Thu Dec 09 16:55:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m glad to see the Senate pass my effort with @SenatorBraun to strike down @JoeBiden’s vaccine mandate on private businesses. \n\nI will not stop fighting until ALL of Biden’s mandates are reversed.","date":"Thu Dec 09 01:26:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Got an exclusive copy of @JoeBiden’s Christmas album! https://t.co/egW7x9cmVk","date":"Wed Dec 08 20:12:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden needs to reimpose sanctions and block the Russian Nord Stream 2 pipeline he cleared earlier this year. \n\nBiden must demonstrate strength on the world stage to deter thugs like Putin, not empower them. The world is watching.","date":"Wed Dec 08 16:05:02 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"All of @JoeBiden’s overreaching vaccine mandates must be reversed. They will hurt Montana small businesses and force people out of work.","date":"Wed Dec 08 15:36:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"If @JoeBiden really wants to hold Putin &amp; Russia accountable, he should reverse his terrible decision to green light the Nord Stream 2 pipeline and support American energy and jobs, not Russian. \n\nDoing so will also help support Ukraine and our allies.","date":"Tue Dec 07 23:31:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden has made America look weak on the world stage and has opened the door for more aggression by our adversaries, including Russia.","date":"Tue Dec 07 23:31:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I voted NO on Chris Magnus’ nomination to lead the @CBP. He won't stand up to @JoeBiden and do what’s necessary to stop the #BidenBorderCrisis.","date":"Tue Dec 07 22:56:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s vaccine mandates are bad for Montana businesses &amp; workers, including federal contractors like Homestead Helicopters in Missoula.\n\nWhile I’m glad to see this mandate blocked nationwide today, we won’t let up the fight. https://t.co/3PR2B4t3AH","date":"Tue Dec 07 22:33:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"About time.","date":"Tue Dec 07 20:54:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s vaccine mandate for federal contractors threatened workers across MT, like our wildland fire fighters who put their lives on the line to protect our communities. \n \nGlad to see this mandate blocked. We must keep up the fight.https://t.co/3YiMkRd7Lf","date":"Tue Dec 07 18:36:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you @RMEF for presenting me with the Excellence in Advocacy Award for my work on conservation and forest management. I look forward to continuing our work together to increase public access to public lands and protect our Montana way of life! https://t.co/L1kMYVmYlu","date":"Tue Dec 07 16:48:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week there was a lot of talk about a government shutdown... what we should be talking about is what @JoeBiden is doing to shutdown small businesses with his overreaching vaccine mandates.","date":"Tue Dec 07 15:57:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’d also like to recognize &amp; thank a great MT hero, Charlie Dowd of Anaconda. 80 years ago today, he acted with unimaginable courage &amp; uncommon valor. It was an honor to present him with a tribute in the Congressional Record in 2018 for his service at Pearl Harbor. #MontanaProud","date":"Tue Dec 07 15:40:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As we commemorate the 80th anniversary of #PearlHarbor, let us never forget those who paid the ultimate price for our freedom and all those who served in WWII.\n\nWe are home of the free because of the brave.🇺🇸","date":"Tue Dec 07 14:32:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We must stand with Israel &amp; do whatever we can to help them in their fight against terrorism. This includes not giving another penny to the Palestinian Authority so long as they continue their “pay to slay” program that rewards terrorists for carrying out acts of terrorism. https://t.co/L9VvAqhPKu","date":"Mon Dec 06 23:41:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The science is clear. The grizzly bear has recovered in the Northern Continental Divide Ecosystem. We should celebrate this accomplishment, delist the grizzly bear &amp; return management back to Montana as the law intends. \n\nThank you @GovGianforte for your leadership.","date":"Mon Dec 06 22:45:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden on his way to ruin Christmas with his reckless tax &amp; spending spree. https://t.co/JvwVGr6sy1","date":"Mon Dec 06 21:22:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Under Trump &amp; Republican leadership, we cut taxes that unleashed the economy, helped middle-class families &amp; created jobs. The data proves it.\n\n@JoeBiden and the Democrats’ reckless tax &amp; spending spree will do the opposite.","date":"Mon Dec 06 20:15:25 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"🇺🇸🇮🇱","date":"Mon Dec 06 17:34:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week will be remembered as a turning point in our nation's history that heralds the dawning of a new day in America where we recognize the God-given dignity &amp; potential of life.\n\n#SCOTUS must overturn Roe v Wade. https://t.co/nWtQZ8Z1AM","date":"Mon Dec 06 15:07:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"On Day One, @JoeBiden declared war on Made in America and Made in Montana energy. Now, Montana families are suffering the consequences. https://t.co/WrGLHIPcpH","date":"Sun Dec 05 19:45:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Senator Dole was a true statesman and inspired us all with his dedication to serving the American people. America lost a hero today. May he Rest In Peace.","date":"Sun Dec 05 17:48:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Geneva Consensus Declaration affirms the universal, unchanging principles of life, family &amp; sovereignty. \n\nDespite @JoeBiden removing the U.S. from the Declaration, Americans strongly support these values. I’ll always fight for their voice and push to rejoin the Declaration. https://t.co/9e0XuYuDzJ","date":"Sat Dec 04 16:02:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana businesses can't afford @JoeBiden's overreaching vaccine mandate, especially as we head into the holiday season. \n\nI'll keep fighting to protect our businesses and workers. https://t.co/x66uYvrmFY","date":"Fri Dec 03 21:08:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Remember, it was @JoeBiden who gave the green light to Putin’s Nord Stream 2 pipeline strengthening Russia and weakening Ukraine and our allies in the region.","date":"Fri Dec 03 19:18:44 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hardworking Montana families are paying the price for @JoeBiden and the Democrats’ failures.","date":"Fri Dec 03 18:29:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"On one hand, @JoeBiden wants to supersize the IRS by adding 87,000 new agents to beef up audits on working class families. \n\nOn the other, Biden is doing nothing to support our Border Patrol agents doing everything they can to combat the border crisis he created.","date":"Fri Dec 03 15:43:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’ve heard from Montanans across the state that @JoeBiden’s vaccine mandates will force workers out of a job &amp; shut down small businesses.\n\nIt’s very disappointing to see Senate Democrats vote against our effort to stop Biden’s overreaching mandates.","date":"Fri Dec 03 02:14:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@DCCC and the Democrats must think the American people are stupid. They’re not.","date":"Fri Dec 03 01:04:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans are standing strong against @JoeBiden’s overreaching vaccine mandate, which threatens to cripple Montana hospitals, hurt our healthcare workers and hinder patient access to care. https://t.co/bBIvrdLq6D","date":"Thu Dec 02 22:05:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent my morning with Chairman Frank White Clay &amp; Crow Leadership to discuss important issues facing the Crow Tribe like the need for economic development on the reservation. https://t.co/AxxnbypaGv","date":"Thu Dec 02 18:04:57 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"My prayers are with the community of Denton and the first responders fighting to save homes and property from the fire. I am closely monitoring this situation, and I have been in touch with Fergus County officials. https://t.co/m5ZCsFs7sc","date":"Thu Dec 02 00:35:58 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to join so many pro-life Americans today outside of #SCOTUS. Our nation’s pro-life community is stronger than ever, and our fight has only just begun! https://t.co/FYA5iEMB4U","date":"Wed Dec 01 22:16:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Terrible situation for the Madison River and Montana’s fisheries. I’ll be working with @GovGianforte and Northwestern Energy to ensure folks on the ground have what they need to get the situation under control.","date":"Wed Dec 01 21:19:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m greatly encouraged by oral arguments today in the Dobbs case. #SCOTUS must return the issue of abortion to the People’s Representatives and send Roe v. Wade to the ash heap of history.","date":"Wed Dec 01 21:00:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m monitoring the fire outside of Great Falls, and I’ve been in contact with Sheriff Slaughter and folks on the ground about the situation. I'm very thankful for the first responders who responded so quickly and who are working to keep families safe. https://t.co/MfWAQmlhOW","date":"Wed Dec 01 18:02:28 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We’re minutes away from #SCOTUS hearing oral arguments on the most monumental pro-life case in decades.\n\nThis is a pivotal point in our nation’s history &amp; Americans everywhere are listening. #EmpowerWomenPromoteLife","date":"Wed Dec 01 14:38:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Tonight I joined @StudentsforLife outside of #SCOTUS ahead of one of the most important days in our decades-long fight to protect life. We prayed for a future America where ALL life is protected. https://t.co/qGBnNs5LLf","date":"Wed Dec 01 03:11:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#SCOTUS must end the extreme judicially-imposed abortion regime of the United States which is aligned with China and North Korea. https://t.co/NonHHRAdAc","date":"Tue Nov 30 23:39:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"BIG news for Montana. @JoeBiden's overreaching vaccine mandate threatens Montana hospitals, Montana healthcare workers and Montanans seeking access to essential care. We must keep up this fight.","date":"Tue Nov 30 22:57:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Since Roe v. Wade, 62 million innocent babies have been victims of abortion.\n\nIt’s long past time we overturn this injustice and put an end to this dark era in America's history.","date":"Tue Nov 30 16:33:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The right to life is the most fundamental, unalienable God-given right.\n\nWe must protect ALL life, no matter how small. #ModernizeOurLaw","date":"Tue Nov 30 15:02:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This #GivingTuesday, let’s remember to support all of our community organizations and neighbors that make Montana the Last Best Place.","date":"Tue Nov 30 14:13:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Try telling Montana families they have to buy an electric vehicle just to afford getting around town.","date":"Mon Nov 29 22:58:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m proud to be pro-life. \n\nWe are days away from a pivotal point in our nation’s history as #SCOTUS will hear opening arguments on the most important challenge to Roe v Wade of our generation. https://t.co/bF60t5eGhQ","date":"Mon Nov 29 17:57:59 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Wishing a Happy Hanukkah to all Montanans and those celebrating around the world!","date":"Sun Nov 28 22:46:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana small businesses bring our communities together, create good-paying jobs &amp; make our main streets special.\n\nToday on #SmallBusinessSaturday, and every day, be sure to support your favorite local Montana small business.","date":"Sat Nov 27 16:24:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana small businesses make our hometowns great. Make sure to visit one of your favorite mom &amp; pop shops across Montana tomorrow in honor of #SmallBusinessSaturday!","date":"Sat Nov 27 02:09:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy Thanksgiving from the Daines family. We are so thankful to be welcoming our third grandchild next month! https://t.co/oow9EyAQWa","date":"Thu Nov 25 15:00:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s overreaching vaccine mandate is bad for Montana small businesses and workers. https://t.co/IJ2XMqHx8A","date":"Wed Nov 24 20:01:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Under #Bidenflation, your paychecks are being stretched thinner and thinner. Inflation is a tax on ALL Americans, and the American people are feeling the pain.\nhttps://t.co/wlLSU1zF37","date":"Wed Nov 24 15:51:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"A week from today, #SCOTUS will hear oral arguments on Mississippi’s life-saving 15 week law. \n\nAmerica will be listening as the Supreme Court has the chance to honor the dignity of human life.","date":"Wed Nov 24 14:58:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden killed the Keystone XL pipeline and stopped oil &amp; gas leases on federal lands, then had to beg OPEC for more oil and now he’s trying to cover up his damage by tapping into emergency reserves.\n\nSeems like there’s an easy solution here: support Made-in-America energy.","date":"Tue Nov 23 18:58:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is trying to clean up the mess he’s made but it won’t work. Americans know that he is the reason they’re facing such high energy and gas costs. \n\nIf Biden really wanted to lower prices, he’d support American energy production, but he doesn’t.\nhttps://t.co/o4fwn115Km","date":"Tue Nov 23 15:05:44 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"You can’t fool the American people, @JoeBiden.","date":"Tue Nov 23 00:09:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s inflation crisis is hurting families who can afford it the least.","date":"Mon Nov 22 22:28:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m leading the fight in the U.S. Senate against @JoeBiden’s outrageous plan to give hundreds of thousands of taxpayer dollars to illegal immigrants who broke the law.\n\nThe fight isn’t over yet. We can’t let these taxpayer funded handouts become a reality.\nhttps://t.co/zwCmY4UhJt","date":"Mon Nov 22 18:20:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy 35 years to my sweet wife Cindy. https://t.co/3qUOEJCLwf","date":"Mon Nov 22 17:10:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana families can’t afford @JoeBiden and the Democrats' reckless tax &amp; spending spree. https://t.co/xYBBGrjqMu","date":"Mon Nov 22 16:13:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you for your service to Montana, @SgtPatrick127. #MontanaProud","date":"Sun Nov 21 15:29:33 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Growing up in a house divided, the #BrawloftheWild has always been my favorite game of the year. GO CATS! https://t.co/BGERjxICgb","date":"Sat Nov 20 16:08:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"My team is ready for the best rivalry in college football, and our office, the #BrawloftheWild game. \n\nGo Cats! https://t.co/zPN76AlBjs","date":"Fri Nov 19 20:52:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Small businesses make up 99% of Montana businesses &amp; they make our hometowns feel like home. \n\nI'm thankful for the hard work of Montana small business owners and workers and will always support our mom &amp; pop shops. https://t.co/t9hvuCPxro","date":"Thu Sep 23 18:28:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The American people: \n\nWe need to secure our southern border and bring down the skyrocketing costs of energy, gas and groceries. \n\n@JoeBiden: https://t.co/quTHBEdgc8","date":"Fri Nov 19 16:26:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats’ reckless tax &amp; spending spree is socialism on a runaway train that will increase the national debt by hundreds of billions of $ and set off a hyperinflation bomb that will make rising prices even worse. It must be stopped in the Senate.","date":"Fri Nov 19 15:22:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Securing our border isn’t a game, but @JoeBiden and Border Czar @KamalaHarris are handing out YOUR taxpayer dollars like it’s Monopoly money. https://t.co/tJsoTP7G3a","date":"Fri Nov 19 03:02:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Border security IS national security.","date":"Fri Nov 19 02:26:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Just now, Senate Democrats blocked my effort to stop @JoeBiden's $450,000 taxpayer funded payouts to illegal immigrants who broke the law. \n\nWhat a slap in the face to the American people.","date":"Fri Nov 19 02:23:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The numbers are in from the @USCBO: @JoeBiden and the Democrats’ reckless tax and spend bill will add nearly $800 BILLION to the debt over 5 years. \n\nTheir bill will exacerbate the inflation crisis we're facing under Biden, and hardworking American families will pay the price.","date":"Thu Nov 18 23:55:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hear from Sheila Leigland of Great Falls on what my bill means to her and so many others in the disabled community. https://t.co/0w2wJ3zX4K","date":"Thu Nov 18 21:38:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"There's dignity &amp; hope in work—we should be doing all we can to support Americans with disabilities in the workforce, not treat them unfairly. \n \nI’m teaming up with @SenBobCasey on a bipartisan bill to ensure people with disabilities are never paid below the minimum wage.","date":"Thu Nov 18 21:38:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Updated numbers—Montana families are expected to spend over 45% more to heat their homes this winter. \n\nWhy? @JoeBiden's inflation crisis and anti-American energy policies.","date":"Thu Nov 18 20:19:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The lengths @JoeBiden's nominee Professor Omarova will go to walk back her radical statements. Incredible. https://t.co/a0gJ4ptBQK","date":"Thu Nov 18 17:30:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MT law enforcement &amp; first responders put their lives on the line every day to protect our families and communities. I'm glad to see my bill to ensure these men and women and their families receive our full support signed into law. \n\nIn Montana, we always #BackTheBlue.","date":"Thu Nov 18 16:26:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"NEWS: The U.S. Senate just passed my bipartisan bill to posthumously award Congressional Gold Medals to the 13 brave American service members killed during the terrorist attacks in Afghanistan.\n\nMy bill now heads to the President’s desk to be signed into law.","date":"Thu Nov 18 02:35:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent the afternoon showing the U.S. Capitol to Montana students from Cut Bank High. It’s great to see these bright, young Montanans interested in learning more about our nation’s history and the role of the government. https://t.co/OXaIUP6DHm","date":"Wed Nov 17 22:50:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"With @JoeBiden in the White House &amp; Dems in control of Congress, our southern border is wide open, families are paying more for everything and America is weaker on the world stage.","date":"Wed Nov 17 20:55:28 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@JoeBiden Glad to join @SenatorBraun in this fight.","date":"Wed Nov 17 20:39:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's overreaching vaccine mandate is hurting MT businesses and workers. My Republican Senate colleagues and I are challenging this big government, top-down mandate &amp; we only need ONE Democrat to stand with us. https://t.co/3Kgezw3TvQ","date":"Wed Nov 17 20:35:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’d take it from the Coach on this one.","date":"Wed Nov 17 18:57:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana ag was hit hard by tough drought conditions this year. Today I sat down with Montana sugarbeet growers to discuss how we can continue to get critical relief to Montana producers &amp; support this important part of Montana's economy. https://t.co/Q2KcB4NwlO","date":"Wed Nov 17 17:44:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats are launching cash cannons of money we don’t have into the economy pouring fuel on the inflation fire. We can’t let this continue.","date":"Wed Nov 17 15:17:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats’ multitrillion dollar reckless tax &amp; spending spree bill raises taxes on working class Montana families and cuts taxes for the rich. #BuildBackBroke","date":"Tue Nov 16 22:39:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is outrageous. We should not be giving illegal immigrants who broke the law any taxpayer money. \n \nI’m leading efforts in the Senate to block this craziness from @JoeBiden and his admin. https://t.co/Y6gZfSQDtY","date":"Tue Nov 16 21:06:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I fully support @MTAGKnudsen's effort to block @JoeBiden's overreaching COVID vaccine mandate that will cripple Montana's health care workforce and impact Montanans seeking medical care.","date":"Tue Nov 16 19:45:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is what happens when @JoeBiden makes America weaker on the world stage. https://t.co/hYRoSVXnep","date":"Tue Nov 16 17:46:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanksgiving dinner and Christmas celebrations are shaping up to be some of the most expensive holidays in history. \n\nThanks, @JoeBiden.\nhttps://t.co/qbX9jZJeKi","date":"Tue Nov 16 17:15:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans don’t want the federal government more involved in their lives—that’s exactly what @JoeBiden’s “Build Back Broke” plan will do.","date":"Tue Nov 16 14:25:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MT’s health care heroes have been on the frontlines of the COVID-19 pandemic since the beginning.\n\nNow, @JoeBiden’s big gov vaccine mandate will force health care workers out of their jobs, crippling rural MT hospitals &amp; clinics. It must be reversed. https://t.co/EnXhRhwsQJ","date":"Mon Nov 15 20:35:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Come January, @JoeBiden will force essential workers crossing our northern border to have proof of a COVID-19 vaccination. \n\nAt the same time he doesn’t think the thousands of illegal immigrants crossing our southern border need to do the same. The hypocrisy is unreal.","date":"Mon Nov 15 17:26:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I always love when Montanans visit Washington, DC! Showing folks like Jacob and his mom from Choteau around the U.S. Capitol never gets old. https://t.co/uLvHcCDoeL","date":"Sat Nov 13 16:15:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@CNBC: Consumer sentiment hits 10-year low while workers quit jobs in record numbers\nhttps://t.co/uv4JhrAdWZ","date":"Fri Nov 12 23:39:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Counting down the days until the greatest game in college football, the Brawl of the Wild. @CollegeGameDay—you know what to do. #GrizOnGameDay","date":"Fri Nov 12 18:44:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Because of @JoeBiden’s anti-American energy agenda &amp; reckless policies that have led to skyrocketing inflation, most MT families are expected to pay 20% more to heat their homes this winter. \n \nThe Dems’ reckless tax &amp; spending spree bill will only increase prices even more.","date":"Fri Nov 12 14:33:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"God bless our Montana heroes and their families. 🇺🇸 https://t.co/s0S4dWFeUT","date":"Thu Nov 11 22:57:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This week, members of the Crow Nation represented the rich legacy of service carried on by Montana’s Tribal communities at the centennial commemoration of the Tomb of the Unknown Soldier. #MontanaProud \nhttps://t.co/lUt1wK2BQc","date":"Thu Nov 11 18:12:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It was an honor to spend Veterans Day in Belgrade this morning with so many Montana heroes who bravely served our great nation. 🇺🇸 https://t.co/pxTOCDerKj","date":"Thu Nov 11 16:42:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy Veterans Day to the brave men and women who selflessly chose country over self. May we never forget that freedom is not free, and may God bless the United States of America. 🇺🇸","date":"Thu Nov 11 14:01:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#Bidenflation is worse in MT than almost anywhere else. Montanans are getting absolutely pummeled with rising prices across the board. \n\nWe should support families in rural America, not drown them in inflation which is exactly what @JoeBiden is doing. https://t.co/PkQjei6PQr","date":"Thu Nov 11 01:46:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I even got to take a taste of Scobey, Montana to India! Lentil Crunchers from Farver Farms were a big hit. https://t.co/jIaKMvf91q","date":"Wed Nov 10 19:59:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As a member of @SenFinance with jurisdiction over trade, developing relationships with India’s top trade officials &amp; India’s pulse crop importers will go a long way towards ensuring MT ag is at the top of the discussion during the trade forum later this month.","date":"Wed Nov 10 19:59:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to meet with Minister @PiyushGoyal to discuss leveling the playing field &amp; reducing barriers to India's market for MT producers.\n \nMT is the #1 producer of pulse crops in the US &amp; India is the #1 consumer of pulse crops in the world. This is a critical market for MT famers. https://t.co/Cmzur65k56","date":"Wed Nov 10 19:59:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s war against Made in America energy is front and center with this new nominee. \n\nBiden’s anti-American energy agenda means higher prices for families, less reliable energy sources and weaker national security.","date":"Wed Nov 10 17:06:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is a tax on all families.","date":"Wed Nov 10 15:44:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"For 246 years, the United States Marine Corps has been answering the call to defend our country and our freedoms. \n\nFrom a proud son of a U.S. Marine of the 58th Rifle Company, Happy Birthday @USMC! #SemperFi https://t.co/viGY8SzMqV","date":"Wed Nov 10 14:56:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, inflation reached a 30 year high. With the tax and spending agenda underway from @JoeBiden and the Democrats, it’ll only get worse. \n\nMontana families are feeling the pain of rising prices thanks to @JoeBiden. When will it stop?","date":"Wed Nov 10 13:47:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This week, I met with Indian Minister of Commerce and Industry @PiyushGoyal, other top trade officials and pulse importers in India to talk about MT ag. \n\nWe must increase access and remove trade barriers to India’s market to level the playing field for MT pulse crop producers. https://t.co/JR00Dc8lF6","date":"Tue Nov 09 23:37:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As @JoeBiden and the Democrats keep up with their tax and spend agenda, prices keep rising and paychecks keep shrinking.\n\nMontana families cannot afford these reckless policies. #Bidenflation https://t.co/xsxka4RbhD","date":"Tue Nov 09 18:18:32 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden wants your tax dollars to fund abortions. \n\nHe also wants to give hundreds of thousands of your tax dollars to illegal immigrants who broke the law.","date":"Tue Nov 09 16:28:57 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud","date":"Mon Nov 08 21:03:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Because of @JoeBiden’s policies, Mexican cartels are running the southern border.","date":"Mon Nov 08 19:52:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The crisis on our southern border created by @JoeBiden is only getting worse. When will the President actually step up and do something to protect our communities &amp; families?","date":"Mon Nov 08 19:29:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s war on American energy continues. This will only mean higher prices for American families. \n\nWe need an all of the above energy portfolio.","date":"Mon Nov 08 18:30:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy 132nd Birthday to the Last Best Place. Forever grateful to call Montana home. https://t.co/ircpWCgNTQ","date":"Mon Nov 08 13:47:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"“I may be the first woman member of Congress, but I won’t be the last.” —Republican Jeannette Rankin\n\n105 years ago today, MT made history by sending Rankin to the U.S. House of Representatives. Her passion, drive &amp; legacy of service continue to inspire young Montanans today.","date":"Sun Nov 07 19:23:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"How about those @MSUBobcats!  Go Cats!","date":"Sun Nov 07 01:43:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Very good news for small businesses and workers. \n\n@JoeBiden’s overreaching vaccine mandate must be stopped. Glad to see it blocked by the 5th Circuit.","date":"Sat Nov 06 18:44:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Everything is costing more for families across the country. @JoeBiden &amp; the Democrats' reckless tax and spend policies will only make things worse. https://t.co/yD5XopWWeN","date":"Fri Nov 05 17:41:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats’ reckless tax and spending spree is big gov &amp; socialism on a runaway train.","date":"Fri Nov 05 15:48:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hey @CollegeGameDay — want to see the greatest rivalry in college football? Come see the Brawl of the Wild in Montana. \n\nGo Cats! #GrizOnGameDay","date":"Fri Nov 05 14:55:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden &amp; the Democrats want to drop a hyperinflation bomb on the economy. American families can’t afford it. https://t.co/zMaXmEcfNx","date":"Thu Nov 04 21:21:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We cannot tax &amp; spend our way into prosperity and economic growth. \n\nWe need lower taxes, fewer regulations and more freedoms.","date":"Thu Nov 04 17:44:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Stay tuned, folks!","date":"Thu Nov 04 17:14:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Kicked off my morning visiting with Jacob from Choteau High School and his mom! https://t.co/5YsZiZTbBu","date":"Thu Nov 04 16:00:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"For over a year, we’ve done everything we can to help small businesses keep their doors open and get folks get back to work. \n\n@JoeBiden’s vaccine mandate will close business doors and force workers out.","date":"Thu Nov 04 14:12:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s big government mandate will hurt MT small businesses &amp; workers. \n\nWhile I will keep urging Montanans to talk to their doctor &amp; get a COVID vaccine, I’ll continue to fight back against these mandates. https://t.co/G92YtkslVy","date":"Thu Nov 04 13:34:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Shot:                        Chaser: https://t.co/a8vmkNqgpu","date":"Thu Nov 04 00:20:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's plan to send hundreds of thousands of dollars to illegal immigrants is a gut punch to the American taxpayer. \n\nWe won't stand for it. https://t.co/eZzhUNhLz4","date":"Wed Nov 03 21:53:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations again, @GlennYoungkin! The RED tsunami is just beginning. https://t.co/nsZZPMUybe","date":"Wed Nov 03 18:01:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Constitution is clear: the right of the people to keep and bear arms shall not be infringed. #2A","date":"Wed Nov 03 17:36:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana parents have made their voice heard loud and clear! \n\nGlad to see the Montana School Boards Association stand up for Montana parents &amp; students.\nhttps://t.co/zVw614wOYd","date":"Wed Nov 03 16:29:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Republicans want to create American jobs, support American small businesses and promote American made energy.\n\nDemocrats want to send jobs overseas, waste taxpayer dollars, empower China &amp; Russia and support foreign energy.","date":"Wed Nov 03 12:32:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The people of Virginia made it clear tonight: Americans want leaders that will stand up for our country, freedoms and parents, not the far Left agenda—that’s exactly what @GlennYoungkin will do. \n\nCongratulations on the BIG win, Governor-elect Youngkin.","date":"Wed Nov 03 01:08:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see my bipartisan resolution recognizing Montana’s wildland firefighters &amp; first responders PASS the Senate!","date":"Wed Nov 03 00:03:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The science is clear. The grizzly has recovered &amp; it’s time to put management back in the hands of Montanans.\n\nI encourage Senate Democrats, especially those from Western states, to join my efforts to delist the grizzly bear &amp; return control back to MT. https://t.co/q19ZCXHx8s","date":"Tue Nov 02 22:53:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Brawl of the Wild is by far the best rivalry in college football—come see for yourself @CollegeGameDay.\n \nI know folks are using #GrizOnGameday... but GO CATS!! https://t.co/v42esKxcza","date":"Tue Nov 02 21:51:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Will they be giving tips on how to actually afford Thanksgiving dinner in the midst of #Bidenflation?","date":"Tue Nov 02 19:25:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"No shock here. \n\nRepublicans support pro-America, pro-growth and pro-family policies. \n\n@JoeBiden and his cronies do the opposite.","date":"Tue Nov 02 18:52:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's new mantra—economic death by overregulation. \n\nHis wide-sweeping methane initiative is merely a guise for big gov takeover. Every single sector of our economy will be impacted from energy to agriculture.","date":"Tue Nov 02 18:26:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Honored to receive the Patriot Award from @MatureAmericans. I will always work to support Montana seniors &amp; fight to defend faith, family and freedom. https://t.co/a7w3Z3cSAt","date":"Tue Nov 02 18:01:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As @JoeBiden continues to virtue signal abroad, we lead the world in absolute reduction of emissions bc of American innovation. Meanwhile, China’s enviro &amp; human rights standards are some of the worst in the world. \n\nDespite this, Biden’s policies make us more dependent on them.","date":"Tue Nov 02 16:37:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The answer is always freedom, never socialism.","date":"Tue Nov 02 13:45:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Taxpayer dollars for abortions—that’s what @JoeBiden and the Democrats’ reckless tax &amp; spending monstrosity allows. https://t.co/djNtjZzDsD","date":"Tue Nov 02 12:00:33 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana’s wildland firefighters &amp; first responders put their lives on the line to protect MT families, homes and communities from deadly fires. \n \nToday, I reintroduced a bipartisan Senate resolution to honor these MT heroes. https://t.co/oyZQTCYyKV","date":"Wed Oct 20 20:37:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana will always be grateful for Senator Mansfield’s service. https://t.co/d2ti5HP3k9","date":"Mon Nov 01 23:16:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Paid my respects to a great Montanan, Senator Mike Mansfield, this afternoon. \n\nHe honorably represented Montana as the longest serving Senate Majority Leader &amp; as a United States Marine. https://t.co/gunoyfjRfC","date":"Mon Nov 01 23:10:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats want to supersize the IRS and hire over 80,000 new agents to do it. \n\nDems want bigger government and they want the IRS to have more control over your finances &amp; everyday life.","date":"Mon Nov 01 20:32:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Democrats’ motto – the bigger the federal government, the better. \n \nRepublicans’ motto – more freedom, less government.\n \nI think most Americans prefer the latter.","date":"Mon Nov 01 19:06:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"American families will be spending an extra $4,600 this year alone thanks to #Bidenflation. \n\nPrices are rising and paychecks are shrinking—inflation is a tax on ALL Montanans &amp; we can't afford @JoeBiden's wasteful spending policies.","date":"Mon Nov 01 18:12:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"House Dems are gearing up to vote on @JoeBiden’s reckless tax &amp; spending spree without knowing how much it costs American families. They’re doing this because once families find out how much it will actually cost them, they'll fight back. #NoScoreNoVote","date":"Mon Nov 01 16:48:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"All eyes are on #SCOTUS today as America listens to oral arguments on the Texas Heartbeat Act.\n\nThis law saves lives and should absolutely be upheld.","date":"Mon Nov 01 15:31:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden should be more disappointed in the inflation &amp; energy crisis he’s created at home in America. https://t.co/LhbTE11xiY","date":"Mon Nov 01 02:04:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Stopped by the new Chabad Lubavitch Center for Jewish Life and Learning in Bozeman today. \n\nI always enjoy spending quality time with my good friend Rabbi Chaim Bruk. https://t.co/EQRTJFc5ms","date":"Sun Oct 31 23:28:33 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans want MORE freedoms and LESS government, wasteful spending &amp; taxes. https://t.co/i2q0C04WuE","date":"Sun Oct 31 20:10:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Yep. Whichever way the Democrats spin it, it’s fiscal insanity.","date":"Sun Oct 31 16:24:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"All it takes is ONE Senate Democrat to stand up for what’s right and put an end to this Bernie, Pelosi &amp; @JoeBiden dream bill. One comes to mind, and he’s from Montana.","date":"Sat Oct 30 01:25:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans are fired up against the Democrats’ multitrillion dollar reckless tax &amp; spending spree bill! \n\nFolks are sick &amp; tired of @JoeBiden’s far-Left policies that are taking our country down the path of socialism &amp; driving up the cost of everything from groceries to gas. https://t.co/ypp38X4u6m","date":"Sat Oct 30 01:25:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I suggest Senate Democrats spend a little bit of time in Montana before they push partisan, unprecedented policies on our behalf. \n\nThe science shows Montanans know best how to manage species in our own backyard and gray wolves are thriving.\nhttps://t.co/dzFp9i9nBA","date":"Fri Oct 29 17:36:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hey partner! It only takes one Senate Democrat to put the kibosh on the entire reckless tax &amp; spending bill in the first place. \n\nInstead of claiming small wins here and there, why not stand with me and say no to Schumer and Biden on this package altogether!","date":"Thu Oct 28 21:12:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans and the American people are literally paying for @JoeBiden’s open border policies. \n\nI’m introducing a measure to block\nthis from happening.","date":"Thu Oct 28 20:41:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is insane. \n\nWhile Montanans are struggling to put gas in their tank and food on the table, @JoeBiden is planning to pay illegal immigrants hundreds of thousands of dollars. https://t.co/5iw5ZsRrRd","date":"Thu Oct 28 20:29:59 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Looks like the IRS $600 snooping provision is in the Democrats’ big government, reckless tax &amp; spending spree bill. \n\nThe Democrats want to expand the federal government and insert it into every aspect of your life. \n\nThis is crazy.","date":"Thu Oct 28 20:16:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy Halloween from Team Daines!","date":"Thu Oct 28 19:00:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats will push the narrative that the new “framework” of their reckless tax &amp; spending bill is a \"compromise.\"\n\nWe’re still talking about $1.75 TRILLION. This is not a compromise. This is fiscal insanity, and it’s a Trojan horse for socialism.","date":"Thu Oct 28 17:20:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Dems are still in disarray. As they try to hammer out the details of their multitrillion $$$ reckless tax &amp; spending spree, MT families are just trying to figure out how they’re going to pay for gas, heat their homes and pay for Thanksgiving dinner. \n\nDemocrats are out of touch.","date":"Thu Oct 28 15:55:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Proud to stand with @SenatorLankford in our commitment to defend all life, at home and abroad. https://t.co/G88MreAsDd","date":"Thu Oct 28 15:28:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, and every day, I'm thankful for Montana first responders who put their lives on the line to protect our families and communities. #NationalFirstRespondersDay https://t.co/jGaf1qHRvP","date":"Thu Oct 28 14:22:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Agree.","date":"Wed Oct 27 22:51:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you to my colleagues @HawleyMO, @BenSasse &amp; @SenJohnKennedy for shining a light on this vicious attack on MT parents in today's @SenJudiciaryGOP hearing.\n\nMontana parents will not be silenced or intimidated by @JoeBiden!","date":"Wed Oct 27 20:17:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and AG Garland are weaponizing the federal government to go after MT parents. We should be doing all we can to support parents in their effort to defend their children &amp; hold school boards &amp; public officials accountable.\nhttps://t.co/EZjvlRo44W","date":"Wed Oct 27 20:17:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed catching up with @SuptArntzen today to talk about important issues facing Montana parents and students like the recent attacks on the right of parents to speak up at school board meetings. \n\nWe should be doing all we can to empower MT parents, not silence them. https://t.co/63pv7AL8JD","date":"Wed Oct 27 18:33:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I'm glad to see the U.S. House pass my bipartisan bill to honor the 13 American service members tragically killed in Afghanistan. Now it’s time for the U.S. Senate to pass it and show they stand united with these brave American heroes. https://t.co/TS0lA21LAS","date":"Wed Oct 27 16:47:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Instead of going overseas to Glasgow for some virtue signaling, I’d suggest @JoeBiden go to Glasgow, Montana to see the impacts that his reckless policies and skyrocketing inflation are having on hardworking families &amp; rural communities.","date":"Wed Oct 27 14:23:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The only way the Democrats can fund their radical, socialist agenda is by strapping our children &amp; grandchildren with trillions of dollars in debt or by raising taxes. No one wins.","date":"Tue Oct 26 23:40:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In MT, we have a rich history of service, and today, many Montanans proudly carry on this legacy. \n\nOn this Day of the Deployed, let us honor the sacrifices of the Montana heroes &amp; their families who selflessly serve our nation. We are the land of the free because of the brave!🇺🇸 https://t.co/kmLOqlbVOh","date":"Tue Oct 26 18:38:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Democrats are trying to make America poor, cold and weak on the world stage.","date":"Tue Oct 26 15:59:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Pretty sure most Montanans are more concerned with what you’re doing to address the skyrocketing cost of filling up their pick-up or putting food on the table.","date":"Mon Oct 25 22:45:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Whether it's at the grocery store or the gas pump, Montanans are feeling the sting of sky high inflation every day. \n\n@JoeBiden and the Democrats’ policies are making it worse &amp; adding fuel to the inflation fire. Unacceptable.\nhttps://t.co/bct83GWfyl","date":"Mon Oct 25 14:41:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"What the Biden admin isn't telling you:\n\nAmerican innovation has allowed us to lead the world in absolute reduction of emissions. \n\nMeanwhile, China's emissions continue to rise.\n\n@JoeBiden's radical agenda is taking us backwards, not forward.","date":"Sun Oct 24 19:37:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Conservation is engrained in our Montana way of life. Montanans don’t need the federal government telling them how to manage our lands. That’s why I proposed a blueprint for responsible, effective conservation for Montana. https://t.co/YdXfBcRbYN","date":"Sat Oct 23 16:43:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We need answers from @JoeBiden. \nhttps://t.co/RynfsduQ6q","date":"Fri Oct 22 20:50:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Texas Heartbeat Act is saving precious lives every day it continues to be in effect. This life-saving law must be upheld. https://t.co/JmIyToM1Lq","date":"Fri Oct 22 18:15:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanks to @GovGianforte, Montana is open for business and thriving!","date":"Fri Oct 22 16:28:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Crisis at the southern border. Rising crime. Disastrous Afghanistan withdrawal. Sinking economy. \n\n@JoeBiden’s policies are devastating. Enough is enough. https://t.co/Alvck9rJN1","date":"Fri Oct 22 14:51:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats’ radical policies are shutting down Made in America energy projects and killing our energy independence.\n\nGreat to join members of the Domestic Energy Producers Alliance today to talk about the importance of supporting American energy &amp; innovation. https://t.co/Z87fQfRlmE","date":"Thu Oct 21 19:51:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to see that India has reached 1 billion doses of the COVID 19 vaccination. What an achievement! https://t.co/9JIMXmcng8","date":"Thu Oct 21 17:19:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Caught up with MT's 2020 &amp; 2021 Teachers of the Year today!\n\nMs. Borge and Ms. Rost are two of our most outstanding educators in Montana. https://t.co/LTdgLP2AS0","date":"Thu Oct 21 16:02:25 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It was great visiting with Gallatin High School principal Mrs. Schnee this afternoon as we recognize this October as National Principals Month. Thank you for investing in our next generation and shaping the minds of Montana students! https://t.co/TGMqhfoXFn","date":"Wed Oct 20 23:19:02 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It was great to show Havre High students around the U.S. Capitol today! They all have bright futures ahead of them. https://t.co/m9ZI56rth1","date":"Wed Oct 20 22:12:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Ag is Montana’s biggest economic driver, and in MT, we produce some of the best beef, wheat, barley and other commodities in the world. \n\nThanks to @GovGianforte—our MT farmers and ranchers will be able to better strengthen their relationship with the Taiwanese.","date":"Wed Oct 20 21:49:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana’s wildland firefighters &amp; first responders put their lives on the line to protect MT families, homes and communities from deadly fires. \n \nToday, I reintroduced a bipartisan Senate resolution to honor these MT heroes. https://t.co/oyZQTCYyKV","date":"Wed Oct 20 20:37:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Dems’ latest attempt to assert federal control over our elections undermines state voting laws &amp; makes it easier to cheat. It’s just another power grab.\n\nDems know they can’t win without rewriting the rules in their favor.\n\nNot going to happen.","date":"Wed Oct 20 16:08:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see the Senate pass my resolution recognizing the importance of 4-H. \n\nMontana's 4-H students aren't only future leaders of MT ag, they're future leaders of our country. https://t.co/2abZ9BVut3","date":"Wed Oct 20 14:29:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The last thing Montanans want is the IRS spying on their bank account. \n\nWhether it's $600 or $10,000, the IRS shouldn't be sticking their nose in the lives of everyday Montanans. https://t.co/T33EjUIUzj","date":"Tue Oct 19 19:55:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Free exercise of religion is a constitutional right, period. Glad to stand with my colleagues to protect this fundamental right.","date":"Tue Oct 19 16:29:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Going live on @foxandfriends. Tune in! https://t.co/4dKjnrQR21","date":"Tue Oct 19 12:15:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden must take this seriously, investigate reports and stand up to China.\n\nWe must maintain our edge in technology and nuclear deterrence, not empower other nations to do so.","date":"Tue Oct 19 00:44:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Supporting the mission at Malmstrom Air Force Base in Montana will bolster our national security and help the U.S. counter China and its aggression.","date":"Tue Oct 19 00:44:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"For 45 years, the Hyde Amendment has been the law of the land and protected taxpayers from funding abortions. \n\nDemocrats are now attacking this bipartisan protection. Their partisan effort will be dead on arrival when it comes to the Senate floor.","date":"Mon Oct 18 20:33:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Too often, Big Tech uses its power to crush competition &amp; manipulate the marketplace.\n\nOur bipartisan bill will level the playing field &amp; ensure MT biz owners have full access to online marketplaces to create jobs &amp; support local economies. https://t.co/IhblGcVJq9","date":"Mon Oct 18 16:46:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Because of #Bidenflation, Montanans are paying: \n\n⛽️42% more for gas\n🥩18% more for beef\n💡5% more on their electricity bills\n\n@JoeBiden &amp; the Democrats’ reckless tax and spend policies are squeezing everyone’s pocketbooks dry.","date":"Fri Oct 15 18:56:57 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MT’s Job Corps centers provide valuable hands-on training &amp; educational opportunities that are best experienced in-person. I’m glad to see @USDOL finally listen to my request &amp; allow new students to join their peers in the classroom. This is great news for MT jobs &amp; all students!","date":"Fri Oct 15 17:02:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Democrats are on a mission to change the rules and pack #SCOTUS in their favor to impose their radical agenda on Montanans and the American people. \n\nThat’s the entire purpose of @JoeBiden’s court packing commission. \n\nNot going to happen.","date":"Thu Oct 14 23:45:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations @KevinRobertsTX! Look forward to working with you and the entire @Heritage team to continue bringing conservative ideas to the United States Senate.","date":"Thu Oct 14 17:04:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Child molesters should never be able to receive a taxpayer funded pension. \n\nMy bill would guarantee this. https://t.co/sfSBgi2rw9","date":"Thu Oct 14 15:19:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I was saddened to hear the news of Chief Earl Old Person passing away. He was a great Montanan and a great American. My prayers are with his family, friends and the entire Blackfeet Nation. It was an honor to know him. https://t.co/5F0IC2Qtbi","date":"Thu Oct 14 02:44:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The crisis on our southern border is out of control. Thousands and thousands of illegal immigrants have been released into our country with no accountability.\n\nWhere is the leadership and action when America needs it @JoeBiden? https://t.co/Q2an87Jxtf","date":"Wed Oct 13 19:06:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As prices keep rising, Montanans' paychecks keep shrinking. \n\n@JoeBiden &amp; the Democrats’ $3.5 trillion reckless tax &amp; spending spree will only make things worse. https://t.co/FojiziBHZa","date":"Wed Oct 13 15:33:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see @JoeBiden finally listen to my months-long push &amp; take the first step to reopen the northern border. MTns will finally get some of the relief they’ve been seeking for months.\n\nNow I urge @JoeBiden to end all northern border restrictions—MTns are depending on it.","date":"Wed Oct 13 13:40:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@Google once again showing their unjust bias against conservative speech and organizations. \n\nThis is no mistake—it’s an attempt to silence opposition. We can not let this form of discrimination continue. https://t.co/AFiE8MXPgQ","date":"Wed Oct 13 00:12:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Last week, Senate Dems blocked my bill to require @JoeBiden to reopen the northern border. \n\nEnough is enough. No more putting politics above the well-being of MTns. \n\nCongress must pass my bill w/ @RepStefanik to reopen the northern border—MTns can't wait any longer. https://t.co/G4vYmAR7CJ","date":"Tue Oct 12 21:28:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy #NationalFarmersDay to all of Montana’s hardworking farmers, including my son-in-law, Brad!\n\nThankful for all their work to keep ag MT’s biggest economic driver and part of our way of life. https://t.co/zFu8IMxpbD","date":"Tue Oct 12 14:01:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy homecoming weekend @MSUBobcats. #GoCatsGo https://t.co/BLUUiCFsz5","date":"Sat Oct 09 16:17:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great news. This will save countless lives.","date":"Sat Oct 09 03:00:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Kids like Ryle make our world a better place—his family wouldn't be complete without him. Every life has God-given dignity and potential. https://t.co/gJa42FbYO7","date":"Fri Oct 08 15:27:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This #DownSyndromeAwarenessMonth is a time for us to celebrate the joy and light that those with Down syndrome bring into our world. We must honor and protect every life, no matter how many chromosomes they may have.","date":"Fri Oct 08 15:27:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Another disappointing result of @JoeBiden’s terrible agenda and policies. \n\nBiden &amp; the Democrats’ reckless tax &amp; spending spree will only make this worse.","date":"Fri Oct 08 13:58:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Tonight I voted against fiscal insanity. Washington needs to get its fiscal house in order. \n\nIt’s irresponsible for Congress to increase the nation’s debt limit without taking any steps to actually reduce the debt itself…especially when the Dems plan to spend trillions more.","date":"Fri Oct 08 01:26:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans and the American people know that money doesn't grow on trees—who's going to tell @JoeBiden &amp; the Democrats? https://t.co/XhiZK72Nbt","date":"Fri Oct 08 01:10:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Tonight I went to the Senate floor to push for a vote on my bill that requires the Biden admin to reopen the northern border.\n\nSenate Dems blocked it and instead, continued to back @JoeBiden’s policies that hurt MT workers, small businesses &amp; families.\n\nI won’t give up the fight.","date":"Fri Oct 08 00:24:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden is failing America on both borders. https://t.co/vcZLsZTy5d","date":"Thu Oct 07 21:39:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Texas Heartbeat Act saves countless lives. One activist judge should not stop states from exercising their right to protect all life, no matter how small. Now more than ever, we must stand strong in our fight for life. https://t.co/sQXNuRgWfL","date":"Thu Oct 07 20:17:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Balance of thought and diversity of ideas is being erased at the EPA. @JoeBiden is on a mission to silence anyone who disagrees with him and the far Left.\nhttps://t.co/AjhfF3tWQb","date":"Thu Oct 07 18:13:02 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In MT, 950 women will be diagnosed with breast cancer this year alone. We know screenings save lives—so let’s remind our loved ones to get screened. \n\nDuring #BreastCancerAwarenessMonth we support Montanans diagnosed with breast cancer &amp; their families. https://t.co/DdtRFoR4Pr","date":"Thu Oct 07 14:26:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is a northern border state with a southern border crisis. Illegal drugs are tearing apart MT families and communities, and @JoeBiden refuses to address the crisis of his making.\n\nI’m glad to have a partner in @GovGianforte as we work to address &amp; combat this issue.","date":"Wed Oct 06 19:09:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Frivolous litigation brought on by obstructive groups coupled with arduous bureaucratic processes are once again blocking badly needed forest management projects in Montana and putting good-paying timber jobs at risk. \nhttps://t.co/BNvmGamhmy","date":"Wed Oct 06 16:06:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We cannot allow this to continue. Active forest management is key to reducing the risk of catastrophic wildfires and as we saw from this wildfire season, we need more forest management not less.","date":"Wed Oct 06 16:06:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Conservation is part of our MT way of life—the best stewards of our lands are those closest to them.\n\nThe Western Conservation Principles initiative uses science-based, locally-driven practices to bring about real conservation outcomes unlike @JoeBiden’s vague 30x30 initiative.","date":"Tue Oct 05 18:44:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Totally out of control.","date":"Tue Oct 05 17:51:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Labeling parents as threats because they hold elected school board members accountable for what's going on in the classroom is a clear attempt to silence political opposition.","date":"Tue Oct 05 14:29:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Abortion is not family planning, it’s family destruction. \n\nThis move is yet another disgusting example of @JoeBiden propping up the abortion industry on the taxpayer's dime. https://t.co/pqasQLlw44","date":"Mon Oct 04 22:06:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m pro-vaccine but anti-mandate.\n\n@JoeBiden’s mandate will hurt MT small businesses like Bozeman based Simkins-Hallin and will discourage folks from getting the vaccine. https://t.co/PTAKLvMWkl","date":"Mon Oct 04 18:04:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's disastrous withdrawal from Afghanistan failed U.S. troops and left us more vulnerable to terrorist attacks. \n\nThere must be accountability. The American people deserve answers. https://t.co/QtPdxwAck5","date":"Mon Oct 04 14:30:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud \nhttps://t.co/IXDDfnAjF0","date":"Sat Oct 02 20:09:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats are in complete disarray. https://t.co/YI7nHLRuT4","date":"Thu Sep 30 15:37:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"About to join @MorningsMaria on @FoxBusiness! Tune in.","date":"Thu Sep 30 12:04:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Proud to join my friend @DonaldJTrumpJr to endorse @HerschelWalker to be the next U.S. Senator from Georgia. We need more fighters like Herschel to help us take back the Senate!","date":"Wed Sep 29 23:44:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Caught up with folks from the Montana Ag Business Association today about how we can continue to work together to address issues facing MT farmers &amp; ranchers. \n\nAs MT's top economic driver &amp; part of our way of life, I'll always fight for Montana ag. https://t.co/0mqwuF4ttp","date":"Wed Sep 29 19:42:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In the face of danger, Daniel Hutchinson didn't hesitate to step up and lead folks to safety. His actions after the Amtrak accident were heroic. #MontanaProud\nhttps://t.co/xDrj0bY1A5","date":"Wed Sep 29 15:58:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden and the Democrats’ $3.5 trillion reckless tax &amp; spending spree will raise taxes across the board. Don’t let them tell you otherwise.","date":"Tue Sep 28 20:45:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to Arlee High School science teacher Mr. Bill Stockton on being named the 2022 Montana Teacher of the Year! Bill's enthusiasm and passion for teaching has no doubt inspired countless young Montanans. Thank you, Bill, for being a great example for all MT teachers!","date":"Tue Sep 28 19:44:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Completely reckless.","date":"Tue Sep 28 19:17:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The @USPS provides critical services for Montanans—especially for our rural communities, our veterans and our business owners.\n\nEnjoyed visiting with Montana Postmasters Tedrick and Newsome today to discuss the importance of the USPS to MT. https://t.co/9umpBJyITV","date":"Tue Sep 28 17:37:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great morning catching up with @DonaldJTrumpJr! https://t.co/jWnjWBKA9N","date":"Tue Sep 28 15:46:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m glad to see the tracks safely reopened after this weekend’s Amtrak derailment in Joplin. I’ll continue to keep a close eye on this situation. https://t.co/kWgbw52HEn","date":"Tue Sep 28 13:48:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As we come out of this pandemic, I'll keep working to pass policies that support local jobs, businesses and breweries—not the Democrats’ $3.5 trillion reckless tax &amp; spending spree that would kill jobs and hurt economic growth.","date":"Mon Sep 27 22:16:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to talk with folks at @beerinstitute's annual meeting to discuss the importance of supporting all breweries, big &amp; small. \n\nNot only do MT breweries support nearly 16,000 jobs—we are also one of the top barley producers in the nation.\n\nCheers to MT beer producers! https://t.co/w3NLgvHiN0","date":"Mon Sep 27 22:16:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's southern border crisis just keeps getting worse. \n\nIt's past time we secure our southern border.","date":"Mon Sep 27 21:06:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In the face of the terrible Amtrak accident this weekend in Joplin, I’m glad to see Montanans come together to support the passengers and offer help when needed. As the investigation continues, I’ll continue to monitor the situation and keep those impacted in my thoughts.","date":"Mon Sep 27 15:48:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"If you have questions about friends or family who were aboard the train that derailed in Joplin, call Amtrak’s hotline: 800-523-9101","date":"Sun Sep 26 02:56:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Tragic news. I am thankful for the first responders already on the scene and praying for the safety of all involved. I am closely monitoring this situation as details emerge. https://t.co/TeBa6dqjxK","date":"Sun Sep 26 00:39:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy National Public Lands Day and National Hunting and Fishing Day! Whether it’s backpacking in the Beartooths or fishing on the Yellowstone—Montana’s public lands will always be a national treasure. Get outside and enjoy the great outdoors today! https://t.co/v7s6feTHXJ","date":"Sat Sep 25 19:12:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m disgusted, but sadly not surprised, to see House Dems’ complete disregard for human life today. \n\nTheir bill isn’t about protecting women’s health—it’s about making abortion on demand the law of the land. \n\nWe must stand up for all life, no matter how small.","date":"Fri Sep 24 18:15:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Our border patrol agents work day in and day out to protect our country, families and communities from illegal drugs and illegal immigrants. \n\nGod bless them for their service.🇺🇸 https://t.co/HyiprvwKu7","date":"Thu Sep 23 20:35:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see the U.S. Senate pass my bipartisan resolution to recognize September 13 - September 17th as National Small Business Week.","date":"Thu Sep 23 18:28:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Small businesses make up 99% of Montana businesses &amp; they make our hometowns feel like home. \n\nI'm thankful for the hard work of Montana small business owners and workers and will always support our mom &amp; pop shops. https://t.co/t9hvuCPxro","date":"Thu Sep 23 18:28:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is a northern border state with a southern border crisis.\n\nWe MUST secure our southern border and fix the disaster caused by @JoeBiden.","date":"Thu Sep 23 18:02:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The use of body parts from aborted babies for research is unimaginable and downright repulsive. \n\nI'm demanding a full investigation into these inhumane actions that show a complete disregard for human life. Every life matters—no matter how small.","date":"Thu Sep 23 13:11:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In yet another pursuit of their radical agenda, House Dems voted to cut critical funding for Israel's Iron Dome—a defense system that protects innocent lives from terrorist attacks.\n\nThis is morally indefensible.","date":"Wed Sep 22 23:05:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Hindering Israel's ability to defend itself and protect innocent lives emboldens Iran—the world's leading sponsor of terrorism.\n\nWe must stand with Israel, not against them. 🇺🇸🇮🇱","date":"Wed Sep 22 23:05:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Speaking with Montana students always brightens my day. These young Montanans from Ekalaka High School have a bright future ahead of them! https://t.co/4zv6eFFwEF","date":"Wed Sep 22 22:20:28 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden promised \"relentless diplomacy\" but what the American people are really getting is relentless weakness from their Commander in Chief. https://t.co/msAikzjCmM","date":"Wed Sep 22 19:32:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy 100th, Betty! \n\nHope you've had the chance to visit some of Montana's national parks. If not, let's make it happen!","date":"Wed Sep 22 16:08:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden, we have an open southern border and it’s overflowing with illegal drugs and illegal immigrants, many unvaccinated and COVID+. This is not acceptable. We need to secure our southern border and protect our communities. https://t.co/BpoaciPIy6","date":"Wed Sep 22 15:53:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thank you @GovGianforte, and thank you to the @GuardMontana for helping support Montana hospitals, healthcare heroes and communities.","date":"Tue Sep 21 21:20:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"When CNN reports on @JoeBiden’s list of new crises and problems, you know it must be bad.","date":"Tue Sep 21 19:28:45 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Domestic critical mineral production is vital to Montana. It supports good-paying jobs, generates tax revenue and boosts local economies. \n\nHear from leaders in Sweet Grass County, MT on the benefits critical mineral mining has on their community. https://t.co/DmSZaVcoW9","date":"Tue Sep 21 17:06:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Critical minerals are used in everything from defense to technology &amp; when domestic production is shut down, it threatens our security, kills jobs &amp; makes us dependent on China.\n\nToday in @EnergyGOP, I questioned a @JoeBiden nominee about her plans to support critical minerals. https://t.co/Tjqw03zNLp","date":"Tue Sep 21 16:47:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's border crisis is out of control. @DHSgov is completely overwhelmed because of the lack of leadership &amp; action by the President. https://t.co/dZ73iI3UCw","date":"Tue Sep 21 15:45:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Perhaps a visit to the southern border to fix @JoeBiden’s disastrous border crisis should be her priority. https://t.co/FiCzBq8JBM","date":"Mon Sep 20 21:50:04 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"While I support welcoming Afghan evacuees who helped U.S. troops in Afghanistan for the past 20 years, there absolutely must be a robust vetting process. We need answers from @JoeBiden on this process, including who's coming into our country and why.\nhttps://t.co/h7o9JzV2lR","date":"Mon Sep 20 20:21:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Unless you illegally cross our southern border.","date":"Mon Sep 20 19:01:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"After sustaining serious injuries while fighting a fire in Carbon County, Montana hero, Dan Steffensen, is on the road to full recovery and headed home! I'm thankful for his courage and dedication to protecting Montana communities. https://t.co/iSd75aGUur","date":"Mon Sep 20 18:04:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s inexplicable that @JoeBiden once again extended the northern border closure for MT families, businesses &amp; our economy while the southern border is wide open to illegal drugs &amp; illegal immigrants, many of whom are unvaccinated &amp; maybe COVID+. \n\nThe hypocrisy is unbelievable.","date":"Mon Sep 20 15:51:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Since @JoeBiden continues to put illegal immigrants above Montanans and our northern border communities, Congress needs to pass my bill with @RepStefanik to reopen the northern border NOW.","date":"Mon Sep 20 15:51:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s failed withdrawal from Afghanistan has weakened America and emboldened our enemies. https://t.co/SVVfk5IJUW","date":"Sun Sep 19 20:03:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The situation at our southern border is beyond terrible. Our communities are flooded with illegal drugs &amp; illegal immigrants and our @CBP agents are overwhelmed. \n\nSomething must be done to fix @JoeBiden’s border crisis.","date":"Sun Sep 19 15:20:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is open for business! Thank you, @GovGianforte for leading the Montana comeback.","date":"Fri Sep 17 17:03:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The U.S. Constitution was signed on this day in 1787. Our framers designed it to guide generations to come toward a more perfect union. Today it’s a symbol of liberty &amp; democracy around the world. 234 years later the U.S. remains the greatest nation in the world. #ConstitutionDay","date":"Fri Sep 17 13:00:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@Google's unjust censorship of pro-life views must stop. https://t.co/favteB62KY","date":"Thu Sep 16 17:53:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Wishing an easy fast to all Montanans and those observing Yom Kippur.","date":"Wed Sep 15 23:30:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"13 brave men &amp; women made the ultimate sacrifice to protect Americans &amp; our allies at a critical moment in our nation’s history—they are heroes.\n \nIt's fitting for Congress to express its gratitude in this moment with the Congressional Gold Medal.https://t.co/iGtTQvV1tb","date":"Wed Sep 15 17:42:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Once again Big Tech is silencing and censoring the pro-life movement. This is unacceptable. @Google must reverse their decision now.","date":"Tue Sep 14 22:20:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#Bidenflation has led to record high price increases for American families on everything from gas to groceries. \n\n@JoeBiden and the Democrats’ reckless tax &amp; spending spree is a tax on all families and it's drastically shrinking your paycheck. https://t.co/otAvdq0Bnm","date":"Tue Sep 14 19:30:49 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Enjoyed meeting with the founders of Billings' @APC_Montana in the Senate today. The work they’re doing to support Montana veterans is so important. Great to see them expanding their services in Helena! https://t.co/V7jzJk22p6","date":"Tue Sep 14 17:54:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"America has long led the world in innovation. We must do everything we can to ensure that the conditions allowing our nation to lead continue to exist, especially in #Crypto and blockchain innovation.","date":"Tue Sep 14 16:16:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today at @BankingGOP I plan to ask SEC Chair Gensler about his heavy-handed posture toward #Crypto and blockchain technology.\n\nIt is threatening American innovation, could push jobs overseas and crush our financial prosperity.","date":"Tue Sep 14 14:41:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden's failed withdrawal from Afghanistan made the U.S. look weak &amp; left our allies vulnerable. Now adversaries like China are taking advantage of this failure.\n\nBiden must reassert U.S. strength &amp; stop ceding power to China.\nhttps://t.co/BDsZvRNqiO","date":"Mon Sep 13 20:13:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The U.S. is facing crises on all fronts and @JoeBiden has yet to take responsibility for:\n\n🚨Creating the historic southern border crisis\n\n🚨Causing skyrocketing inflation\n\n🚨Leaving Americans behind in Afghanistan\n\nMontanans deserve accountability from their President.","date":"Mon Sep 13 19:02:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Illegal drugs are tearing Montana families &amp; communities apart and our law enforcement officers have made it clear—the #BidenBorderCrisis is only making things worse. \n\nWe must secure the southern border, support our men &amp; women in blue and stand for the rule of law. https://t.co/IlWkVPBbQE","date":"Sun Sep 12 23:25:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"A great 9/11 tribute at tonight’s ⁦@MSUBobcats⁩ gold rush game.  🇺🇸 https://t.co/KMtzrBg1Dx","date":"Sun Sep 12 02:31:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"See my full remarks on the 20th anniversary of 9/11 here:\nhttps://t.co/8FdfqkU5yA","date":"Sat Sep 11 12:09:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"May today, the 20th anniversary of 9/11, be a day of remembrance and reflection as we go forward with the resilient spirit that has been instilled within us all. #NeverForget 🇺🇸 https://t.co/d8jQL4euFW","date":"Sat Sep 11 12:09:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great time catching up with folks on Montana Talks this morning. They’re in Bozeman this weekend ahead of Gold Rush @MSUBobcats_FB game day! Go Cats! https://t.co/3nItJfZnuv","date":"Fri Sep 10 18:05:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana families &amp; business owners are feeling the pain of #Bidenflation as prices skyrocket from groceries &amp; gas to cars &amp; housing. \n\nYet Democrats are still planning another massive tax &amp; spending spree that will only make things worse. It’s reckless. https://t.co/Ww3a6Gg3OX","date":"Fri Sep 10 14:20:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’ve been opposed to Chipman leading the ATF from the start. He's an anti-2nd Amendment, gun-grabbing radical that should not lead the agency that regulates firearms.\n\nGlad to see @JoeBiden listen to my request &amp; pull this nominee. I’ll always fight to protect MTns’ #2A rights.","date":"Thu Sep 09 13:47:13 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"13 brave service members gave the last full measure helping fellow Americans in crisis during the final hours of our 20-year war in Afghanistan. It's fitting for Congress to memorialize their service with Congressional Gold Medals. https://t.co/VJ69ns3DZu","date":"Wed Sep 08 16:31:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"No Montanan should ever feel like they’re alone—if you or one of your loved ones is struggling right now, know there is help out there. \n\nCall 800-273-8255 to speak with someone today. We’re in this together. #SuicidePreventionWeek","date":"Tue Sep 07 22:45:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In Montana and across the West, we’ve had another terrible wildfire season.\n\nCongress must pass my commonsense forest management bills that will help improve forest health, protect communities from fires, improve wildlife habitats &amp; watersheds and create good paying timber jobs. https://t.co/H8lwpkKgjK","date":"Tue Sep 07 18:32:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Shana Tova to all those celebrating #RoshHashanah! May you and your family have a happy &amp; healthy new year.","date":"Mon Sep 06 23:09:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy #LaborDay to all of the hard working folks that make Montana and this nation prosper.🇺🇸","date":"Mon Sep 06 13:29:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Amazing win @MontanaGrizFB!","date":"Sun Sep 05 16:56:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Since @JoeBiden won’t do what’s right for Montana, Congress must pass my bill with @RepStefanik to open the northern border for MT families, economy and jobs. https://t.co/PER0z69Uii","date":"Sun Sep 05 15:34:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Americans across our great country and Montanans across our great state are thankful for the service and heroism of our veterans who fought in Afghanistan. https://t.co/QBnpjXzv3b","date":"Fri Sep 03 23:00:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"13 heroes bravely gave all to protect Americans and our allies. It's fitting for Congress to recognize their sacrifice in a historical moment for our nation with the Congressional Gold Medal.\nhttps://t.co/dMeHFc6IVV","date":"Fri Sep 03 19:24:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We've been left in the dark about why Americans were abandoned &amp; what's being done to properly vet people coming into our country. We need accountability &amp; answers, and we need them now. https://t.co/MIox7kmJYj","date":"Thu Sep 02 22:30:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"At the same time @JoeBiden’s disastrous Afghanistan withdrawal left Americans &amp; vetted Afghan allies behind enemy lines, there are concerning reports of criminals taking seats on evacuation flights.","date":"Thu Sep 02 22:30:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is a tremendous victory for life! The Texas Heartbeat Act will save countless unborn babies from the violence of abortion. Every child is precious and deserves the full protection of the law.\nhttps://t.co/td1ZP1FFrr","date":"Wed Sep 01 21:13:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden leaves the southern border open to illegal drugs &amp; immigrants but refuses to open the northern border to MT families. \n\n@RepStefanik &amp; I are calling on Schumer &amp; Pelosi to take action on our bill to open the northern border immediately. \nhttps://t.co/LW1XvwXR0S","date":"Wed Sep 01 13:35:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden taking a victory lap after 13 troops were killed as a result of his disastrous withdrawal and after he abandoned Americans behind enemy lines is beyond shameful.","date":"Tue Aug 31 20:55:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MT veterans are outraged by the chaotic, abrupt withdrawal from Afghanistan. \n\nThere must be accountability for the decisions made that led to the loss of American lives.\n\nTo the heroes who protected our homeland—your service was not in vain. https://t.co/LIkMb1vODp","date":"Tue Aug 31 18:28:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today I had the opportunity to hear from several MT veterans, including many who fought in Afghanistan.\n\nBad policy decisions don’t diminish the years of service &amp; sacrifice MT heroes spent defending our homeland. \n\nWe’re forever grateful for those who fought for our freedoms. https://t.co/e8JiTiReTM","date":"Mon Aug 30 23:27:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Congratulations to newly appointed Libby Mayor Peggy Williams! I look forward to working with you to serve the folks in the community. Libby is lucky to have you! https://t.co/zYVCm0gz9q","date":"Mon Aug 30 20:34:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Spent the morning in Libby with leaders across NW MT talking about the importance of increasing forest management.\n\nThe Lincoln County Stewardship Proposal will boost the local economy, create timber jobs, promote healthier forests &amp; reduce the risk of catastrophic wildfires. https://t.co/7iHQ6LS3HA","date":"Mon Aug 30 20:34:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It was an honor to wish my friend &amp; American hero, Army Sgt. First Class Brian Sharp, a happy retirement this morning. \n\nSFC Sharp was awarded a Purple Heart for his sacrifice in Afghanistan. \n\nOur country and the entire state of Montana are thankful for his service. 🇺🇸 https://t.co/O6EKS9SU8X","date":"Mon Aug 30 18:35:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The next few days will be increasingly dangerous in Afghanistan. Despite this, our U.S. troops are bravely and selflessly continuing their work to evacuate Americans and Afghan interpreters and translators. Always thankful for these heroic men and women.","date":"Fri Aug 27 23:41:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Newest numbers out today show inflation jumped a massive 3.6% in July from a year ago. \n\nWe haven’t seen numbers like this since the 90s. \n\nMontanans cannot afford the Democrats' reckless tax &amp; spending spree. https://t.co/WBSEmBUrKY","date":"Fri Aug 27 15:59:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"May God Bless the United States of America and all those who wear our nation’s uniform. Those who have bravely answered the call to serve our country—we can not thank you enough.","date":"Thu Aug 26 22:48:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It’s outrageous to think that we would put the safety of Americans in the hands of the Taliban. \n\n@JoeBiden has failed America and our allies. This negligence will live in infamy.\nhttps://t.co/nEX9R5zrg5","date":"Thu Aug 26 21:03:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"My thoughts and prayers are with the families of our fallen and wounded service members. This tragedy was entirely preventable. \n\nOur troops are American heroes.","date":"Thu Aug 26 17:19:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Devastating news. Praying for our troops, American citizens and our allies in Afghanistan.","date":"Thu Aug 26 14:29:36 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Better forest management means safer communities, healthier forests, better wildlife habitats, good paying timber jobs &amp; cleaner watersheds. \n\nI'll continue working to cut red tape &amp; prevent extreme environmentalist groups from using fringe litigation to block forest projects.","date":"Thu Aug 26 00:08:31 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We’ve had a terrible fire season in MT—properties damaged, families displaced and communities impacted. \n\nMontanans are sick and tired of breathing in smoke—we need to better manage our forests or they’re going to continue to manage us.","date":"Thu Aug 26 00:08:30 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to join @GovGianforte today to discuss MT’s ongoing battle against wildfires &amp; the importance of increasing forest management.\n\nTo the brave firefighters, first responders &amp; volunteers that work hard to keep MT communities &amp; families safe, we can’t thank you enough. https://t.co/VBXjWbE1oU","date":"Thu Aug 26 00:08:29 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Last year, my historic #GreatAmericanOutdoorsAct was signed into law protecting our national parks for generations to come.\n\nAs the top Republican on the Senate’s National Parks Subcommittee, I'll keep working to promote and protect our parks.","date":"Wed Aug 25 17:20:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Happy Birthday @NatlParkService! America's beautiful national parks set us apart from the rest of the world, and in Montana, we're lucky to have some of the best. \n\nGet outside and enjoy the great outdoors today! #FindYourPark here: https://t.co/h9XQCetwOv https://t.co/CuZhUkGIGV","date":"Wed Aug 25 17:20:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In Montana, we’re lucky to have a diverse energy portfolio with half of our energy coming from hydropower. \n\nMaintaining an all-of-the-above approach for Montana’s energy supply is key to ensuring all Montanans have access to reliable, affordable energy. #HydroDay","date":"Wed Aug 25 00:20:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We need to get all Americans and the brave interpreters &amp; translators who assisted our troops OUT of Afghanistan—the number of which is still unknown. \n\nThat should be the top priority of @JoeBiden—not bowing to the Taliban on their terms and timeline.","date":"Tue Aug 24 23:22:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montanans are fed up with the reckless tax &amp; spending spree by the Democrats — it’s taking money right out of their paychecks. https://t.co/06QCFY2XKF","date":"Tue Aug 24 14:20:26 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is great news! Thanks to #OperationWarpSpeed, COVID-19 vaccines are safe, effective, free AND widely available. I encourage all Montanans to talk their doctor and get vaccinated.","date":"Mon Aug 23 17:24:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The situation in Afghanistan is rapidly declining and thousands of American lives are in serious danger. \n\nOur US forces need the flexibility to protect Americans. \n\nPresident Biden needs to lead &amp; act like the Commander in Chief providing all necessary authority to our military.","date":"Sat Aug 21 18:23:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is a disaster.","date":"Sat Aug 21 17:03:00 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Not even a year in &amp; @JoeBiden has:\n\n⛽️Killed Made in America energy\n❌Created a southern border crisis\n💰Boosted reckless spending\n⬆️Caused soaring inflation\n💸Abandoned the American worker\n🚔 Allowed a spike in violent crime\n🌍Led a disastrous withdrawal from Afghanistan","date":"Sat Aug 21 15:57:47 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This hypocrisy has gone on for too long at the expense of Montanans.\n\nSince @JoeBiden won’t do what’s right for MT, it’s time Congress pass my bill to reopen the northern border immediately.","date":"Fri Aug 20 15:38:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden has once again let down MT families &amp; businesses. His refusal to open the northern border is hurting our economy, jobs and border communities.\n\nMeanwhile, he has allowed our southern border to remain wide open to illegal immigrants and illegal drugs—it makes no sense.","date":"Fri Aug 20 15:38:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We need a steady hand at the helm of the @federalreserve. That’s why I’m urging @JoeBiden to renominate Chairman Powell. \n\nRead why: https://t.co/XpE0M5fs7i","date":"Thu Aug 19 15:24:44 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@MSNBC is smearing pro-life Americans, comparing them to the Taliban. \n\nThey must denounce, retract and apologize for comparing tens of millions of pro-life Americans to the Taliban. Shameful.","date":"Thu Aug 19 00:10:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is yet another example of how the abortion industry puts profits over patients, ignores science, and weaponizes the Courts to thwart the will of Montana voters.","date":"Wed Aug 18 18:46:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This lawsuit is just another attempt by the far Left to force an extreme abortion agenda on Montana. https://t.co/1skdWTJyLL","date":"Wed Aug 18 18:46:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It is despicable that Planned Parenthood is seeking to undo the Montana legislature’s life-saving laws that prevent barbaric late-term abortions on babies who can feel pain, taxpayer funding for abortion, and reckless do-it-yourself abortions by mail.","date":"Wed Aug 18 18:46:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In MT, agriculture is part of our way of life. Our farmers &amp; ranchers work hard every day to put food on the table across the nation &amp; world. \n\nThat’s why I will always fight for the hardworking men &amp; women of MT ag, especially as they face historic drought conditions this year. https://t.co/v2LgYQhKlE","date":"Wed Aug 18 14:01:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"As the Taliban advances, President @JoeBiden retreats to Camp David after his failed withdrawal from Afghanistan. \n\nWhy haven’t we seen more of him? He is failing as our Commander in Chief.","date":"Tue Aug 17 20:15:01 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is in the midst of a devastating wildfire season &amp; it’s important we all stay informed on the conditions in our area. \n\nAs fires continue to burn across our state, track local restrictions and stay on top of fires near you here: \nhttps://t.co/ejJIChKu83","date":"Tue Aug 17 15:07:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This failure has empowered the very terrorists American forces fought for decades, and will make future nations think twice before helping our troops. The 9/11 terrorist attack was first planned by terrorists in Afghanistan—we can’t let a similar tragedy ever happen again.","date":"Sun Aug 15 21:04:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"He withdrew our troops from Afghanistan with no strategy or plan, and it has endangered our armed forces, put American lives at risk, made America less safe and secure, weakened our allies and triggered a humanitarian crisis.","date":"Sun Aug 15 21:04:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"At a time when our country and world greatly needed leadership, @JoeBiden is nowhere to be found.","date":"Sun Aug 15 21:04:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"A Saturday well spent with my son-in-law.  #combining https://t.co/Fnka18ZAFC","date":"Sat Aug 14 18:36:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s DHS @SecMayorkas is just saying what we’ve all known—Biden’s backwards border policies brought us to the breaking point. \n\nHe needs to step up now and get control of the #BidenBorderCrisis, or it will keep getting worse. https://t.co/AVUWLadKhK","date":"Fri Aug 13 18:28:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The historic drought conditions in MT are costing our farmers &amp; ranchers their livelihoods. MT producers feed our country &amp; they need relief now. I won't stop fighting for them.\n\nThis is more than a job—it's a lifetime of work. Hear from a rancher in the Gallatin Valley: https://t.co/vL1tMPCcMv","date":"Fri Aug 13 16:47:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"If @JoeBiden caves to the far-Left’s demands and halts the modernization of America’s nuclear weapons, our national security will be compromised. \n\nHe must reverse this dangerous, misguided plan. https://t.co/93HCVoVAMB","date":"Thu Aug 12 21:28:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden when will you take action to address the historic crisis on our southern border?","date":"Thu Aug 12 19:16:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"American families are facing a wage CUT as #Bidenflation eats away at their paychecks, which simply can’t keep up with skyrocketing prices. https://t.co/PrWffHZx4x","date":"Thu Aug 12 17:40:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Inflation is a tax on ALL families—it’s causing Montanans’ paychecks to shrink &amp; forcing them to pay more everywhere from the gas pump to the grocery store. \n\nYet Democrats are still trying to pass their $4 trillion reckless tax &amp; spending spree.\nhttps://t.co/hy9UM8Ggnj","date":"Wed Aug 11 21:55:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"@smc429 @JoeBiden Perhaps just maybe, thanks to Delta airlines, and those dog gone time zones…I was able to enjoy the DC fireworks and The Beach Boys, from the west side of the US Capitol on July 4, 2018.  And even was in Great Falls, MT on July 5th!  The miracle of air travel.  😊🇺🇸","date":"Wed Aug 11 17:32:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Under @JoeBiden, the U.S. has gone from energy independent &amp; global energy dominant to begging Russia and OPEC to increase oil production to meet global demand.\n\nThis is what happens when you shut down Made in America energy &amp; kill American jobs.\nhttps://t.co/gxk8KHTlcT","date":"Wed Aug 11 16:26:03 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Senate Democrats just voted to allow the most lethal kind of discrimination imaginable: being singled out and brutally killed because of a Down syndrome diagnosis.\n \nEvery life is precious, no matter how small, no matter how many chromosomes they may have.","date":"Wed Aug 11 07:01:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It is heartbreaking that my colleagues across the aisle just voted against protecting babies capable of feeling pain from abortion.","date":"Wed Aug 11 06:36:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Senate Democrats just voted to allow COVID+ immigrants into the United States...in the midst of the #BidenBorderCrisis. \n\nMeanwhile—@JoeBiden refuses to safely reopen the northern border.","date":"Wed Aug 11 05:26:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m proud to see my amendment with @SenatorLankford and @RoyBlunt supporting Hyde protections pass. We must continue working to defeat the Democrats’ radical agenda to force taxpayers to pay for abortions.","date":"Wed Aug 11 02:27:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"By the time the Senate wraps today, Democrats will have voted to spend a mind-boggling $300 BILLION an HOUR with their reckless tax &amp; spending spree.","date":"Tue Aug 10 23:35:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Every single Senate Democrat just voted to support @JoeBiden's ban on new oil and gas leasing on federal lands—killing the jobs and tax revenue that comes with it. \n\nWhen will their war on Made in Montana &amp; Made in America energy end?","date":"Tue Aug 10 20:07:58 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"How to describe the Democrats’ $3.5 trillion tax and spending spree in three words? I'll go first.\n\nReckless. Radical. Unprecedented.","date":"Tue Aug 10 18:20:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats' reckless tax &amp; spending spree is just pouring gas on their inflation dumpster fire. \n\nInflation is a tax on ALL Montanans, and the folks who can afford it the least, feel it the most.\n\nWe must put a stop to the Democrats' spending extravaganza. https://t.co/0Jpt3LH5Na","date":"Tue Aug 10 14:41:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I'm fighting for Montana families, small business owners and workers who depend on cross border travel and pushing my bill to force @JoeBiden to open the Canadian border NOW.","date":"Mon Aug 09 18:33:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Canada is doing the right thing by opening the border TODAY. \n\nInstead of following suit, @JoeBiden is leaving the southern border wide open to drugs &amp; illegal immigrants, many of them COVID+. \n\nEnough is enough.","date":"Mon Aug 09 18:33:41 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today, we take a moment to honor Montana’s veterans and remember the sacrifices they’ve made to defend our nation. #PurpleHeartDay","date":"Sat Aug 07 19:18:15 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I urge my colleagues to support the Wyden-Lummis-Toomey amendment to the infrastructure bill.\n\nIt ensures that Congress, the IRS, &amp; Treasury are not putting their thumb on the scale of any particular tech. The market—and Congress—should encourage competition, not stifle it.","date":"Sat Aug 07 16:12:52 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MTns were told that the 2,700 page bill would not increase the debt. According to @USCBO, we now know that’s untrue.\n\nMTns are dealing with soaring inflation &amp; skyrocketing prices on everything from gas to groceries. This will only heap huge amounts of debt on future generations.","date":"Thu Aug 05 20:20:35 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"A year ago, the biggest win for conservation in 50 years was signed into law—the #GreatAmericanOutdoorsAct. \n\nIt was an honor to champion this bill that will protect MT’s public lands &amp; national parks for generations and to stand next to President Trump as he signed it into law. https://t.co/SAvnWnq1aw","date":"Wed Aug 04 20:51:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We must ALWAYS support the brave men &amp; women in law enforcement. We must DEFEND the police, not DEFUND them.\n\nIf @JoeBiden is serious about combating violent crime, we need nominees who support the police, not anti-police activists.https://t.co/VbhYj8f5pR","date":"Wed Aug 04 17:20:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"David Chipman is an extremist that will weaponize the ATF to go after law-abiding gun owners. His confirmation would be a disaster for the Montana way of life and our #2A rights.","date":"Wed Aug 04 15:30:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is an egregious attack on healthcare providers’ right to follow their moral or religious beliefs. Despicable. \n\n@SecBecerra must stop this abortion extremism and follow the law.\nhttps://t.co/tWe3ZwvZhn","date":"Tue Aug 03 22:49:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Our public lands set us apart from the rest of the world. Make sure to get outside &amp; enjoy the outdoors! #FindYourPark here: https://t.co/oReHTmoXzq","date":"Tue Aug 03 21:57:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Tomorrow marks the one year anniversary of the historic #GreatAmericanOutdoorsAct becoming law. In honor of this landmark conservation bill becoming law, all national parks will have free admission tomorrow!","date":"Tue Aug 03 21:57:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"We need to manage our forests before they manage us. \n\nActively managing our forests will reduce deadly wildfires, protect Montana families and communities, and support Montana timber jobs. https://t.co/IMEFouf5Jj","date":"Tue Aug 03 16:24:18 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great morning visiting with students from Grass Range High School today. \n\nIt always brightens up my day when I get the chance to meet with young Montanans and answer their questions about issues important to Montana. https://t.co/kWnAr45j8w","date":"Tue Aug 03 14:26:37 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Agree. We need to be doing all we can to help support MT ranchers.","date":"Tue Aug 03 01:39:33 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The root cause of the #BidenBorderCrisis is sitting in 1600 Pennsylvania Ave. \n\nOn Day One, @JoeBiden rolled back commonsense immigration polices that worked. Now, illegal border crossings are at a 21 year high and illegal drugs are flooding our communities.","date":"Mon Aug 02 18:28:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is in the middle of a catastrophic wildfire season. In order to reduce the risk of deadly wildfires &amp; protect Montana families, we need to better manage our forests. https://t.co/CCrnGbpyWB","date":"Mon Aug 02 13:55:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Boulder Fire along Flathead Lake in NW Montana is growing quickly. \n\nI’ve been in contact with local officials on the ground, and I’ll continue to monitor this situation. \n\nFor families in the area who need help contact the MT Red Cross. Info below.","date":"Sun Aug 01 22:06:42 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Perhaps the worst tax of all for the American people is inflation—it shrinks everybody’s paycheck. \n\nThis will only get worse if Senate Democrats give @JoeBiden his $3.5+ trillion reckless tax and spend spree bill. https://t.co/DPOBWdWm6T","date":"Fri Jul 30 16:50:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Had a great time showing Montana’s Boys Nation delegates around the U. S. Capitol tonight. These young men are some of Montana’s best &amp; brightest! https://t.co/2scGSMQJOL","date":"Fri Jul 30 02:11:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Every life is precious. Every life should be protected.","date":"Thu Jul 29 21:06:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Biden destroyed thousands of American jobs and turned his back on American families by killing the Keystone XL pipeline. Instead, he’s supporting Russian jobs and a Russian pipeline. https://t.co/FGkedGm3zh","date":"Thu Jul 29 19:27:44 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Great to welcome Montana tribal leaders to D.C. this week. Enjoyed catching up with Blackfeet Chairman Davis &amp; Council members and CSKT Chairwoman Fyant. https://t.co/PSNKFWECtH","date":"Thu Jul 29 17:48:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The pandemic took a toll on Montana jobs &amp; our tourism sector—including our airports. We can't let the effects be long-lasting. \nhttps://t.co/vyuAINST8p","date":"Wed Jul 28 13:42:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I believe Montanans understand commonsense and personal responsibility, and think we should continue to move forward, not backwards.","date":"Tue Jul 27 22:22:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"With that said, I do not support mask mandates and believe the CDC’s new guidance for vaccinated individuals to wear masks indoors will undermine confidence in vaccines.","date":"Tue Jul 27 22:22:21 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"COVID-19 vaccines are safe, effective and FREE, and I continue to encourage all Montanans to get vaccinated to help put this pandemic behind us for good.","date":"Tue Jul 27 22:22:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Opposition to Stone-Manning, @JoeBiden’s @BLMNational nominee, is not about Rs vs Ds—it’s about her obstruction of a federal investigation into a tree-spiking crime &amp; lack of remorse.\n\nEven Obama’s BLM Director believes her past “should disqualify” her.\n\nAll @EnergyGOP R's agree. https://t.co/QT3VZpY9gL","date":"Tue Jul 27 17:19:27 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Red Lodge is actively battling wildfires yet radical groups are delaying projects that can protect communities &amp; reduce fire risk.\n\nOutrageous. Enough with this type of fringe litigation—we need more forest management to prevent deadly wildfires, not less. https://t.co/V2fVYQnkf1","date":"Tue Jul 27 14:07:06 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"This is heartbreaking news. Senator Mike Enzi was a friend, a dedicated public servant and a man that I admired greatly. \n\nCindy and I are thinking of Mike’s family, friends and all of Wyoming during this tough time.","date":"Tue Jul 27 10:21:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Praying for my friend Senator Mike Enzi.","date":"Mon Jul 26 21:31:08 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"In Montana, we support our armed forces. \n\nIt was a privilege to join the Paradise Valley community to honor the lives, service &amp; families of 4 airmen who lost their lives in 1962 in a tragic crash on the newly named B-47 Ridge near Emigrant Peak. https://t.co/0UwYHFu69h","date":"Mon Jul 26 20:24:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@DonaldJTrumpJr: \"You may have never heard of David Chipman, but he is currently the greatest threat to your Second Amendment right to lawfully and responsibly own firearms to protect your property and the people you love.\"\n\nHe’s absolutely right. #2A \n https://t.co/4wNJMldXbu","date":"Mon Jul 26 16:03:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thankful for the Search and Rescue team that was able to locate and safely bring home this firefighter battling the Granite Pass Complex fire. \n\nThese firefighters put their lives on the line every day to protect MT communities and families. https://t.co/s1wky2DMZm","date":"Mon Jul 26 14:39:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Nearly 60 years ago, 4 airmen tragically lost their lives in a crash in Montana on B-47 Ridge. After today, we will be able to forever honor their lives and service with a permanent memorial at the crash site. https://t.co/v5wUUUbznL","date":"Sun Jul 25 03:00:09 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Best of luck to the three Montanans representing our great state and nation in the Tokyo 2020 Olympic Games #MontanaProud! 🇺🇸","date":"Fri Jul 23 18:54:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thankful for all of Montana’s law enforcement officers—including K-9s like Tabasco! https://t.co/Z3zfW1gm46","date":"Fri Jul 23 16:53:05 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Terrible news. I’m praying for a quick and full recovery for the brave firefighters who were injured last night protecting Montana families and communities from fire. Always grateful for Montana heroes on the front lines.","date":"Fri Jul 23 15:39:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanks @GovGianforte and @GuardMontana for taking action to protect our communities. I thank them and our firefighters for their service!","date":"Thu Jul 22 22:02:34 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Montana is on fire, and this fire season is already proving to be catastrophic. We need to do all we can to prevent wildfires and help support our first responders. \n\nTo learn more about fires in your area visit: https://t.co/OobUNGnX2M https://t.co/vJluIpsIms","date":"Thu Jul 22 21:15:58 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I'll tell you who wins with the Democrats' reckless tax and spending spree—China. \n\n#Bidenomics puts American families last. https://t.co/psMFu7yooa","date":"Thu Jul 22 18:35:38 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I voted against @JoeBiden's nomination of Tracy Stone-Manning to head the Bureau of Land Management.\n\nThis follows NEW information that emerged about her involvement in a tree-spiking crime including obstructing a federal investigation for four years.\n\nWe can't turn a blind eye. https://t.co/0T5UJtqtGR","date":"Thu Jul 22 15:50:32 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden will bend over backwards to support a Russian pipeline but ignore the needs of Americans by killing U.S. pipelines like the Keystone XL. \n\nAmericans are the ones that pay the price—with higher electric bills &amp; diminished national security.\nhttps://t.co/YYQVv5VcrV","date":"Wed Jul 21 22:08:56 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I agree, @GovInslee.","date":"Wed Jul 21 21:39:14 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@GovGianforte is absolutely right. \n\nThere is no reason to keep our northern border closed. It hurts Montana agriculture, businesses and families. \n\nTime for Congress to pass my bill to reopen the U.S.-Canada border immediately.","date":"Wed Jul 21 19:07:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@DonaldJTrumpJr is spot on.\n\n@JoeBiden's nomination of David Chipman to lead the ATF is an attack on law-abiding gun owners and the Second Amendment rights of all Montanans. \nhttps://t.co/4wNJMldXbu","date":"Wed Jul 21 18:19:10 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Chemical abortions are dangerous &amp; target young women.\n\nWe can’t allow college health centers to turn into abortion clinics that promote do-it-yourself abortions in dorm rooms. \n\nWe must protect these vulnerable mothers &amp; their babies, no matter how small. https://t.co/Ubw91GSrpX","date":"Wed Jul 21 17:38:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"It was great to meet with @Montana_FFA members today! I always enjoy hearing from young leaders that are passionate about maintaining Montana’s rich history of agriculture. https://t.co/Wm5ZlveWFX","date":"Tue Jul 20 23:05:24 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The pocketbooks of Montana families are hurting, @JoeBiden. \n\nInflation is the highest we've seen in 13 years—your reckless tax &amp; spending spree will only make it worse.","date":"Tue Jul 20 20:56:46 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Glad to see Red Lodge firefighter Dan Steffensen doing well after surgery. He was injured while fighting a fire in Joliet, and my thoughts will be with him as he continues down the road to full recovery. I’m grateful for his selfless service to Montana. https://t.co/y0mTKKsiaC","date":"Tue Jul 20 02:58:22 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The US-Canadian border has been closed for too long, and Montana families, workers and small businesses are hurting because of it. It’s time for @JoeBiden to fully reopen the northern border between the US and Canada, and it’s time to do it NOW.","date":"Mon Jul 19 20:22:48 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Last Friday, I heard directly from Billings law enforcement about how our communities are being devastated because of the flood of illegal drugs coming across the southern border.\n\nWe need to end the #BidenBorderCrisis and support MT law enforcement in battling the drug epidemic. https://t.co/EKiN98lU2d","date":"Mon Jul 19 13:57:28 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Democrats’ tax &amp; spend agenda will only put more of a burden on hardworking Montana families. We cannot afford this kind of out of control spending. https://t.co/LpnBuyCPEk","date":"Sun Jul 18 21:43:54 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud","date":"Sun Jul 18 17:23:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"A Red Lodge firefighter bravely battling a fire near Joliet has suffered severe injuries. This is a sad reminder of what is on the line when these men and women go to work every day to protect our communities.","date":"Sat Jul 17 11:41:32 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"With about 80% of cases in Yellowstone County being drug related, the evidence center is filling up and our jails are at max capacity. \n\nWe must support local law enforcement in combatting the drug epidemic devastating our communities.","date":"Fri Jul 16 19:53:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Today I met with local leaders and law enforcement to discuss the increase in violent crime across Yellowstone County. \n\nViolent crime &amp; drugs are devastating MT communities. We must work together to combat this issue and do everything we can to ensure Montana families are safe. https://t.co/vsSNvj60fZ","date":"Fri Jul 16 19:53:43 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Just as brick and mortar companies are not allowed to discriminate based on race, sex or religion, social media should not be able to discriminate based on political speech and beliefs.","date":"Fri Jul 16 14:40:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"My bill will protect the exchange of ideas and political speech, no matter your affiliation, by applying long established principles to the modern digital age.\nhttps://t.co/EjJl7KMh1V","date":"Fri Jul 16 14:40:20 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"If an online platform provides ad space for one political candidate—it should make equal space available for all candidates regardless of political affiliation.","date":"Fri Jul 16 14:40:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Big Tech &amp; social media platforms say they promote free expression of ideas but at the same time they limit &amp; ban speech they disagree with.\n\nI intro’d a bill to crack down on their bias against certain political views &amp; protect all Americans’ ability to freely share their ideas.","date":"Fri Jul 16 14:40:19 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden’s latest attack on the 2nd Amendment is the nomination of David Chipman — a registered anti-gun lobbyist, who has called for the ban of certain firearms, to lead the ATF.\n \nChipman’s nomination is an attack on law-abiding gun owners and the #2A rights of all Americans. https://t.co/gIHKZlPHve","date":"Thu Jul 15 23:31:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Hyde Amendment has been the law of the land for 45 years. House Democrats’ legislation to eliminate this law is a radical lurch to the left and would force taxpayers to fund abortions on demand. \n\nThis is despicable. #HydeSavesLives","date":"Thu Jul 15 19:14:07 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Thanks @GovGianforte for your leadership. It’s only July and Montana is on fire with 12 active fires as of today. Firefighters and first responders who are working around the clock to keep Montanans safe need help and resources.","date":"Thu Jul 15 02:08:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Visiting with MT students from across the state always brightens my day. \n\nGreat time chatting with some of MT’s brightest from  Shields Valley, Sidney &amp; Judith Gap high schools about the importance of being Montana’s voice in the Senate, bipartisanship &amp; the legislative process. https://t.co/wLFGOIWZUu","date":"Wed Jul 14 21:30:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Just this week, new inflation numbers proved what Montana families are already feeling—prices for everyday necessities are soaring. \n\nNow the Democrats think that adding a whopping $3.5T tax and spend plan to the mix is a good idea? Crazy &amp; a terrible plan for taxpayers.","date":"Wed Jul 14 17:16:16 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Always great catching up with Hans and Cyndi from the @MTFarmBureau. \n\nWill continue working with them on important issues facing Montana ag like ensuring farmers and ranchers get the relief they need from the historic drought we’re seeing across the state. https://t.co/1yVwsJuAo5","date":"Tue Jul 13 23:12:11 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"I’m glad the @JoeBiden admin listened to my request and kept the current city size designations for MT cities like Bozeman, Missoula and Great Falls. \n\nThis is a big win for our MT communities.","date":"Tue Jul 13 22:22:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":".@JoeBiden, it's time to open the northern border for the sake of Montana businesses and families NOW.","date":"Tue Jul 13 17:10:55 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Compared to last year, Montana families are paying:\n\n- 45.2% more for used cars\n- 45.1% more for gas\n- 2.4% more for food\n\nWe haven't seen the cost of living make this large of a jump since 2008.  \n\nOne thing is clear—#Bidenomics doesn't work for Montana families.","date":"Tue Jul 13 16:47:17 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Looks like it was a great day on the water. Congrats to all the participants! https://t.co/lqQsdzpVAf","date":"Mon Jul 12 23:20:39 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"MT needs @USDA &amp; Biden admin to designate ALL counties as primary natural disaster areas in order to protect the livelihoods of our farmers &amp; ranchers.\n\n@GovGianforte @RepRosendale &amp; I are continuing our effort to get help for all MT counties suffering from this historic drought.","date":"Mon Jul 12 22:57:23 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"The Obama-era #WOTUS rule is a prime example of harmful federal overreach that places burdensome regulations on farmers &amp; ranchers in MT &amp; nationwide. \n\nI'm urging @JoeBiden to uphold Trump’s rewrite, the NWPR, &amp; demanding answers about this Administration's plans moving forward.","date":"Mon Jul 12 18:39:12 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Cubans have lived under the tyranny of communism for too long. Americans stand with the Cuban people in their fight for liberty.","date":"Mon Jul 12 15:39:51 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"My bipartisan bill with @SenStabenow would put an end to bad actors using abusive syndicated conservation easements, while saving taxpayers billions of dollars and promoting conservation in the U.S. It’s time the U.S. Senate passes this important bill.\nhttps://t.co/I0SWm4i8uR","date":"Sat Jul 10 18:40:40 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"Foreign hackers took down up to 1,500 businesses across the globe. This is unacceptable. I have a bill that challenges the status quo &amp; looks at ways to empower the private sector to take action against hackers so that these threats are minimized. \nhttps://t.co/kH9M9sznTQ","date":"Fri Jul 09 21:25:53 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"#MontanaProud","date":"Wed Jul 07 19:41:50 +0000 2021","user_id":"11651202"},{"handle":"SteveDaines","text":"While I'm glad to see USDA provide several Montana counties with disaster relief, it is not enough. All Montana counties need help. \n\nI urge @SecVilsack to provide relief for all Montana counties and our farmers and ranchers that need it. https://t.co/Ax9YbQ6Aqb","date":"Wed Jul 07 15:33:26 +0000 2021","user_id":"11651202"}]