[{"handle":"ABC","text":"The Supreme Court’s landmark decision overturning Roe v. Wade has set the stage for a major test of public and private pregnancy support programs that abortion rights opponents have touted for decades. https://t.co/yVQzqjVgCo","date":"Sat Jun 25 22:19:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Providence police said they are investigating an off-duty officer after \"a female subject was assaulted\" at a protest outside the Rhode Island State House Friday night. https://t.co/ByRJcTXVNu","date":"Sat Jun 25 21:48:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The former Minneapolis police officer who fatally shot an unarmed woman who called 911 to report a possible sexual assault behind her home in 2017 is scheduled to be released from prison next week.  https://t.co/ucVUvmSk4n","date":"Sat Jun 25 21:18:21 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A Kentucky pediatrician was charged in a plot she allegedly conceived to kill her ex-husband and gain sole custody of her children, according to court documents unsealed by the Justice Department.  https://t.co/0cFa6ErfvO","date":"Sat Jun 25 20:48:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia's Supreme Court has overturned the murder conviction of Justin Ross Harris, a father who went on trial for his son's hot car death, saying much of the sexually related evidence the jury heard was \"needlessly cumulative and prejudicial.\" https://t.co/76VT4j4GwF","date":"Sat Jun 25 20:14:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Mitt Romney isn’t up for reelection this year, but his name is surfacing in some Republican primaries throughout the nation. https://t.co/9w4cGoVmqi","date":"Sat Jun 25 19:43:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The parents of a Bowling Green State University student filed a lawsuit against the university after a hazing incident resulted in their son's death due to alcohol poisoning. https://t.co/HcLxeivz3n","date":"Sat Jun 25 19:12:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"CLOSE CALL: Two Vermont troopers found themselves in a dangerous situation when a man recklessly operated an excavator in an attempt to prevent an arrest. The incident ended with the subjects in custody and no injuries to anyone involved. https://t.co/9N1iLCqcZP https://t.co/iNXE5eNOli","date":"Sat Jun 25 18:41:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The former Minneapolis police officer who fatally shot an unarmed woman who called 911 to report a possible sexual assault behind her home in 2017 is scheduled to be released from prison next week.  https://t.co/dubvcDrTi4","date":"Sat Jun 25 18:10:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Virtual mailboxes, mobile clinics and more: Here are some of the ways underground access to abortion could work.  https://t.co/17QIbqDk9R","date":"Sat Jun 25 17:38:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"British officials said the monkeypox outbreak in the U.K. is growing across the country. Anyone who was in close, physical contact with someone who had monkeypox was at risk of catching the disease, doctors say. https://t.co/brtvW0uiBm","date":"Sat Jun 25 17:08:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Hailey Bieber's Rhode skin care company was hit with a trademark infringement lawsuit from owners of a fashion company of the same name, which claims the model even offered to purchase the RHODE trademark for clothing four years ago. https://t.co/abaeacsTJE","date":"Sat Jun 25 16:37:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Schools around the country are scrambling to continue feeding America's children. With the \"Keep Kids Fed Act\" passed they're breathing a sigh of relief–but only for a moment. https://t.co/e42BGQY1GW","date":"Sat Jun 25 16:06:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"An Australian state has become the first in the country to pass a law banning the public display of Nazi swastikas, as concerns grow about the rate at which local young people are being radicalized. https://t.co/GtuVRuq4eT","date":"Sat Jun 25 15:35:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: 3 shot at WeatherTech warehouse in Chicago suburb, authorities confirm. https://t.co/OzUJExOJ48","date":"Sat Jun 25 15:05:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"With an eye on the upcoming July Fourth weekend, airlines are stepping up their criticism of federal officials over recent widespread flight delays and cancellations. https://t.co/I7tELjGc7v","date":"Sat Jun 25 14:41:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"DHS recently warned that the threat from foreign terrorist organizations and cyberthreat from adversaries like Russia, including election interference, will likely increase in 2022, according to an intelligence analysis obtained by @ABC News. https://t.co/QUdmyIZUOi","date":"Sat Jun 25 14:09:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Comments about Roe v. Wade made by recent conservative Supreme Court appointees during their Senate confirmation hearings have come under fresh scrutiny following the court's ruling overturning the landmark abortion case.\n \nHere's what they said: https://t.co/i8zEbdVrGK https://t.co/VcnS8V4qa9","date":"Sat Jun 25 13:57:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“I finally understood what everyone was talking about in the movies and songs and everything...I get it now.”\n\nSally Osborne and Lena Schwen discuss falling in love after leaving the Church of Jesus Christ of Latter-day Saints.\n\nNow streaming on @Hulu: https://t.co/V1zui5Gemu https://t.co/cH7XdtmHUg","date":"Sat Jun 25 13:53:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"President Joe Biden on Saturday signed into law the gun safety package passed by Congress this week. \"Time is of the essence,\" Biden said as he delivered remarks in the Roosevelt Room alongside first lady Jill Biden. \"Lives will be saved.\" https://t.co/Pb9wURut7F","date":"Sat Jun 25 13:06:58 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"As food costs and fuel bills soar, inflation is plundering people’s wallets, sparking a wave of protests and workers’ strikes around the world. https://t.co/b6A09x1LZk","date":"Sat Jun 25 11:58:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Following Friday's Supreme Court decision, House Democrats marched from the Capitol to the Supreme Court to protest abortion access. https://t.co/UFpgOCCreI https://t.co/WOHYjKLyyO","date":"Sat Jun 25 11:25:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dramatic police body-camera video captured two NYPD officers teaming up on a rush-hour rescue of a woman this week who collapsed on a subway platform and fell onto the tracks. https://t.co/HccUtlJxBe","date":"Sat Jun 25 10:55:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"More than two dozen paintings attributed to artist Jean-Michel Basquiat were seized from a Florida museum following questions about their authenticity. https://t.co/13zeMGROfT","date":"Sat Jun 25 10:25:17 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"UPDATE: Police in Olso, Norway believe the mass shooting that killed 2 and injured several others was a terror attack.  https://t.co/2mM7DiqcFG","date":"Sat Jun 25 10:19:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Americans reacted with both protests and celebrations after the U.S. Supreme Court, on June 24, 2022, overturned the landmark Roe v. Wade decision, which guaranteed the right to abortion across the country for nearly 50 years. https://t.co/GIFBgKZU8Q","date":"Sat Jun 25 09:54:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Almost 300 high school seniors received their diplomas in Uvalde in the shadow of the massacre of 19 elementary school students and two teachers one month earlier. https://t.co/rNI6kdlYrd","date":"Sat Jun 25 09:21:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court's ruling to overturn Roe v. Wade sent shockwaves throughout the country as it gave power back to states to decide whether or not abortion is legal.\n\nHere are five things to know about the court's ruling on abortion and the aftermath. https://t.co/TcbfKlvWHr","date":"Sat Jun 25 08:58:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court’s abortion ruling to overturn Roe v. Wade sparked protests across the country. Abortion rights demonstrators took to the streets in cities, including New York, Washington D.C., Atlanta, and Detroit, decrying the decision. https://t.co/0qXgNB4xdh https://t.co/ejpT4YRSG9","date":"Sat Jun 25 08:34:58 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The judge in the Johnny Depp-Amber Heard defamation trial has made a jury’s multimillion-dollar award official. https://t.co/1QIN3UqQhx","date":"Sat Jun 25 08:08:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Two people involved in testing for the electric car brand NIO died when one of its vehicles fell three stories from a Shanghai parking structure, the company says. https://t.co/orIUgKaVqc","date":"Sat Jun 25 07:42:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Mifeprex, along with its generic version, is quickly taking center stage in the abortion debate, as several states move to outlaw its use while others try to expand access. https://t.co/iRekT6hH6d","date":"Sat Jun 25 07:17:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Auschwitz-Birkenau museum alleges it was the target of “primitive” propaganda spread by Russian state agencies on social media. https://t.co/E3piC7Eklr","date":"Sat Jun 25 06:54:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Sen. Susan Collins is being criticized for the Supreme Court ruling allowing states to ban abortion because the moderate Republican voted to confirm two of the justices who were in the majority opinion. https://t.co/FoS7nUFPLA","date":"Sat Jun 25 06:30:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"He was carrying 62 arrows and four knives at the time of the attack. https://t.co/afMKK4SRGB","date":"Sat Jun 25 06:03:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Iranian state media reported that authorities detained five people accused of organizing a skateboarding event where dozens of teenagers mixed freely and girls didn't wear headscarves. https://t.co/zLZ0wSbMLr","date":"Sat Jun 25 05:40:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court's ruling to overturn Roe v. Wade, the longstanding precedent that guaranteed the fundamental right to an abortion, could have far-reaching implications for women's health, medical experts say. https://t.co/QIAgdwWdip","date":"Sat Jun 25 05:18:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"During their respective Senate confirmation hearings after being nominated to the Supreme Court by Trump, Gorsuch and Kavanaugh acknowledged the precedent set by Roe, while Barrett told senators she believed the decision was not a \"super-precedent.\" https://t.co/mwHSv33YFZ","date":"Sat Jun 25 04:51:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Hillary Clinton: “Today’s Supreme Court opinion will live in infamy as a step backward for women’s rights and human rights.” https://t.co/wbPQg68wHg https://t.co/HDAdWDB9bd","date":"Sat Jun 25 04:25:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"President Joe Biden harshly criticized the Supreme Court's decision and called on Congress to enshrine access in federal law. https://t.co/I1xWpDJrv5 https://t.co/8uArC9X81m","date":"Sat Jun 25 04:02:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"At least two people were killed and 14 were injured when shots were fired at a nightclub in Oslo, Norway, authorities say. https://t.co/Snj75e5JMC","date":"Sat Jun 25 03:27:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Major U.S. companies, including Meta and JPMorgan Chase said they will cover travel costs for employees who seek legal abortions outside their home state after the Supreme Court released a ruling that overturned Roe v. Wade. https://t.co/VJdznXuaMC","date":"Sat Jun 25 03:04:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"First lady Jill Biden spoke at the site of the Champlain Towers South condominium collapse in Surfside, Florida, on the one-year anniversary of the tragedy. https://t.co/NpwKgms5uv","date":"Sat Jun 25 03:03:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"One year after 98 people died in the Surfside condominium collapse, officials say there’s still a long way to go to ensure the safety of other South Florida buildings. https://t.co/qibOr0NXbA https://t.co/uxpc12Q51H","date":"Sat Jun 25 02:19:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"How to save money on gas as prices continue to climb: https://t.co/6dY1TRuQUN","date":"Sat Jun 25 02:19:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“Women are too often told they cannot be fierce competitors in their careers while still being a caregiver to their children.”\n\nAllyson Felix is providing free child care for athletes, coaches and staff for select track and field events this year. https://t.co/FvhrymHkzt https://t.co/of5k35gF62","date":"Sat Jun 25 02:19:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"As Pride Month nears its end, the House has passed the LGBTQI+ Data Inclusion Act, which will require over 100 federal agencies to improve data collection and surveying of LGBTQ communities. https://t.co/Pvdyx3z3NK","date":"Sat Jun 25 02:19:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"DHS recently warned that the threat from foreign terrorist organizations and cyberthreat from adversaries like Russia, including election interference, will likely increase in 2022, according to an intelligence analysis obtained by @ABC News. https://t.co/91UZ37Sh86","date":"Sat Jun 25 02:07:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Local fears grow that the southern Japanese islands will become embroiled in regional military tension. https://t.co/qQOS13cjkX","date":"Sat Jun 25 01:43:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The federal case against Ramesh \"Sunny\" Balwani, a former Theranos executive accused of defrauding investors and patients, is now in the hands of a jury. https://t.co/qYwmdHrdXl","date":"Sat Jun 25 01:19:16 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Roe v. Wade defined an era. The Supreme Court just started a new one.\n\nMore, via @FiveThirtyEight: https://t.co/O96EGrl9XG","date":"Sat Jun 25 00:59:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The once-a-decade process of redrawing the country's congressional districts has given Republicans a major edge — but that's not the only consequence. https://t.co/cCKIBsnkOj","date":"Sat Jun 25 00:35:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Water levels in Lake Mead are continuing to deplete to dangerous levels — so much so that the reservoir could soon hit \"dead pool\" levels. https://t.co/Wlsq5g0Jci","date":"Sat Jun 25 00:12:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"Stop The Steal\" organizer Ali Alexander appeared before a federal grand jury in Washington, D.C., Friday, his attorney confirmed to ABC News. https://t.co/JLQn4sSkyx","date":"Fri Jun 24 23:48:49 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The parents of Bowling Green State University student Stone Foltz filed a lawsuit against the university after a hazing incident resulted in their son's death due to alcohol poisoning. https://t.co/5ix1B1YyX3","date":"Fri Jun 24 23:46:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"This Arkansas father decided to shave off all his hair — dreadlocks that he'd been growing for the last 10 years — to match his younger daughter, who lost her own hair after starting chemotherapy. https://t.co/Bgx7fYrgsH","date":"Fri Jun 24 23:24:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Earlier this year, @FiveThirtyEight took a close look at where Americans stand on abortion.\n\nWhat they found is most Americans didn’t want Roe to be overturned—but they also have a complicated relationship to abortion. \n\nRead more: https://t.co/lTCtpYgODb","date":"Fri Jun 24 23:01:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"When I was Mormon I was as happy as I thought I could be—and then I fell in love with my friend.\"\n\nThe story of two women who left the Mormon church and found love - “Mormon No More” is now streaming on @Hulu: https://t.co/V1zui5Gemu https://t.co/WxkbDWkshO","date":"Fri Jun 24 23:00:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Earlier this year, @FiveThirtyEight took a close look at where Americans stand on abortion.\n\nWhat they found is most Americans didn’t want Roe to be overturned—but they also have a complicated relationship to abortion. \n\nRead more: https://t.co/TPrcVNfKdS","date":"Fri Jun 24 22:58:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Former Vice Pres. Mike Pence: “By overturning Roe v. Wade, the Supreme Court of the United States has given the American people a new beginning for life.” https://t.co/wX1TIqAsg7 https://t.co/uvaLNNhLvY","date":"Fri Jun 24 22:36:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"This lazy dog is well and truly ready for this week to end too. https://t.co/MSG9U4xfBP https://t.co/ruOpjPI0O5","date":"Fri Jun 24 22:23:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"26 states are expected to ban or severely restrict abortion rights in wake of the Supreme Court's ruling overturning Roe v. Wade.\n\nMore: https://t.co/2rbwzm4XyX https://t.co/XpafViw0vV","date":"Fri Jun 24 22:09:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"People of color will likely face the brunt of negative impact following the Supreme Court's overturning Roe v. Wade, abortion rights advocates warn. https://t.co/WuDY9uGZPo","date":"Fri Jun 24 22:09:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"Roe v. Wade Overturned: An @ABCNewsLive Special Report\" - streams TONIGHT at 8p ET on https://t.co/zQZ2w0IdKE and @Hulu. https://t.co/NuxLeFynxl","date":"Fri Jun 24 21:58:32 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Comments about Roe v. Wade made by recent conservative Supreme Court appointees during their Senate confirmation hearings have come under fresh scrutiny following the court's ruling overturning the landmark abortion case.\n \nHere's what they said: https://t.co/yDik8TnsNF https://t.co/4oQ9XseqVM","date":"Fri Jun 24 21:41:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The DHS expects violence could occur \"for weeks\" from domestic violent extremists following the Supreme Court decision overturning Roe v. Wade, according to a bulletin obtained first by @ABC News. https://t.co/pNrbXYA6Ut","date":"Fri Jun 24 21:30:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Major U.S. companies, including Meta and JPMorgan Chase said they will cover travel costs for employees who seek legal abortions outside their home state after the Supreme Court released a ruling that overturned Roe v. Wade. https://t.co/bA4FZKqakm","date":"Fri Jun 24 21:04:17 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Former first lady Michelle Obama: “I am heartbroken for people around this country who just lost the fundamental right to make informed decisions about their own bodies.” https://t.co/Qjh1AkX4OX https://t.co/VeTL4O0GtR","date":"Fri Jun 24 20:48:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"GOP Sen. Susan Collins says the Supreme Court’s decision to overturn Roe v. Wade is a \"radical jolt\" to the nation, adding the ruling is inconsistent with Kavanaugh and Gorsuch's testimony during the confirmation process. https://t.co/g99w6rYtD0 https://t.co/7WaT2stEbo","date":"Fri Jun 24 20:28:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"Within minutes of the decision... we had to stop providing abortion care.\"\n\nDr. Colleen McNicholas, Chief Medical Officer for Planned Parenthood of the St. Louis region, tells @ABC News how trigger bans immediately ended care in the wake of the Supreme Court's opinion. https://t.co/eTVqJtuvQM","date":"Fri Jun 24 19:57:47 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@jayobtv was outside the Supreme Court today as anti-abortion rights groups celebrated the ruling overturning Roe v. Wade—and abortion rights groups \"are settling in, they say, for the long haul...preparing to be protesting outside the court for quite some time.\" https://t.co/17mS1HHoss","date":"Fri Jun 24 19:42:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"As abortion rights increasingly come under threat across the country, advocates anticipate that women seeking abortion options will look outside the traditional health care system more and more. https://t.co/TmJ87W5r2B","date":"Fri Jun 24 19:30:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"What the ruling said—what it means for the future. https://t.co/1Nm3OBJmWQ","date":"Fri Jun 24 18:58:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Any effort to codify a woman's right to choose would need to clear the Senate filibuster. That means 60 votes. And those votes are nowhere to be seen in the Senate. https://t.co/1Xy8GLvcOH","date":"Fri Jun 24 18:56:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The only abortion clinic in West Virginia announced it is no longer performing abortions after the Supreme Court overruled Roe v. Wade. https://t.co/1W6pWRNAbp","date":"Fri Jun 24 18:50:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"An @ABC News/WaPo poll taken April 24-28, 2022, found a majority of Americans supported upholding Roe v. Wade. https://t.co/UMh7GvhfMb https://t.co/RvnQ4jcAXl","date":"Fri Jun 24 18:36:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"House Minority Leader Rep. Kevin McCarthy said Republicans would put anti-abortion legislation on the House floor next year if they retake the chamber in this year's midterm elections. https://t.co/pdNKMSgSDZ","date":"Fri Jun 24 18:09:25 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Sen. Mitt Romney: “The sanctity of human life is a foundational American principle, and the lives of our children—both born and unborn—deserve our protection.” https://t.co/Rb2V5WIOyU https://t.co/eV3U4MnKQj","date":"Fri Jun 24 17:59:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: The House voted to pass a bipartisan gun safety package, the first major piece of gun reform to clear Congress in decades. https://t.co/uk4vRIncUF","date":"Fri Jun 24 17:41:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Justice Clarence Thomas's concurring opinion on abortion case that overturned Roe v. Wade stated that other precedents should be reconsidered, raising fears that same-sex marriage, same-sex relationships and contraceptives might be next. https://t.co/pbGzjVfEo4","date":"Fri Jun 24 17:36:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Liz Cheney: “I have always been strongly pro-life. Today’s ruling by the Supreme Court returns power to the states and the people of the states to address the issue of abortion under state law.” https://t.co/3Ma0qkkWx6 https://t.co/xwJRhLIL6c","date":"Fri Jun 24 17:34:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden delivers message of solidarity with Americans impacted by the Supreme Court's decision overturning of Roe v. Wade: \"I know so many women are now going to face incredibly difficult situations. I hear you. I support you. I stand with you.\" https://t.co/KqPokFRmi1 https://t.co/RuLonHpgON","date":"Fri Jun 24 17:27:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@EmNewsDC was outside the Supreme Court the moment the decision to overturn Roe v. Wade was handed down. She reports on the real-time reaction to the court's ruling: https://t.co/oXPqb4CIje https://t.co/wV6dwFQFKf","date":"Fri Jun 24 17:12:25 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After the U.S. Supreme Court ruling striking down Roe v. Wade, the 1973 landmark decision that guaranteed a woman's right to an abortion, states are taking action. https://t.co/2JH2PYP0Ew","date":"Fri Jun 24 17:09:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden: \"The only way we can secure a woman's right to choose...is for Congress to restore the protections of Roe v. Wade as federal law. No executive action from the president can do that.\"\n\n\"This fall, Roe is on the ballot.\" https://t.co/oXPqb4CIje https://t.co/mDBFl9EdAT","date":"Fri Jun 24 17:01:58 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"GOP Sen. Susan Collins says the Supreme Court’s decision to overturn Roe v. Wade is a \"radical jolt\" to the nation, adding the ruling is inconsistent with Kavanaugh and Gorsuch's testimony during the confirmation process. https://t.co/9LPjU2UDR8 https://t.co/WIXLlx9d1p","date":"Fri Jun 24 16:56:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Pres. Biden: \"State laws banning abortion are automatically taking effect today—jeopardizing the health of millions of women, some without exceptions.\" https://t.co/oXPqb4Dg8M https://t.co/PCIvG1hIwI","date":"Fri Jun 24 16:55:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Pres. Biden calls decision overturning Roe v. Wade a \"tragic error.\"\n\n\"The court has done what it has never done before—expressly take away a constitutional right that is so fundamental to so many Americans that had already been recognized.\" https://t.co/oXPqb4UjaM https://t.co/CwFil9RAMt","date":"Fri Jun 24 16:51:47 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"During their respective Senate confirmation hearings after being nominated to the Supreme Court by Trump, Gorsuch and Kavanaugh acknowledged the precedent set by Roe, while Barrett told senators she believed the decision was not a \"super-precedent.\" https://t.co/uqXUpGChbb","date":"Fri Jun 24 16:50:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden recalls his experience overseeing Supreme Court confirmations: \"This case was always discussed. I believe Roe v. Wade was the correct decision, as a matter of constitutional law.\" https://t.co/ZYC937QGLR https://t.co/5VVIMdvtB1","date":"Fri Jun 24 16:45:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"President Biden on SCOTUS ruling overturning Roe v. Wade: \"With Roe gone, let's be very clear: the health and life of women in this nation are now at risk.\" https://t.co/DqlJ8EcxNi https://t.co/uQuQg6BnEr","date":"Fri Jun 24 16:44:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Pres. Biden on Supreme Court decision overturning Roe v. Wade: \"It's a sad day for the court and for the country.\" https://t.co/oXPqb4Dg8M https://t.co/EddQByvXKA","date":"Fri Jun 24 16:42:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: Pres. Joe Biden speaks on Supreme Court ruling overturning Roe v. Wade. https://t.co/vj4B1FUd2E","date":"Fri Jun 24 16:39:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Mifeprex, along with its generic version, is quickly taking center stage in the abortion debate, as several states move to outlaw its use while others try to expand access. https://t.co/tYq9IVwWfZ","date":"Fri Jun 24 16:19:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden will speak on the Supreme Court's decision upending abortion rights at 12:30 p.m. ET. https://t.co/HkMjQBA1pE","date":"Fri Jun 24 16:09:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"📸: Anti-abortion demonstrators react to the overturning of Roe v. Wade outside the Supreme Court. https://t.co/FksfNvBXLI https://t.co/gaeOu6eXMG","date":"Fri Jun 24 16:05:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“We were creating the perfect Mormon family, and then I fell in love with my friend.” \n\nThe life-changing story of two women who left the Mormon church and found love. “Mormon No More,” an @ABC News Studios docu-series, is streaming NOW on @Hulu. https://t.co/lt3zEIPVtE https://t.co/aQSgpJmxZB","date":"Fri Jun 24 16:00:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: AG Garland: “The Justice Department strongly disagrees with the Court’s decision.\"\n\n\"Few rights are more central to individual freedom than the right to control one’s own body. The Justice Department will use every tool at our disposal to protect reproductive freedom.\" https://t.co/jZNiSs0tJP","date":"Fri Jun 24 15:55:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"📸: Abortion rights supporters react to the overturning of Roe v. Wade outside the Supreme Court. https://t.co/F6qJmMEd9x https://t.co/bqMZrHCl7I","date":"Fri Jun 24 15:51:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"HAPPENING NOW: @ABCNewsLive has continuing coverage as the nation reacts to the Supreme Court overturning Roe v. Wade. https://t.co/fIVyr9grU0","date":"Fri Jun 24 15:48:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Now that the Supreme Court has overruled Roe v. Wade, Mississippi's only abortion clinic, the clinic at the center of the court decision, will be forced to close. \n\nLIVE UPDATES: https://t.co/tYl3lt5uy2","date":"Fri Jun 24 15:48:25 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: President Biden will speak on the abortion ruling at 12:30 p.m., according to the White House. https://t.co/8bjBX2cHjQ","date":"Fri Jun 24 15:44:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Senate Majority Leader Chuck Schumer: “These justices, appointed by Republicans and presiding without any accountability, have stolen a fundamental right to have an abortion away from American women in this country.” https://t.co/zpMTTbGcS3 https://t.co/DdEAaFBqpa","date":"Fri Jun 24 15:41:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Hillary Clinton: “Today’s Supreme Court opinion will live in infamy as a step backward for women’s rights and human rights.” https://t.co/jZFFePAAG9 https://t.co/IzXZJ3xIm0","date":"Fri Jun 24 15:33:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court's ruling to overturn Roe v. Wade, the longstanding precedent that guaranteed the fundamental right to an abortion, could have far-reaching implications for women's health, medical experts say. https://t.co/g6iU9UZr9R","date":"Fri Jun 24 15:32:16 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"What the Supreme Court’s gun ruling means for gun control. Via @fivethirtyeight. https://t.co/NQzKihyUTv","date":"Fri Jun 24 15:26:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pelosi: \"The radical Supreme Court is eviscerating Americans' rights and endangering their health and safety.\"\n\n\"The Republican-controlled Supreme Court has achieved their dark, extreme goal of ripping away a woman's right to make their own reproductive health decisions.\" https://t.co/OW535LW06F","date":"Fri Jun 24 15:21:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Key moments in the battle for abortion rights in the United States: https://t.co/vlXltR134e","date":"Fri Jun 24 15:11:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"📸: One year after the Surfside condo collapse killed 98 people, the families of the victims return to the site to mark the first anniversary of the disaster. https://t.co/k5iL7Xoj1p https://t.co/9Nv4pPxAwn","date":"Fri Jun 24 15:10:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Former first lady Michelle Obama: “I am heartbroken for people around this country who just lost the fundamental right to make informed decisions about their own bodies.” https://t.co/W2g6jdqfhu https://t.co/JDRWjEb8wB","date":"Fri Jun 24 15:09:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"26 states are expected to ban or severely restrict abortion rights in wake of the Supreme Court's ruling overturning Roe v. Wade.\n\nLIVE UPDATES: https://t.co/xCvAtsa5Qj https://t.co/xtO67bKXYG","date":"Fri Jun 24 15:05:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"People of color will likely face the brunt of negative impact following the Supreme Court's overturning Roe v. Wade, abortion rights advocates warn. https://t.co/oOQBPfe5vp","date":"Fri Jun 24 15:03:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Former Vice Pres. Mike Pence: “By overturning Roe v. Wade, the Supreme Court of the United States has given the American people a new beginning for life.” https://t.co/lNtueYflP0 https://t.co/s8t03jmAFD","date":"Fri Jun 24 14:59:09 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"We're live outside the Supreme Court after the nation's highest court ruled to overturn Roe v. Wade and the fundamental right to abortion that has been the law for almost 50 years. https://t.co/bRjazATtOo","date":"Fri Jun 24 14:49:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Former Pres. Obama: “Today, the Supreme Court ... relegated the most intensely personal decision someone can make to the whims of politicians and ideologues—attacking the essential freedoms of millions of Americans.” https://t.co/rECZCCr9hj https://t.co/6OwzIjLFrQ","date":"Fri Jun 24 14:46:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"For older people and retirees, the twin crunch of rising living costs and falling stock returns sounds an especially urgent alarm, straining their budgets while choking off supplementary funds from their portfolios, experts told @ABC News. https://t.co/rxM1GWPgPI","date":"Fri Jun 24 14:46:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"26 state are expected to ban or severely restrict abortion rights in wake of the Supreme Court's ruling overturning Roe v. Wade. https://t.co/grzGjz0tJH https://t.co/D9HNjdrWjn","date":"Fri Jun 24 14:43:09 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NASA has asked Boston-based RR Auction to halt the sale of moon dust collected during the 1969 Apollo 11 mission. https://t.co/bmsRsvKx91","date":"Fri Jun 24 14:36:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Abortion rights activists spoke to @ABC News ahead of the Supreme Court's decision overturning Roe v. Wade: \"This is a constitutional right that we fought for.\"\n\nInside the 50-year battle for reproductive rights: https://t.co/HCJtjvwJXo https://t.co/493NwqieoQ","date":"Fri Jun 24 14:33:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: Supreme Court overturns Roe v. Wade in landmark case involving abortion access. \n\nFull coverage: https://t.co/VNnn9OU0yz","date":"Fri Jun 24 14:26:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Abortion laws and restrictions vary by state and, now the federal protection has been overturned, abortion will not be accessible everywhere in the U.S. https://t.co/kTrUeZujYJ","date":"Fri Jun 24 14:25:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: @TerryMoran: \"Bottom line: Roe v. Wade is overruled. There is no constitutional right to abortion in this country anymore.\" https://t.co/W4vm2ebEZt https://t.co/RWShioVuFz","date":"Fri Jun 24 14:22:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: The Supreme Court ruled to overturn Roe v. Wade and the fundamental right to abortion that has been the law for almost 50 years. https://t.co/CtFNnZVF4l","date":"Fri Jun 24 14:20:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING :The Supreme Court ruled in a much-anticipated case involving abortion rights. https://t.co/CVdftncZFB","date":"Fri Jun 24 14:13:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: Supreme Court rules in major case involving abortion rights. https://t.co/kFJGdBnQNR","date":"Fri Jun 24 14:13:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"No woman should ever have to choose between her career and her family, and our goal is to make accessible child care a standard provision for working moms.\" https://t.co/DIh7VfVIko https://t.co/6RwntfHnQA","date":"Fri Jun 24 13:49:16 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"FELINE VS. FLOODS: Firefighters save a stranded cat after finding it clinging to a post following flooding in Qingyuan, China. https://t.co/H26TVoE7xI https://t.co/aNoeCcKUNV","date":"Fri Jun 24 13:34:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Prince William and Kate, the Duke and Duchess of Cambridge, visited a museum in Cambridge, England, to view their first official joint portrait.\n\n\"It's quite big,\" William said. https://t.co/QrLJahWHQp https://t.co/puj4kkfQgm","date":"Fri Jun 24 13:28:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 committee member Rep. Adam Kinzinger: \"The President didn’t care about actually investigating the facts. He just wanted the Department of Justice to put its stamp of approval on the lies.\" https://t.co/FdNy7DUu5O https://t.co/ZCxSKYNZMp","date":"Fri Jun 24 13:07:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"This Georgia mom's youngest son needs a new kidney, and after multiple tests and processes, doctors finally gave her the green light to undergo the live organ donation. https://t.co/8p6YBuj8ZS","date":"Fri Jun 24 12:53:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"With the Supreme Court's decision looming, former activists say that by using their progress as the blueprint, the fight is up to the next generation. https://t.co/xnIh0WzDZi","date":"Fri Jun 24 12:31:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly 1 in 5 American adults who have had COVID-19 are still suffering from long-haul symptoms, according to new data collected by the Census Bureau and the CDC's National Center for Health Statistics. https://t.co/GZt8Ocwuul","date":"Fri Jun 24 12:27:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Patsy Mink, the first woman of color elected to Congress, now has a portrait to honor her legacy at the U.S. Capitol. https://t.co/J4vN1NcYDK","date":"Fri Jun 24 12:20:52 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. Marshals found the black Jeep Grand Cherokee registered to Kaitlin Marie Armstrong, the Austin woman suspected of killing professional cyclist Anna Moriah Wilson in May, authorities say.  https://t.co/3lvXfcOZHZ","date":"Fri Jun 24 11:57:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"GOP Rep. Liz Cheney speaks to the \"millions of Americans who put their trust in Donald Trump.\" https://t.co/nHTdsa4Do5 https://t.co/5uyotEOGYU","date":"Fri Jun 24 11:32:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“You saved her life!” \n\nWhen this passing man spotted a distressed baby deer floundering in a gated swimming pool, he saw only one option and immediately jumped the fence to rescue the fawn. https://t.co/lGdedZhfEW https://t.co/exq1uJYX6S","date":"Fri Jun 24 11:12:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: Violence against abortion providers significantly rose in 2021, according to a report from the National Abortion Federation published today. https://t.co/0HFMU969BR","date":"Fri Jun 24 11:07:52 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Court in Iran ordered the U.S. government to pay over $4 billion to the families of Iranian nuclear scientists who have been killed in targeted attacks in recent years, state-run media reported. https://t.co/M3pV2fN5NC","date":"Fri Jun 24 10:47:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"New HIV diagnoses dropped 17% during the first year of the pandemic, according to a new report from the CDC — but researchers warn disruptions brought by the pandemic’s early lockdowns mean that far fewer people got tested. https://t.co/Qcp1QRZ0Mx","date":"Fri Jun 24 10:23:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Survivors of the Surfside, Florida, condo collapse remember their lost loved ones on the anniversary of the tragedy that took the lives of 98 people. https://t.co/kIiwPdXVsG","date":"Fri Jun 24 10:21:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"ON THIS DAY: In 1983, the space shuttle Challenger — carrying America’s first woman in space, Sally K. Ride — coasted to a safe landing at Edwards Air Force Base in California. https://t.co/mPIA0UvEtx https://t.co/6QyPAtIZ9w","date":"Fri Jun 24 10:11:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Paul Pelosi is expected to appear for an arraignment on Aug. 3 in Napa County Superior Court, the district attorney's office said. https://t.co/8P0MssCcKV","date":"Fri Jun 24 10:04:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Smithtown Library on Long Island has reversed its decision to remove all Pride displays and Pride-related books from display in children's sections. https://t.co/XUFEGMW8fV","date":"Fri Jun 24 09:41:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"One year after 98 people died in the Surfside condominium collapse, officials say there’s still a long way to go to ensure the safety of other South Florida buildings. https://t.co/fypQV2f99X","date":"Fri Jun 24 09:21:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Brazilian prosecutors say that a raped 11-year-old girl has received a legal abortion after a judge blocked her for weeks from ending her pregnancy. https://t.co/qTfadUSo9v","date":"Fri Jun 24 09:18:16 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Over the years, lightning fatalities have been on the decline, according to the National Lightning Safety Council. But just this week, a woman was killed by lightning while walking her dogs in Southern California. https://t.co/u0EjJyqQwN","date":"Fri Jun 24 08:58:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"One the most spectacular examples of ancient Roman baths, the Baths of Caracalla, has become more spectacular. https://t.co/DaEKWN85SP","date":"Fri Jun 24 08:36:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"One month after the deadly shooting in Uvalde, Texas, a series of new revelations about the attack has done little to abate the frustrations of Uvalde’s residents. https://t.co/UQDcs6yTzp","date":"Fri Jun 24 08:29:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 House Committee Chair Rep. Bennie Thompson, in closing of Thursday's hearing: \"Up to this point, we've shown the inner workings of what was essentially a political coup.\" https://t.co/yhoesLn5Pk https://t.co/jBFgNPDIlr","date":"Fri Jun 24 08:25:49 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LGBTQ+ historical tour showcases landmarks of the gay rights movement. https://t.co/btQCK0oHqk","date":"Fri Jun 24 08:04:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"CRUSHING CRIME: Illegal dirt bikes confiscated by the NYPD get destroyed by a bulldozer.\n\n2,000 illegal vehicles have already been impounded by the NYPD this year, an 88% increase from last year. https://t.co/OX063o9ng0 https://t.co/4Wu40ECZDY","date":"Fri Jun 24 07:42:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Diesel prices could lead us into the next recession, experts say. https://t.co/gztrFj0NaO","date":"Fri Jun 24 07:20:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"New York City Mayor Eric Adams warned that the ruling would allow for more guns on the streets and put residents at risk. https://t.co/eHuRNPHWA9","date":"Fri Jun 24 06:58:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Who better to feed Elvis the Crocodile than Elvis himself?*\n\n*or a zoo staffer dressed up as Elvis https://t.co/oehuoDy6Nq","date":"Fri Jun 24 06:39:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"From YouTubers like MrBeast and GamingMermaid, to TikTok stars including Charli D'Amelio and Khaby Lame, online video creators of all stripes are flocking to Anaheim, California, from June 22 to June 25 for VidCon. https://t.co/0nJkOpElNJ","date":"Fri Jun 24 06:30:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Juul Labs said it would seek a stay of the decision and was \"exploring all of our options under the FDA's regulations and the law, including appealing the decision and engaging with our regulator.\" https://t.co/SBVvunoeHK","date":"Fri Jun 24 06:04:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida, officials say. \n\nNational Geographic documented the discovery, highlighting the continued impact of the invasive pythons. https://t.co/f4WUEEBStu","date":"Fri Jun 24 05:39:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"WATCH OUT! Van flies off car carrier trailer after slamming into an under-construction overpass in South Florida.\n\nNo injuries were reported. https://t.co/eGAccJKMmW https://t.co/heoImCwv3G","date":"Fri Jun 24 05:17:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Circuit judge signed an order requiring the Oakland County Sheriff's office, the county and the Oxford Community School District to release evidence, including video footage, related to the November school shooting at Oxford High School in Michigan. https://t.co/TUgl3zC5Vh","date":"Fri Jun 24 04:57:17 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Water levels in Lake Mead are continuing to deplete to dangerous levels — so much so that the reservoir could soon hit \"dead pool\" levels. https://t.co/etSUOAnFJj","date":"Fri Jun 24 04:33:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Malta is the only country in Europe with a complete ban on abortions regardless of the situation. https://t.co/cshiCPpMbX","date":"Fri Jun 24 04:12:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ohio State University has won its fight to trademark the word “The.” https://t.co/vGzL8bie4g","date":"Fri Jun 24 03:47:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Woman who feared for her life as she was allegedly being held hostage found a way to call for help without alerting her captor — an online breakfast order. https://t.co/Nz9FsbWNji","date":"Fri Jun 24 03:25:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden issues statement on Senate passage of bipartisan gun legislation: “Tonight, after 28 years of inaction, bipartisan members of Congress came together to heed the call of families across the country.” https://t.co/2Qgc152pUt https://t.co/AFxgCghdF4","date":"Fri Jun 24 03:08:42 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"DHS recently warned that the threat from foreign terrorist organizations and cyberthreat from adversaries like Russia, including election interference, will likely increase in 2022, according to an intelligence analysis obtained by @ABC News. https://t.co/Ifj6L7wCYL","date":"Fri Jun 24 03:02:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The parents of Bowling Green State University student Stone Foltz filed a lawsuit against the university after a hazing incident resulted in their son's death due to alcohol poisoning. https://t.co/ckJC5XoU54","date":"Fri Jun 24 02:36:34 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Senate passes bipartisan gun safety bill by a vote of 65-33. The legislation will now head to the House. https://t.co/4UU19CdgIX","date":"Fri Jun 24 02:23:34 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court's ruling Thursday striking down a New York State law limiting the right to carry a concealed handgun in public is drawing criticism from many in the state, including Buffalo Mayor Byron Brown. https://t.co/2xTbwSY2Do","date":"Fri Jun 24 02:04:28 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger: \"The President didn’t care about actually investigating the facts. He just wanted the Department of Justice to put its stamp of approval on the lies.\" https://t.co/hhOYOeEayI https://t.co/zOtZGHwbYo","date":"Fri Jun 24 01:31:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Texas National Guardsman dies while trying to save drowning migrants. His family wants answers. https://t.co/wlQVEv3RPa","date":"Fri Jun 24 01:18:33 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Justice Stephen Breyer invoked the nation’s latest gun violence massacres, including those at Uvalde and Buffalo, in his dissent against the Supreme Court’s ruling to expand the Second Amendment. https://t.co/YJmdgc1A7T","date":"Fri Jun 24 00:58:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The latest Jan. 6 committee hearing focused on what it said was a \"brazen attempt\" by then-Pres. Trump to misuse the Department of Justice for his own political gain.\n\nHere are some details you might have missed from today’s hearing: https://t.co/vGl8j4UKfn https://t.co/3RxhlV1HxH","date":"Fri Jun 24 00:43:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden and first lady Jill Biden welcomed wounded service members to the White House ahead of their annual bike ride. https://t.co/3w8xt4P6Pk","date":"Fri Jun 24 00:28:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Federal and state health officials are investigating an outbreak of meningococcal disease in Florida primarily infecting men who identify as gay, bisexual or men who have sex with men. https://t.co/mr7WGcW1Ql","date":"Fri Jun 24 00:24:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"What the Supreme Court’s gun ruling means for gun control. Via @fivethirtyeight. https://t.co/zaSuB03Y16","date":"Thu Jun 23 23:59:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"House Speaker Nancy Pelosi's husband, Paul Pelosi, has been charged with driving under the influence, causing injury, following his May 28 arrest, according to Napa County District Attorney's Office. https://t.co/aD6V98UNoW","date":"Thu Jun 23 23:58:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Smithtown Library on Long Island said it will remove the displays and books after the library board voted 4-2 to approve the motion. https://t.co/Kh4bHzUxL9","date":"Thu Jun 23 23:30:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"This Arkansas father decided to shave off all his hair — dreadlocks that he'd been growing for the last 10 years — to match his younger daughter, who lost her own hair after starting chemotherapy. https://t.co/f1sCegnzrF https://t.co/dYT64s0ORU","date":"Thu Jun 23 23:01:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Patsy Mink, the first woman of color elected to Congress, now has a portrait to honor her legacy at the U.S. Capitol. https://t.co/CH3YgeWmio","date":"Thu Jun 23 22:38:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 House Committee Chair Rep. Bennie Thompson, in closing of today's hearing: \"Up to this point, we've shown the inner workings of what was essentially a political coup.\" https://t.co/h0MSFQwBiE https://t.co/whKeFCojBE","date":"Thu Jun 23 22:13:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 committee member Rep. Adam Kinzinger: \"I'm still worried that not enough has changed to prevent this from happening again.\" https://t.co/GkVEkNafDK https://t.co/AYjHHGbG7z","date":"Thu Jun 23 21:58:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"GOP Rep. Liz Cheney speaks to the \"millions of Americans who put their trust in Donald Trump.\" https://t.co/zwQFKW1rlp https://t.co/18UR9ds7ui","date":"Thu Jun 23 21:43:32 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. Marshals found the black Jeep Grand Cherokee registered to Kaitlin Marie Armstrong, the Austin woman suspected of killing professional cyclist Anna Moriah Wilson in May, the law enforcement agency said. https://t.co/VvYYR50Hh7","date":"Thu Jun 23 21:37:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Kinzinger: \"It's now up to every American, now and in the future, to stand for truth, to reject the lies, wherever we confront them: In our towns. In our capitals. In our friendships. In our families. And at the ballot box. And within our own minds and hearts.\"","date":"Thu Jun 23 21:29:24 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 committee member Rep. Adam Kinzinger: \"I'm still worried that not enough has changed to prevent this from happening again.\" https://t.co/fyXdG4l9EE https://t.co/SYeZAvnv9j","date":"Thu Jun 23 21:27:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger: \"We're here today because the facts were irrelevant to Pres. Trump. It was about protecting his very real power and very fragile ego—even if it required recklessly undermining our entire electoral system.\" https://t.co/fyXdG4l9EE https://t.co/cqZDNLMPFO","date":"Thu Jun 23 21:23:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"What you're doing is nothing less than the United States Justice Department meddling in the outcome of a presidential election,” former acting deputy AG Richard Donoghue recalls telling DOJ official Jeff Clark during \"contentious\" meeting after election. https://t.co/dKL6sJahka https://t.co/tKNrwWxxi2","date":"Thu Jun 23 21:17:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Border Patrol paroled more than 207,000 migrants who crossed from Mexico from August through May.  https://t.co/oJYifdRjN1","date":"Thu Jun 23 21:09:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ex-DOJ official Richard Donoghue says he told Pres. Trump: \"Within 24, 48, 72 hours, you could have hundreds and hundreds of resignations in the leadership of your entire Justice Department because of your actions. What's that going to say about you?\" https://t.co/fyXdG4l9EE https://t.co/Zq52tFkw1h","date":"Thu Jun 23 21:07:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Kinzinger: Committee confirmed \"a call was actually placed by [Defense] Sec. Miller to the attache in Italy to investigate the claim that Italian satellites were switching votes...This is one of the best examples of the lengths to which Pres. Trump would go to stay in power.\" https://t.co/TMAzBUkCaJ","date":"Thu Jun 23 20:57:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Former acting attorney general Jeffrey Rosen and his former deputy Richard Donoghue described how Trump tried to get the Department of Justice to seize voting machines in late 2020.\n\nLIVE UPDATES: https://t.co/5nddG0wKCd","date":"Thu Jun 23 20:48:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ex-DOJ official Donoghue on how he responded to Pres. Trump's threat to remove DOJ leadership: \"Mr. President, you should have the leadership that you want. But understand: the United States Justice Dept. functions on facts, evidence and law—and those are not going to change.\" https://t.co/roJrhJPxWF","date":"Thu Jun 23 20:40:28 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Kinzinger: \"So there'd be no factual basis to seize [voting] machines?\"\n\nFormer acting attorney general Jeffrey Rosen: \"I don't think there was legal authority, either.\"\n\nLIVE UPDATES: https://t.co/fyXdG4l9EE https://t.co/B0gHGukVRh","date":"Thu Jun 23 20:35:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"WATCH LIVE: Jan. 6 committee holds hearing focusing on the pressure then-Pres. Trump and his allies allegedly put on the Justice Department to help overturn the 2020 election. https://t.co/7AwvEHv8yH","date":"Thu Jun 23 20:27:38 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Actor Sean Penn is seen seated in the chamber during today's Jan. 6 House committee hearing. https://t.co/Pa7dVNPztl https://t.co/8TnTvcHeJV","date":"Thu Jun 23 20:27:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“We’ll call you when there’s an oil spill.”\n\nIn taped interview, ex-acting deputy AG Richard Donoghue said environmental lawyer Jeff Clark was \"not even competent to serve as the attorney general.\" https://t.co/BkjcGNc15C https://t.co/BkjcGNc15C https://t.co/5AUfDTSjTu","date":"Thu Jun 23 20:10:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger: \"The President didn’t care about actually investigating the facts. He just wanted the Department of Justice to put its stamp of approval on the lies.\" https://t.co/gbVuvOqjcZ https://t.co/PLmWhsyVvO","date":"Thu Jun 23 20:08:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ex-acting deputy AG on Pres. Trump's reaction when told DOJ couldn't simply change election outcome: \"He responded very quickly and said essentially...what I'm just asking you to do is just say it was corrupt and leave the rest to me and the Republican congressmen.\" https://t.co/9RNFkiVYg7","date":"Thu Jun 23 20:05:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger: \"Were any of the allegations that he brought up credible?\"\n\nFormer deputy acting attorney general Richard Donoghue: \"No.\"\n\nLIVE UPDATES:","date":"Thu Jun 23 19:57:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ex-deputy acting AG on Pres. Trump: \"It was clear to us that there were a lot of people whispering in his ear, feeding him these conspiracy theories...I felt that being blunt in that conversation might help make it clear to the president these allegations were simply not true.\" https://t.co/g49QFbyD6K","date":"Thu Jun 23 19:56:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court has ruled law enforcement officers can’t be sued for money damages when they violate the rights of criminal suspects by failing to provide the familiar Miranda warning before questioning them. https://t.co/xlkYOIBho1","date":"Thu Jun 23 19:48:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Kinzinger: “In the weeks leading to Jan. 6, the Department of Justice was fielding almost daily requests from the president to investigate claims of election fraud.\"\n\n\"Each claim was refuted time and time again.” https://t.co/gbVuvOqjcZ https://t.co/e84MJETVbU","date":"Thu Jun 23 19:44:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger speaks \"directly to my fellow Republicans\":  \"Imagine the country's top prosecutor, with the power to open investigations, subpoena, charge crimes and seek imprisonment...pursuing the agenda of the other party, instead of that of the American people.\" https://t.co/IzbWibGzzN","date":"Thu Jun 23 19:34:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger on former Trump Justice Department official Jeffrey Clark: \"What was his only qualification? That he would do whatever the president wanted him to do—including overthrowing a free and a fair democratic election.\" https://t.co/gbVuvOqR2x https://t.co/7oBWn2RQFp","date":"Thu Jun 23 19:28:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Liz Cheney thanks former top Justice Department officials for “your role in addressing and rebutting the false allegations of fraud at the root of Jan. 6.”\n\n“Thank you for standing up for the Constitution and for the rule of law.” https://t.co/Es8w6jOkeP https://t.co/mzz8l8O7V9","date":"Thu Jun 23 19:25:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Vice-chair Liz Cheney focused her opening statement on teasing a draft letter that Trump and former DOJ official Jeffrey Clark wanted the department to send to Georgia officials citing already disproven allegations of fraud.\n\nLIVE UPDATES: https://t.co/GSAKYc4DJo","date":"Thu Jun 23 19:23:38 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Kinzinger: \"When the president tried to misuse the [Justice Department] and install a loyalist at its helm, these brave officials refused and threatened to resign.\"\n\n\"They were willing to sacrifice their careers for the good of our country.\" https://t.co/gbVuvOqjcZ https://t.co/4VUzFQ3YFn","date":"Thu Jun 23 19:21:49 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LIVE UPDATES:Three former top officials in the Justice Department sat before lawmakers as Committee Chair Bennie Thompson convened the fifth public hearing this month. https://t.co/rtnDgfOA81","date":"Thu Jun 23 19:16:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: Jan. 6 committee holds hearing focusing on the pressure then-Pres. Trump and his allies allegedly put on the Justice Department to help overturn the 2020 election.\n\nWATCH LIVE: https://t.co/DJDVp0yDmB","date":"Thu Jun 23 19:09:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: The European Council has granted Ukraine and Moldova candidate status for EU membership, in what the European Council president called \"a historic moment.\" https://t.co/5Weh49HYes","date":"Thu Jun 23 19:00:29 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: CDC committee greenlights the Moderna COVID-19 vaccine for kids ages 6 to 17. https://t.co/rYMPsJmLIM","date":"Thu Jun 23 18:47:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Trumpet the bloodhound beat a French bulldog, a German shepherd, a Maltese, an English setter, a Samoyed and a Lakeland terrier to win Best in Show at the 146th Westminster Kennel Club Dog Show. https://t.co/wTOcAGmYHd","date":"Thu Jun 23 18:30:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Over the years, lightning fatalities have been on the decline, according to the National Lightning Safety Council. But just this week, a woman was killed by lightning while walking her dogs in Los Angeles County. https://t.co/Wzn4pvV6DA","date":"Thu Jun 23 18:09:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court ruling striking down a New York state gun law is sparking a furor from Albany to Washington as gun safety activists and Democrats warn the ruling will lead to more guns, and more violence. https://t.co/bqCyfVDtUB","date":"Thu Jun 23 17:47:24 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Jan. 6 House committee is set to bring into focus former Pres. Trump's relentless post-Election Day efforts to enlist the Justice Department in his failed bid to overturn his election loss. https://t.co/38VkCQBGZV","date":"Thu Jun 23 17:26:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Federal agents have searched the Virginia home of Jeffrey Clark, a former DOJ official tied to Donald Trump's efforts to overturn the 2020 election, sources tell @ABC News. https://t.co/yA6XBQVrb4","date":"Thu Jun 23 17:20:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: The Senate voted to cut off debate on a gun safety bill crafted amid a disturbing uptick in shootings across the U.S. https://t.co/k9NX4yBHG8","date":"Thu Jun 23 17:06:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Feds search home of former DOJ official tied to Trump’s efforts to overturn election. https://t.co/aMOLBrZajI","date":"Thu Jun 23 16:59:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia's Supreme Court overturns murder conviction of Justin Ross Harris, a father who went on trial for his son's hot car death, saying much of the sexually related evidence the jury heard was \"needlessly cumulative and prejudicial.\" https://t.co/kKnJTs7Jun","date":"Thu Jun 23 16:59:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After falling from the 10th floor of the beachfront condo tower that collapsed a year ago in Surfside, a teenage boy landed in a crevice, trapped inside a pocket amid fallen concrete. \n\nA dog walker saw Jonah’s hand waving from the rubble and got help. https://t.co/j4rEE1cRDQ","date":"Thu Jun 23 16:36:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Pres. Biden responds to Supreme Court ruling striking down New York law regulating concealed handguns in public: \"We must do more as a society — not less — to protect our fellow Americans.” https://t.co/AVqsbAsCsy https://t.co/o6XKgsF5np","date":"Thu Jun 23 16:02:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Manhattan DA hits back at Supreme Court's decision to strike down restrictive New York gun law: \"The Supreme Court may have made our work harder, but we will only redouble our efforts to develop new solutions to end the epidemic of gun violence.” https://t.co/AtL0HmSlMS https://t.co/2gHdrvdJ2j","date":"Thu Jun 23 15:36:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court struck down a New York gun law regulating concealed carry in one of the biggest gun rights cases in over a decade.\n\nHere's what to know: https://t.co/ic0FfM3hVp","date":"Thu Jun 23 15:24:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"This decision isn't just reckless—it's reprehensible.\"\n\nGov. Kathy Hochul decries Supreme Court decision striking down New York gun law, calling it \"frightful in its scope of how they are setting back this nation and our ability to protect our citizens.\" https://t.co/VzW5hlXLn6 https://t.co/2yt77wrc9q","date":"Thu Jun 23 15:22:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly 1 in 5 American adults who have had COVID-19 are still suffering from long-haul symptoms, according to new data collected by the Census Bureau and the CDC's National Center for Health Statistics. https://t.co/SC5EpdelpA","date":"Thu Jun 23 15:19:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: @TerryMoran on Supreme Court gun ruling: “The sweeping ruling…says that the history of the Second Amendment is crucial and that states must presume that there is a constitutional right to carry a firearm outside the home.” https://t.co/VzW5hlXLn6 https://t.co/Gjou5DIvJv","date":"Thu Jun 23 14:48:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: The FDA announced it is taking Juul Labs e-cigarettes and other products off the market. https://t.co/xcCWhXZzwo","date":"Thu Jun 23 14:46:49 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Supreme Court strikes down restrictive New York gun law. https://t.co/osH07p8KwG","date":"Thu Jun 23 14:44:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: Supreme Court rules in major Second Amendment case. https://t.co/R8ogijfcCm","date":"Thu Jun 23 14:38:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: The Supreme Court has ruled in a major case involving whether there's a fundamental right to carry a concealed gun outside the home in public for self-defense. https://t.co/TwpzNb0LXA","date":"Thu Jun 23 14:36:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Evidence suggests that vaccinated, low-risk individuals won't benefit from Pfizer's COVID-19 pill Paxlovid, new study shows. https://t.co/QVrNviHL7e","date":"Thu Jun 23 14:34:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The conflict in Ukraine has “sounded an alarm for humanity,” Chinese leader Xi Jinping says. https://t.co/pIt12IK8in","date":"Thu Jun 23 14:08:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A person was attacked by a shark at a beach near Monterey, California, sustaining \"significant\" injuries from the bite, authorities say. https://t.co/LMAlreccxS","date":"Thu Jun 23 13:46:09 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"While many Americans have noticed sky-high gasoline prices, the lesser-known increase in diesel costs could be what drives the U.S. economy into a recession, experts told @ABC News. https://t.co/wto1m3KgkL","date":"Thu Jun 23 13:24:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"How to find COVID vaccines for children under age 5: https://t.co/EER1DuVVxo","date":"Thu Jun 23 13:02:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Athletes competing at the 2022 USA Track and Field Outdoor Championships in Eugene, Oregon, will not have to worry about child care, thanks to fellow competitor Allyson Felix. https://t.co/1ezN4FZMyp","date":"Thu Jun 23 12:39:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The 52-year-old woman is the first person in the U.S. to die from a lightning strike this year. https://t.co/3AipBEOf7U","date":"Thu Jun 23 12:16:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Coach who rescued U.S. swimmer from bottom of pool after she fainted in the middle of her routine speaks exclusively to @GMA.\n\n@tjholmes has the story. https://t.co/bY81tiO3zr https://t.co/OhfqRXgSkd","date":"Thu Jun 23 12:10:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Hailey Bieber's recently launched skin care company is being sued. https://t.co/rxeJuFJYYB","date":"Thu Jun 23 11:53:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dramatic police bodycam video captures the moment emergency workers rescue a toddler from a burning mobile home in Wisconsin.\n\nTwo adults and a child were transported to the hospital for treatment. https://t.co/EAhrTX6S2u https://t.co/7P6qISAD3x","date":"Thu Jun 23 11:44:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly $100,000 in cash was taken in a weekend burglary at the Atlanta home of former NBA player Vince Carter, according to an incident report released by Atlanta Police. https://t.co/XSEtIBGaaP","date":"Thu Jun 23 11:26:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LATEST: More than 8 million people have fled Ukraine since the start of the Russian invasion on Feb. 24, according to an update by the United Nations. https://t.co/rt0sbM4R8z https://t.co/umxNji8Jao","date":"Thu Jun 23 11:06:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ohio State University has been granted a trademark to use the word \"THE\" on apparel and merchandise. https://t.co/kKGGvmqJ8i","date":"Thu Jun 23 11:03:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"This Arkansas father decided to shave off all his hair — dreadlocks that he'd been growing for the last 10 years — to match his younger daughter, who lost her own hair after starting chemotherapy. https://t.co/pziSAfr9Nv","date":"Thu Jun 23 10:43:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Only her quick reaction prevented a tragedy as U.S. coach Andrea Fuentes made a dramatic rescue. https://t.co/wfitbjrGOC","date":"Thu Jun 23 10:19:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"THAT’S CLOSE ENOUGH: This bear followed a woman along a bush walkway for more than three minutes, continuing to track her during her hike as she tried to scare the animal away. https://t.co/H26TVomw98 https://t.co/PiIhKeFyIb","date":"Thu Jun 23 10:11:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A person was attacked by a shark at a beach near Monterey, California, sustaining \"significant\" injuries from the bite, authorities say. https://t.co/Jma48LUapk","date":"Thu Jun 23 10:06:29 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Michael J. Fox is set to receive an honorary Oscar at this year’s Governors Awards, the Academy of Motion Picture Arts and Sciences announced. https://t.co/WgCEgcauMQ","date":"Thu Jun 23 09:46:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"5-year-old boy dies after being left in a hot car in Houston as record-high temperatures struck the city. https://t.co/lGMPOLfvVb","date":"Thu Jun 23 09:21:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"I'M WITH YOU: When 1-year-old Nova Stokes was diagnosed with stage 4 high-risk neuroblastoma, her dad made sure his daughter didn’t feel alone. https://t.co/rmIMjZV65Z https://t.co/467e9c4kuy","date":"Thu Jun 23 09:10:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A woman who feared for her life as she was allegedly being held hostage found a way to call for help without alerting her captor — an online breakfast order. https://t.co/RhkwP4bgy4","date":"Thu Jun 23 08:58:29 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After falling from the 10th floor of the beachfront condo tower that collapsed a year ago in Surfside, a teenage boy landed in a crevice, trapped inside a pocket amid fallen concrete. \n\nA dog walker saw Jonah’s hand waving from the rubble and got help. https://t.co/Oi4yvlyVbx","date":"Thu Jun 23 08:33:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"These parents dress up as superheroes to inspire their son with leukemia and help him through his treatments. https://t.co/PugOhUi5II https://t.co/gaNNWzUZRU","date":"Thu Jun 23 08:12:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Police late Wednesday released a photo of a person of interest connected to the shooting. https://t.co/gzFo7rz1GN","date":"Thu Jun 23 07:50:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Survivors dig by hand through villages in eastern Afghanistan reduced to rubble by a powerful earthquake that killed at least 1,000 people. https://t.co/iE3B6QoBek","date":"Thu Jun 23 07:26:49 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"26-year-old pleads not guilty to attempting to kill Supreme Court Justice Brett Kavanaugh. https://t.co/cZf5m0of2n","date":"Thu Jun 23 07:02:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Prince William is speaking out about the protests he and his wife Kate, the Duchess of Cambridge faced during their tour of the Caribbean. https://t.co/5JD0fQNF2R","date":"Thu Jun 23 06:38:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dramatic police body-camera video released by the New York Police Department captured two officers teaming up on a rush-hour rescue of a woman this week who collapsed on a subway platform and fell onto the tracks. https://t.co/6HXptMFLYr","date":"Thu Jun 23 06:16:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"About a third of girls in the country are pregnant before turning 15, according to UNICEF. https://t.co/1qcHFSTfba","date":"Thu Jun 23 05:54:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Walmart is expanding health care coverage for employees who want to use a doula, a person trained to assist women during pregnancies, in an effort to address racial inequities in maternal care. https://t.co/Yt2TwwoGYs","date":"Thu Jun 23 05:29:47 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The embattled police chief of the Texas school district where 19 children and two teachers were killed in a school shooting has been placed on administrative leave. https://t.co/xAaoDgyYCH","date":"Thu Jun 23 05:08:17 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"John Wood, a Republican lawyer and former federal prosecutor who has helped lead the House Jan. 6 committee's investigation, is leaving his role with the panel amid calls for him to instead enter the Missouri Senate race as an independent candidate. https://t.co/W6ZFWtcWFp","date":"Thu Jun 23 04:46:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After receiving some shooting tips, Vice Pres. Harris finally sank a shot as she visited American University in Washington, D.C., to mark the 50th anniversary of Title IX becoming law. https://t.co/ivfaMYFiHz https://t.co/ACn7CYZNso","date":"Thu Jun 23 04:25:42 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I'm not a yes right now, that's for sure.\"\n\nIn an exclusive interview with @rachelvscott, Sen. Joe Manchin expressed several concerns with Pres. Biden's proposed gas tax holiday. https://t.co/yMXbjDXIEi https://t.co/zUoM7Rv3yx","date":"Thu Jun 23 04:20:34 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After Thursday's hearing, the House Jan. 6 select committee will delay its final hearings for several weeks, a spokesperson confirmed to @ABC News. https://t.co/rCIbUik2TS","date":"Thu Jun 23 04:05:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Trumpet the bloodhound beat a French bulldog, a German shepherd, a Maltese, an English setter, a Samoyed and a Lakeland terrier to win Best in Show at the 146th Westminster Kennel Club Dog Show. https://t.co/jFjWeiIWKz","date":"Thu Jun 23 03:41:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia's Supreme Court has overturned the murder conviction of Justin Ross Harris, a father who went on trial for his son's hot car death, saying much of the sexually related evidence the jury heard was \"needlessly cumulative and prejudicial.\" https://t.co/PCxT4JFs8p","date":"Thu Jun 23 03:37:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“Five minutes in … she was already crying, and I was crying.” https://t.co/3oecSngUh4","date":"Thu Jun 23 03:10:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Australian state becomes the first in the country to pass a law banning the public display of Nazi swastikas. https://t.co/ZgSaRdlwMo","date":"Thu Jun 23 02:48:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly 1 in 5 American adults who have had COVID-19 are still suffering from long-haul symptoms, according to new data collected by the Census Bureau and the CDC's National Center for Health Statistics. https://t.co/Nk6Iovlbbw","date":"Thu Jun 23 02:22:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida, officials say. National Geographic documented the discovery, highlighting the continued impact of the invasive pythons. https://t.co/l5teaA3w6N","date":"Thu Jun 23 02:17:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"@RobMarciano The woman, who hasn't been identified, is the first person in the U.S. to die from a lightning strike this year. https://t.co/vYLPXNQw98","date":"Thu Jun 23 01:58:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A Southern California woman and her two dogs were struck and killed by lightning on Wednesday. ABC News meteorologist @RobMarciano has more. https://t.co/SfxZ2C03q3 https://t.co/o5oxDUbx5a","date":"Thu Jun 23 01:56:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Jan. 6 House committee is set to bring into focus former Pres. Trump's relentless post-Election Day efforts to enlist the Justice Department in his failed bid to overturn his election loss. https://t.co/tYyyKWxrw7","date":"Thu Jun 23 01:47:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Included in the anti-gun violence legislation announced by a bipartisan group of senators is a measure that supporters hope will help protect victims of domestic violence. https://t.co/tE8zHYjUux","date":"Thu Jun 23 01:33:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The House Committee on Oversight and Reform held a hearing to investigate the NFL's handling of what lawmakers are calling the Washington Commanders' \"toxic\" workplace culture, including sexual harassment. https://t.co/OOsPbkiCL5","date":"Thu Jun 23 01:25:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Evidence suggests that vaccinated, low-risk individuals won't benefit from Pfizer's COVID-19 pill Paxlovid, new study shows. https://t.co/C2tGuasS0R","date":"Thu Jun 23 00:58:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden is calling on Congress to suspend the federal gas tax for three months and asking states to suspend their own gas taxes or provide commensurate relief to consumers. https://t.co/wKhdkqG078","date":"Thu Jun 23 00:51:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ohio State University has won its fight to trademark the word “The.” https://t.co/tpKC4ObSy7","date":"Thu Jun 23 00:38:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ohio State University has been granted a trademark to use the word \"THE\" on apparel and merchandise to promote its athletic teams. https://t.co/oTHKD8sz3A","date":"Thu Jun 23 00:12:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A person was attacked by a shark at a beach near Monterey, California, sustaining \"significant\" injuries from the bite, authorities say. https://t.co/TUomnravE5","date":"Wed Jun 22 23:50:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The suburban Minneapolis city of Brooklyn Center has tentatively agreed to pay $3.25 million to settle a wrongful death lawsuit brought by the family of Daunte Wright. https://t.co/FdpYzUvmtc","date":"Wed Jun 22 23:19:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: Uvalde school district puts police chief Pete Arredondo on administrative leave. https://t.co/dAyifnUBhi","date":"Wed Jun 22 22:54:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Yellowstone National Park reopened three of its five entrances to visitors on Wednesday after unprecedented flooding closed the park on June 13 and reshaped many of its rivers, canyons and roads. https://t.co/cjBbLnLsO3","date":"Wed Jun 22 22:50:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Lina Sardar Khil disappeared from a park near her family's home in San Antonio in December and six months later, police appear no closer to finding the 4-year-old. https://t.co/KZmD7ZEuwi","date":"Wed Jun 22 22:27:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Three waterspouts were spotted spinning in Mobile Bay, Alabama, as the NWS issued a special marine warning for the coastal area. https://t.co/iWd3qY3CZA https://t.co/bRUpGw4LyD","date":"Wed Jun 22 22:23:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Lawyers for the parents of Gabby Petito and Brian Laundrie are scheduled to appear in Sarasota County Court in Florida in a hearing to dismiss a civil lawsuit brought by the Petitos. https://t.co/slVpOnsXFO","date":"Wed Jun 22 22:06:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dramatic body camera footage shows the moment a passenger suffered a medical episode and fell onto the subway tracks in Brooklyn, New York, minutes before the train arrived.\n\nFast-acting officers safely pulled them back on to the platform. https://t.co/1NafwK8uor https://t.co/11U8uKMoOq","date":"Wed Jun 22 21:42:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A woman who feared for her life as she was allegedly being held hostage in a New York City apartment found an alternative way to call for help without alerting her captor. https://t.co/Hx5QjTZfr0","date":"Wed Jun 22 21:30:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"GET QUACK HERE: A rescue bear at a sanctuary in New York tried to catch a pair of ducks swimming in a pond—to no avail. https://t.co/AIGFICUTRG https://t.co/pQBB8Oc62I","date":"Wed Jun 22 21:30:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nicholas Roske pleaded not guilty to one count of attempting to kill a justice of the United States, two weeks after he was arrested outside the home of Supreme Court Justice Brett Kavanugh's home with a gun. https://t.co/dVkf8uYzVd","date":"Wed Jun 22 21:06:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dramatic video shows passengers frantically evacuating a Red Air plane that caught on fire after landing at Miami International Airport; three people were hospitalized. \n\nRead more: https://t.co/E0l0Ocx9Uw https://t.co/BkFtFpNQhp","date":"Wed Jun 22 20:49:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"EU lawmakers are requiring deeper emission cuts from power plants, factories and planes in Europe while endorsing an unprecedented import tax to step up the fight against global warming. https://t.co/3lvXw7Vo5v","date":"Wed Jun 22 20:42:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A Texas state senator has filed a lawsuit against the state's Department of Public Safety, seeking access to the agency's records of its probe into the Uvalde shooting. https://t.co/PMSDTwAjj5","date":"Wed Jun 22 20:21:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"DEVELOPING: A search was underway for a gunman who shot two people, one fatally, on a packed Muni commuter train in San Francisco, police said. https://t.co/0U8rBCmTpu","date":"Wed Jun 22 19:55:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Biden administration announced Wednesday that it is providing logistical support to import the equivalent of about 16 million 8-ounce baby formula bottles from Mexico. https://t.co/dm4O1rofH4","date":"Wed Jun 22 19:50:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I'm not a yes right now, that's for sure.\"\n\nIn an exclusive interview with @rachelvscott, Sen. Joe Manchin expressed several concerns with Pres. Biden's proposed gas tax holiday. https://t.co/yMXbjDG7MK https://t.co/uRbfCi0v01","date":"Wed Jun 22 19:27:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Extreme heat is forcing the Atlanta Zoo to close its gates early on Wednesday and Thursday. https://t.co/YbkBR5Hj4v","date":"Wed Jun 22 19:19:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Biden administration announced that it is providing logistical support to import the equivalent of about 16 million 8-ounce baby formula bottles from Mexico. https://t.co/Mf9rspd2yv","date":"Wed Jun 22 18:58:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"After digging out of a daunting backlog from 2021, the agency has an even bigger backup for this tax season than it did a year ago and its pace for processing paper returns is slowing down, according to a watchdog report. https://t.co/YH1SJbQQAf","date":"Wed Jun 22 18:34:52 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Uvalde Mayor Don McLaughlin slammed Steven McCraw and the Texas Public Safety Department Tuesday for a lack of transparency following the Robb Elementary School massacre. https://t.co/j5D2pE570r","date":"Wed Jun 22 18:12:21 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"MORE: Initially, the committee was expected to hold its sixth and seventh hearings by the end of June. But after Tuesday's session, members said they need more time to incorporate new information into their public presentations. https://t.co/rXuBgTo8hr","date":"Wed Jun 22 18:08:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Michael J. Fox is set to receive an honorary Oscar at this year’s Governors Awards, the Academy of Motion Picture Arts and Sciences announced. https://t.co/dPEkXjITci","date":"Wed Jun 22 18:03:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: After Thursday's hearing, the House Jan. 6 select committee will delay its final hearings for several weeks, a spokesperson confirmed to @ABC News. https://t.co/MgrBqfqFtG","date":"Wed Jun 22 17:43:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I have more than 30 years of experience. But this was the most difficult flight in my career.\" https://t.co/had0sonUC3","date":"Wed Jun 22 17:20:38 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Retiring Michigan teacher receives standing ovation at a Grand Rapids high school on her last day of classes, an emotional moment that has since gone viral on TikTok. https://t.co/Wf4ikgRZaJ","date":"Wed Jun 22 16:57:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia's Supreme Court has overturned the murder conviction of Justin Ross Harris, a father who went on trial for his son's hot car death, saying much of the sexually related evidence the jury heard was \"needlessly cumulative and prejudicial.\" https://t.co/GJm06G0tFs","date":"Wed Jun 22 16:41:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"New York State Rifle &amp; Pistol Asso­ci­ation Inc. v Bruen, addresses whether New York state's concealed carry law violates the Second Amendment. https://t.co/RlUfotW708","date":"Wed Jun 22 16:26:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Sen. Ron Johnson responded to the House Jan. 6 committee's findings that he apparently wanted to deliver fake electoral votes for Donald Trump from Wisconsin and Michigan to Vice Pres. Pence on Jan. 6, 2021. https://t.co/p5PpKEY0qe","date":"Wed Jun 22 16:08:33 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Dangerously high temperatures are slamming the U.S., with the West, South and North feeling the heat. https://t.co/jdoueo9iLw","date":"Wed Jun 22 15:52:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Wright County sheriff's deputies have been in a daylong standoff with a suspect carrying a rifle in St. Michael, Minnesota. https://t.co/2EqhJVZ4wS","date":"Wed Jun 22 15:48:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Police on Long Island said they received at least 11 reports from people who said they gave money to buy cookies they never received. https://t.co/gAMIYWzO9n","date":"Wed Jun 22 15:34:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jurors at a civil trial found that Bill Cosby sexually abused a 16-year-old girl at the Playboy Mansion in 1975.\n\nThe Los Angeles County jury delivered the verdict in favor of Judy Huth, who is now 64, and awarded her $500,000. https://t.co/VXF5iEaLYC","date":"Wed Jun 22 15:19:21 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"These two dogs have been best friends their whole lives.\n\nWatch their joy when they're reunited after weeks apart. https://t.co/J5WlUfeNuU https://t.co/kZqO1uUoNY","date":"Wed Jun 22 15:15:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Amid Jan. 6 hearings praising him, Pence talks past 'tragic' insurrection to tout time with Trump. https://t.co/13w2g9jsIj","date":"Wed Jun 22 15:04:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"CRUSHING CRIME: Illegal dirt bikes confiscated by the NYPD get destroyed by a bulldozer.\n\n2,000 illegal vehicles have already been impounded by the NYPD this year, an 88% increase from last year. https://t.co/iWd3qY3CZA https://t.co/E63OLrxaDa","date":"Wed Jun 22 15:04:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ukrainian photojournalist and soldier accompanying him appear to have been “coldly executed” during first weeks of war in Ukraine as they searched in Russian-occupied woods for the photographer’s missing camera drone, Reporters Without Borders says. https://t.co/DjjYYn5641","date":"Wed Jun 22 14:58:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Americans are changing their views on the need for climate change action as severe weather events caused by global warming are landing in their backyards with more frequency, according to a new report. https://t.co/rXqYQMjHUQ","date":"Wed Jun 22 14:52:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court ruled that the state of Maine must allow parents who receive taxpayer-funded tuition assistance payments to use them at religious schools, saying a ban on the practice had violated the First Amendment. https://t.co/6zY2yNs18w","date":"Wed Jun 22 14:48:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. Coast Guard urgently searching for a couple from Virginia Beach, Virginia, who were last heard from hundreds of miles offshore in the Atlantic Ocean while they were on a sailing trip to the Azores, Portugal. https://t.co/5HTJeu3vK5","date":"Wed Jun 22 14:26:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"South Dakota Attorney General Jason Ravnsborg has been convicted in impeachment charges and removed from office over the aftermath following a fatal car crash in 2020 he was involved in. https://t.co/ppEnfOHRTe","date":"Wed Jun 22 14:10:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The landing gear on the plane collapsed when it landed, the FAA said in a statement to @ABC News. https://t.co/p6EngwBktc","date":"Wed Jun 22 13:51:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The move would give drivers immediate relief but has downsides, experts say. https://t.co/mW7B8dydgG","date":"Wed Jun 22 13:35:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Helicopter evacuates injured after massive Afghanistan earthquake leaves at least 1,000 people dead. https://t.co/CcuhviYKNi https://t.co/gvDTZNWYfr","date":"Wed Jun 22 13:34:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The scope of the damage is still being tallied by Yellowstone officials, but based on other national park disasters, it could take years and cost upwards of $1 billion to rebuild. https://t.co/hXjatfe7pe","date":"Wed Jun 22 13:19:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Fast food worker arrested after customer finds bag of methamphetamine in their order. https://t.co/kGbpWLchJw https://t.co/EPUenjwJYr","date":"Wed Jun 22 13:04:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"If someone was recently infected with a BA.2 lineage, are they mostly protected against reinfection with BA.4 or BA.5?\n\nProbably not, infectious disease experts say. https://t.co/RDkYXPQg0Q","date":"Wed Jun 22 12:44:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A decision in the U.S. Supreme Court's biggest gun rights case in over a decade is expected to land any day now. https://t.co/GWTevpdVCy","date":"Wed Jun 22 12:31:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Sen. Ron Johnson pushed back on the Jan. 6 committee's findings that he apparently wanted to deliver fake electoral votes for Donald Trump from Wisconsin and Michigan to Vice Pres. Mike Pence on Jan. 6, 2021. https://t.co/jrYYWqZNyH","date":"Wed Jun 22 12:25:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"It’s the third time the National Labor Relations Board has filed a case in federal court against Starbucks since December, when a store in Buffalo, New York, became the coffee chain's first location in decades to unionize. https://t.co/4wrQ4S4kd1","date":"Wed Jun 22 12:09:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Uvalde City Council unanimously denies council member Pete Arredondo's request for a leave of absence from future meetings. https://t.co/ZhuaSMGGhI","date":"Wed Jun 22 11:52:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LATEST: At least 1,000 people have been killed and more than 1,500 others have been injured in a powerful earthquake in eastern Afghanistan, according to state media. https://t.co/YT0vQzVJZP","date":"Wed Jun 22 11:35:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Oklahoma fast food worker arrested after customer discovers bag of methamphetamine in their order. https://t.co/0MmCh2dkc0","date":"Wed Jun 22 11:14:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“We are deeply saddened by reports of an earthquake in eastern Afghanistan,” U.S. Embassy in Kabul says as at least 920 people are killed and more than 600 others are injured. https://t.co/KGYnPf1xm9 https://t.co/QZ3TMWi1cX","date":"Wed Jun 22 10:59:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A little more than two years after the murder of George Floyd, the Minneapolis Police Department is looking for a new police chief, according to a nationwide search notification obtained by @ABC News. https://t.co/kf9EDrdslQ","date":"Wed Jun 22 10:44:32 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jurors at a civil trial found that Bill Cosby sexually abused a 16-year-old girl at the Playboy Mansion in 1975.\n\nThe Los Angeles County jury delivered the verdict in favor of Judy Huth, who is now 64, and awarded her $500,000. https://t.co/NtOwdQLbTy","date":"Wed Jun 22 10:25:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"HOMESICK HOUND: This dog escaped the pet hotel he was staying at and found his way back to his Kansas home while his owners were on vacation.\n\nThey reassured him through the doorbell camera speaker while they waited for someone to collect him safely. https://t.co/EAhrTWPhaW https://t.co/F3yLrTCDIR","date":"Wed Jun 22 10:11:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. Coast Guard urgently searching for a couple from Virginia Beach, Virginia, who were last heard from hundreds of miles offshore in the Atlantic Ocean while they were on a sailing trip to the Azores, Portugal. https://t.co/hYZPvfQSvq","date":"Wed Jun 22 10:07:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: At least 920 dead in earthquake in Afghanistan. https://t.co/9oM1klx5OV https://t.co/VHYUmcJIXX","date":"Wed Jun 22 09:52:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: At least 920 people killed and more than 600 others injured in powerful earthquake in eastern Afghanistan, local emergency official says. https://t.co/sdq1Xh9fl6","date":"Wed Jun 22 09:44:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“Five minutes in … she was already crying, and I was crying.” https://t.co/lQT4ACv8PD","date":"Wed Jun 22 09:44:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"White House press secretary Karine Jean-Pierre told reporters that Brittney Griner’s inability to reach her wife was an “unfortunate mistake,” adding that another phone call has been scheduled. https://t.co/reZDLi9YUj","date":"Wed Jun 22 09:26:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: Pres. Biden to call on Congress, states to suspend gas taxes. https://t.co/XUxBC4a3S6 https://t.co/6MOENoIJJ0","date":"Wed Jun 22 09:10:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The federal government charges an 18.4-cent tax per gallon of gasoline and a 24.4-cent tax per gallon of diesel. \n\nSuspending the tax for three months — through the end of September, as Biden will call for — will cost about $10 billion, White House says. https://t.co/3zohWZZ9xu","date":"Wed Jun 22 09:09:09 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Pres. Biden will call on Congress to suspend the federal gas tax for three months and ask states to suspend their own gas taxes or provide commensurate relief to consumers, according to the White House. https://t.co/7q6SZM70Hg","date":"Wed Jun 22 09:01:34 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A 5-year-old boy died after being left in a hot car in Houston as record-high temperatures struck the city. https://t.co/ZSDNQjnmpF","date":"Wed Jun 22 08:58:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The clash between the Biden administration and oil producers and refiners unfolded comes ahead of a Thursday meeting that Energy Secretary Jennifer Granholm will hold with energy companies. https://t.co/Eh08zyMhlL","date":"Wed Jun 22 08:41:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Indianapolis typically fills 17 pools each year, but with a national lifeguard shortage exacerbated by the COVID-19 pandemic, just five are open this summer. https://t.co/aVqekJZMOd","date":"Wed Jun 22 08:21:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Neither inflation nor war in Ukraine seem to be threatening to take a bite out of the luxury fashion market. https://t.co/etzhoB4ywF","date":"Wed Jun 22 08:03:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Earthquake strikes eastern Afghanistan, killing at least 255 people, authorities say. https://t.co/Uon0Qfet80","date":"Wed Jun 22 07:47:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A new law barring sales of bullet-resistant vests to most civilians in New York doesn't cover the type of armor worn by the gunman who killed 10 people at a Buffalo supermarket. https://t.co/McuXgWhxmN","date":"Wed Jun 22 07:25:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A retiring Michigan teacher received a standing ovation at a Grand Rapids high school on her last day of classes, an emotional moment that has since gone viral on TikTok. https://t.co/GibZzyJazQ","date":"Wed Jun 22 07:06:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Women are significantly more likely than men to experience long-term symptoms of COVID-19, a new review suggests. https://t.co/vWfHvEWxwF","date":"Wed Jun 22 06:47:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"“Every time an incident happens nationally, it hits really close to home for us.\" https://t.co/5y6zVGjW8F","date":"Wed Jun 22 06:24:42 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Amid Jan. 6 hearings praising him, Pence talks past 'tragic' insurrection to tout time with Trump. https://t.co/qSacLUDfo8","date":"Wed Jun 22 06:04:42 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court ruled that the state of Maine must allow parents who receive taxpayer-funded tuition assistance payments to use them at religious schools, saying a ban on the practice had violated the First Amendment. https://t.co/yhbr6sSzsy","date":"Wed Jun 22 05:49:25 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Police on Long Island said they received at least 11 reports from people who said they gave money to buy cookies they never received. https://t.co/E07fBBxQPH","date":"Wed Jun 22 05:32:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Louisiana Gov. John Bel Edwards has signed two abortion bills into law that ban most abortions in the state and criminalize providers who perform the procedure. https://t.co/9SFkQ4zkjI","date":"Wed Jun 22 05:14:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The alleged shooter who killed three people in an Alabama church had multiple firearms violations against his federal firearms business in 2018, according to ATF documents obtained by @ABC News. https://t.co/A0tLN1DO1B","date":"Wed Jun 22 04:57:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court has rejected Bayer's appeal to shut down thousands of lawsuits claiming that its Roundup weedkiller causes cancer. https://t.co/yvrjZ2G6sr","date":"Wed Jun 22 04:41:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Piles of plastic waste wash up on the shores of Guatemala from the Rio Motagua, considered one of the most polluted rivers in the world, according to environmentalists.\n\nThis footage was captured this month by Florida-based environmental group 4Ocean. https://t.co/IjrpMJunNX https://t.co/vASVCQPa7f","date":"Wed Jun 22 04:20:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I have more than 30 years of experience. But this was the most difficult flight in my career.\" https://t.co/cgUKQmiCjn","date":"Wed Jun 22 04:04:54 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Sen. Ron Johnson pushed back on the Jan. 6 committee's findings that he apparently wanted to deliver fake electoral votes for Donald Trump from Wisconsin and Michigan to Vice Pres. Mike Pence on Jan. 6, 2021. https://t.co/K3wpepU4nq","date":"Wed Jun 22 03:46:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"STONEHENGE SUNRISE: Crowds gather at the ancient monument of Stonehenge in England to mark the summer solstice, the first such gathering since 2019 because of COVID-19 restrictions. https://t.co/AyK44keuLE https://t.co/yRuN44vOnh","date":"Wed Jun 22 03:41:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The South Dakota Senate has convicted Attorney General Jason Ravnsborg of two impeachment charges stemming from a 2020 fatal accident, removing and barring him from future office. https://t.co/cFJ3dFSUq8","date":"Wed Jun 22 03:18:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Texas Director of Public Safety Steven McCraw said his department’s ongoing probe has uncovered \"compelling evidence\" to suggest that the police response to the Uvalde school shooting \"was an abject failure.\" https://t.co/bLqjyv8GwR https://t.co/66CfXdsWIf","date":"Wed Jun 22 02:59:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Justice Department says Facebook will change its algorithms to prevent discriminatory housing advertising as its parent company subjects itself to court oversight in a response to a U.S. lawsuit. https://t.co/3ah1KXWbhF","date":"Wed Jun 22 02:36:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"An airman has been arrested in the U.S. in connection with an April attack at a base in Syria that injured four other U.S. service members, according to statement from an Air Force official. https://t.co/1KHtk280fV","date":"Wed Jun 22 02:14:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Iranian officers' mysterious deaths probed amid rising tensions with Israel. https://t.co/p0WVmr4gJC","date":"Wed Jun 22 01:57:07 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Footage captured by a passenger shows a Red Air jet on fire after landing at Miami International Airport. Officials say there were 126 people on the flight from the Dominican Republic, with three transported to area hospitals. https://t.co/qGJpQSv1kz https://t.co/vpGGYFr3bk","date":"Wed Jun 22 01:41:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Nobel Peace Prize auctioned off by Russian journalist Dmitry Muratov to raise money for Ukrainian child refugees sold Monday night for $103.5 million, shattering the old record for a Nobel. https://t.co/KvuKWhOen0","date":"Wed Jun 22 01:35:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The landing gear on the plane collapsed when it landed, the FAA said in a statement to @ABC News. https://t.co/Ghr8tQeFpP","date":"Wed Jun 22 01:17:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Kellogg has announced that it will separate into three different companies to create \"greater strategic, operational, and financial focus\" for each of the new firms that will be named at a later date. https://t.co/bKAniTwjJC","date":"Wed Jun 22 01:08:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The latest Jan. 6 committee hearing focused on what it said was Donald Trump's \"unprecedented\" effort to push key state officials to reject the results of the 2020 election.\n\nHere are some key takeaways from Tuesday's hearing: https://t.co/tvTsNzTVMf https://t.co/WZwdkHNvTf","date":"Wed Jun 22 00:46:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Americans are changing their views on the need for climate change action as severe weather events caused by global warming are landing in their backyards with more frequency, according to a new report. https://t.co/rM0Cav1K3f","date":"Wed Jun 22 00:25:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jurors at a civil trial found that Bill Cosby sexually abused a 16-year-old girl at the Playboy Mansion in 1975.\n\nThe Los Angeles County jury delivered the verdict in favor of Judy Huth, who is now 64, and awarded her $500,000. https://t.co/hyZcVKOmec","date":"Wed Jun 22 00:08:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A little more than two years after the murder of George Floyd, the Minneapolis Police Department is looking for a new police chief, according to a nationwide search notification obtained by @ABC News. https://t.co/9Au786aniR","date":"Tue Jun 21 23:51:09 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The embattled police chief who acted as incident commander in the Uvalde school massacre testified in front of Texas legislators for almost five hours as the grieving community calls for his resignation. https://t.co/octIRy9ycy","date":"Tue Jun 21 23:34:21 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A pilot described to @ABC News the fear he felt during an early morning mission to deliver around 2 tons of aid from Dnipro, about 150 miles north of Mariupol, and evacuate the wounded from the plant. https://t.co/seqd99tq3K","date":"Tue Jun 21 23:16:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The summer solstice has arrived and is bringing record-breaking temperatures to a large swath of the country. https://t.co/7qSOwJfOtc","date":"Tue Jun 21 22:55:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: After weeks of negotiation, a bipartisan group of senators has released their anti-gun violence bill — setting up a vote in the upper chamber as early as this week. https://t.co/UvJUeYqcII","date":"Tue Jun 21 22:34:52 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. citizen Stephen Zabielski has died in Ukraine, the State Department confirmed to @ABC News. https://t.co/WhoggQlrGA","date":"Tue Jun 21 22:26:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"For the second time this month, a Minnesota judge has changed the start date of a state trial for two former Minneapolis police officers charged with aiding and abetting in George Floyd's 2020 in-custody death. https://t.co/MaJNVhaFBJ","date":"Tue Jun 21 22:03:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Cherelle and Brittney Griner, the WNBA star who has been detained in Russia, were expected to speak for the first time on Saturday to mark their fourth wedding anniversary. https://t.co/lXbW2igWJ3","date":"Tue Jun 21 21:45:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A 5-year-old boy has died after being left in a hot car in Houston as record-high temperatures struck the city. https://t.co/X4oy2lCFHQ","date":"Tue Jun 21 21:22:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A rebel.\n\nA star. \n\nA staple.\n\nExclusively Elvis - tonight on @ABC and stream tomorrow on Hulu. https://t.co/GZeHrQenDe","date":"Tue Jun 21 21:20:38 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"📸 THROUGH THE LOOKING GLASS: Athletes compete in the Artistic Swimming Duet Free Preliminary on day five of the Budapest 2022 FINA World Championships in Budapest, Hungary. https://t.co/A47RLl8nZ3 https://t.co/1ABAE2Ws7a","date":"Tue Jun 21 21:03:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"French President Emmanuel Macron was holding talks Tuesday with France’s main party leaders after his centrist alliance failed to win an absolute majority in parliamentary elections. https://t.co/kXKZDhbsQu","date":"Tue Jun 21 20:45:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Supreme Court ruled that the state of Maine must allow parents who receive taxpayer-funded tuition assistance payments to use them at religious schools, saying a ban on the practice had violated the First Amendment. https://t.co/WuaY9qor7Y","date":"Tue Jun 21 20:27:11 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"Whether [Pres. Trump's] actions were criminal will ultimately be for others to decide,\" Rep. Adam Schiff says, adding they were \"without a doubt unconstitutional.\" https://t.co/XXhJAyHp2w https://t.co/VPn9Xng3hA","date":"Tue Jun 21 20:15:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"So if someone was recently infected with a BA.2 lineage, are they mostly protected against reinfection with BA.4 or BA.5?\n\nProbably not, infectious disease experts say. https://t.co/RurG6M9pse","date":"Tue Jun 21 20:05:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Rep. Adam Schiff: \"If the most powerful person in the world can bring the full weight of the presidency down on an ordinary citizen who is merely doing her job, with a lie as big and heavy as a mountain, who among us is safe? None of us is.\" https://t.co/XXhJAyHp2w https://t.co/Q8RgnspNUl","date":"Tue Jun 21 20:03:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A wildfire in New Jersey's Wharton State Forest has become the state's largest fire since 2007. https://t.co/Fpo25fT3ZZ","date":"Tue Jun 21 19:47:47 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ruby Freeman, ex-Fulton County election worker: \"Do you know how it feels to have the president of the United States to target you?\"\n\n\"The president of the United States is supposed to represent every American—not to target one.\" https://t.co/XXhJAyHp2w https://t.co/Ny4tRFkkED","date":"Tue Jun 21 19:36:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A New Hampshire lobster fisherman saved three people and two dogs from a burning yacht near New Castle on Saturday. https://t.co/NjyF7XGJoZ","date":"Tue Jun 21 19:30:25 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"It's turned my life upside down....I don't want anybody knowing my name....All because of lies.\"\n\nEx-Fulton County election worker Shaye Moss says being falsely accused by Rudy Giuliani and others of election fraud has affected her life \"in every way.\" https://t.co/XXhJAyHp2w https://t.co/I4GCf5f7MX","date":"Tue Jun 21 19:26:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I've always been told by my grandmother how important is to vote.\"\n\nEx-Fulton County election worker Shaye Moss, who was falsely accused by Rudy Giuliani and others of election fraud, discusses what she loves about her job and why it's so important.\n\nhttps://t.co/XXhJAyHp2w https://t.co/I8zLgowPX4","date":"Tue Jun 21 19:19:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 Committee shows evidence that Sen. Ron Johnson attempted to deliver slates of \"fake\" Trump electors from Wisconsin and Michigan to then-Vice Pres. Mike Pence, according to text from Johnson staffer.\n\n“Do not give that to him,” Pence aide responded. https://t.co/OO4aRea0h7 https://t.co/SWOcQQ0i9D","date":"Tue Jun 21 19:15:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LIVE UPDATES: The committee aired audio from a call in which former Pres. Trump tried to convince Frances Watson, the Georgia secretary of state's lead elections investigator, to reverse his loss. https://t.co/J4Er4RiDq2","date":"Tue Jun 21 19:11:17 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia Sec. of State Brad Raffensperger describes threats against his family.\n\n\"Why didn't you just quit and walk away?\"\n\n\"Sometimes moments require you to stand up,\" Raffensperger replies. \"We just followed the law and we followed the Constitution.\"\n\nhttps://t.co/XXhJAyHp2w https://t.co/6o3WBvw8RP","date":"Tue Jun 21 19:09:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"Everything we describe today—the relentless, destructive pressure campaign on state and local officials—was all based on a lie. Donald Trump knew it. He did it anyway,\" Jan. 6 Chair Bennie Thompson says. https://t.co/fmVBR1sQn2 https://t.co/vf6emXP3Sg","date":"Tue Jun 21 19:02:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Arizona House Speaker Rusty Bowers recalls resisting pressure campaign from Rudy Giuliani and others who sought to overturn the 2020 election. https://t.co/bWyhe61ZBm https://t.co/FN4dZzx10A","date":"Tue Jun 21 18:46:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: The House select committee investigating the Jan. 6 attack on the Capitol continues hearing on the pressure campaign it says former Pres. Trump and allies put on state election officials.\n\nWATCH LIVE: https://t.co/qcEzZJKfDt","date":"Tue Jun 21 18:35:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Republican voters in Virginia are set to winnow a crowded field of candidates to two nominees to compete in what are expected to be a pair of the country’s most competitive U.S. House races. https://t.co/yWhSFLKICZ","date":"Tue Jun 21 18:20:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Asked about meeting to create \"fake\" slate of electors from Arizona, AZ Houser Speaker Rusty Bowers says, \"I thought of the book, 'The Gang That Couldn't Shoot Straight.' I just thought, this is a tragic parody.\" \n\nLIVE UPDATES: https://t.co/XXhJAyYZU4 https://t.co/g1aFaY7oVU","date":"Tue Jun 21 18:15:31 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"President and CEO of the American Camp Association Tom Rosenberg, said the shooting last week at the Duncanville Fieldhouse summer camp in Texas left him and others in his nonprofit organization \"taken aback.\" https://t.co/54vMHYfwKW","date":"Tue Jun 21 18:03:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"AZ House Speaker Rusty Bowers recalls request from John Eastman to decertify the electors: \"I said, you're asking me to do something that's never been done in the history of the United States, and I'm going to put my state through that, without sufficient proof?...No, sir.\" https://t.co/oQPkZHtVnB","date":"Tue Jun 21 17:59:55 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Michigan Senate Majority Leader Mike Shirkey recalls fallout from former Pres. Trump publishing his personal contact information online: \"All I remember is receiving just shy of 4,000 text messages... they were believing things that were not true.\" https://t.co/cNWdqEkik5 https://t.co/QAfkEKc9Ug","date":"Tue Jun 21 17:49:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Chair Bennie Thompson: \"Is it fair to say that you wanted Donald Trump to win a second term in office?\"\n\nArizona House Speaker Rusty Bowers: \"Yes, sir.\"\n\n\"And is it your understanding that Pres. Biden was the winner of the popular vote in Arizona in 2020?\"\n\nBowers: \"Yes, sir.\" https://t.co/LFfjfHv6cM","date":"Tue Jun 21 17:49:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: Louisiana Gov. John Bel Edwards signed two abortion bills into law that ban most abortions in the state and criminalize providers who perform the procedure. https://t.co/odpEGZ7DYP","date":"Tue Jun 21 17:43:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: Responding to statement from former Pres. Trump, Arizona House Speaker Rusty Bowers says, \"I did have a conversation with the president. That certainly isn't it.\"\n\n\"Anywhere, anyone, anytime has said that I said the election was rigged—that would not be true.\" https://t.co/RdekDJeYcJ","date":"Tue Jun 21 17:42:12 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: Stocks rose broadly on Wall Street, clawing back some of the ground they lost in their worst weekly drop since the beginning of the pandemic. https://t.co/YJpmwzBUkT https://t.co/bXBmPN5YHa","date":"Tue Jun 21 17:28:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 Vice Chair Liz Cheney: \"The same people who were attempting to pressure Vice Pres. Mike Pence to reject electoral votes immediately were simultaneously working to reverse the outcome of the election at the state level.\" https://t.co/0MMrXxmj38 https://t.co/zYJ1AQMVJj","date":"Tue Jun 21 17:19:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Only a month after North Korea acknowledged a COVID-19 outbreak was sickening its people, the country may be preparing to declare victory. https://t.co/g9kRGjFv4Z","date":"Tue Jun 21 17:18:43 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 Chair Thompson: \"Today we’ll show that what happened to Mike Pence wasn’t an isolated part of Donald Trump’s scheme to overturn the election. In fact, pressuring public servants into betraying their oaths was a fundamental part of the playbook.\" https://t.co/fmVBR1sQn2 https://t.co/sYoD1KEmKe","date":"Tue Jun 21 17:08:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":".@ABC NEWS SPECIAL REPORT: House select committee investigating the Jan. 6 attack on the Capitol holds hearing on pressure campaign it says former Pres. Trump and allies put on state election officials. \n\nWATCH NOW: https://t.co/K2HXwq27Nx","date":"Tue Jun 21 17:02:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LIVE UPDATES: The Jan. 6 committee holds a hearing focused on the pressure campaign it says former Pres. Trump and allies put on state election officials as part of a larger \"seven-part scheme\" to overturn the results of the 2020 election. https://t.co/y2wibFTWeO","date":"Tue Jun 21 17:00:36 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"LATEST: The House select committee has subpoenaed a British documentary filmmaker who had substantial access to Trump, his family and closest aides both before and after the Jan. 6 attack, according to a statement from the filmmaker obtained by @ABC News. https://t.co/M0sRZoYGxt","date":"Tue Jun 21 16:45:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"For an hour a week in a Damascus studio, Adnan Mohammed teaches a class the basics of Latin dancing, helping his students forget the troubles of war — if even briefly. https://t.co/KpJerrr80h","date":"Tue Jun 21 16:45:18 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ukraine's leader has told the African Union that the continent has been \"taken hostage” in Russia’s invasion of Ukraine amid catastrophically rising food prices. https://t.co/lUhtDZXuMB","date":"Tue Jun 21 16:27:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nuclear Russia's pillaging of non-nuclear Ukraine is rattling what's already a destabilizing moment in nuclear nonproliferation efforts. https://t.co/5cuxnu3taz","date":"Tue Jun 21 16:05:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"TO THE RESCUE: Firefighters and local police used a ladder to help a leopard that got stuck in a deep well in India. https://t.co/YN0ZYe69fv https://t.co/wWoP44r3qu","date":"Tue Jun 21 15:50:52 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Tens of thousands of railway workers have walked off the job in Britain, bringing the train network to a crawl in the country’s biggest transit strike in three decades. https://t.co/qhQpOQAdIt","date":"Tue Jun 21 15:33:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Texas Director of Public Safety excoriates police response to Uvalde school shooting as an \"abject failure,\" saying in three minutes after the subject entered the west building, there was a \"sufficient number\" of armed officers to \"neutralize the subject.\" https://t.co/QtMg0FDgs2 https://t.co/wd7qDBrWsK","date":"Tue Jun 21 15:25:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Tuesday is runoff day for voters in Georgia -- though notably not for the two highest-profile races where former President Donald Trump tried and failed to defeat incumbents. https://t.co/VJc5hyaTMQ","date":"Tue Jun 21 15:09:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: Texas State Sen. Roland Gutierrez grows emotional while recalling screams from grieving parents after Uvalde shooting.\n\n“I don’t want you, or anyone else, to have to do for your constituents what I’ve had to do over the last four weeks.” https://t.co/5QrzaRgEnn https://t.co/ypG3SXAP5O","date":"Tue Jun 21 14:55:14 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Supreme Court rules that religious schools can’t be excluded from a Maine program that offers tuition aid for private education. https://t.co/Lang1lTuXw","date":"Tue Jun 21 14:45:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"WATCH: Texas officials hold hearing on Uvalde mass school shooting: https://t.co/pqVGimvjzw","date":"Tue Jun 21 14:31:15 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"More than 1 million Americans have died from COVID-19, but recent data shows that deaths and severe disease are not increasing with the same vigor despite a surge in infections. https://t.co/6QOKCW0kZp","date":"Tue Jun 21 14:10:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"In the wake of rising gun violence across the U.S., parents are questioning how summer camps maintain the security of their programs. https://t.co/to6TZan5j2 https://t.co/iyb6OhFFn7","date":"Tue Jun 21 14:00:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Officials caution that the framework, which members have been negotiating for weeks, is not yet in its final form. https://t.co/MVygF8vSS7","date":"Tue Jun 21 13:57:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: The Supreme Court has rejected Bayer's appeal to shut down thousands of lawsuits claiming that its Roundup weedkiller causes cancer. https://t.co/a5tIC8tLsq","date":"Tue Jun 21 13:51:33 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Experts say that there is probably not much cross-protection between some COVID-19 variants. https://t.co/hyBBvJERzt","date":"Tue Jun 21 13:24:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly a month after a gunman killed 19 students and two teachers in Uvalde, Texas, several key questions about the police response remain unanswered. https://t.co/EBh8KLa52x","date":"Tue Jun 21 13:19:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"South Korea successfully launched and put its homegrown space rocket into orbit Tuesday, becoming the seventh nation capable of launching practical satellites using a self-developed propulsion system. https://t.co/5Q4kFkaMyX https://t.co/al4ozNbxZB","date":"Tue Jun 21 13:16:02 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Jan. 6 committee to focus on what it says was then-Pres. Trump's \"unprecedented\" effort to push key state officials to reject the election results and his central role in the plot to create \"fake\" slates of electors to overturn Joe Biden's victory. https://t.co/GpVjr8VcHh","date":"Tue Jun 21 13:13:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"MORE: Garland will meet with Ukrainian Prosecutor General Iryna Venediktova to discuss the efforts to help identify, apprehend and prosecute the people involved in war crimes and other atrocities in Ukraine, the official said. https://t.co/XFeBh16LgX","date":"Tue Jun 21 13:08:32 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"BREAKING: Attorney General Merrick Garland is making an unannounced visit to Ukraine, according to a Department of Justice official. https://t.co/eycHmXN6tt","date":"Tue Jun 21 13:01:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Former Pres. Trump's pressure campaign on state election officials is the focus of today's Jan. 6 hearing.\n\nWatch live on @ABCNewsLive and stream on @Hulu: https://t.co/HE9moAk5QH https://t.co/LrfTckWoRj","date":"Tue Jun 21 13:00:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I have more than 30 years of experience. But this was the most difficult flight in my career.\" https://t.co/b1zJeLygM6","date":"Tue Jun 21 12:51:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: Kellogg has announced that it will separate into three different companies to create “greater strategic, operational, and financial focus” for each of the new firms that will be named at a later date. https://t.co/d0TIS72DpA","date":"Tue Jun 21 12:36:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Nobel Peace Prize auctioned off by Russian journalist Dmitry Muratov to raise money for Ukrainian child refugees sold Monday night for $103.5 million, shattering the old record for a Nobel. https://t.co/9jONHm7wkW https://t.co/yTEtTVaGIv","date":"Tue Jun 21 12:30:58 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"STONEHENGE SUNRISE: Crowds gather at the ancient monument of Stonehenge in England to mark the summer solstice, the first such gathering since 2019 because of COVID-19 restrictions. https://t.co/vA9wfbx2Ci https://t.co/RwlqzbIiOO","date":"Tue Jun 21 12:15:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"JUST IN: A U.S. citizen has died in Ukraine, the State Department confirmed to @ABC News Tuesday. https://t.co/mu4XB7717H","date":"Tue Jun 21 11:52:41 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Tuesday's primaries include only Virginia and Washington, D.C., as regularly scheduled elections -- but the day will also feature some contested, Trump-involved rematches. https://t.co/JBPnTdMf2j","date":"Tue Jun 21 11:38:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Camilla, Duchess of Cornwall is opening up about her personal life, including her marriage to Prince Charles and the media scrutiny she's faced, in a rare and candid interview. https://t.co/cDdcMkFiAw","date":"Tue Jun 21 11:16:56 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Many women struggle to breastfeed.\n\nScientists are starting to ask why.\n\nhttps://t.co/ffk7Y9AdZl via @NatGeo","date":"Tue Jun 21 11:00:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"New York-based JetBlue said it increased its cash offer to $33.50 per share, or more than $3.6 billion. https://t.co/NtumG0YaDe","date":"Tue Jun 21 10:35:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"HANG ON: Tourists were lowered to safety from a cable car that became stuck high above the ground in northern India. https://t.co/h2y2rnL4iN https://t.co/skEE4nrVIy","date":"Tue Jun 21 10:15:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"ROYAL BIRTHDAY: Prince William, the Duke of Cambridge, turns 40 today.\n\nArchive footage shows the first 18 months in the life of Prince Charles and Princess Diana’s eldest son. https://t.co/OtII6qHhnX https://t.co/H2JCUetXYe","date":"Tue Jun 21 10:11:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Francia Marquez says that part of her mission as vice president will be to reduce inequality. https://t.co/2Qov0TgZN9","date":"Tue Jun 21 09:54:37 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"New York's governor has signed a law intended to prevent local officials from enacting rules that might suppress people's voting rights because of their race. https://t.co/6ir93iFmaf","date":"Tue Jun 21 09:34:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The parents of victims of the Uvalde shooting called for the resignation of embattled school district Police Chief Pete Arredondo at a meeting of the school board. https://t.co/MZIdK9L9vT","date":"Tue Jun 21 09:14:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A man accused of killing six people and injuring dozens more when he allegedly drove his SUV through a Christmas parade in suburban Milwaukee last year is mounting an insanity defense. https://t.co/M3jEM3blmP","date":"Tue Jun 21 08:56:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden said he could make a decision as soon as this week on whether to support Congress instituting a pause on the federal gas tax of 18.4 cents per gallon. https://t.co/jCAx0QN9fv","date":"Tue Jun 21 08:37:34 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The FBI is looking for a man wanted in the disappearance of a woman whose remains were found in her vehicle in Tijuana last month. https://t.co/ofz3W1gvgW","date":"Tue Jun 21 08:18:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Two years into the coronavirus pandemic, children as young as 6 months old are now eligible to get vaccinated against COVID-19. Here is what parents should know. https://t.co/TL7KpeWede","date":"Tue Jun 21 08:01:23 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden says he’s considering a federal holiday on the gasoline tax. https://t.co/H0TFu10kku","date":"Tue Jun 21 07:44:44 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A settlement agreement has been reached on the eve of a second trial pitting the Kardashian family against former reality TV star Blac Chyna. https://t.co/9ssLmo2xBy","date":"Tue Jun 21 07:25:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Two Central Florida deputies have been suspended for leaking news about Bob Saget’s death before his family was alerted, officials say. https://t.co/7ThZz09AW2","date":"Tue Jun 21 07:04:26 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Scientists say the world's largest ever freshwater fish—a stingray weighing in at about 660 pounds — has been caught in Cambodia's Mekong River.\n\nThe giant fish was tagged and released back into the wild. https://t.co/YWvgo8BR3P","date":"Tue Jun 21 06:42:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly a month after a gunman killed 19 students and two teachers in Uvalde, Texas, several key questions about the police response remain unanswered. https://t.co/MdkugjwUKc","date":"Tue Jun 21 06:21:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Federal Reserve's strongest weapon in its fight against skyrocketing inflation is raising interest rates. https://t.co/PNG6fRoclp","date":"Tue Jun 21 05:59:24 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Weighted swaddles and blankets are popular among parents trying to get their infants to sleep, but they should not be used on sleeping babies, according to new recommendations from the American Academy of Pediatrics. https://t.co/ucT2izvu4n","date":"Tue Jun 21 05:42:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Animals with flat faces, like pugs, can't pant as well and are more at risk of heat stroke. These pets, as well as older and overweight pets, should be kept inside as much as possible.\n\nRead more: https://t.co/W6rkCzs2Wv https://t.co/unMtWhkhqI","date":"Tue Jun 21 05:21:48 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Economists say the best way to prepare for a recession is not to retrench, but instead build resilience to protect your finances from an economic shock. https://t.co/IKOWMKc3hV","date":"Tue Jun 21 05:00:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Bob Saget's daughter, Lara Saget, paid tribute to her late dad on the first Father's Day since his tragic death with a powerful message about love. https://t.co/9KPtS0zK4Z","date":"Tue Jun 21 04:42:39 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"When Pres. Biden signed a bill last year making Juneteenth a federal holiday commemorating the end of slavery in the United States, one woman captured well-deserved attention. https://t.co/MW9NisvlWi","date":"Tue Jun 21 04:25:20 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly 6 in 10 Americans believe former Pres. Trump should be charged with a crime for his role in the Jan. 6 riot, a new @ABC News/Ipsos poll finds. https://t.co/d4DFWzgaUW","date":"Tue Jun 21 04:07:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Traci Arway, a special education coordinator within the public school system in Columbus, Ohio, says she's had nightmares about having guns in her classroom. https://t.co/MO6vbfAHiT","date":"Tue Jun 21 03:51:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Ben Stiller heaped praise on Ukrainian Pres. Zelenskyy in Kyiv to mark World Refugee Day as Russia's ongoing invasion forces millions to flee. https://t.co/x8Rcf8XReI","date":"Tue Jun 21 03:36:04 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"TO THE RESCUE: Firefighters and local police used a ladder to help a leopard that got stuck in a deep well in India. https://t.co/jIJP6Jgq11 https://t.co/NUOjnnmFtA","date":"Tue Jun 21 03:16:30 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"At least six people injured, three critically, after authorities say a New York City taxi jumped the curb, hitting pedestrians and pinning two women against a building. https://t.co/mbt8x8zd70","date":"Tue Jun 21 02:57:08 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The parents of victims of the Uvalde shooting called for the resignation of embattled school district Police Chief Pete Arredondo at a meeting of the school board. https://t.co/h2Ss07STqN","date":"Tue Jun 21 02:37:03 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Camilla, Duchess of Cornwall is opening up about her personal life, including her marriage to Prince Charles and the media scrutiny she's faced, in a rare and candid interview. https://t.co/DPJfr6o7Hl","date":"Tue Jun 21 02:25:45 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"In Southern California, golf courses are altering the way they tend to the green in the wake of new state mandates and forecasts that climate change will cause drought conditions to persist. https://t.co/h14YdapUGG","date":"Tue Jun 21 02:05:21 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The German government said that it remains committed to its goal of phasing out coal as a power source by 2030, despite deepening worries about a cut in Russia's gas supplies. https://t.co/W3iht7WZPR","date":"Tue Jun 21 01:44:13 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Vice Pres. Harris and second gentleman Emhoff made a surprise visit to schoolchildren at the National Museum of African American History and Culture to talk about the meaning of Juneteenth as the nation observed the new federal holiday. https://t.co/ZgIKVbMk6A https://t.co/7QSOcLtbH6","date":"Tue Jun 21 01:27:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The clock is ticking for Senate negotiators working to reach a final agreement on an anti-gun violence package before the Fourth of July recess. https://t.co/BnipMerVIw","date":"Tue Jun 21 01:07:27 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"\"I haven't always done everything exactly the way planned, but I was quick to reconcile. I think that's the big thing, be vulnerable to your kids by not trying to act like you got it all figured out… \" https://t.co/eMwqZNtiBz","date":"Tue Jun 21 00:47:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"More than 1 million Americans have died from COVID-19, but recent data shows that deaths and severe disease are not increasing with the same vigor despite a surge in infections. https://t.co/rn43ZbR1eS","date":"Tue Jun 21 00:31:16 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden said he could make a decision as soon as this week on whether to support Congress instituting a pause on the federal gas tax of 18.4 cents per gallon, which experts have estimated could lower prices by approximately 14.72 cents per gallon. https://t.co/kczApYzdF0","date":"Tue Jun 21 00:15:19 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"A rebel.\n\nA star. \n\nA staple.\n\nExclusively Elvis - tomorrow night on @ABC and stream on Hulu. https://t.co/UJuc5x2p5L","date":"Tue Jun 21 00:00:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Nearly a month after a gunman killed 19 students and two teachers in Uvalde, Texas, several key questions about the police response remain unanswered. https://t.co/GGpdZwGUnS","date":"Mon Jun 20 23:55:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"At least six people killed, 42 injured in mass shootings this past weekend across the U.S.\n\nAs of Monday, there have been 277 mass shootings in the U.S. this year, according to Gun Violence Archive. https://t.co/4zFiWe4uPo https://t.co/Xs5IvGwJ6g","date":"Mon Jun 20 23:39:57 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The FBI is looking for a man wanted in the disappearance of a woman whose remains were found in her vehicle in Tijuana last month. https://t.co/rofLcBjHxS","date":"Mon Jun 20 23:23:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Georgia Democrat Stacey Abrams is making guns a central focus of her race for governor, seeking to turn crime into a liability for incumbent GOP Gov. Brian Kemp's reelection bid. https://t.co/dntmCjH2ZD","date":"Mon Jun 20 23:02:59 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"For months, homebuyers have faced the dual challenges of skyrocketing mortgage rates and continued growth in home prices. https://t.co/sXCbhxc1jj","date":"Mon Jun 20 22:42:46 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Economists say the best way to prepare for a recession is not to retrench, but instead build resilience to protect your finances from an economic shock. https://t.co/XVqdv8buCs","date":"Mon Jun 20 22:26:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"READY FOR MY CLOSEUP: Curious bear sniffs a camera as it strolls past in South Lake Tahoe, California. https://t.co/H26TVoE7xI https://t.co/JXPaiPo5Hq","date":"Mon Jun 20 22:23:00 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"If your time horizon is three years or longer and you have a diversified portfolio, experts agree that the best thing you can do is ride it out — stay invested, stay disciplined and don’t let your emotions get the best of you.\n\nRead more: https://t.co/ArQZCstctz","date":"Mon Jun 20 22:06:06 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The day widely known as Juneteenth, and referred to as Jubilee Day or Black Independence Day, is a significant date in Black history. https://t.co/Gg9cmReE9u","date":"Mon Jun 20 21:50:35 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"As a pair of wildfires skirt this mountainous northern Arizona city, the flames are crossing land dense with reminders of human existence through centuries. https://t.co/fY6qqIikaw","date":"Mon Jun 20 21:28:10 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Real estate entrepreneur Jude Bernard said Juneteenth can be used to highlight financial equality, which is the type of freedom many, like him, have fought for. https://t.co/ToLz2a10pm","date":"Mon Jun 20 21:08:50 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"U.S. and Cambodian scientists say the world's largest ever freshwater fish—a stingray measuring nearly 13 feet long— was caught in Cambodia's Mekong River.\n\nThe giant fish was tagged and released back into the wild. https://t.co/BMX8P1NOr6 https://t.co/dPOuVz0i6A","date":"Mon Jun 20 21:00:01 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Pres. Biden says he’s considering a federal holiday on the gasoline tax. https://t.co/XE7FnzXRvE","date":"Mon Jun 20 20:47:05 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"The Federal Reserve's decision to hike its benchmark interest rate will impact the average American and the economy as a whole in profound and largely negative ways, experts told @ABC News. https://t.co/QOiDaSKCQw","date":"Mon Jun 20 20:28:53 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Actor Ben Stiller, a goodwill ambassador for the United Nations High Commissioner for Refugees for the last five years, is visiting Ukraine to highlight the refugee crisis amid Russia's ongoing war.\n\nRead more: https://t.co/7Rte5Ardck https://t.co/hGyvWVftje","date":"Mon Jun 20 20:07:22 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"NEW: Police are asking for the public's help after a mass shooting broke out in Washington, D.C., killing a 15-year-old boy.\n\nA reward up to $25,000 has been offered for information leading to the gunman’s arrest and conviction. https://t.co/nhzInaEAnt","date":"Mon Jun 20 20:06:40 +0000 2022","user_id":"28785486"},{"handle":"ABC","text":"Hong Kong’s iconic Jumbo Floating Restaurant has capsized in the South China Sea less than a week after it was towed away from the city, its parent company said. https://t.co/LEZ1njhXYN","date":"Mon Jun 20 20:01:55 +0000 2022","user_id":"28785486"}]