[{"handle":"AP","text":"@AP The governor of Luhansk province also confirmed that Russian and separatist fighters now control Sievierodonetsk. https://t.co/vGyerc0y2I","date":"Sat Jun 25 21:55:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Russia's military said that Moscow-backed separatists have taken control of a chemical plant that was the last Ukrainian holdout in the city of Sievierodonetsk in the eastern Luhansk region. https://t.co/l2CAtUnCWq","date":"Sat Jun 25 21:52:52 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The escalating monkeypox outbreak in over 50 countries should be closely monitored but does not warrant being declared a global health emergency, the World Health Organization said. WHO nevertheless called for an intense response to control the virus. https://t.co/vyfldr4R6J","date":"Sat Jun 25 21:21:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Joe Biden has arrived in Germany for a meeting of the Group of Seven leading economic powers in the Bavarian Alps. He will later travel to Madrid for a NATO summit, and attempt to strengthen the alliance's stand against Russia's war on Ukraine. https://t.co/mSvz193Xny","date":"Sat Jun 25 20:59:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A 5-month-old girl was shot to death while in the rear of a car in a neighborhood on Chicago's South Side. No arrests have been made in the death of Cecilia Thomas. Activist Ja’Mal Green was offering a $5,000 reward for information about the shooting. https://t.co/QXpj9lh21z","date":"Sat Jun 25 20:55:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Cristian Javier, Héctor Neris and Ryan Pressly combined on the first no-hitter against the New York Yankees in 19 years, shutting down the best team in baseball and pitching the Houston Astros to a 3-0 victory. https://t.co/nqATJelor4","date":"Sat Jun 25 20:33:38 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A federal jury has awarded $21 million to the family of a pregnant teen who was shot and killed by undercover police officers in Northern California five years ago, attorneys said. Elena Mondragon was a passenger in a car when she was fatally shot. https://t.co/N3Yfnzf1Vm","date":"Sat Jun 25 20:25:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Churches across the U.S. are answering the big question of how to end homelessness in their communities with a small solution: tiny homes. https://t.co/bLGRxvuIj1","date":"Sat Jun 25 20:14:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Pope Francis urged families to shun “selfish” decisions that are indifferent to life, a day after the U.S. Supreme Court's abortion ruling. Without mentioning abortion, Francis spoke of a culture of waste that he has said is behind acceptance of abortion. https://t.co/gcArxNHNCH","date":"Sat Jun 25 19:58:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Mitt Romney isn’t up for reelection, but his name is surfacing in Republican primaries throughout the nation.\n\nCandidates are using the label “Mitt Romney Republican” to frame opponents as insufficiently conservative and enemies of the Trump-era GOP. https://t.co/Wlbc9spSoG","date":"Sat Jun 25 19:54:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP The Norwegian security service is calling the shooting an \"Islamist terror act.\" Investigators said the suspect, identified as a 42-year-old Norwegian citizen originally from Iran, was arrested after opening fire at three locations in downtown Oslo. https://t.co/2YZRJnsY56","date":"Sat Jun 25 19:42:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"We must stand together to defend our values: freedom, diversity and respect for each other.\" Norway's King Harald V offers condolences after a gunman killed two men and injured over 20 other people in Oslo during the capital's annual LGBTQ Pride festival. https://t.co/A4ijglC9wK","date":"Sat Jun 25 19:41:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A day after the Supreme Court overturned Roe v. Wade, which provided a constitutional right to an abortion, states began implementing bans and people on both sides of the issue mapped out their next moves. https://t.co/9YDSNpyuUd","date":"Sat Jun 25 19:37:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“We are not all in this together.\"\n\nInflation is threatening to widen the gap between people struggling to cover their costs and those able to keep spending, triggering workers' strikes and other protests around the world. https://t.co/vErs509IPS","date":"Sat Jun 25 19:23:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Here is an overview of abortion legislation and the expected impact of the court's decision in every state. \n\nhttps://t.co/1rKw6KVodq","date":"Sat Jun 25 19:08:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"For nearly two months after a draft Supreme Court opinion overturning Roe v. Wade was leaked, abortion and all of its complexities were hashed and rehashed. Both sides waited, some with fear, others with expectations, for the decision that arrived Friday. https://t.co/edBP7Ra7G4","date":"Sat Jun 25 18:53:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Democrats hope to harness the outrage felt by abortion rights supporters as they seek to reset what has been a brutal election year environment. Democratic-aligned groups have moved quickly to let voters know what’s at stake in this year’s midterms. https://t.co/AGzRsuw4Qo","date":"Sat Jun 25 18:52:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Every Supreme Court nominee was asked during Senate confirmation hearings about their views of Roe v. Wade, the landmark abortion ruling that was struck down this week. Here is how the justices nominated by Republican presidents responded. https://t.co/EpJshqCOrv","date":"Sat Jun 25 18:02:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Jesuit university in New Orleans has renamed its newest residence hall after its first Black graduate, Norman C. Francis, and his late wife and family.\n\nThe Loyola University building is now the Blanche and Norman C. Francis Family Hall. https://t.co/8xq7T1vcu8","date":"Sat Jun 25 16:41:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"They also showcased the enormous influence wielded by Justices Clarence Thomas and Samuel Alito. Thomas wrote the court’s opinion that Americans have the right to carry handguns in public for self-defense. Alito wrote the opinion overturning Roe v. Wade. \nhttps://t.co/5wDizZ51fB","date":"Sat Jun 25 15:40:39 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The decisions show how the court has evolved over the past six years from an institution that leaned right, but produced some notable liberal victories, to one with an aggressive 6-3 conservative majority. https://t.co/TSyJJRbswS","date":"Sat Jun 25 15:40:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Two blockbuster rulings on guns and abortion make it clear that conservative justices hold the power on the U.S. Supreme Court and aren't afraid to use it to make transformative changes in the law. https://t.co/OSiO1GAtWf","date":"Sat Jun 25 15:39:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Businesses including The Walt Disney Company, Meta and Goldman Sachs announced they would cover travel expenses for employees who must travel out of state to get an abortion.\n\nOthers like McDonald's, General Motors and Walmart have kept quiet. https://t.co/Z1bN1Fk8YP","date":"Sat Jun 25 15:19:16 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court decision to end constitutional protections for abortion is expected to disproportionately affect women of color who already face limited access to health care, according to an @AP analysis. https://t.co/crcQWShn9Q https://t.co/XVncpMEuYH","date":"Sat Jun 25 15:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Biden is out to sustain the global alliance punishing Russia for its invasion of Ukraine as he embarks on a five-day trip to Europe.\n\nHis trip comes as the war's aftershocks to global food and energy supplies deepen. https://t.co/Kj5ZT3Eses","date":"Sat Jun 25 15:06:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Pfizer says tweaking its COVID-19 vaccine to better target the omicron variant is safe, days before regulators debate whether to offer Americans updated booster shots this fall. https://t.co/Hkyn6oUMVz","date":"Sat Jun 25 14:47:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The National Park Service announced it will build the first visitor center dedicated to LGBTQ rights located next to the Stonewall Inn in New York City, a historic bar in the gay rights movement. https://t.co/fc6LOxNUZM","date":"Sat Jun 25 14:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Two recent momentous decisions by the Supreme Court have fired up debate about whether the court’s conservative justices are being consistent to history and the Constitution — or citing them to justify political preferences. https://t.co/p8NAI3n2g6","date":"Sat Jun 25 14:06:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Norwegian security service PST has raised its terror alert to the highest level after a mass shooting left 2 people dead and many wounded during Pride week in Oslo. https://t.co/6rfSqFIcDx","date":"Sat Jun 25 13:19:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Biden has signed the most sweeping gun violence bill in decades.\n\nThe legislation will toughen background checks for the youngest gun buyers, keep firearms from more domestic violence offenders and help states set red flag laws. https://t.co/tjDnVn3DzU","date":"Sat Jun 25 12:55:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Vice President Kamala Harris decried the Supreme Court's decision to overturn the right to an abortion yesterday saying, millions will go to bed without access to the \"health care and reproductive care that they had this morning.\" https://t.co/MWsjS6vdaM","date":"Sat Jun 25 12:55:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The soaring cost of living is leading to protests and strikes from nurses in Zimbabwe and railway workers in Britain to Indigenous people in Ecuador and pilots in the U.S. An antipoverty expert expects more are ahead as inequality grows. https://t.co/gBzXpHwtis","date":"Sat Jun 25 11:30:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Bangladesh’s Prime Minister Sheikh Hasina has celebrated the opening of the country’s longest bridge, which took eight years to build amid setbacks involving political conflict and corruption allegations. https://t.co/ecvSTUvoah","date":"Sat Jun 25 10:08:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Inflation is threatening to widen the gap between people struggling to cover their costs and those able to keep spending. That is sending protesters into the streets seeking relief and higher pay that keeps pace with rising prices. https://t.co/NV57M3uEld","date":"Sat Jun 25 08:22:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Hundreds of people, mostly ethnic Amhara, were slaughtered in a village and its surroundings this month in the latest explosion of ethnic violence in Ethiopia. Ethiopians are again left wondering why the federal government failed to protect them. https://t.co/KLZclX8qL9","date":"Sat Jun 25 08:14:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Pakistani military cargo plane carrying relief goods for Afghanistan’s earthquake-affected people landed at the Khost airport Saturday, officials said, as tents, food and medical supplies rolled into the mountainous region. https://t.co/0XVq8qYBMf","date":"Sat Jun 25 07:50:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Norwegian police say they are investigating an overnight shooting in Oslo that killed two people and injured more than a dozen as a case of possible terrorism. https://t.co/nQiw1HfxmQ","date":"Sat Jun 25 07:31:38 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Organizers of the Oslo Pride festival say they are canceling a Pride parade after an overnight mass shooting in the Norwegian capital. Two people were killed and more than a dozen injured. https://t.co/zh3Rblt7be","date":"Sat Jun 25 07:10:30 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Chinese leader Xi Jinping will visit Hong Kong to celebrate next week’s 25th anniversary of the former British colony’s return to China following a crackdown on a pro-democracy movement that has inflamed tension with Washington and Europe. https://t.co/vP5hTb4Cc5","date":"Sat Jun 25 05:27:52 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Norwegian police say two people have been killed and more than a dozen injured in a mass shooting in Oslo. The shooting happened early Saturday outside a bar in the downtown area of the Norwegian capital. A suspect has been arrested. https://t.co/kCOwCkp66h","date":"Sat Jun 25 03:41:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Eighteen Africans seeking to cross into Spain were killed and scores of migrants and police were injured in what Moroccan authorities called a “stampede” of people surging across Morocco's border fence with the Spanish North African enclave of Melilla. https://t.co/g44vxLpESI","date":"Sat Jun 25 03:17:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The largest pilots union has approved a contract that would boost the pay of pilots at United Airlines by more than 14% over the next 18 months. That could clear the way for similar wage hikes throughout the industry, which is facing a pilot shortage. https://t.co/TtRU72QqmL","date":"Sat Jun 25 02:43:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"Love the people in your life while you have them.\" Abigail Kone, valedictorian at Uvalde High School, echoes the feelings of her classmates, weeks after a mass shooting that killed 21 at the elementary school in the Texas Hill Country town. https://t.co/GasI2L4FPL","date":"Sat Jun 25 02:21:34 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The fate of technology executive Ramesh “Sunny” Balwani is now in the hands of a jury that will weigh criminal charges alleging he joined disgraced Theranos CEO Elizabeth Holmes, his former partner, in an elaborate fraud that jarred Silicon Valley. https://t.co/a5iWRUIBY1","date":"Sat Jun 25 02:15:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The FBI has raided a Florida art museum and seized more than two dozen paintings attributed to artist Jean-Michel Basquiat following questions about their authenticity. An Orlando Museum of Art spokeswoman says no museum staff were arrested. https://t.co/jAK8MhzVJl","date":"Sat Jun 25 01:09:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Congress has passed its widest-ranging gun violence bill in decades, and President Biden plans to sign it Saturday morning. The measured compromise at once illustrates progress on the long-intractable issue and the partisan divide that persists. https://t.co/f27SWsfljs","date":"Sat Jun 25 00:37:47 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"AP Photos: Across the nation, Americans react to the Supreme Court's decision to strip away women’s constitutional protections for abortion. https://t.co/a15BBeLqvR","date":"Sat Jun 25 00:25:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“Today is about this horrifying invasion of privacy that this court is now allowing, and when we lose one right that we have relied on and enjoyed, other rights are at risk,” said Jim Obergefell, the plaintiff in the ruling legalizing same-sex marriage. https://t.co/NqAVWjLWjQ","date":"Fri Jun 24 23:43:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In the court's majority opinion overturning Roe v. Wade, Justice Samuel Alito said the decision applied only to abortion. \n\nBut in a separate concurring opinion, Justice Clarence Thomas said the court should review other precedents. https://t.co/NqAVWjLWjQ","date":"Fri Jun 24 23:43:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Clinics in Alabama, Texas, West Virginia and some other states stopped performing abortions hours after the Supreme Court overturned Roe v. Wade. About half of U.S. states are likely to ban the procedure. https://t.co/gtBtIz9vEv","date":"Fri Jun 24 23:35:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As it sank in that the moment she spent years praying for had arrived, Britton’s prayer was brief.\n\n“Thank you, Jesus!” she said. https://t.co/qkOzuDgAO2 https://t.co/GQI5DqDa6w","date":"Fri Jun 24 23:21:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Tanya Britton, 70, who came to see her own abortion as a teenager as wrong, spent years hoisting signs outside of clinics and spreading anti-abortion gospel to anyone who’d listen.\n\nShe sees the court's action as the answer to decades of prayers. https://t.co/qkOzuDgAO2 https://t.co/LFQB3HgK5Z","date":"Fri Jun 24 23:21:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Many people across the U.S. are reacting with horror to the fall of Roe v. Wade, saying it robs a basic human right. But millions of others who've been immersed in the anti-abortion movement for the past half-century are rejoicing. https://t.co/qkOzuDgAO2","date":"Fri Jun 24 23:20:36 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP The e-cigarette maker had asked the court to pause what it called an “extraordinary and unlawful action” by the Food and Drug Administration that would have required it to immediately halt its business. https://t.co/H65tuqFbKY","date":"Fri Jun 24 22:42:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Juul can continue to sell its electronic cigarettes, at least for now, after a federal appeals court temporarily blocked a government ban. https://t.co/7zYPqog7PB","date":"Fri Jun 24 22:42:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Republican Sen. Susan Collins is being criticized for the Supreme Court ruling allowing states to ban abortion because of the key role she played in confirming Justices Neil Gorsuch and Brett Kavanaugh, two of the justices who were in the majority opinion. https://t.co/yX8HLFyrlp","date":"Fri Jun 24 22:36:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Stocks rallied on Wall Street Friday, sending the S&amp;P 500 up 3.1% for its best gain in two years.\n\nThe benchmark index also ended the week 6.4% higher, erasing the brutal loss it took a week earlier. https://t.co/NAfNR5D4yQ","date":"Fri Jun 24 22:21:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The end of constitutional protections for abortions in the United States on Friday emboldened abortion opponents around the world, while advocates for abortion rights worried it could threaten recent moves toward legalization in their countries. https://t.co/ea1FXiva0V","date":"Fri Jun 24 21:56:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Democratic governors in three states vowed to protect reproductive rights and help women who travel to the West Coast seeking abortions following the Supreme Court’s decision to overturn Roe v. Wade. https://t.co/br4VQ6Xs4F","date":"Fri Jun 24 21:49:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"It's been a year since 98 people were killed by the Surfside building collapse. Families and community members remembered the victims of the deadliest structure collapses in U.S. history. https://t.co/gIcDk3y5dN https://t.co/YaplevXdVz","date":"Fri Jun 24 21:20:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Religious Americans are deeply divided in their views on abortion, and reactions from faith leaders ranged from elation to anger after the U.S. Supreme Court overturned Roe v. Wade, the landmark 1973 decision that made abortion legal nationwide. https://t.co/Fi3doD4kIY","date":"Fri Jun 24 20:40:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"House Speaker Nancy Pelosi blasted the Supreme Court's decision to overturn the right to abortion, calling it \"an evisceration of Americans' rights.\" https://t.co/OIp5o9cKP5 https://t.co/mMEtg3bBl5","date":"Fri Jun 24 19:55:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Airlines under scrutiny for widespread flight disruptions are renewing their criticism of the government agency that manages the nation’s airspace, saying that understaffing at the Federal Aviation Administration is “crippling” East Coast traffic. https://t.co/aKHGNcKtI3","date":"Fri Jun 24 19:46:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"House Republicans are hailing the Supreme Court's decision to overturn Roe v. Wade, which ended the nation’s constitutional protections for abortion. https://t.co/OIp5o9cKP5 https://t.co/aQn5hGnH5k","date":"Fri Jun 24 19:40:52 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Joining Justice Samuel Alito in the majority to overturn Roe v. Wade were Justices Clarence Thomas, Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett. https://t.co/WASfGR2GG5 https://t.co/5MmkFkDsTV","date":"Fri Jun 24 19:36:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An Afghan prisoner held in U.S. custody for nearly 15 years has been released from the Guantanamo Bay detention center after a federal court ruled that he was unlawfully detained, the U.S. Department of Defense said Friday. https://t.co/tq1fPGmwHL","date":"Fri Jun 24 19:31:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court's decision allowing states to ban abortion immediately stirred alarm among LGBTQ advocates, who fear the ruling could someday allow a rollback of legal protections for gay relationships, including the right for same-sex couples to marry. https://t.co/RuxLiPXs2D","date":"Fri Jun 24 18:04:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House has sent President Biden the most wide-ranging gun violence bill Congress has passed in decades.\n\nThe bill is a measured compromise that illustrates progress on the issue following revulsion over last month’s mass shootings in New York and Texas. https://t.co/0m6jjETb6K https://t.co/Tvlio8tYCy","date":"Fri Jun 24 18:04:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: The House passes a compromise gun violence bill, as recent mass killings end decades of gridlock on the issue in Congress. The bill now goes to President Biden. https://t.co/LysX8NGvu7","date":"Fri Jun 24 17:38:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Watch live: People are gathering outside of the U.S. Supreme Court after the court overturned Roe v. Wade, ending constitutional protections for abortion that had been in place nearly 50 years. https://t.co/qpXxEbEAJh","date":"Fri Jun 24 17:24:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Hundreds of people surrounded the barricaded Supreme Court in Washington, some questioning the high court's legitimacy, while others cheered the ruling and proclaimed the dawn of a “post-Roe” world. https://t.co/4Aj5JvwIT8","date":"Fri Jun 24 17:22:44 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"America was convulsed with anger, joy, fear and confusion Friday after the Supreme Court overturned Roe v. Wade.\n\nThe canyon-like divide across the country over the right to terminate a pregnancy was on full display. https://t.co/Jar71hDIkV","date":"Fri Jun 24 17:22:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Here's a look at some of the Supreme Court's major abortion rulings over the last 50 years, as the court’s membership and views on abortion regulations have changed. https://t.co/Zoo3qaTAws https://t.co/oGh6zMaYlc","date":"Fri Jun 24 17:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"This is an extreme and dangerous path the court is now taking us on,\" President Joe Biden says in a rebuke of the call by Justice Clarence Thomas to overturn other rulings protecting same-sex marriage, gay sex and the use of contraceptives. https://t.co/IkZVAvNziY","date":"Fri Jun 24 16:59:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"House Speaker Nancy Pelosi called the Supreme Court's ruling \"outrageous and heart-wrenching.”\n\nMeanwhile, House Minority Leader Kevin McCarthy applauded the decision, saying that “a lot of lives are going to be saved.” https://t.co/d7OUxx3wxa","date":"Fri Jun 24 16:57:53 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Joe Biden, in an address after the U.S. Supreme Court overturned Roe v. Wade, says \"the health and life of women in this nation are now at risk.\" https://t.co/J8Mr28yjUt https://t.co/Doj8HSk00k","date":"Fri Jun 24 16:45:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Watch live: President Joe Biden delivers an address after the U.S. Supreme Court overturned Roe v. Wade, ending constitutional protections for abortion. https://t.co/VYwTrMVLff","date":"Fri Jun 24 16:37:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Attorney General Merrick Garland said the Justice Department “will work tirelessly to protect and advance reproductive freedom\" after the fall of Roe v. Wade.\n\nHe also noted the FDA has approved the use of mifepristone, a drug used to end pregnancies. https://t.co/g5ipDJ6Ycw","date":"Fri Jun 24 16:32:11 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Justice Clarence Thomas, part of the majority to overturn Roe v. Wade, also called on the high court to overturn other rulings protecting same-sex marriage, gay sex and the use of contraceptives. https://t.co/1n58HurYRI","date":"Fri Jun 24 16:23:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"People gather outside the U.S. Supreme Court building, both in support and protest, of the high court's ruling to overturn Roe v. Wade and end the 49-year constitutional protection for abortion. https://t.co/iI8CleejwX https://t.co/oThlkOwzkh","date":"Fri Jun 24 16:03:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Here is an overview of abortion legislation and the expected impact of the court's decision in every state. \n\nhttps://t.co/exMzfVuWB3","date":"Fri Jun 24 15:46:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court has ended constitutional protections for abortion, and 13 states already have laws that ban abortion in the event of Roe v. Wade being overturned. Another half-dozen states have near-total bans or prohibitions after 6 weeks of pregnancy. https://t.co/VTLTK7zLWk https://t.co/fwMM2CEOzB","date":"Fri Jun 24 15:35:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Justices Stephen Breyer, Sonia Sotomayor and Elena Kagan — the diminished liberal wing of the court — were in dissent. https://t.co/TH8lwiCwIg https://t.co/3IFl1X6Q8U","date":"Fri Jun 24 15:11:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Justice Samuel Alito, in the opinion issued, wrote that Roe v. Wade and Planned Parenthood v. Casey, the 1992 decision that reaffirmed the right to abortion, were wrong the day they were decided and must be overturned. https://t.co/TH8lwiCwIg https://t.co/YzLRD3sU0o","date":"Fri Jun 24 15:09:36 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court has ended constitutional protections for abortion in a 5-4 decision by its conservative majority to overturn Roe v. Wade.\n\n@AP explains. https://t.co/fk9IWbTNsN https://t.co/dEbiLnrn61","date":"Fri Jun 24 14:52:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"People celebrate outside the U.S. Supreme Court after the high court overturned the landmark Roe v. Wade case with its conservative majority. \n\nAuthority to regulate abortion rests with the political branches, not the courts, Justice Samuel Alito wrote. https://t.co/6jz4UclLqk https://t.co/3GjRFlmS4Y","date":"Fri Jun 24 14:48:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"HAPPENING NOW: People are gathering outside of the U.S. Supreme Court after the court overturned Roe v. Wade in a 5-4 decision, ending constitutional protections for abortion that had been in place nearly 50 years. https://t.co/rB73krKRHf","date":"Fri Jun 24 14:30:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Chief Justice John Roberts would have stopped short of ending the abortion right, noting that he would have upheld the Mississippi law at the heart of the case, a ban on abortion after 15 weeks, and said no more. https://t.co/JT1pmcjOSP","date":"Fri Jun 24 14:23:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Joining Alito were Justices Clarence Thomas, Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett. \n\nThe latter three justices are Trump appointees. https://t.co/JT1pmcjOSP","date":"Fri Jun 24 14:22:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The ruling came weeks after the stunning leak of a draft opinion by Justice Samuel Alito that indicated the high court was prepared to take this momentous step. https://t.co/JT1pmcjOSP","date":"Fri Jun 24 14:22:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The decision was the culmination of decades of efforts by abortion opponents, made possible by an emboldened right side of the court that has been fortified by three conservative appointees of former President Donald Trump. https://t.co/JT1pmcjOSP","date":"Fri Jun 24 14:21:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: U.S. Supreme Court overturns the landmark Roe v. Wade case, ending nearly 50 years of constitutional protections for abortion.\n\nBans are expected in roughly half the states. https://t.co/QXHqKtBz2E https://t.co/ly9ckqSYNF","date":"Fri Jun 24 14:13:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"From the Russian Arctic to the American South, big swaths of the Northern Hemisphere continue to sizzle with extreme heat. \n\nParts of China and Japan set all-time heat records on Friday. https://t.co/zYHamlqZc4","date":"Fri Jun 24 13:49:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"At its core, fun is what it’s all about for many merfolk.\n\nThere is a strong need, especially after COVID-related lockdowns, to simply play and enjoy creativity, says Lauren Metzler, founder of Sydney Mermaids. https://t.co/5FmK6TFL3a https://t.co/AWUxuA7qRO","date":"Fri Jun 24 13:39:38 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"People across the world are increasingly embracing the subculture of \"mermaiding.\"\n\nThousands have flocked to conventions, formed \"pods\" and participated in the multimillion-dollar mermaid tail industry. But most of all, they say it offers a refuge. https://t.co/5FmK6TFL3a https://t.co/XnjQoGd3kg","date":"Fri Jun 24 13:39:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida.\n\nThe Conservancy of Southwest Florida says the female python weighed 215-pounds, was nearly 18 feet long and had 122 developing eggs. https://t.co/urGohC1Dod https://t.co/7h8L6rpnVz","date":"Fri Jun 24 13:10:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The European Union agreed on Thursday to put Ukraine on a path toward EU membership, acting with uncharacteristic speed and unity to pull the embattled country further away from Russia's influence and bind it more closely to the West. https://t.co/qG1WL67Zai https://t.co/5s4vsLF6jQ","date":"Fri Jun 24 13:03:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The film “Gabby Giffords Won’t Back Down” offers an intimate look at the former congresswoman's recovery after a January 2011 shooting. It's also an insider view of how she and her husband, Sen. Mark Kelly, navigated gun control. https://t.co/h6prqHdjiR","date":"Fri Jun 24 12:35:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A steak lunch was music to Trumpet's floppy ears as the bloodhound was treated for his Westminster best in show win. https://t.co/uFYt7gqIgR","date":"Fri Jun 24 12:30:01 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"On the 50th anniversary of Title IX being signed into law, House Speaker Nancy Pelosi unveiled a portrait of the late Congresswoman Patsy Mink — the first woman of color elected to the U.S. House of Representatives and considered the \"Mother of Title IX.\" https://t.co/BVkLzmozi0","date":"Fri Jun 24 12:20:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House panel investigating the Jan. 6 insurrection revealed on its fifth day of hearings the Republican lawmakers that later sought pardons from the White House after the Capitol was breached. https://t.co/XxRLkqI4cJ https://t.co/vHVrJZQwKT","date":"Fri Jun 24 11:31:30 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“We were on the good side, the honor side.'' Filipino Americans are expressing a range of emotions after voters in their homeland overwhelmingly elected the son of the nation’s former dictator Ferdinand Marcos as president. https://t.co/0xWBvZXfob","date":"Fri Jun 24 10:00:11 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"With Ukraine’s seaports blockaded or captured by Russian forces, neighboring Romania’s Black Sea port of Constanta has emerged as a main conduit for the war-torn country’s grain exports amid a growing world food crisis. https://t.co/pDGnnMkzEa","date":"Fri Jun 24 09:17:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Ukraine's troops will retreat from the besieged city of Sievierodonetsk to avoid encirclement, according to the governor of the eastern Luhansk region. The city has faced relentless Russian bombardment and been battered by house-to-house battles. https://t.co/ez8W6j7sHL","date":"Fri Jun 24 07:34:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The death toll from the earthquake in Afghanistan now stands at 1,150. Some international aid is getting to impacted villages to provide people with food and tents, but villagers are mostly on their own with millions in the nation already in deep  poverty. https://t.co/4aab8gi5mQ","date":"Fri Jun 24 07:13:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"For Hong Kongers, Taiwan is close not just geographically but also linguistically and culturally. In exile, it offered freedoms that many of them were used to and saw disappearing at home since Beijing launched a crackdown on pro-democracy activists. https://t.co/yNSexM66A3","date":"Fri Jun 24 05:56:39 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: British Prime Minister Boris Johnson’s leadership of the Conservative party suffered a heavy double blow as voters rejected the Tories in two by-elections. https://t.co/JLKTO90bij","date":"Fri Jun 24 05:17:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A shared history of political turmoil and violence in Lebanon and Sri Lanka led to the collapses of their once-prosperous economies, which have been bedeviled by corruption, patronage, nepotism and incompetence. https://t.co/gANpSpSUw3","date":"Fri Jun 24 04:53:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"North Korean leader Kim Jong Un has doubled down on his nuclear arms buildup to overwhelm “hostile forces” at a key meeting where military leaders approved unspecified new operational duties for frontline army units. https://t.co/0f6Fcq3YG2","date":"Fri Jun 24 03:53:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"India has sent a technical team to coordinate humanitarian deliveries after a destructive earthquake in Afghanistan. The Taliban-led government in Kabul and the international aid community are struggling to get help into the damaged region. https://t.co/qnN1xnNkQR","date":"Fri Jun 24 03:30:13 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Senate OKs bipartisan gun violence bill, moving Congress' boldest firearms curbs in decades to brink of final approval. https://t.co/fPxeqdM7tZ","date":"Fri Jun 24 02:19:53 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A heat wave that's already lasted more than a week keeps on baking the US, Asia and even the Arctic. Scientists say this early heat has all the hallmarks of climate change. https://t.co/skGGN89DDL","date":"Fri Jun 24 01:10:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A U.S. Naval reservist who was assigned to an agency that operates spy satellites told an undercover FBI agent that he stormed the U.S. Capitol with members of the far-right Proud Boys extremist group, according to court records. https://t.co/rf77QN6aMz","date":"Fri Jun 24 00:49:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Orlando Magic selected Duke freshman Paolo Banchero with the No. 1 pick in the NBA draft.\n\nHe beat out fellow first-year forwards Jabari Smith Jr. and Chet Holmgren. https://t.co/IrlRrN4LrE","date":"Fri Jun 24 00:26:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court issued its biggest gun rights ruling in more than a decade, and about one-quarter of the U.S. population lives in states expected to be affected.\n\nHere are some answers about what the decision does and does not do:\nhttps://t.co/YirVs5Bovr","date":"Fri Jun 24 00:15:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A prosecutor has asked a federal judge to sentence Jerry Harris, of the Netflix series “Cheer,” to 15 years in prison for coercing teenage boys to send him obscene photos and videos of themselves and soliciting sex from minors at cheerleading competitions. https://t.co/a4sTo2viUA","date":"Thu Jun 23 23:53:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Justice Department in turmoil, threats of mass resignation, and at least five GOP congressmen seeking pardons. What we learned on day 5 of hearings. https://t.co/90CjX0VsJH","date":"Thu Jun 23 23:51:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"We have a whole lot of ideas.\"\n\nNew York’s Democratic leaders aim to preserve as many restrictions as possible on carrying a handgun in public after a U.S. Supreme Court decision struck down key portions of the state’s gun-licensing law. https://t.co/oiqkcyrZy5","date":"Thu Jun 23 23:30:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A rural New Mexico county’s initial refusal to certify its primary election results sent ripples across the country, a symbol of how even basic functions of democracy have become politicized amid lies stemming from the 2020 presidential outcome. https://t.co/GGGpLmihMP","date":"Thu Jun 23 23:06:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“I shouldn’t have to be here right now. I should be at home watching a movie with my sister.”\n\nThe sister of a 9-year-old girl killed in the Uvalde school shooting rampage tearfully pleaded with Texas lawmakers to pass tougher gun laws. https://t.co/nkNXqMk7QC https://t.co/xU7jNmXEVG","date":"Thu Jun 23 23:00:01 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida.\n\nThe Conservancy of Southwest Florida says the female python weighed 215-pounds, was nearly 18 feet long and had 122 developing eggs. https://t.co/urGohCjefL https://t.co/9EEW55PYyO","date":"Thu Jun 23 22:45:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The U.S. Supreme Court struck down a New York law that had restricted who could carry a gun in public.\n\n\"We cannot allow New York to become the Wild, Wild West,\" said New York Mayor Eric Adams. https://t.co/NQ5sansiSW https://t.co/2SFtpHOAOI","date":"Thu Jun 23 22:35:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A tomahawk once owned by Chief Standing Bear, a pioneering Native American civil rights leader, has been returned to his tribe after being housed for decades in a museum at Harvard University. https://t.co/XRCuifawS9","date":"Thu Jun 23 21:51:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A steak lunch was music to Trumpet's floppy ears as the bloodhound was treated for his Westminster best in show win. https://t.co/yf6rdrrEgS","date":"Thu Jun 23 21:39:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Former aides of then-President Donald Trump say GOP lawmakers sought presidential pardons after the attack on the U.S. Capitol during Day 5 of the Jan. 6 committee hearings. https://t.co/BgG7aQdkrG https://t.co/sC0qto0toY","date":"Thu Jun 23 21:30:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Jonah Handler survived the fall from the 10th floor of the building that collapsed a year ago in Florida. His father is sharing his journey as they start a foundation to help families and first responders dealing with PTSD. https://t.co/RfPNEGwqs0 https://t.co/LzcgSLerRD","date":"Thu Jun 23 21:25:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Biden administration has agreed to cancel $6 billion in student loans for about 200,000 former students who say they were defrauded by their colleges, according to a proposed settlement in a Trump-era lawsuit. https://t.co/IpMXeg2qOg","date":"Thu Jun 23 20:55:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal agents searched a former top Justice Department official’s home and seized records from key Republicans in at least four states linked to Donald Trump’s efforts to overturn the 2020 election. https://t.co/oRxYMRzgff","date":"Thu Jun 23 20:50:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Liz Morgan arrived at Amsterdam’s Schiphol Airport 4 1/2 hours before her flight to Athens, finding the line for security snaking out of the terminal and into a big tent along a road before doubling back inside the main building. https://t.co/k5uKlO8JXN https://t.co/Mwe6vgwAyN","date":"Thu Jun 23 20:39:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"With the busy summer tourism season underway in Europe, passengers are encountering chaotic scenes, including lengthy delays, canceled flights and headaches over lost luggage. \n\nThe head of Europe’s biggest airline warned the turmoil would last all summer. https://t.co/UlaCzII93s","date":"Thu Jun 23 20:37:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"After two years of pandemic restrictions, demand for travel and tourism is back with a vengeance.\n\nBut airlines and airports that slashed jobs during the depths of the COVID-19 crisis are struggling to keep up. https://t.co/dcFrpRSbFq https://t.co/RuaoCuIHRC","date":"Thu Jun 23 20:36:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Lines at airports are long, and lost luggage is piling up. It’s expected to be a chaotic summer for travelers in Europe. https://t.co/FsoUS7Kdfp","date":"Thu Jun 23 20:31:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Three former Justice Department officials testified before the Jan. 6 panel on Thursday that then-President Donald Trump was fixated on voter fraud claims and insisted they pursue them despite being repeatedly told that none of the allegations had merit. https://t.co/ekjUmrWRCm https://t.co/L0iATOEu4B","date":"Thu Jun 23 20:29:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The State Department is preparing to compensate victims of mysterious brain injuries colloquially known as “Havana Syndrome\" with six-figure payments, according to officials and congressional aides. https://t.co/DtBz4wxxVB","date":"Thu Jun 23 20:12:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Vice President Kamala Harris met with attorneys general from seven Democratic-led states and suggested they might be able to lead legal challenges of any new state abortion restrictions that grow out of an upcoming Supreme Court ruling. https://t.co/NMOrmw3Pld","date":"Thu Jun 23 20:03:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Survivors are pleading for help after a powerful earthquake struck a rural, mountainous region of Afghanistan, killing 1,000 people and injuring 1,500 more.\n\nThe quake on Wednesday was the country's deadliest in two decades, and officials said the toll could rise. https://t.co/4NBT0LSE1h","date":"Thu Jun 23 20:03:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Former Justice Department official Richard Donoghue testified at the Jan. 6 hearing that former President Trump pressed officials to say the 2020 election was \"corrupt.\" https://t.co/S9DRVwzKZE https://t.co/RtDVCx2OXS","date":"Thu Jun 23 20:02:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Amazon’s Alexa might soon replicate the voice of family members - even if they’re dead.\n\nThe capability is in development and would allow the virtual assistant to mimic the voice of a specific person based on a less than a minute of provided recording. https://t.co/a4oBEXyAu2","date":"Thu Jun 23 19:55:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Biden administration is dropping a rule adopted under former President Donald Trump that limited which lands and waters could be designated as critical habitat for imperiled animals and plants. https://t.co/0Qhys8ZUqL","date":"Thu Jun 23 19:36:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Rep. Adam Kinzinger details then-President Donald Trump's effort to use the Justice Department for his own political gain over the 2020 presidential election results on Day 5 of hearings by the Jan. 6 committee. https://t.co/S9DRVwzKZE https://t.co/v1Zoln1AzZ","date":"Thu Jun 23 19:28:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"NASA said it has finished testing its huge moon rocket and will move it back to the launch pad in late August.\n\nA date for the first flight will be set after a leak that popped up during a dress rehearsal is fixed, the space agency said. https://t.co/WokcMiag3Z","date":"Thu Jun 23 19:26:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"First lady Jill Biden on Wednesday joined women's professional tennis icon Billie Jean King and an All-American high school track athlete to celebrate the 50th anniversary of Title IX. https://t.co/KtDbl4Txhd","date":"Thu Jun 23 19:16:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Watch live: Jan. 6 House panel holds fifth hearing with a focus on testimony from former Justice Department officials and then-President Donald Trump’s proposals to reject the election results. https://t.co/wwGykWqtMy","date":"Thu Jun 23 19:01:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The European Union’s leaders have agreed to make Ukraine a candidate for EU membership, setting in motion a potentially yearslong process that could draw the country further away from Russia’s influence. The EU also granted candidate status to Moldova. https://t.co/lUMDAxvMGe","date":"Thu Jun 23 18:44:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Jan. 6 committee will hear from former Justice Department officials who faced down a relentless pressure campaign from Donald Trump over the 2020 presidential election results in its fifth day of hearings. \n\nWatch live at 3 p.m. ET.\nhttps://t.co/Uy0pTWQPNu","date":"Thu Jun 23 18:23:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal agents this week searched Trump-era Justice Department official Jeffrey Clark's Virginia home, a person familiar with the matter speaking on condition of anonymity told @AP. https://t.co/6CiCH7HNoy","date":"Thu Jun 23 18:08:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Both supporters and foes of abortion rights have been gathering in front of the Supreme Court building ahead of a potential ruling that could overturn Roe v. Wade.\n\nFor each, the reasons for protesting are deeply personal. This is what some had to say. https://t.co/wpJSIr4CDi https://t.co/oPT8aNLPIg","date":"Thu Jun 23 17:54:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Sri Lanka’s prime minister says the island nation’s debt-laden economy has “collapsed” as it runs out of money to pay for food and fuel. Sri Lankans are skipping meals and lining up for hours to try to buy fuel.\n\nHere’s a look at what’s next. https://t.co/zEn8Fa7mq4","date":"Thu Jun 23 17:13:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"”What all kids need, especially kids who experience trauma, is consistency and stability.”\n\nSome schools are also looking to bolster mental health resources to focus in on students’ social and emotional needs. https://t.co/wkvSUUYfGw","date":"Thu Jun 23 16:58:51 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Schools around the U.S. struggled with rampant discipline issues as students adjusted to being back in classrooms. The same issues are likely to resurface in the fall, experts say, if struggling adolescents don’t get the help and structure they need. https://t.co/Qu77XAOj8S","date":"Thu Jun 23 16:58:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Across America, one of the nation’s most difficult academic years was also one of the most violent. \n\nFights, shootings, and other aggressive behavior have increased, experts say. https://t.co/3x5kDT4U0O","date":"Thu Jun 23 16:57:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Senate pushed a bipartisan gun violence bill to the brink of passage as it voted to halt a Republican filibuster against the measure, clearing the way for Congress’ most far-reaching response in decades to the nation’s run of brutal mass shootings. https://t.co/uZ4skbmYS6","date":"Thu Jun 23 16:43:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: The U.S. will send another $450 million in military aid to Ukraine, including some additional medium-range rocket systems, U.S. officials said Thursday. https://t.co/K7iMpDSMj6","date":"Thu Jun 23 16:37:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal health officials on Thursday ordered Juul to pull its electronic cigarettes from the U.S. market. The announcement by the FDA is part of a sweeping review of e-cigarettes, which faced little regulation until recently. https://t.co/Ei1MDQlIat https://t.co/NnfXTs2kAM","date":"Thu Jun 23 16:35:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“I’m here begging for you guys to do something.” The sister of a 9-year-old girl killed in the Uvalde school rampage tearfully pleaded with Texas lawmakers to pass gun safety legislation. Jazmin Cazares also questioned why so many security measures failed. https://t.co/CkNZwErPzJ","date":"Thu Jun 23 16:02:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Kallas praised the unity that Europe has shown in punishing Russia for the invasion that began Feb. 24, even though she said it was clear from the beginning that it would be “more and more difficult over time” to hang together. https://t.co/BQPdS3E2Nv","date":"Thu Jun 23 15:56:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Kallas said in an interview that Europe should ensure that those committing war crimes and attempted genocide are prosecuted, noting that Putin escaped punishment for annexing the Crimean Peninsula in 2014. https://t.co/PYJQ7da97H","date":"Thu Jun 23 15:55:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The West should not underestimate Russia's military capabilities in Ukraine, Estonia's Prime Minister Kaja Kallas told @AP, saying that as the war enters its fifth month, President Vladimir Putin's forces are in it for the long haul. https://t.co/c5vua1s5GX","date":"Thu Jun 23 15:54:30 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Away from the critics and chaos of life on land, the subculture of \"mermaiding\" offers a kinder, gentler and more joyful alternative to the real world.\n\nIt is also a world, merfolk say, where you can be whoever and whatever you want. https://t.co/UAn8ELPJ5d https://t.co/cQocw4xfRk","date":"Thu Jun 23 15:50:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The first storm of the 2022 hurricane season caused dozens of collapses in Havana and damaged homes that were already in poor condition, highlighting one of Cuba’s main social problems: a shortage of quality housing. https://t.co/s2UMRlxHN3 https://t.co/f45IdoXf7s","date":"Thu Jun 23 15:31:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Law enforcement officers can't be sued for money damages when they violate the rights of criminal suspects by failing to provide the familiar Miranda warning before questioning them, the Supreme Court ruled Thursday. https://t.co/nAuj5vNU9c","date":"Thu Jun 23 15:23:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Announced on the 50th anniversary of Title IX, the proposal would replace a set of controversial rules issued under former Education Secretary Betsy DeVos. It’s expected to spark new legal battles over the rights of transgender students in schools. https://t.co/OPr5IPBMz6","date":"Thu Jun 23 15:09:34 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: The Biden administration has proposed an overhaul of campus sexual assault rules, acting to expand protections for LGBTQ students, bolster the rights of victims and widen colleges’ responsibilities in addressing sexual misconduct. https://t.co/hIKkol3INo","date":"Thu Jun 23 15:08:44 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court on Thursday struck down a restrictive New York gun law in a 6-3 decision that is expected to ultimately allow more people to legally carry guns on the streets of the nation’s largest cities. https://t.co/T904vJgTN0 https://t.co/XRcVIwnrEZ","date":"Thu Jun 23 15:00:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Federal health officials have ordered Juul to pull its electronic cigarettes from the U.S. market. It's the latest blow to the company widely blamed for sparking a national surge in teen vaping. https://t.co/zBJMqgjlWC","date":"Thu Jun 23 14:56:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A judge gave final approval to a settlement topping $1 billion for victims of the collapse of a Florida beachfront condominium building that killed 98 people, one of the deadliest building failures in U.S. history. https://t.co/qk2I16ZXhr","date":"Thu Jun 23 14:46:39 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"About a quarter of the U.S. population lives in states expected to be affected by the decision, the high court's first major gun decision in more than a decade. https://t.co/4XVoSZDyLc","date":"Thu Jun 23 14:43:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The justices in a 6-3 decision said the requirement violates the Second Amendment right to “keep and bear arms.” \n\nThe ruling is expected to directly impact half a dozen other populous states. https://t.co/4XVoSZDyLc","date":"Thu Jun 23 14:43:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: The U.S. Supreme Court strikes down a New York law requiring people to demonstrate a need to get a license to carry a gun in public. https://t.co/BmqvHggPzg","date":"Thu Jun 23 14:41:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court gave North Carolina GOP leaders a win in a fight over the state’s latest photo ID voting law. The 8-1 ruling doesn’t end the dispute over the law, but means that GOP leaders can intervene in the federal lawsuit to defend the law. https://t.co/pBUY5RXbhX","date":"Thu Jun 23 14:29:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"After a powerful earthquake struck eastern Afghanistan Wednesday, villagers rushed to bury the dead and dug through the rubble of their homes in search of survivors. The quake was Afghanistan’s deadliest in two decades, killing at least 1,000 people. https://t.co/UzdxHJPklT https://t.co/Zt7Vr0NvjG","date":"Thu Jun 23 14:28:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Vatican has released the itinerary for Pope Francis’ July 24-30 visit to Canada. The publication of the program is a sign he intends to go ahead with the trip despite knee problems that forced him to cancel a similarly difficult visit to Africa. https://t.co/FEPugQkuoV","date":"Thu Jun 23 14:21:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Farmers in the Donetsk region are worried about the impending harvest season amid the dangers of war, high fuel prices and the challenge of servicing their equipment. https://t.co/nxsUyaBstv","date":"Thu Jun 23 13:50:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Turning carp into a popular household and restaurant menu item is one way officials hope to rein in a decades-old invasion threatening native fish, mussels and aquatic plants in the Mississippi and other Midwestern rivers, as well as the Great Lakes. https://t.co/daiWik73G2 https://t.co/T8amcFsYj9","date":"Thu Jun 23 13:31:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"I think there’s room under the sea for all of us.\"\n\nA growing number of people are embracing the subculture of \"mermaiding\" — donning mermaid tails and joining communities of others who do the same. Many say they’ve found life in the water a refuge. https://t.co/i2sMIevsSk","date":"Thu Jun 23 13:02:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Fewer Americans applied for jobless benefits last week as the U.S. job market remains robust despite four-decade-high inflation. Applications for jobless aid for the week ending June 18 fell to 229,000, a decline of 2,000, the Labor Department reported. https://t.co/4SZ5qklhH6","date":"Thu Jun 23 12:49:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The smell of success: A bloodhound named Trumpet won the Westminster Kennel Club Dog Show, marking the first time the breed has ever snared U.S. dogdom’s most coveted best in show prize. https://t.co/j4RJyI1qBp https://t.co/2j6ceoyaaL","date":"Thu Jun 23 12:38:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Myanmar’s military government confirmed that ousted leader Aung San Suu Kyi has been moved to a prison compound in quarters separate from other detainees. Suu Kyi was arrested on Feb. 1, 2021, when the army seized power from her elected government. https://t.co/KwVGOwB9Q0","date":"Thu Jun 23 12:10:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In one village in Afghanistan, men dug a line of graves as they tried to lay the dead to rest quickly after an earthquake killed at least 1,000 people. In one courtyard, bodies lay wrapped in plastic to protect them from rains hampering relief efforts. https://t.co/KGZEdkyb0R","date":"Thu Jun 23 11:20:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"U.S. coach Andrea Fuentes prevented a tragedy at the swimming world championships with a quick reaction. She knew something was wrong when she saw artistic swimmer Anita Alvarez sink motionless to the bottom of the pool. The fully clothed Fuentes dived in. https://t.co/b98MxcFzHF","date":"Thu Jun 23 10:52:53 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Russia's military is taking more territory in eastern Ukraine, capturing two villages and vying for control of a highway in an offensive that could cut supply lines and encircle some front-line Ukrainian forces, U.K. and Ukrainian military officials say. https://t.co/r7AqdOBrqc","date":"Thu Jun 23 10:49:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"European Union leaders are set to grant Ukraine candidate status to join the bloc, a first step in a process toward full membership that could take many years to achieve. \n\nThe country's bid was launched only a few days after Russia invaded on Feb. 24 https://t.co/TWMACogFR1","date":"Thu Jun 23 10:23:53 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Sri Lanka’s prime minister says the island nation's debt-laden economy has “collapsed” as it runs out of money to pay for food and fuel.  Economists say the crisis stems from years of corruption, being $51 billion in debt, the pandemic and terror attacks. https://t.co/NVbLubJ9Br","date":"Thu Jun 23 09:34:16 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Got European travel plans this summer? Don't forget to pack your passport, sunscreen and plenty of patience. https://t.co/qxB92hXzjD","date":"Thu Jun 23 09:26:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Germany triggers second phase of three-level emergency plan for gas supply amid dwindling deliveries from Russia.\n\nThe government says the country is facing a \"crisis,\" and has raised the level to \"alarm.\" https://t.co/Mn4FMaEkZI","date":"Thu Jun 23 08:07:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"#TheAPInterview: Estonian Prime Minister Kaja Kallas says the West should not underestimate Russia's military capabilities in Ukraine. Kallas said President Vladimir Putin's forces are in it for the long haul as the war enters its fifth month. https://t.co/sAs5BKUxUK","date":"Thu Jun 23 07:44:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"China's president is hosting a virtual summit with the leaders of Brazil, Russia, India and South Africa collectively known as the “BRICS,\" amid rising concerns over the global economic outlook and a growing political divide between Beijing and New Delhi. https://t.co/vNMSzfLuXm","date":"Thu Jun 23 06:38:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Millions of Americans who rely on their cars for work are changing their habits, signing up for carpools or even ditching their cars for bicycles as gas prices recently hit $5 per gallon for the first time ever. https://t.co/4NgBvt45b3","date":"Thu Jun 23 05:53:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Survivors are digging by hand through villages in eastern Afghanistan reduced to rubble by a powerful earthquake that killed at least 1,000. The Taliban and the international community that fled their takeover are struggling to aid the disaster’s victims. https://t.co/EnGs691jLF","date":"Thu Jun 23 05:39:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Prosecutors say British socialite Ghislaine Maxwell should spend at least 30 years in prison for her role in the sexual abuse of teenage girls over a 10-year period by her onetime boyfriend, financier Jeffrey Epstein. https://t.co/ciJM0ta2wh","date":"Thu Jun 23 05:33:36 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“I think there’s room under the sea for all of us.” A growing number of people are embracing the subculture of “mermaiding” — donning mermaid tails and joining communities of others who do the same. Many say they’ve found life in the water a refuge. https://t.co/ggjT26Kklj","date":"Thu Jun 23 04:34:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: A bloodhound named Trumpet has won the Westminster Kennel Club Dog Show. Trumpet bested six other finalists to snare U.S. dogdom’s most coveted best in show prize. https://t.co/KuIuCZwfP1","date":"Thu Jun 23 03:25:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Facing stubbornly high gas prices that average about $5 a gallon nationwide, President Joe Biden urged Congress to suspend federal gasoline and diesel taxes for three months.\n\nHere's a look at how the proposed gas tax holiday would work: https://t.co/gz8kZIDiss","date":"Thu Jun 23 03:06:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A swimmer has been badly injured in a shark attack on the California coast and taken to a hospital, authorities say. Firefighters deployed a drone to search for the shark but there were no immediate sightings. https://t.co/zil5aggwPf","date":"Thu Jun 23 02:13:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Ukrainian official tells @AP that the European Union could decide as soon as Thursday to accept Ukraine as a candidate for membership in the bloc. Candidacy is the first step toward membership and doesn't provide security guarantees. https://t.co/fHwP8swEKk","date":"Thu Jun 23 01:56:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Health officials in Britain are warning parents to ensure their children have been vaccinated against polio after the virus that causes the disease was found in London sewage samples. Authorities say the risk to the public is negligible. https://t.co/sF4DD27BTC","date":"Thu Jun 23 01:47:38 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Police say nearly $100,000 in cash was taken in a burglary from the Atlanta home of former NBA player Vince Carter. Carter told police he kept the money in a closet. Police say a fingerprint from the suspect was collected from the scene. https://t.co/yUxABacI90","date":"Thu Jun 23 01:21:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The U.S. Coast Guard is searching for two people reported overdue after they decided to return to Virginia in their weather-damaged sailboat instead of continuing across the Atlantic to Portugal’s Azores. It's been days since anyone's heard from the pair. https://t.co/dyjYemsVCG","date":"Thu Jun 23 01:04:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The U.S. has endured a succession of mass shootings at schools, places of worship and public gathering places. None led Congress to react with significant legislation — until now. https://t.co/RvOpjBMkYX","date":"Thu Jun 23 00:47:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Chile's new left-leaning government is doing away with the office of the first lady. Both the president and his partner regard the role as archaic. The first lady will now be known as the “sociocultural coordinator of the republic’s presidency.” https://t.co/ht9D18bb9y","date":"Thu Jun 23 00:38:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Death threats. Harassment. Baseless accusations. Unprecedented attacks on local election officials following the 2020 presidential election in the U.S. have driven many of them from their jobs. https://t.co/o9u8AVXNka","date":"Thu Jun 23 00:29:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Discussions at a key military meeting of Kim Jong Un and his top officers, as reported by state media, suggest North Korea may seek to deploy battlefield nuclear weapons targeting rival South Korea along their tense border. https://t.co/mrH3NhAJXr","date":"Thu Jun 23 00:16:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"If “invasive carp” doesn't sound appetizing, how about a plate of copi?\n\nThe state of Illinois is unveiling a market-tested rebranding campaign to make the fish appealing to consumers. https://t.co/K1PEeV6bxn https://t.co/UraO4TClIk","date":"Thu Jun 23 00:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Brazil’s judicial watchdog says it's investigating a judge who stopped an 11-year-old rape victim from getting an abortion. A lawyer for the girl's family tells @AP she was 10 when she was raped, and didn't notice the pregnancy until its 22nd week. https://t.co/FCuZbQghKV","date":"Wed Jun 22 23:59:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Chief Pete Arredondo has been put on leave amid criticism of the police response to last month's massacre at a grade school in Uvalde, Texas. The mass shooting left 19 students and two teachers dead. https://t.co/AoN9hA629f","date":"Wed Jun 22 23:41:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Ohio State University has won its fight to trademark the word “The,\" allowing it to control use of the word on branded products associated with and sold through athletics and collegiate channels. https://t.co/ImjGElrQhJ","date":"Wed Jun 22 23:23:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Joe Biden calls on Congress to suspend federal gasoline and diesel taxes for three months — an election-year move meant to ease financial pressures that was greeted with doubts by many lawmakers. https://t.co/9GLPX5J1rZ https://t.co/1YUlEYwUMl","date":"Wed Jun 22 23:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Turning carp into a popular household and restaurant menu item is one way officials hope to rein in a decades-old invasion threatening native fish, mussels and aquatic plants in the Mississippi and other Midwestern rivers, as well as the Great Lakes. https://t.co/daiWik73G2 https://t.co/ySEYLnfPIH","date":"Wed Jun 22 23:11:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A team of biologists recently hauled in the heaviest Burmese python ever captured in Florida, officials said.\n\nThe female python weighed in at 215 pounds, was nearly 18 feet long and had 122 developing eggs. https://t.co/Y7wAPUeZ5m","date":"Wed Jun 22 23:02:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Farmers in the Donetsk region are worried about the impending harvest season amid the dangers of war, high fuel prices and the challenge of servicing their equipment. https://t.co/zOtiyRaWY3","date":"Wed Jun 22 22:30:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Democratic gubernatorial nominee Joe Cunningham is proposing a 72-year-old age limit for South Carolina politicians — a cap that would cut off incumbent Gov. Henry McMaster.\n\nThe limit would take a constitutional amendment and voter approval to implement. https://t.co/DVm60gBuNa","date":"Wed Jun 22 22:14:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Andrew Gillum, the 2018 Democratic nominee for Florida governor, was indicted on 21 federal charges including conspiracy and wire fraud for allegedly funneling donations through third parties back to himself for personal use.\n\nGillum denied the charges. https://t.co/O0ii06barM","date":"Wed Jun 22 22:06:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The IRS has an even bigger backup for this tax season than it did a year ago and its pace for processing paper returns is slowing down, according to a newly released watchdog report. https://t.co/3Xecp38J0K","date":"Wed Jun 22 21:48:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal Reserve Chair Jerome Powell underscores his determination to raise interest rates high enough to slow inflation, a commitment that has fanned concerns that the central bank's fight against surging prices could tip the economy into recession. https://t.co/ldUpzDGqak https://t.co/gbqMu9iHiw","date":"Wed Jun 22 21:40:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A steady stream of protesters has turned the street in front of the Supreme Court building into an open-air forum encapsulating the fierce national debate over abortion.\n\nHere’s what some had to say: https://t.co/AGLsHKpo2U","date":"Wed Jun 22 21:25:30 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The first storm of the 2022 hurricane season caused dozens of collapses in Havana and damaged homes that were already in poor condition, highlighting one of Cuba’s main social problems: a shortage of quality housing. https://t.co/s2UMRlxHN3 https://t.co/YOC0JI1d1N","date":"Wed Jun 22 21:10:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Tony Siragusa, the charismatic TV broadcaster and former NFL defensive tackle who helped lead a stout Baltimore defense to a Super Bowl title, has died at 55.\n\nHis cause of death was not immediately available. https://t.co/eQbJUevE7f","date":"Wed Jun 22 20:45:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Brittney Griner will have a place at the WNBA All-Star Game, being named an honorary starter Wednesday by Commissioner Cathy Engelbert. https://t.co/WUIVHnEWIu","date":"Wed Jun 22 20:42:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Investigators seeking to identify victims of the Tulsa Race Massacre have found enough usable DNA for testing on two of the 14 sets of remains removed from a local cemetery a year ago, a forensic scientist said Wednesday. https://t.co/QNgSA2RYCP","date":"Wed Jun 22 20:21:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Marvel's “Doctor Strange and the Multiverse of Madness” is now available to stream.\n\nHere's a roundup of everything else new on TV, streaming services and music platforms this week from @APEntertainment. https://t.co/YjInndTPEB","date":"Wed Jun 22 19:58:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"For girls of color, some women’s college sports, such as lacrosse, equestrian, rowing or even softball, are ones they are unlikely to be exposed to in grade school.\n\nThe reasons vary, though availability and costs can be major challenges. https://t.co/lp2y8OOsHX","date":"Wed Jun 22 19:49:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Athletic leadership roles are also unequal: 34% of head coaches for women's teams are white women vs. 7% are women of color.\n\nAnd among female athletic directors, just 4% are women of color compared to 20% white. https://t.co/lp2y8OOsHX","date":"Wed Jun 22 19:49:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Read more @AP_Sports coverage of the Title IX anniversary: https://t.co/sEkFtqjgJR","date":"Wed Jun 22 19:49:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Tina Sloan Green coached Temple University lacrosse in the 1970s and noticed most of the kids attending sports camps were white and suburban. https://t.co/lp2y8OOsHX https://t.co/iA9nWJ3qCC","date":"Wed Jun 22 19:49:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Inequality persists among Black women and other women of color when it comes to participation in sports in the 50 years since Title IX has passed, reflecting the limitations of a policy that only addresses equity on the basis of sex and gender. https://t.co/lp2y8OOsHX https://t.co/AmV2VEFu51","date":"Wed Jun 22 19:49:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Several thousand cars, trucks and recreational vehicles are backed up in long lines at entrances to Yellowstone National Park as it partially reopens following destructive floods that closed the park last week. https://t.co/VZNXIRnPnf https://t.co/ce8bPxKemS","date":"Wed Jun 22 19:44:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Baltimore Ravens linebacker Jaylon Ferguson has died at age 26. Ferguson, nicknamed “Sack Daddy,” played three NFL seasons, all with Baltimore.\n\nPolice said the cause of death is still to be determined. https://t.co/oVagiqFUNE","date":"Wed Jun 22 19:27:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A union has reached a deal with Alaska Airlines for a two-year contract extension that provides substantial raises for 5,300 gate agents, stores personnel and office staff, as well as for ramp workers who load cargo. https://t.co/M1wv1ThNJF","date":"Wed Jun 22 19:10:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"More than five decades after Diane Cusick’s body was discovered in the parking lot of a mall on New York’s Long Island, authorities have linked her death to the so-called “Torso Killer,” a serial killer already convicted in 11 other killings. https://t.co/pCPaKJVK4j","date":"Wed Jun 22 18:58:14 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The owner of seven Louisiana nursing homes whose residents suffered in squalid conditions after being evacuated to a warehouse as Hurricane Ida approached last year was arrested on Wednesday, Louisiana Attorney General Jeff Landry announced.  https://t.co/YXEwEq25wz","date":"Wed Jun 22 18:57:36 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A federal judge has agreed to postpone a trial for the former leader of the Proud Boys and other members of the extremist group charged with attacking the U.S. Capitol to stop Congress from certifying President Joe Biden's 2020 electoral victory. https://t.co/PkknWHKTnx","date":"Wed Jun 22 18:39:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A San Francisco city supervisor says one person was killed and another was wounded in a shooting on a subway train Wednesday.\n\nThe city official says the perpetrator ran out of the train at the city's Castro station and remains at large. https://t.co/l5fufLpRCd","date":"Wed Jun 22 18:26:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House's Jan. 6 committee plans to continue its public hearings into July as its investigation of the Capitol riot deepens.  https://t.co/b83ZuWW3Na","date":"Wed Jun 22 18:08:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The number of new coronavirus cases rose in Southeast Asia, the Middle East and Europe last week, while the number of deaths globally dropped by 16%, according to the World Health Organization's latest weekly pandemic report issued Wednesday.  https://t.co/qjQ3dvI1MX","date":"Wed Jun 22 18:03:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A diplomatic row near Antarctica is playing out between normally allied U.S. and U.K. governments in response to provocations from Russia.\n\nThe feud could lead to an import ban on Chilean sea bass that U.S. officials insist is being caught unlawfully. https://t.co/bBkS4rl1Pd","date":"Wed Jun 22 17:51:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A man who drove his car through crowds of people in Times Square in 2017, killing a young tourist and injuring 20 people, was cleared of responsibility Wednesday because of mental illness. https://t.co/0MV1yZ5EHc","date":"Wed Jun 22 17:20:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"If “invasive carp” doesn't sound appetizing, how about a plate of copi?\nThe state of Illinois is unveiling a rebranding campaign to make the fish appealing to consumers. https://t.co/f3HLhME22S","date":"Wed Jun 22 17:15:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New tensions between Moscow and the West are rising after Lithuania decided to halt the transport of goods through its territory to the Russian region of Kaliningrad as part of European Union sanctions. https://t.co/FMz3VpxBLB","date":"Wed Jun 22 16:58:36 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Microsoft says “strategic espionage” by state-backed Russian hackers has targeted government agencies, think tanks, businesses and aid groups in 42 countries supporting Ukraine. Microsoft says in a report that hacking has been successful 29% of the time.\n\nhttps://t.co/nYKQvNMaeY","date":"Wed Jun 22 16:41:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Biden administration says it is providing logistical support to import about 1 million pounds as baby formula from Mexico starting this weekend as part of efforts to ease nationwide supply shortages.\n\nhttps://t.co/aNomnFEArl","date":"Wed Jun 22 16:37:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Georgia’s highest court has overturned the murder and child cruelty convictions against a man whose toddler son died after he left him in a hot car for hours, saying the jury saw evidence that was “extremely and unfairly prejudicial.”\n\nhttps://t.co/UmP7OJu4h7","date":"Wed Jun 22 16:33:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thousands of farmers gathered in the Netherlands Wednesday to protest the Dutch government's plans to rein in emissions of nitrogen oxide and ammonia.\n\nhttps://t.co/cQJrLGmupZ","date":"Wed Jun 22 16:29:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thousands of farmers gathered in the Netherlands Wednesday to protest the Dutch government's plans to rein in emissions of nitrogen oxide and ammonia. https://t.co/XFFroOHmqH","date":"Wed Jun 22 16:29:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A suburban Minneapolis city has agreed to pay $3.2 million to the family of Daunte Wright, a Black man who was fatally shot by a police officer who said she confused her gun for her Taser. https://t.co/hXPZj4zqlS","date":"Wed Jun 22 15:34:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Heat trapping carbon dioxide emissions from making cement, a less talked about but major source of carbon pollution , have doubled in the last 20 years, new global data shows.  https://t.co/4ec1kvyEzO","date":"Wed Jun 22 15:20:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Walmart is expanding health care coverage for employees who want to enlist the services of a doula, a person trained to assist women during pregnancies, to address racial inequities in maternal care.  https://t.co/yqj8ZgdVbk","date":"Wed Jun 22 15:15:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Sri Lanka’s debt-laden economy has \"collapsed\" after months of shortages of food, fuel and electricity, its prime minister told lawmakers Wednesday, in comments underscoring the country’s dire situation as it seeks help from international lenders. https://t.co/1JYhOdeguP https://t.co/tS4aRUPajz","date":"Wed Jun 22 14:47:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Visitors returned to a changed landscape in Yellowstone National Park as it partially reopened following record floods that reshaped the park’s rivers and canyons and wiped out numerous roads. https://t.co/0gbTMbtySK","date":"Wed Jun 22 14:11:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The head of the Texas state police, in blistering testimony at a state Senate hearing on Tuesday, said the law enforcement response to the Uvalde school shooting was an \"abject failure.\"\n\nTestimony was scheduled to resume Wednesday. https://t.co/Zi7nQCMxzI https://t.co/rjZkjcWQnD","date":"Wed Jun 22 13:59:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Harassment and violence have become common outside abortion clinics.\n\nNow, providers and others are preparing for a potential increase in violence once the Supreme Court rules in a case that could end Roe v. Wade. https://t.co/Sob09ysexy https://t.co/4aknrsXqpl","date":"Wed Jun 22 13:49:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"James Rado, co-creator of the groundbreaking hippie musical “Hair,” which celebrated protest, pot and free love and paved the way for the sound of rock on Broadway, has died. He was 90. https://t.co/OYTtzCS7xO","date":"Wed Jun 22 13:48:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“I want the world to know what we have experienced.” The reflections of a 12-year-old refugee from the Russian invasion of Ukraine will be published. Yeva Skalietska’s book is called “You Don’t Know What War Is: The Diary of a Young Girl from Ukraine.” https://t.co/NnRlVLrGV1","date":"Wed Jun 22 13:15:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Ahead of a decision by the U.S. Supreme Court in a case that could end the nationwide right to abortion, providers and some in law enforcement are preparing for harassment and violence to increase at clinics. https://t.co/9S7nMsiuRY https://t.co/MlJPV03zsB","date":"Wed Jun 22 13:09:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Joe Biden visited a vaccination clinic on Tuesday to celebrate that nearly all Americans can now get a COVID-19 shot after the authorization of vaccines for kids under 5. https://t.co/0ZU6wRCoFT","date":"Wed Jun 22 13:06:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Senate bargainers reached an agreement on a bipartisan gun violence bill, potentially teeing up final passage by week’s end. \"This is a breakthrough,\" said Sen. Chris Murphy, the lead Democratic bargainer, whose district when he served in the House included Newtown, Connecticut. https://t.co/ZBTWrCGYd1","date":"Wed Jun 22 12:33:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A powerful earthquake struck a rural, mountainous region of eastern Afghanistan near the Pakistani border, killing at least 1,000 people and injuring another 1,500 others. The 6.1 magnitude quake was the deadliest temblor to hit Afghanistan in two decades. https://t.co/Nac73NHBqU","date":"Wed Jun 22 11:10:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Delays in the law enforcement response at Robb Elementary School have become the focus of federal, state and local investigations. Testimony was scheduled to resume Wednesday. https://t.co/nzMaSJq48h","date":"Wed Jun 22 10:47:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The head of the Texas state police called the law enforcement response to the Uvalde school shooting an “abject failure,\" saying there were enough officers and firepower on the scene to have stopped the gunman three minutes after he entered the building. https://t.co/pCjhSn5udT","date":"Wed Jun 22 10:45:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Scientists say climate change is a factor behind the devastating floods in Bangladesh and northeastern India. Although the region is no stranger to flooding, it typically takes place later in the year when monsoon rains are well underway. https://t.co/NHGrRqvhtP","date":"Wed Jun 22 10:01:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Biden will call on Congress to suspend federal gasoline and diesel taxes for three months — a move meant to ease financial pressures at the pump that also reveals the political toxicity of high gas prices. https://t.co/vrI14o8P6b","date":"Wed Jun 22 09:31:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An Afghan emergency official says at least 920 people killed, 600 injured in powerful earthquake. https://t.co/v4SGTNhuF1","date":"Wed Jun 22 09:15:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Sri Lanka’s Prime Minister Ranil Wickremesinghe says its debt-laden economy has “collapsed\" after months of shortages of food, fuel and electricity. https://t.co/Pg2qTppOWw","date":"Wed Jun 22 08:44:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Sri Lanka’s economic crisis, the worst in its history, has completely recast the lives of the country’s once ascendant middle class. For many families that never had to think twice about fuel or food the effects have been sudden and painful. https://t.co/VTGHgRdCEV","date":"Wed Jun 22 07:30:53 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Reporters Without Borders says a Ukrainian photojournalist and a soldier who was accompanying him were “coldly executed” in Russia-occupied woodlands in the first weeks of the invasion. Their bodies were found April 1 in woods north of Kyiv. https://t.co/RgiqKYDkNM","date":"Wed Jun 22 07:28:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The deadly earthquake comes as the international community largely has left Afghanistan after the Taliban takeover amid the chaotic U.S. military withdrawal. That likely will complicate any relief efforts for the country of 38 million people. https://t.co/bpPftDhydJ","date":"Wed Jun 22 07:07:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Afghanistan state-run news agency says at least 255 people killed in earthquake that struck eastern Paktika province.  https://t.co/03qXWdgyc8","date":"Wed Jun 22 05:48:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Afghanistan state-run news agency reports at least 155 killed in earthquake in country's eastern Paktika province. https://t.co/9I9UkSfnih","date":"Wed Jun 22 05:19:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Major flooding has forced the evacuation of tens of thousands in southern China, with more rain expected. The manufacturing hub of Guangdong province suspended classes, office work and public transport amid rising waters and the threat of landslides. https://t.co/GjcdTAInjq","date":"Wed Jun 22 05:03:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Mixed results for Donald Trump. A fresh warning to progressives. Takeaways from the latest round of midterm primary elections. https://t.co/MF3mUqeQ1d","date":"Wed Jun 22 04:20:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A bloodhound, a French bulldog, a German shepherd and a Maltese have been chosen to advance to the final round of the Westminster Kennel Club dog show. https://t.co/6DVxASS0XY","date":"Wed Jun 22 04:07:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Doors were not secure before last month's massacre at an elementary school in Uvalde, Texas, experts say. That means the first line of defense in keeping the gunman out of the building had been eliminated. https://t.co/HnwI3EVBqD","date":"Wed Jun 22 02:05:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Olivia Harrison, the widow of former Beatle George Harrison, has opened up about life with her husband — and grieving his death — in a new collection of poems. https://t.co/FfSDBuemSU","date":"Wed Jun 22 02:01:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Britt defeated U.S. Rep. Mo Brooks, who was originally endorsed by Trump but lost the endorsement after he said it was time for Trump to move past his 2020 election loss. https://t.co/iE28tWTwDs","date":"Wed Jun 22 01:40:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Katie Britt has won Alabama’s GOP primary runoff for the U.S. Senate seat being vacated by Republican Richard Shelby.\nBritt, Shelby’s former chief of staff, was endorsed by former President Trump after she won the most votes in the state’s May primary. https://t.co/ujx7NzVMb2","date":"Wed Jun 22 01:39:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Biden has chosen Arati Prabhakar to be his science adviser. If confirmed by the Senate, Prabhakar, the former head of two federal science and engineering agencies, will be the first woman, person of color and immigrant to hold the job. https://t.co/GSkm9zC9l3","date":"Wed Jun 22 01:38:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In just a decade, Yair Lapid has transformed himself from upstart political novice to the savvy operator who toppled Benjamin Netanyahu. Next week, he's expected to assume his biggest role yet — as Israel’s new prime minister. https://t.co/ev9mV7cIle","date":"Wed Jun 22 01:23:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New footage of ex-President Trump and his inner circle taken both before and after Jan. 6, 2021, is now in the possession of the House committee investigating the attack on the Capitol. Word of the footage surfaced Tuesday during the panel’s hearing. https://t.co/BP6aQj3IKZ","date":"Wed Jun 22 01:18:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Stocks ended higher Tuesday on Wall Street, clawing back some of the ground they've lost in recent weeks. The Dow shot up nearly 650 points. https://t.co/yYGWvhAVGb","date":"Wed Jun 22 01:08:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Washington, D.C., Mayor Muriel Bowser has won her Democratic primary, overcoming a challenge from two D.C. Council members amid concerns over rising crime and homelessness. Bowser is the prohibitive favorite in November to win a third term. https://t.co/oAcmabdcyP","date":"Wed Jun 22 00:45:16 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Former President Trump and his allies falsely accused Wandrea “Shaye” Moss, a Georgia elections worker, of pulling fraudulent ballots from a suitcase. An onslaught of threats, she says, soon upended her life. https://t.co/7GuU81a0Eq","date":"Wed Jun 22 00:41:01 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Biden administration says it's restricting the use of anti-personnel land mines by the U.S. military, reversing a more permissive stance by then-President Trump. An international treaty — which the U.S. hasn't signed — bans the deadly explosives. https://t.co/TcbZ8LG9rD","date":"Wed Jun 22 00:33:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"With the authorization of vaccines for children under 5, nearly all Americans can now get a COVID-19 shot. President Biden is celebrating that fact as a pandemic milestone. https://t.co/th0FWlITkm","date":"Tue Jun 21 23:50:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A plane carrying 126 people caught fire after landing at Miami International Airport. Officials said the aircraft's landing gear collapsed. Three people on board were taken to a hospital with minor injuries. https://t.co/WubaCNWpqj","date":"Tue Jun 21 23:44:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal law makes it nearly impossible for airline unions to conduct legal strikes. So airline workers are taking their demands for higher pay directly to the flying public. https://t.co/prtrdl8fqz","date":"Tue Jun 21 23:24:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Two former college roommates who created a successful clothing line under the “Rhode” trademark sued model Hailey Bieber on Tuesday, saying she’s creating market confusion by marketing a skin care line under the Rhode name. https://t.co/amCRZSp14c","date":"Tue Jun 21 23:03:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The verdict comes nearly a year after Cosby’s Pennsylvania criminal conviction for sexual assault was thrown out and he was freed from prison. https://t.co/gRjRjKm6PW","date":"Tue Jun 21 22:47:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Cosby, 84, did not attend the trial. Jurors were shown clips of a 2015 video deposition in which he denied any sexual contact with Huth. https://t.co/uyhNsOU5aL","date":"Tue Jun 21 22:46:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Cosby's attorneys acknowledged that Cosby met Judy Huth, who is now 64, and a friend on a film set, and took them to the Playboy Mansion a few days later. https://t.co/0TKaLO2qvS","date":"Tue Jun 21 22:46:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: A civil trial jury finds that Bill Cosby sexually abused a 16-year-old girl at the Playboy Mansion in 1975 and awards her $500,000. https://t.co/13k6htnqne","date":"Tue Jun 21 22:42:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The South Dakota Senate convicted Attorney General Jason Ravnsborg in an impeachment trial over a 2020 car crash in which he killed a pedestrian.\n\nThe conviction triggers immediate removal from office. https://t.co/0er6do6Euc","date":"Tue Jun 21 22:33:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A defense attorney worked to poke holes in the testimony of a key prosecution witness Tuesday in the murder trial for the killing of rapper Nipsey Hussle. https://t.co/kqfIDKZYqH","date":"Tue Jun 21 22:31:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Internal Revenue Service said that it will have erased its backlog of last season's tax returns by the end of this week.\n\nAgency officials say there's a greater likelihood of being caught up on processing all returns by the end of this year. https://t.co/yiiU22VbVe","date":"Tue Jun 21 22:17:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An aide for U.S. Sen. Ron Johnson told former Vice President Mike Pence’s staff that the Republican from Wisconsin wanted to hand-deliver fake elector votes from his state and Michigan, text messages revealed at Tuesday's Jan. 6 hearing showed. https://t.co/ykjGLaU5hk","date":"Tue Jun 21 21:26:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Colombia President-elect Gustavo Petro's promise of sweeping change in a country that has long been a bulwark of regional stability has many in Washington on edge — even if his victory was embraced by millions fed up with enormous inequality. https://t.co/7Oe8cTQRyF","date":"Tue Jun 21 21:08:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"I felt horrible for picking this job.\"\n\nFormer Georgia election worker Wandrea \"Shaye\" Moss told the Jan. 6 panel about the emotional toll on her family after Donald Trump falsely accused Moss and her mother of tampering with election results. https://t.co/INt4HGVXgn https://t.co/mKufRepRNK","date":"Tue Jun 21 20:58:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Senators have moved to the brink of an agreement on a bipartisan gun violence bill, says a lead Democratic bargainer, potentially teeing up votes this week on a package that would stand as Congress’s response to mass shootings in Texas and New York. https://t.co/m28gMJHMKT","date":"Tue Jun 21 20:52:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"I haven't been anywhere at all.\"\n\nIn testimony to the Jan. 6 panel, former Georgia election worker Wandrea \"Shaye\" Moss recounts the public harassment she and her mother faced after being \"targeted by the former president and his allies,\" and the toll it has taken on her life. https://t.co/IFP9vbmkNs","date":"Tue Jun 21 20:32:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Facebook will change its algorithms to prevent discriminatory housing advertising and its parent company Meta will subject itself to court oversight to settle a lawsuit brought by the U.S. Department of Justice on Tuesday. https://t.co/BVwcY9hMBT","date":"Tue Jun 21 20:26:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Deshaun Watson’s decision to settle 20 of 24 civil lawsuits for sexual misconduct may not dissuade the NFL from giving him a lengthy suspension, a person familiar with the league’s investigation told the @AP on Tuesday.\n\nhttps://t.co/IiTKnwwKxC","date":"Tue Jun 21 20:12:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“It all feels sort of like this wonderful dream.\" Austin Butler talks about what it was like to embody Elvis for the new film about one of the most iconic figures in American music.\n\"Elvis\" opens in theaters Friday. https://t.co/AQZxMLcsLd","date":"Tue Jun 21 20:09:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House committee investigating the Jan. 6 riot on Tuesday turned to former President Donald Trump’s pressure campaign on state and local officials to overturn his 2020 election loss.\n\nHere are takeaways from Day 4 of the hearings. https://t.co/pFY5TtpGRV","date":"Tue Jun 21 20:00:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"France’s top administrative court has ruled against allowing body-covering “burkini” swimwear in public pools for religious reasons.\n\nWhile worn by only a small number of people in France, the head-to-ankle burkini draws intense political debate. https://t.co/hhp4Vc2Tc1","date":"Tue Jun 21 19:40:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Chicago police officers will no longer be allowed to chase people on foot simply because they run away or give chase over minor offenses, the department said Tuesday, more than a year after two foot pursuits ended with fatal shootings by officers. https://t.co/GTvkWwCspU","date":"Tue Jun 21 19:32:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"\"There were no votes to find.\"\n\nGeorgia Secretary of State Brad Raffensperger testifies to the Jan. 6 panel about then-President Donald Trump’s phone call asking him to \"find 11,780\" votes that could flip his state to prevent Joe Biden’s election victory. https://t.co/8U8DtLg8r8 https://t.co/d9RxkKLCEw","date":"Tue Jun 21 19:31:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Here are some tips on how to incorporate native plants into a conventional garden without doing a complete renovation. https://t.co/vfAzpzXhQx","date":"Tue Jun 21 19:30:13 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A pilot, Oleksandr, flew one of these missions to Mariupol. \n\nHe recalled being fired at by a ship, a blast wave tossing the helicopter around “like a toy.” https://t.co/o0j5YWG1kN","date":"Tue Jun 21 19:26:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Upon landing safely, Oleksandr heard the wounded calling out and expected them to be angry about the violent flight. When he opened the door, they were saying “Thank you.”\n\n“We told the pilots that they had done the impossible,” Buffalo said. https://t.co/o0j5YWG1kN","date":"Tue Jun 21 19:26:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"When Buffalo made it on a flight the next week, a crew member took his hand and told him not to worry. They’d make it home.\n\n“All my life,” he told the crew member, “I dreamed of flying a helicopter. It doesn’t matter if we arrive — my dream has come true.”https://t.co/bONwHbkXbO https://t.co/qg0qcXKxIe","date":"Tue Jun 21 19:26:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Zahorodnii was evacuated from Azovstal by helicopter on March 31. The Mi-8 took fire on its way out, eliminating one engine. The other kept them airborne.\n\nHe would mark his deliverance with a mortar round tattoo on his forearm. https://t.co/bONwHbkXbO https://t.co/PsVTomRvwG","date":"Tue Jun 21 19:26:52 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"He was soon brought to the Azovstal plant, where conditions were grim.\n\n“There was constant shelling,” said Vladislav Zahorodnii, 22, a corporal who had been shot through the pelvis, shredding a nerve, during street fighting in Mariupol. https://t.co/bONwHbkXbO https://t.co/4S6lhTazr6","date":"Tue Jun 21 19:26:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"On that flight was a 20-year-old junior sergeant known as “Buffalo.” \n\nShredded by mortar rounds during street fighting in Mariupol, his left leg had been amputated in a basement bomb shelter. https://t.co/bONwHbkXbO https://t.co/Hsm5ArLNJx","date":"Tue Jun 21 19:26:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Some ended in catastrophe; each grew progressively risky. The full story of the seven missions has yet to be told.\n\nBut through exclusive interviews with the rescuers and the rescued, @AP pieced together an account of one of the last flights. https://t.co/o0j5YWG1kN","date":"Tue Jun 21 19:26:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Ukrainian soldiers’ last-ditch stand at Mariupol’s Azovstal steel mill was a symbol of the country’s defiance in the war with Russia.\n\nNow a series of secret missions to reach the besieged soldiers is being hailed as among the most heroic acts of the war. https://t.co/o0j5YWG1kN","date":"Tue Jun 21 19:26:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Texas' top cop described the response to the Uvalde school shooting as an \"abject failure and antithetical to everything we've learned over the two decades since the Columbine massacre.\"\n\nhttps://t.co/QPbcdF7eox https://t.co/a8tWbc4A3R","date":"Tue Jun 21 18:51:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Stephen Colbert pronounced his staff members arrested at a congressional office building last week as guilty of “first-degree puppetry.”\n\nIn his monologue Monday, he lashed out at those comparing the incident to the Jan. 6, 2021, U.S. Capitol riot. https://t.co/uRFuwaLm6d","date":"Tue Jun 21 18:40:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Arizona Republican state House Speaker Rusty Bowers, during testimony before the Jan. 6 committee, details the consistent harassment that he, his family and neighbors have faced since the 2020 election. https://t.co/8U8DtLxJiG https://t.co/Pz7hNiUUnA","date":"Tue Jun 21 18:23:39 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House Jan. 6 committee is outlining then-President Donald Trump’s relentless pressure to overturn the 2020 presidential election, aiming to show it led to widespread personal threats on election workers and officials who fended off Trump's efforts.\n\nhttps://t.co/dUl5sEjYHO","date":"Tue Jun 21 17:56:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A planned burn to reduce the threat of wildfire turned into the largest blaze in New Mexico history due to miscalculations, inaccurate models and a lack of understanding of how dry things are in the Southwest, the U.S. Forest Service said Tuesday. https://t.co/VLgpPuKwg5","date":"Tue Jun 21 17:37:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"For more than a century, the British soldier lay in an anonymous grave, one of so many unidentified victims buried beneath the killing fields of World War I.\n\nBut now, his headstone finally bears a name: 2nd Lt. Osmund Bartle Wordsworth. https://t.co/LR6lb6QEzj","date":"Tue Jun 21 17:29:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Rep. Liz Cheney on Day 4 of the hearings investigating the Jan. 6 attack on the U.S. Capitol urges viewers to not be distracted by politics and instead \"focus on the evidence.\"\n\n\"We cannot let America become a nation of conspiracy theories and thug violence.\" https://t.co/G4PcTYIFE9","date":"Tue Jun 21 17:26:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Watch live: Jan. 6 House committee hears from elections workers and local officials, who fended off Donald Trump’s pressure to overturn the 2020 election, in Day 4 of hearings. https://t.co/2rw386oWR9","date":"Tue Jun 21 17:02:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Cleveland Browns quarterback Deshaun Watson has reached an agreement to settle 20 of the 24 civil lawsuits that had been filed by women who had accused him of sexual assault and harassment, an attorney says. https://t.co/huflYcFtV8","date":"Tue Jun 21 16:58:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A lifeguard shortage exacerbated by the pandemic has prompted communities across the U.S. to cut back on pools and hours, or go without attendants.\n\nThat’s left some Americans with fewer or riskier options as much of the country endures a heat wave. https://t.co/ESOw5JGPGo","date":"Tue Jun 21 16:46:44 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Józef Walaszczyk, a member of the Polish resistance who rescued dozens of Jews during the Nazi German occupation of Poland during World War II, has died. He was 102. https://t.co/82LMhwJ9nm","date":"Tue Jun 21 16:45:11 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Classroom door in Uvalde school shooting was not locked, even as police waited for key, Texas public safety chief says. https://t.co/tBKX5Tlor1","date":"Tue Jun 21 16:16:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Russian attacks are laying down a curtain of fire across areas of eastern Ukraine where pockets of resistance are denying Moscow full military control of the region.\n\nA regional official told @AP on Tuesday that “everything that can burn is on fire.” https://t.co/X6kM95hxv2","date":"Tue Jun 21 15:54:26 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Cherelle Griner was supposed to speak to her wife, Brittney Griner, on the phone for the first time since the WNBA star was detained in Russia.\nThey didn't get to connect.\n\n\"She was only allowed to call the number given directly to the embassy, and they did not answer.\" https://t.co/vD0RjBcaL7","date":"Tue Jun 21 15:30:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Police had enough officers on the scene of the Uvalde school massacre to stop the gunman three minutes after he entered the building, the Texas public safety chief said Tuesday, calling the police response an “abject failure” at a state Senate hearing. https://t.co/r9BdgR8zGN","date":"Tue Jun 21 15:24:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court ruled that religious schools can’t be excluded from a Maine program that offers tuition aid for private education, a decision that could ease religious organizations’ access to taxpayer money. https://t.co/YiR787uSx3","date":"Tue Jun 21 14:50:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court rejected Bayer’s appeal to shut down lawsuits claiming that its Roundup weedkiller causes cancer. The justices left in place a $25 million judgment in favor of a California man who says he developed cancer from using Roundup for decades. https://t.co/NnsKrgsSRK","date":"Tue Jun 21 14:48:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Nobel Peace Prize auctioned off by Russian journalist Dmitry Muratov to raise money for Ukrainian child refugees sold for $103.5 million.\n\nPreviously, the most ever paid for an auctioned Nobel Prize medal was $4.76 million in 2014. https://t.co/hcQhXssOjl https://t.co/OC2WxirYRa","date":"Tue Jun 21 13:52:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A series of clandestine missions to reach besieged soldiers at the Azovstal steel mill are being hailed in Ukraine as among the most heroic feats of the war.\n\nPieced together through exclusive interviews, this is an account of one of the last fights. https://t.co/zxui76Vj8c","date":"Tue Jun 21 13:31:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thousands of people gathered at Stonehenge on Tuesday for the summer solstice, the longest day of the northern hemisphere year.\n\nIt was the first time revelers have been permitted to gather for the solstice since 2019. https://t.co/E2VFJtVI4n https://t.co/6QMgzkfe6H","date":"Tue Jun 21 13:21:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thousands of druids, pagans and New Age revelers greeted the summer solstice at Stonehenge, the longest day in the northern hemisphere. https://t.co/g6nVN58KQF","date":"Tue Jun 21 12:35:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"AP Photos: Early and strong monsoon rains have brought heavy flooding to northeastern India and Bangladesh, killing dozens of people, forcing hundreds of thousands from their homes and cutting millions off from crucial supplies. https://t.co/qcU7PIU78P","date":"Tue Jun 21 12:05:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Kellogg will split into three companies: a cereal maker, a snack maker and a plant-based food company. Kellogg, whose brands include Eggo waffles and Rice Krispies cereal, said the planned spinoffs are expected to be completed by the end of 2023. https://t.co/pr2HoA45KP","date":"Tue Jun 21 11:41:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Villagers in  northeastern Bangladesh are crowding makeshift refugee centers and scrambling to meet boats arriving with food and fresh water. Massive floods have killed dozens of people and displaced hundreds of thousands there and in India. https://t.co/N30omKq2RT","date":"Tue Jun 21 10:45:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As Colombia's voters put aside an antipathy to leftists and chose one as their new president, they also elected the country's first Black vice president. When Gustavo Petro takes office, a key player will be vice president Francia Marquez. https://t.co/UNT67t5N6w","date":"Tue Jun 21 10:22:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Russia's war in Ukraine is fueling fears of a natural gas emergency in Europe.\n\n@AP explains the key things to know about energy pressures, and how they could lead to an economic and political crisis next winter — or even sooner in a worst-case scenario. https://t.co/BbTa5zU5mH","date":"Tue Jun 21 09:22:56 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"South Korea launched its first domestically built space rocket in the second attempt after an earlier liftoff failed to place the payload into orbit. A successful launch would boost Seoul's push to build bigger missiles amid animosities with North Korea. https://t.co/L78s7bcN4K","date":"Tue Jun 21 09:13:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"''They had done the impossible.'' A series of clandestine, against-the-odds helicopter missions to reach soldiers under the brutal Russian siege at Azovstal plant in Mariupol are being celebrated in Ukraine as one of most heroic feats of the war. https://t.co/evZgJsUO5r","date":"Tue Jun 21 07:36:21 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Israel's outgoing coalition government will fast-track a bill this week to dissolve parliament, setting up the country's fifth elections in three years. The vote, likely in October, raises the prospect of a Benjamin Netanyahu comeback. By @IlanBenZion. https://t.co/g2fh5oTW10","date":"Tue Jun 21 07:29:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As nuclear Russia pillages non-nuclear Ukraine, some other non-nuclear states are beginning to wonder: Is it time we got an arsenal of our own? https://t.co/fYPZPeJth6","date":"Tue Jun 21 05:31:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The House panel investigating the U.S. Capitol attack will resume its hearings Tuesday. The focus will be on how Donald Trump, falsely claiming election fraud, pressured officials in battleground states to overturn the 2020 vote. https://t.co/YQkRrEBSfM","date":"Tue Jun 21 05:17:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Independent Al Gross says he is ending his bid for Alaska’s only U.S. House seat. The top four vote getters in the primary advance to the special election in August. Gross finished third, behind Republicans Sarah Palin and Nick Begich. https://t.co/Q8I8BHfMNg","date":"Tue Jun 21 03:45:14 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"It's been only a month since North Korea acknowledged having a COVID-19 outbreak, after denying any cases for more than two years. But already it may be preparing to declare victory. https://t.co/m8TnnG6Asj","date":"Tue Jun 21 03:31:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A settlement agreement has been reached on the eve of a second trial pitting the Kardashian family against former reality TV star Blac Chyna. https://t.co/YJH73FI7er","date":"Tue Jun 21 03:23:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A  new revelation deepens questions about why police didn’t act faster to stop a shooter who killed 19 children and two teachers at an elementary school in Uvalde, Texas, last month. https://t.co/JjHblmzKhj","date":"Tue Jun 21 02:16:47 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The annual Westminster Kennel Club Dog Show is underway. To the casual viewer, well-dressed handlers leading canines around a ring might look like a stilted walk in the park. But a lot more goes in to choosing a champion. https://t.co/LexjE7rSOF","date":"Tue Jun 21 02:13:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Colombia has for the first time elected a leftist as president. But it won't be easy for Gustavo Petro to deliver on promises. His slim victory shows that a large part of the country rejects his ambitious proposals. https://t.co/oKOTIaRnpp","date":"Tue Jun 21 00:31:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Nobel Peace Prize that Russian journalist Dmitry Muratov was auctioning off to raise money for Ukrainian child refugees has sold for $103.5 million. Before this, the most ever paid for a Nobel Prize medal was $4.76 million. https://t.co/ym6dIMWE93","date":"Tue Jun 21 00:10:44 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Ukrainian forces are outgunned by the Russians in the battle for the eastern Donbas region. But in a war of attrition, time may be on Ukraine’s side. https://t.co/hkCUtpwzB7","date":"Mon Jun 20 23:47:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Call it \"crypto winter.\" The wealth-generating hot streak for bitcoin and other cryptocurrencies has turned brutally cold. https://t.co/A5LOv8MWX0","date":"Mon Jun 20 23:19:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New York's governor signed the John R. Lewis Voting Rights Act, a law intended to prevent local officials from enacting rules that might suppress people's voting rights because of their race. https://t.co/xHhJhtifr8","date":"Mon Jun 20 22:34:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Two Florida deputies have each been suspended for about two weeks for leaking news about actor and comedian Bob Saget’s death before his family was alerted, officials said. https://t.co/xfauSf4F9w","date":"Mon Jun 20 21:16:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Georgia Secretary of State Brad Raffensperger is set to testify Tuesday at the House Jan. 6 committee about the pressure he faced from former President Trump to \"find 11,780” votes that could flip the state to prevent Joe Biden’s election victory. https://t.co/ehWve7kPUo","date":"Mon Jun 20 21:06:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"WNBA star Brittney Griner tried to call her wife nearly a dozen times through the U.S. embassy in Russia on the couple’s fourth anniversary Saturday, but they never connected since the phone line at the embassy wasn't staffed, Cherelle Griner tells @AP. https://t.co/WFdStEy7yy","date":"Mon Jun 20 20:51:47 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal officials say most of Yellowstone National Park should reopen within the next two weeks after record floods pounded the region and knocked out major roads. https://t.co/O3j7u3QT66 https://t.co/hWaN3eFMdl","date":"Mon Jun 20 20:45:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In both style and substance, Democrats John Fetterman and Josh Shapiro strike dramatically different profiles.\n\nBut their fate is intertwined in a pair of Pennsylvania elections that will be among the most closely watched in the U.S. https://t.co/rNzGdmKzzf","date":"Mon Jun 20 20:43:34 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Climate change is combining with droughts to push up temperatures and make life more dangerous for homeless people around the world. https://t.co/GEDXMddYck","date":"Mon Jun 20 20:21:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"SpaceX launched three Falcon 9 rockets in just over 36 hours from California and Florida, setting a new U.S. commercial space launch record. https://t.co/UWSVP6X6al","date":"Mon Jun 20 19:55:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Attacks by jihadi rebels in central Mali over the weekend killed 132 civilians, the government says. https://t.co/5KJIhRVbBM","date":"Mon Jun 20 19:00:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The youngest kids in the U.S. are finally getting their chance at COVID-19 vaccines.\n\nThe nation is rolling out the shots this week after the FDA cleared vaccines from Moderna and Pfizer and the CDC gave final approval over the weekend. https://t.co/RUCIKrQRTC https://t.co/qfs7OLyIyS","date":"Mon Jun 20 18:50:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The U.S. Southwest’s arid climate has helped preserve many ancient dwellings, rock carvings and pottery pieces scattered across the landscape. But it’s also the type of environment that is prone to wildfires. https://t.co/0GQHQhbAQZ","date":"Mon Jun 20 18:11:44 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The vote, expected later this year, could bring about the return of a nationalist religious government led by former Prime Minister Benjamin Netanyahu or another prolonged period of political gridlock. https://t.co/8ghs9PmWge","date":"Mon Jun 20 18:05:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The world's largest recorded freshwater fish, a giant stingray, has been caught in the Mekong River in Cambodia. The stingray measured almost 13 feet long and weighed more than 600 pounds. Scientists attached a tagging device before releasing the fish. https://t.co/bm4l36X7TI","date":"Mon Jun 20 17:13:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: President Joe Biden says he's considering a federal holiday on the gasoline tax, possibly saving Americans as much as 18.4 cents a gallon.  Biden says he hopes to make a decision by the end of the week. https://t.co/ILxybgHMeI","date":"Mon Jun 20 16:46:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BTS stunned their fanbase last week when they announced they’d be taking a break to focus on solo projects.\n\nNumerous questions remain, including whether some of the band’s members will soon have to serve in South Korea’s army or be granted an exception.  https://t.co/1guufXea5c","date":"Mon Jun 20 16:46:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Israeli Prime Minister Naftali Bennett’s office says his weakened coalition will be disbanded and the country will head to a new election - the country’s fifth in three years. https://t.co/z17l3ABxsy","date":"Mon Jun 20 16:37:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As global warming ramps up the dangers of being outside, hundreds of homeless people are dying on the streets each year, challenging cities to better protect vulnerable people. https://t.co/baP1G4EIie","date":"Mon Jun 20 15:58:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New albums from Soccer Mommy, Luke Combs and French Montana. Kevin Hart and Woody Harrelson’s “The Man from Toronto” hits Netflix. And “Doctor Strange and the Multiverse of Madness” arrives on Disney+.\n\nHere’s a look at what’s streaming this week. https://t.co/4TqeMB3C9s","date":"Mon Jun 20 15:43:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Hong Kong's iconic Jumbo Floating Restaurant has capsized in the South China Sea less than a week after it was towed away from the city. The landmark restaurant that operated for four decades was closed in 2020 due to the pandemic https://t.co/tkxhEicCPL","date":"Mon Jun 20 15:42:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thousands of students marched in Sri Lanka’s capital to demand the president and prime minister resign over an economic crisis that has caused severe shortages of essential supplies and disrupted people’s livelihoods and education. https://t.co/yRMHlrKUnN","date":"Mon Jun 20 15:28:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Japanese court has ruled that the country’s ban on same-sex marriage does not violate the constitution, and rejected demands for compensation by three couples who said their right to free union and equality has been violated. https://t.co/uoXvTF1ps5","date":"Mon Jun 20 15:13:16 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“I want our beautiful city to be preserved. But we will persevere, we will stand.”\n\nUnder a sky filled with the sound of missiles soaring overhead, people in the eastern Ukrainian city of Bakhmut try to carry on with normal life. https://t.co/2jakVpUKHB","date":"Mon Jun 20 15:00:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A motorcycle taxi driver in Vietnam turns off his ride-hailing app rather than burn fuel during rush hour. A mom in Rome drives her son to camp and crosses off a pizza night.\n\nAs gas prices surge, people worldwide are rethinking their habits and finances. https://t.co/6542a6ct4L https://t.co/LRu4xNxBHw","date":"Mon Jun 20 14:55:13 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In Alabama, the two Republican candidates for U.S. Senate can each say they were at one point endorsed by Donald Trump. In Washington, D.C., Mayor Muriel Bowser faces voters amid growing concerns about crime.\n\nHere’s what to watch in this week’s primaries. https://t.co/2FUpkgTd1Y","date":"Mon Jun 20 14:40:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Colombia will be governed by a leftist president for the first time after former rebel Gustavo Petro narrowly defeated a real estate tycoon in a runoff election that underscored people’s disgust with the country’s traditional politicians. https://t.co/Wjp0uMzICT","date":"Mon Jun 20 14:25:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Floods triggered by monsoon rains have killed more than a dozen people and flooded millions of houses in India and Bangladesh. Authorities on Monday struggled to deliver food and drinking water to the hundreds of thousands evacuated from their homes. https://t.co/q3cFQyHHbC","date":"Mon Jun 20 14:03:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The international music festival founded by the father of singer-songwriter Dua Lipa will return home to Kosovo. The announcement reverses a decision made last week to move the Sunny Hill Festival to neighboring Albania following a political dispute. https://t.co/dYJozhImR5","date":"Mon Jun 20 13:49:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As the United States marks only the second federally recognized Juneteenth, Black Americans living overseas have embraced the holiday as a day of reflection and an opportunity to educate people in their host countries on Black history. https://t.co/5WOjnnrgMQ https://t.co/TgeuAdqvP0","date":"Mon Jun 20 13:45:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Title IX, the law best known for its role in gender equity in athletics and trying to prevent sexual harassment on campuses, is turning 50.\n\nWhat does the law do and who does it impact? Here’s an explainer. https://t.co/n0nEFaocem","date":"Mon Jun 20 13:35:25 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New York’s new law barring sales of bullet-resistant vests to most civilians doesn’t cover the type of armor worn by the gunman who killed 10 people at a Buffalo supermarket, a gap that could limit the law’s effectiveness in deterring future attacks. https://t.co/LBkfFMvYAZ https://t.co/WejbQKHOuH","date":"Mon Jun 20 13:15:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Belgian authorities have returned a gold-capped tooth of the slain Congolese independence hero Patrice Lumumba.\n\nEarlier this month, Belgium’s King Philippe expressed his “deepest regrets” for his nation’s abuses in its former colony Congo. https://t.co/9ZiwYXZqJi","date":"Mon Jun 20 12:35:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"New York City police say an early-morning shooting at a gathering in Harlem left a man dead and eight other people wounded. Police said officers responded about 12:40 a.m. to reports of a shooting on a footpath along the FDR Drive. https://t.co/aKyuSZ4COc","date":"Mon Jun 20 12:22:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The jury will start over with an alternate juror after one had to leave early on Friday and court closure rules prevented the judge from accepting a partial verdict.\n\nThey are weighing whether Cosby sexually assaulted plaintiff Judy Huth in 1975. https://t.co/IC0sfssXgm","date":"Mon Jun 20 11:42:55 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"After two days of deliberations in which they reached verdicts on nearly all of the questions put before them, jurors in a civil trial who were deciding on sexual abuse allegations against Bill Cosby will have to start from scratch on Monday. https://t.co/xKTkUT96Ti","date":"Mon Jun 20 11:41:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"China says it has successfully intercepted a missile in flight, in a test of an anti-ballistic missile system that could improve its defenses as it presses its territorial claims. The Defense Ministry said the test was purely defensive in nature. https://t.co/mW4t1iYrS0","date":"Mon Jun 20 11:40:49 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“It’s just hell there. Everything is engulfed in fire.\"\n\nThe Russian military is grinding down Ukraine's defenses in the eastern Luhansk region. The local governor says shelling and airstrikes have intensified around Sievierodonetsk. https://t.co/b3LhiHBS80","date":"Mon Jun 20 11:19:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"How many people are watching the Jan. 6 hearings? That's not quite the best question to ask, writes @dbauder. Instead, it's the slicing and dicing of clips that matter — and what gets shared. Here are some breakout moments. https://t.co/3Fj8ltVUh7","date":"Mon Jun 20 10:30:14 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Questions surround BTS, the most successful K-pop band, and its seven members after last week's surprise announcement that the group was going to spend more time focusing on solo projects. Debate about their military service and activism has emerged. https://t.co/uK9BJR3xQz","date":"Mon Jun 20 09:01:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Floods in South Asia continue to wreak havoc, hindering authorities’ efforts to deliver food and drinking water to shelters across northeastern India and north and northeastern regions of Bangladesh. https://t.co/yfTygLrfj8","date":"Mon Jun 20 08:43:51 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"People worldwide are feeling the pain of high gas prices and choosing to walk more, hop on their bicycle or rethink road trips. \n\nBut those without good public transportation options or who can't forgo their car have little choice but to pay.\n\nhttps://t.co/vY6WucnU3r","date":"Mon Jun 20 06:22:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"How many people are watching the Jan. 6 hearings? That's not quite the best question to ask, writes @dbauder. Instead, it's the slicing and dicing of clips that matter — and what gets shared. Here are some breakout moments. https://t.co/01g1daqMgW","date":"Mon Jun 20 06:15:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Australian Prime Minister Anthony Albanese has rejected calls for him to publicly demand the United States drop its prosecution of WikiLeaks founder and Australian citizen Julian Assange. His government has been under mounting pressure to intervene. https://t.co/jnSQUPYksk","date":"Mon Jun 20 06:07:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Democratic Party's fate is intertwined in a pair of Pennsylvania elections this year: John Fetterman could help the party keep control of the U.S. Senate while Josh Shapiro faces a GOP rival for governor who has embraced various election conspiracies. https://t.co/kxjKlk8ozL","date":"Mon Jun 20 04:34:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An 18-year-old from South Korea has won the 16th Van Cliburn International Piano Competition, one of the top showcases for the world's best pianists. Yunchan Lim' s winnings include a cash award of $100,000 and three years of career management. \nhttps://t.co/NPsvWvGomc","date":"Mon Jun 20 01:06:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Members of the House committee investigating the Capitol riot may not be done seeking testimony. They say they may subpoena former VP Mike Pence and are waiting to hear from Virginia “Ginni” Thomas, wife of Supreme Court Justice Clarence Thomas. https://t.co/nf8fN6FjsL","date":"Mon Jun 20 00:22:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The dinosaurs beat Buzz Lightyear at the box office. #JurassicWorldDominion bit off another $58.7 million in its second weekend, while #Lightyear launched to $51 million. https://t.co/X7KCte0x8N","date":"Sun Jun 19 23:39:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Englishman Matt Fitzpatrick wins the U.S. Open by one stroke, capturing his first major on the same course where he took the U.S. Amateur title nine years earlier. https://t.co/bE3OPxFo3C","date":"Sun Jun 19 23:13:46 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Former rebel Gustavo Petro has narrowly won a runoff election over a political outsider millionaire, ushering in a new era of politics for Colombia by becoming the country's first leftist president.\nhttps://t.co/PrMBgTyLo7","date":"Sun Jun 19 23:02:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP Petro, a senator in his third attempt to win the presidency, has 50.6% of the vote, while former mayor Rodolfo Hernández has 47.2%, with more than 97% of ballots counted, according to results released by election authorities. https://t.co/7u8D7aCLcz","date":"Sun Jun 19 22:21:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Leftist former rebel Gustavo Petro is holding a slim lead over a real estate millionaire in Colombia’s presidential runoff election, and is on the cusp of ushering in a new era of politics in the South American country. https://t.co/dExdjvXYXi","date":"Sun Jun 19 22:21:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP A company could also restructure, to reclassify workers as independent contractors, not employees, thus canceling the union vote, said Michael Duff, former National Labor Relations Board lawyer, now University of Wyoming College of Law professor. https://t.co/axJkDk5m4j","date":"Sun Jun 19 22:13:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP Labor experts say it’s common for employers to drag out the bargaining process in an effort to take the momentum out of union campaigns. https://t.co/kIim1g6flZ","date":"Sun Jun 19 22:11:58 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The historic vote by employees of a Maryland Apple store to unionize — a first for the technology giant — is a significant step in a lengthy process that labor experts say is heavily stacked against workers in favor of their employers. https://t.co/yCE2AcUJwy","date":"Sun Jun 19 22:07:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP One photograph shows a kneeling soldier kissing a child. In another, a couple look toward a swaddled baby. His message came as four months of war appear to be straining troop morale on both sides. https://t.co/xmnq2GmVEK","date":"Sun Jun 19 21:31:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Praising his nation's fighters who \"protect and defend the most precious,\" Ukrainian President Volodymyr Zelenskyy has posted a Father’s Day message with 10 photos of parents and children set against the backdrop of war. https://t.co/IBY2CLosid","date":"Sun Jun 19 21:30:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Title IX debate when it comes to transgender athletes essentially boils down to the interpretation of the word “sex” and whether it includes gender identity. https://t.co/ie5SBCbc1H","date":"Sun Jun 19 19:56:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Read more @AP_Sports coverage of the Title IX anniversary: https://t.co/rz1YKKKZ7s","date":"Sun Jun 19 19:56:35 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A small fraction of the 8.5 million high school and college athletes are transgender. Yet a large number of high school athletic associations have policies in place. https://t.co/5G8rF2ifMd","date":"Sun Jun 19 19:56:34 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In the absence of concrete federal guidance at the high school level, some states are making their own policies, either banning or restricting transgender participation or doing the opposite. https://t.co/5G8rF2ifMd https://t.co/ojkiSKUa4G","date":"Sun Jun 19 19:56:34 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The issue was illustrated most vividly earlier this year when Penn’s Lia Thomas became the first transgender woman to win an individual NCAA swimming championship. https://t.co/ie5SBCbc1H","date":"Sun Jun 19 19:56:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"International sports have also instituted transgender regulations.\n\nOn Sunday, world swimming’s governing body, FINA, effectively banned transgender women from competing in women’s events. https://t.co/LDxXL98b4X","date":"Sun Jun 19 19:56:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"When the gender equity legislation known as Title IX became law in 1972, the politics of transgender sports were not even a blip in the national conversation. Today, the issue is one of the sharpest dividing points in American culture. https://t.co/5G8rF2ifMd","date":"Sun Jun 19 19:56:31 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A year after Juneteenth became a federal holiday, Americans across the country gathered this weekend at events filled with music, food and fireworks. Celebrations also included an emphasis on learning about the past and addressing racial disparities. https://t.co/qyjykn2WWL","date":"Sun Jun 19 19:54:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"El Salvador’s Bitcoin-boosting President Nayib Bukele is asking people to be patient after the price of the cryptocurrency fell below $20,000, less than half what the government paid. “My advice: stop looking at the graph and enjoy life,\" he tweeted. https://t.co/iMW7mRQ0fC","date":"Sun Jun 19 19:53:16 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Recognition of Juneteenth, the effective end of slavery in the U.S., gained traction after the police killing of George Floyd. But after an initial burst of action, the push to have it recognized as an official holiday in the states has largely stalled.\n\nhttps://t.co/DOR3vUlPQE","date":"Sun Jun 19 19:39:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Baby formula plants are usually inspected at least once a year, but @AP found that U.S. regulators did not inspect any of the three biggest in 2020. When they finally got inside a Michigan plant, they found standing water and lax sanitation procedures. https://t.co/bpBoA6y1nM","date":"Sun Jun 19 19:14:27 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"World swimming’s governing body has effectively banned transgender women from competing in women’s events.\n\nFINA members voted 71.5% in favor of a policy that only permits swimmers who transitioned before age 12 to compete in women’s events. https://t.co/2fZ93vZb08","date":"Sun Jun 19 18:58:54 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As U.S. intelligence agencies ramp up their efforts against China, top officials acknowledge they may also end up collecting more phone calls and emails from Chinese Americans, raising new concerns about spying affecting civil liberties.\n\nhttps://t.co/Cv8f9OxOUh","date":"Sun Jun 19 18:51:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Apple store employees in a Baltimore suburb voted to unionize by a nearly 2-to-1 margin on Saturday. The vote marks the latest in a series of labor drives at big companies in recent months, from Starbucks to Amazon to Activision Blizzard. https://t.co/YJ0l9hr6ZA","date":"Sun Jun 19 18:38:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Oscar-winning film director Paul Haggis was detained on Sunday for investigation of allegations that he sexually assaulted a woman in southern Italy, Italian news media said, quoting local prosecutors. Haggis, 69, has been in Italy for a film festival. https://t.co/BdffkZWn4q","date":"Sun Jun 19 18:24:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: French President Emmanuel Macron’s alliance got the most seats in the final round of the parliamentary election on Sunday, but it lost its parliamentary majority, projections show.\n\nThe far-right National Rally is projected to make huge gains. https://t.co/YyAAIWr4fg","date":"Sun Jun 19 18:10:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Washington, D.C., Mayor Muriel Bowser is seeking a third term in office amid spiraling homicide and violent crime rates. Her progressive challengers have accused her of mishandling public safety issues and criticized her push to hire more police officers. https://t.co/Sh1e2l3DOS","date":"Sun Jun 19 18:00:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: Witnesses say more than 200 people, mostly ethnic Amhara, have been killed in an attack in Ethiopia's Oromia region. They blame a rebel group, which denies it. The attack is one of the deadliest in recent memory. https://t.co/gCI4DZnNVY","date":"Sun Jun 19 17:34:19 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A fish that has dwelt in the Colorado River since ancient times, and whose presence indicates a healthy river, now faces a threat from a giant dam above.\n\nOfficials are trying to devise a strategy to keep the humpback chub safe from predators upstream.\n\nhttps://t.co/OBJA2N4YEO","date":"Sun Jun 19 16:46:17 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Treasury Secretary Janet Yellen says she expects the U.S. economy to slow in the months ahead, but that a recession is not inevitable. Yellen expressed optimism even as economists grow worried about a recession fueled by inflation and the war in Ukraine.  https://t.co/pfNuI0GVuB","date":"Sun Jun 19 16:32:45 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"After pandemic-related disruptions, the return of Camino de Santiago pilgrims is helping restore the vitality of Spain’s struggling villages along the famous 500-mile path. https://t.co/fCD2hkvvzB","date":"Sun Jun 19 16:18:47 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"“We cannot let his assassins also kill his vision.”\n\nBritish journalist Dom Phillips’ quest to unlock the secrets of how to preserve Brazil’s Amazon was cut short this month when he was killed along with a colleague in the heart of the forest he cherished. https://t.co/Ww3hglElXQ","date":"Sun Jun 19 16:04:38 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Colombians are choosing between a former rebel and an unpredictable millionaire in a presidential runoff that lacks a clear frontrunner but promises to reshape the country after a first round election that punished the established political class. https://t.co/WQHqXvrLQ3","date":"Sun Jun 19 15:40:59 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Hundreds of mourners gathered in Kyiv on Saturday for the funeral of well-known activist Roman Ratushnyi, 24. Among them were friends who had protested with Ratushnyi during the months of demonstrations that toppled Ukraine’s pro-Russia leader in 2014.  https://t.co/8nlA7k54Vg https://t.co/hJoBqqraSC","date":"Sun Jun 19 15:35:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Juneteenth began with the freed slaves of Galveston, Texas. What is the history of the holiday? Here’s a look into its origins, name and significance.\n\nhttps://t.co/89LbOdHfTv","date":"Sun Jun 19 15:27:12 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Georgia prisoner convicted of killing two guards during an escape from a prison transport bus five years ago has been sentenced to die. A jury agreed unanimously on a death sentence for Ricky Dubose after finding him guilty of charges including murder. https://t.co/ZHDtNPRZvt","date":"Sun Jun 19 15:00:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Inflation is taking a toll on infrastructure projects across the U.S., driving up costs so much that state and local officials are postponing projects, scaling back others and reprioritizing their needs. https://t.co/2Zpjc1odPO","date":"Sun Jun 19 14:48:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Supreme Court seems poised to take on a new elections case being pressed by Republicans.\n\nThe case could increase the power of state lawmakers over races for Congress and the presidency, as well as redistricting, and cut state courts of the equation. https://t.co/f0Uh0cTiy5","date":"Sun Jun 19 14:30:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Haitian influencers are advertising charter flights to South America, but they aren't targeting tourists.\n \nThey're promoting a thriving shadow industry that is profiting from the U.S. sending people back to Haiti, a country besieged by gang violence. https://t.co/t3YNgrdyGc","date":"Sun Jun 19 14:03:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Mayor Muriel Bowser cruised to reelection in Washington, D.C., four years ago without serious opposition. One tumultuous term later, and with homicide and violent crime rates spiraling, Bowser finds herself in a reelection fight. https://t.co/ivDKumKMIY","date":"Sun Jun 19 13:45:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"As the U.S. marks only the second federally recognized Juneteenth, Black Americans living overseas have embraced the holiday as a day of reflection and an opportunity to educate people in their host countries on Black history. https://t.co/NCxj7KG7qL","date":"Sun Jun 19 13:31:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Sara Duterte, the daughter of the outgoing populist president of the Philippines, took her oath as vice president on Sunday following a landslide electoral victory despite her father’s human rights record that saw thousands of drug suspects gunned down. https://t.co/b4zf0wztwP","date":"Sun Jun 19 12:32:52 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Morale is low among troops on both sides of Russia’s war in Ukraine, British defense officials said. The assessment comes as NATO’s chief warned that “nobody knows” how long the war could last.\n\n“We need to be prepared for it to last for years,” he said. https://t.co/eGOjTkIluj","date":"Sun Jun 19 11:54:24 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Over centuries, villages with magnificent artwork were built along the Camino de Santiago, a 500-mile pilgrimage route crossing Spain. Today, travelers are helping restore the livelihood and vitality of these villages and save them from disappearing. https://t.co/XZTFZmaNJI","date":"Sun Jun 19 10:27:50 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"French voters are going to the polls for the final round of key parliamentary elections that will demonstrate how much legroom the electorate is willing to give President Emmanuel Macron’s party to implement his ambitious domestic agenda. https://t.co/EMdO1j6oHR","date":"Sun Jun 19 07:23:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Thailand's bustling, congested capital has a new park, an oasis of green that is part of a drive to bring shade, peace and quiet to a noisy city and make it a more livable place by 2030. Thousands flock to the site, which used to house tobacco factories. https://t.co/Am4GrlvSTA","date":"Sun Jun 19 06:30:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Voters in Colombia will choose between a former rebel and an unpredictable millionaire Sunday when they vote in a presidential runoff that promises to reshape the country after a first round election that punished the political class. https://t.co/NgUwlDlAnV","date":"Sun Jun 19 04:36:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"More than 100 employees of an Apple store in a suburb of Baltimore have voted to unionize by a nearly 2-to-1 margin, joining a growing U.S. push across tech, retail and service industries to organize for greater workplace protections, a union said. https://t.co/gZzwvYN2Sq","date":"Sun Jun 19 02:37:40 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Yellowstone National Park will partially reopen Wednesday morning, several days after catastrophic flooding destroyed bridges and roads and drove out thousands of tourists. A limited number of visitors will be allowed on the park’s southern loop.\nhttps://t.co/HKCy4hDHn4","date":"Sun Jun 19 02:23:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Transportation Secretary Pete Buttigieg says he's pushing airlines to hire more customer-service agents and take other steps to avoid travel woes this summer. Buttigieg wants the airlines to stress-test their schedules amid a spate of flight cancellations. https://t.co/F7Nqu30DRn","date":"Sun Jun 19 00:02:20 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Two people have been killed, and 10 others had to be rescued, when their boats collided at night near Key Biscayne in South Florida, the U.S. Coast Guard and local authorities said. https://t.co/q5n737NtkS","date":"Sat Jun 18 23:36:43 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Bitcoin has fallen below $20,000 for the first time since late 2020, as the cryptocurrency selloff deepens. https://t.co/rqLAAXBtr5","date":"Sat Jun 18 23:01:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The christening of a Navy destroyer highlights the sacrifices of two generations — the ship’s namesake, Gunnery Sgt. John Basilone, killed in World War II, and another Marine who died more than 60 years later in Iraq. https://t.co/Z2PgFckZQM","date":"Sat Jun 18 22:45:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An @AP- @UCBerkeleyIRP @hrcberkeley investigation shows how Haitians have become a lucrative market not only for the illegal, underground enterprises of migrant smugglers—but for legal, registered businesses such as travel agencies and low-budget airlines. https://t.co/s9eli0NYGJ","date":"Sat Jun 18 22:15:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"@AP Scholz said he and his counterparts from France, Italy and Romania had discussed further weapons supplies for Ukraine. The four leaders also backed Ukraine's bid for membership of the European Union. https://t.co/ysH6YdY6lj","date":"Sat Jun 18 21:21:14 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Group of Seven leading democracies will make clear at their upcoming summit that Ukraine can expect to receive the support it needs \"for as long as necessary,\" German Chancellor Olaf Scholz said. https://t.co/B3WcDxXEV7","date":"Sat Jun 18 21:20:15 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Columnist and political commentator Mark Shields, who shared his insight into American politics and wit on “PBS NewsHour” for decades, has died at 85. His \"NewsHour\" tenure spanned six presidencies. https://t.co/97PUU6OEkP","date":"Sat Jun 18 20:15:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Haitian influencers are advertising charter flights to South America, but they aren't targeting tourists.\n \nThey're promoting a thriving shadow industry that is profiting from the U.S. sending people back to Haiti, a country besieged by gang violence. https://t.co/XiKdLyp5wS","date":"Sat Jun 18 20:15:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"In rural New Mexico, frustration over political representation has been building for years as residents have felt marginalized by Democrats who dominate state politics. Anger boiled over this week in a crisis over primary election results, @MLeeAP reports. https://t.co/PM4eT1WYGN","date":"Sat Jun 18 19:45:04 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Presidential disconnect?\n\nJoe Biden’s rosy midterm predictions are getting bolder even as his popularity falls. Though some aides are bracing for losses, other Democrats worry the White House hasn’t fully grasped just how bad this election year could be. \n\nhttps://t.co/ZQ7Fwpcbu4","date":"Sat Jun 18 19:31:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: The U.S. is opening COVID-19 vaccines to infants, toddlers and preschoolers. Shots are set to begin next week.\nhttps://t.co/xvfP53O3R2","date":"Sat Jun 18 19:26:01 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Rising home prices have hurt efforts to move people out of flood zones. Some homeowners say government buyouts don’t pay enough to purchase houses on higher ground. https://t.co/Hkfdeak95s","date":"Sat Jun 18 19:01:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"El Salvador has one of the world’s strictest abortion laws, banning the procedure in all circumstances.\n\nActivists and previously imprisoned women say the country is a cautionary tale for what could happen in the U.S. if Roe v. Wade is overturned. https://t.co/U4RYtPYKVN","date":"Sat Jun 18 18:55:48 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Juneteenth began with the freed slaves of Galveston, Texas. What is the history of the holiday? Here’s a look into its origins, name and significance.\n\nhttps://t.co/MpH28l5rZv","date":"Sat Jun 18 18:43:32 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"An anonymous bidder has shelled out a record $19 million for a lunch with billionaire Warren Buffet at a New York City steakhouse. The meal with the Berkshire Hathaway CEO was offered on an eBay auction to benefit the San-Francisco based charity GLIDE. https://t.co/ImUTGFDj1V","date":"Sat Jun 18 18:31:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Planes arrive empty to Haiti but return to South America full. An @AP - @UCBerkeleyIRP @hrcberkeley investigation reveals how Haitians have become a lucrative market for travel agencies and low-budget airlines. https://t.co/ec9GkdAh44","date":"Sat Jun 18 18:15:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Yellowstone National Park is celebrating its 150th anniversary as it faces its biggest challenge in decades. Floodwaters that tore through the park destroyed potentially hundreds of bridges, washed out roads and drove out more than 10,000 visitors. https://t.co/VWN3hwPAhj","date":"Sat Jun 18 18:01:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: U.S. health advisers have recommended COVID-19 vaccines for infants, toddlers and preschoolers — the last group without the shots. The final signoff was expected later in the day from CDC Director Dr. Rochelle Walensky. https://t.co/w5xUXSM0Wm","date":"Sat Jun 18 17:37:29 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Before disappearing in Brazil’s Amazon rainforest, Bruno Pereira was organizing a 217-mile trail marking the border of the Javari Valley Indigenous territory. The project was the latest by Pereira to help Indigenous people protect their natural resources. https://t.co/4eKaPmJ0p1","date":"Sat Jun 18 17:31:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Drag queen story hours are under attack around the country. The reading programs' organizers say the opposition is scaring children, not protecting them. https://t.co/JyO7Lcbz8q https://t.co/8RkNbhh1JG","date":"Sat Jun 18 16:31:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Instead of convincing Donald Trump's most loyal supporters of his misdeeds, the revelations from the hearings into the Jan. 6 attack on the Capitol are prompting many of them to reassert their views he was correct in falsely asserting a claim to victory. https://t.co/npQsD2NTM0","date":"Sat Jun 18 16:01:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A drunken driver who killed a girl, changed his name in prison and became a therapist is now accused of sexually assaulting a client.\n\nThe case raises questions about life after incarceration and what patients should know about a provider’s past.\n\nhttps://t.co/FeGbsCEq0e","date":"Sat Jun 18 15:44:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"What's next after Russia's war triggered a worsening food crisis? https://t.co/yUBKvFNJ9o","date":"Sat Jun 18 15:31:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"President Biden fell when he tried to get off his bike at the end of a ride at Cape Henlopen State Park near his beach home in Delaware, but said he wasn't hurt. “I'm good,” he told reporters after U.S. Secret Service Agents quickly helped him up.  https://t.co/ZQkSTElM3s","date":"Sat Jun 18 14:46:10 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Retailers and marketers have been quick to commemorate Juneteenth with an avalanche of merchandise from ice cream to T-shirts to party cups. But many are getting backlash on social media for commercialization that critics say undermines the day.\n\nhttps://t.co/yXoftTfyzP","date":"Sat Jun 18 14:45:23 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Tweet re-sent to include link that was left off previous post.","date":"Sat Jun 18 14:35:18 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"White nationalists and supremacists on social media platforms are using coded hashtags and innuendo to rile up thousands of followers on divisive issues that federal officials warn might drive some extremists to violently attack public places in the U.S.\n\nhttps://t.co/vIjuTfxNq6","date":"Sat Jun 18 14:34:47 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Hundreds of mourners gathered in Ukraine's capital for a well-known activist who took up arms against Russia's invasion and was killed. Roman Ratushnyi, 24, had been a teenage protester and was also known as an environmental campaigner in Kyiv. https://t.co/J91lEEMQIu","date":"Sat Jun 18 14:31:03 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"U.S. regulators typically inspect baby formula plants at least once a year. Federal records reviewed by @AP found they didn’t inspect any of the three biggest manufacturers in 2020. https://t.co/7hLHmZfLrV","date":"Sat Jun 18 14:20:22 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Using a body camera, Paievska recorded 256 gigabytes of her team’s efforts over two weeks to save the wounded.\n\nShe transferred the clips to an @AP team, the last international journalists in Mariupol, one of whom fled with it hidden in a tampon. \n\nhttps://t.co/hX6EViphVf","date":"Sat Jun 18 14:01:41 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Presidential disconnect?\n\nJoe Biden’s rosy midterm predictions are getting bolder even as his popularity falls. Though some aides are bracing for losses, other Democrats worry the White House hasn’t fully grasped just how bad this election year could be. \n\nhttps://t.co/6UZCPnBrgn","date":"Sat Jun 18 14:01:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A celebrated Ukrainian medic whose footage was smuggled out of the besieged city of Mariupol by an @AP team has been freed by Russian forces. Yuliia Paievska is better known as Taira, and her release comes three months after she was taken captive. https://t.co/eLdQMosmO7","date":"Sat Jun 18 13:45:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The price of bitcoin has fallen below $20,000 for the first time since late 2020, in a sign that the selloff in cryptocurrencies is deepening. https://t.co/A8GqnoOeJH","date":"Sat Jun 18 13:31:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Rising home prices have hurt efforts to move people out of flood zones. Some homeowners say government buyouts don’t pay enough to purchase houses on higher ground. https://t.co/XykSbIW2YL","date":"Sat Jun 18 13:01:07 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The dogs will get the spotlight when the Westminster Kennel Club show starts Saturday. But the competition is also illuminating the issue of veterinarians’ mental health. The club is giving $10,000 to a charity focused on veterinary professionals’ welfare. https://t.co/ynPXecidHh","date":"Sat Jun 18 12:31:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Philadelphia fire officials say one firefighter has died following a building collapse early Saturday. Four other firefighters and a city inspector were rescued from the rubble and are in stable condition at hospitals. https://t.co/Tq1ckJjCnf","date":"Sat Jun 18 12:19:09 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Legend has it, a slave was promised his freedom if the tide receded enough for him to walk out to a rocky ledge off a beach.\n\nNow Robert Mingo's life — and the tale it inspired — is the focus of efforts to recognize the role of slavery in New England.\n\nhttps://t.co/f0CgtTYc3p","date":"Sat Jun 18 11:55:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Philadelphia Fire Department said “several” firefighters and a city inspector became trapped when a building collapsed during a fire response, with more than one person still under the rubble hours later. https://t.co/6ghKbVHyI2","date":"Sat Jun 18 11:45:08 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"At least six GOP presidential prospects are planning to visit Iowa this summer, forays advertised as promoting candidates and the state Republican organization. In reality, the trips are about building relationships and learning the political geography. https://t.co/PMd5sBejlI","date":"Sat Jun 18 11:31:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A Taliban-appointed official says explosions and gunfire have ripped through a Sikh temple in Afghanistan’s capital, killing one person and wounding seven others. https://t.co/9JouAYyUO1","date":"Sat Jun 18 10:41:02 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Millions of people in African, Middle Eastern and Asian countries face the threat of hunger as Ukrainian grain isn't able to escape Black Sea ports. https://t.co/d0ldiUWTEG","date":"Sat Jun 18 10:30:05 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The Israeli military says Palestinian militants have fired a rocket into southern Israel, shattering a two-month lull in violence at the Gaza-Israel border. That's in contrast to soaring tensions in the occupied West Bank. https://t.co/oChDXI5nx3","date":"Sat Jun 18 10:10:14 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Russia's blockade of Ukrainian ports has worsened a global food crisis. Prices are rising, critical supplies of grain aren't getting to developing nations and there's little sign of a breakthrough so far. @AP explains how it happened. https://t.co/XtwYpsAihU","date":"Sat Jun 18 07:22:37 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Legend has it, a slave was promised his freedom if the tide receded enough for him to walk out to a rocky ledge off a beach. https://t.co/nacf7x0i0O","date":"Sat Jun 18 06:54:57 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"At least 18 people have died as floods cut a swatch across northeastern India and Bangladesh, leaving millions of homes underwater. Both countries have asked the military to help with the severe flooding. https://t.co/SlojAp6P5i","date":"Sat Jun 18 06:16:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Dogs get the spotlight at the Westminster Kennel Club show. But this year, the storied canine competition is also illuminating the human issue of veterinarians’ mental health. https://t.co/DZArdDWClF","date":"Sat Jun 18 05:54:42 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"A federal appeals court has rejected a Trump administration finding that the active ingredient in the weed killer Roundup does not pose a serious health risk and is “not likely” to cause cancer in humans. https://t.co/QxscuxKNR6","date":"Sat Jun 18 03:33:28 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"The largest river in northern Italy is starting to dry up, as the region grapples with the worst drought the country has seen in 70 years. https://t.co/Hq5I1ET1GC https://t.co/U2fq4AzLzc","date":"Sat Jun 18 02:34:00 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"BREAKING: U.S. Capitol Police said officers have arrested seven unauthorized people affiliated with CBS' “Late Show with Stephen Colbert\" in a congressional office building and charged them with unlawful entry, a person familiar with the matter told @AP. https://t.co/MKWS0GNsEK","date":"Sat Jun 18 01:58:33 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"After two days of deliberations, jurors in a civil trial deciding on sexual abuse allegations against Bill Cosby will have to start from scratch on Monday due to several unusual circumstances. https://t.co/Yokfm09Phq","date":"Sat Jun 18 01:48:01 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Federal regulators say Verizon and AT&amp;T will delay part of their 5G rollout near airports to give airlines more time to ensure that equipment on their planes is safe from interference from the wireless signals. The airline industry calls the deal \"rushed.\" https://t.co/gcmrzR3BIN","date":"Sat Jun 18 01:28:06 +0000 2022","user_id":"51241574"},{"handle":"AP","text":"Officials in Odessa, Texas, say residents who have been without safe tap water this week amid scorching temperatures may be able to drink safely from the faucet as early as Saturday afternoon. https://t.co/vw7CpuXYMe","date":"Sat Jun 18 00:45:08 +0000 2022","user_id":"51241574"}]