[{"handle":"BreitbartNews","text":"While the vast majority of Europeans support sanctions against Russia over the invasion of Ukraine, less than half support the sanctions if they directly lead to a rise in prices, which present experience suggests they are. https://t.co/GDVi6WPG6g","date":"Sat Jun 25 22:38:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A study of Jewish populations in twelve European countries found that Jews living in France were the most fearful for their own safety. https://t.co/NggcQWnai2","date":"Sat Jun 25 22:20:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Keith Olbermann responded to the Supreme Court’s pro-Second Amendment ruling Thursday by calling for the high court to be dissolved. https://t.co/vX7s72u4WA","date":"Sat Jun 25 21:58:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Fifty-eight percent of voters say Biden should take a cognitive health test and reveal the results to the American public, a McLaughlin &amp; Associates poll released Friday showed. https://t.co/egJA4vJa8n","date":"Sat Jun 25 21:38:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Brave Search, the private, independent search engine competing with giants such as Google, has announced on its first anniversary that 2.5 billion queries have now been completed by the search engine. https://t.co/ecL0gxyiwi","date":"Sat Jun 25 21:18:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A group of pro-abortion protesters was filmed chanting, \"Fu*k Joe Biden\" and \"F*ck Glenn Youngkin,\" in Richmond on Friday. https://t.co/6sUFSN6XQZ","date":"Sat Jun 25 20:59:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An entity linked to billionaire Bill Gates has reportedly purchased 2,100 acres of potato farmland in northern North Dakota angering local residents. The state is investigating the purchase of potato farmland by the Gates-linked trust. https://t.co/v3IuDSGD8h","date":"Sat Jun 25 20:40:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Catholic Bishops of New York said Friday that the Dobbs ruling “will save countless innocent children simply waiting to be born.” https://t.co/8zQcD4PtSm","date":"Sat Jun 25 20:21:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"\"What happened the next day was a total bloodbath.” https://t.co/zV5b59A5Z3","date":"Sat Jun 25 20:02:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trump leads Biden in a potential 2024 matchup, according to a McLaughlin &amp; Associates poll. https://t.co/AfP3urwoSv","date":"Sat Jun 25 19:43:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A five-month-old girl was shot in the head and killed Friday afternoon in Mayor Lori Lightfoot’s (D) Chicago.  https://t.co/AVFhxQxO5i","date":"Sat Jun 25 19:24:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Even as the U.S. Supreme Court was preparing to hand down its historic Dobbs decision on abortion law, Brazil was wrestling with a controversy revolving around an 11-year-old girl who was raped by a 13-year-old boy and sought an abortion.\n\nhttps://t.co/rXkfnIQTbT","date":"Sat Jun 25 19:04:20 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An adored Massachusetts grocery store employee, who spent the better part of three decades working for Market Basket, retired Tuesday following a big send-off from coworkers. https://t.co/xRl5c7kxvm","date":"Sat Jun 25 18:45:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recent study on children’s screen time has revealed that during the coronavirus pandemic, screen time among children increased by 83 minutes per day on average. https://t.co/1Yy7sf8ANE","date":"Sat Jun 25 18:26:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The copper industry is vital to electric vehicle manufacture and thus a staple of a “green economy” promoted by leftist and communist governments including that of China. https://t.co/ZxO01TDe8M","date":"Sat Jun 25 18:06:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Fact Check: Total clown https://t.co/8jn3hrtTBP","date":"Sat Jun 25 17:46:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"As China Joe kills energy independence here in America, over in China, Chinese Premier Li Keqiang \"urged\" energy officials to ramp up coal production this week to stave off blackouts. https://t.co/tvX19MlnGz","date":"Sat Jun 25 17:27:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Georgia Gwinnett College in Lawrenceville, Georgia, will pay $800,000 to settle a free speech lawsuit filed by a Christian student it had censored, according to Alliance Defending Freedom. https://t.co/3HwwFzzVeq","date":"Sat Jun 25 17:08:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Elizabeth Frawley Bagley, the Biden administration’s nominee to serve as U.S. Ambassador to Brazil, is facing accusations of antisemitism from both sides of the aisle after a 1998 interview surfaced in which she referred to the “Jewish lobby.” https://t.co/5C5d4khENM","date":"Sat Jun 25 16:49:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"***Second Amendment Alert*** https://t.co/uAB8JBXlXR","date":"Sat Jun 25 16:27:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"WHEELS COME OFF: The views of the economy of American households turned even grimmer as spring turned to summer. https://t.co/ORbDysDfGM","date":"Sat Jun 25 16:06:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The $51 billion hedge fund Citadel is joining the exodus to Miami. https://t.co/fT25GWFQyE","date":"Sat Jun 25 15:46:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nigerian Senator Ike Ekweremadu and his wife Beatrice Nwanneka Ekweremadu were arrested in London and charged with planning to bring a 15-year-old boy into the United Kingdom so they could harvest his organs. https://t.co/s8WuIpPyOb","date":"Sat Jun 25 15:25:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep Jim Jordan blistered NFL Commissioner Roger Goodell for the league allowing the Washington Commanders to fine coach Jack Del Rio $100,000. https://t.co/TMWg9ehiML","date":"Sat Jun 25 15:06:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Leftist professors are having social media temper tantrums over the Supreme Court returning abortion to the states. https://t.co/rnS8aHq22k","date":"Sat Jun 25 14:47:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Woke rich sports Elites are using their platforms to push the Democrat Party's extreme-Left radical abortion agenda. https://t.co/2UK9PNgZvd","date":"Sat Jun 25 14:27:09 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Woke Wall Street banks are rushing to bankroll the destruction of innocent babies with beating hearts to ensure there's no slowing in the systematic destruction of innocent human life. https://t.co/Ac6JJ3Absd","date":"Sat Jun 25 14:06:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rich Democrat Party activist Sheryl Crow is distraught that fewer innocent babies with beating hearts can be easily destroyed. https://t.co/5gTGXg4tyd","date":"Sat Jun 25 13:47:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Pro-abortion protesters took to the streets of Los Angeles, California, on Friday — and held up traffic on the highway — to express their support for the systematic killing of unborn children. https://t.co/65iXEOWDdX","date":"Sat Jun 25 13:26:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sen. Josh Hawley (R-MO) predicts that SCOTUS’s Dobbs ruling marks the end of the alliance between social conservatives and corporatists. https://t.co/Nzgq8JsfXF","date":"Sat Jun 25 13:05:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Two of the primary providers in Texas ceased performing abortions on Friday after the Attorney General warned they could be prosecuted immediately. https://t.co/AG5WmhzIPZ","date":"Sat Jun 25 12:43:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trump took a victory lap on Friday after the Supreme Court overturned Roe v. Wade. https://t.co/Ax1KVhqq1m","date":"Sat Jun 25 12:23:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recent poll shows that Republican state Sen. Tom Barrett could unseat incumbent Democrat Rep. Elissa Slotkin (MI) in the November election for Michigan’s Seventh Congressional District. https://t.co/vHkS7F3bFn","date":"Sat Jun 25 12:02:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Texas Attorney General Ken Paxton announced an annual holiday in the wake of the Supreme Court’s decision to overturn Roe v. Wade on Friday. https://t.co/Jq7EDpip52","date":"Sat Jun 25 11:42:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An establishment media effort last month, derided as attempting to gin up political backlash over the United States Supreme Court’s (SCOTUS) overruling Roe v. Wade, failed to intimidate conservative justices.  https://t.co/aOIswBk3EL","date":"Sat Jun 25 11:22:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Liz Cheney (R-WY) and thirteen other House Republicans crossed the aisle and voted with Democrats to pass gun control by 234-193 on Friday. https://t.co/3pmQhC45N3","date":"Sat Jun 25 11:02:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The United States Catholic bishops have registered their “joy” over the Supreme Court’s overturning of the ignominious 1973 Roe v. Wade decision that imposed legal abortion on 50 states. https://t.co/ivHDl0kZws","date":"Sat Jun 25 03:58:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Major General Hossein Salami, commander of Iran’s Islamic Revolution Guard Corps (IRGC), replaced his intelligence chief Friday. https://t.co/JCkKPde6jT","date":"Sat Jun 25 03:36:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Catholic Bishops of New York issued a statement Friday on the Supreme Court’s Dobbs decision, declaring that the historic ruling “will save countless innocent children simply waiting to be born.” https://t.co/kAIbfns0yG","date":"Sat Jun 25 03:14:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rhode Island Gov. Dan McKee (D) signed legislation this week banning ammunition magazines that hold more than ten rounds and giving current owners of said magazines six months to surrender them. https://t.co/dOWtGBPkCY","date":"Sat Jun 25 02:54:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Mexican police clashed with gunmen in a deadly shootout where 12 criminals and officers died responding to a kidnapping call. Authorities managed to rescue two handcuffed victims. https://t.co/ucHoES7dyt","date":"Sat Jun 25 02:33:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Only 11 percent of likely voters blame Putin for rising gas prices, a Rasmussen Reports survey found. https://t.co/h5R0CxT6fh","date":"Sat Jun 25 02:12:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Missouri became the first state on Friday to effectively end abortion once the Supreme Court overturned Roe vs. Wade. https://t.co/DbrgCOlDem","date":"Sat Jun 25 01:51:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Far-left Rep. Rashida Tlaib (D-MI) on Friday told activists that she would see them “in the streets” in response to the Supreme Court’s 5-4 ruling overturning Roe v. Wade. https://t.co/sC6hDpiHcY","date":"Sat Jun 25 01:31:12 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Mexico’s Army sent 200 soldiers to the border city of Matamoros this week, an area with a history of being controlled by the Gulf Cartel. https://t.co/E3UDbJNr1S","date":"Sat Jun 25 01:11:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"“You Stood Up for the Truth” Pro-Lifer Thanks Justices for Overturning Roe https://t.co/jz3kkkSvOt","date":"Sat Jun 25 00:49:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Pro-life Americans celebrated the Supreme Court’s decision Friday overruling Roe v. Wade and returning the regulation of abortion “to the people and their elected representatives.” https://t.co/mehnyRrzFA","date":"Sat Jun 25 00:27:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s Department of Justice on Friday vowed to use “every tool at our disposal” to fight for abortion, Attorney General Merrick Garland announced. https://t.co/bOBT5STv91","date":"Sat Jun 25 00:08:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Wall Street has adopted policies to fund travel for abortions for employees that work in states that impose restrictions in anticipation of or following the Supreme Court’s declaration that the constitution is neutral on the subject. https://t.co/gtUw6KS7yf","date":"Fri Jun 24 23:46:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Which Amendment Is That, Joe? Biden Says Court Took Away \"A Constitutional Right\" https://t.co/B8ddegVVf6","date":"Fri Jun 24 23:25:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Co-Sponsor of Law That Led to Roe’s End: “I Can’t Put Into Words What I’m Feeling Right Now” https://t.co/SvFQisCqTj","date":"Fri Jun 24 23:04:20 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Preserving women’s sports is a big draw for Gen Z voters, Rep. Kat Cammack (R-FL) said Thursday during a roundtable on transgender athletes. https://t.co/QbwI8vTNaN","date":"Fri Jun 24 22:40:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"America First candidate Michael Cassidy has caught his primary opponent Rep. Michael Guest’s campaign trying to coordinate with Democrats. https://t.co/q5NLZfQcoq","date":"Fri Jun 24 22:18:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Then-candidate Donald Trump predicted in a 2016 presidential debate with Hillary Clinton that Roe v. Wade would be overturned “automatically” if he were elected. https://t.co/7G0Woev3p8","date":"Fri Jun 24 21:57:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Crowd Prays in Gratitude Outside Supreme Court After Roe v. Wade Overturned https://t.co/iPogzmz4WM","date":"Fri Jun 24 21:36:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Gov. Ron DeSantis is unafraid and standing strong on protecting Second Amendment rights. https://t.co/Lq3DIGsoGR","date":"Fri Jun 24 21:13:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Democrats are again advancing a plan that would give Capitol Hill jobs to illegal aliens enrolled in former President Obama's DACA program. https://t.co/lPWSfX6bZ0","date":"Fri Jun 24 20:52:12 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"WHEELS COME OFF: The views of the economy of American households turned even grimmer as spring turned to summer. https://t.co/aLmpUssw2U","date":"Fri Jun 24 20:32:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The NeverTrumpers said Donald Trump wouldn't produce massive conservative victories via his Supreme Court picks. But even Nancy Pelosi recognizes the incredible conservative wins former President Donald Trump is responsible for generating. https://t.co/UlawZmCYcM","date":"Fri Jun 24 20:11:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"MAD MAX UNHINGED: “The hell with the Supreme Court, we will defy them.” https://t.co/6c6rWtuwR9","date":"Fri Jun 24 19:50:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Saving the lives of innocent minority babies with beating hearts is \"racist\" and \"bigoted.\" #DemocratLogic https://t.co/wYwUZdEg0c","date":"Fri Jun 24 19:30:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"ROFL! You really have to hand it to the rich Establishment Media Elites for keeping a straight face and not busting out laughing when spewing their fawning, breathless J6 clown show talking points. https://t.co/J13r4pU3XY","date":"Fri Jun 24 19:11:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rich millionaire Democrat Party activist Rosanna Arquette has declared the \"death of America\" due to the SCOTUS decision to make it slightly less convenient to destroy innocent babies with beating hearts. https://t.co/IUQXz2PjPx","date":"Fri Jun 24 18:50:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Supreme Court overruled Roe v. Wade on Friday, holding in the Dobbs case that the Constitution does not include a right to abortion and returning the issue of abortion laws and regulations to state legislatures.\n\nhttps://t.co/zWjcPSVa7j","date":"Fri Jun 24 18:28:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Friday’s decision by the U.S. Supreme Court to overturn Roe v. Wade will make abortions illegal in Texas in 30 days. https://t.co/petpGJ7h4S","date":"Fri Jun 24 18:08:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Ted Budd (R-NC) leads his Democrat opponent by nearly five points in North Carolina’s general election race for U.S. Senate, per a poll. https://t.co/IxKwA62nCh","date":"Fri Jun 24 17:49:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Republicans, led by Rep. Mike Johnson (R-LA), on Wednesday called for Defense Secretary Lloyd Austin to be fired if he does not repeal the Biden administration’s coronavirus vaccine mandate for troops. https://t.co/v2CIuvO9xr","date":"Fri Jun 24 17:30:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"More voters are worried about the state of the economy rather than the potential for the Supreme Court to overturn Roe v. Wade. https://t.co/Zst8TjG9ul","date":"Fri Jun 24 17:09:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Hollywood celebrities are freaking out over the Supreme Court’s 6-3 decision on New York’s proper cause requirement for concealed carry permits, ruling that the state’s law is unconstitutional. https://t.co/Smb2z72YSK","date":"Fri Jun 24 16:50:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden is drawing intense criticism from conservatives over his calls to Congress for a months-long gas tax holiday. https://t.co/HkmrGURJds","date":"Fri Jun 24 16:31:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An open-source wargame to gauge “how climate change could affect a future conflict” has been scheduled for the U.S. Navy in a continuation of Biden’s executive order on sustainability. https://t.co/HwKVCw6qB2","date":"Fri Jun 24 16:12:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Fifteen Republican Senators caved Thursday night and voted “yes” on the gun control package Sen. John Cornyn (R-TX) worked with Democrats to create.  https://t.co/WNVDvOyEbp","date":"Fri Jun 24 15:53:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"California parents of children who believe they are the opposite sex are sounding the alarm on the state’s radical curriculum. https://t.co/kwzGS2kwE0","date":"Fri Jun 24 15:35:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"One of the top donors for Senate Minority Leader Mitch McConnell (R-KY) has invested big money in stopping Eric Greitens. https://t.co/ife0fUeA11","date":"Fri Jun 24 15:15:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Despite the fact it is currently wrestling with a crippling energy crisis, the EU has passed legislation putting further curbs on carbon emissions. https://t.co/tc3DuqKfT9","date":"Fri Jun 24 14:56:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Yulin Lychee and Dog Meat Festival in China began this week, a celebration that typically involved the butchering of thousands of dogs. https://t.co/BmFkgCGoJW","date":"Fri Jun 24 14:37:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"CNN got WRECKED by Republican Arizona Governor candidate Kari Lake. https://t.co/m46KqBMwHf","date":"Fri Jun 24 14:16:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"You know it's bad when... https://t.co/Avm7K8nNen","date":"Fri Jun 24 13:58:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A non-partisan ethics watchdog organization demanded an investigation by the Office of Government Ethics (OGE) into Senior White House Advisor Anita Dunn for allegedly failing to file the required public personal financial disclosure. https://t.co/uZ4g6QsID5","date":"Fri Jun 24 13:37:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A feminist group sued California for allowing prisoners to be incarcerated according to their gender identity, which puts women in danger. https://t.co/KvZ8SKNpan","date":"Fri Jun 24 13:19:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Democrats are again advancing a plan that would give Capitol Hill jobs to illegal aliens enrolled in former President Obama’s Deferred Action for Childhood Arrivals (DACA) program.  https://t.co/VVTKPuZNzT","date":"Fri Jun 24 12:59:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Napa County District Attorney has charged Nancy Pelosi's husband, Paul Pelosi, with two misdemeanors for driving under the influence of alcohol. https://t.co/OkK98RDIEX","date":"Fri Jun 24 12:38:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A photo of Joe Biden's note card is going viral as it reveals a new level of detailed instructions provided to the leader of the free world. https://t.co/9SABXqEoup","date":"Fri Jun 24 12:17:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Keith Olbermann responded to the Supreme Court’s pro-Second Amendment ruling Thursday by calling for the high court to be dissolved.\n\nhttps://t.co/Zf5rDe0qP5","date":"Fri Jun 24 11:00:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nike has decided to fully exit Russia three months after suspending operations in the country due to its invasion of Ukraine, the sportswear giant announced Thursday. https://t.co/zSAvb7weKr","date":"Fri Jun 24 03:47:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Pope Francis rejected ongoing rumors of his pending resignation from the Catholic papacy while acknowledging his health struggles. https://t.co/BWGn1ANB5e","date":"Fri Jun 24 03:25:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Wow https://t.co/ldLyKVbRuc","date":"Fri Jun 24 03:03:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The prime minister of Sri Lanka, Ranil Wickremesinghe, declared in remarks to the nation’s parliament on Wednesday that its economy had “completely collapsed.” https://t.co/bLyes60j8O","date":"Fri Jun 24 02:41:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A man carrying a “bladed object” entered a Carter’s Country gun store and began stealing money from the cash register. An armed employee shot the robber who later died from the wounds.\n\n https://t.co/KRTG7KcfMm","date":"Fri Jun 24 02:20:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Lee Zeldin (R-NY) holds a commanding lead in the New York Republican primary race for governor, a recent McLaughlin &amp; Associates survey found. https://t.co/IccWmZNBc1","date":"Fri Jun 24 02:00:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Mexican police clashed with gunmen in a deadly shootout where 12 criminals and officers died responding to a kidnapping call. Authorities managed to rescue two handcuffed victims. https://t.co/C2iQR2BMDl","date":"Fri Jun 24 01:40:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sens. Marco Rubio (R-FL) and Rob Portman (R-OH) are blasting President Joe Biden for a move that they say will further increase the United States’ dependence on China for solar panels. https://t.co/haFbbUzIjG","date":"Fri Jun 24 01:18:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Tucson Sector Border Patrol agents arrested an armed human smuggler following a vehicle stop near the Mexican border. The smuggler now faces federal charges related to the alleged smuggling of six migrants. https://t.co/1At4pRyCvO","date":"Fri Jun 24 00:58:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Germany has moved one step closer to rationing gas after the country triggered its second bout of emergency powers over the ongoing crisis. https://t.co/dukZwhQ5LR","date":"Fri Jun 24 00:37:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The economy is on a path to contracting in the third quarter, according to the chief business economist at SP Global Market Intelligence. https://t.co/K6PxXlmufR","date":"Fri Jun 24 00:16:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Gas prices have emerged as the top midterm issue, barely edging out inflation, data from Rasmussen Reports found.  https://t.co/adJTPAdrAv","date":"Thu Jun 23 23:54:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ninety-seven percent of Americans believe Biden’s 40-year-high inflation is either a crisis or a problem, a Wednesday Quinnipiac poll revealed. https://t.co/Pu406ZAVh9","date":"Thu Jun 23 23:35:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Publix pharmacies will not offer coronavirus vaccine shots to children younger than five even though U.S. health authorities now approve the procedure. https://t.co/pmj5ABsLun","date":"Thu Jun 23 23:15:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Border surveillance camera operators in Arizona captured video showing a group of migrants illegally crossing the border. The migrants then pile into a vehicle and drive away. https://t.co/D8yiSSbAY0","date":"Thu Jun 23 22:56:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sen. Tom Carper (D-DE) labeled President Joe Biden’s calls for a three-month-long suspension of federal gas and diesel taxes “shortsighted and inefficient.” https://t.co/ErpBlQgxFl","date":"Thu Jun 23 22:38:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Mexican border state prosecutor faces drug trafficking charges after U.S. authorities reportedly found more than 66 pounds of meth in his vehicle when he tried to drive into California. https://t.co/LuowscsRpo","date":"Thu Jun 23 22:20:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: You've heard of \"voodoo economics\"? @AlexMarlow explains why Biden's moved beyond that to Doo Doo Economics. Plus: @tdwilliamsrome on rumors of Pope Francis retiring and Trent Talbert of @BraveBooksUS on producing pro-family children's books: https://t.co/D9mVCKroA1 https://t.co/CH95oSYQ7S","date":"Thu Jun 23 21:58:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"PG&amp;E has put in place a controversial plan to limit wildfires by using computerization to shut power down after threats. https://t.co/YivQu6DSIk","date":"Thu Jun 23 21:42:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A non-partisan ethics watchdog organization demanded an investigation by the Office of Government Ethics (OGE) into Senior White House Advisor Anita Dunn for allegedly failing to file the required public personal financial disclosure. https://t.co/pE98TCxDBO","date":"Thu Jun 23 21:23:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Liz Cheney (R-WY) has sent direct mailers to Wyoming Democrats, requesting they change parties to be eligible to vote in the August Republican primary.  https://t.co/dpYgl2abPP","date":"Thu Jun 23 21:04:51 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Florida’s first lady Casey DeSantis this week launched an initiative, Mamas for DeSantis, to mobilize one million moms in support of her husband Gov. Ron DeSantis (R), calling for a “slam dunk” victory  months ahead of the governor’s reelection battle. https://t.co/MRXUMs0Y0k","date":"Thu Jun 23 20:46:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"In the majority opinion for Supreme Court's 6-3 ruling in NYSRPA v. Bruen, Justice Clarence Thomas wrote the Second Amendment protects an “individual’s right to carry a handgun for self-defense outside the home.” https://t.co/GFb00LNjRQ","date":"Thu Jun 23 20:27:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Members of Macron’s party have signalled a willingness to work with Marine Le Pen in the French parliament to pass legislation.  https://t.co/GYvxVoNiZK","date":"Thu Jun 23 20:05:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Georgia Gwinnett College in Lawrenceville, Georgia, will pay $800,000 to settle a free speech lawsuit filed by a Christian student it had censored, according to Alliance Defending Freedom. https://t.co/qUtVTFxsfR","date":"Thu Jun 23 19:43:55 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Elizabeth Frawley Bagley, the Biden administration’s nominee to serve as U.S. Ambassador to Brazil, is facing accusations of antisemitism from both sides of the aisle after a 1998 interview surfaced in which she referred to the “Jewish lobby.” https://t.co/JkOIJ24ufG","date":"Thu Jun 23 19:22:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Disney employees are reportedly in a state of confusion over the company’s plan to move 2,000 workers to Florida from California, and they are blaming CEO Bob Chapek for the “chaos.” https://t.co/xALwSKKiFl","date":"Thu Jun 23 19:00:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"House Democrats are not convinced Biden’s gas tax holiday is the correct method to reduce pain at the pump for consumers. https://t.co/27NkroR9YS","date":"Thu Jun 23 18:39:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A radio ad airing in Wyoming is slamming Rep. Liz Cheney (R-WY) as out of touch with her constituents.  https://t.co/obOxa2t0TV","date":"Thu Jun 23 18:18:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former President Donald Trump referred to Sen. John Cornyn (R-TX) as a RINO on Wednesday and warned he is helping “radical left Democrats” implement gun control. https://t.co/2T27lCqWI1","date":"Thu Jun 23 17:58:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Watch: Cali Firefighters Battle Tesla Blaze with 4,500 Gallons of Water https://t.co/4SxYsRYp8B","date":"Thu Jun 23 17:37:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"House Minority Leader Kevin McCarthy (R-CA) is rebuking Senate talks of an amnesty for illegal aliens, calling it “a nonstarter” that a future House Republican majority “will fight.” https://t.co/Vn1xzfrcol","date":"Thu Jun 23 17:17:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Supreme Court ruled 6-3 that New York’s proper cause requirement for concealed carry permit issuance is unconstitutional. https://t.co/BeUqEEuT1i","date":"Thu Jun 23 16:59:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Alisa Blair, Special Advisor to L.A. District Attorney George Gascón, reportedly pushed for a double murderer to be tried as a juvenile, leading to his early release, whereupon he was arrested in connection with a new killing. https://t.co/Ee2jljGhWf","date":"Thu Jun 23 16:39:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The devil's in the details. https://t.co/4zcEXCbPxA","date":"Thu Jun 23 16:21:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The reaction on social media has been swift and the mocking unrelenting. https://t.co/M0IBMtFIrJ","date":"Thu Jun 23 16:02:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An American artistic swimmer was rescued by her quick-reacting coach after feinting in the water during the FINA World Aquatic Championships in Budapest, Hungary. https://t.co/Ppumi8gSEZ","date":"Thu Jun 23 15:44:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Joe Biden hoped we forgot. We did not. https://t.co/8yPh8Zh0c0","date":"Thu Jun 23 15:23:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Extreme-Left Google's parent company Alphabet is spending billions to become a major player in the healthcare market. Here's what they have planned for your health. https://t.co/nvjXDt3AHv","date":"Thu Jun 23 15:03:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Our extreme-Left Facebook Overlord, Mark Zuckerberg, is obsessed with foisting his lame \"metaverse\" on us. And yet, as usual, research shows that the Big Tech billionaire's schemes are bad for human health. https://t.co/pugf0jrKN9","date":"Thu Jun 23 14:43:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden keeps slamming the U.S. fossil fuel industry for allegedly not expanding refining capability as he continues to hobble producers. https://t.co/tmxQ6Ghic9","date":"Thu Jun 23 14:24:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Virginia State Sen. Jen Kiggans (R) defeated her Republican primary opponents in the four-person race for the GOP nomination in Virginia’s 2nd district. https://t.co/fVJKkfXKaA","date":"Thu Jun 23 14:05:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sen. Amy Klobuchar (D-MN) argued that the Senate gun legislation “paves the way in the future to look at” other gun control provisions. https://t.co/RV3flJoW11","date":"Thu Jun 23 13:46:09 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Kelly Tshibaka, a Republican candidate for Senate in Alaska, blasted Lisa Murkowski over her vote in favor of the gun control bill. https://t.co/yELo7pK9rv","date":"Thu Jun 23 13:27:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Disgraced actor Jussie Smollett is still claiming that he was assaulted for being black and gay back in 2019, denying that he staged the assault despite a jury convicting him for his role in the hate crime hoax. https://t.co/zjX5EndNaj","date":"Thu Jun 23 13:08:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The man who allegedly planned the assassination attempt on Supreme Court Justice Brett Kavanaugh over Roe v. Wade has pleaded not guilty. https://t.co/2MZ8xE1g3v","date":"Thu Jun 23 12:47:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Only 11 percent of likely voters blame Putin for rising gas prices, a Rasmussen Reports survey found. https://t.co/wydQUUkfL6","date":"Thu Jun 23 12:28:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cartel gunmen murdered two Jesuit priests who tried to protect another man from being killed in the Mexican border state of Chihuahua. The gunmen then stole the priests’ bodies. https://t.co/2QzDlWNbbU","date":"Thu Jun 23 02:30:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Federal Reserve Chairman Jerome Powell conceded on Wednesday that the Federal Reserve’s battle to bring down inflation could trigger a recession. https://t.co/5nUqiiZKrD","date":"Thu Jun 23 02:09:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Russia threatened action after Lithuania began to block sanctioned goods from travelling into the exclave of Kaliningrad. https://t.co/BgNwfYgXfk","date":"Thu Jun 23 01:47:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Disgraced and failed gubernatorial candidate Andrew Gillum was indicted and arrested for conspiracy, wire fraud, and making false statements, the Justice Department announced Wednesday.  https://t.co/3zHKxvaKvV","date":"Thu Jun 23 01:25:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Germany’s Finance Minister has called for the country to keep using nuclear power to ease the ongoing energy crisis, despite one energy tsar in the country labelling it “backwards.” https://t.co/NS93Fu8IyA","date":"Thu Jun 23 01:04:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Federal Reserve Chairman Jerome Powell said Wednesday that Russia’s invasion of Ukraine is not the primary driver of inflation. https://t.co/jVEIm3ynCM","date":"Thu Jun 23 00:43:09 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ooops! https://t.co/Aotqzo1q8c","date":"Thu Jun 23 00:21:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"What? https://t.co/JeOFPigMFD","date":"Wed Jun 22 23:59:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A generous anonymous family is covering the tuition bill for Texas Christian University’s (TCU) 2024 class of medical students in Fort Worth this upcoming school year. https://t.co/w7Rv487zvX","date":"Wed Jun 22 23:41:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"After weeks of hemorrhaging top players to the Saudi-backed LIV Golf league, the PGA Tour has now offered up an eight-event series. https://t.co/CWZVDjJcqz","date":"Wed Jun 22 23:19:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Beware Evildoers! Columbus Police Dept. Unveils ✨🌈 Pride Cruiser 💖🏳️‍🌈 https://t.co/SP3BM2hyV7","date":"Wed Jun 22 23:00:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: @AlexMarlow on the GOP's surrender to easily exploitable \"red flag\" gun control, the implosion of woke Kellogg's, and Garland/Zoolander in Ukraine. @kenklukowski explains a big 1st Amendment win at the Supreme Court: https://t.co/InStBeIeh1 https://t.co/D6hLsfIodX","date":"Wed Jun 22 22:51:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"After facing swift and intense backlash from conservatives and Republican lawmakers, Sen. John Cornyn (R-TX) claimed that he was joking about striking a deal on amnesty after negotiating a deal on gun control. https://t.co/CsxNUX3SKK","date":"Wed Jun 22 22:38:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"So out of touch! https://t.co/KJfeoEWQad","date":"Wed Jun 22 22:19:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A group of East Texas contractors came together to help an Iraq War veteran and his family construct their home after the family says a builder took hundreds of thousands of dollars from them but never completed the project. https://t.co/ZsyWbdJps4","date":"Wed Jun 22 21:57:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A U.S. Army veteran and his family received a brand new, fully-furnished home in Tennessee courtesy of the PulteGroup’s Built to Honor Program. https://t.co/P4NMBuXYUH","date":"Wed Jun 22 21:39:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden is working hard to replace all of the immigration judges Trump put in place during his tenure and has fired almost a dozen. https://t.co/ny5B0GynIK","date":"Wed Jun 22 21:17:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sixteen-year-old Sam Short of Columbus, Ohio, is battling a serious illness but refused to let that stop him from realizing a dream. https://t.co/2PdVyKN4Mb","date":"Wed Jun 22 20:55:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Amazing story! https://t.co/xHRUqAD800","date":"Wed Jun 22 20:34:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sen. Mike Lee (R-UT) slammed President Joe Biden’s proposed gas tax holiday to help with the process at the pump. https://t.co/uVGJNB3f6y","date":"Wed Jun 22 20:12:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Say What?! Biden: We Need More Money for “The Second Pandemic” https://t.co/rz7oh9Lygs","date":"Wed Jun 22 19:51:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Iran executed more than 100 people, including minors and women, within a space of three months in 2022, a report by U.N. Secretary-General Antonio Guterres released Tuesday said. https://t.co/VBWAtY1uPl","date":"Wed Jun 22 19:32:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Israel is keeping the Biden administration out of the loop about its recent undercover activities in Iran, CNN said Tuesday in a report citing sources close to the matter. https://t.co/F2Ieu2zo8B","date":"Wed Jun 22 19:11:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Harris Teeter grocery stores emptied their shelves of certain drink koozies after a North Carolina state congressional candidate criticized the fact that the koozies had gun images on them.  https://t.co/f3roTNXhCB","date":"Wed Jun 22 18:50:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Republican lawmakers introduced a bill Wednesday which would allow adults to sue doctors who performed sex-change procedures on them as minors. https://t.co/28gPQKnvPA","date":"Wed Jun 22 18:31:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"French populist Marine Le Pen has announced she will be stepping down as leader of the National Rally to focus on her new parliamentary group after the RN outperformed expectations at last week’s elections, winning 89 seats. https://t.co/YBv4iCDUDi","date":"Wed Jun 22 18:12:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Of course! https://t.co/XR1C0BZQdo","date":"Wed Jun 22 17:51:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A pro-abortion activist shouted and made obscene gestures toward pro-life college students at a rally outside the U.S. Supreme Court Tuesday. Activists on both sides await a ruling that could potentially reverse Roe v. Wade. https://t.co/gA17vPuU9M","date":"Wed Jun 22 17:32:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Dale Strong won the Republican nomination in the runoff battle against Casey Wardynski for Alabama’s Fifth Congressional District. https://t.co/ocprXO3X4x","date":"Wed Jun 22 17:12:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rio Grande Valley Sector Border Patrol agents encountered multiple large migrant groups illegally crossing the border from Mexico into Texas. https://t.co/28XKE0Bkwa","date":"Wed Jun 22 16:53:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cartel gunmen brought a Mexican border city to a halt as they set up roadblocks, torched vehicles, burned tires, and fired weapons into the air as a way to stop traffic. The chaos came after military forces arrested a top enforcer for the Gulf Cartel. https://t.co/4is9cklgx2","date":"Wed Jun 22 16:33:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"At least two people were wounded – one with life-threatening injuries – in a stabbing attack in a shopping mall west of the Swedish capital. https://t.co/0nMXu2lnnd","date":"Wed Jun 22 16:15:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Laredo Sector Border Patrol agents rescued a group of 80 migrants locked inside a tractor-trailer by a human smuggler.  https://t.co/ljGQCYKVTW","date":"Wed Jun 22 15:57:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Spain’s conservatives made huge gains in the traditionally left-wing Andalusian regional election Sunday, and the populists also made gains. https://t.co/SivHJRn9pu","date":"Wed Jun 22 15:38:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recession is “inevitable” despite Biden’s claims to the contrary, former president of the Federal Reserve Bank of New York, Bill Dudley, outlined in Bloomberg on Wednesday. https://t.co/DNM0tc0Dyp","date":"Wed Jun 22 15:19:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A national strike has crippled the transport infrastructure of Belgium as around 70,000 people took to the street to protest the effects of inflation. https://t.co/8BMO1qLyX2","date":"Wed Jun 22 14:58:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Airports from around the world have been delaying and canceling flights due to an ongoing staffing shortage. https://t.co/dLOYQnSj9E","date":"Wed Jun 22 14:39:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Netanyahu vowed to  form “a broad, strong, and stable national government” that would “restore national pride” following what he called the “fall of the worst government in Israel’s history.” https://t.co/FIF0NeJjqD","date":"Wed Jun 22 14:19:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The World Health Organization (WHO) will hold an emergency meeting Thursday at its headquarters in Geneva, Switzerland, to decide a new name for monkeypox while determining if its spread is an emergency of international concern. https://t.co/6qVdwuij2T","date":"Wed Jun 22 14:01:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Chicago man is accused of stealing a car carrying three children while their father was retrieving a DoorDash order, per a report. https://t.co/vayplfCHTe","date":"Wed Jun 22 13:41:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Texas GOP Sen. John Cornyn suggested Tuesday evening that he would push through an immigration bill with amnesty advocate Sen. Alex Padilla (D-CA). https://t.co/IyIdox2LW9","date":"Wed Jun 22 13:22:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Kim Foxx’s husband, Kelley Foxx, called police to their Illinois home for an incident involving his daughter, one week after officers were dispatched to their residence, where Kelley told officers that Kim slapped him in the face, according to reports. https://t.co/O8bnp7UsUM","date":"Wed Jun 22 13:04:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Comedy icon Rowan Atkinson, who will forever be immortalized as Mr. Bean, attacked political correctness and its stranglehold on comedy.  https://t.co/pA8TLljnxn","date":"Wed Jun 22 12:43:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former sports reporter Michele Tafoya blasted left-wing sports radio host Dan Le Batard for “ambushing” her in a recent interview. https://t.co/2PIsoaCIHn","date":"Wed Jun 22 12:23:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s administration is planning to issue a regulation that would remove nearly all nicotine from cigarettes sold in the United States in an attempt to get people to quit smoking.  https://t.co/7pt1FsetFu","date":"Wed Jun 22 12:03:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"American Airlines will halt services in three cities this coming autumn due to an ongoing pilot shortage in the airline industry. https://t.co/Z87zXyIe1A","date":"Wed Jun 22 02:46:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former X Factor contestant and Stereo Kicks band member Tom Mann says he is “broken” after his fiancée died suddenly on the morning of their wedding day. https://t.co/bhEekONOAe","date":"Wed Jun 22 02:23:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cartel gunmen murdered two Jesuit priests who tried to protect another man from being killed in the Mexican border state of Chihuahua. https://t.co/qP0pYto8AE","date":"Wed Jun 22 02:01:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Disney employees are reportedly in a state of confusion over the company’s plan to move 2,000 workers to Florida from California, and they are blaming CEO Bob Chapek for the “chaos.” https://t.co/MW4FvHZnaD","date":"Wed Jun 22 01:40:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Joe Rogan used part of his podcast to discuss how \"disgusted\" he was to hear Canadian PM Justin Trudeau argue against gun ownership. https://t.co/qxdir4jFK3","date":"Wed Jun 22 01:19:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rio Grande Valley Sector Border Patrol agents encountered multiple large migrant groups illegally crossing the border from Mexico into Texas. https://t.co/pHAt3KYQDk","date":"Wed Jun 22 00:59:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Laredo Sector Border Patrol agents rescued a group of 80 migrants locked inside a tractor-trailer by a human smuggler. The agents found the migrants during an inspection at an interior immigration checkpoint in Texas. https://t.co/0GJ3v83GJ9","date":"Wed Jun 22 00:38:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s attempts to convince the American people that Putin is responsible for high gas prices and inflation has failed, polling data released Tuesday showed. https://t.co/RjgarHOqdW","date":"Wed Jun 22 00:16:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Netanyahu vowed to  form “a broad, strong, and stable national government” that would “restore national pride” following what he called the “fall of the worst government in Israel’s history.” https://t.co/nckShtZY0y","date":"Tue Jun 21 23:55:20 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Two industry executives behind famous narco-musicians face money laundering charges in a U.S. federal court. The duo is behind some of the biggest names in narco-ballad genre. https://t.co/3gQzFuas5L","date":"Tue Jun 21 23:34:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Four-time major champion pro golfer Brooks Koepka is the latest big name in golf to jump from the PGA Tour to the new LIV golf league. https://t.co/l2q3yMa0Ut","date":"Tue Jun 21 23:11:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Russia has threatened action after Lithuania began to block goods from travelling into the exclave of Kaliningrad, greatly increasing tensions between the two countries.\n\n https://t.co/SnoEPzGG3v","date":"Tue Jun 21 22:50:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Latin America’s leftist dictatorships enthusiastically embraced election results out of Colombia Sunday night which gave the win to Gustavo Petro, a former member of the Marxist M19 terrorist organization. https://t.co/pN08HqMnWN","date":"Tue Jun 21 22:31:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"As a caravan of about 12,000 foreign nationals was reportedly disbanded in Mexico, the United States continues seeing a caravan of more than 7,100 border crossers and illegal aliens every day. https://t.co/p5NBORwnRC","date":"Tue Jun 21 22:12:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"This is CNN! https://t.co/w9N3y0ZPS3","date":"Tue Jun 21 21:54:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Comedy icon Rowan Atkinson, who will forever be immortalized as Mr. Bean, attacked political correctness and its stranglehold on comedy.  https://t.co/429LSZ7Axs","date":"Tue Jun 21 21:36:20 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"In a major win for religious liberty, the Supreme Court sided 6-3 on Tuesday against Maine’s education program, which excludes tuition assistance for students attending religious schools. https://t.co/9HUgRhVDJG","date":"Tue Jun 21 21:17:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Twitter’s board of directors has unanimously approved SpaceX and Tesla CEO Elon Musk’s bid to take over the company for $44 billion, recommending that shareholders approve the deal. https://t.co/JgrlPJJ1LJ","date":"Tue Jun 21 20:58:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A U.S. Navy warship fired a warning flare to repel an Iranian Revolutionary Guard speedboat during a tense encounter in the Strait of Hormuz. https://t.co/OXe7qyYigj","date":"Tue Jun 21 20:36:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The transgender issue is beginning to split Democrats as they face a reckoning in 2022 and 2024 over the “woke” left-wing. https://t.co/tHOJ0v1kEy","date":"Tue Jun 21 20:14:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: @AlexMarlow previews tonight's elections, explains the DOJ's plans for \"Two-Spirit\" youth, &amp; Disney's \"Lightyear\" disaster. @JackPosobiec talks corporate media ignoring Juneteenth shootings &amp; law enforcement ignoring the Colbert insurrection: https://t.co/v7mtBZSKIi https://t.co/JkZlCKFzDZ","date":"Tue Jun 21 19:53:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An illegal alien, deported seven times from the United States, has been charged with shooting at Ramsey County, Minnesota, police officers. https://t.co/MwG1JZTThB","date":"Tue Jun 21 19:52:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden Says He's Considering Federal Gas Holiday, Blames Oil &amp; Gas Companies for Record Prices https://t.co/QfoACoFpIP","date":"Tue Jun 21 19:30:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Germany’s leftist Chancellor’s plan to phase out nuclear during an ongoing energy crisis has been slammed as “complete nonsense”. https://t.co/bGniwjS641","date":"Tue Jun 21 18:49:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Democrats voted down an amendment aimed at notifying parents at Department of Defense schools if their children want to transition genders. https://t.co/zDOARfAXFe","date":"Tue Jun 21 18:27:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Several Florida House Democrats are suspected of breaking House rules for allegedly taking in campaign cash during blackout periods, according to data compiled by the Florida House Republican Campaign Committee (FHRCC). https://t.co/KN8rPjPcVe","date":"Tue Jun 21 18:07:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Armed terrorists raided two Christian churches during worship services in northern Nigeria Sunday, killing three and kidnapping several dozen. https://t.co/Dm6iLcJYLR","date":"Tue Jun 21 16:59:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trump Roasts Biden, Kerry for Bicycle Troubles: “I Will NEVER” Ride a Bike https://t.co/5orzNjvv4T","date":"Tue Jun 21 16:39:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"American Airlines will halt services in three cities this coming autumn due to an ongoing pilot shortage in the airline industry. https://t.co/HX1GSkzUgb","date":"Tue Jun 21 16:17:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A U.S. Navy warship fired a warning flare early Tuesday to repel a speedboat from Iran’s Islamic Revolutionary Guard Corps Navy (IRGCN) during a tense encounter in the strategic Strait of Hormuz. https://t.co/jJZItvRFFJ","date":"Tue Jun 21 15:58:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Most say the economy is the number one issue in determining how they will vote in the midterm elections, a Redfield &amp; Wilton Strategies survey released this week revealed. https://t.co/ybPp9vFEdQ","date":"Tue Jun 21 15:39:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Spain’s conservatives made huge gains in the traditionally left-wing Andalusian regional election Sunday, and the populists also made gains. https://t.co/dnYUvfljUT","date":"Tue Jun 21 15:18:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden's DHS has released nearly 1.05 million border crossers and illegal aliens into the U.S. since he took office in late January 2021. https://t.co/MPDHKUAhRR","date":"Tue Jun 21 14:58:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"As working class American Citizens struggle to afford food, gas, or find baby formula, the Biden border crisis continues to rage out of control. https://t.co/odNumgxiPg","date":"Tue Jun 21 14:38:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Tucker Carlson mocked the arrest of Stephen Colbert staffers after they breached the Capitol building. https://t.co/V364nKiBJc","date":"Tue Jun 21 14:18:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An illegal alien, deported seven times from the United States, has been charged with shooting at Ramsey County, Minnesota, police officers. https://t.co/gCFWoKmCL8","date":"Tue Jun 21 13:58:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Senate Democrats recently voted down an amendment aimed at notifying parents at Department of Defense (DOD) schools if their children want to transition genders. https://t.co/M5QZlGi19b","date":"Tue Jun 21 13:40:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Netanyahu vowed to form “a broad, strong, and stable national government” that would “restore national pride” following what he called the “fall of the worst government in Israel’s history.” https://t.co/HdVdzfiF4n","date":"Tue Jun 21 13:20:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Kellogg Company, one of the original perpetrators of Woke Capitalism, said Tuesday that it is breaking itself up into three independent companies. https://t.co/FHWBYG8Mmd","date":"Tue Jun 21 13:00:59 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The rising share of global migrants arriving at the southern U.S. border has prompted pro-migration advocates to fund a mosque in Tijuana, Mexico. https://t.co/telrIdc1D7","date":"Tue Jun 21 03:51:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Planned Parenthood in Wisconsin will stop performing abortions after June 25, as the nation awaits a decision from the Supreme Court. https://t.co/gh8dtga6Po","date":"Tue Jun 21 03:32:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rio Grande Valley Sector Border Patrol agents encountered multiple large migrant groups illegally crossing the border from Mexico into Texas. The groups totaled more than 500 migrants including 146 unaccompanied migrant children. https://t.co/MmPhH5nOFO","date":"Tue Jun 21 03:12:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Most say the economy is the number one issue in determining how they will vote in the midterm elections, a Redfield &amp; Wilton Strategies survey released this week revealed. https://t.co/CahVzGcNmS","date":"Tue Jun 21 02:53:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Marine Le Pen’s National Rally won a historic number of seats on Sunday as President Macron failed to maintain his parliamentary majority. https://t.co/PnOPmLBadg","date":"Tue Jun 21 02:33:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden is underwater on almost every key issue as the midterm elections approach, a Redfield &amp; Wilton Strategies survey released this week found. https://t.co/FbToLx97nw","date":"Tue Jun 21 02:13:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: @AlexMarlow explains how opportunistic activists are already corrupting the meaning of Juneteenth, Biden's humiliating bike fall, &amp; Hillary making big moves for 2024. Matt Boyle goes in-depth on the midterms, esp key upcoming GOP primaries:  https://t.co/B0fOfeIoSR https://t.co/kc8rYQf6Pv","date":"Tue Jun 21 02:06:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"100% https://t.co/CB3AbnYujw","date":"Tue Jun 21 01:52:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cartel gunmen brought a Mexican border city to a halt as they set up roadblocks, torched vehicles, burned tires, and fired weapons into the air as a way to stop traffic.  https://t.co/HnlFiJoYwT","date":"Tue Jun 21 01:31:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"MEME - \"Rest assured any weapon that lays here on the table today that was turned it will not end up in the wrong hands.\" - Miami Chief Manuel Morales https://t.co/gfgz1SOzLF","date":"Tue Jun 21 01:12:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New rules proposed by FIFA, is looking to erase testosterone requirements and would allow trans players to play without restrictions. https://t.co/qtqjiG853S","date":"Tue Jun 21 00:51:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The White House’s newest economic catchphrase to blunt the force of a potential recession in 2023 is to tell the American people that it is not “inevitable.” https://t.co/HyICZhOkAk","date":"Tue Jun 21 00:27:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Two industry executives behind famous narco-musicians face money laundering charges in a U.S. federal court. The duo is behind some of the biggest names in narco-ballad genre. https://t.co/iNyiJvwQEb","date":"Tue Jun 21 00:07:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rich Hollywood Elite Kevin Spacey “strenuously denies” allegations of sexual assault, as he appeared in a London court to face five charges of offenses against three men. https://t.co/kpjodKQHjc","date":"Mon Jun 20 23:47:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The FBI recently stated that investment fraudsters exploiting Microsoft’s business networking platform LinkedIn pose a “significant threat” to the company and its users. https://t.co/BxgqEluMa5","date":"Mon Jun 20 23:27:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s Department of Homeland Security (DHS) has released nearly 1.05 million border crossers and illegal aliens into the United States since he took office in late January 2021. https://t.co/tQXVhTUF06","date":"Mon Jun 20 23:07:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nine people were shot, one of them fatally, during a Father’s Day weekend attack in Mayor Eric Adam’s (D) New York City.  https://t.co/RhgaCV2VZM","date":"Mon Jun 20 22:46:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Detroit police are seeking a gunman caught on surveillance video pointing a gun at a father holding a 7-month-old baby over the weekend.  https://t.co/swxshYkmNl","date":"Mon Jun 20 22:26:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Memes on social media mocked President Joe Biden after he fell off his bike Saturday morning in Delaware.  https://t.co/rquQiqCJBU","date":"Mon Jun 20 22:06:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden snapped at a reporter Monday after she asked about fears of an economic recession. https://t.co/YwS2ujx5WC","date":"Mon Jun 20 21:47:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"For the first time in this Yahoo/YouGov poll, Donald Trump beats President Joe Biden in a potential 2024 rematch. https://t.co/u7XQlhx7ue","date":"Mon Jun 20 21:28:12 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"As working class American Citizens struggle to afford food, gas, or find baby formula, the Biden border crisis continues to rage out of control. https://t.co/eRcdzXCQy0","date":"Mon Jun 20 21:08:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Environmentalists are trying to block the U.S. National Park Service from removing dead and excess trees from Yosemite National Park for fire prevention. https://t.co/npUVtblPjo","date":"Mon Jun 20 20:47:09 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Pipe down, peasants! You must not embarrass your Elite betters by pointing out the disaster that is the Biden economy. So mind your business and eat your gruel and show proper gratitude to your Elites. https://t.co/i5MD6tXPss","date":"Mon Jun 20 20:28:55 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Outstanding news for conservatives! https://t.co/KF0NB5tlIO","date":"Mon Jun 20 20:10:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden confirmed Monday he was considering a gas tax holiday and even gas rebate cards to help drivers suffering from the high cost of fuel. https://t.co/0k2usgqJ78","date":"Mon Jun 20 19:24:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nice try, Hillary. But it's too late. The woke transgender train has left the station--and Democrats are along for the ride all the way through November. Have fun! https://t.co/vnZ23Sq9tI","date":"Mon Jun 20 19:02:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden claimed Monday he was doing well after tipping over his bike on Saturday, speaking to reporters after his public fall. https://t.co/4t30l2Ssa1","date":"Mon Jun 20 18:20:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Planned Parenthood in Wisconsin will stop performing abortions after June 25, as the nation awaits a decision from the Supreme Court. https://t.co/GchEcxySpp","date":"Mon Jun 20 17:58:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"On Sunday, the international governing body for swimming, officially enacted rules that will exclude transgender swimmers such as Lia Thomas. https://t.co/d1CvF81Xdk","date":"Mon Jun 20 17:36:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Iran will surrender its demand for the Islamic Revolutionary Guard Corps (IRGC) to be removed from Washington’s terrorism list, the Qatar-aligned Middle East Eye news site reported on Monday citing an Iranian source. https://t.co/j1UHd4ZndY","date":"Mon Jun 20 16:25:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"BIDEN BORDER CRISIS: Officials report that Del Rio Sector Border Patrol agents apprehended nearly 1,800 migrants in a 48-hour period ending Saturday afternoon. https://t.co/dsQDSDrpx4","date":"Mon Jun 20 16:06:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The party of populist Marine Le Pen won a historic number of seats on Sunday as President Macron failed to maintain his parliamentary majority. https://t.co/t7kBHLQSeR","date":"Mon Jun 20 15:47:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Left-wing Oregon decriminalized drugs and the results are predictably catastrophic. https://t.co/tTcb5GqFGs","date":"Mon Jun 20 15:28:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Subhan Zaib is accused of going on a crime spree that ended with him allegedly raping a woman in Baltimore, according to court documents. https://t.co/qqbxN7gep9","date":"Mon Jun 20 15:10:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"For the first time in this Yahoo/YouGov poll, Donald Trump beats President Joe Biden in a potential 2024 rematch. https://t.co/r0bBZpiOTC","date":"Mon Jun 20 14:51:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"At least 47 people were shot, four of them fatally, during the Father’s Day weekend in Mayor Lori Lightfoot’s (D) Chicago. https://t.co/v8CGoYh0z2","date":"Mon Jun 20 14:33:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Hold on...wait, what? https://t.co/WMPfL6kuQh","date":"Mon Jun 20 14:14:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nice try, Hillary. But it's too late. The woke transgender train has left the station--and Democrats are along for the ride all the way through November. Have fun! https://t.co/kbI7s3wbmD","date":"Mon Jun 20 13:56:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A dog trained to find memory devices recently helped nab a suspected pedophile in Mexico City and has received lots of praise. https://t.co/d5juiiNt8o","date":"Mon Jun 20 13:35:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An assailant punched Louisville, Kentucky, Mayor Greg Fischer (D) Saturday evening, though he “is doing fine,” the city’s police department said in a tweet. https://t.co/Rdh8W4ZezR","date":"Mon Jun 20 12:57:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Hundreds of British troops have been barred from NATO deployment after video emerged of orgies with a civilian woman at a military barracks. https://t.co/NXqjyfReAn","date":"Mon Jun 20 12:26:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An Egyptian illegal migrant was killed this week by police in southern France after officers opened fire on a people smuggler’s vehicle that rammed a checkpoint near the Italian border. https://t.co/xxXGnfBGGU","date":"Mon Jun 20 03:22:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A group of Texas contractors came together to finish the construction of an Iraq veteran's home after a contractor \"abandoned the job.\" https://t.co/FvqZVEnC4C","date":"Mon Jun 20 03:04:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"German Chancellor Olaf Scholz says the Group of Seven leading democracies will make clear at their upcoming summit that Ukraine can expect to receive the support it needs “for as long as necessary.”\n\n https://t.co/wOfwUXR64h","date":"Mon Jun 20 02:45:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Philadelphia firefighter died after a building collapsed, sending several others to a hospital after being extracted from the debris. https://t.co/BJopVwwGfg","date":"Mon Jun 20 02:24:44 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Hillsborough County Sheriff's Office's Marine Unit joined forces with boaters Sunday to save a group from danger. https://t.co/Afc56XltYE","date":"Mon Jun 20 02:04:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Almost all New Yorkers, 92 percent, say crime is a “serious problem” in the state, including 63 percent who say it is a “very serious problem,” a new Siena College poll found.  https://t.co/9U8Y827JPI","date":"Mon Jun 20 01:43:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ireland’s pro-lockdown health minister has said that he may reintroduce forced mask-wearing lockdown measures ostensibly to curb the spread of COVID-19. https://t.co/5oma8lSSs1","date":"Mon Jun 20 01:24:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"“This just brought tears. So thankful for this brave young man. God bless!” https://t.co/VxqVhBDsBZ","date":"Mon Jun 20 01:03:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The incoming commander of the British Army has told his troops to prepare to fight a land war in Europe, citing Russia as a significant threat to peace on the continent. https://t.co/MCvPzw81fZ","date":"Mon Jun 20 00:42:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Producers Eva Longoria and Charles D. King revealed this June at the Produced By conference that they are creating a database of talent based on race so that studios can explicitly engage in racial discrimination while hiring for film crews.\n\n https://t.co/uYJb6fqgKx","date":"Mon Jun 20 00:21:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Biden border crisis is an unmitigated disaster. Officials report that Del Rio Sector Border Patrol agents apprehended nearly 1,800 migrants in a 48-hour period ending Saturday afternoon. https://t.co/FNu2jGoRSF","date":"Mon Jun 20 00:02:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Comedian and CNN host W. Kamau Bell is using Father’s Day to urge dads everywhere to take up the fight in favor of abortion, claiming that the systematic killing of unborn children is a human right that benefits both women and men. https://t.co/8PyzpekuEF","date":"Sun Jun 19 23:44:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s approval rating is down to the lowest in his presidency, at only 32 percent approval and 57 percent disapproval, according to the CIVIQS rolling job-approval average as of Saturday. https://t.co/Gj75uI5Qty","date":"Sun Jun 19 23:24:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"As working class Americans struggle to afford food, gas, or find baby formula to sustain the lives of their infants, Biden's administration is focused like a laser on banning “conversion therapy” for minors who claim they are members of the opposite sex. https://t.co/ryXXXBQOAc","date":"Sun Jun 19 23:04:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Bill Maher took aim at the Washington Commanders organization this weekend in response to their decision to fine defensive coordinator Jack Del Rio $100,000 for expressing his opinion on Twitter.\n\n https://t.co/dfj87dNCDG","date":"Sun Jun 19 22:44:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A sealed 1986 VHS tape of Back to the Future fetched $75,000 at a recent auction as VHS surges in popularity among collectors.\n\n https://t.co/1QxeZWGhVU","date":"Sun Jun 19 22:25:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nearly 630,000 abortions cost the United States roughly $6.9 trillion in 2019 alone, according to a report released this week by Republicans on the Joint Economic Committee (JEC).\n\n https://t.co/eUJDCc0VE0","date":"Sun Jun 19 22:06:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Loudoun County, Virginia, prosecutor Buta Biberaj — a George Soros-funded leftist — in an extraordinarily rare move was removed from a criminal case by a judge for “deliberately misleading the Court and the public” in an attempt to “sell” a plea deal. https://t.co/qDSpxECfkE","date":"Sun Jun 19 21:44:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"32 people were shot, three of them fatally, Friday into Sunday morning across Mayor Lori Lightfoot’s Chicago. https://t.co/oAs0g89hC0","date":"Sun Jun 19 21:23:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A former Massachusetts gym teacher was arrested Wednesday and faces 32  charges for allegedly sexually assaulting ten little girls who were students from his first, second, and third grade classes. https://t.co/nyRTej9WZt","date":"Sun Jun 19 21:03:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"TAKE NOTHING FOR GRANTED: A generic Republican candidate shows a slight five-point lead against a generic Democrat, shrinking four points since the previous week. https://t.co/qHabzB26Y8","date":"Sun Jun 19 20:41:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Eni joined Qatar’s $28.75 billion project to expand production in the world’s largest natural gas field after Russia cut supplies to Italy. https://t.co/AIwiRNn4jF","date":"Sun Jun 19 20:20:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A man from Queens is accused of going on a crime spree that ended with him allegedly raping a woman in Baltimore, according to court documents. https://t.co/vQKM3LgREa","date":"Sun Jun 19 20:01:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Macron’s alliance got the most seats in the final round of the parliamentary election, but it lost its majority, projections show. https://t.co/ZBS98EyeD0","date":"Sun Jun 19 19:43:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A new Border Patrol enforcement policy has been disseminated to agents warning them not to enforce immigration laws or attempt to arrest migrants near waterways, walls, canals, or other barriers. https://t.co/37prAnJ06S","date":"Sun Jun 19 19:22:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Almost six in ten American manufacturers believe ongoing inflation will lead to a recession in the United States, a new survey from the National Association of Manufacturers (NAM) finds. https://t.co/CrDlHHfFBe","date":"Sun Jun 19 19:03:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Israeli Prime Minister Naftali Bennett warned Iran against carrying out terror attacks against Israelis abroad, amid “concrete” threats that Israeli tourists were being targeted for killings and kidnappings in Turkey. https://t.co/ntOkVaHojX","date":"Sun Jun 19 18:44:55 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Officials report that Del Rio Sector Border Patrol agents apprehended nearly 1,800 migrants in a 48-hour period ending Saturday afternoon.  https://t.co/t3df2jvBVY","date":"Sun Jun 19 18:25:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Texas National Guardsmen and Border Patrol agents in the Del Rio Sector spent Father’s Day apprehending and processing a group of more than 400 migrants.  https://t.co/ERSvVkJ2I8","date":"Sun Jun 19 18:06:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Bank of England has admitted that its inflation predictions were widely off, as the UK is bracing for 11 percent inflation. https://t.co/28CWFQJt9c","date":"Sun Jun 19 17:46:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Recently leaked audio from over 80 internal meetings reveals that China-based employees of the massively popular app TikTok repeatedly accessedU.S. user data, despite the company’s claims to the contrary. https://t.co/eqK0ZiBzQA","date":"Sun Jun 19 17:26:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Officials from the European Union’s Civil Liberties committee have voted to extend the bloc’s usage of its transnational COVID certificate until 2023. https://t.co/rdUTcmArdp","date":"Sun Jun 19 17:06:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The European Union is looking to drop upwards of $18 million on a massive 5,300-square-foot New York residence for the bloc’s ambassador to the United Nations. https://t.co/Uv4wbZTNsf","date":"Sun Jun 19 16:46:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Germany’s economy minister said that the country will limit the use of gas for electricity production amid concerns about possible shortages. https://t.co/UiDll3WEhO","date":"Sun Jun 19 16:25:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Belief in God among U.S. adults sank to an all-time low this year — 81% — according to recent data from a Gallup survey. https://t.co/zf7MVpqx0D","date":"Sun Jun 19 16:04:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Bill Maher took aim at the Washington Commanders organization this weekend in response to their decision to fine defensive coordinator Jack Del Rio $100,000 for expressing his opinion on Twitter. https://t.co/fuwuXtcLgm","date":"Sun Jun 19 15:44:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Inflation has emerged as a top concern among Americans heading into the midterm elections, a Rasmussen Reports survey released found. https://t.co/vIbT1Hp02Q","date":"Sun Jun 19 15:23:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A plan proposed by Biden to see grain exported from Ukraine has received scrutiny from Poland, which has raised the alarm. https://t.co/o7fP3HZR8Q","date":"Sun Jun 19 15:04:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Hillary Clinton dismissed a 2024 presidential bid by maintaining Joe Biden will stand again and any move by her into the political spotlight would detract from his efforts to return to the White House. https://t.co/WzmUNeRF7F","date":"Sun Jun 19 14:44:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Empty shelves spotted in the female hygiene sections in stores across the country are serving as the latest sign of a worsening supply chain crisis, as the country still reels from a baby formula shortage. https://t.co/7vlrowAh3E","date":"Sun Jun 19 14:23:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Republican Mayra Flores’s special election victory Tuesday is only the latest of the mounting evidence that Hispanic voters are inching away from the Democrat Party. https://t.co/zcWIe3qGpZ","date":"Sun Jun 19 14:03:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Nearly 630,000 abortions cost the U.S. roughly $6.9 trillion in 2019 alone, according to a report released this week by JEC Republicans. https://t.co/HYjUryCkdy","date":"Sun Jun 19 13:43:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"French voters are going to the polls in the final round of key parliamentary elections for Macron. https://t.co/h6Qf2tOjWs","date":"Sun Jun 19 13:24:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A group reportedly knocked a man down in Lincoln Park, Chicago, as bystanders watched. https://t.co/6zbVvAY0CS","date":"Sun Jun 19 13:04:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":".@GovRonDeSantis \"Flotilla\" — \"Freedom First\" Boat Parade Draws Thousands https://t.co/nsPD2c1TGX","date":"Sun Jun 19 12:44:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Some migrants who have been caught illegally entering Britain via boats across the English Channel or in the backs of lorries will be electronically tagged in order to prevent them from disappearing into the country.\n\n https://t.co/hvmZ5khu8k","date":"Sun Jun 19 12:22:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New York City Mayor Eric Adams faced severe backlash online following his praise for “drag storytellers” and their contributions to the school system and students, who he claimed could greatly benefit from such children-geared events.  https://t.co/Zxjzf0i3aJ","date":"Sun Jun 19 12:02:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"U.S. families are struggling to make ends meet as multiple supply chain issues continue to affect many aspects of their lives amid record high gas prices and 41-year-high inflation. https://t.co/80ACVcUQQN","date":"Sun Jun 19 11:42:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Around 40 percent Marine Le Pen supporters say they will vote for the far-left if the only other option is Emmanuel Macron’s bloc. https://t.co/0iN1Gs3QGX","date":"Sun Jun 19 11:22:08 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The average age of Spanish first-time mothers has risen to 33 years old, up a full year from just a decade ago as the country faces plummeting birth rates and a demographic crisis. https://t.co/cgYs4IU2oH","date":"Sun Jun 19 11:00:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Thousands of people marched through central London on Saturday in a protest over the soaring cost of living in Britain. https://t.co/QPErp7zLYi","date":"Sun Jun 19 03:41:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Crime rates in the Minneapolis-Saint Paul suburban area have risen at an alarming rate as violent crime continues to surge in the Twin Cities following the death of George Floyd in 2020, according to a report. https://t.co/dOmhPQPeIg","date":"Sun Jun 19 03:22:44 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Earlier this week, French anti-terrorist police arrested a man in his 40s who is believed to have been behind at least sixty car burnings since 2017, many of the vehicles belonging to public companies.\n\n https://t.co/sfIQxsMsIA","date":"Sun Jun 19 03:02:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Finnish government is developing various legislative policies and amendments to be able to handle a possible surge of illegal immigrants and close the border with Russia while suspending asylum applications.\n\n https://t.co/h8xr59gKFH","date":"Sun Jun 19 02:44:09 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trudeau will suspend restrictions that banned unvaccinated Canadians from air travel and train travel within and outside of Canada after growing pressure. https://t.co/daaoLj1jWk","date":"Sun Jun 19 02:22:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Bank of America sees growth falling to near zero in the back half of next year and a 40 percent chance of a recession. https://t.co/7heYqw8M8S","date":"Sun Jun 19 02:03:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former U.S. envoy to Israel David Friedman told Breitbart in an exclusive interview that President Joe Biden made a grave mistake by condemning Saudi Arabia a “pariah.” https://t.co/ypJjREU3Dw","date":"Sun Jun 19 01:44:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Iran-backed Houthi extremists of Yemen are still using child soldiers despite firm promises made to the United Nations to discontinue the practice. https://t.co/hRDVFRXmKq","date":"Sun Jun 19 01:24:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden administration officials report a concerning increase in the number of unaccompanied migrant children being apprehended after crossing the southwest border with Mexico.  https://t.co/NYOTOprdBs","date":"Sun Jun 19 01:05:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Mexican President Andres Manuel Lopez Obrador (AMLO) sparked controversy this week when he said that areas controlled by a cartel have fewer murders.  https://t.co/q1AvjnRXhW","date":"Sun Jun 19 00:46:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Two men died in Sri Lanka this week while waiting in hours-long lines for fuel amid the country’s ongoing financial crisis. https://t.co/Fu7rORMXRB","date":"Sun Jun 19 00:26:59 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Recent OPEC oil production numbers show the cartel’s members are missing their production targets, jeopardizing Biden’s upcoming visit to Saudi Arabia to request more oil imports. https://t.co/9GKmNI6Vtr","date":"Sun Jun 19 00:08:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Concealed carry is skyrocketing among Philadelphia women as the city’s crime wave continues to surge. https://t.co/56LKB2O6r0","date":"Sat Jun 18 23:49:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The British government has reportedly ordered the National Health Service (NHS) to use the word women instead of woke doublespeak language such as “people with ovaries”. https://t.co/2UgCHXwBU9","date":"Sat Jun 18 23:31:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Abbott Nutrition plant in Sturgis, Michigan — the plant at the heart of the baby formula shortage — was forced to shut down again this week due to severe weather, which will “likely delay production and distribution” of new products. https://t.co/iSEmjLdVw2","date":"Sat Jun 18 23:10:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A generic Republican candidate shows a five-point lead against a generic Democrat, shrinking four points since the previous week, in the latest Rasmussen Reports poll. https://t.co/yrjKiFy1CF","date":"Sat Jun 18 22:50:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Philadelphia firefighter died Saturday when a building collapsed, and several others were sent to a hospital after being extracted from the debris. https://t.co/eTBdtzAwlG","date":"Sat Jun 18 22:30:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Kari Lake is the frontrunner in Arizona’s Republican gubernatorial primary election with a 12-point lead over her closest challenger, according to a new Trafalgar Group poll.  https://t.co/UEr50msgPf","date":"Sat Jun 18 22:09:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The New York Post’s editorial board has endorsed Rep. Lee Zeldin (R-NY) for New York governor less than two weeks from the state’s gubernatorial primary. https://t.co/M75QzYVusU","date":"Sat Jun 18 21:49:22 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Catholic League president Bill Donohue said Biden’s new policy for transgender youth exposes them to serious health risks and constitutes “child abuse.” https://t.co/2yX3eeAVPU","date":"Sat Jun 18 21:30:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden Takes a Spill! https://t.co/xpYpvYDr0q","date":"Sat Jun 18 21:10:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"San Francisco police say a suspect wielding an “edged weapon” was taken into custody after attacking three men at San Francisco International Airport (SFO). https://t.co/Hbh7DjpOQo","date":"Sat Jun 18 20:49:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Jaw-dropping footage captured the moment two suspects in an SUV violently crashed following a police chase in Rochester, New York. https://t.co/sKFW1fp92r","date":"Sat Jun 18 20:28:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An illegal immigrant said to have severe psychological difficulties, broke into a church in Neuchâtel, causing tens of thousands of Swiss francs in damage to the church’s organ. https://t.co/NAtUJVCpei","date":"Sat Jun 18 20:08:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"YouTube has censored a video of testimony from the January 6 kangaroo court, claiming that the video promoted election misinformation.  https://t.co/W52pbVPhNT","date":"Sat Jun 18 19:47:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recently leaked Amazon memo has revealed that the e-commerce giant is worried it might run out of people to hire in its U.S. warehouses by 2024. https://t.co/IBkOcHCVjb","date":"Sat Jun 18 19:27:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The United States Chamber of Commerce is celebrating Obama’s Deferred Action for Childhood Arrivals (DACA) program on its 10th anniversary, calling enrolled illegal aliens the embodiment of “the American dream.” https://t.co/sRfR1tZiK0","date":"Sat Jun 18 19:08:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Food and Drug Administration (FDA) on Friday authorized both Moderna’s and Pfizer’s coronavirus shots for children under the age of five. https://t.co/aAkX6rGbk7","date":"Sat Jun 18 18:47:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New Hampshire’s First Congressional District Republican candidate Matt Mowers hammered his neighboring state, Massachusetts, for endangering Granite Staters by allowing illegal aliens to obtain driver’s licenses. https://t.co/nyvPQkGwTZ","date":"Sat Jun 18 18:27:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"It's starting. https://t.co/RobHebmEd8","date":"Sat Jun 18 18:07:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ten years ago, in 2012, Obama created the Deferred Action for Childhood Arrivals (DACA) program via executive order that has allowed nearly 800,000 illegal aliens to evade arrest and deportation. https://t.co/2sJQYBOTkG","date":"Sat Jun 18 17:49:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A group of scientists called the Malabo Montpellier Panel published a report in May that encouraged Africa to develop a “sustainable bio-economy” through such innovative techniques as making muffins and meatloaf out of flies. https://t.co/UO1QEV9251","date":"Sat Jun 18 17:30:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New York Democrat Rep. Mondaire Jones has reportedly misused the House rule allowing proxy voting in order to attend a wedding and party with actress and producer Issa Rae in France. https://t.co/kUxZ8PcbkC","date":"Sat Jun 18 17:09:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The World Health Organization admitted that the very lockdown policies it advocated for have resulted in a rise of mental health issues. https://t.co/z8hngqI0IP","date":"Sat Jun 18 16:50:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Shocking footage shows the moment a gas thief suspect caught on fire as he was allegedly attempting to drill a hole in a truck’s fuel tank outside a Salt Lake City small business. https://t.co/hmedslZHPq","date":"Sat Jun 18 16:32:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Supreme Court Justice Sonia Sotomayor sang her colleague Justice Clarence Thomas’s praises for his dedication to the court’s integrity. https://t.co/2ZUeaDKwQ0","date":"Sat Jun 18 16:11:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An Illinois man is accused of murdering his “on-and-off” eight-months pregnant girlfriend, Liese Dodd, and her unborn child before discarding her decapitated head in a dumpster.  https://t.co/DV28A8Jcji","date":"Sat Jun 18 15:51:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A 17-year-old was not worried about his own safety when he realized a woman had plunged her vehicle into water and was in extreme danger. https://t.co/jW6Jml4jGg","date":"Sat Jun 18 15:30:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Minnesota mother is praising God for a 12-year-old girl who heroically saved her four-year-old son after he fell into a sewer. https://t.co/ZRwwvQ8SZm","date":"Sat Jun 18 15:10:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An illegal alien is accused of killing 21-year-old Tyler Ray Baysden in a hit-and-run crash in Polk County, Florida, this month. https://t.co/YZWbieeVKO","date":"Sat Jun 18 14:49:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Greenfield, Massachusetts, mother and her 12-year-old child reportedly obtained a temporary harassment prevention order against The Flash star Ezra Miller. https://t.co/lD1mQpffhe","date":"Sat Jun 18 14:27:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An 18-year-old man was reportedly charged in a pair of robberies after his mother spotted his face on a bulletin and notified Chicago law enforcement. https://t.co/3gTHPrvo6C","date":"Sat Jun 18 14:06:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Standards for the Obama program were set so low that tens of thousands of illegal aliens with prior arrest records for crimes like murder, rape, and kidnapping were able to secure DACA status. https://t.co/v7SoK45f0b","date":"Sat Jun 18 13:48:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Nativity School of Worcester can no longer call itself Catholic after flying the gay pride and Black Lives Matter flags. https://t.co/L6OuY5lBXZ","date":"Sat Jun 18 13:29:40 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The U.S. Capitol Police arrested a group of nine staffers from CBS’s The Late Show with Stephen Colbert for allegedly trespassing in the U.S. Capitol on Thursday night, according to Fox News.  https://t.co/JoMTQNBnvp","date":"Sat Jun 18 13:11:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Virginia’s Fairfax County School Board amended its student code of conduct to give schools more power to punish students who “misgender” or “deadname” students who identify as transgender. https://t.co/G0QT9vfnIu","date":"Sat Jun 18 12:53:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Leftist icon Los Angeles County District Attorney George Gascón is a disaster for the people, but is a hero to the Democrat Party for his woke approach to putting the wants and needs of criminals first. https://t.co/bYaHkQy9SM","date":"Sat Jun 18 12:32:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"RINO Senator John Cornyn (TX) was booed at his home state’s annual Republican Party convention on Friday over his work with Democrats to achieve “bipartisan” gun control.  https://t.co/j6meMCNoTB","date":"Sat Jun 18 12:11:55 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Come on, folks, destroying America is hard work. So even though you may not be able to afford a trip to the beach, your Elite betters can and will enjoy some down time to recharge. https://t.co/TyzpbTpqwL","date":"Sat Jun 18 11:51:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Fontana Police Department in California said because of skyrocketing gas prices, thieves were drilling into gas tanks to swipe fuel. https://t.co/dXi44cAsyY","date":"Sat Jun 18 03:17:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Recent OPEC oil production numbers show the cartel’s members are missing their production targets, jeopardizing Biden’s upcoming visit to Saudi Arabia to request more oil imports. https://t.co/MJcbjtiNy3","date":"Sat Jun 18 02:58:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A human smuggler from Mexico will spend almost 18 years in prison for shooting a handgun at U.S. Border Patrol agents in West Texas in January. https://t.co/KMqMZklpH7","date":"Sat Jun 18 02:39:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rio Grande Valley Sector Border Patrol agents saved the lives of 18 migrants who nearly drowned while crossing the Rio Grande.  https://t.co/W8IX883ymP","date":"Sat Jun 18 02:20:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The World Health Organization (WHO) has admitted that the very lockdown policies it advocated for have been instrumental in a drastic increase in mental health issues on a global scale. https://t.co/t5l9egKsdf","date":"Sat Jun 18 02:01:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The U.S. Capitol Police arrested a group of nine staffers from CBS’s The Late Show with Stephen Colbert for allegedly trespassing in the U.S. Capitol on Thursday night, according to Fox News.  https://t.co/2JgKZwTr0l","date":"Sat Jun 18 01:43:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Bank of America economists slashed their forecasts for U.S. growth for this year and next to reflect ongoing inflation, Fed tightening, lockdowns in China, and the Russia-Ukraine war. https://t.co/dFuhXHaF48","date":"Sat Jun 18 01:24:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cook County State’s Attorney Kim Foxx’s husband’s 911 call has surfaced days after a police report came to light showing he alleged that Kim became physical and slapped him. https://t.co/dy5bWWXZ8i","date":"Sat Jun 18 01:05:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A 71-year-old man with a handgun was taken down by a potluck attendee and held for police after allegedly opening fire Thursday at a St. Stephen’s Episcopal Church event near Birmingham, Alabama. https://t.co/9E2m1LwjPv","date":"Sat Jun 18 00:45:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New York City Mayor Eric Adams faced severe backlash online following his praise for “drag storytellers” and their contributions to the school system and students, who he claimed could greatly benefit from such children-geared events.  https://t.co/4He90dn7ME","date":"Sat Jun 18 00:26:06 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The New York Post’s editorial board has endorsed Rep. Lee Zeldin (R-NY) for New York governor less than two weeks from the state’s gubernatorial primary. https://t.co/eIAZjf6SMH","date":"Sat Jun 18 00:07:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trump Store Slammed! Watch Driver Plow Through Pro-Trump Store https://t.co/yZOHsNvWP7","date":"Fri Jun 17 23:47:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden will host a global meeting Friday to talk about “climate change” even as domestic U.S. consumers struggle to face the more pressing, everyday concerns of soaring inflation and gas prices. https://t.co/tJGHR4ZHIG","date":"Fri Jun 17 23:26:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A member of the Depp vs. Heard jury said Amber Heard made him feel “uncomfortable” during the trial in which her ex-husband Johnny Depp sued her for defamation over a Washington Post op-ed she wrote in 2018. https://t.co/m857HLh3VU","date":"Fri Jun 17 23:05:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: Would you rather have an armed guard or a drag queen in the classroom? That's the question from our caller of the day after @alexmarlow rags on Dana Nessel's woke wish for every school. @CharlesHurt gives his take on the J6 hearing: https://t.co/IcdQVG9vac https://t.co/aC9rQh3zY4","date":"Fri Jun 17 22:43:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"This is bad. https://t.co/nvZoSqBcoo","date":"Fri Jun 17 22:38:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Supreme Court Justice Sonia Sotomayor sang her colleague Justice Clarence Thomas’s praises on Thursday for his dedication to the court’s integrity. https://t.co/dkvRkbDOzP","date":"Fri Jun 17 22:19:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"More than 100 House Republicans have sent a letter to Attorney General Merrick Garland asking that the Department of Justice to investigate the vandalism and violence directed at pro-life pregnancy centers. https://t.co/OQBUI4DmX1","date":"Fri Jun 17 21:56:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Virginia’s Fairfax County School Board amended its student code of conduct to give schools more power to punish students who “misgender” or “deadname” students who identify as transgender. https://t.co/frkx1hMjQn","date":"Fri Jun 17 21:37:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Minnesota mother is praising God for a 12-year-old girl who heroically saved her four-year-old son after he fell into a sewer, according to reports. https://t.co/mVU9mKdW5q","date":"Fri Jun 17 21:18:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The corporate media may lose some of the special treatment it was given by Big Tech in the years following Donald Trump’s 2016 election victory, according to a report. https://t.co/f2W5DWye5F","date":"Fri Jun 17 20:57:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Empty shelves spotted in the female hygiene sections in stores across the country are serving as the latest sign of a worsening supply chain crisis, as the country still reels from a baby formula shortage. https://t.co/c0pTRia56t","date":"Fri Jun 17 20:35:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Soaring diesel prices could cause food shortages, farmers warned this week.\n\n https://t.co/esLrR0aY3l","date":"Fri Jun 17 20:15:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Abbott Nutrition plant in Sturgis, Michigan — the plant at the heart of the baby formula shortage — was forced to shut down again this week due to severe weather, which will “likely delay production and distribution” of new products.\n\n https://t.co/2QMCczz7yL","date":"Fri Jun 17 19:57:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Food and Drug Administration (FDA) on Friday authorized both Moderna’s and Pfizer’s coronavirus shots for children under the age of five. https://t.co/9kXjw3vUBy","date":"Fri Jun 17 19:38:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"What?? https://t.co/L0rcgof1Ac","date":"Fri Jun 17 19:20:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recently leaked Amazon memo has revealed that the e-commerce giant is worried it might run out of people to hire in its U.S. warehouses by 2024. https://t.co/T2gytGGgBh","date":"Fri Jun 17 18:58:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Officials in Kansas are pointing to extreme heat as the main factor behind the deaths of thousands of head of cattle. https://t.co/6VrR3VCsg3","date":"Fri Jun 17 18:39:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"China ceremonially launched its third aircraft carrier on Friday and christened it Fujian, the name of the Chinese province opposite the country of Taiwan.  https://t.co/mSNsvIilBw","date":"Fri Jun 17 18:21:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An 18-year-old man was reportedly charged in a pair of robberies after his mother spotted his face on a bulletin and notified Chicago law enforcement.\n\n https://t.co/cwbBeRv7OW","date":"Fri Jun 17 18:02:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NFL head coaches Ron Rivera of the Washington Commanders and Mike McCarthy of the Dallas Cowboys have both been fined $100,000 for excessive player contact during offseason practices. https://t.co/BGjEBU1701","date":"Fri Jun 17 17:43:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Almost all New Yorkers, 92 percent, say crime is a “serious problem” in the state, including 63 percent who say it is a “very serious problem,” a new Siena College poll found. \n\n https://t.co/Mbd41HJS4e","date":"Fri Jun 17 17:21:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Cartel gunmen tried to ambush a squad of Mexican military officers, setting off a fierce shootout where authorities killed 11 and arrested seven more. https://t.co/ysvD2Ckarh","date":"Fri Jun 17 16:59:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Clark County Sheriff Joe Lombardo has a narrow lead over Nevada Gov. Steve Sisolak, according to a poll released one day after his victory in the Republican primary on Tuesday. https://t.co/Ap67KfX9ks","date":"Fri Jun 17 16:38:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Del Rio Sector Border Patrol officials report an increasing number of unaccompanied migrant children being trafficked across the Texas-Mexico border.  https://t.co/RCk3GUV0hl","date":"Fri Jun 17 16:16:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The World Health Organization admitted that the very lockdown policies it advocated for have resulted in a rise of mental health issues. https://t.co/o2Zo0li3Dp","date":"Fri Jun 17 15:56:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A call for taxes on U.S. and European nations to transfer wealth to struggling economies was renewed Wednesday at a U.N. climate conference. https://t.co/lmwH5ZHN4M","date":"Fri Jun 17 15:38:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Two people were killed Thursday night after a man opened fire during a potluck dinner at the Saint Stephen’s Episcopal Church near Birmingham, Alabama. https://t.co/ctjaRANpYY","date":"Fri Jun 17 15:19:38 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The New York Post’s editorial board has endorsed Rep. Lee Zeldin (R-NY) for New York governor less than two weeks from the state’s gubernatorial primary. https://t.co/ieelg7lkJ3","date":"Fri Jun 17 14:58:18 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An Illinois man is accused of murdering his \"on-and-off\" pregnant girlfriend, Liese Dodd, and her unborn child before discarding her head. “She was decapitated by a freaking savage monster.” https://t.co/1DWyMqr4Z6","date":"Fri Jun 17 14:37:44 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A woman in Moberly, Missouri, was charged for allegedly killing a pet dog and burning it as a \"sacrifice.\" https://t.co/j9oPBORhHI","date":"Fri Jun 17 14:17:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rich Elites like Kamala Harris and her Hollywood Elite pals are living it up and partying as working class Americans struggle to afford food, gas, or find baby formula to keep their infants alive. https://t.co/9u8jA9hR19","date":"Fri Jun 17 13:55:51 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The European Union is looking to drop upwards of $18 million on a massive 5,300-square-foot New York residence for the bloc’s ambassador to the United Nations. https://t.co/ekKgx1AuFj","date":"Fri Jun 17 13:37:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trudeau will suspend restrictions that banned unvaccinated Canadians from air travel and train travel within and outside of Canada after growing pressure. https://t.co/fk45UyiVBF","date":"Fri Jun 17 13:17:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Joe Lombardo has a narrow lead over NV Gov. Steve Sisolak, according to a poll released one day after his victory in the GOP primary. https://t.co/xFJupDwLd9","date":"Fri Jun 17 12:56:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Officials from the European Union’s Civil Liberties committee have voted to extend the bloc’s usage of its transnational COVID certificate until 2023. https://t.co/dAF7q6cZcQ","date":"Fri Jun 17 12:37:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden will host a global meeting Friday to talk about “climate change” even as domestic U.S. consumers struggle to face the more pressing, everyday concerns of soaring inflation and gas prices. https://t.co/nYcd7uSgUG","date":"Fri Jun 17 12:17:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"British Home Secretary Priti Patel has approved the extradition of WikiLeaks co-founder Julian Assange to the United States, where he faces up to 175 years in prison on charges of espionage and computer misuse. https://t.co/49a9DbtjIY","date":"Fri Jun 17 11:57:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"\"Democrats in Congress must be having whiplash right now.\" https://t.co/uW93f8DgeV","date":"Fri Jun 17 11:39:07 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Inflation has emerged as a top concern among Americans heading into the midterm elections, a Rasmussen Reports survey released Thursday found. https://t.co/UDGOXntuDO","date":"Fri Jun 17 11:20:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Crime rates in the Minneapolis-Saint Paul suburban area have risen at an alarming rate as violent crime continues to surge in the Twin Cities following the death of George Floyd in 2020, according to a report. https://t.co/VdjSznyHNN","date":"Fri Jun 17 11:02:03 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Almost six in ten American manufacturers believe ongoing inflation will lead to a recession in the United States, a new survey from the National Association of Manufacturers (NAM) finds. https://t.co/k5Zv6qZCAL","date":"Fri Jun 17 03:48:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A call for taxes on U.S. and European nations to transfer wealth to struggling economies was renewed Wednesday at a U.N. climate conference. https://t.co/BGbQJXSigU","date":"Fri Jun 17 03:26:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Del Rio Sector agents apprehended another large group of migrants late Wednesday morning. The group of more than 300 being apprehended as this article goes to press adds to the more than 400 apprehended earlier in the morning. https://t.co/IH6dWNtnqq","date":"Fri Jun 17 03:04:16 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"China’s state-run Global Times on Thursday warned the United States could “spark World War III” by pushing too hard to decouple from the Chinese minerals industry by developing its own supply. https://t.co/iiyyWfmTnh","date":"Fri Jun 17 02:42:42 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The governor of a Mexican state plagued with cartel violence for years is the nephew of a cartel boss and a cousin to another. Both face drug charges in a U.S court.  https://t.co/dy59vdG9Kb","date":"Fri Jun 17 02:23:20 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Tom Cruise’s latest blockbuster, “Top Gun: Maverick” has been given a thumb’s up and a solid ’10’ from an unlikely source after President of Brazil Jair Bolsonaro took to social media early Thursday to offer his applause for the box office blockbuster. https://t.co/6OfUpz55IL","date":"Fri Jun 17 02:04:59 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Catholic League president Bill Donohue said Wednesday that Biden’s new policy for transgender youth exposes them to serious health risks and constitutes “child abuse.” https://t.co/aSjTVWD52F","date":"Fri Jun 17 01:45:45 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A recent poll found that a majority of American voters trust Republicans more than Democrats on key issues such as inflation, border security, crime, foreign policy, and preserving democracy. https://t.co/PXJ4OB4oTt","date":"Fri Jun 17 01:26:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"New York Democrat Rep. Mondaire Jones has reportedly misused the House rule allowing proxy voting in order to attend a wedding and party with actress and producer Issa Rae in France. https://t.co/uSxfSmfVws","date":"Fri Jun 17 01:05:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"In a surprise move, Gavin Newsom said he would be joining Donald Trump’s social network, Truth Social in a bid to “call out Republican lies.” https://t.co/NypRKq8rd2","date":"Fri Jun 17 00:45:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"American energy is suffering from a lack of longterm investment, which temporary fixes cannot alleviate, global head of commodities at Goldman Sachs Jeff Currie said on Thursday. https://t.co/AqIiY3kBuh","date":"Fri Jun 17 00:25:32 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Thanks, Joe! https://t.co/yrVHGgpsM0","date":"Fri Jun 17 00:04:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An Illinois man is accused of murdering his “on-and-off” eight-months pregnant girlfriend, Liese Dodd, and her unborn child before discarding her decapitated head in a dumpster.  https://t.co/DnDrPULMGt","date":"Thu Jun 16 23:41:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A woman in Moberly, Missouri, was charged for allegedly killing a pet dog and burning it as a “sacrifice.” https://t.co/jUciMp3BhV","date":"Thu Jun 16 23:23:10 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An illegal alien is accused of killing 21-year-old Tyler Ray Baysden in a hit-and-run crash in Polk County, Florida, this month. https://t.co/uxSrEkXYKw","date":"Thu Jun 16 23:00:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Greenfield, Massachusetts, mother and her 12-year-old child reportedly obtained a temporary harassment prevention order against The Flash star Ezra Miller. https://t.co/zVzXgiofn8","date":"Thu Jun 16 22:37:17 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Insane. https://t.co/bbahch6V6P","date":"Thu Jun 16 22:15:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Del Rio Sector Border Patrol officials report an increasing number of unaccompanied migrant children being trafficked across the Texas-Mexico border.  https://t.co/aKys0SvBj4","date":"Thu Jun 16 21:51:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The man who killed two policemen in El Monte, California, Tuesday was on probation for illegally carrying a firearm, according to court papers. https://t.co/c845vGryOK","date":"Thu Jun 16 21:30:02 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Atlantic wrote an article on Thursday stating Biden should not seek reelection in 2024 because it would be “immediately liberating” for him if he bowed out of consideration. https://t.co/qoTv8U1IO2","date":"Thu Jun 16 21:11:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"“Hazardous Situation”: Major Flooding Wipes Out Roads in Yellowstone https://t.co/hscLFgXi8M","date":"Thu Jun 16 20:49:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"NEW PODCAST: @JeromeEHudson counts the crises Biden put on the backburner for a cringey Pride celebration, and @carney talks about the latest economic data and what it means that the Fed raises interest rates more than recently expected: https://t.co/Fasws8mwPv https://t.co/l6p1c9wmRr","date":"Thu Jun 16 20:46:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Lauren Boebert (R-CO) has vowed to take legal action against what she described as \"false and disgusting\" claims she was an escort. https://t.co/IKf7mtS8o7","date":"Thu Jun 16 20:29:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rio Grande Valley Sector Border Patrol agents saved the lives of 18 migrants who nearly drowned while crossing the Rio Grande. The rescues took place in two locations along the Texas border. https://t.co/0Iti6quhMF","date":"Thu Jun 16 20:08:21 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Supreme Court ruled that illegal immigrants can be detained indefinitely without a bond hearing and federal judges cannot grant immigrants class-wide relief in a pair of opinions issued Monday.  https://t.co/TYPlX0b4HH","date":"Thu Jun 16 19:47:36 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Who cares what you want. Shouldn't the people decide with their wallets? Isn't that what's known as a FREE market? https://t.co/Krw4cVFe1R","date":"Thu Jun 16 19:27:59 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Democrats hoped we forgot. We did not. Here's what Biden vowed in 2020: “No more drilling, including offshore. No ability for the oil industry to continue to drill, period. It ends.” https://t.co/pBYIBdmNbx","date":"Thu Jun 16 19:08:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Seventy-four percent of voters believe Biden's America is on the wrong track, while just 26 percent say the nation is on the right track. https://t.co/fbxCarQIwK","date":"Thu Jun 16 18:48:19 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The newly freed John Hinckley Jr., the man who attempted to assassinate President Ronald Reagan in 1981, had his sold-out concert canceled by a New York venue. https://t.co/Y4xZU0bpFg","date":"Thu Jun 16 18:29:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Leaked material from Google provided exclusively to Breitbart News give a glimpse of a feature rolled out to users of Google Docs that suggests woke-approved replacements for words like “man,” “woman,” “white,” and “master” as users type.\n\n https://t.co/WdRcoVX7gB","date":"Thu Jun 16 18:10:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Some prominent Democrats are working to instill fear in Americans with their messaging about the forthcoming Dobbs decision. https://t.co/tT4336TtCO","date":"Thu Jun 16 17:51:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Texas police detective testified that she determined that Cleveland Browns player Deshaun Watson did commit crimes during her investigation. https://t.co/GCI3lXEqJX","date":"Thu Jun 16 17:32:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Dallas is a big city, but when it comes to football teams, Cowboys Owner Jerry Jones thinks two is a crowd. https://t.co/wtmt5HsDkk","date":"Thu Jun 16 17:13:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"An Indian woman and her husband were \"hacked to death\" by family members in Tamil Nadu state due to their divergent castes. https://t.co/FJcEZ3kIDP","date":"Thu Jun 16 16:54:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Clark County Sheriff Joe Lombardo has a narrow lead over Nevada Gov. Steve Sisolak, according to a poll released one day after his victory in the Republican primary on Tuesday. https://t.co/baB6wK9ZS2","date":"Thu Jun 16 16:32:41 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"France will reportedly call for the creation of yet another globalist European institution at a meeting of the European Council next week, which could include the United Kingdom. https://t.co/W59oezYlVp","date":"Thu Jun 16 16:14:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The Israeli Air Force has made dramatic developments aimed at preparing for an attack on Iran. https://t.co/1eX0LKEErL","date":"Thu Jun 16 15:52:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Officials in Russian gas-addicted state Germany appear to be starting to sweat as the Kremlin turns down its supply to the country over what it describes as technical issues. https://t.co/DcTOC84YNt","date":"Thu Jun 16 15:34:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Biden’s policies are hurting the American people directly as he continues to “demagogue energy companies,” Florida Gov. Ron DeSantis (R) said. https://t.co/3txM8CQvkB","date":"Thu Jun 16 15:14:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Lauren Boebert (R-CO) has vowed to take legal action against what she described as “false and disgusting” claims she previously worked as an escort and underwent two abortions. https://t.co/oXA8GQP7AJ","date":"Thu Jun 16 14:52:43 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A record percentage of Americans rate U.S. moral values as ‘poor,’ a Gallup poll released on Wednesday found. https://t.co/KEf68QFybt","date":"Thu Jun 16 14:33:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"U.S. District Court Judge David O. Carter approved a settlement Wednesday between the City of Los Angeles and a homeless advocacy group, under which the city will provide 16,000 beds or housing units to those living on the streets. https://t.co/chjeHsBig5","date":"Thu Jun 16 14:12:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ric Grenell, an ally of former President Trump and his former Acting Director of the U.S. National Intelligence, has unendorsed Arizona U.S. Senate candidate Jim Lamon. https://t.co/rVOQsFg2lO","date":"Thu Jun 16 13:53:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Jane’s Revenge, the group responsible for firebombing pregnancy centers throughout the country, has now threatened domestic terrorism. https://t.co/cG2Lo1zWNe","date":"Thu Jun 16 13:33:35 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Virginia Gov. Glenn Youngkin Introduced a budget amendment to criminalize protest at Supreme Court justice’s homes. https://t.co/xo1Ru5aH8r","date":"Thu Jun 16 13:13:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Yikes! Watch What Happens During Routine Traffic Stop https://t.co/VOUn74MXcZ","date":"Thu Jun 16 12:55:30 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Jesuit Father James Martin declared this week that Gay Pride celebrations show us “whom Jesus calls us to love” and therefore are “deeply complementary” with devotion to the Sacred Heart of Jesus. https://t.co/neXt5F0DQT","date":"Thu Jun 16 12:33:46 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Economic growth appears to have come to a standstill, a widely followed barometer of the economy showed Wednesday. https://t.co/WIPnaXkSEW","date":"Thu Jun 16 02:03:37 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Connecticut’s Department of Revenue Services this week announced a coming tax hike on diesel fuel, resulting in a nine cent increase. https://t.co/SUchG7Y5CL","date":"Thu Jun 16 01:44:47 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former Gov. Paul LePage cruised through the Republican gubernatorial primary in Maine unopposed on Tuesday, officially setting up a face-off against incumbent Democrat Gov. Janet Mills for November. https://t.co/EZZAM5TEqV","date":"Thu Jun 16 01:24:57 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Idiotic. https://t.co/LpFWfQGYkT","date":"Thu Jun 16 01:05:33 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Del Rio Sector Border Patrol officials report an increasing number of unaccompanied migrant children being trafficked across the Texas-Mexico border. https://t.co/DVX6ixX8hQ","date":"Thu Jun 16 00:46:58 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The humanitarian toll on those suffering thanks to the Biden border crisis has been horrific. https://t.co/i5uF4jL0Ce","date":"Thu Jun 16 00:27:50 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Federal Reserve officials on Wednesday revealed new projections for the economy that reveal central bankers now expect the economy to grow less while inflation, unemployment, and interest rates to run higher than previously forecast. https://t.co/0bag7UcG55","date":"Thu Jun 16 00:08:44 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Seventy-four percent of voters believe Biden’s America is on the wrong track, while just 26 percent say the nation is on the right track, a Wednesday Politico/Morning Consult poll revealed. https://t.co/cntpTIAi4J","date":"Wed Jun 15 23:49:24 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":".@GovRonDeSantis Reacts to Elon Musk's Support: \"I Welcome Support from African Americans\" https://t.co/y9wSYcp1YO","date":"Wed Jun 15 23:30:28 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"When police pursued the suspect’s car, he got on the phone with a 911 dispatcher, declaring that the chase was illegal due to a 2021 law passed by state Democrats. https://t.co/rFNUsCkirq","date":"Wed Jun 15 23:10:51 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Facebook recently was hit with a wave of lawsuits relating to the company’s platforms and their negative impact on teen mental health; now the company’s Instagram platform is influencing teens to “Take a Break” and stop consuming harmful content. https://t.co/iMbsWEWD4J","date":"Wed Jun 15 22:51:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Trump-endorsed Madison Gesiotto Gilbert showed a massive lead against her Democrat opponent Emilia Sykes for Ohio’s 13th Congressional District, according to a poll from Remington Research Group. https://t.co/V3v6bVkig9","date":"Wed Jun 15 22:32:27 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The National Rifle Association’s (NRA) Wayne LaPierre sent a letter on June 14 to the group’s members assuring them the NRA is standing strong for school safety and real action while remaining opposed to “soundbite solutions” from gun controllers. https://t.co/PgLm3XRkRQ","date":"Wed Jun 15 22:12:49 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A lawyer for the family of Tyre Sampson says he was almost 100 pounds over the Orlando Free Fall's weight limit when he fatally fell. https://t.co/XVU5JQFFAy","date":"Wed Jun 15 21:53:29 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ford has instructed dealers to temporarily halt sales of its top-selling electric vehicle, the Mustang Mach-E, due to a potential safety defect that could leave the car immobile.  https://t.co/If7IYWGfYQ","date":"Wed Jun 15 21:33:04 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Professional circus clown Pencil Neck said Tuesday he believed the House Select Committee has enough evidence showing former President Donald Trump \"engaged in likely multiple criminal acts.\" https://t.co/upX2PwchYP","date":"Wed Jun 15 21:12:51 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Chinese officials on Wednesday addressed mounting public outrage over the abuse of the mandatory coronavirus “health code” system to suppress protests against a banking scandal – by improbably claiming the whole affair was just a minor technical glitch. https://t.co/LPFc3g755P","date":"Wed Jun 15 20:53:53 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Miss Universe is claiming that \"not all people who menstruate are women,\" and shared \"inclusive language\" guidelines to its Twitter account on Tuesday, instructing the public to say \"people\" have periods, not \"women.\" https://t.co/dgb68eJMMP","date":"Wed Jun 15 20:34:51 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Tesla CEO Elon Musk tweeted Wednesday that he was leaning towards supporting Republican Florida Gov. Ron DeSantis for president in 2024. https://t.co/hLCpL2sf5X","date":"Wed Jun 15 20:16:00 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Fox Sports is denying that it intentionally overshadowed transgender Jeopardy! champion Amy Schneider's ceremonial pitch at the Giants vs. Dodgers game. https://t.co/4pkj8tjCwp","date":"Wed Jun 15 19:57:54 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Let's roll. https://t.co/VcF9pSTWyb","date":"Wed Jun 15 19:22:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Graphic: Chicago-Area Officer Defends Himself from Hatchet-Wielding Man https://t.co/QUNi5sA7RO","date":"Wed Jun 15 19:04:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Tesla CEO Elon Musk tweeted Wednesday that he was leaning towards supporting Republican Florida Gov. Ron DeSantis for president in 2024. https://t.co/EdxlMKAvJs","date":"Wed Jun 15 18:39:23 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Kari Lake, the front runner in Arizona’s Republican gubernatorial primary, tweeted a popular video of Breitbart News founder Andrew Breitbart as her \"message to the media.\" https://t.co/Ac0LE3jHNX","date":"Wed Jun 15 17:49:05 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Establishment media television networks have shielded the Hunter Biden laptop story from view, covering up one of the most corrupt storylines of the past decade. https://t.co/ObxdAj7HSq","date":"Wed Jun 15 17:26:48 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Seventy-four percent of voters believe President Joe Biden’s America is on the wrong track, while just 26 percent say the nation is on the right track, a Wednesday Politico/Morning Consult poll revealed.\n\n https://t.co/eexKI2kEBM","date":"Wed Jun 15 17:05:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A naked woman attacked a Chicago police officer Monday before stealing his patrol vehicle and running him over, Chicago Police Superintendant David Brown said at a press conference. https://t.co/Z4igQpnMaT","date":"Wed Jun 15 16:42:52 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"WOKE DISASTER: A new poll finds that most Americans do not support trans athletes competing under their chosen gender, especially in female sports. https://t.co/PrHvj4QVbb","date":"Wed Jun 15 16:22:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Del Rio Sector Border Patrol agents revealed to Breitbart Texas that record-amount migrant groups are moving across the Rio Grande from Mexico to Texas. https://t.co/lUjSHtjK0H","date":"Wed Jun 15 15:32:44 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sen. Marco Rubio (R-FL) blasted the Biden administration as “weak and ineffective.” https://t.co/BD1E9hnkNR","date":"Wed Jun 15 15:13:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Rep. Karen Bass (D-CA) has overtaken billionaire developer Rick Caruso in the primary race for mayor of Los Angeles, thanks to vote-by-mail that has led to an eight-point swing in the results. https://t.co/xhLWGzBOjM","date":"Wed Jun 15 14:51:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Elon Musk stated in a tweet in the early hours of Wednesday that he voted for Republican candidate Mayra Flores in the recent special election for Texas’s 34th Congressional District. https://t.co/7SGF7JuaOK","date":"Wed Jun 15 14:11:15 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Crypto trading platform Coinbase will cut 18 percent of its staff with CEO Brian Armstrong warning of a worldwide recession and the possibility of a “crypto winter.” https://t.co/vztamPVlDI","date":"Wed Jun 15 13:34:26 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A European court intervened in the late hours of Tuesday evening to prevent a deportation flight to Rwanda from the UK. https://t.co/sn8Y6c7HDu","date":"Wed Jun 15 13:14:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A generic Republican leads on the ballot in a Democrat-held New Hampshire district rated as a “toss-up” election, according to a recent poll from the National Republican Congressional Committee (NRCC). https://t.co/ytVqnVlzNG","date":"Wed Jun 15 12:55:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Gov. Mike DeWine (R) signed legislation to allow school staff and teachers to be armed for classroom defense. https://t.co/1tzAVs6Io1","date":"Wed Jun 15 12:34:31 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A Queens man who allegedly killed his nephew with a machete reportedly admitted cutting him to pieces. https://t.co/ooHeA297GX","date":"Wed Jun 15 12:13:56 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Former President Donald Trump endorsed veteran and former prosecutor in Maricopa County Attorney’s Office Abe Hamadeh, who is running as a Republican candidate for Arizona Attorney General. https://t.co/Q4ruvaqkpy","date":"Wed Jun 15 11:53:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A teammate of Lia Thomas, the transgender swimmer who upended college swimming last season, says that Thomas is “mentally ill.” https://t.co/90KgOr2NBq","date":"Wed Jun 15 11:33:34 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Ukrainian farmers are reportedly preparing for a “hell” harvest season, with physical and financial dangers predicted to prevent them from reaping, transporting and selling their crops. https://t.co/seQIonkm8m","date":"Wed Jun 15 11:14:14 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Big Bend Sector Border Patrol agents tracked down 30 migrants attempting to make their way into the U.S. interior.  https://t.co/fFzvWXigcn","date":"Wed Jun 15 03:01:11 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Border Patrol agents in the five Texas-based sectors apprehended nearly 138,000 migrants in May, according to a source within U.S. Customs and Border Protection.  https://t.co/MmwpUFMVul","date":"Wed Jun 15 02:42:39 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"A report by the Stockholm International Peace Research Institute said China is pursuing a “substantial expansion” of its nuclear arsenal, including the development of new delivery systems and the construction of hundreds of additional missile silos. https://t.co/N9PaKUcXW4","date":"Wed Jun 15 02:24:13 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Federal authorities arrested an alleged human smuggler accused of kidnapping a Honduran female for six weeks to extort her family. The smuggler was in the U.S. illegally and has a deportation record. https://t.co/lITGhHAKDr","date":"Wed Jun 15 02:06:01 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"Sad! https://t.co/b1HrkC8lVy","date":"Wed Jun 15 01:47:25 +0000 2022","user_id":"457984599"},{"handle":"BreitbartNews","text":"The humanitarian toll on those suffering thanks to the Biden border crisis has been horrific. https://t.co/uBLu8w8MfL","date":"Wed Jun 15 01:28:20 +0000 2022","user_id":"457984599"}]