[{"handle":"cnn","text":"Watch CNN's @JeffreyToobin react to Senator Susan Collins' (R-ME) previous statements on former President Trump's Supreme Court nominees in light of the recent SCOTUS decision to overturn Roe v. Wade: https://t.co/280QFcxCzQ","date":"Sat Jun 25 22:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US Supreme Court handed down a bevy of decisions this week that will affect Americans across the country. https://t.co/0esPTkc6oG","date":"Sat Jun 25 22:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Phoebe Bridgers vented her frustration at America’s high court during her Glastonbury Festival set. https://t.co/Nut2u5ftwL","date":"Sat Jun 25 21:00:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Watch attorney Gloria Allred, who represented \"Jane Roe,\" react to the Supreme Court's ruling to overturn Roe v. Wade: https://t.co/Wsmk9ADvaO","date":"Sat Jun 25 20:05:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The umbrellas were sold at Costco warehouses and online for between $130 and $160. https://t.co/JYX0iAivMr","date":"Sat Jun 25 20:00:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The coyote attacked the toddler in Mile Square Park in Fountain Valley, the girl is recovering from her injuries. https://t.co/4QrQjUwIWD","date":"Sat Jun 25 19:00:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Two Pfizer and BioNTech Covid-19 vaccine boosters updated to target the Omicron variant show a substantially higher immune response than the current Covid-19 vaccine. https://t.co/P1S1RoknF9","date":"Sat Jun 25 18:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A South Carolina man has won more than $100,000 after trying a lottery strategy he says was inspired by an episode of TLC's \"Lottery Changed My Life.\" https://t.co/zOuv2w9szc","date":"Sat Jun 25 18:00:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"I think the freedom to read a book is the foundation of our democracy. It's under attack today.\"\n\nSteven Pico took his school to the Supreme Court in the 1980s for pulling \"objectionable\" books. This is his message to young people: https://t.co/2osTTfoxtf","date":"Sat Jun 25 17:31:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Georgia State Senator @senatorjen, who gave an impassioned speech about her miscarriages in response to Georgia's \"heartbeat bill,\" discusses the consequences of the Supreme Court's decision to overturn Roe v. Wade. Watch the @FWhitfield interview: https://t.co/2BVm0AOpYg","date":"Sat Jun 25 17:14:52 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Survivors recall the deadly earthquake in Afghanistan which killed more than 1,000 people https://t.co/ZamPHNtGJL https://t.co/06eqYu7lFM","date":"Sat Jun 25 17:00:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @Boris_Sanchez questions Texas Republican lawmaker @SenBryanHughes, who wrote the state's \"heartbeat bill,\" on whether life begins at conception.\nWatch the exchange here: https://t.co/kSJdJ2wxrE","date":"Sat Jun 25 16:55:47 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"Although G7 leaders can look back with some satisfaction at their unity in the face of Russia's unprecedented aggression... the scale of looming crises dwarfs even that,” writes Nic Robertson | Analysis https://t.co/UJKtaP09Uv","date":"Sat Jun 25 16:30:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Now that the Supreme Court has given the green light for lawmakers to prohibit abortion, several states, most of them Republican-led, have taken quick steps to do so.\n\nThese are the states where \"trigger bans\" are already in effect: https://t.co/f2EOaFNjco","date":"Sat Jun 25 16:00:58 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Now that we have the final ruling in the most consequential Supreme Court decision in decades one big question is: How has Justice Samuel Alito’s majority opinion changed compared to the leaked draft published by Politico? https://t.co/xtzGKLqItf","date":"Sat Jun 25 15:51:54 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"The day that remade America was decades in the making,” writes Stephen Collinson | Analysis https://t.co/RgKLNAFfvN","date":"Sat Jun 25 15:34:30 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Rusty Bowers, Republican House speaker in Arizona, says he may vote for Trump in 2024 despite testifying against Trump's attempts to overturn the 2020 election results and the threats he received after he refused. \n\nWatch his interview with @Smerconish: https://t.co/TAZYKH46hh","date":"Sat Jun 25 15:18:48 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Since a draft of the opinion leaked nearly two months ago, officials have been working to weigh what options the President has to mitigate some of the ruling's effect https://t.co/7SQOchblQd","date":"Sat Jun 25 15:14:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After months of bloody fighting, officials in Severodonetsk say it has fallen. The eastern Ukrainian region is now almost fully under Russian control. https://t.co/P5Hzt41cbU","date":"Sat Jun 25 14:58:55 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"At least three people were shot and a suspect is at large after a shooting at a WeatherTech facility in a suburb of Chicago https://t.co/pxnFCyuAwh","date":"Sat Jun 25 14:43:29 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Joe Biden departed Saturday for a week of summits in Europe, where the grinding war in Ukraine -- entering its fifth month and fading from Americans' attention -- will be thrust back to the forefront https://t.co/DdjdBeVpfF","date":"Sat Jun 25 14:36:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Ukrainian military is withdrawing from the eastern city of Severodonetsk -- a key victory for Russia in the battle for Luhansk and Donetsk. Watch @SalmaCNN report here: https://t.co/HqLeyxRy0G","date":"Sat Jun 25 12:58:54 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden signs into law the first major federal gun safety legislation passed in decades, marking a significant bipartisan breakthrough https://t.co/jO3OgMpeFn","date":"Sat Jun 25 12:53:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @NadiaNewsNow reports from outside the last abortion clinic in Mississippi after the Supreme Court overturned Roe v. Wade.\n\nSee the tense situation here: https://t.co/MbPoSnPB0A","date":"Sat Jun 25 12:46:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"While anti-abortion groups celebrated, abortion rights advocates expressed anger, disappointment and fear over the court's ruling and vowed to fight back https://t.co/Dmra2m2Pxu","date":"Sat Jun 25 12:25:20 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Do you love bacon so much you want to smell like it -- without the hassle of actually cooking? https://t.co/lVsXB727RL","date":"Sat Jun 25 12:08:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Why do we use Q-tips for the very thing they specifically warn us not to do? https://t.co/J7NZALDEg7","date":"Sat Jun 25 11:51:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"They cite the same Bible and evoke the same Jesus. But these two Christians are on opposite sides of the abortion debate https://t.co/qDqSs6B9yF","date":"Sat Jun 25 11:34:35 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Law enforcement officials said the decision will have a ripple effect, exacerbating the issue of gun violence and making it more difficult for officers to identify those who are illegally carrying guns in public https://t.co/4yPbyeMy1N","date":"Sat Jun 25 11:04:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The fight over abortion has moved to the forefront of this fall's midterm elections https://t.co/2R86XVikOu","date":"Sat Jun 25 10:34:22 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The owner of the only abortion clinic in the state of Mississippi vowed on Friday to stay open and continue providing services for women for the next 10 days https://t.co/xBsYTPJz2c","date":"Sat Jun 25 10:17:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A suspected land mine was removed from a Florida beach, according to police https://t.co/7KlpDJmW2o","date":"Sat Jun 25 10:00:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The seismic ruling by the US Supreme Court to eliminate the federal constitutional right to an abortion has roiled the country, fueling protests that began Friday as others are expected to extend throughout the weekend https://t.co/S1uRwZTCd4","date":"Sat Jun 25 09:43:34 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A library board in New York reversed its decision to remove all LGBTQ-related displays from its children's section in four of its libraries during Pride month after the removal was criticized. https://t.co/fbPsZntYvS","date":"Sat Jun 25 09:00:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Oslo Pride celebrations canceled on police advice as man charged with acts of terrorism over shooting at gay bar in Norway's capital https://t.co/ivoRMGcJqe","date":"Sat Jun 25 08:30:51 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Toyota has issued recalls for its first mainstream electric car and one of its full-sized pickup trucks for problems in which nuts or bolts could loosen and wheels or axles can become disconnected. https://t.co/dJ14Sdj26L","date":"Sat Jun 25 08:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Three decades after the release of \"A League of Their Own,\" it lives on as a vital and beloved piece of film history in a world where its star is fighting to see real change in Hollywood. Geena Davis is not dropping the ball. https://t.co/83rDZkZYwR","date":"Sat Jun 25 08:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Congress voted to extend the pandemic school meal waivers that have helped keep tens of millions of children fed and gave districts the funding and flexibilities needed to cope with supply chain and labor issues. https://t.co/aCZI2yBkEY","date":"Sat Jun 25 07:30:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There's a new world's deepest shipwreck to be identified and surveyed — and it's the USS Destroyer Escort Samuel B. Roberts (DE-413), known as the Sammy B. https://t.co/NF4EVMSQBU","date":"Sat Jun 25 07:01:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The San Bernardino Fire Department rescued two puppies from an underground tortoise den in Yucca Valley, California. They were stuck in the den for hours due to a 100-pound desert tortoise blocking their exit. https://t.co/JjYc6GD94S","date":"Sat Jun 25 06:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Arizona Republican Party Chair Kelli Ward and her husband, Michael Ward, were both subpoenaed as part of the federal investigation into fake slates of electors, a source tells CNN. https://t.co/EoWy0sOL6H","date":"Sat Jun 25 06:01:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Biden administration has approved the cancellation of federal student loan debt for another 45,000 public sector workers over the past few months, according to the Department of Education. https://t.co/oFT8YnMrFf","date":"Sat Jun 25 05:29:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US State Department has announced that US diplomats and family members impacted by severe \"Havana syndrome\" symptoms who required at least a year of medical assistance are going to be eligible for compensation payments https://t.co/go5mPc3bUM","date":"Sat Jun 25 05:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court upheld the approach taken by the Department of Health and Human Services in calculating certain Medicare payments for hospitals that serve a large number of low-income patients. https://t.co/9ns3oNzwQ0","date":"Sat Jun 25 04:30:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Costco faces a lawsuit from two shareholders claiming that the company and its top executives violated animal welfare laws and, in the process, broke their fiduciary duties. https://t.co/Z0cZg3LFVb","date":"Sat Jun 25 03:59:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"These 150,000 year-old fossil dunes were formed by the wind. They're a stone's throw away from a wetland reserve -- Abu Dhabi's first protected area. https://t.co/yIEh05yZSd https://t.co/PqX95xhla0","date":"Sat Jun 25 03:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The criminal fraud trial of Elizabeth Holmes' ex-boyfriend and former second-in-command at Theranos is heading to the jury after roughly three months. https://t.co/eQgw3ruCkP","date":"Sat Jun 25 03:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"US consumer sentiment hit a new record low in June amid growing concerns about inflation, according to a closely followed University of Michigan survey. https://t.co/2Yi1uEQnjj","date":"Sat Jun 25 02:30:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Dr. Yashica Robinson, a physician at an Alabama abortion clinic, describes the scene at her clinic as the Supreme Court overturned Roe v. Wade.\n\nWatch: https://t.co/6p2UaS0V3r","date":"Sat Jun 25 02:17:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Psyche mission's 2022 launch window, which closes on October 11, will come to an end before the spacecraft's flight software is ready. https://t.co/vyqMKpl1Ef","date":"Sat Jun 25 01:59:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Department of Homeland Security is warning law enforcement, first responders and private sector partners nationwide of potential domestic violence extremist activity in response to the Supreme Court's decision on abortion. https://t.co/9q2Hx8246E","date":"Sat Jun 25 01:29:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Planned Parenthood Federation of America President and CEO @alexismcgill reacts to a tweet from Republican @RepLizCheney on the Supreme Court ruling overturning Roe v. Wade. Watch here: https://t.co/oa3xW4NFgb","date":"Sat Jun 25 01:08:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Artemis team has had time to review data collected from a successful fourth attempt of a final prelaunch test and determined that no more wet dress rehearsals are needed. https://t.co/Uj1m1W2rDm","date":"Sat Jun 25 01:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New York City Mayor Eric Adams @nycmayor discusses with @wolfblitzer the bipartisan gun violence bill that Congress passed, as well as the overturning of #RoeVsWade, while underscoring that New York City is a safe place for people seeking abortions. https://t.co/sai67UuxPL","date":"Sat Jun 25 00:58:54 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Some House Republicans who oppose abortion rights are pushing legislation to implement a nationwide abortion ban at 15 weeks, coming just hours after the Supreme Court released its opinion overturning Roe v. Wade. https://t.co/BA31oLJ9z1","date":"Sat Jun 25 00:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The humanitarian crisis triggered by the war in Ukraine hit close to home for Mila Kunis. https://t.co/wtFDesjRnI","date":"Sat Jun 25 00:01:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Experts say the \"boyfriend loophole\" included in the newly passed bipartisan gun safety bill isn't fully closed. CNN's @jaketapper explains. Watch: https://t.co/SGpilI8Umv","date":"Fri Jun 24 23:47:00 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Embattled Wyoming Rep. Liz Cheney is turning to Democrats in her state as she looks to fend off a serious primary challenge in August, providing Democratic voters with instructions on how to change parties so they can support her. https://t.co/x1Z0qrf6G0","date":"Fri Jun 24 23:30:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The overturning of the landmark 1973 Roe v. Wade ruling by the US Supreme Court comes at an economic cost to the nation, economists have warned. https://t.co/AEVs5h2BmH","date":"Fri Jun 24 23:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @jaketapper talks to OB-GYN @DrJenGunter about how the Supreme Court decision to overturn @RoeVsWade could affect women's health. Watch: https://t.co/YjJkCQANnf","date":"Fri Jun 24 22:58:39 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The CDC has been trying to warn men in Florida or traveling to Florida, particularly those who identify as gay, bisexual, queer or trans, that they need to get a vaccine that can prevent them from getting meningococcal disease https://t.co/kYAoA3Jfkv","date":"Fri Jun 24 22:44:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After the Supreme Court ruled to overturn Roe v. Wade, corporate giants from a range of industries pledged to provide support and financial assistance for employees — and, in some cases, their dependents — seeking abortions in states that outlaw it. https://t.co/JDfwtBQRWE","date":"Fri Jun 24 22:39:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Conservative justices seized the moment and delivered the opinion they'd long promised | Analysis by Joan Biskupic https://t.co/fA8unnVRfC","date":"Fri Jun 24 22:29:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Ali Alexander, the leader of the \"Stop the Steal\" group who helped to organize rallies before the US Capitol attack, testified to a federal grand jury in the Justice Department's sweeping January 6 investigation. https://t.co/9uenCyepj3","date":"Fri Jun 24 22:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US Supreme Court has ended a woman’s constitutional right to an abortion. Listen to CNN 5 Things to hear what public health experts say this could mean for women going forward. https://t.co/y0J9JBNBZ9 https://t.co/FIljLn1xzQ","date":"Fri Jun 24 21:40:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Several allies responded with anger and dismay after the US Supreme Court overturned Roe v. Wade, condemning the decision as \"horrific,\" \"appalling\" and \"a big step backwards.\" https://t.co/xiJTFf3m8D","date":"Fri Jun 24 21:30:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Now that the Supreme Court has given the green light for lawmakers to prohibit abortion, several states have taken quick steps to do so. https://t.co/Ymy71v1hom","date":"Fri Jun 24 21:00:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN political commentator @alicetweet questioned @ananavarro's stance on abortion, prompting an emotional reply from Navarro. Watch: https://t.co/ZCCg6GdbXD","date":"Fri Jun 24 20:40:52 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Fourteen House Republicans joined with Democrats to pass a bipartisan bill to address gun violence, the first major federal gun safety legislation in decades. https://t.co/aPZQHkTb4E","date":"Fri Jun 24 20:30:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here's a look at where abortion rights stand across the US\n\nSource: Guttmacher Institute\nGraphic: Priya Krishnakumar, CNN\n\nhttps://t.co/SuBEH4TamI https://t.co/LZYMfETyAw","date":"Fri Jun 24 20:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @tomforemancnn explains trigger laws in different states, and when and how they will go into effect. Watch: https://t.co/5XLW1Cf9tb","date":"Fri Jun 24 19:46:57 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Donald Trump's lasting legacy will now be the overturning of Roe v. Wade | Analysis by Chris Cillizza https://t.co/MCSUJ8Xkd6","date":"Fri Jun 24 19:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here's a recap of the latest data on the public's views of abortion and how Americans will be feeling about the decision, from CNN and elsewhere. https://t.co/HJKsYXKUAb","date":"Fri Jun 24 19:30:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"With the Supreme Court deciding there is no longer a federal constitutional right to an abortion, the baby formula shortage and effects of the pandemic on careers and home life, women are carrying the weight of the world. https://t.co/L36egd5ru8","date":"Fri Jun 24 19:15:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN’s @WhitneyWReports talks to two female protesters about the Supreme Court’s ruling to overturn #RoeVsWade. Watch: https://t.co/upBS6C3P2N","date":"Fri Jun 24 19:14:44 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In pictures: Americans react after the Supreme Court ruled to overturn Roe v. Wade, holding that there is no longer a federal constitutional right to an abortion. https://t.co/qurLZ2GKwQ https://t.co/djv7ucH4DZ","date":"Fri Jun 24 19:00:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justice Clarence Thomas called for other major rulings to be revisited — a concurrence that liberals seized upon to argue that those rulings are now at risk. https://t.co/hCO53ZYToz","date":"Fri Jun 24 18:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court's ruling to overturn Roe v. Wade is almost certain to spark a wave of new state legislation taking aim at abortion rights, and to reinforce existing laws that prohibit and, in some cases, criminalize the procedure. https://t.co/mb6UFYst6L","date":"Fri Jun 24 18:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court's ruling overturning Roe v. Wade, the most consequential high court decision in decades, contained several striking lines that will resonate for years to come. https://t.co/sXq9lbgfjc","date":"Fri Jun 24 18:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"“I’ll be supporting somebody else.” \n\nAs @RepFredUpton prepares to retire, he says that while ensuring Trump doesn’t regain office in 2024 won’t be his main focus post-Congress, he won’t be rooting for him, either. \n\nHear more on the latest Axe Files. https://t.co/HOnPqJcd7J","date":"Fri Jun 24 18:00:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Biden says 'Roe is on the ballot' this fall as Democrats consider options on abortion rights https://t.co/QSezHg4LxD https://t.co/Yjw5QfHE45","date":"Fri Jun 24 17:50:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A bill that brings the first major federal gun safety legislation in decades passes a House vote and is on the way to Biden's desk to sign into law. https://t.co/elIRV8Pn4i","date":"Fri Jun 24 17:40:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Read the Supreme Court opinion that has overturned Roe v. Wade eradicating the federal constitutional right to an abortion https://t.co/95Y7FSE9zQ","date":"Fri Jun 24 17:30:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"I'm spitting mad\"\n\nSen. Elizabeth Warren (D-MA) says shares her anger over the Supreme Court overturning #RoevsWade and insists that the ruling is not what America wants.\n\nWatch here: https://t.co/hmAFvbmq1F","date":"Fri Jun 24 17:24:50 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Half of US states could ban abortions as Roe v. Wade is overturned https://t.co/Htitnrouom https://t.co/KhY4qzk6Jm","date":"Fri Jun 24 17:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Biden: The Supreme Court ruling is 'literally taking America back 150 years' https://t.co/COeyFEBWx4 https://t.co/nFl8CM92ge","date":"Fri Jun 24 17:02:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"House Speaker Nancy Pelosi on SCOTUS ruling: “What this means to women is such an insult. It’s a slap in the face to women about using their own judgment to make their own decision about their reproductive freedom.” https://t.co/hf8JRcr6x9 https://t.co/p6owysb7X3","date":"Fri Jun 24 16:45:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"It's official – the Supreme Court has overturned Roe v. Wade, ending some 50 years of precedent on abortion rights. \n\nListen to CNN 5 Things to learn where the justices landed and what this means going forward. https://t.co/ZTPuiFPct7 https://t.co/xsdEviCAcQ","date":"Fri Jun 24 16:30:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has overturned Roe v. Wade, the case that established a constitutional right to have an abortion. At a press conference on Capitol Hill, House Speaker Nancy Pelosi (D-CA) responded to the ruling calling it a \"deadly decision.\"\n\nWatch: https://t.co/p1zaSTgVf4","date":"Fri Jun 24 16:24:44 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Texas Attorney General Ken Paxton has announced that \"abortion is illegal\" now in the state. He also announced the statewide closure of his agency’s offices Friday “in honor of the nearly 70 million unborn babies killed in the womb since 1973”  https://t.co/b0dcBjcghh","date":"Fri Jun 24 16:20:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court's opinion overturning Roe v. Wade could open the door for courts to overturn same-sex marriage, contraception and other rights https://t.co/hDONCL9NON","date":"Fri Jun 24 16:15:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Five justices signed onto the majority opinion, striking down the landmark decision:\n- Clarence Thomas\n- Samuel Alito\n- Brett Kavanaugh\n- Neil Gorsuch\n- Amy Coney Barrett\n\nAnd three justices dissented:\n- Stephen Breyer\n- Sonia Sotomayor\n- Elena Kagan https://t.co/GQcjDcE60y","date":"Fri Jun 24 16:07:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justices Stephen Breyer, Sonia Sotomayor, and Elena Kagan issued a dissenting opinion to the Supreme Court's decision that strikes down Roe v. Wade.\n\nIn their joint opinion, the three justices heavily criticized the majority. https://t.co/xf5KEQWpOA","date":"Fri Jun 24 16:00:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Louisiana Attorney General Jeff Landry has issued a statement saying \"Louisiana’s trigger law banning abortion is now in effect” https://t.co/G7Myyxo4KO","date":"Fri Jun 24 15:52:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A broad majority of Americans did not want to see Roe v. Wade overturned, polling taken before the Supreme Court's decision shows. \n\nHere's a recap of the latest data on the public's views of abortion, from CNN and elsewhere: https://t.co/QUL7K9JRwO","date":"Fri Jun 24 15:45:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has overturned Roe v. Wade, holding that there is no longer a federal constitutional right to an abortion.\n\nHere are key lines from the majority opinion: https://t.co/Woid8VxxEr","date":"Fri Jun 24 15:36:45 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US Supreme Court just overturned Roe v. Wade, holding that there is no longer a federal constitutional right to an abortion.\n\nHere’s a look at the details of the now-overturned case.\n\nhttps://t.co/kRyWCmIqoA","date":"Fri Jun 24 14:57:57 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has ruled on Dobbs v. Jackson Women’s Health Organization, a case centered on a Mississippi law that bars most abortions after 15 weeks of pregnancy, a standard that violates Roe v. Wade.\n\nRead the court’s opinion. https://t.co/psFzYjeApK","date":"Fri Jun 24 14:44:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court overturned Roe v. Wade, eliminating the constitutional right to abortion nationwide https://t.co/iVBvEalvFh","date":"Fri Jun 24 14:17:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In the latest edition of CNN 5 Things, we tell you about the latest January 6 hearing. \n\nThree Trump appointees testified in person yesterday, including the former acting Attorney General, about a high-stakes Oval Office meeting. \n\nListen for details. https://t.co/De2ivPLwH1 https://t.co/VWVkrC0dWk","date":"Fri Jun 24 13:59:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Arthur Ashe may have been most known for his tennis success, but it was his activism that set him apart off the court https://t.co/NFgL0zPXct","date":"Fri Jun 24 13:30:19 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The prisoner, Asadullah Haroon Gul, also known as Haroon Al Afghani, has been detained in the Guantanamo prison since 2007 https://t.co/Tbo5hWC2Y3","date":"Fri Jun 24 13:14:36 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Defending Wimbledon champion Novak Djokovic will face South Korea's Kwon Soon-woo in the opening round as he bids to retain his crown at the All England Club https://t.co/OiRvqbvcYf","date":"Fri Jun 24 12:58:32 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A black bear in Sevierville, Tennessee, died after it got into an unlocked car in search of food, the Tennessee Wildlife Resources Agency said Thursday in a news release https://t.co/k8MWj03EnK","date":"Fri Jun 24 12:43:25 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN legal analyst @JeffreyToobin discusses the possible implications of the Supreme Court striking down a New York gun law enacted more than a century ago that places restrictions on carrying a concealed handgun outside the home.\n\nWatch here: https://t.co/NaUaTbZ6LI","date":"Fri Jun 24 12:39:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For the first time in 30 years, the Senate has passed a major bipartisan gun safety bill. It came the same day that the Supreme Court issued a major ruling on guns, making it easier to access firearms. CNN's @FoxReports has more.\n\nWatch here: https://t.co/TysgOwct6Z","date":"Fri Jun 24 12:35:28 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In new footage Ivanka Trump says she supported the count of every vote in the 2020 election despite Trump's attempt to stop the vote count. @PamelaBrownCNN and @jaketapper break down how her comments differ over time.\n\nWatch here: https://t.co/cLYtBPNqgt","date":"Fri Jun 24 12:10:32 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What do you know about Arthur Ashe beyond his legendary tennis game? Ashe became a symbol of Black excellence in the US and around the world. #CitizenAshe, a new CNN Film, premieres Sunday at 9 p.m. ET/PT https://t.co/wGdN1eYNCH","date":"Fri Jun 24 11:15:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The red flag law permits police to remove firearms from people who are considered a threat to themselves or others. @randikayeCNN speaks to a sheriff in New Mexico who is unwilling to enforce this gun safety law in his county.\n\nWatch here: https://t.co/Oq2Em4K0zv","date":"Fri Jun 24 11:12:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A tiny spacecraft with big implications for lunar exploration is ready to launch 🚀 https://t.co/UVFnUESZIJ","date":"Fri Jun 24 10:49:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Sharon Stone says she has \"lost nine children\" through miscarriages, saying women are made to feel that losing a baby is \"something to bear alone and secretly,\" with a sense of failure https://t.co/HRB0vBbk17","date":"Fri Jun 24 10:32:48 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The settlement amount will be awarded to survivors, families of deceased victims and owners of damaged property https://t.co/Jqk0Uc7mYD","date":"Fri Jun 24 10:16:47 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"This week on Chasing Life, @DrSanjayGupta has a candid conversation with @DrSherryCWang about the rise in anti-Asian hate in the US and its impact on our mental health. \n\nListen to the podcast. https://t.co/OTMbZR3F1e https://t.co/eqT1SLNhjq","date":"Fri Jun 24 10:00:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Only 1 in 4 Americans have \"a great deal\" or \"quite a lot\" of confidence in the high court, according to a Gallup poll https://t.co/uxw78ZaDfP","date":"Fri Jun 24 09:37:53 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A group of hikers filming a reality show were rescued via helicopter from a trail in Phoenix on Thursday due to heat-related illnesses, officials said https://t.co/xymxT2R8U3","date":"Fri Jun 24 09:22:22 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Drinks after work probably seemed like a good idea -- but for one worker in Japan the hangover is likely to last for some time https://t.co/AWX4uSKSqe","date":"Fri Jun 24 09:04:54 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"While ETIAS is not the same as a visa -- it is quicker, done online, and requires no biometric information -- there is still a procedure and a cost to acquiring it, rather like the United States' scheme, ESTA https://t.co/8QgDAyKzKw","date":"Fri Jun 24 08:47:29 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"An Italian company's hacking tools were used to spy on Apple and Android smartphones in two countries, Alphabet's Google said in a new report https://t.co/JfgPPg186O","date":"Fri Jun 24 08:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The latest iteration of Amazon's Alexa voice assistant could sound eerily familiar. https://t.co/oQZvrQ6su0","date":"Fri Jun 24 08:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A movie theater in Oklahoma has removed a warning sign it initially posted about a same-sex kiss in the new Disney/Pixar film \"Lightyear.\" https://t.co/bqSdqmfKnM","date":"Fri Jun 24 07:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Vaccine advisers to the CDC voted to support recommending the two-dose Moderna Covid-19 vaccine for use in people ages 6 through 17 years old. https://t.co/A4XhuaNVMJ","date":"Fri Jun 24 07:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A rare, five-planet alignment will peak on June 24, allowing a spectacular viewing of Mercury, Venus, Mars, Jupiter and Saturn as they line up in planetary order. https://t.co/NBS2EceIIW","date":"Fri Jun 24 06:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Biden administration has proposed strengthening protections for transgender students under Title IX and overhauling controversial Trump-era guidance on how schools should handle sexual assault cases. https://t.co/bSi8IJP2g9","date":"Fri Jun 24 06:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Strikers had called for \"the immediate protection of our indigenist colleagues, Indigenous Peoples and their leaders, organizations and territories,\" and demanded the resignation of FUNAI's president, Marcelo Xavier https://t.co/3na4itVWH5","date":"Fri Jun 24 05:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The bill comes in response to laws in states that allow private citizens to bring civil suits against anyone who assists a pregnant person seeking an abortion in violation of the law https://t.co/su1oA45Ik6","date":"Fri Jun 24 05:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Comedian Khaby Lame has become the king of TikTok -- all without uttering a word https://t.co/7DCYEkJzHj","date":"Fri Jun 24 04:30:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The oil industry pushed for an easing of tensions and a dialing back of finger-pointing from the White House during a meeting with the Energy Department as high gas prices continue to anger politicians and consumers https://t.co/bKqk2hbSb7","date":"Fri Jun 24 04:00:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Biden administration on Thursday rolled out free at-home Covid-19 tests that are designed to be more accessible for people who are blind or visually impaired https://t.co/cP1uX8tCTg","date":"Fri Jun 24 03:30:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The package, which will be drawn from existing Defense Department stocks, also includes 18 patrol boats for monitoring coasts and rivers, and small arms https://t.co/drWa75IZMd","date":"Fri Jun 24 03:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justin Timberlake went viral for the wrong reasons and now he's saying sorry https://t.co/L6xKNijoLn","date":"Fri Jun 24 02:31:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Senate passes bipartisan gun safety bill, a major step for the most significant federal gun legislation in a generation. It next heads to the House. https://t.co/gBN273677m","date":"Fri Jun 24 02:20:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Gloria Estefan didn't end up performing with Jennifer Lopez and Shakira during the Super Bowl LIV halftime show, but she still has some thoughts https://t.co/MRNgTzcf6X","date":"Fri Jun 24 01:27:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"These 150,000 year-old fossil dunes were formed by the wind. They're a stone's throw away from a wetland reserve -- Abu Dhabi's first protected area. https://t.co/45grpUvm08 https://t.co/8TgvFuahJJ","date":"Fri Jun 24 01:02:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The heat, combined with higher prices for electricity, has made it tougher for some Americans to keep the power on. Are you struggling to pay for electricity and air conditioning? Share your story with us. https://t.co/w2mCWY4b2S","date":"Fri Jun 24 00:29:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Americans are cutting back at the gas pump — and not just the amount of fuel they put in their tanks. Consumers are also changing the way they fill their grocery bags. https://t.co/RQw1uVelSS","date":"Fri Jun 24 00:01:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Biologists in Florida just caught an 18-foot long, 215-pound python -- the biggest of its kind ever recorded in the state. https://t.co/O2MalXTu38 https://t.co/ZiQTdppfHP","date":"Thu Jun 23 23:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Predatory lenders are making money off rising gas and food prices https://t.co/SOTvFilT9y","date":"Thu Jun 23 23:28:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justice Clarence Thomas opened the floodgates for all sorts of gun safety laws to be challenged in federal court. https://t.co/6vw36bXL7i","date":"Thu Jun 23 23:15:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After the fifth day of the January 6 hearings, @AdamKinzinger talks to CNN’s @jaketapper about Republicans who sought preemptive pardons following the 2020 election from then-President Donald Trump. https://t.co/I381yAIeJY","date":"Thu Jun 23 23:07:47 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"This company fully restores classic cars -- and converts them to electric. Here's how much a restored Jaguar with electric power will cost you https://t.co/IMF0QKwqFV https://t.co/h5k5Ghh8pC","date":"Thu Jun 23 23:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The CDC says it is investigating \"one of the worst outbreaks of meningococcal disease among gay and bisexual men in U.S. history.\"\n\nThe agency has updated and corrected the total number of cases and deaths in Florida. This tweet replaces a previous post. https://t.co/3AUywwMopm","date":"Thu Jun 23 22:48:27 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A newly discovered bacterium is large enough to be visible to the naked eye, and resembles the shape and size of an eyelash.\n\n\"To understand how gigantic that is for a bacterium, it is the same as if we were to find a human as tall as Mount Everest.\" \nhttps://t.co/mg6UEj0Zvr","date":"Thu Jun 23 22:29:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The first official joint portrait of the Duke and Duchess of Cambridge has been revealed to the public https://t.co/VGzFDk4vAJ","date":"Thu Jun 23 22:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Instagram says its testing new options for users to verify their age on the platform, starting with people in the US https://t.co/NbJrwAFYBc","date":"Thu Jun 23 22:00:19 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Considering a big move this year? You may want to think about Canada or western Europe. https://t.co/C1BfZrwaby","date":"Thu Jun 23 21:45:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Kaitlin Marie Armstrong, the woman suspected of fatally shooting 25-year-old elite cyclist Anna Moriah \"Mo\" Wilson in Texas in May, sold her Jeep to an Austin dealership, the US Marshals Service says.\n\nHere's what we know about the case. https://t.co/L4dIqycriE","date":"Thu Jun 23 21:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Senate Intelligence Committee has advanced legislation that would allow US intelligence agencies to hire applicants who have used marijuana in the past, according to committee aides. https://t.co/sfiRVXgOl5","date":"Thu Jun 23 21:14:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Gun rights advocates celebrated a legal victory today. Meanwhile, gun reform advocates are on the verge of celebrating their own legislative victory. \n\nListen to @ChrisCillizza explain on the CNN Political Briefing podcast. https://t.co/hxYvV6qN94 https://t.co/2NrRDfT1Xf","date":"Thu Jun 23 21:07:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Is Juul going up in smoke? The FDA has ordered the e-cigarette company to remove its products from US markets. CNN Business' @JonSarlin breaks it down on \"Nightcap.\" Watch the full episode: https://t.co/I4FFfSfKnK https://t.co/kfnVbdsR8O","date":"Thu Jun 23 21:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Former Acting Deputy Attorney General Richard Donoghue testifies about notes that he took during a phone call with President Trump about 2020 election fraud claims. Watch: https://t.co/lsyHAwp6JC","date":"Thu Jun 23 20:41:57 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Testimony from a Jan. 6 committee pre-produced video shows top officials eviscerated Justice Dept. lawyer Jeffrey Clark during an Oval Office meeting in Jan. 2021, where Trump considered making Clark attorney general to help overturn the election. Watch: https://t.co/AU9JF4kJLD","date":"Thu Jun 23 20:32:51 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Nike is the latest Western brand to leave Russia https://t.co/vSYWk0XQKX","date":"Thu Jun 23 20:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Netflix is laying off 300 employees in the midst of a rough year for the streaming giant. The layoffs impact around 3% of its workforce.\nhttps://t.co/tbtsdbR2sc","date":"Thu Jun 23 20:16:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"SpaceX is claiming that if federal regulators allow 5G wireless networks to use a certain band of spectrum, it could cause widespread outages for its Starlink internet customers. https://t.co/NKyzkJDwSo","date":"Thu Jun 23 19:57:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Even the littlest children can experience long Covid, according to a large study, one of the first of its kind to include infants and toddlers https://t.co/if5SjAEGkF","date":"Thu Jun 23 19:45:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"EU leaders have agreed to grant Ukraine candidate status in what the European Council President calls a \"historic moment\" on the path to membership in the bloc\nhttps://t.co/3OYGYKvwQy","date":"Thu Jun 23 19:31:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What do you think is behind Texas’ move to the far right? On Friday at 10 p.m. ET, CNN’s Ed Lavandera investigates in the brand-new CNN Special Report – Deep In The Pockets Of Texas. https://t.co/y7EPPijCrW","date":"Thu Jun 23 19:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justice Department officials who rejected requests to investigate baseless claims of voter fraud are set to testify at today’s Capitol riot hearing. Follow live updates here https://t.co/hqDpEP92p7","date":"Thu Jun 23 18:59:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal Reserve Chairman Jerome Powell told lawmakers that aggressive interest rate hikes designed to tame inflation could lift unemployment, saying, \"There is a risk that unemployment will move up, from what is an historically low level though.\" https://t.co/sjw5YD2TSu","date":"Thu Jun 23 18:46:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Several of Trump's closest allies sat for interviews during his final weeks in office with a British filmmaker after being assured they had editorial input over the final product, according to two people familiar with the situation https://t.co/5mM2O1VGzp","date":"Thu Jun 23 18:33:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Warren Buffett's Berkshire Hathaway is betting that the oil boom isn't going to end any time soon https://t.co/HzDI9RL38Q","date":"Thu Jun 23 18:15:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Ukrainian commander Andrii Mogyla shares with CNN's Sam Kiley images revealing new Russian attack plan\n\nWatch here: https://t.co/1LxpAmFD7o","date":"Thu Jun 23 18:06:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":". @DanaBashCNN and @jaketapper discuss new documentary clips released by filmmaker Alex Holder that show Mike Pence receiving an email of a resolution from Congress demanding he invoke the 25th Amendment against President Trump.\n\nWatch here: https://t.co/m2jo3OLpcM","date":"Thu Jun 23 18:03:38 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Newly elected GOP congresswoman spread Capitol riot conspiracies and QAnon hashtags in now-deleted tweets https://t.co/xjart68wDB","date":"Thu Jun 23 18:00:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In never-before-seen footage from filmmaker Alex Holder, former President Donald Trump speaks about the January 6 attack on the Capitol and appears to downplay the actions of his followers.\n\nWatch here: https://t.co/YOJT8k77sl","date":"Thu Jun 23 17:54:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal investigators have searched the home of Jeffrey Clark, a lawyer who Trump sought to install as attorney general in the days before the Capitol riot https://t.co/3oX4HPAgJ4","date":"Thu Jun 23 17:51:34 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"It's called the \"Frenchsicle.\" https://t.co/ADDf9TxjB2","date":"Thu Jun 23 17:45:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Watchdog says State Department and USAID are withholding information on Afghanistan withdrawal https://t.co/OYk1q5F2bL","date":"Thu Jun 23 17:45:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"On Wednesday, nearly a month after the horrific shooting, the school district's police chief was placed on leave https://t.co/9S1Wo5e6GU","date":"Thu Jun 23 17:31:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Biden administration has agreed to cancel an estimated $6 billion in federal student loan debt for about 200,000 borrowers who have claimed they were defrauded by their college. https://t.co/ugsoZcquST","date":"Thu Jun 23 17:16:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"On the front lines of Ukraine's fight against Russia, @bencnn gets a look at US weaponry Ukrainians are using to fire on Russian positions.\n\nWatch here: https://t.co/2TSSAP3F8T","date":"Thu Jun 23 17:13:24 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New footage shows Mike Pence's reaction to a draft resolution demanding that he invoke the 25th Amendment to remove Trump from power days after January 6\nhttps://t.co/WdlRbScJYp","date":"Thu Jun 23 17:09:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"“I have no regrets about what I did…I saw it firsthand.”\n\n@RepFredUpton talks to @DavidAxelrod about voting to impeach President Trump following the January 6 insurrection. Listen to this week's episode of The Axe Files. https://t.co/hfAfOLNKus","date":"Thu Jun 23 17:00:23 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The bipartisan gun safety bill has moved one step closer to final passage in the Senate after a critical vote succeeded in advancing the measure with Republican support. https://t.co/A9oIHkovmg","date":"Thu Jun 23 16:45:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court on Thursday struck down a New York gun law enacted more than a century ago that places restrictions on carrying a concealed handgun outside the home -- an opinion marking the widest expansion of gun rights in a decade https://t.co/YBEKkTwkmM","date":"Thu Jun 23 16:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal prosecutors have asked a federal judge to sentence former Minneapolis police officer Derek Chauvin to 25 years in prison for violating George Floyd's civil rights https://t.co/GoYT4uahGe","date":"Thu Jun 23 16:20:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court issued a major decision that could allow more guns to be carried in public, while the Senate is on the verge of passing the most significant legislation on guns in decades. \n\nListen to CNN 5 Things for the latest on these stories &amp; more. https://t.co/NwOpM0DbAS https://t.co/s6Kfk53wo2","date":"Thu Jun 23 16:05:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal prosecutors asked a judge in a court filing to sentence Ghislaine Maxwell to 30 to 55 years in prison for sex trafficking a minor and other charges related to a sprawling conspiracy to abuse young girls with the wealthy financier Jeffrey Epstein https://t.co/UPNemgExaQ","date":"Thu Jun 23 15:46:30 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Personal finance columnist @SingletaryM believes debt is often the biggest financial issue facing Americans. \n\n\nThis week on Diversifying, she joins @DelyanneMoney to share tips on how we can bounce back from money mistakes. https://t.co/Ygm9B32jOp https://t.co/jOKUZxuhkN","date":"Thu Jun 23 15:30:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The FDA orders Juul Labs to remove all of its vaping devices and pods from the US market https://t.co/wVMQ9WImPs","date":"Thu Jun 23 15:09:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has limited the ability to enforce Miranda rights in a ruling that says suspects who aren't warned about their right to remain silent cannot sue a police officer for damages under federal civil rights law https://t.co/OTRDYAwOhD","date":"Thu Jun 23 14:43:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court strikes down NY concealed handgun law, loosening US gun laws as the country faces a rash of mass shootings https://t.co/yGUsiRWDjc","date":"Thu Jun 23 14:39:43 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The first Black man to win Wimbledon was “skinny and gangly.” Listen to the experts describe the tennis legend’s unique style. #CitizenAshe airs Sunday at 9 p.m. ET. https://t.co/74FhSBxhk3 https://t.co/fv66ppFTr4","date":"Thu Jun 23 14:28:40 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has ruled in favor of a death row inmate who is challenging Georgia's lethal injection protocol and seeks to die by firing squad https://t.co/x1REe0Ok2W","date":"Thu Jun 23 14:26:34 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court has ruled that two Republican leaders of North Carolina's legislature can step in to defend the state's voter ID law even though the state's attorney general, a Democrat, is already doing so https://t.co/nFxjnNZR6m","date":"Thu Jun 23 14:18:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The 30-year fixed-rate mortgage averaged 5.81% in the week ending June 23, edging up from 5.78% the week before, according to Freddie Mac https://t.co/lf9B2wMIfM","date":"Thu Jun 23 14:16:48 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The cuts start in July and amount to about 50 daily flights https://t.co/fICzKjFgxK","date":"Thu Jun 23 14:00:56 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What part of Patagonia are you most excited to see firsthand? Join CNN for unprecedented access to the last great frontier. Patagonia: Life on the Edge of the World premieres Sunday, July 10th at 9 p.m. ET/PT #PatagoniaCNN https://t.co/85e1r0WeWp","date":"Thu Jun 23 13:45:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What would it look like to rebuild from the pandemic in a way that \"promotes equality\"?\n\nCNN convened an international roundtable of policymakers and economists and asked them that question. This is what they said ⬇️ https://t.co/aH1X8mhnlJ","date":"Thu Jun 23 13:00:27 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"One of the men who told former President Trump \"no\" is testifying at today's January 6 committee hearing. Listen to CNN 5 Things for more details on the lineup. \n\nPlus, Uvalde School District Police Chief Pete Arredondo has been put on leave. https://t.co/llaN1oFikz https://t.co/WifBYiovkw","date":"Thu Jun 23 13:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Bobbi Brown, the makeup mogul who pioneered the \"no makeup makeup\" look in the early 90s, is back at it with a new venture https://t.co/AIY0hgSs5v","date":"Thu Jun 23 12:29:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A recent study has found that social stress such as discrimination and family problems, along with job and money problems, can contribute to premature aging of your immune system https://t.co/7vvAm7ESbm","date":"Thu Jun 23 12:12:53 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"American swimmer Anita Alvarez was rescued from the bottom of the pool by her coach after she lost consciousness, according to Reuters https://t.co/lvR0723Xx3","date":"Thu Jun 23 11:55:26 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Ohio State University has officially registered a trademark for the word \"THE\" after a nearly three-year battle to clinch legal branding access to a word that's deeply meaningful to the school's overall identity https://t.co/MfNg7mZUGi","date":"Thu Jun 23 11:39:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"🦠️ Bacteria, viruses, yeast and parasites in your gut? It may sound like the stuff of nightmares, but this collection of microbes is actually a health necessity, experts say.\n\nhttps://t.co/19u7rOHqd3","date":"Thu Jun 23 11:23:29 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Rep. Don Bacon (R-NE), who earned Trump's endorsement in 2020 tells CNN's @mkraju that Trump was wrong to pressure election officials to overturn the 2020 election and that he will not support him in the 2024 primary if Trump enters the race.\n\nWatch here: https://t.co/u5qqEd8HKF","date":"Thu Jun 23 11:13:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here's what to watch out for in Thursday's January 6 committee hearing https://t.co/75OQafm9LS","date":"Thu Jun 23 11:08:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Bruton Smith, a longtime fixture in NASCAR and a Hall of Fame inductee for building and promoting auto racing events nationwide, died Wednesday at age 95 of natural causes, according to a statement from track operating company Speedway Motorsports https://t.co/Jjz9KxUE3h","date":"Thu Jun 23 10:52:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Cherelle Griner, the wife of detained WNBA star Brittney Griner, has urged President Joe Biden to speak to her and her family https://t.co/YVCpXT9ejU","date":"Thu Jun 23 10:34:42 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A third 'My Big Fat Greek Wedding' movie is finally in production https://t.co/zDT4hYFvRp","date":"Thu Jun 23 10:17:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Since 2020, there've been more than 10K reported incidents of anti-Asian hate. That's why Muay Thai boxer, Jess Ng, teaches APPI women self-defense. \n\nThis week on Chasing Life, @DrSanjayGupta joins Jess' class in NYC. https://t.co/TFTaKSyVLm https://t.co/n2OzFzynC5","date":"Thu Jun 23 10:00:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Six people were killed after a helicopter crashed in Logan County in southwest West Virginia on Wednesday evening, according to authorities https://t.co/AHohWy0YPt","date":"Thu Jun 23 09:45:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Trumpet the bloodhound was crowned the Best in Show winner at the 146th Westminster Kennel Club Dog Show  https://t.co/DSdGdm7Nzj","date":"Thu Jun 23 09:30:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A Manhattan jury found the man who drove his car onto bustling sidewalks of Times Square in 2017 is not responsible for the attack because he was suffering from mental illness, according to the Manhattan District Attorney's office https://t.co/fEDbFHOjK6","date":"Thu Jun 23 08:45:24 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A 24-year-old woman used Grubhub to contact police while she was allegedly being held hostage in the Bronx over the weekend, according to a criminal complaint. https://t.co/cGF201l3ci","date":"Thu Jun 23 08:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After a two-year break due to the pandemic, massive crowds will return to the fields of the English countryside for the Glastonbury Festival. The diverse lineup of artists performing this year span musical genres and generations. https://t.co/xmhfm7EphF","date":"Thu Jun 23 08:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"They've traveled to some of the world's most remote places. Now UK adventurers Hugo and Ross Turner, also known as the Turner Twins, are heading off on a brand new adventure — a 100% emission free expedition to the Atlantic Point of Inaccessibility. https://t.co/5LPZ6jfSLL","date":"Thu Jun 23 07:31:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Hand axes unearthed from a riverbed in the county of Kent in southeast England have revealed one of the earliest known Stone Age communities in northern Europe https://t.co/fAnVsSzrF6","date":"Thu Jun 23 07:01:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"JPMorgan Chase is laying off employees this week in response to the spike in mortgage rates that has rocked the housing market https://t.co/xv4RtY4OZd","date":"Thu Jun 23 06:31:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In an unprecedented move, federal officials have signed an agreement to collectively manage the more than 1.3 million acres of Utah's Bears Ears National Monument with five Native American tribes https://t.co/B9ug2hOUFR","date":"Thu Jun 23 06:01:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Facts First: It is not true that \"all\" of Oz's former competitors have endorsed him. He has been endorsed by three of the four other major candidates from the May primary, but not by third-place Kathy Barnette, who received about 24.7% of the vote. https://t.co/TFkZTMi1Bu","date":"Thu Jun 23 05:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A super PAC is looking to funnel millions of dollars behind an independent candidate in the race to succeed retiring Sen. Roy Blunt, as conservatives worry over disgraced ex-Gov. Eric Greitens potentially winning the GOP nomination later this summer https://t.co/amB3pBUIpa","date":"Thu Jun 23 05:00:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Calls for violence against members of the January 6th committee are circulating on some of the same online platforms that helped fuel the lies that led to the insurrection, a new analysis has found https://t.co/AhNTCnw0o9","date":"Thu Jun 23 04:31:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Archaeologists say they have discovered one of the largest Anglo-Saxon burial grounds ever uncovered in Britain during excavations ahead of a high-speed rail project. https://t.co/VBC3z37GCI https://t.co/tJ3cixZt5J","date":"Thu Jun 23 04:16:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The earthquake that struck eastern Afghanistan is the country's deadliest in decades and comes at a time when the Taliban-led nation faces a hunger and economic crisis.\n\nAid groups are providing assistance to the impacted areas. Here are ways you can help. https://t.co/YBz51w2xTf","date":"Thu Jun 23 04:01:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Russian intelligence agencies have increased their efforts to hack US and allied government computer networks to gather intelligence since the war in Ukraine began, Microsoft says in newly published findings https://t.co/CqQEO3TYNA","date":"Thu Jun 23 03:46:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The doyenne of domesticity shared on her verified Instagram account that she had planned to host a garden party on behalf of her \"favorite skincare line.\"\n\n\"But I'm sad to report that I tested positive for Covid-19,\" Martha Stewart wrote. https://t.co/kwB54EPduO","date":"Thu Jun 23 03:31:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Consumers don't receive the full benefit of gas tax holidays, according to a recent analysis by the nonpartisan Penn Wharton Budget Model, which looked at suspensions in 3 states through mid-May. Instead, they have to share the savings with gas suppliers. https://t.co/u8rL5e1YzB","date":"Thu Jun 23 03:16:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New York City leaders have demolished close to 100 motorbikes and ATVs, sending a message they are cracking down on dangerous, illegal vehicles https://t.co/AavSLYdCLf https://t.co/3Hmfoqpwvu","date":"Thu Jun 23 03:01:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Democratic Party leaders are meeting this week to hear pitches from 16 states and Puerto Rico, which want to hold the first presidential nominating contests in 2024, as the party moves forward with reevaluating its primary schedule https://t.co/AntsSGlahM","date":"Thu Jun 23 02:46:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The first day of Prince Charles' visit to Rwanda was heavily focused on learning more about the massacres nearly three decades ago https://t.co/Zpv4TQZDY6","date":"Thu Jun 23 02:31:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"PGA Tour commissioner Jay Monahan told reporters prize money at eight regular season tournaments will be increased, an announcement that comes on the heels of several big-name golfers leaving the tour for the controversial Saudi-backed LIV Golf Series https://t.co/zXdm8xUD6a","date":"Thu Jun 23 02:16:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Justice Department issues subpoena to the Georgia Republican Party chairman and others as it expands probe into former President Donald Trump's 2020 fake elector scheme. https://t.co/bJqeB0AmOE","date":"Thu Jun 23 02:03:50 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Do you have a favorite moment from United Shades of America? @WKamauBell shows you how uncomfortable conversations can create change on a new season of #UnitedShades starting Sunday, July 10th at 10 p.m. ET/PT https://t.co/VBIjuU0A2D","date":"Thu Jun 23 02:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Derrick Evans only served as a West Virginia state legislator for 40 days, but will spend 90 days in jail for his role in the January 6, 2021, US Capitol riot https://t.co/KRzhT9imQU","date":"Thu Jun 23 01:46:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"These subpoenas have real teeth.\" @eliehonig reacts to a new report that federal agents issued subpoenas to people in multiple states as part of the January 6 investigation. https://t.co/kIferCZJFR","date":"Thu Jun 23 01:41:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Zoo Atlanta closed early on Wednesday and will close early again on Thursday because of extremely high heat indexes, the zoo announced on its website https://t.co/qKVfkBVUIB","date":"Thu Jun 23 01:31:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"French President Emmanuel Macron has called for a \"different\" method of governing in France in his first public comment following Sunday's parliamentary elections https://t.co/nLCGq6DB1e","date":"Thu Jun 23 01:16:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"Why are we still paying so much for gas?\" @petemuntean speaks with drivers who are frustrated by Washington's slow response on how to deliver relief at the gas pump. https://t.co/53J3Kpo7SO","date":"Thu Jun 23 01:09:37 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Omicron subvariants BA.4 and BA.5 appear to escape antibody responses from vaccination and past infection, new research suggests.\n\nHowever, vaccination is still expected to provide substantial protection against severe disease. https://t.co/zFheNTLRB5","date":"Thu Jun 23 01:01:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Yellowstone National Park's south loop has reopened in a limited capacity, a little more than a week after historic rainfall and flooding shuttered all the park's entrances https://t.co/RgSISwhPew","date":"Thu Jun 23 00:46:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal Reserve Chairman Jerome Powell said there is a risk that the Fed's aggressive interest rate hikes cause an economic downturn in the US. @MattEganCNN reports. https://t.co/mHaK5mjZBt https://t.co/Umihei0URa","date":"Thu Jun 23 00:31:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Tony Siragusa, the former NFL defensive tackle who later worked as a sideline analyst, has died at age 55. https://t.co/VBxJ9p0w8Q","date":"Thu Jun 23 00:29:43 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"House Oversight Committee Chairwoman Carolyn Maloney charged in a hearing on Tuesday that Washington Commanders owner Dan Snyder \"himself fostered\" the football team's \"toxic workplace\" and then \"conducted a shadow investigation to target his accusers\" https://t.co/saS5IoGNiQ","date":"Thu Jun 23 00:16:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @kileycnn reports from Kharkiv, Ukraine, where Ukrainian defense forces say Russia is preparing to launch an assault. Watch: https://t.co/MmZG31ezLc","date":"Thu Jun 23 00:05:59 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden has called on Congress to suspend federal gasoline and diesel taxes until the end of September, framing the move as necessary to provide relief to American consumers but itself not enough to resolve the problem of surging energy prices. https://t.co/228NhdJr1J https://t.co/6W0PkffXa7","date":"Thu Jun 23 00:01:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Nicholas John Roske, the man charged with attempting to murder Supreme Court Justice Brett Kavanaugh, has pleaded not guilty in a Maryland federal court https://t.co/UUcFUl6bD5","date":"Wed Jun 22 23:46:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Amazon has unveiled its first fully autonomous mobile robot that can move heavy carts and work safely alongside humans. It says the robot will help address safety concerns, but it comes as the company faces a labor crisis and several unionization efforts. https://t.co/YecDEsx8pL https://t.co/UA13ndAVXE","date":"Wed Jun 22 23:31:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Spectacular fireworks and incredible music from some of the biggest stars. Celebrate The Fourth in America, Live July 4th at 7 p.m. ET. Only on CNN https://t.co/vdcFAL6vTm","date":"Wed Jun 22 23:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Uvalde School District Chief of Police Pete Arredondo is placed on leave as investigations continue into massacre response, superintendent says. https://t.co/kK64Bg8iMY","date":"Wed Jun 22 23:03:39 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Russia's President Vladimir Putin said the country is rerouting trade to \"reliable international partners\" such as Brazil, India, China and South Africa as the West attempts to sever economic ties https://t.co/xkQ7WpUnCR","date":"Wed Jun 22 23:01:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Voters in Georgia are split after four days of public hearings from the House select committee investigating January 6. CNN's Jeff Zeleny reports how Democrats and Republicans reacted to witnesses' testimony before the panel. Watch: https://t.co/w5VTrrlpJZ","date":"Wed Jun 22 22:37:49 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Beyoncé’s new single, “Break My Soul,” begs listeners to “release” themselves from their 9-5 https://t.co/yCJIjg1PIj https://t.co/zPCnl3uqRN","date":"Wed Jun 22 22:31:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"30 million Americans in 15 states are under heat alerts and sweltering, triple-digit temperatures are expected in swaths of the South https://t.co/v5bwf9tvFD","date":"Wed Jun 22 22:12:56 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Democratic Senator Elizabeth Warren urged Federal Reserve Chairman Jerome Powell to proceed with rate hikes cautiously and avoid setting off a recession that costs millions of jobs. https://t.co/iGEqsbHfuq https://t.co/xQKPOjcpr3","date":"Wed Jun 22 22:01:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The House select committee investigating the January 6 Capitol Hill insurrection is preparing to delay its next round of hearings into July, the committee's chairman, Democratic Rep. Bennie Thompson of Mississippi, said https://t.co/4ivqNdZdiM","date":"Wed Jun 22 21:47:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"This giant stingray is believed to be the world's largest freshwater fish. It was captured, electronically tagged and released in Cambodia's Mekong river, according to Reuters https://t.co/ZmvbQEyk0n https://t.co/4d5qOIKiwz","date":"Wed Jun 22 21:46:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A special session demanded by Wisconsin's Democratic governor was opened and immediately closed by the state's Republican-led Legislature, which is refusing to repeal a 19th century abortion ban that remains on the books https://t.co/6AWHE7MfVw","date":"Wed Jun 22 21:45:19 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Georgia’s Supreme Court overturned the murder conviction of a father whose son died after he left him in a hot car.\n\nListen to CNN 5 Things for details about the court’s decision, President Biden’s latest plan to lower gas prices, and other top stories. https://t.co/fMRoGKNRVX","date":"Wed Jun 22 21:30:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"UK health officials are urging people who may not be up to date on their polio shots to get vaccinated after poliovirus was found during routine surveillance of London sewage samples https://t.co/wl6xkub4no","date":"Wed Jun 22 21:16:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After a two-year break due to the pandemic, massive crowds will return to the fields of the English countryside for the Glastonbury Festival. The diverse lineup of artists performing this year span musical genres and generations. https://t.co/iJei1NUkQa","date":"Wed Jun 22 21:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"House Republican leaders are lining up in opposition to a recently unveiled bipartisan gun safety bill and plan to urge their members to vote \"no,\" even as the Senate moves toward passage of the bill this week https://t.co/TodDC7Xqvd","date":"Wed Jun 22 20:49:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Former Trump WH press secretary Stephanie Grisham and former federal prosecutor Renato Mariotti react to the ongoing Jan. 6 investigation, including conflicting statements from Ivanka Trump concerning former President Trump's, election lies. Watch: https://t.co/yIWl3ZG5eY","date":"Wed Jun 22 20:47:40 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Move over, GameStop and AMC. And forget about bitcoin and other cryptocurrencies. Revlon, the struggling makeup and cosmetics company that filed for bankruptcy last week, is the latest meme stock craze among the army of individual investors on Reddit. https://t.co/Y8hdrKxhRV","date":"Wed Jun 22 20:46:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Federal Reserve Chairman Jerome Powell said there is a risk that the Fed's aggressive interest rate hikes cause an economic downturn in the United States. CNN's @MattEganCNN reports. Watch: https://t.co/DfAp4ouoM1","date":"Wed Jun 22 20:33:36 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"US retirees have some advice for their younger selves, and by extension anyone who has yet to retire: Save more. Save earlier. Make a financial plan for retirement. And don't forget to account for taxes and inflation — they'll hit harder than you expect. https://t.co/tNnQPFXwVK","date":"Wed Jun 22 20:31:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For years, Kellogg's has been synonymous with Froot Loops, Frosted Flakes, Special K and other cereals. Now, it's focusing on snacks. https://t.co/AlhLk6yh7x","date":"Wed Jun 22 20:16:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New York City leaders have demolished close to 100 motorbikes and ATVs, sending a message they are cracking down on dangerous, illegal vehicles https://t.co/Dnp24enjXk https://t.co/U76GofSibY","date":"Wed Jun 22 20:01:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The city of Brooklyn Center, Minnesota, has agreed to pay $3.25 million to the family of Daunte Wright, a Black man who was killed by police during a traffic stop last year, attorneys for his family said https://t.co/cKqC55QoMD","date":"Wed Jun 22 19:52:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"They've traveled to some of the world's most remote places. Now UK adventurers Hugo and Ross Turner, also known as the Turner Twins, are heading off on a brand new adventure — a 100% emission free expedition to the Atlantic Point of Inaccessibility. https://t.co/xQnBMNaECV","date":"Wed Jun 22 19:46:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Pro-journalist and free speech non-government organization Reporters Without Borders says it has evidence that Russian soldiers executed journalist Maks Levin in a forest near Kyiv on March 13 https://t.co/aM6QgL8q7A","date":"Wed Jun 22 19:39:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here’s a look back at Arthur Ashe’s life in photos. The tennis legend protested in front of the White House, danced with Billie Jean King and met with Nelson Mandela. \n\nThe new CNN Film #CitizenAshe airs Sunday at 9 p.m. ET/PT \nhttps://t.co/rTcFRqVxJb https://t.co/ZhrUatrr3O","date":"Wed Jun 22 19:30:22 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"From California to the Great Plains and into the Southeast, 30 million Americans in 15 states are under heat alerts https://t.co/FJ2cPZb5cP","date":"Wed Jun 22 19:26:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Joe Biden appealed directly to gas companies to lower their prices to give relief to Americans. During his speech, he also called on Congress to suspend gas taxes for three months. Watch: Watch: https://t.co/tknlwqrqxz","date":"Wed Jun 22 19:16:36 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"John Wood, a senior investigator for the House select committee investigating the January 6 insurrection, is leaving his position this week, which is earlier than expected, according to a source familiar https://t.co/i6ugOltpPq","date":"Wed Jun 22 19:16:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"India is an experiment that is failing dangerously\" says Arundhati Roy | Opinion https://t.co/u7kchEKWVW","date":"Wed Jun 22 19:13:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Westminster Kennel Club Dog Show is afoot.\n\nSo far, four finalists have been picked. They'll be joined by three others for tonight's finale, where one outstanding canine will be crowned Best in Show. https://t.co/FGRzIXKnvD","date":"Wed Jun 22 19:09:44 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden's call for Congress to suspend federal gasoline and diesel taxes will likely land on empty in the Senate.\n\nEven if he can get all 50 Democratic senators behind the legislation, he would still need 10 Republicans to join the cause. https://t.co/6A9zRu9Q6J","date":"Wed Jun 22 19:01:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"Their testimony was vital because it highlighted the courage that is sometimes necessary to defend democracy from tyranny and repression\" writes Stephen Collinson | Analysis https://t.co/yUTQouMObH","date":"Wed Jun 22 18:59:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A high school principal in Pennsylvania has been charged with 30 counts of sexual intercourse and contact with a student, according to court documents filed Monday https://t.co/5bsnd5Modf","date":"Wed Jun 22 18:50:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden calls for a federal gas tax holiday as he searches for solutions to soaring prices, but it faces long-shot odds of getting through Congress https://t.co/aMa6yTjDlA","date":"Wed Jun 22 18:46:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Hand axes unearthed from a riverbed in the county of Kent in southeast England have revealed one of the earliest known Stone Age communities in northern Europe https://t.co/udlxHVlB8K","date":"Wed Jun 22 18:31:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Berlinda Irene Arreola, the grandmother of Uvalde shooting victim Amerie Jo Garza, explains why she's calling for the resignation of Uvalde school district police chief and city councilmember Pedro \"Pete\" Arredondo. Watch: https://t.co/hVlkJXUPcu","date":"Wed Jun 22 18:27:28 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There's good news and bad news on the gas prices front. Good news: Some price relief could be on the way. The bad news: It's because traders are betting on a recession. https://t.co/m8CVf5XB89","date":"Wed Jun 22 18:16:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"We know what we need to do to get a good night's rest and yet we're still terrible at it. Mount Sinai's sleep expert, Dr. Neomi Shah, breaks down five surprising things we're getting wrong about sleep. https://t.co/ktq9BfeiG4 https://t.co/z7TvzkZkuo","date":"Wed Jun 22 18:01:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Michael J. Fox will be honored by the Academy of Motion Pictures Arts and Sciences for his contributions to film and his efforts to help cure Parkinson's disease https://t.co/198VK9qwNU","date":"Wed Jun 22 17:54:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A report that the FDA might order Juul to pull its products from store shelves has sent shares of Altria plunging. The cigarette company owns a 35% stake in Juul. https://t.co/V9oqQHVTic","date":"Wed Jun 22 17:46:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"GOP Sen. Kevin Cramer of North Dakota said he injured his right hand doing yard work and required immediate surgery, which may result in amputation of his finger https://t.co/sbanq83bT6","date":"Wed Jun 22 17:40:20 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"I am pro-life and have never hidden from that fact.\"\n\nLouisiana's Democratic governor has signed a bill that will toughen an abortion ban that is ready to be implemented in the event that the Supreme Court overturns Roe v. Wade. https://t.co/RGJkQtuoPz","date":"Wed Jun 22 17:31:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Ukraine's defense of Lysychansk — the last city in the Luhansk region it still holds — just became a lot more tenuous https://t.co/5fiMxFHS92","date":"Wed Jun 22 17:16:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The NYC Rent Guidelines Board has given the green light to allow landlords in New York City to hike rents on more than one million rent stabilized apartments https://t.co/DcH6DUSf2J","date":"Wed Jun 22 17:01:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What are the downsides of a potential gas tax holiday? \n\nListen to CNN 5 Things to learn more about President Biden's plans to call on Congress for a three-month reprieve. Plus, catch up on other top stories of the day. \n\nhttps://t.co/Qkl4hOXke9 https://t.co/ATQQF1zCdd","date":"Wed Jun 22 16:52:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"You know what's worse than high inflation and low unemployment? It's high inflation with a recession and millions of people out of work,\" Sen. Warren said, urging caution on rate hikes. \"I hope you consider that before you drive this economy off a cliff.\" https://t.co/PowwKEfT4m","date":"Wed Jun 22 16:46:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"FedEx delivered its biggest daily stock jump since the mid-1980s last week, surging over 14% on June 14 after doing two relatively easy things: increasing its dividend 53% and reaching a deal with an activist shareholder to bring on some new board members https://t.co/JDH5XoOic3","date":"Wed Jun 22 16:31:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A group of drivers for Uber and Lyft has accused the companies of unfairly controlling how much passengers are charged for rides in an antitrust lawsuit in California state court https://t.co/JdiUpLCQoN","date":"Wed Jun 22 16:15:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Join us today at 2 p.m. ET for a special #CitizenCNN on “Championing Justice: Athletes &amp; Social Movements” featuring @TheLauraCoates, @AnsonCarterLA, and @JaszThomas. \n\nRSVP at https://t.co/9zhIQ4nfIv https://t.co/MJ14DH0gTy","date":"Wed Jun 22 16:00:27 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Georgia’s highest court has overturned the murder conviction of Justin Ross Harris, the father sentenced to life without parole for the 2014 hot car death of his 22-month-old son, Cooper.\nhttps://t.co/YUe6pCIs4r","date":"Wed Jun 22 15:45:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Baltimore Ravens outside linebacker Jaylon Ferguson has died, the NFL team announced on Wednesday. He was 26.\nhttps://t.co/RScsIsX6aV","date":"Wed Jun 22 15:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Mayim Bialik has tested positive for Covid-19 and says it’s been rough.\nhttps://t.co/g0BGppJKb7","date":"Wed Jun 22 15:15:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Even as a kid, personal finance columnist @SingletaryM was a saver who believed in helping others. Now she has a “Family and Friends Fund” so she can help her loved ones without breaking the bank. \n\n\nHear more about how she saves and how you can too. https://t.co/jV01Tc7Xgk","date":"Wed Jun 22 15:00:22 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"European countries are seeing a significant increase in Covid-19 cases spurred by highly infectious subvariants of Omicron, raising fears of a new global wave of the disease as immunity declines and the summer travel season gets underway.\nhttps://t.co/9H5rB0qMeN","date":"Wed Jun 22 14:45:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Chief Justice John Roberts has been laying the groundwork for years for Tuesday’s sweeping decision requiring states to fund religious education.\nhttps://t.co/ZUKs7QEji0","date":"Wed Jun 22 14:30:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"If the Supreme Court issues a ruling that would allow states to ban abortion, such a decision would raise new questions about how authorities would enforce such bans\nhttps://t.co/3csHkmGEvX","date":"Wed Jun 22 14:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Former NBA player Caleb Swanigan died aged 25 on Monday night, his college basketball team Purdue announced.\nhttps://t.co/pU0nHyZSJQ","date":"Wed Jun 22 14:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Obamas are heading to Audible.\nhttps://t.co/AEgpLF83yb","date":"Wed Jun 22 13:45:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The South Dakota state Senate voted to convict and remove state Attorney General Jason Ravnsborg from office on two articles of impeachment\nhttps://t.co/eVjPwLXEmD","date":"Wed Jun 22 13:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Euphony does away with the need for a personal headset. Instead, speakers are installed in each individual seat's headrest, with sound levels perfected so passengers can enjoy their choice of inflight entertainment without being overheard. \nhttps://t.co/0QmNOIbBu2","date":"Wed Jun 22 13:15:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"More than 1,000 people have been killed and at least 1,500 injured in Afghanistan after an earthquake struck the country's eastern region. Follow live updates here: https://t.co/E4QZ5L7GD9","date":"Wed Jun 22 13:13:25 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden plans to announce his support for a federal gas tax holiday - listen to CNN's 5 Things podcast for more details. \n\nPlus, at least 1,000 people have died after an earthquake struck Afghanistan. https://t.co/fhivlgS3n8 https://t.co/zTykGb2nrh","date":"Wed Jun 22 13:07:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The red-hot housing market is starting to show signs of cooling off.\nhttps://t.co/RIpYS1EM9h","date":"Wed Jun 22 13:01:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"The string of defeats these media outlets have suffered indicate that these lawsuits have some teeth to them,\" writes Oliver Darcy | Analysis\nhttps://t.co/I9ub8DMKXX","date":"Wed Jun 22 12:57:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Kraft Macaroni and Cheese is changing its name after 85 years https://t.co/jY0Ipc0Md7","date":"Wed Jun 22 11:35:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Red Bull Racing has suspended junior driver Juri Vips after he used a racial slur during a live gaming stream https://t.co/Kn2j14PWrx","date":"Wed Jun 22 11:16:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What is going on in Texas right now? CNN’S Ed Lavandera delves deep into the state’s far right political scene in the new CNN Special Report – Deep In The Pockets Of Texas. Friday at 10 p.m. ET https://t.co/3q2n2G0J4E","date":"Wed Jun 22 11:00:22 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Serena Williams marked her return to tennis after a year-long absence with victory alongside Tunisia's Ons Jabeur in the women's doubles at the Eastbourne International https://t.co/zrfr0Z0FrC","date":"Wed Jun 22 10:46:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There is growing frustration among the families of Americans detained abroad who feel that President Joe Biden must act to ensure the quick release of their loved ones https://t.co/nlR7q8YToD","date":"Wed Jun 22 10:30:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Cleveland Browns quarterback Deshaun Watson has reportedly settled 20 of the 24 civil lawsuits brought by women accusing him of misconduct, including several allegations of sexual assault and harassment.\nhttps://t.co/OjuyX5XU2h","date":"Wed Jun 22 10:15:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Martial arts fighter Jess Ng found her strength in the boxing ring. Now, as anti-Asian hate escalates across the country, she's teaching other Asian women to do the same. \n\nHear her conversation with @DrSanjayGupta on this week's episode of Chasing Life. https://t.co/Xo6KZFAiNU","date":"Wed Jun 22 10:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Los Alamos County, New Mexico, has been ranked the healthiest US community for the third year in a row https://t.co/q8RIiyiE8N","date":"Wed Jun 22 09:22:52 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here are four takeaways from Tuesday’s primaries and runoffs in Alabama, Georgia, Virginia and Washington, DC:\nhttps://t.co/euDFe1YDgO","date":"Wed Jun 22 09:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A total of 29 Chinese warplanes entered Taiwan’s self-declared air defense identification zone, according to the island’s Defense Ministry.\nhttps://t.co/ivFk92EN9h","date":"Wed Jun 22 08:45:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Nepal is considering relocating Everest Base Camp due to environmental concerns.\nhttps://t.co/99eLzDapIz","date":"Wed Jun 22 08:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Taiwan accused China of bullying after organizers of the World Cup in Qatar again changed the reference for Taiwanese visitors applying for an identification card that doubles as an entry visa to list their nationality as “Chinese Taipei”.\nhttps://t.co/F6JVCNRGCS","date":"Wed Jun 22 08:15:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The United States banned all goods produced in China’s western Xinjiang region, following the enactment of a forced labor law signed by President Joe Biden last year.\nhttps://t.co/1ollkgA40K","date":"Wed Jun 22 08:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The House select committee unveiled new information showing the role that Wisconsin Republican Sen. Ron Johnson played in pushing “fake” electors for then-President Donald Trump on January 6, 2021.\nhttps://t.co/ykHRJGdIaU","date":"Wed Jun 22 07:45:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Millions of people across India and Bangladesh have been affected by raging floods and landslides that left more than 100 people dead and entire communities devastated.\nhttps://t.co/FTc0gAx1i4","date":"Wed Jun 22 07:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Want to future-proof your home from rising sea levels? Make it float. https://t.co/h4PPzByf7i https://t.co/Bq6S4Js7JH","date":"Wed Jun 22 07:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"One conservation photographer hopes his intimate portraits of the bird will help others to \"fall in love with flamingos\" and inspire them to care about the wetlands where they live. https://t.co/GBwkI3XDpW","date":"Wed Jun 22 06:30:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Archaeologists say they have discovered one of the largest Anglo-Saxon burial grounds ever uncovered in Britain during excavations ahead of a high-speed rail project. https://t.co/d3eiRid7yy https://t.co/uUThJTSSfl","date":"Wed Jun 22 06:00:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The initiative is part of the Ivy League school's \"The Call to Lead\" leadership campaign, and will begin starting June 23 for the summer 2022 term, the university said https://t.co/mXqNUgxifP","date":"Wed Jun 22 05:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Imagine running a marathon every day... for 104 days in a row. Earlier this year, amputee ultrarunner Jacky Hunt-Broersma did just that. https://t.co/DTY4fw0jDM https://t.co/0szA6aenDW","date":"Wed Jun 22 05:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A review of New Mexico’s Hermits Peak Fire found that US Forest Service errors during a routine prescribed burn contributed to the largest wildfire in New Mexico history https://t.co/Ocol7hXv7F","date":"Wed Jun 22 05:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Attorneys of the man accused of driving an SUV through a Christmas parade in Waukesha, Wisconsin, changed his plea in court Monday, saying mental health issues played a role in the crash https://t.co/jFw4Mv6J5e","date":"Wed Jun 22 04:45:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Vitamin, mineral and multivitamin supplements aren't likely to protect you from cancer, heart disease or overall mortality, the US Preventive Services Task Force said in updated guidelines released Tuesday in the journal JAMA. https://t.co/As1DATvX7r","date":"Wed Jun 22 04:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Home to the world's tallest building and the world's deepest pool, Dubai is a hub for the spectacular. Now a number of the emirate's eateries have been awarded Michelin stars -- a first for the Middle East. https://t.co/hmOjnUryPq","date":"Wed Jun 22 04:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A visitor center will open next to the iconic Stonewall Inn to honor and preserve the history of the fight for LGBTQ rights, the nonprofit Pride Live announced https://t.co/TAYlDu9KAI","date":"Wed Jun 22 03:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"This mobile robot can reserve parking spots and then charge your EV https://t.co/6stTW4i1JE https://t.co/XhawtOGTQl","date":"Wed Jun 22 03:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN’s @mkraju presses Senator Ron Johnson (R-WI) about his involvement in pushing “fake” Trump electors after the January 6 committee released texts between his office and former Vice President Mike Pence’s staff. https://t.co/8IDdPWNLOQ","date":"Wed Jun 22 03:11:43 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A stingray that weighed in at 661 pounds and took around a dozen men to haul to shore was caught in the Mekong River in Cambodia. Researchers say it’s the world’s biggest freshwater fish ever recorded. https://t.co/TKFAsZ1ywq https://t.co/kBjnKlgKs3","date":"Wed Jun 22 03:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Republican Rep. Mayra Flores of Texas on Tuesday became the first Mexican-born woman to be sworn in to Congress. https://t.co/lQtzM3LdEp","date":"Wed Jun 22 02:55:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"“Words that would make her father very happy”: NYT reporter Maggie Haberman reports on Ivanka Trump’s statements in an upcoming documentary that seem to differ from other statements she made about the 2020 election. https://t.co/P7GXu67vz5","date":"Wed Jun 22 02:30:20 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The CDC recommended two options for this age group. Parents and caregivers may be wondering which one is right for their child https://t.co/iOn7nZwpiH","date":"Wed Jun 22 02:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Tesla is moving ahead with plans to layoff about 10% of its salaried staff, CEO Elon Musk said Tuesday. But he also expects the company's overall workforce will be larger a year from now than it is today. https://t.co/uBvEDGuO1N","date":"Wed Jun 22 02:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Two elderly Jesuit priests were among three people killed Monday inside a church in northern Mexico https://t.co/6WeozMTg4Z","date":"Wed Jun 22 01:30:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Georgia election worker Wandrea “Shaye” Moss told the Jan. 6 committee how her life has been affected after Trump and Giuliani alleged she and her mother committed election fraud and exchanged a USB drive in a video. Moss testified that her mother was handing her a ginger mint. https://t.co/Af9qHQbIpm","date":"Wed Jun 22 01:30:00 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Another election day in Georgia has brought a further round of defeats for former President Donald Trump and his chosen Republican candidates. https://t.co/90Oa4X9HiG","date":"Wed Jun 22 01:28:39 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Rep. Jamie Raskin (D-MD) says evidence may require additional January 6 hearings. On being open to hearing from Sen. Ron Johnson (R-WI), he added, \"the organized hit on the election implied the collection of these counterfeit electors.\" https://t.co/CU0Cnv1671","date":"Wed Jun 22 01:25:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Co-sleeping under any circumstances is not safe for infant sleep, the American Academy of Pediatrics stressed Tuesday in the first update to its safe sleep guidelines for babies since 2016. https://t.co/Cq1TFszwxt","date":"Wed Jun 22 01:00:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Join us Wednesday at 2 p.m. ET for a special #CitizenCNN on “Championing Justice: Athletes &amp; Social Movements” featuring @TheLauraCoates, @AnsonCarterLA, and @JaszThomas. \n\nRSVP at https://t.co/ksJLZt6z0w https://t.co/djUXjstQUv","date":"Wed Jun 22 00:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Biden administration signaled Tuesday that it will develop a proposed rule to establish a maximum nicotine level in cigarettes and other tobacco products that will essentially lower the amount of nicotine in products available in the US. https://t.co/6Kgzvhiom6","date":"Wed Jun 22 00:20:24 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The daughter of Vietnamese refugees, Bee Nguyen would become the first Asian American elected to a statewide political post in Georgia, should she prevail in the fall. https://t.co/jm7CxHzY8z","date":"Wed Jun 22 00:05:25 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Are you triggered by stories about police brutality or anti-Asian violence? \n\nPsychologist @DrSherryCWang talks to @DrSanjayGupta about how racist violence haunts all people of color in this country. \n\nListen to this week's episode of Chasing Life. https://t.co/J210BtimWI","date":"Wed Jun 22 00:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The shape of the November midterm elections will come into clearer view Tuesday, as Alabama Republicans all but anoint their next US senator, and contests in Virginia and Georgia set the stage for matchups that could decide control of the US House https://t.co/MWKhaQqa8Q","date":"Tue Jun 21 23:48:25 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Americans are feeling the heat at the gas pump, but that won't keep them in park, AAA predicts. https://t.co/N2ITYz9tlr","date":"Tue Jun 21 23:30:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A group of senators released the text Tuesday evening for a bipartisan gun safety bill, a key moment for the high stakes effort to pass legislation to counter gun violence in a highly polarized political climate. https://t.co/lkxVocyojm","date":"Tue Jun 21 23:24:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Three people were hospitalized with minor injuries after the landing gear of a Red Air flight from the Dominican Republic collapsed as it landed at the Miami International Airport, a spokesman says https://t.co/9EMbQYrxCk","date":"Tue Jun 21 23:12:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A Los Angeles jury found embattled comedian Bill Cosby guilty in a civil trial filed by Judy Huth, a woman who claimed he sexually assaulted her as a teenager in the 1970s. https://t.co/J4eIRmvwYz","date":"Tue Jun 21 23:06:46 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"An inability to stand on one leg for 10 seconds in later life is linked to nearly double the risk of death from any cause within the next decade, according to a new study. https://t.co/UxWERnVsJm","date":"Tue Jun 21 23:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"You're in the middle of a job interview, a question comes your way and you've got... nothing. Here's how to handle tough questions, and recover from the ones that throw you. https://t.co/Mu85UaQprN","date":"Tue Jun 21 22:30:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Former President Nixon's White House counsel John Dean, who testified against Nixon during the Watergate investigation, has a message for Trump's White House lawyer Pat Cipollone. Watch what he has to say to his 2020 counterpart: https://t.co/IpkQ53kMx7","date":"Tue Jun 21 22:28:39 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"From credit card debt to bad investments, everyone has financial setbacks. \n\nPersonal finance columnist @SingletaryM joins @DelyanneMoney to talk about how we can learn and bounce back from money mistakes. \n\nListen to this week's episode of Diversifying. https://t.co/cEEq6d2t5T","date":"Tue Jun 21 22:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"It's only the first day of summer, but almost 35 million people are under heat advisories Tuesday as the second heat wave in as many weeks drags on. https://t.co/EgVsFYktGY","date":"Tue Jun 21 21:30:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Join CNN for unprecedented access to the last great frontier. Patagonia: Life on the Edge of the World premieres Sunday, July 10th at 9 p.m. ET/PT #PatagoniaCNN https://t.co/n9dJCe9t9y","date":"Tue Jun 21 21:00:21 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Rob Gronkowski, a tight end in the NFL for 11 seasons as a member of the New England Patriots and Tampa Bay Buccaneers, has announced his retirement https://t.co/FmKYS3yWS8","date":"Tue Jun 21 20:45:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A United States Air Force service member has been arrested in connection to an April attack at a US military base in northern Syria that injured four US service members https://t.co/X1qjij85aU","date":"Tue Jun 21 20:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The IRS began the calendar year with about 8 million unprocessed individual returns left over from 2021 https://t.co/dOhQuWOHZo","date":"Tue Jun 21 20:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Justice Department will drop the 31 remaining fraud charges against disgraced attorney Michael Avenatti. https://t.co/ogWm51XZZm","date":"Tue Jun 21 20:00:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Georgia election official Gabriel Sterling describes the threatening tweet that directly led him to address then-President Donald Trump during a press conference in December 2020. Watch: https://t.co/PlXy0Fo7hC","date":"Tue Jun 21 19:47:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In testimony before the House select committee investigating January 6, Georgia Secretary of State Brad Raffensperger explains why former President Trump lost the state's 16 electoral votes in the 2020 election. Watch: https://t.co/BoyT0dT75J","date":"Tue Jun 21 19:43:19 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After a long day of putting the mega moon rocket through its paces, NASA's Artemis team is determining the pathway to launch -- and just how long or short that path may be. https://t.co/u5bd9sHtyN","date":"Tue Jun 21 19:30:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The latest hearing before the House January 6 committee revealed new details about how Trump pressured state officials to help him overturn the 2020 presidential election https://t.co/86j8dP6UYk","date":"Tue Jun 21 19:10:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Beyoncé’s new single, “Break My Soul,” begs listeners to “release” themselves from their 9-5 https://t.co/6emZcNutM7","date":"Tue Jun 21 19:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A wildfire in southern New Jersey has grown to more than 13,500 acres in size, but is now 85% contained, the New Jersey Forest Fire Service says https://t.co/M68h2SxCti","date":"Tue Jun 21 18:45:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In a pre-produced video, the House select committee investigating the Jan. 6 insurrection previews moments focusing on how former President Trump and his allies pressured officials in key battleground states as they sought to overturn the election. Watch: https://t.co/3uGIkWpYhs","date":"Tue Jun 21 18:31:45 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The simple balance test may be useful to include in routine physical exams for people in middle and old age, the research, which was published Tuesday in the British Journal of Sports Medicine, suggested https://t.co/6x3yTYW8wA","date":"Tue Jun 21 18:30:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The revamped rideshare carpool option, dubbed UberX Share, is now available in nine cities, including New York, Los Angeles and Chicago https://t.co/P2p0P8zTIO","date":"Tue Jun 21 18:15:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The state trial of former Minneapolis police officers Tou Thao and J. Alexander Kueng for their alleged role in George Floyd's killing has been moved up to October, Hennepin County Judge Peter Cahill ruled Tuesday https://t.co/0AaLPMFong","date":"Tue Jun 21 18:00:19 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"All the proceeds from the auction, which concluded on World Refugee Day, will go to UNICEF's humanitarian response for Ukrainian ​children displaced by war, according to the auction house https://t.co/xRftO2ZNdJ","date":"Tue Jun 21 17:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"US Attorney General Merrick Garland said the team will be led by the department's best-known Nazi hunter Eli Rosenbaum, and will be made up of experts in investigations involving human rights abuses and war crimes https://t.co/xz8K5D7ze3","date":"Tue Jun 21 17:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"While Martin Sheen says his name is still legally Ramon Estévez, he regrets changing it for his career  https://t.co/othm99FxvS","date":"Tue Jun 21 17:15:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The new policy prohibits the use of the landmines by the US outside of the Korean Peninsula and bans the development, production and acquisition of the weapons https://t.co/aQTJ1KdXcc","date":"Tue Jun 21 17:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"One of Elon Musk's children has petitioned a California court to recognize her new name and gender, saying she no longer wishes to be related to her famous and wealthy father \"in any way, shape or form.\" https://t.co/Fe6UjhOfmm","date":"Tue Jun 21 16:45:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @jimsciutto talks to the aunt of a captured American volunteering with Ukrainian forces, about her nephew's condition and what the family is doing to try and get him and other captured Americans back home.\n\nWatch here: https://t.co/hLMZGvHplp","date":"Tue Jun 21 16:30:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"During Monday's dedication ceremony, Chappelle said he decided to decline the honor because he did not want his name to distract from the students' work at the school https://t.co/7rVTyFt2Lr","date":"Tue Jun 21 16:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New images raise questions about whether police had the firepower to confront the Uvalde, Texas, school shooter long before they did. @JohnBerman speaks with the father of 10-year-old Jose Flores Jr., who was among the victims.\n\nWatch here: https://t.co/7KLv4uyeQx","date":"Tue Jun 21 16:17:51 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court ruled in favor of a Virginia man who is seeking to challenge one of his convictions for using a firearm in an attempted robbery https://t.co/yBud18DQnC","date":"Tue Jun 21 16:15:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Brooks Koepka, a four-time major champion, is the latest golfer to join the Saudi-back LIV Golf Invitational Series, according to multiple reports.\nhttps://t.co/jwNAHsQJTe","date":"Tue Jun 21 16:00:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For one reimaging of a 1960s property, bland has been avoided at all costs, in favor of eccentric individualism.\nhttps://t.co/NRL8DIO7Bb","date":"Tue Jun 21 15:45:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Covid-19 vaccinations for children younger than 5 are beginning across the United States, marking a milestone in the nation’s fight against the disease\nhttps://t.co/hOlaAfMkZw","date":"Tue Jun 21 15:30:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Joe Biden will appoint Marilynn Malerba as treasurer of the United States, making the lifetime chief of the Mohegan Tribe the first Native American to hold the position https://t.co/ICJxkCejt8","date":"Tue Jun 21 15:15:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"It would have been fascinating to hear more about the grittier details it skims over – like her early years as a dancer or the immediate aftermath when she left her parent’s house at 18 years old,\" writes Holly Thomas\nhttps://t.co/cvQZVP8Qn0","date":"Tue Jun 21 15:00:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Supreme Court says Maine cannot exclude religious schools from its tuition assistance program that lets children attend public or private schools\nhttps://t.co/nNFeHshTtr","date":"Tue Jun 21 14:42:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Joe Biden is considering a federal gas tax holiday to help lower gas prices. CNN's Chief Business Correspondent @ChristineRomans explains how it would work. \n\nWatch here: https://t.co/RoGpUIOxnN","date":"Tue Jun 21 14:40:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"General Motors' electric delivery van subsidiary, BrightDrop, has delivered 150 vans to FedEx, the companies announced\nhttps://t.co/JX8dlX5afG","date":"Tue Jun 21 14:30:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Mo Brooks faces a runoff for Senate in Alabama against the Trump-backed rival Katie Britt, who gained Trump's endorsement after a struggling campaign from Brooks and his comments to move past the 2020 election.\n\nWatch here: https://t.co/17ySVL3ZpP","date":"Tue Jun 21 14:15:46 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Kellogg is splitting into three different companies in a major shakeup for the 116-year-old company.\nhttps://t.co/ieS5gskik3","date":"Tue Jun 21 14:00:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US State Department confirmed the death of an American citizen in Ukraine whose obituary said he died in mid-May while fighting in the war there. https://t.co/CBWZiTlGWB","date":"Tue Jun 21 13:58:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After days of mounting public pressure, Chinese police have finally issued an update on the investigation into a brutal restaurant attack in Tangshan\nhttps://t.co/TKGHGpqQdv","date":"Tue Jun 21 13:50:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Tennis hero, inspiring role model and devoted humanitarian, Arthur Ashe’s legacy on and off the court can still be felt today.\n\nTo learn more about one of the US’ greatest Black sports icons, watch #CitizenAshe Sunday at 9 p.m. ET/PT \n\nhttps://t.co/OLaOtItIUg https://t.co/L8HzBBrpvf","date":"Tue Jun 21 13:40:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"How liberals should rethink their view of the Supreme Court | Opinion by Brad Snyder \nhttps://t.co/VhDGJRkPdf","date":"Tue Jun 21 13:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Your next 401(k) statement could come with a very worrisome surprise.\nhttps://t.co/vdMEKELYBu","date":"Tue Jun 21 13:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In the latest episode of CNN 5 Things, we learn about the new images and transcripts prompting serious questions about the police response at the mass shooting at Robb Elementary. \n\nListen here. https://t.co/bUOicBXuTi https://t.co/57IQilFRVr","date":"Tue Jun 21 13:07:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Phoenix Suns have named Morgan Cato as Assistant General Manager and Vice President of Basketball Operations, making her the first woman of color to hold the Assistant General Manager title for an NBA team\nhttps://t.co/TcYI59MZTu","date":"Tue Jun 21 13:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A 5-year-old boy died after his mother left him inside a car outside the family’s home in Houston while she prepared for her daughter’s birthday party on Monday, a law enforcement official told CNN affiliate KTRK.\nhttps://t.co/onG3cEsh52","date":"Tue Jun 21 12:45:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Follow the latest updates on Alabama, Georgia, Virginia and Washington, DC, elections: \nhttps://t.co/rggWcgaaO9","date":"Tue Jun 21 12:40:59 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Katie Ledecky won a record-extending 17th swimming world title with a comfortable victory in the 1,500m free in Budapest.\nhttps://t.co/vb2sSwEYaV","date":"Tue Jun 21 12:15:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Joe Biden is under increasing pressure from the US’ key Middle East allies to come up with a viable plan to constrain Iran\nhttps://t.co/IP0fzYJROT","date":"Tue Jun 21 12:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here are six things to watch for in Tuesday’s elections in Alabama, Virginia, Georgia and DC \nhttps://t.co/apXUSTjv3k","date":"Tue Jun 21 11:45:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Though summer officially begins on Tuesday, millions of Americans have already been buffeted by triple-digit temperatures and dangerously high heat -- which is only expected to continue\nhttps://t.co/FbFkNhy7vb","date":"Tue Jun 21 11:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The House select committee investigating the January 6, 2021, attack on the US Capitol turns its attention to the campaign to pressure state-level officials to overturn the 2020 election results.\nhttps://t.co/znIat1JOFE","date":"Tue Jun 21 11:15:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Welcome back Bey.\nhttps://t.co/PlFeeoDVOQ","date":"Tue Jun 21 11:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A mix of anger at local officials, frustration with the school division’s police department and heart-breaking sadness over last month’s mass shooting at Robb Elementary School dominated the open forum at Monday’s school board meeting in Uvalde, Texas.\nhttps://t.co/1sQFIeNBLx","date":"Tue Jun 21 10:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Texas GOP’s election denial underscores the ongoing threat that’s central message of Jan. 6 hearings | Analysis by Stephen Collinson\nhttps://t.co/mlQEo3se6X","date":"Tue Jun 21 10:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Americans are feeling the heat at the gas pump, but that won't keep them in park, AAA predicts.\nhttps://t.co/BOgwFHPYw9","date":"Tue Jun 21 10:15:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Krispy Kreme's signature glazed doughnuts are now being served in an new way: Creamy ice cream.\nhttps://t.co/Xjyhlddlwc","date":"Tue Jun 21 10:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The International Day of Yoga – which is on Tuesday, June 22 – could be the day that jump-starts a healthy new habit.\nhttps://t.co/yDvO0cUpYg","date":"Tue Jun 21 09:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For Claire Heafford, the abuse she says she suffered as a young gymnast has left a lasting mark on her life.\nhttps://t.co/9YxwvplpoU","date":"Tue Jun 21 09:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Watch the live streams of every catwalk during Paris Fashion Week menswear as they happen.\nhttps://t.co/cEOYWyr8fw","date":"Tue Jun 21 09:15:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Mondelez International said it will buy energy bar maker Clif Bar &amp; Company for $2.9 billion to expand its global snack bar business\nhttps://t.co/NCkaAx6Bjy","date":"Tue Jun 21 08:45:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"It’s been nearly two months since Russian forces began their assault on the city of Severodonetsk. But despite overwhelming firepower, they still can’t dislodge determined Ukrainian resistance,\" writes Tim Lister | Analysis\nhttps://t.co/1ZvX8fURBH","date":"Tue Jun 21 08:30:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"An iconic Hong Kong floating restaurant has sunk, just days after it was towed out to sea en route to an unspecified destination.\nhttps://t.co/4xahmtmwL7","date":"Tue Jun 21 08:00:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Japan’s ban on same-sex marriage is not unconstitutional, a court has ruled, dealing a blow to gay couples and activists seeking greater rights for the LGBTQ community.\nhttps://t.co/9y7lJOr5w0","date":"Tue Jun 21 07:50:01 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A hiker rescued from \"treacherous\" conditions on a trail near Mt. Washington in New Hampshire's Presidential Mountain Range died after suffering from severe hypothermia, state officials said. https://t.co/dmbsNwxACG","date":"Tue Jun 21 07:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"New ultra-long-haul flights between Sydney and New York and London will break aviation barriers. But what will passengers in the cheaper seats have to endure? https://t.co/FTg5LOwWGi","date":"Tue Jun 21 06:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"State Department blames \"logistical error\" after report the detained WNBA star's planned calls to her wife went unanswered by US Embassy in Moscow. https://t.co/dzEVYKI9uw","date":"Tue Jun 21 06:00:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"This flight attendant proposed in midair on a special Pride flight. https://t.co/3rygO0JSlR https://t.co/yX50Ps5Niz","date":"Tue Jun 21 05:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Like so many of the world's worst natural resource crises, the severe water shortage here is a combination of poor management and warping weather patterns caused by human-made climate change. https://t.co/Zc97Res2B0","date":"Tue Jun 21 05:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Macao, the world's biggest gambling hub, began its second day of mass Covid-19 testing on Monday after dozens of locally transmitted cases were discovered over the weekend. https://t.co/Vq2mhUCLFc","date":"Tue Jun 21 04:30:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"They lost everything in Ukraine's conflict with Russia – including their unborn son. Now refugees, this Ukrainian couple found help from a Russian priest. https://t.co/aEEggSFtck","date":"Tue Jun 21 04:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There really is no such thing as a free lunch. https://t.co/cF0k6dAtb1","date":"Tue Jun 21 03:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The solution to living with rising sea levels could be floating architecture. https://t.co/hYTxY4yfUr","date":"Tue Jun 21 03:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For the first time, the world’s rarest species of sea turtle has laid eggs on Magnolia Beach in Texas. https://t.co/exeyikL5ce","date":"Tue Jun 21 02:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The New Yorker writer Dexter Filkins speaks with CNN's @andersoncooper about his recent profile on Republican Florida Gov. Ron DeSantis and his possible 2024 presidential run. Watch here: https://t.co/q0Rw4WO3Ye","date":"Tue Jun 21 02:13:52 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A sprawling 3,400-year-old city emerged in Iraq after a reservoir's water level swiftly dropped due to extreme drought. https://t.co/9yvtTLnOGg","date":"Tue Jun 21 02:00:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Faith Hill is thankful for one modern hair trend. Shaving! https://t.co/b1hqDet2vX","date":"Tue Jun 21 01:30:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"One of the four men who escaped from a federal prison camp in Hopewell, Virginia, over the weekend is back in custody, a spokesperson for the Bureau of Prisons said Monday. https://t.co/Lpwcjt5k5C","date":"Tue Jun 21 01:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Adviser to former President Trump's 2020 presidential campaign, David Urban, reacts to Missouri Republican Senate candidate Eric Greiten's video in which he is depicted as hunting RINOs (Republicans in Name Only). https://t.co/gUcfdKXFP2","date":"Tue Jun 21 00:41:33 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"An American who has been detained in Venezuela for nearly two years has attempted suicide, his family said in a statement shared with CNN https://t.co/B8EdY4k0ft","date":"Tue Jun 21 00:31:02 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The road to financial independence is not easy, and usually requires patience and diligence early on. https://t.co/yqgZTjmxGA","date":"Tue Jun 21 00:00:18 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @elspethreeve speaks with members of an Oklahoma gun rights group that is actively trying to loosen weapon laws in the state. Watch: https://t.co/ijiKGhJYWH","date":"Mon Jun 20 23:52:56 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden and first lady Jill Biden will visit a Washington, DC, vaccine clinic offering Covid-19 vaccinations to children under the age of 5 on Tuesday, a White House official said https://t.co/0uBApgdVwZ","date":"Mon Jun 20 23:15:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @jasoncarrollcnn reports on the rise in hate speech and crimes against the LGBTQ+ community during Pride Month. Watch: https://t.co/p7aH4CufOs","date":"Mon Jun 20 23:00:44 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Eric Greitens, a leading contender for the Republican Senate nomination in Missouri, released a new video in which he is depicted as hunting RINOs (Republicans in Name Only). CNN’s @secupp discusses the ad with @jaketapper. Watch: https://t.co/DKBQn9pUd3","date":"Mon Jun 20 22:42:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A wildfire in southern New Jersey has grown to about 11,000 acres in size Monday and is 50% contained, according to the New Jersey Forest Fire Service https://t.co/rh7HMMw71Y","date":"Mon Jun 20 22:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Covid-19 vaccines for children younger than 5 are rolling out this week. For parents and caregivers planning to get their little ones vaccinated, pediatricians say there are a few things to watch out for. https://t.co/jmyFNkTqK0","date":"Mon Jun 20 22:01:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"As more women learn of the shortage, Instacart said it is seeing an increase in shoppers potentially looking to stock up, with sales for tampons on its platform up 29% week over week. https://t.co/MIVhuXvxsY","date":"Mon Jun 20 21:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Jennifer Lopez and her child Emme Maribel Muñiz, 14, are being praised for a recent duet, but not because of the music.\nhttps://t.co/NY1linx2WR","date":"Mon Jun 20 21:00:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"World swimming’s governing body FINA voted for new eligibility rules that restrict the participation of transgender athletes in elite women’s competitions.\nhttps://t.co/R8jC1p6SXL","date":"Mon Jun 20 20:30:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @VictorBlackwell talks to Rep. Eric Swalwell about the potential benefits and drawbacks of having former President Trump speak under oath at the January 6 hearings after he publicly asked for \"equal time\" to share his side of the story. Watch: https://t.co/No9L8jrzp9","date":"Mon Jun 20 20:12:43 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The new season of #UnitedShades of America is coming this summer! What episode are you looking forward to? Join @WKamauBell on Sunday, July 10th at 10 p.m. ET/PT on CNN https://t.co/15qdyarz8u","date":"Mon Jun 20 20:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Republican Party of Texas adopted a resolution at its state convention that rejects President Biden as the winner of the 2020 election, further aligning the state party establishment with former President Donald Trump in pushing false election claims. https://t.co/SdIbumCQqy","date":"Mon Jun 20 19:30:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A taxi cab jumped the curb and struck four people in central Manhattan in New York on Monday, sending three to local hospitals with life-threatening injuries, the NYPD said. https://t.co/FniHxFF3Vr","date":"Mon Jun 20 19:04:50 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Republican Party of Texas adopted a resolution at its state convention that rejects President Joe Biden as the winner of the 2020 election. CNN's @ChrisCillizza has more. Watch: https://t.co/TgecOwm8O3","date":"Mon Jun 20 19:02:41 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After more than a year of soaring demand, exploding home prices and increasing real estate sales, the market finally seems to be cooling off.\nhttps://t.co/Ngmu8dUgZX","date":"Mon Jun 20 19:02:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here’s a look at Juneteenth, also called Emancipation Day, Freedom Day and Jubilee Day, by the numbers:\nhttps://t.co/yb71bDEJQ4","date":"Mon Jun 20 18:44:58 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In 2017, Anthony Bourdain traveled to Los Angeles. He focused on the impact and contributions of its less photographed, and often overlooked, Latino communities. \n\nListen here. https://t.co/3Sg0likbFH https://t.co/sfeOuWuMwB","date":"Mon Jun 20 18:30:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"President Biden says he hopes to decide soon whether to support a temporary pause in the federal gasoline tax and is nearing a decision on student loan relief as he looks to ease the burden of high prices on Americans. https://t.co/85qJlWIYhV","date":"Mon Jun 20 18:11:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Air travel is returning to normal Monday after several days of widespread flight cancellations due to weather and staffing issues. https://t.co/kIlWsZ3CNa","date":"Mon Jun 20 17:19:48 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Set your alarms! Beyoncé announced last week she has new album coming in July, and now she's poised to give an early preview. https://t.co/AxiSes7MPM","date":"Mon Jun 20 16:56:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Republican Party of Texas adopted a resolution at its state convention that rejects President Biden as the winner of the 2020 election, further aligning the state party establishment with former President Donald Trump in pushing false election claims. https://t.co/SCeFGN7p2h","date":"Mon Jun 20 16:21:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Dasha Navalnaya, the daughter of imprisoned Russian opposition leader Alexey Navalny, speaks with CNN's @jimsciutto about the conditions her father faces after he was transferred to a maximum-security prison.\n\nWatch here: https://t.co/nc196RR5Qs","date":"Mon Jun 20 15:42:57 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Todd and Julie Chrisley are speaking out about the “very sad, heartbreaking time” for their family after they were convicted of conspiracy to defraud banks of more than $30 million in loans.\nhttps://t.co/l3b2lDIswG","date":"Mon Jun 20 15:30:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After more than a year of soaring demand, exploding home prices and increasing real estate sales, the market finally seems to be cooling off.\nhttps://t.co/t58u4S3Dco","date":"Mon Jun 20 15:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Here’s a look at Juneteenth, also called Emancipation Day, Freedom Day and Jubilee Day, by the numbers:\nhttps://t.co/tHJnP1MOBL","date":"Mon Jun 20 15:00:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Jennifer Lopez and her child Emme Maribel Muñiz, 14, are being praised for a recent duet, but not because of the music.\nhttps://t.co/E6QDbcWE4v","date":"Mon Jun 20 14:45:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What happens when corporations try to commercialize Juneteenth?\n\nIf you missed CNN's 5 Things Sunday podcast, @donlemon tells us the origin story of Juneteenth, its road to becoming a federal holiday and how businesses are getting involved. \n\nListen here. https://t.co/2GtKQDwZQ7 https://t.co/oIJJO9o07P","date":"Mon Jun 20 14:30:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"World swimming’s governing body FINA voted for new eligibility rules that restrict the participation of transgender athletes in elite women’s competitions.\nhttps://t.co/ZJVd1PQrkT","date":"Mon Jun 20 14:15:10 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"More tieups at West Coast ports are just about the last thing the US economy needs right now.\nhttps://t.co/lmBk7dn9tk","date":"Mon Jun 20 14:15:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The case for the four-day workweek | Opinion by Joe O'Connor and Juliet Schor\nhttps://t.co/NvYReIzXNN","date":"Mon Jun 20 13:45:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The threat of rising seas is leading to a new form of architecture -- one that floats.\n\nIn the Maldives, a nation on the frontlines of climate change, a floating city big enough to house 20,000 people is being constructed. https://t.co/Wz1f9XdKKW","date":"Mon Jun 20 13:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"What do you know about Arthur Ashe? He was the first African-American man to win Wimbledon, the US Open and the Australian Open, but that’s just the beginning of his story. Watch #CitizenAshe Sunday at 9 p.m. ET/PT https://t.co/6I6oGNDvXf","date":"Mon Jun 20 13:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's @drsanjaygupta reports on the disparities among parents' attitudes towards the Covid-19 vaccine for children under 5-years-old.\n\nWatch here: https://t.co/0uFihbhtD2","date":"Mon Jun 20 13:28:41 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"US post offices will be closed and mail will not be delivered from the USPS on Monday, June 20.\nhttps://t.co/0sHMDyDgRm","date":"Mon Jun 20 13:16:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There are 18 cases remaining in the term. Here are the highlights of the court’s docket\nhttps://t.co/UbHoNBiVPj","date":"Mon Jun 20 13:00:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Artemis I mega moon rocket is ready to fuel up.\nhttps://t.co/3U5ROgmOqE","date":"Mon Jun 20 12:45:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"US aircraft maker Boeing has just revealed its new 2022 ecoDemonstrator plane\nhttps://t.co/Uzx02TtjUl","date":"Mon Jun 20 12:30:12 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Montana Gov. Greg Gianforte, wouldn't say where he was during historic flooding in Montana. We now know he was out of the country. @nickwattcnn reports.\n\nHear about it here: https://t.co/PlSX2XmaDc","date":"Mon Jun 20 12:29:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Contreras Fire burning in southern Arizona has grown to 20,360 acres, prompting possible evacuations for nearby residents, officials said.\nhttps://t.co/Bqqb0Si7xI","date":"Mon Jun 20 12:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"I gave up dieting for my kids. Here’s why\nhttps://t.co/Ezfb2EfQI5","date":"Mon Jun 20 12:00:13 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Community members like 70-year-old Robin Borlandoe are serving as lifeguards in order to keep their public pools open in Philadelphia. @VanessaCNN reports\n\nWatch here: https://t.co/wZjmTa5XAj","date":"Mon Jun 20 11:47:16 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"In the coming week, there are over 100 high temperature records that could be broken, mainly across the southern and eastern regions of the US.\nhttps://t.co/06GYd1MSIk","date":"Mon Jun 20 11:45:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A wildfire in southern New Jersey more than doubled in size to at least 2,100 acres, according to the New Jersey Forest Fire Service.\nhttps://t.co/o7dWqgkKQT","date":"Mon Jun 20 11:30:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"A 15-year-old boy died and three other people were wounded, including a police officer, after shooting broke out near an unpermitted concert in Washington, DC\nhttps://t.co/vcDXcLpcev","date":"Mon Jun 20 11:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Two American volunteers fighting for Ukraine were taken into detention by Russian-backed separatists in Donetsk after being captured last week\nhttps://t.co/h5f2IDdjAy","date":"Mon Jun 20 11:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"America is on edge, and that’s bad news for the White House | Analysis by Stephen Collinson \nhttps://t.co/i38NnTOeex","date":"Mon Jun 20 10:45:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The students – who were present during the shooting – seek to obtain a transparent third-party investigation into the Oxford Community School District’s lack of action regarding the events and warning signs leading up to the shooting.\nhttps://t.co/uowTA1bbfu","date":"Mon Jun 20 10:30:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"Texas Republicans are no longer hiding their extremism. Instead, they are openly embracing it,\" writes Dean Obeidallah | Opinion\nhttps://t.co/WFYvjuHHUp","date":"Mon Jun 20 10:15:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Skin-lightening products, from big brand names to homemade concoctions, have exploded in their availability on major social media platforms where there are few rules about how they are promoted or sold.\nhttps://t.co/S01ZZlwz2B","date":"Mon Jun 20 10:00:07 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Shelling around Kharkiv increased overnight without incursions by Russian forces, Ukrainian officials say\nhttps://t.co/pc9GR00ePl","date":"Mon Jun 20 09:36:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Bitcoin rose as much as 7.6% to $20,404 from its previous close, signaling a recovery from a sharp drop on Saturday.\nhttps://t.co/vlGOSzA2IV","date":"Mon Jun 20 09:00:17 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The solution to living with rising sea levels could be floating architecture. https://t.co/YBgMqNl7rH","date":"Mon Jun 20 08:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The International Swimming Federation has voted to approve a new policy that will restrict most transgender athletes from competing in elite women's aquatics competitions. https://t.co/HZ8wK76yzZ","date":"Mon Jun 20 08:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Allowing the headstone to remain in place could act as a kind of slippery slope allowing for more hateful messages to be placed in the cemetery, a representative said. https://t.co/1Hht3J7ebz","date":"Mon Jun 20 07:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"To celebrate the 20-year anniversary of the \"Scooby-Doo\" live-action film, Warner Bros. and Airbnb offered an overnight stay in the Mystery Machine.\nhttps://t.co/APPRYHMUVu","date":"Mon Jun 20 07:00:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"For the first time, the world’s rarest species of sea turtle has laid eggs on Magnolia Beach in Texas. https://t.co/SFDmkzUShy","date":"Mon Jun 20 06:30:09 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Apple workers in Towson, Maryland, have voted to form the first-ever labor union at one of the tech giant's US stores. https://t.co/DEYNNV2Thx","date":"Mon Jun 20 06:00:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The Friday before Juneteenth clocked in as the most popular air travel day of 2022, according to statistics from the Transportation Security Administration. Airports haven't been that crowded since Thanksgiving 2021. https://t.co/HKt4lGjazE","date":"Mon Jun 20 05:30:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"To date, the company says it has sold more than five million products just through QVC and more than 15 million products overall since it was created. https://t.co/RBONEfnsEk","date":"Mon Jun 20 05:00:08 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"While the former Beatle may be known for his immeasurable contribution to music, Paul McCartney also has a well-documented penchant for fashion. https://t.co/uhrduRakGM","date":"Mon Jun 20 04:30:05 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"There really is no such thing as a free lunch. https://t.co/EjCCNTW1A3","date":"Mon Jun 20 04:00:14 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Gas prices may be skyrocketing, but Americans still love their RVs despite the fact that they often get 10 mpg — or less. https://t.co/CXbO7LcdRc","date":"Mon Jun 20 03:32:04 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"“One of the great honors I have had as president was to sign the bill making Juneteenth a national holiday” -\nHear @POTUS speak at Juneteenth celebration. https://t.co/pBfj2rKHr7","date":"Mon Jun 20 03:05:51 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The cannabis industry has had a major impact on the tiny town of Moffat, Colorado -- so much that the town is now considering changing its name to \"Kush.\" https://t.co/3rasCzR4Wz","date":"Mon Jun 20 03:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Introduced as a transport solution during Covid, e-scooters have become a scourge in Italy's capital, blamed for deaths, injuries and damage to historic landmarks. https://t.co/muxpHEcWDK","date":"Mon Jun 20 02:30:06 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"After a week of epic flooding, Yellowstone National Park's south loop will reopen to the public on Wednesday with limited capacity. https://t.co/Pmo3fBrHSl","date":"Mon Jun 20 02:00:15 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"Saudi Arabian government officials have cracked down on rainbow-colored toys and clothing from shops in the country's capital of Riyadh, saying the items promote homosexuality, according to a Saudi state-run TV channel. https://t.co/yFMGQ2wQzB","date":"Mon Jun 20 01:28:03 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"While other artists might use watercolors or oil paints, Mbongeni Buthelezi uses waste plastics to create highly textured portraits at his studio in Booysens, Johannesburg. https://t.co/GFsAEE7L5s","date":"Mon Jun 20 01:00:11 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"\"Juneteenth means freedom\"\nWatch Opal Lee, the \"grandmother of Juneteenth,\" tell CNN's @donlemon how it feels to be celebrating the federal holiday: https://t.co/PHGDyjRYPa","date":"Mon Jun 20 00:59:54 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"CNN's inaugural \"Juneteenth: A Global Celebration of Freedom\" concert is off to a roaring start: Live from the Hollywood Bowl, Black legends of music are bringing audiences to their feet in a joyful commemoration of the holiday. https://t.co/8ytWZaogYE","date":"Mon Jun 20 00:31:20 +0000 2022","user_id":"759251"},{"handle":"cnn","text":"The US Marshals Service, FBI and other law enforcement agencies are assisting in the search for the four men, according to the BOP. https://t.co/2TyDyOxbk8","date":"Mon Jun 20 00:30:08 +0000 2022","user_id":"759251"}]