[{"handle":"HuffPost","text":"\"How's Uncle Clarence feeling about Overturning Loving v. Virginia?\" the actor tweeted, referring to the 1967 ruling that protected interracial marriage. https://t.co/HeTOuPJepu","date":"Sat Jun 25 22:41:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I wanted to dedicate this next song to the five members of the Supreme Court,\" the pop star told a cheering crowd at the Glastonbury Festival. https://t.co/5nTwxsYVZZ","date":"Sat Jun 25 21:39:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Canadian Prime Minister Justin Trudeau called the U.S. Supreme Court decision to overturn a constitutional right to abortion \"horrific.\" https://t.co/bz1KLyzjdw","date":"Sat Jun 25 20:23:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Providence police officer Jeann Lugo has been placed on leave after allegedly assaulting political rival Jennifer Rourke. https://t.co/UU6fmPaVSo","date":"Sat Jun 25 17:45:28 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Huge congratulations to Mr. Happy Face. https://t.co/iDvIPqMsGi","date":"Sat Jun 25 17:21:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"In Iowa, a truck driver plowed into a group of protesters. In Los Angeles, a cop shoved a journalist. In Mississippi, men harassed volunteers at an abortion clinic. https://t.co/pm1avHZTVH","date":"Sat Jun 25 16:50:17 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A black bear's death in Tennessee was a sad reminder of the dangers of both hot cars and leaving food unattended in bear country. https://t.co/ClIGIkdHNV","date":"Sat Jun 25 15:58:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"We are basically letting 25 million Afghan people to starve, to die, not to be able to earn their own living if we keep on with this financial blockade.\" https://t.co/PITmnxvBby","date":"Sat Jun 25 14:50:26 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Andrews, in an interview with Jimmy Fallon, spilled the tea on the future of the popular Disney film franchise. https://t.co/34WkgCpcaZ","date":"Sat Jun 25 14:30:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Rep. Andy Levin (D-Mich.) responded to the decision with now-deleted photos, and Twitter wasn't having it. https://t.co/RwNUdMyyR0","date":"Sat Jun 25 14:10:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Was it really worth jeopardizing my well-being just to have a genetic link to my non-guaranteed future child? I decided that I would try,\" the author writes. https://t.co/oCgmWK0ppb","date":"Sat Jun 25 13:50:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Petition to stop ringing the doorbell on TV so my dog can lead a less confusing life\" https://t.co/9VZt7lSzcS","date":"Sat Jun 25 13:30:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The officers were planning to arrest the man's son in Hardwick, Vermont, last week. https://t.co/becU0GqFRG","date":"Sat Jun 25 13:10:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The bill comes about a month after a gunman killed 19 children and two adults at a school in Uvalde, Texas. https://t.co/jnYuVY8ucQ","date":"Sat Jun 25 12:50:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Video shared on Twitter shows the crowd running away as police fire tear gas at them from the windows of the building. https://t.co/v2M4YUVAmP","date":"Sat Jun 25 12:29:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"From vitamin chews that'll give your pup a shiny coat to automatic water fountains. https://t.co/yYFSAJxWfW","date":"Sat Jun 25 10:25:40 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Like a projection screen for backyard movie nights, an inflatable pool and yard games for the whole family. https://t.co/ZvMKo9MPix","date":"Sat Jun 25 10:05:38 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"I'd like to formally welcome you to panini paradise. https://t.co/UtJpafnRBB","date":"Sat Jun 25 09:45:35 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"But she does believe \"children should be trained with firearms,\" Greene said at a House Rules Committee meeting. https://t.co/gWyrCKB83s","date":"Sat Jun 25 09:06:31 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Rep. Alexandria Ocasio-Cortez (D-N.Y.) described her gratitude for having a \"choice\" and \"freedom\" over her body. https://t.co/HgKzJirxfr","date":"Sat Jun 25 08:46:28 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Agents seized the paintings during a raid in Florida on Friday. https://t.co/wFFdUBBZJ4","date":"Sat Jun 25 07:44:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“For them, the dam has burst,” she said of the justices. “What do you see in their behavior to give you any reason to believe\"  that they would stop? https://t.co/anisthWnZH","date":"Sat Jun 25 07:20:20 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The satirical news site overwhelmingly revamped its homepage to go after the court's decision to overturn the constitutional right to abortion. https://t.co/19GCttt9jC","date":"Sat Jun 25 07:00:17 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lizzo, Harry Styles and LeBron James are among the celebrities who weighed in on the Supreme Court ruling overturning abortion rights. https://t.co/lPxHIeslxg","date":"Sat Jun 25 06:40:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Federal and state government officials and judges are “probably most at risk,\" along with those at protests and reproductive health care facilities, warns DHS. https://t.co/NmQKbXlTIy","date":"Sat Jun 25 06:20:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Norwegian police say two people have been killed and more than a dozen injured in a mass shooting in Oslo. https://t.co/CItfRVNebg","date":"Sat Jun 25 06:00:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Supreme Court Justice Clarence Thomas argued that same-sex marriages don't merit federal protection. His own marriage, however, could also be at risk. https://t.co/dKr0EucccE","date":"Sat Jun 25 05:40:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A victim told HuffPost that the agitated driver careened into protesters on purpose in downtown Cedar Rapids. At least one person was hospitalized. https://t.co/UcJb8TER39","date":"Sat Jun 25 05:20:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Protests are planned in cities around the U.S. throughout the weekend. https://t.co/XYEWKkNFAf","date":"Sat Jun 25 05:00:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Wake up, Steve! If they're \"awakened,\" they're \"woke.\" https://t.co/RS3cBAdepe","date":"Sat Jun 25 04:40:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A federal court has put a temporary hold on the government's order for Juul to stop selling its electronic cigarettes. https://t.co/BhPQYUCO5G","date":"Sat Jun 25 04:20:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Young Democrats are begging their elected leaders to do more. https://t.co/ulup7CcxdZ","date":"Sat Jun 25 04:00:26 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“This is the first time in the history of our nation that a constitutional right has been taken from the people of America,” the vice president said. https://t.co/ER1CQxNVEY","date":"Sat Jun 25 03:40:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Five Texas district attorneys have already promised “not to prosecute or criminalize personal healthcare decisions.” https://t.co/G0jsWjqbCi","date":"Sat Jun 25 03:20:21 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Before his own death by suicide, the 23-year-old wrote that he \"couldn't go on\" without his fiancee. https://t.co/R6dRj2nq26","date":"Sat Jun 25 03:00:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Stand up, say something,\" the soccer star said. \"This is your wife, this is your sister, this is your friend, this is your girlfriend, this is the mother of your children.\" https://t.co/CMOnxrMm6t","date":"Sat Jun 25 02:40:16 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Everyone compliments the jumpsuit when you wear it out — but when you get to the bathroom it’s just you and your choices\" https://t.co/sBMHPU4SQ5","date":"Sat Jun 25 02:20:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"More than 1,000 people have filed formal complaints about the mysterious assaults. https://t.co/VItYKRQ2k7","date":"Sat Jun 25 02:07:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"There is a real risk that multiple famines will be declared in 2022,” U.N. Secretary-General Antonio Guterres said. \"And 2023 could be even worse.” https://t.co/9r63GvKFKe","date":"Sat Jun 25 01:45:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Brooks sought preemptive \"all-purpose\" pardons for Republicans who challenged the results of the 2020 election, CBS's Robert Costa reported. https://t.co/vVcs2KLSxS","date":"Sat Jun 25 01:30:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Right-wing candidates are making the “big lie” about the 2020 election the focus of 2022 races. https://t.co/kuRRNIplp3","date":"Sat Jun 25 01:20:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"30 Rock\" and \"You've Got Mail\" are among the titles departing the streaming platform this month. https://t.co/V7ee4mRlEV","date":"Sat Jun 25 01:00:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“We will not stand on the sidelines as these attacks mount,” governors from California, Oregon and Washington vowed. https://t.co/RsmpB4kkdP","date":"Sat Jun 25 00:50:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The sprint star did not speak with reporters after her disappointing 100-meter race. https://t.co/tW0SjEqufV","date":"Sat Jun 25 00:35:27 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The movie director and the ESPN star commiserated over the Knicks' chaotic draft night. https://t.co/nGC7t5veoU","date":"Sat Jun 25 00:20:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I cannot describe the depths of my personal sorrow at the suffering of so many,\" the Prince of Wales told Commonwealth leaders. https://t.co/V9w02A0fjB","date":"Sat Jun 25 00:10:23 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“So I learned to put the things that there were issues with into the second part of a sentence,” Donald Trump's COVID coordinator told House members. https://t.co/hAnpbpu69Q","date":"Fri Jun 24 23:50:20 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"My toddler said 'I feel drinky' and yeah girl, same.\" https://t.co/53AnJx3FCi","date":"Fri Jun 24 23:35:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The network severed ties with Ceaser Emanuel from \"Black Ink Crew,\" a drama based in a New York City tattoo shop. https://t.co/sRrHHPBAXU","date":"Fri Jun 24 23:20:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The “Inventing Anna” star has a lot to say about the \"devastating\" surge in anti-LGBTQ legislation during a Pride-themed chat with MSNBC's Jonathan Capehart. https://t.co/RLS0aP6llY","date":"Fri Jun 24 23:10:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The host became the latest personality at the conservative channel to offer a counter-MAGA take on the Jan. 6 hearings. https://t.co/yT8d8NFl8n","date":"Fri Jun 24 22:55:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Fox News host poured on the insults and sarcasm in a 17-minute bashing of the vice president. https://t.co/xV6SrjwpUq","date":"Fri Jun 24 22:40:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"A lot of people have made headlines talking about GCS. Almost all of them have one thing in common: They’ve never actually been through it. I have.\" https://t.co/sP5XWn1JqI","date":"Fri Jun 24 22:30:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The recent infrastructure law includes provisions to jumpstart carbon capture and storage, including offshore, to help stave off catastrophic climate change. https://t.co/bH7aN0JW3k","date":"Fri Jun 24 22:20:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Sometimes we need to take a stand to make things better,” the New York state Assemblywoman from lower Manhattan said. https://t.co/EMoSIzqRWs","date":"Fri Jun 24 22:05:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Former Trump EPA chief Scott Pruitt celebrated Friday’s Roe v. Wade ruling, despite a career that increased environmental harm to unborn children. https://t.co/ZbGpCDvJrq","date":"Fri Jun 24 21:40:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I tend to beat myself up a lot over it,\" the \"American Idol\" alum said in a candid admission on Kelly Clarkson's talk show. https://t.co/mAnLm8aLF3","date":"Fri Jun 24 21:20:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: An attorney for Brian Laundrie’s family has released handwritten pages from a notebook once owned by Laundrie in which he confesses to killing his fiancée, Gabby Petito. https://t.co/R6dRj2nq26","date":"Fri Jun 24 21:10:42 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Oklahoma Gov. Kevin Stitt already signed the most extreme abortion restrictions in the country. https://t.co/HYoF30DTE8","date":"Fri Jun 24 21:00:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"She says the overturning of Roe v. Wade means reproductive freedom is “on the ballot in November.” https://t.co/lSXvBBAhQM","date":"Fri Jun 24 20:35:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The future of abortion rights in Kansas will be decided this year following the Supreme Court's ruling overturning Roe v. Wade. https://t.co/coJffTJOVl","date":"Fri Jun 24 20:15:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"British Prime Minister Boris Johnson called the Supreme Court ruling \"a big step backwards.\" Others argued it would embolden abortion opponents globally. https://t.co/RvNg1QTgeZ","date":"Fri Jun 24 20:00:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The GOP realizes its goal isn’t complete. https://t.co/vABY9s7nCE","date":"Fri Jun 24 19:45:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Mysterious injuries first began to be reported among U.S. embassy staff in Havana, Cuba, in late 2016 and have since spread to nearly 70 countries. https://t.co/OjxB70u6zc","date":"Fri Jun 24 19:26:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Democrats hope it’s the start of a shift in the party. Republicans think it’s the end. https://t.co/CpdBL91NSk","date":"Fri Jun 24 19:06:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"It Cosmetics' UV-protective color-correcting cream is great for all skin types, including  aging, acne-prone and sensitive. https://t.co/vlAOGQt3Li","date":"Fri Jun 24 19:00:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"America is at war with Black girls, and I, for one, don't plan to be \"strong\" about it anymore. https://t.co/jjntrUTuQ5","date":"Fri Jun 24 18:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“This is a sad day for the country.” President Joe Biden slams the Supreme Court’s decision to overturn Roe v. Wade. https://t.co/F88MHo0EMJ","date":"Fri Jun 24 18:27:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The senator urged President Joe Biden to use his executive authority to defend abortion access. https://t.co/gUiElYqd4Y","date":"Fri Jun 24 18:25:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Trump's nominees to the Supreme Court provided the crucial votes to rescind federal abortion rights and fulfill a 50-year conservative goal. https://t.co/ukFAJ3VvqG","date":"Fri Jun 24 18:10:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Don't get overwhelmed by all the choices out there. From Cuisinart to KitchenAid, these are our food editor's favorite picks. https://t.co/UxBI0piZ6O","date":"Fri Jun 24 17:55:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"From engaging non-screen games to trays and cup holders for corralling snacks, reviewers swear by these products for keeping kids fed and entertained on long drives. https://t.co/qXw0753SXT","date":"Fri Jun 24 17:47:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Laverne Cox called out lawmakers who are treating transgender people’s lives as a “political football.” https://t.co/Xyu7JwwQ02","date":"Fri Jun 24 17:45:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I am alarmed they chose to reject the stability the ruling has provided for two generations of Americans,\" the West Virginia Democrat said. https://t.co/Yx1CBt8XsJ","date":"Fri Jun 24 17:30:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Speaking outside the Supreme Court, Rep. Alexandria Ocasio-Cortez (D-NY) told protesters that \"right now, elections are not enough\" to reclaim abortion rights in America \"we have to fill the streets.\" https://t.co/dgfKo8FQFR","date":"Fri Jun 24 17:24:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I was there when a friend of mine had an illegal abortion,” one protester told HuffPost. “It was horrifying. I wouldn’t wish that on anyone.” https://t.co/7AS5d4CUjv","date":"Fri Jun 24 17:15:30 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The president called the historic decision “a sad day for the court and the country.” https://t.co/Np5zQvHjob","date":"Fri Jun 24 16:58:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Cleansing is an essential first step to every skin care routine, but is there such a thing as under- or overwashing? Experts share their insight. https://t.co/ebsweod7HY","date":"Fri Jun 24 16:46:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Get the latest on how this ruling will impact abortion access at the state level: https://t.co/1MvOib2YiV","date":"Fri Jun 24 16:37:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lawmakers in Montana are already calling for the state’s Supreme Court to overturn its abortion protections. GOP leaders in the legislature, state Sen. Mark Blasdel (R) and state Rep. Sue Vinton (R), released a statement celebrating the Dobbs decision. https://t.co/K4o4LkFczo https://t.co/nrl1rkkjok","date":"Fri Jun 24 16:37:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The state has one abortion clinic left, Reproductive Health Services of Planned Parenthood in St. Louis. It’s unclear if the clinic will have to close or just stop providing abortion care and continue with other health care services. https://t.co/1MvOib2YiV https://t.co/JbZfnxEXaB","date":"Fri Jun 24 16:37:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Missouri’s abortion ban has no exceptions for rape or incest ― only an exception if the life of the mother is at risk. The trigger law makes it a felony to induce an abortion, which carries a prison sentence of five to 15 years. https://t.co/1MvOib2YiV https://t.co/ahnoLXw3qH","date":"Fri Jun 24 16:37:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Less than an hour after the decision in the Dobbs v. Jackson Women’s Health Organization was handed down, Missouri’s Attorney General Eric Schmitt was the first to ban abortion. Schmitt issued his opinion, triggering Missouri’s anti-abortion law. https://t.co/1MvOib2YiV https://t.co/IVwuxeUGLi","date":"Fri Jun 24 16:37:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The same day the Supreme Court struck down the constitutional right to abortion, anti-choice states started enacting trigger bans. https://t.co/1MvOib2YiV","date":"Fri Jun 24 16:37:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sunblocks like Supergoop Glow Screen and Glossier Invisible Shield are infused with powerful active ingredients that help to improve skin health and appearance. https://t.co/6uRs0Q91LM","date":"Fri Jun 24 16:26:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Read this if you're waking up tired in the morning and you're not quite sure why. https://t.co/9oHTraXby7","date":"Fri Jun 24 16:06:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Experts say you don’t want your clothes to be more memorable than what you said in an interview. https://t.co/w14TAwEDeE","date":"Fri Jun 24 15:47:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"With Roe v. Wade overturned, abortion looks set to be banned in 22 states, but the fight for reproductive rights is far from over. https://t.co/eq2sPBn84G","date":"Fri Jun 24 15:46:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"JUST IN: Minutes after the Supreme Court decision in Dobbs v. Jackson dropped, Missouri became the first state to enact its trigger ban.  https://t.co/inPkXviEFN","date":"Fri Jun 24 15:45:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“For more than a month, we’ve known this day was coming -- but that doesn’t make it any less devastating,” the former president wrote on Twitter. https://t.co/B4ds4krUbu","date":"Fri Jun 24 15:43:14 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former vice president said anti-abortion activists \"must not rest\" until the procedure is banned in every state. https://t.co/wiyrKppLpD","date":"Fri Jun 24 15:30:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Keep night sweats at bay and stay cool this summer with this Pelonis oscillating tower fan. https://t.co/U1TiXswb8O","date":"Fri Jun 24 15:27:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The senator's vote was pivotal to the confirmation of the conservative justice to the Supreme Court in 2018. https://t.co/LMHFBIsD74","date":"Fri Jun 24 15:26:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Those include three cases around contraception and same-sex marriage. https://t.co/APBNbMdLLo","date":"Fri Jun 24 15:26:35 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Justices Breyer, Sotomayor and Kagan wrote with \"sorrow\" for the \"millions of American women who have today lost a fundamental constitutional protection.\" https://t.co/9Pbhm127au","date":"Fri Jun 24 15:26:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Our medical assistant came to me, panicked, and handed me a positive test. ... 'Run it again,' I sputtered — to buy some time and gather my wits and hope by some miracle it would produce a different result.\" https://t.co/V0WWZB1Mkl","date":"Fri Jun 24 15:19:30 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Russian forces have made gains around Sievierodonetsk and the neighboring city of Lysychansk, on a steep bank across the river. https://t.co/LPcLklLnFn","date":"Fri Jun 24 15:06:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Today's Supreme Court decision has cemented the United States’ status as a global outlier on abortion rights. https://t.co/j9nx72EFue","date":"Fri Jun 24 14:55:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Make no mistake: this is the culmination of a multi-decade terror campaign. https://t.co/dr5V93bj9G","date":"Fri Jun 24 14:54:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"It's weird you know. I never expected that thing in the back of my house,\" the man said. https://t.co/48Zg4YeHuC","date":"Fri Jun 24 14:46:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"If states insist on restricting reproductive rights, the least they could do is provide assistance for those parents and their new children.\n\nBut they aren’t really doing that. https://t.co/oJaoR9gqeD","date":"Fri Jun 24 14:44:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Here's what they do and how you can help. https://t.co/QyqjFKnlsM","date":"Fri Jun 24 14:41:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Many advocates have expressed concerns that the ruling could pave the way for more women to be prosecuted based on actions during their pregnancy, especially if they miscarry. https://t.co/bfTrQ6LoVB","date":"Fri Jun 24 14:40:39 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"It has been 16 years, but I can still hear myself begging my mother, my doctor, not to make me do this ― please don’t make me do this.\" https://t.co/6bd4vwplPw","date":"Fri Jun 24 14:40:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Researchers from Imperial College London estimated the shots prevented 1.9 million deaths in the United States during the first year they became available. https://t.co/bNZUPu1yEO","date":"Fri Jun 24 14:26:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"HuffPost has published multiple stories on the final days of abortion care as we know it — highlighting how we got here and what the future might look like. https://t.co/ikNkhACk5i","date":"Fri Jun 24 14:21:16 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: The Supreme Court struck down Roe v. Wade on Friday, dismantling the decades-old precedent that protected abortion rights and giving states the go-ahead to dramatically limit access to reproductive health care. https://t.co/A1jOLU2YZl","date":"Fri Jun 24 14:14:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Stephen Colbert's \"dumbest person\" in the Senate now has his own \"Ghostbusters\" theme song. https://t.co/pDbMS5S00R","date":"Fri Jun 24 14:06:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The trend's TikTok tag has videos with over 615 million views, as of Friday morning. https://t.co/oLLBYnYE5Z","date":"Fri Jun 24 13:47:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Pretty chill way to overthrow democracy,\" the \"Late Show\" host said. https://t.co/4weuXicfJ7","date":"Fri Jun 24 13:27:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I'm really bad at spoilers,\" the actor said during an interview on \"Jimmy Kimmel Live.\" https://t.co/AFEV1oUlbk","date":"Fri Jun 24 13:07:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I think we all saw what happened on January 6, and now we’re looking to see if justice comes on the other side of it,” Penn said. https://t.co/WjgZgl6mpm","date":"Fri Jun 24 12:46:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“How are these hearings supposed to change people’s minds when they can’t even change the minds of people in the hearing?” https://t.co/WYwUWfARz8","date":"Fri Jun 24 12:26:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The streaming service has been subject to criticism based on anti-trans remarks on its comedy specials in the past year. https://t.co/rziPwThENN","date":"Fri Jun 24 12:06:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Today’s Court thinks that gun regulations should be frozen in time,\" Gov. Gavin Newsom said. https://t.co/KzSnzfElb2","date":"Fri Jun 24 11:46:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“The shark bite was unlucky. But after that I ... had so much good luck,\" the survivor said after his horrifying encounter. https://t.co/WOdksSUPPg","date":"Fri Jun 24 11:27:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The singer stopped into a cafe in Australia on Saturday without being recognized. https://t.co/BTS6n6kUec","date":"Fri Jun 24 11:07:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"For almost everyone here, insurrectioning was a non-issue. It was the hearings themselves that were the problem.\" https://t.co/PQX4QN1Xuz","date":"Fri Jun 24 10:47:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Italian-based, Senegalese-born personality is famous for videos in which he simplifies complicated \"life hacks.\" https://t.co/I4ExNZuA0V","date":"Fri Jun 24 10:26:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sen. Chris Murphy (D-Conn.) called it the \"most significant piece of anti-gun-violence legislation Congress has passed in three decades.\" https://t.co/i5ruDmzMzA","date":"Fri Jun 24 10:06:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"He calls for evidence of what doesn't exist: a rigged election. https://t.co/3bCOJqFm7w","date":"Fri Jun 24 09:46:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Nobody ever knew it wasn’t me,” the Grammy artist admitted. https://t.co/W6JkDp5Y73","date":"Fri Jun 24 09:26:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"This could be the quote that demonstrates the former president's criminal intent, according to Eric Holder. https://t.co/ztugfTQlky","date":"Fri Jun 24 09:06:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Harris, 22, pleaded guilty earlier this year to one count each of receiving child pornography and traveling with the intention to engage in illegal sexual conduct. https://t.co/LqCVPvhWvW","date":"Fri Jun 24 08:47:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Whether Republicans are watching the hearings or not, they know the \"earth is shaking,\" adds Woodward's Watergate partner Carl Bernstein. https://t.co/GwqY6ekAq3","date":"Fri Jun 24 08:27:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The House speaker's husband was arrested last month after allegedly driving under the influence of alcohol. https://t.co/ZlXJYqfcLE","date":"Fri Jun 24 08:07:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Pardon me?\" many Twitter users asked the Florida congressman. https://t.co/YbuZ7umOsh","date":"Fri Jun 24 07:47:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I was like, ‘I can't have this Botticelli f**king goddess floating around my home,’” the comedian said of Domino Kirke. https://t.co/WIbeGzvJe3","date":"Fri Jun 24 07:26:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Fox News, Wall Street Journal, New York Post, Times of London, The Sun etc etc etc\" now \"all lockstep against Trump,\" Bannon insisted. https://t.co/VAA8QiuISV","date":"Fri Jun 24 07:06:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Kavanaugh and John Roberts have staked their claim to the Supreme Court's center for any future gun control litigation. https://t.co/BRPpb09icf","date":"Fri Jun 24 06:46:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Members of the Ponca tribes in Nebraska and Oklahoma visited the Massachusetts university on June 3 for the ceremonial return of the artifact. https://t.co/Fvcda2iKpF","date":"Fri Jun 24 06:26:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Trump said he and Republican lawmakers would take care of the rest. https://t.co/35YqoSSs6z","date":"Fri Jun 24 06:06:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Doug Mastriano previously used funds from his state Senate campaign to charter buses for supporters to attend the “Stop the Steal” rally in 2021. https://t.co/cdr2CvKrI5","date":"Fri Jun 24 05:46:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The space agency wants to halt the sale of moon dust collected in1969 that was later fed to cockroaches to see determine if the lunar rock posed a threat to terrestrial life. https://t.co/YsrDoW21rL","date":"Fri Jun 24 05:26:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"McElhenny’s thrilling runs and all-around skills as a runner, receiver and kick returner made him one of the NFL’s top players of the 1950s. https://t.co/vuIkSX7Nux","date":"Fri Jun 24 05:07:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The incident was “very odd,” a spokesperson for Pasco County Fire Rescue said. https://t.co/p8eorUwir3","date":"Fri Jun 24 04:47:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"That was not my experience with that man,” said the \"Firefly\" actor. https://t.co/4FeMeQBoEa","date":"Fri Jun 24 04:27:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Proceeds from the game will go to the acquitted shooter's \"legal defense against the fake news,\" according to its website. https://t.co/0sWyAu1byw","date":"Fri Jun 24 04:07:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Hint: \"CoComelon\" is involved. https://t.co/hfSX528dmt","date":"Fri Jun 24 03:46:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I had never talked to Peter Jackson about this. I don’t know if he knows,\" the “Thor: Love And Thunder” writer-director revealed. https://t.co/DWeqfVu8Ok","date":"Fri Jun 24 03:26:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Duke and Duchess of Cambridge were met with continued backlash to their visit throughout their tour of Belize, Jamaica and the Bahamas in March. https://t.co/6lfExhVbgJ","date":"Fri Jun 24 03:06:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The \"Booksmart\" actor announced her engagement to Roberts, a British producer, with a series of stunning photos on Instagram. https://t.co/ll5VSfQ09v","date":"Fri Jun 24 02:46:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former president backed down when his own appointees threatened to resign en masse if he installed a loyalist willing to lie about election \"fraud\" for him. https://t.co/rMwX2gLMCE","date":"Fri Jun 24 02:26:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Following the collapse of the previous government and severe international sanctions, the country's humanitarian crisis has only deepened. https://t.co/KiwbZUFVQw","date":"Fri Jun 24 02:06:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The rights of LGBTQ students would become enshrined in federal law and victims of campus sexual assault would gain new protections under new rules proposed by the Biden administration. https://t.co/5RygG2HkIP","date":"Fri Jun 24 01:47:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The leaders of the EU's 27 countries have agreed to treat Ukraine as a possible member — bolstering the nation's resistance to a vicious Russian invasion. https://t.co/4yBlUv2Ygs","date":"Fri Jun 24 01:27:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A final conclusion on the cause of the Florida beachfront condo’s collapse is likely years away. https://t.co/neRXiZcLAK","date":"Fri Jun 24 01:07:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I continue to support efforts to free him,” the Vermont senator said of the 77-year-old Indigenous rights activist in a new letter obtained by HuffPost. https://t.co/Ho9Bj4SgmI","date":"Fri Jun 24 00:47:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The unidentified man is thought to be the person who shot a 27-year-old man to death and wounded a 70-year-old man as the train departed the Forest Hill station. https://t.co/oshnFvVrPK","date":"Fri Jun 24 00:26:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The game show clued in viewers that it's not perfect either. https://t.co/EMcdXxQrfu","date":"Fri Jun 24 00:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Authorities reportedly searched the home of the former Department of Justice official in connection with an investigation into efforts to overturn the 2020 election. https://t.co/ZNM3yTqRVv","date":"Thu Jun 23 23:46:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"We did that! That has absolutely been done before,\" said the director of the beloved 2002 film. https://t.co/PhtrYo2hNR","date":"Thu Jun 23 23:26:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Our annual list of artists, activists, entertainers and entrepreneurs who are doing the work to make change and inspire others. https://t.co/khrp7yk2f4","date":"Thu Jun 23 23:07:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The police couldn't arrest the Oklahoma man for openly carrying around his semi-automatic rifle. https://t.co/WAGjJtctlI","date":"Thu Jun 23 22:47:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Gov. Kathy Hochul said the state has been working with legal experts from \"all over this country\" on measures to preserve gun restrictions. https://t.co/bPzqw3hS36","date":"Thu Jun 23 22:27:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Scotland killed five times as many people accused as witches than anywhere else in Europe, according to the campaign group Witches of Scotland. https://t.co/FdcJnw8Qq7","date":"Thu Jun 23 22:06:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The requests stemmed from their involvement in Trump’s schemes to try to subvert the 2020 presidential election. https://t.co/u1IAfJP03x","date":"Thu Jun 23 22:00:30 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The legislation is unlikely to pass, but Sen. Tina Smith told HuffPost that the safe, effective abortion method is “a very important thing to be protecting right now.” https://t.co/HTO7YAhvhJ","date":"Thu Jun 23 21:46:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: The special committee named four additional Republican congressmen who sought pardons from President Donald Trump.\n\nThe committee previously revealed that Rep. Scott Perry sought a presidential pardon, something the congressman denied. https://t.co/u1IAfJP03x","date":"Thu Jun 23 21:31:36 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The owners turned the raccoon over and were each charged with unlawfully possessing a wild animal. https://t.co/7nS52UXY2d","date":"Thu Jun 23 21:26:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A growing number of people are flocking to mermaid conventions and have poured their savings into a multimillion-dollar mermaid tail industry. https://t.co/IlYDbWAhpi","date":"Thu Jun 23 21:06:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The court ruled in favor of a sheriff's deputy who was sued after he failed to read a Miranda warning to a hospital worker accused of sexually assaulting a patient. https://t.co/yvnaFYYNxH","date":"Thu Jun 23 20:47:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Texas Republican Sen. John Cornyn, the lead Republican negotiator of the gun bill, called Scott's claim \"ridiculous.\" https://t.co/W80KPYm4wh","date":"Thu Jun 23 20:27:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A pregnant American woman who suffered an incomplete miscarriage while vacationing in Malta will be airlifted to a Spanish island on Thursday. https://t.co/tHRrGM0nxo","date":"Thu Jun 23 20:07:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The portrait shows the Duchess of Cambridge in a gown from The Vampire's Wife that she also wore in March 2020. https://t.co/VO9sDhI5XX","date":"Thu Jun 23 19:46:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Department of Health and Human Services said more testing will help the country \"better understand the scope of the current monkeypox outbreak.\" https://t.co/yom0exf5lV","date":"Thu Jun 23 19:26:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The remark was made during a traffic stop in Miami as the driver appeared to struggle to locate his driver's license and registration. https://t.co/9R7fAMEJwJ","date":"Thu Jun 23 19:06:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING:  Donald Trump tried to subvert the Justice Department into supporting his scheme to overturn democracy and remain in power but backed off when his own appointees there threatened to resign en masse. https://t.co/rMwX2gLMCE","date":"Thu Jun 23 19:06:38 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: European leaders gave Ukraine the status of a European Union candidate at a recent summit.  https://t.co/4yBlUv2Ygs","date":"Thu Jun 23 18:49:23 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Health officials have ordered vaping company Juul to pull its electronic cigarettes from the U.S. market. https://t.co/XENSDF7Ykk","date":"Thu Jun 23 18:47:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Gloria Estefan playfully poked fun at Jennifer Lopez’s complaint about time constraints sharing the 2020 Super Bowl halftime stage with Shakira. https://t.co/GZE2s83XlS","date":"Thu Jun 23 18:45:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Broadway is making masks optional for audiences in July as several stars test positive for COVID-19. https://t.co/9TBFEj0Lbi","date":"Thu Jun 23 18:37:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“There is no place in the Town of Millinocket for such a blatant disregard of human decency,\" an official of the Maine town wrote. https://t.co/3EKMUOtMHd","date":"Thu Jun 23 18:27:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Olympic diver reflects on fame, fatherhood, LGBTQ advocacy and his love of knitwear in a compelling new book. https://t.co/qlZNB9AL5h","date":"Thu Jun 23 18:07:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: Federal investigators searched the home of former Trump Justice Department official Jeffrey Clark.  https://t.co/ZNM3yTqRVv","date":"Thu Jun 23 17:47:38 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The 8-1 decision doesn't end the more than three-year dispute over the voter ID law, which is not currently in effect and has been challenged in both state and federal court. https://t.co/JUT8dWrUan","date":"Thu Jun 23 17:46:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The singer shared a note referencing the Uvalde, Texas, school massacre. https://t.co/aVbUCq29xA","date":"Thu Jun 23 17:26:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I felt like I didn’t 'count' as queer since I presented as a straight, monogamous mom in the South.\" https://t.co/agGDMXd7rH","date":"Thu Jun 23 17:07:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Due out Aug. 5, Peacock's upcoming horror movie follows a group of LGBTQ teens who find themselves the target of a masked killer in the woods. https://t.co/n8R5bNFOTd","date":"Thu Jun 23 16:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Household Pulse Survey found that over 40% of Americans have tested positive for the coronavirus at some point. https://t.co/tmFN33auVG","date":"Thu Jun 23 16:26:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The reality star got caught in a relatable moment as she tried to carry on with work. https://t.co/relS0Z9daW","date":"Thu Jun 23 16:06:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Julie Burkhart was about to open Wyoming’s first abortion clinic. But then it burned down. https://t.co/nH1SsJXPRv","date":"Thu Jun 23 15:50:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Muslim women said the ruling unfairly targeted their faith and their bodies. https://t.co/Dwl2RQI7Gc","date":"Thu Jun 23 15:46:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"We created one of the closest things to a social democracy in recent United States history.” https://t.co/C2AtyBk6pV","date":"Thu Jun 23 15:27:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sen. Ron Johnson (R-WI) is facing major backlash following revelations by the House Jan. 6 select committee. https://t.co/F5fVsCDlLb","date":"Thu Jun 23 15:10:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The vape-fan Fox News host vowed to defy the Food and Drug Administration. https://t.co/GRRndiFmJt","date":"Thu Jun 23 15:07:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Each member of the House select committee probing the Capitol riot likely will get a security detail amid a surge in violent threats, according to reports. https://t.co/d20eeotBaH","date":"Thu Jun 23 14:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: The U.S. Supreme Court on Thursday struck down a New York state gun control law, setting a major precedent that expands the reach of the Second Amendment. https://t.co/1rn9Gebwy6","date":"Thu Jun 23 14:36:42 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Team USA coach Anita Fuentes said lifeguards didn't react, so she jumped in to rescue the unconscious athlete at the bottom of the pool. https://t.co/ozy4FrXMls","date":"Thu Jun 23 14:27:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Police and the LGBTQ community have always had a strained relationship, so San Francisco Pride organizers didn't want uniformed cops in their parade. And it was a problem. https://t.co/6g14oCiwue","date":"Thu Jun 23 14:06:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The streaming service announced the movies and shows arriving soon. https://t.co/FcZd9QFHeY","date":"Thu Jun 23 13:46:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Turns out, you might be experiencing oral allergy syndrome, also known as pollen fruit syndrome. https://t.co/7K53xV4Gc0","date":"Thu Jun 23 13:26:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Emerald City locals share the faux pas they often see visitors committing. https://t.co/ihknkYcIKJ","date":"Thu Jun 23 13:06:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Here’s how to make sure you’re using the mental health term accurately. https://t.co/Y44HExZvmN","date":"Thu Jun 23 12:47:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"These waterproof picnic blankets are available at retailers like Amazon and Bed Bath and Beyond andat a range of price points. https://t.co/KjF8gYk4tb","date":"Thu Jun 23 12:27:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Folding chairs, camping chairs and director-style outdoor chairs you'll want to snag for yourself. https://t.co/yz8I6szdFd","date":"Thu Jun 23 12:07:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Like your hair and skin, your nails say a lot about your age. Here's what experts say you can do about it. https://t.co/LjQ8VqaHAw","date":"Thu Jun 23 11:46:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Your home is about to be business in the front and a party in the back. https://t.co/7GBkWR9YIl","date":"Thu Jun 23 11:26:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The witnesses will include Jeffrey Rosen, who was acting attorney general during the Jan. 6, 2021, assault on the U.S. Capitol. https://t.co/s2nZ7uh9Bz","date":"Thu Jun 23 11:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"It's gross, but fascinating. https://t.co/nCVeVxR5xQ","date":"Thu Jun 23 10:46:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"The Daily Show\" host mocks Mitch McConnell for claiming the bipartisan gun safety bill was “fully upholding the Second Amendment.” https://t.co/xRPko2CXPI","date":"Thu Jun 23 10:26:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"They actually thought they could get away with saying they had the proof, just never having it with them.\" https://t.co/H0BI6g7DJh","date":"Thu Jun 23 10:07:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“You have mass stabbings, lady,\" the GOP congresswoman told a reporter who compared U.K. gun statistics to those in the U.S. https://t.co/qG2Bw23Kse","date":"Thu Jun 23 09:47:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Good boy! https://t.co/TwBLxDflEg","date":"Thu Jun 23 09:27:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The \"Late Show\" host insisted that most historians agree on this one. https://t.co/aUKC1BJt1O","date":"Thu Jun 23 09:06:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"How, and whether, the Taliban allow the world to offer aid remains in question. https://t.co/MXWtnbCXrr","date":"Thu Jun 23 08:46:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The crash involved a Vietnam War-era helicopter used to fly around tourists, according to an official. https://t.co/lnKWXORgVd","date":"Thu Jun 23 08:26:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Democratic senator said more increases could mean a recession with \"millions of people out of work.\" https://t.co/ToaXjdpvTE","date":"Thu Jun 23 08:06:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A company vice president said its ability to use voices on its Alexa devices is part of \"living in the golden era of AI.\" https://t.co/aQ2EO6Ra18","date":"Thu Jun 23 07:46:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"You might say this one was truly bananas. https://t.co/HqgtTusxFC","date":"Thu Jun 23 07:26:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The singer encouraged Washington, D.C., fans to do the \"Beat Ya Feet\" dance but flopped in his own attempt. https://t.co/blKfjsGHLN","date":"Thu Jun 23 07:07:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The California Democratic slammed the extremist congresswoman for inciting violence and shared audio of a call threatening his children. https://t.co/Db7px4iZrx","date":"Thu Jun 23 06:47:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Juul, the largest U.S. e-cigarette manufacture, has been under federal review after public concerns that their products have caused an uptick in underage nicotine use. https://t.co/E9IgNcbZfA","date":"Thu Jun 23 06:27:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The university began to seek a trademark after fashion giant Marc Jacobs looked to trademark \"the\" in 2019. https://t.co/yRzfgaHqOC","date":"Thu Jun 23 06:07:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Chief Pete Arredondo has faced fierce scrutiny amid reports it took officer more than an hour to confront the gunman who killed 21 people at Robb Elementary. https://t.co/zkSald7mzz","date":"Thu Jun 23 05:46:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The extremist Republican mocked Pete Buttigieg for taking paternity leave but now says the role of the father is \"fundamental to the family.\" https://t.co/qVMM9rc6Im","date":"Thu Jun 23 05:26:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"After Googling his character, Bale said he thought he would have to run around in a “G-string all the time.” https://t.co/5whFDqSs7v","date":"Thu Jun 23 05:06:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"For the first time, the U.S. government is formally acknowledging the scope of its former policy aimed at erasing Native American identity. https://t.co/a04gOupOls","date":"Thu Jun 23 04:46:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“OK, and imagine what J.Lo would have said if I was the third [performer]!” the “Conga!” singer said. https://t.co/nSbN3suHI2","date":"Thu Jun 23 04:26:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Here's what an LGBTQ+-affirming doctor looks like, and how to find one for your child. https://t.co/YO40X1nX01","date":"Thu Jun 23 04:06:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Looking to get out of town for the July 4 holiday, key lawmakers have agreed on a stopgap — for now. https://t.co/HCBwwMk7Zx","date":"Thu Jun 23 03:46:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The woman placing the order asked restaurant employees to “call the police” and have them come with the delivery, but “please don’t make it obvious.” https://t.co/FPppy31VM5","date":"Thu Jun 23 03:27:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A federal appeals court ruled that a state law requiring state contractors to pledge not to boycott Israel is not an unconstitutional violation of free speech. https://t.co/qR3GUN5Tuf","date":"Thu Jun 23 03:07:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"We've all heard of red flags — and green flags — when it comes to dating. Relationship experts explain how to recognize pink flags. https://t.co/WyxPJ9fGx6","date":"Thu Jun 23 02:47:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Weird pregnancy craving of the day: Chinese food and mashed potatoes. At the same time.\" https://t.co/C50Ra05yK5","date":"Thu Jun 23 02:27:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"He later deleted the video. https://t.co/1DN8vtMLtD","date":"Thu Jun 23 02:07:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"U.S. District Judge William Orrick had ordered the former employee, Owen Diaz, to either accept or deny the amount within a two-week period. https://t.co/3DjUsHszwb","date":"Thu Jun 23 01:46:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Working parents and their kids are in trouble, but prospects for major legislation have dimmed. https://t.co/JjxlxriaJH","date":"Thu Jun 23 01:26:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Texas will be a test of whether the movement can extend beyond blue states. https://t.co/d8CMorHD07","date":"Thu Jun 23 01:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"There are 50. https://t.co/hqn8WuHFn7","date":"Thu Jun 23 00:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Try and hear that, or embrace that on some level,\" the actor said to his critics. https://t.co/ZyiUlI49er","date":"Thu Jun 23 00:26:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Prime Day isn't until next month, but Amazon is already rolling out early access deals for Prime members. https://t.co/6gfTPXLnRk","date":"Thu Jun 23 00:07:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Sometimes, you get persuaded when you don’t have enough insight or even enough courage to stand up for what you believe in,” the “Apocalypse Now” star said. https://t.co/Kdx36EgxO1","date":"Wed Jun 22 23:47:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Owen Wilson and Vince Vaughn have nothing on Tom Hanks.\n https://t.co/JxoqvoTGoi","date":"Wed Jun 22 23:27:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A woman has accused the Oscar-winning filmmaker of having sex with her over two days without her consent. https://t.co/251AcrT3LY","date":"Wed Jun 22 23:07:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The couple tied the knot in a Washington, D.C. ceremony last month, several years after they first connected over their shared love of learning and literature. https://t.co/5MoCM5psE0","date":"Wed Jun 22 22:46:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Georgia Supreme Court said evidence that Justin Ross Harris intentionally and maliciously left his toddler son Cooper in his car to die “was far from overwhelming.” https://t.co/FzufETpj6T","date":"Wed Jun 22 22:26:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Still, as previously noted you really don’t need to clean out your earwax unless there’s a problem ― and even then, it’s best to have a medical professional handle the process.\n\nRead more best practices for dealing with earwax. https://t.co/6qNNTLG6cl","date":"Wed Jun 22 22:17:39 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"There are also products like Debrox drops, which contain carbamide peroxide (a combination of hydrogen peroxide and urea) to help dissolve the earwax. https://t.co/6qNNTLG6cl https://t.co/UXRN2t4Vwd","date":"Wed Jun 22 22:17:39 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"If you’re still wanting to clean your ears, just focus on the outside area and any wax that’s already on its way out. “Just wipe the outside with a soapy finger or washcloth,” Block said. https://t.co/6qNNTLG6cl https://t.co/mkgWmuWHcm","date":"Wed Jun 22 22:17:38 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"And bad news if you prefer using ear candles: In addition to causing other forms of potential harm, this method doesn’t seem to work. https://t.co/6qNNTLG6cl https://t.co/33FZcsuxDA","date":"Wed Jun 22 22:17:37 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"If you insist on cleaning your earwax, don’t use Q-tips. Cotton swabs like Q-tips can scratch the ear canal and cause bleeding or even lead to ear drum damage. https://t.co/6qNNTLG6cl https://t.co/wxoTbGfLd3","date":"Wed Jun 22 22:17:36 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"So, how can you clean your ears properly? Experts break down the best practices when it comes to dealing with earwax.👇\nhttps://t.co/6qNNTLG6cl https://t.co/2DEv5Udgut","date":"Wed Jun 22 22:17:35 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"However, some people have a migration problem and produce too much wax or wax of an abnormal consistency. They might be prone to wax infections and require medical intervention to remove their earwax. https://t.co/6qNNTLG6cl https://t.co/6zP99oj6hg","date":"Wed Jun 22 22:17:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"First of all, you probably don’t need to clean out your ears. Ears are “self-cleaning,” so you don’t really need to wash the inside area. Plus, earwax protects your ears from water damage and infection. https://t.co/6qNNTLG6cl https://t.co/JHoPF8FgqS","date":"Wed Jun 22 22:17:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Our bodies produce all kinds of substances. One that can be really bothersome is earwax. But believe it or not, this substance actually serves a purpose ― and you need to be careful when it comes to removing it. https://t.co/6qNNTLG6cl","date":"Wed Jun 22 22:17:33 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I can see your phone,\" a reporter told Johnson, calling out the ruse. https://t.co/6ca2u9GE7E","date":"Wed Jun 22 22:06:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The NFL and six of its teams have filed for arbitration in the lawsuit that alleges they engaged in racial discrimination. https://t.co/b3965ncV8S","date":"Wed Jun 22 21:47:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"As GOP election deniers prepare to test American democracy again, the few Republicans who thwarted Trump's 2020 lies still won't fully break with him. https://t.co/OHzTOlraKs","date":"Wed Jun 22 21:27:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"North Dakota Senator Kevin Cramer said he injured the little finger on his right hand this past weekend after a boulder rolled over it while he was doing yardwork. https://t.co/EKiqBFljmC","date":"Wed Jun 22 21:07:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Be wary of offers for free medical supplies. https://t.co/caMtmvkVgX","date":"Wed Jun 22 20:46:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: Tony Siragusa, the former NFL defensive tackle who was known during his career as “The Goose,” died Wednesday at the age of 55. https://t.co/rsxAd4rGiQ","date":"Wed Jun 22 20:39:37 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Gillum faces 21 federal charges related to a scheme to seek donations and funnel a portion of them back to him through third parties. https://t.co/aSU0BUgl2S","date":"Wed Jun 22 20:26:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"It's \"our only chance to prove to the world what Arab women can do, the arts we can create,\" one member said. https://t.co/QKXv4lx1Qj","date":"Wed Jun 22 20:06:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The star said the experience left him feeling “pretty foolish in the end.” https://t.co/XV8Vv6EZRL","date":"Wed Jun 22 19:46:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I think it’s different for everyone,” the SKKN by Kim founder explained on \"Today.\" https://t.co/VdKIfDoIZS","date":"Wed Jun 22 19:27:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The tentative settlement also includes changes in police policies and training involving traffic stops like the one that resulted in Wright's death by former officer Kim Potter. https://t.co/L19i8NOhKR","date":"Wed Jun 22 19:07:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Abusive partners would be able to get their guns back after five years if they avoid additional domestic violence convictions. https://t.co/TCNDzeeJux","date":"Wed Jun 22 18:46:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Some of Rado's most famous songs from the show include the title song, \"Aquarius/Let The Sunshine In,\" and \"Good Morning Starshine.\" https://t.co/udEVCOZ35k","date":"Wed Jun 22 18:26:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The new guidance covers checkout bags, eating utensils, food containers, ring carriers, stir sticks and straws. https://t.co/UnbYjOcEbH","date":"Wed Jun 22 18:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Some lawmakers in the president's party are resistant to the idea of temporarily suspending the 18-cent federal gas tax to help alleviate pain at the pump. https://t.co/HFlkoXFWW2","date":"Wed Jun 22 17:46:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The April attack at the Green Village base wounded four American troops, the U.S. military said. https://t.co/UdbrjZmf70","date":"Wed Jun 22 17:26:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I got obsessed,” said Pitt, who acquired radar equipment to hunt for the loot. “Like for a year, this was all I could think about, just the excitement of it all.” https://t.co/Hh3TcBRWgG","date":"Wed Jun 22 17:25:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"So was Pitt successful in his hunt? Read the full story: https://t.co/XV8Vv6WAJj","date":"Wed Jun 22 17:25:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Pitt told GQ that the man told him there were “millions of dollars worth of gold” left by the villa’s medieval owners that had been “taken from the Levant during the Crusades and buried on the grounds.” https://t.co/vuQtkyUq87","date":"Wed Jun 22 17:25:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Oscar winner was swindled by an unnamed man who convinced him that the property he once shared with ex-wife Angelina Jolie was even more valuable than the estimated $60 million the former couple forked over for it back in 2008. https://t.co/XV8Vv6WAJj","date":"Wed Jun 22 17:25:14 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"In a stunning rebuke of today’s relatable celebrity culture, Brad Pitt revealed he spent a year hunting for buried medieval treasure that never existed beneath his French estate. https://t.co/XV8Vv6WAJj","date":"Wed Jun 22 17:25:14 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"We mourn a life lost much too soon,\" the team said. https://t.co/znsxRQRZFn","date":"Wed Jun 22 17:07:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former Cubs and Yankees player got shredded for his first competition. https://t.co/gsVUfxeK3o","date":"Wed Jun 22 16:47:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"President Biden just signed an Executive Order against LGBTQ+ conversion therapy, the therapy I endured in my 20s that left me contemplating suicide.\" https://t.co/PM9hqJePWp","date":"Wed Jun 22 16:27:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"During the 2020 budget year, the IRS processed more than 240 million tax returns, according to the latest IRS data. https://t.co/xXEmvy9X9G","date":"Wed Jun 22 16:06:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The far-right former House speaker rudely assessed Harris' prospects for a presidential run on Fox News. https://t.co/u88PfGh760","date":"Wed Jun 22 15:46:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The ABC News anchor fired back at the GOP former governor after he likened Jan. 6 to previous presidential election outcomes. https://t.co/LQqhUYW8WA","date":"Wed Jun 22 15:26:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I'm running on a great record, as a homegrown candidate,” the New York City Council member said. https://t.co/RjMLLUT0Ty","date":"Wed Jun 22 15:07:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Broadway League said masks will be optional in July, but still encourages theater audience members to wear them. https://t.co/jKUlXiqzpd","date":"Wed Jun 22 14:47:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The new policy comes more than a year after two foot pursuits ended with officers fatally shooting a 13-year-old boy and 22-year-old man. https://t.co/ugOy1qSzXB","date":"Wed Jun 22 14:27:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: Jaylon Ferguson, a linebacker for the Baltimore Ravens who played in 10 games last season, has died.  https://t.co/znsxRQRZFn","date":"Wed Jun 22 14:16:41 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Fox News anchor pointed out the failure of Trump and his team to show any proof of ballot-rigging during the latest Jan. 6 hearing. https://t.co/yPxwAoSvu4","date":"Wed Jun 22 14:06:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"In a nation with the highest rate of gun ownership, Republicans have somehow concluded that we should add more guns. https://t.co/wqDGaKFBmb","date":"Wed Jun 22 13:46:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Senate has advanced a new bipartisan safety bill and has high hopes of getting it passed as soon as possible. https://t.co/25k3d5tTkY","date":"Wed Jun 22 13:43:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Stave off dreaded summer body sweat with Bust Dust, a talc-free miracle powder. https://t.co/hl6PMMDeZl","date":"Wed Jun 22 13:26:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Let's solve our stomachs' age-old problem. https://t.co/WkE3DaPabF","date":"Wed Jun 22 13:06:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"These portable movie projectors, pop-up screens and sound bars will turn your backyard into a theater. https://t.co/V2ldEQf8bR","date":"Wed Jun 22 12:46:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"These cute swimsuits are flattering and provide a bit more coverage, in just the right places. https://t.co/9K4i5h6TvP","date":"Wed Jun 22 12:27:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Noticeably improve the time you spend outside, whether you play games, hike, skate, walk, or just like to relax in a shady lounge chair. https://t.co/1DcLRCtRFX","date":"Wed Jun 22 12:07:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The move is meant to ease financial pressures at the pump for millions of Americans. https://t.co/rKul4udzdT","date":"Wed Jun 22 11:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"There's something deeply satisfying about this. https://t.co/M3n7z4FweX","date":"Wed Jun 22 11:27:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Reporters Without Borders said it believes Maks Levin and serviceman Oleksiy Chernyshov were killed in Russian-occupied woodlands, citing its investigation findings. https://t.co/kwwEyJxDHk","date":"Wed Jun 22 11:06:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Phish frontman was grinning from ear to ear as the young fan sang the classic tune. https://t.co/tNCnxfXMsV","date":"Wed Jun 22 10:46:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The reality TV star also revealed how Davidson helps take care of her skin after she falls asleep. https://t.co/SFQFviw4Kn","date":"Wed Jun 22 10:26:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The New Jersey senator said it's hard for him to \"escape the feelings\" and \"anger\" of what he witnessed at the U.S. Capitol. https://t.co/phd5abLw4L","date":"Wed Jun 22 10:06:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Texas Department of Public Safety director called the police response to the Uvalde school shooting an \"abject failure.\" https://t.co/PXbq15DcKJ","date":"Wed Jun 22 09:46:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The \"Late Show\" host rips the \"moocher\" former president. https://t.co/hW5nqhStHN","date":"Wed Jun 22 09:26:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"At least 90 houses have reportedly been destroyed in Paktika and dozens of people are believed trapped under the rubble. https://t.co/pGYJn7GWFa","date":"Wed Jun 22 09:07:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The homeowners found the bees after they flew outside their kitchen window. https://t.co/LjeD3WGQhf","date":"Wed Jun 22 08:47:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sandy Hook Elementary was also razed following the school shooting there in 2012. https://t.co/hI6C4PkdoZ","date":"Wed Jun 22 08:27:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former New York mayor's bizarre election claim gets put to the test. https://t.co/GsUZUyqsyh","date":"Wed Jun 22 08:07:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lawmakers have been working to bridge a political impasse after the mass shooting at an elementary school in Uvalde, Texas, last month. https://t.co/evtek1OoRN","date":"Wed Jun 22 07:46:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Fox News host compared the \"Late Show\" crew's arrest in a congressional building to the deadly Jan. 6 attack on the U.S. Capitol. https://t.co/CQnzWQg0rs","date":"Wed Jun 22 07:26:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The jetliner was carrying 126 people and caught fire after landing at Miami International Airport on Tuesday. https://t.co/tAzphp9pFl","date":"Wed Jun 22 07:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Britt triumphed over Rep. Mo Brooks in a race where former President Donald Trump flipped his initial endorsement to belatedly support her. https://t.co/6if5yezCB6","date":"Wed Jun 22 06:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The new laws that Democratic Gov. Jon Bel Edwards signed anticipate the fall of the Supreme Court decision Roe v. Wade. https://t.co/bVPPJw6ujz","date":"Wed Jun 22 06:26:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The two iconic artists recently took a leap into the world of house music with new, unexpected tunes. https://t.co/EaC7mi7a82","date":"Wed Jun 22 06:06:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Bipartisan Safer Communities Act includes modest curbs on obtaining firearms, and aid for mental health and schools. https://t.co/Hkek7JatH2","date":"Wed Jun 22 05:47:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Ravnsborg was immediately removed from office and is barred from serving in public office ever again. https://t.co/H15gMoUorz","date":"Wed Jun 22 05:27:08 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jurors found that the comedian intentionally caused harmful sexual contact with Judy Huth, now 64, and awarded her $500,000. https://t.co/T5wyNNVHnd","date":"Wed Jun 22 05:07:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The campaign to keep Donald Trump in power amounted to smoke and mirrors. https://t.co/OCX7kqdZqJ","date":"Wed Jun 22 04:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Arizona House Speaker Rusty Bowers told the Jan. 6 committee that he repeatedly asked for proof of the stolen election, but Giuliani never came through. https://t.co/PnKahHqSeS","date":"Wed Jun 22 04:27:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Grammy winner paused his show at London's Wembley Stadium this weekend to encourage a young Italian fan to embrace his sexuality. https://t.co/Obt3iwpWLu","date":"Wed Jun 22 04:06:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The visitor center will offer tours, lectures and visual art and be located adjacent to the Stonewall Inn, the symbolic birthplace of the LGBTQ rights movement. https://t.co/6YilpPna61","date":"Wed Jun 22 03:46:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jessica Cisneros, an attorney, highlighted Cuellar’s opposition to abortion rights and the persistence of poverty in South Texas. https://t.co/gjcHsz8HC3","date":"Wed Jun 22 03:26:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Georgia secretary of state said private contact information for him and his wife was revealed after he refused to go along with Trump’s election lies. https://t.co/HRBqlxpk6l","date":"Wed Jun 22 03:06:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A new Adam Sandler film and a South African crime thriller are also trending on the streaming service. https://t.co/8macavY14m","date":"Wed Jun 22 02:46:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The people at highest risk are men who have sex with men and who have multiple partners, participate in group sex or attend venues where sex occurs on the premises. https://t.co/tNJw4PMOtQ","date":"Wed Jun 22 02:26:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Just over a quarter of abortion clinics in the country will be forced to close, mostly because of trigger laws in the South and Midwest, according to a new report. https://t.co/pcD0RMPJMH","date":"Wed Jun 22 02:07:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Just before Pence certified Joe Biden's 2020 election victory, the senator sought to give him documents falsely suggesting Biden lost Michigan and Wisconsin. https://t.co/26F5kGT6EP","date":"Wed Jun 22 01:47:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jason Ravnsborg is accused of lying to investigators and abusing the power of his office after he struck and killed a pedestrian. https://t.co/vNJfLolTku","date":"Wed Jun 22 01:27:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A docuseries about crime and technology and a vampire romance are also trending on the streaming service. https://t.co/iqNbkksInY","date":"Wed Jun 22 01:07:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Rusty Bowers smacked down Trump's claims of election fraud, saying, \"I do not want to be a winner by cheating.\" https://t.co/M8Usrt05XZ","date":"Wed Jun 22 00:46:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Half of Black immigrant cleaners and nannies surveyed said they had to work in places where they or others had COVID-19. https://t.co/q2rZjvvwV5","date":"Wed Jun 22 00:26:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The president said he \"didn’t know [oil company executives would] get their feelings hurt that quickly.\" https://t.co/9E2YymjfH4","date":"Wed Jun 22 00:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The comedy star said criticism from Duke Ellington School of Arts students “sincerely hurt me.” https://t.co/C6dWcj9liE","date":"Tue Jun 21 23:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Marvel star said he \"would love\" to reprise his role as Johnny Storm. https://t.co/JvC9n9T2uI","date":"Tue Jun 21 23:26:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"What was supposed to be the happiest day of our lives ended in irreversible heartbreak,\" the Stereo Kicks member said of Danielle Hampson. https://t.co/2dMhY3p5FP","date":"Tue Jun 21 23:07:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Get the JBL Clip 4 for 25% off before the sale ends. https://t.co/dnbJhvqdZ0","date":"Tue Jun 21 22:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"About 6,000 people gathered at the ancient stone circle in southern England to watch the sun rise at 4:49 a.m. on a clear, crisp morning, local police said. https://t.co/q4Q8Hw3QUt","date":"Tue Jun 21 22:26:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"There were handlers in gloves that put it on me,\" the reality TV icon told \"Today\" in an interview, adding that she wore the gown for just four minutes in total. https://t.co/aCgucl7YeL","date":"Tue Jun 21 22:11:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Indianapolis typically fills 17 pools each year, but with a national lifeguard shortage exacerbated by the COVID-19 pandemic, just five are open this summer. https://t.co/2vOrUKkdj3","date":"Tue Jun 21 22:06:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Is Steve going to be OK? https://t.co/RdmgZp0ULh","date":"Tue Jun 21 21:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Officers spent an hour waiting for a key to a door that was open the whole time. https://t.co/pa7IPeQNna","date":"Tue Jun 21 21:26:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I’m so not capable of making healthy, smart decisions and I know it,\" the actor told The Hollywood Reporter. https://t.co/sZiVLgh1Rp","date":"Tue Jun 21 21:07:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"With Donald Trump already defeated, impeached and no longer in office, experts look at how to judge success for the committee investigating his plot to overthrow the government. https://t.co/jN6MbqpwMP","date":"Tue Jun 21 20:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The left-leaning Supreme Court justice vehemently disagreed with the high court's rulings on the separation of church and state. https://t.co/NailasQ3C9","date":"Tue Jun 21 20:27:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Georgia Secretary of State Brad Raffensperger and Arizona House Speaker Russell Bowers faced threats for doing their jobs and refusing to be part of Trump's conspiracy. https://t.co/BKk7YNi89N","date":"Tue Jun 21 20:06:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Cleveland Browns quarterback has been accused of sexual assault and harassment. https://t.co/chMWAB5LvN","date":"Tue Jun 21 19:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former Purdue star played his last NBA game in March 2020 before the pandemic shut down the league. https://t.co/feQVq4qosK","date":"Tue Jun 21 19:26:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“White Supremacists Facing Consequences Fills Me With Joy” may be the first anti-seditionist song to make you want to slow dance. https://t.co/sgOa047dhZ","date":"Tue Jun 21 19:07:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former county clerk faced immense backlash for issuing licenses to six same-sex couples 39 years before Colorado embraced marriage equality. https://t.co/WYRQ9XxagQ","date":"Tue Jun 21 18:47:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"In a new campaign ad, a Missouri Senate candidate is holding a shotgun and urging his supporters to go “RINO hunting.” https://t.co/rOXnBCri0M","date":"Tue Jun 21 18:45:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"We are so sorry we could not give you the show you deserved,\" the country band wrote on Instagram. https://t.co/xyS3oL5Mq4","date":"Tue Jun 21 18:26:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Washington Post reviewed video from the March 2021 meeting, in which the headliner called Donald Trump \"the only legitimate president.” https://t.co/SEwUrejWtm","date":"Tue Jun 21 18:06:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"All three businesses have significant stand-alone potential, CEO Steve Cahillane said. https://t.co/Heh6rua5H6","date":"Tue Jun 21 17:46:51 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Greg Fischer, mayor of Kentucky's largest city, was assaulted months after a gunman attacked Craig Greenberg, a candidate in the race to replace Fischer. https://t.co/GtFqL2Y4yG","date":"Tue Jun 21 17:26:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The director of the Texas Department of Public Safety gave a damning criticism of the law enforcement response to the mass shooting at Robb Elementary School. https://t.co/qOrqQBikBw","date":"Tue Jun 21 17:07:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Duchess of Cambridge celebrated her 40th birthday back in January. https://t.co/w4xJR0SCzL","date":"Tue Jun 21 17:07:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"BREAKING: State election officials faced severe pressure to help former President Donald Trump overturn the result of the 2020 presidential election. https://t.co/BKk7YNi89N","date":"Tue Jun 21 17:05:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Col. Steve McCraw said Uvalde police had enough officers on the scene to stop the gunman within three minutes. https://t.co/5URwhAMCZj","date":"Tue Jun 21 16:47:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Even as the pandemic rages on, the event steadfastly highlighted impressive movies across genres, languages and formats that attendees — both virtual and in-person — could enjoy. https://t.co/sqmZ4GGV1E","date":"Tue Jun 21 16:27:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The ruling is the latest in a line of decisions from the Supreme Court that have favored religion-based discrimination claims. https://t.co/obzeNizchM","date":"Tue Jun 21 16:06:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jannick Holste stunned the persnickety judge on \"America's Got Talent.\" https://t.co/4DjurK3Hpr","date":"Tue Jun 21 15:46:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Supreme Court has rejected Bayer’s appeal to shut down thousands of lawsuits claiming that its Roundup weedkiller causes cancer. https://t.co/T0jaeCNltS","date":"Tue Jun 21 15:26:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The artist and music historian is amplifying voices and calling out the erasure of Black Latino contributions to music through her platform, Reggaeton Con La Gata. https://t.co/B7luDLI4CW","date":"Tue Jun 21 15:06:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I thought about all those times I sat in his study across from him, aching to ask him if he needed to tell me anything before it was too late. I’d open my mouth, but the words never formed.\" https://t.co/bFelIM5NHh","date":"Tue Jun 21 14:47:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"During a performance at the Los Angeles Dance Foundation’s Blue Diamond Gala, Jennifer Lopez performed a duet with her child Emme Muñiz, whom she introduced using gender-neutral pronouns.\n https://t.co/ONlcUBoGtF","date":"Tue Jun 21 14:41:40 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The two chose a few special songs to perform, including one of Lopez’s biggest hits. \n\nWatch clips from the performance here: https://t.co/JbemvGqIah","date":"Tue Jun 21 14:40:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“So this is a very special occasion. They are very, very busy. Booked. And pricey. They cost me when they come out. But they’re worth every single penny because they’re my favorite duet partner of all time. So if you will indulge me.”","date":"Tue Jun 21 14:40:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The two have performed together before, including at the Super Bowl in 2020.\n\nLopez coparents Emme and their twin brother Max with her ex-husband, Marc Anthony.","date":"Tue Jun 21 14:40:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“The last time we performed together was in a big stadium like this and I ask them to sing with me all the time, and they won’t,” the actor and singer said onstage at the Los Angeles Dance Foundation’s Blue Diamond Gala on Thursday. https://t.co/E3sWKGUTmf","date":"Tue Jun 21 14:40:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jennifer Lopez performed a beautiful duet recently with one of her 14-year-old twins, Emme Muñiz, whom she introduced using gender-neutral pronouns. https://t.co/JbemvGqIah","date":"Tue Jun 21 14:40:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"No wonder the movie star thought, \"I f**king hate this business.\" https://t.co/QbW5uwhMNB","date":"Tue Jun 21 14:27:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former vice president told Fox News Digital he won't allow Democrats to use the insurrection to distract from their \"failed agenda.\" https://t.co/Tj1g6kACvL","date":"Tue Jun 21 14:07:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Cherelle and Brittney Griner have not spoken by phone in the four months since the basketball star's arrest in Russia, where she remains jailed. https://t.co/aTUL5w86gH","date":"Tue Jun 21 13:47:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Stephen Colbert opened up about what exactly happened after members of his production team were arrested by Capitol Police. https://t.co/igs2HCnMcZ","date":"Tue Jun 21 13:45:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The guest host gleefully mocked Fox News after the president's tumble. https://t.co/qAisvfuffa","date":"Tue Jun 21 13:26:56 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The ruling underscores how divisive the issue remains in Japan, the only member of the Group of Seven major industrialized nations that does not recognize same-sex unions. https://t.co/jLdQM7dqAD","date":"Tue Jun 21 13:06:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Not all air fryers are created equal, it seems. https://t.co/yyPOw74qQI","date":"Tue Jun 21 12:46:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The campaign focuses on 13 Republicans in districts Democrats see as winnable. https://t.co/d21up1QGVm","date":"Tue Jun 21 12:26:45 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Menstrual cups, period underwear, reusable pads and more products you can order today if can't find tampons in stores. https://t.co/5hdL4AKuov","date":"Tue Jun 21 12:07:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Always losing your keys or forgetting what you were going to say? These everyday habits could be affecting your memory. https://t.co/yViUTAKC4f","date":"Tue Jun 21 11:47:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"His film “Every Day in Kaimukī” was the first Native Hawaiian feature-length film to premiere at the Sundance Film Festival. https://t.co/DeZHr5iluG","date":"Tue Jun 21 11:27:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Plus: Are kitchen uniforms as we know them inherently unfair? https://t.co/B9puWvG6Jn","date":"Tue Jun 21 11:07:03 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Alleviate post-workout soreness with these expert-recommended tools. https://t.co/kBF6j0wl6X","date":"Tue Jun 21 10:47:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The artist is giving Black boys permission to actively, intentionally seek their own happiness with initiatives like the S.M.I.L.E-ing Boys Project. https://t.co/aoa97ePbOS","date":"Tue Jun 21 10:26:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Can it really prevent wrinkles? How young is too young to get this procedure? Here's an all-encompassing guide to this popular treatment. https://t.co/98KTbW9lVA","date":"Tue Jun 21 10:06:52 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"From Black codes to sundown towns, a quiet threat has long hung over the lives of African Americans in the South. https://t.co/Ah8twzTsMY","date":"Tue Jun 21 09:46:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A settlement agreement has been reached on the eve of a second trial pitting the Kardashian family against former reality TV star Blac Chyna. https://t.co/bVhQT0hrCf","date":"Tue Jun 21 09:26:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lynn Malerba, the first woman to be named ceremonial chief of the Mohegan Tribe, will have her name on currency and head up a new Treasury Department tribal affairs office. https://t.co/UbxNAtLRcG","date":"Tue Jun 21 09:00:40 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The gas tax is currently 18.4 cents a gallon. Any freeze would require action by Congress. https://t.co/Tz1uPNgFJT","date":"Tue Jun 21 07:55:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The \"Late Night\" team was guilty of \"puppetry in the first degree,\" the host joked. https://t.co/2UjtxdlR3P","date":"Tue Jun 21 07:02:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Even Rudy Giuliani wasn't sure about John Eastman's Mike Pence ploy on Jan. 6. https://t.co/CZnwhl8q3t","date":"Tue Jun 21 06:28:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I think some Southern Baptists lost their minds when a Black man was elected president,\" said minister Kevin Smith. https://t.co/hQ1Y3l8pJF","date":"Tue Jun 21 04:31:40 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"As great of a basketball player as he was, he was an even better person,\" his coach said. https://t.co/IIX5LZWP1S","date":"Tue Jun 21 04:11:36 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"She no longer wishes to be \"related to my biological father in any way, shape or form,\" according to a Los Angeles court filing. https://t.co/LoyJhvA8Fl","date":"Tue Jun 21 03:01:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"They're my favorite duet partner of all time,\" the music superstar said of the 14-year-old. https://t.co/JbemvGqIah","date":"Tue Jun 21 02:41:26 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Documents examined by the Austin American-Statesman show armed officers stood in the hallway with at least one ballistic shield within 19 minutes of a gunman arriving at the school. https://t.co/g2962YCNb1","date":"Tue Jun 21 02:21:23 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Facebook removed a video by Missouri Senate candidate Eric Greitens that shows him brandishing a shotgun and declaring that he's hunting Republicans who go against the party. https://t.co/0nrjUR61D4","date":"Tue Jun 21 02:01:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Ultimately, we want same-day voting — one day — and only paper ballots,” Trump said. https://t.co/To2lbYK26x","date":"Mon Jun 20 23:53:35 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Republicans blocked bipartisan commission, then stopped cooperating with the House committee. \"Very, very foolish,\" Trump says in interview. https://t.co/kYH85J41mZ","date":"Mon Jun 20 20:55:42 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The workers in Maryland just voted 65-33 in favor of forming a union. https://t.co/6pSXoRmL03","date":"Mon Jun 20 19:48:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The radio-collared mountain lion known as P-54 met the same violent end as her mother and her cub. https://t.co/GftB9hKGdD","date":"Mon Jun 20 19:27:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"After the party declared \"homosexuality is an abnormal lifestyle choice,\" furious opponents counted the ways Texas Republicans are \"abnormal.\" https://t.co/IufeDapvGe","date":"Mon Jun 20 19:04:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"His name is Meatball. https://t.co/FHGvl4c2RG","date":"Mon Jun 20 17:58:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Seattle Storm superstar, who grew up near NYC and played high school ball in Queens, is set to retire from the WNBA at the end of the season. https://t.co/liDhKgCi8z","date":"Mon Jun 20 17:38:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The election, expected in October or November, would be Israel’s fifth in three years. https://t.co/7lvwWY85pk","date":"Mon Jun 20 17:18:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The quick-thinking Florida dog breeder was being forced to drive by people who wanted to get their hands on his puppies, cops said. https://t.co/N4W2OhId12","date":"Mon Jun 20 16:58:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The giant stingray is one for the books. https://t.co/KnI7SZgTzr","date":"Mon Jun 20 16:38:09 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Eric Greitens released a campaign ad that imagines gun-toting supporters bursting into the homes of his political opponents. https://t.co/Vv90ihxhqn","date":"Mon Jun 20 16:18:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"That wasn't very nice,\" an announcer said. https://t.co/KkX7sWuiIA","date":"Mon Jun 20 15:58:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Tuesday's hearing will focus on Donald Trump’s pressure campaign on officials in key states to overturn election results so he could stay in power. https://t.co/xHokqZG9Ye","date":"Mon Jun 20 15:37:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Numerous questions remain about BTS and its seven members after the announcement that the group was going to spend more time focusing on solo projects. https://t.co/LBb7GuDE03","date":"Mon Jun 20 15:18:22 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The daughter of Angelina Jolie and Brad Pitt showed off her moves at Millennium Dance Complex. https://t.co/sQ7cgGCj9O","date":"Mon Jun 20 14:58:18 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Many voters in Sunday's poll opted for far-right or far-left candidates, denying President Emmanuel Macron’s centrist alliance a straight majority. https://t.co/JT7WlrTnvL","date":"Mon Jun 20 14:38:16 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The sitcom star served time and mostly receded from public life. https://t.co/7Uy99eQJ46","date":"Mon Jun 20 14:18:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"I couldn’t think of one good reason not to, but I still felt uncomfortable with the rarity of giving our baby my last name instead of my husband’s.\" https://t.co/RR5KMPWRju","date":"Mon Jun 20 13:58:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Melissa Francis filed a complaint with the New York State Labor Department last year, arguing Fox News retaliated against her after she brought up the pay gap. https://t.co/6yzdTW91jF","date":"Mon Jun 20 13:38:06 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Russia’s military machine is persevering in its ferocious effort to grind down Ukraine’s defenses. https://t.co/SAZP0otJPv","date":"Mon Jun 20 13:18:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Last Week Tonight\" will hit you where you live. https://t.co/JIxwanG1zA","date":"Mon Jun 20 12:57:57 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Wake up, Republicans, because this is not going to be good for you if you think it is,” Kinzinger said. https://t.co/1V7P6jU2tW","date":"Mon Jun 20 12:37:55 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Many of these triggers and behaviors are common. Here's why they affect your dreams and how to fix them so you get better sleep. https://t.co/zhyruxChSW","date":"Mon Jun 20 12:18:21 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Stylish dresses, skirts, pants and more that seamlessly transition from work to play. https://t.co/uJgAZ8RrnP","date":"Mon Jun 20 11:58:17 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"It's a little-known factor to take into account when your kids are at the pool, drowning experts say. https://t.co/RnRCHh9ICo","date":"Mon Jun 20 11:38:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Violence is entrenched in the United States' ethos. America is savage, and always has been. https://t.co/trzrOwRPZS","date":"Mon Jun 20 11:18:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Are you sensitive to caffeine? Try these options instead, from caffeine-free options to some that just pack less of a punch. https://t.co/ZQ0zAIToGb","date":"Mon Jun 20 10:58:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Jackery Explorer portable power stations are a lifesaver when camping or during blackouts. https://t.co/pzqnqluRCD","date":"Mon Jun 20 10:38:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Dermatologists recommended retinol, antioxidants, SPF and more to prevent premature aging — not just on your face, but on your body. https://t.co/JSdR2WJrip","date":"Mon Jun 20 10:18:02 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The Scottish city is full of great entertainment, art and welcoming locals. https://t.co/TpIAE9OPN7","date":"Mon Jun 20 09:57:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"All those who died in connection to Jan. 6 \"would still be here today had it not been for Donald Trump,\" Sandra Garza told CNN. https://t.co/WR8GezvwFU","date":"Mon Jun 20 09:37:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Criminal intent is critical in charges against Trump over his efforts to overthrow election results, which were clearly legitimate. https://t.co/fuyCtV8gEv","date":"Mon Jun 20 08:21:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A year after Juneteenth became a federal holiday in the U.S., people gathered this weekend at events filled with music, food and fireworks. https://t.co/6yaLajdCzJ","date":"Mon Jun 20 07:10:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Dmitry Muratov, one of the winners of last year's Nobel Peace Prize, said his goal with this donation “is to give the children refugees a chance for a future.” https://t.co/mZxiBAVKeO","date":"Mon Jun 20 06:50:32 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Witnesses say more than 200 people, mostly ethnic Amhara, have been killed in an attack in the country’s Oromia region and are blaming a rebel group, which denies it. https://t.co/N4bVZSiHyO","date":"Mon Jun 20 06:30:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Because of the war, \"their graduation, their prom, their everything, just cracked,\" said photographer Stanislav Senyk. https://t.co/gGHt3wohT4","date":"Mon Jun 20 03:26:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Rotimi Kukoyi will study public health and pursue \"a career driving health equity in our nation.” https://t.co/eDGzsNKtFL","date":"Mon Jun 20 03:04:10 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lofgren accused Trump of \"unleashing\" a new era of lawless violence in the nation with his actions during the insurrection. https://t.co/q5InjR8Bpe","date":"Mon Jun 20 02:06:04 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Nick Akerman said Trump has \"zero defense\" against a criminal probe into 2020 election meddling in Georgia. https://t.co/LPWPR5ErXY","date":"Mon Jun 20 01:46:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The ABC News/Ipsos poll also found that 60% of those surveyed believed the House select committee is conducting a \"fair and impartial\" investigation. https://t.co/K6TUam4EjW","date":"Sun Jun 19 23:51:17 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The historic vote by employees of a Maryland Apple store to unionize — a first for the technology giant — is a significant step in a lengthy process that labor experts say is heavily stacked against workers in favor of their employers. https://t.co/fRAKXPlwup","date":"Sun Jun 19 23:31:15 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Former rebel Gustavo Petro narrowly won a runoff election in Colombia, ushering in a new era of politics by becoming the country’s first leftist president. https://t.co/RbcJMRySin","date":"Sun Jun 19 23:11:11 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"It also opposes \"all efforts to validate transgender identity,\" and supports \"Reintegrative Therapy\" to eliminate \"unwanted same-sex attraction.\" https://t.co/qXwghiIP4c","date":"Sun Jun 19 22:29:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The actor, who is estranged from her biological father, was raised by mother Goldie Hawn and Russell. https://t.co/QRM9Pp7S4N","date":"Sun Jun 19 21:07:53 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Economists have expressed concern that the Fed raising interest rates last week to reduce high inflation could trigger an economic decline. https://t.co/LvgKm9RWXE","date":"Sun Jun 19 20:47:47 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sen. Roger Marshall is “hiding behind his doctor’s degree” to try to scare women about medication abortion, said Sen. Tina Smith. https://t.co/JD6NchfswZ","date":"Sun Jun 19 20:14:12 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Fox is set to star in his first television series in over a decade. https://t.co/hFENaUuC19","date":"Sun Jun 19 19:21:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The film director was detained on Sunday for investigation over allegations that he sexually assaulted a woman in southern Italy. https://t.co/HiMyYgTjVc","date":"Sun Jun 19 19:01:32 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Macron’s government will still have the ability to rule, but only by bargaining with legislators. https://t.co/Q0ulavGIVE","date":"Sun Jun 19 18:41:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Only swimmers who transitioned before the age of 12 will be allowed to compete in women’s events, FINA members voted Sunday. https://t.co/DHZK6WKRht","date":"Sun Jun 19 18:10:13 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Lightyear” did not go to infinity (or beyond) in its first weekend in theaters. https://t.co/F0wkexmJNM","date":"Sun Jun 19 16:41:59 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Britain’s defense ministry said both Russian and Ukrainian combat units are seeing desertions and units refusing to follow orders. https://t.co/la8fq51P5x","date":"Sun Jun 19 14:53:42 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Rep. Dan Crenshaw faced criticism one day after Sen. John Cornyn was booed at the same convention. https://t.co/6pq4mxsVKx","date":"Sun Jun 19 14:33:40 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Madeline Barker, 47, is facing hate crime charges after allegedly making anti-Asian remarks and using pepper spray toward people. https://t.co/yNGbyGub0J","date":"Sun Jun 19 14:01:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Lake's campaign just slammed drag shows, but the candidate has attended many performances, according to a famous Arizona drag queen. https://t.co/EYt3fzvlSm","date":"Sun Jun 19 13:30:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"When I was 12, my dad developed lung cancer. I felt sad to watch him suffer so much from ultimately futile treatments — but the weaker he got, the less afraid I felt.\" https://t.co/k1vVKXcapJ","date":"Sun Jun 19 13:00:23 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The saga that unfolded after a professor officiated a same-sex wedding has exposed deep rifts over how the school treats members of the LGBTQ community -- and how its church interprets the Bible. https://t.co/HE54bst2OX","date":"Sun Jun 19 12:00:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"These gadgets will make life’s little problems disappear. https://t.co/gRQLCdIHeR","date":"Sun Jun 19 10:45:33 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sunscreen for every part of your body, water bottles that won't get hot and much more. https://t.co/6iJkxyL7G2","date":"Sun Jun 19 10:25:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"From Florida to Texas, the people have spoken. https://t.co/qlhbI8y2Xt","date":"Sun Jun 19 10:05:27 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"From tinted moisturizers and foundations to eyeshadows and lip balms. https://t.co/1yeiAqJEnV","date":"Sun Jun 19 09:45:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“There’s a difference between selling merchandise and propagating hate,” the official's daughter said. https://t.co/2RczHvOhkG","date":"Sun Jun 19 07:19:35 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Beloved national park is facing its biggest challenge in decades after massive flooding. https://t.co/kijRv7fqOw","date":"Sun Jun 19 06:33:30 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The city was a destination for ships traveling to the Americas in the transatlantic slave trade. https://t.co/GzYbfoxOZ2","date":"Sun Jun 19 06:05:28 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The police response to the Texas school massacre is being probed in at least three investigations. https://t.co/P0QNjovL9s","date":"Sun Jun 19 05:45:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"They were ready to \"tear Pence limb from limb.\" It was \"as dark as it gets,\" says former Deputy Assistant Attorney General Harry Litman. https://t.co/d1JXAMNowS","date":"Sun Jun 19 03:57:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Pharrell forever changed their lives,\" said an NAACP official, who is now hoping President Biden will take action on student debt. https://t.co/bwASUEcsSU","date":"Sun Jun 19 02:02:32 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Callous post follows videos aired in House select committee hearings showing Trump supporters demanding Mike Pence be \"hanged\" at insurrection. https://t.co/OCzBljU4Wc","date":"Sun Jun 19 01:37:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Workers at the store in Towson Center voted to form a union despite Apple's opposition. https://t.co/CTEe3Vgxme","date":"Sun Jun 19 00:41:21 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Maybe “someone should tell him that he has the right to remain silent and anything he says can and will be used against him in a court of law,\" said Conway. https://t.co/uN5jashKuO","date":"Sun Jun 19 00:17:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Most popular cryptocurrency dropped below key threshold for the first time since 2020, triggering fresh fears. https://t.co/U1GvghEPl6","date":"Sat Jun 18 22:04:01 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“Parents will breathe a sigh of relief knowing these vaccines will very soon be available,” Dr. Jack Resneck, president of the American Medical Association, said in a statement. https://t.co/DNbPJ2HAvf","date":"Sat Jun 18 18:56:07 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A production crew for \"The Late Show With Stephen Colbert\" were charged with unlawful entry of the Capitol. Tucker Carlson called it an \"insurrection.\" https://t.co/6hEXZIJ4Tu","date":"Sat Jun 18 18:24:33 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I'm good,” he told reporters after U.S. Secret Service agents quickly helped him up. https://t.co/hmZ1fYg0MB","date":"Sat Jun 18 16:22:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Dates for the Walk of Fame festivities have yet to be revealed. https://t.co/qAgsuDdOir","date":"Sat Jun 18 14:15:58 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"When I came to ... I was lying on my back in a room I didn’t recognize. ... I felt my naked hip where underwear should have been.\" https://t.co/MEUeRnCA7R","date":"Sat Jun 18 13:13:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Donald Trump compared crowd sizes with Martin Luther King Jr. on Friday. https://t.co/0glVETDODI","date":"Sat Jun 18 12:53:43 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The conservative activist and wife of Supreme Court Justice Clarence Thomas communicated with people in Trump’s orbit ahead of the attack and also on the day of the insurrection. https://t.co/E3ur8Qfd71","date":"Sat Jun 18 12:19:36 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"They're lightweight, have great battery life and work great. https://t.co/PI6lddP3ir","date":"Sat Jun 18 11:25:28 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Trust us, going high tech is a lot less expensive than you might think. https://t.co/GvBSWCgGox","date":"Sat Jun 18 11:05:26 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Make sure your future is free of mosquitos, ants, spiders and other critters. https://t.co/RWo4Qvn8v6","date":"Sat Jun 18 10:45:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Because of course eating fruit soft serve every day will make life better. https://t.co/u4iVsxCbaO","date":"Sat Jun 18 10:25:21 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Details that emerged after the arrest of 31 white supremacists in Coeur D'Alene show how GOP rhetoric is signaling extremists to attack LGBTQ people. https://t.co/nThYkExqki","date":"Sat Jun 18 10:05:19 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A fruit fly trapper, an adjustable mister to keep you cool on your deck and other things that will help you live with those rising temps. https://t.co/sYYzkEv5Dr","date":"Sat Jun 18 09:45:17 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The crash also injured six others involved in the streaming platform's series \"The Chosen One.\" https://t.co/I5g8CE1ubk","date":"Sat Jun 18 07:16:30 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Trump “wasn’t just stirring up his insurrectionists to create chaos,” she said. He put  Pence's life at risk to illegally stay in Oval Office, Mary Trump charges. https://t.co/5SCvDuzWYU","date":"Sat Jun 18 06:30:24 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Robert Smigel, the voice for Triumph the Insult Comic Dog, was among those charged with unlawful entry at a congressional office building. https://t.co/SxeWefSxj6","date":"Sat Jun 18 04:57:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Equal time means sitting your lying ass in a witness chair. We'll wait,\" tweets the California Democrat. https://t.co/R1aYENlE8G","date":"Sat Jun 18 04:37:41 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Sen. John Cornyn, who's in the bipartisan group hammering out a gun deal, faced a tough crowd in his home state. https://t.co/lqfhi9lDxv","date":"Sat Jun 18 04:17:37 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Get home and raise your kids!\" Christian Walker lectures men as the public learns his own dad has three other children. https://t.co/sGFzDO9QLw","date":"Sat Jun 18 03:57:33 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The mascot named Murph is the first for the foam dart-maker introduced in 1969. https://t.co/F00VKzp7V6","date":"Sat Jun 18 03:00:54 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"This could get .... interesting,\" the Democrat said. https://t.co/CyVdAfgILV","date":"Sat Jun 18 02:37:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The head of the Nativity School in Massachusetts says flags declare \"all are welcome,\" representing \"value of inclusion rooted in Catholic teaching.\" https://t.co/OAPLbUjQjQ","date":"Sat Jun 18 00:28:05 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Couy Griffin was sentenced to 14 days in jail, but was credited for the 20 he spent behind bars after his arrest. https://t.co/2ddCY9YDuM","date":"Sat Jun 18 00:05:31 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"They face charges including assault, theft, trespassing, property destruction and conspiracy. https://t.co/2qnsBXRmXC","date":"Fri Jun 17 23:45:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Blair, who pitched for the Peoria Redwings, spoke publicly about her sexuality at a screening for a series reboot of the baseball classic. https://t.co/frtTkhpQt5","date":"Fri Jun 17 23:25:23 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"About 20 students are seeking an independent review and policy changes, including increased transparency and communication from the district. https://t.co/t9AGSJDcUF","date":"Fri Jun 17 23:05:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A Texas lawmaking leading an investigation into the Uvalde elementary school shooting says local police have agreed to meet with his committee. https://t.co/BENZrBeGad","date":"Fri Jun 17 22:45:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The couple started dating in 2010 while playing brother and sister on the NBC series \"Parenthood.\" https://t.co/c4csfIjycH","date":"Fri Jun 17 22:25:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Me, garfield’s vet: feeding him WHAT\" https://t.co/bWT2WjaSxJ","date":"Fri Jun 17 22:05:41 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Teller says he told producers: \"I don’t need a double, I will play and sing this live.\" https://t.co/uSDPDAA50c","date":"Fri Jun 17 21:45:34 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"My kid told me he deserved more cheese and who am I to argue with that\" https://t.co/j5Dq2k45wp","date":"Fri Jun 17 21:25:31 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"Some journalists and pundits offered snap assessments of last week’s election and all but declared reform movements dead — but the reality is much more complicated. https://t.co/Lq3VyXnH6O","date":"Fri Jun 17 21:05:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"\"Free iced coffee today at Dunkin if you let them swipe your credit card !!!!\" https://t.co/l3NhO6ky7p","date":"Fri Jun 17 20:45:49 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The young actor, who was also in “Fear the Walking Dead” and “Just Add Magic: Mystery City,” died Thursday in his Los Angeles home. https://t.co/eyQBDL35R8","date":"Fri Jun 17 20:25:46 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The FDA approved Pfizer and Moderna COVID-19 vaccines for children under 5. https://t.co/U9gEFGAlYU","date":"Fri Jun 17 20:07:00 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The letter's authors urged executives to distance the company from CEO Elon Musk, citing his recent “distracting” and “embarrassing” behavior. https://t.co/iYcGhHCExV","date":"Fri Jun 17 20:05:41 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"This facial toning microcurrent device has gained near-cult status, and you can find it on Amazon. https://t.co/mDEd1HZ1jo","date":"Fri Jun 17 19:45:33 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"And you thought the lottery was just a game of chance. Read the story the new film #JerryAndMarge is based on. https://t.co/C2lGFLYIOD","date":"Fri Jun 17 19:39:44 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The “Real Housewives of Atlanta” star reminisces on how betting on her pen opened doors for her career in music and beyond. https://t.co/jUMIi3NHCS","date":"Fri Jun 17 19:25:29 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"One person compared the former Trump aide's antics in court to \"a slow-rolling comedy sketch.\" https://t.co/uXZDcxtTMz","date":"Fri Jun 17 19:05:25 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"“I was a distinguished public servant for four years!” Navarro said during a court appearance earlier this month. https://t.co/3BiREdHKML","date":"Fri Jun 17 18:45:50 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"A photo showed Greg Gianforte and his wife dining in Italy just minutes after his office said he was returning to the state “as quickly as possible.” https://t.co/EhKTPeL2kK","date":"Fri Jun 17 18:25:48 +0000 2022","user_id":"14511951"},{"handle":"HuffPost","text":"The former \"Saturday Night Live\" star made his presence felt on \"The Kardashians.\" https://t.co/3osmSZXddR","date":"Fri Jun 17 18:05:43 +0000 2022","user_id":"14511951"}]