[{"handle":"NBCNews","text":"An off-duty Rhode Island police officer who was running for state Senate is under investigation for allegedly attacking his female opponent during an abortion rights protest Friday night. https://t.co/7zIErSQ8wL","date":"Sat Jun 25 22:34:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"About 200 people broke into an $8 million Florida home, threw a party and posted videos of it on social media. https://t.co/R8ijUUj31S","date":"Sat Jun 25 22:03:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Washington Gov. Inslee says he will push for a state constitutional amendment to protect abortion rights within his state’s borders. https://t.co/FHFMqIeaQP","date":"Sat Jun 25 21:34:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"People gather in New York City Saturday to protest against the Supreme Court ruling overturning Roe v. Wade.\n\n📷 Spencer Platt / Getty Images\n\nhttps://t.co/PXAQGZmZdD https://t.co/0g3KxthyJj","date":"Sat Jun 25 21:10:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"MAP: 23 states would ban abortion in a post-Roe America.\n\nhttps://t.co/csuX6QOtYi https://t.co/JZkMVqdY2h","date":"Sat Jun 25 21:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Thousands of people took to the streets of Warsaw on Saturday in a joint march for peace uniting Ukraine’s KyivPride with Poland’s Warsaw Pride. - @NBCOUT https://t.co/42gBZz7vQa","date":"Sat Jun 25 20:31:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Pfizer says tweaking its Covid vaccine to better target the omicron variant is safe and works. https://t.co/iWhFUmT7dJ","date":"Sat Jun 25 20:29:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Florida man was taken into custody after he scaled the Frederick Douglass Memorial Bridge in Washington, D.C., Friday morning and stayed overnight in support of abortion rights, NBC Washington reports. https://t.co/0l3spxLTBW","date":"Sat Jun 25 20:24:48 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"This abortion pill might also treat conditions like cancer and PTSD. It’s future is uncertain in a post-Roe world.\n— AP https://t.co/wDWTuX6QtE","date":"Sat Jun 25 20:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"What began as a peaceful protest late Friday by nearly 8,000 people outside the state capitol building “evolved in anarchical and criminal actions by masses of splinter groups,” the Arizona Department of Public Safety says. https://t.co/Dzkr48wT29","date":"Sat Jun 25 19:34:22 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"This is how the US ‘protects’ #humanrights.\" \n\nChina's Foreign Ministry spokesperson criticizes the U.S. Supreme Court decision. https://t.co/ENrl48M4Y5","date":"Sat Jun 25 19:32:48 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Demonstrators hit the streets for a second day of protests after the Roe V. Wade reversal. https://t.co/fwqJvTk1JP","date":"Sat Jun 25 19:32:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden does not support expanding the Supreme Court, the White House says. https://t.co/XpdY6GH3Ae","date":"Sat Jun 25 19:31:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"One person was killed and two others were injured in a shooting at a WeatherTech facility in Illinois early Saturday morning. https://t.co/PJt7GD9kCQ","date":"Sat Jun 25 19:02:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President of the National Medical Association: \"At a time when maternal mortality rates are worsening, particularly for Black women, it is deeply disappointing that our institutions are actively harming — not helping — women’s health.\" https://t.co/ybGksxmtSh","date":"Sat Jun 25 18:39:34 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Speaker Pelosi: \"For all of these politicians — including the justices of the Supreme Court, who are so absolutist about a woman’s reproductive health — what would they do if this story happened to their loved one?\" https://t.co/6rigje77vq","date":"Sat Jun 25 18:36:25 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Minnesota Gov. Walz says he signed an executive order that provides protections for people traveling to his state for an abortion. https://t.co/pq0UbDWOq2","date":"Sat Jun 25 18:33:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Ukrainian troops have “almost left” Sievierodonetsk after weeks of intense fighting against Russian forces, the mayor of the eastern city says. \n\nThe retreat, if confirmed, would bring Moscow close to full control of Luhansk. https://t.co/cbW2Y2IqH3","date":"Sat Jun 25 18:31:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"What U.S. women can learn from Poland’s recent abortion restrictions\nhttps://t.co/OKUv3ayWdY","date":"Sat Jun 25 18:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Tera W. Hunter: Make no mistakes about it: Demonizing Black people was a key part of growing the Big Lie. - @NBCNewsTHINK https://t.co/WsSzSksMhR","date":"Sat Jun 25 17:40:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Americans infuriated by the Supreme Court’s decision to overturn Roe v. Wade hit the streets Saturday for a second day of mass protests.\n\n📷 Hannah Beier / @NBCNews\n \nhttps://t.co/m2YQoifnJv https://t.co/O7EFhv3vqZ","date":"Sat Jun 25 17:39:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"American College of Obstetricians and Gynecologists: “The impact of this irresponsible decision will fall disproportionately on people who already face barriers accessing health care.\" https://t.co/XuR765XdTV","date":"Sat Jun 25 17:35:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Americans infuriated by the Supreme Court’s decision to overturn Roe v. Wade and counterprotesters hit the streets Saturday for a second day of mass protests. \n\n📷 Hannah Beier / @NBCNews \n\nhttps://t.co/m2YQoifnJv https://t.co/RHISf35gLy","date":"Sat Jun 25 17:32:29 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"More than 100 global health organizations sign a statement describing the Supreme Court's decision to overturn Roe v. Wade as a \"catastrophic blow to the lives of millions of women, girls and pregnant people.\" https://t.co/on84iYvInQ","date":"Sat Jun 25 17:20:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Democratic candidate for Rhode Island State Senate says she was punched in the face Friday evening by her Republican opponent at an abortion rights rally in Rhode Island. https://t.co/fR2ijPzTvO","date":"Sat Jun 25 17:16:43 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In a world without Roe, abortion pill use will likely rise and those denied abortions are more likely to report mental health issues, like anxiety and depression, one study found.\nhttps://t.co/iLFGOx1Gtg","date":"Sat Jun 25 17:01:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Threats of political violence, particularly against judges and state officials, are likely to intensify after the Supreme Court decision, according to a Department of Homeland Security memo. https://t.co/Xby2vdWqqA","date":"Sat Jun 25 16:43:51 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Demonstrators hit the streets for a second day of protests after the Roe V. Wade reversal. https://t.co/CdiuD93W9L","date":"Sat Jun 25 16:42:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Actress Rita Moreno says she is \"frightened\" after the Supreme Court overturned Roe v. Wade, recalling how she underwent a scary botched abortion before it became legal in 1973. https://t.co/gx6OXYCz8t","date":"Sat Jun 25 16:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Alito, pressed in his 2006 confirmation hearing on whether overturning Roe would undermine legitimacy of the court, would only say that the legitimacy of the court would be undermined “in any case if the Court made a decision based on its perception of public opinion.” https://t.co/i6Gd87CAfD","date":"Sat Jun 25 16:22:44 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"MAP: 23 states would ban abortion in a post-Roe America.\n\nhttps://t.co/oVa9vxrYqL https://t.co/RzQmz16aGW","date":"Sat Jun 25 16:21:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Gorsuch, in 2017, would only characterize Roe as “a precedent of the U.S. Supreme Court” reaffirmed by several subsequent cases. He went on to say that precedent fills out U.S. law. https://t.co/gNQqIihyjy https://t.co/TxjAk06SB8","date":"Sat Jun 25 16:17:54 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In his 2018 confirmation hearing, Justice Kavanaugh was questioned repeatedly about Roe and Casey. \n\nSen. Dianne Feinstein, pressed him to say it was settled law, but Kavanaugh declined to say so by arguing it would diminish the independence of the judiciary. https://t.co/ophRSSAaaL","date":"Sat Jun 25 16:13:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In her 2020 hearing, Justice Barrett was pressed on why she would characterize Brown v. Board of Education, but not Roe V. Wade, as super precedent. https://t.co/gNQqIihyjy https://t.co/OSnhUUgviF","date":"Sat Jun 25 16:06:57 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"After Friday's Supreme Court ruling overturning Roe v. Wade, lawmakers who support abortion rights argued that some of the justices who voted in the majority opinion misled senators during their confirmation process. https://t.co/gNQqIihyjy","date":"Sat Jun 25 16:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Warren and Sen. Smith urge President Biden to \"declare a public health emergency\" to protect abortion access following the abortion ruling. https://t.co/N5sc4USJhh","date":"Sat Jun 25 15:44:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A group of French lawmakers will propose a bill to inscribe abortion rights into the country’s constitution, according to a statement. https://t.co/nEjujjrj9W","date":"Sat Jun 25 15:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Here's a look at some of the films and shows that put the national discussion around Roe V. Wade in deeper historical context. https://t.co/JdpHAMfMi1","date":"Sat Jun 25 15:21:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden signs into law the most sweeping legislation aimed at preventing gun violence in 30 years.\n\n“God willing, it's going to save a lot of lives.\" https://t.co/mDuoguRV3L","date":"Sat Jun 25 15:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Abortion rights demonstrators protest outside the U.S. Supreme Court on Friday.\n\n📷 Hannah Beier / @NBCNews \n\nhttps://t.co/pE8syhPPWA https://t.co/XHscKRSfFC","date":"Sat Jun 25 14:49:38 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Connecticut woman who says she’s descended from slaves who are portrayed in widely published, historical photos owned by Harvard University can sue the school for emotional distress, Massachusetts’ highest court rules. - @NBCBLK https://t.co/cvt6l3fqMe","date":"Sat Jun 25 14:42:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"What happened elsewhere must not happen in France.\" \n\nFrench lawmakers will propose a bill to inscribe abortion rights into the country’s constitution, according to a statement. https://t.co/mubiceMWsJ","date":"Sat Jun 25 14:36:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Lynn Stuart Parramore: The loss of reproductive rights is poised to deliver a crashing blow that many in America’s already-precarious middle class cannot sustain. - @NBCNewsTHINK  https://t.co/OM1I2Lsfrh","date":"Sat Jun 25 14:21:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“I think the Supreme Court has made some terrible decisions,” President Biden said when asked Saturday about the Roe ruling. https://t.co/2MnXKzCJKp","date":"Sat Jun 25 14:15:58 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Billie Eilish and Phoebe Bridgers blast abortion ruling: \"It’s about the concept of power and how we need to always remember not to abuse it.\" https://t.co/Xx6Awj51Ub","date":"Sat Jun 25 14:10:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Athletes react to abortion decision: \"I think the cruelty is the point because this is not pro life by any means.\" https://t.co/0BRVH7VEbT","date":"Sat Jun 25 14:08:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"This abortion pill might also treat conditions like cancer and PTSD. It’s future is uncertain in a post-Roe world.\n— AP https://t.co/owbBz0QKkA","date":"Sat Jun 25 14:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Law enforcement officers used tear gas during protests outside the Arizona Senate Building in Phoenix after part of a door was broken, the state Department of Public Safety says. https://t.co/SpBSQHA1C5","date":"Sat Jun 25 13:57:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A truck hit a person in Cedar Rapids, Iowa, on Friday evening, where people were marching after the Supreme Court decision. https://t.co/nNchAAWAqz","date":"Sat Jun 25 13:54:37 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden sets off to meet with world leaders in Europe next week with a domestic priority of inflation amid fears the global economy could tip into a recession. https://t.co/HvGuMkW0Tq","date":"Sat Jun 25 13:41:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE UPDATES: ROE V. WADE OVERTURNED\n\n• Protests and celebrations erupt across the country\n\n• President Biden says it's up to voters in November to select candidates who would protect a host of rights — from abortion to marriage equality\n\nhttps://t.co/EkwhtDave7","date":"Sat Jun 25 13:37:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden signs into law the most sweeping legislation aimed at preventing gun violence in 30 years.\n\n“God willing, it's going to save a lot of lives.\" https://t.co/lTLJ48Y9GK","date":"Sat Jun 25 13:31:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"Our lives have been altered. But we still stand together as a community.\"\n\nUvalde High School seniors graduate one month after the Robb Elementary School shooting. https://t.co/BoJiQLFKRz","date":"Sat Jun 25 13:21:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Olympic swimmer rescued by her coach after fainting during world championships says the last thing she remembered was not feeling \"too great\" before going down. https://t.co/IyUXml8q9E","date":"Sat Jun 25 13:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. federal appeals court puts on hold the FDA’s ban on sales of Juul e-cigarettes. https://t.co/F0ePba52iL","date":"Sat Jun 25 12:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The parents of a premature baby who survived for 12 days are suing a Boston hospital for losing their child’s remains. https://t.co/2XRiwM4Qj5","date":"Sat Jun 25 11:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Pennsylvania school principal was arrested and accused of having a years-long sexual relationship with a student, authorities say. https://t.co/YNftdrnlzq","date":"Sat Jun 25 10:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Republican National Committee is intensely interested in holding its 2024 presidential convention in Nashville — but its push is already bogged down in local issues and politics that pit the blue city against the state's GOP governor. https://t.co/UWcHuhdBXJ","date":"Sat Jun 25 09:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"China strips city of its honorary “civilized” status after a group of men beat 4 women outside a restaurant this month.\n\nThe assault sparked widespread condemnation, renewing a national discussion about misogyny and violence against women. https://t.co/rQ1MuJV4gr","date":"Sat Jun 25 08:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Anti-abortion legislation can have unintended medical consequences that extend beyond women seeking to terminate a pregnancy — particularly in the management of a miscarriage, experts say. https://t.co/ggXZzbrYog","date":"Sat Jun 25 07:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Japanese worker loses USB with entire city’s data after night out with colleagues. https://t.co/H0jKdMwnix","date":"Sat Jun 25 06:02:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Group of women hiking on an Arizona mountain — reportedly for a religious reality show called \"Bad Girls Gone God\" — were rescued on Thursday, with several taken to a hospital for heat-related issues. https://t.co/QIB6iKWOrt","date":"Sat Jun 25 05:42:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Andrea Askowitz: By telling men to shut up, we made a grave error. Women barely held political power, and we let men off the hook. - @NBCNewsTHINK https://t.co/x19HWHiwBq","date":"Sat Jun 25 05:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Thomas, in a concurring opinion to the Roe decision, says the court must revisit and overrule past landmark decisions that legalized the right to obtain contraception, the right to same-sex intimacy and the right to same-sex marriage. https://t.co/HJcNlKloqL","date":"Sat Jun 25 05:02:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Virginia couple missing at sea for 11 days radioed Coast Guard watchstanders in Virginia to say they are alive and well and en route to the boat's home port, the Coast Guard says. https://t.co/3ynAFm4jeN","date":"Sat Jun 25 04:52:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The sign posted on the window of the Harry E. Reed Insurance Agency on Monday read, “Juneteenth ~it’s whatever... We're closed. Enjoy your fried chicken &amp; collard greens.” https://t.co/GkWSGkeW7y","date":"Sat Jun 25 04:42:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Black bear dies after getting stuck inside a car, likely in pursuit of food, amid sweltering heat in Tennessee this week, officials say. https://t.co/WigQQ7le0Z","date":"Sat Jun 25 04:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court's decision to overturn Roe v. Wade could pave the way for states to restrict access to some contraceptives, two legal experts say. https://t.co/ObD0HDZkth","date":"Sat Jun 25 04:12:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Reports of potential cases have poured in since the CDC issued a nationwide alert to physicians in April, asking them to be on the lookout for unexplained cases of liver inflammation in kids. https://t.co/qLYcy9xVzL","date":"Sat Jun 25 04:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A man has been found guilty of murder and attempted murder for fatally stabbing five people and wounding others in southern Norway when he attacked strangers with a bow and arrows and knives. https://t.co/jtXsOdZscB","date":"Sat Jun 25 03:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Prosecutors from 29 states, territories and Washington, D.C., signed a joint statement that included signatories from states like Mississippi, Missouri and Wisconsin that have banned or are poised to ban abortion services following the reversal of Roe. https://t.co/fEO30oAwmC","date":"Sat Jun 25 03:31:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The president who ended the right to abortion and the president now leading the charge to restore it switched places later in life. https://t.co/Z9Y46fgaqb","date":"Sat Jun 25 03:22:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Organizers of this weekend's Pride events from Kentucky, to New York City say they are expecting this weekend’s LGBTQ celebrations to resemble what the advocates of the nation’s first Pride marches had envisioned in the 1970s — heartfelt, loud protests. https://t.co/nqyyC8vUKZ","date":"Sat Jun 25 03:02:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Two people have been killed and 14 were wounded in a shooting at a nightclub and in nearby streets in Norway’s capital Oslo, police say. https://t.co/vYujMxGQkP","date":"Sat Jun 25 02:52:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court’s decision to overturn the landmark Roe v. Wade ruling that ensured a right to abortion is sure to shake up competitive campaigns across the country. https://t.co/7XM8nvNriG","date":"Sat Jun 25 02:42:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In the U.S., abortion rights advocates look to the mobilization that has taken place among women and abortion rights supporters in Latin America as a template, as they stress the need for political mobilization. https://t.co/ybNA36xf3E","date":"Sat Jun 25 02:22:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Some legal experts fear that prosecutors will use intimate pieces of evidence, such as text messages, internet search history and period tracking apps to build their cases, as well as, perhaps, information gathered from medical professionals. https://t.co/Q28zJljquA","date":"Sat Jun 25 02:02:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The mix of “trigger” laws and pre-Roe abortion bans—spanning 18 states—are in various states of implementation: Some were enforced immediately, others are scheduled to take effect in 30 days and some are on the books but with no specified enforcement date. https://t.co/g2gIAPvsIM","date":"Sat Jun 25 01:42:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“It feels like a betrayal,” one demonstrator said. “It feels like my country doesn’t love me and appreciate my body as a woman. I can’t even chant because I can’t say anything. It hurts.” https://t.co/ZvvDP2xsAU","date":"Sat Jun 25 01:22:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Providers have been left to scramble, consult with lawyers and even close their doors while doctors, patients and activists contended with the panic and heartbreak of the moment. https://t.co/NFBqnBbTYt","date":"Sat Jun 25 01:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court's decision will make it more difficult for many Americans to obtain medication abortions, either via telehealth or in person. https://t.co/C9ORRvsUES","date":"Sat Jun 25 00:42:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The willingness of the court to overturn precedent could, some advocates fear, signal other federally protected rights of minorities may be in jeopardy, such as same-sex marriage. https://t.co/Rqij1QuzWO","date":"Sat Jun 25 00:22:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A letter addressed to Planned Parenthood in Arkansas warned that \"purposefully performing or attempting to perform an abortion is a felony punishable by up to 10 years' imprisonment and a fine of up to $100,000.\" https://t.co/hOPCmY2z7y","date":"Sat Jun 25 00:13:54 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In an interview, Gov. Pritzker said he expects Illinois will serve as a mecca to women living in red states that had banned or severely restricted abortion. https://t.co/2UIkxGbnYj","date":"Fri Jun 24 23:42:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Dozens of elected prosecutors say they won't prosecute those seeking or assisting in abortion care. https://t.co/Z1zcxOuln1","date":"Fri Jun 24 23:21:23 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"If you live in a state set to ban abortions, how far might you have to travel to get one? On average, it's a 4 hour drive. https://t.co/UKOZ4YaF6E","date":"Fri Jun 24 23:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Thomas, in a concurring opinion to the Roe decision, says the court must revisit and overrule past landmark decisions that legalized the right to obtain contraception, the right to same-sex intimacy and the right to same-sex marriage. https://t.co/xM2VEDTjTw","date":"Fri Jun 24 22:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"While liberals blame former President Trump for nominating judges who have delivered on his promise to shift the court dramatically to the political right, conservatives credit him for the very same reason. https://t.co/u52Gspc895","date":"Fri Jun 24 22:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Some of the country’s biggest companies — including Paramount, Disney, Amazon and Netflix — are telling employees that their benefits include travel costs for abortions. https://t.co/K2EnU0CMPJ","date":"Fri Jun 24 22:03:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"First lady Jill Biden: \"While we may be devastated by this injustice, we will not be silent. We will not sit back as the progress we have already won slips away.\" https://t.co/HXXhXvsIFw","date":"Fri Jun 24 21:52:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"Caring for employees extends beyond basic health insurance.\"\n\nOutdoor apparel company Patagonia says full and part-time employees “who peacefully protest for reproductive justice” and are arrested will have their bail covered. https://t.co/XwdiJdOweI","date":"Fri Jun 24 21:47:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Abortion providers will likely face an increased rate of stalkings, invasions and assaults, experts say. https://t.co/4iVMglK7at","date":"Fri Jun 24 21:41:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Planned Parenthood Arizona is halting abortion services across the state in light of the Supreme Court's decision. https://t.co/03r8qlzjGQ","date":"Fri Jun 24 21:34:35 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"5 key arguments from the Supreme Court’s decision to overturn Roe v. Wade: https://t.co/Da7Cd0wJ1V","date":"Fri Jun 24 21:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Businesses board up windows and install fencing to protect storefronts from protests after the decision. https://t.co/44YAUVFSRc","date":"Fri Jun 24 21:15:52 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Alexandria Ocasio-Cortez embraces an abortion rights advocate outside the Supreme Court.\n\n📷 @frankthorp / @NBCNews \nhttps://t.co/83Zl0cMwNc https://t.co/r4NoyqZ4nI","date":"Fri Jun 24 21:09:23 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Anti-abortion advocates celebrate outside of the Supreme Court after the decision to overturn Roe.\n\n📷 @frankthorp / @NBCNews \nhttps://t.co/83Zl0cMwNc https://t.co/Rt8Tm7avPo","date":"Fri Jun 24 21:05:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Activists on both sides of the abortion issue cried tears of celebration and mourning upon hearing news of the end of the Roe era. https://t.co/eACslMzYzP","date":"Fri Jun 24 21:01:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"An abortion rights advocate cries outside the Supreme Court on Friday.\n\n📷 Frank Thorp V / @NBCNews \nhttps://t.co/83Zl0cMwNc https://t.co/65LCJiTyJd","date":"Fri Jun 24 21:00:58 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Planned Parenthood of Greater New York says it will increase services by 20%.\n\n\"We are committed to ensuring equitable access to all New Yorkers and people across the country in states hostile toward health care — and abortion is health care.”\nhttps://t.co/ouHzmEzZzA","date":"Fri Jun 24 20:48:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"All six justices who voted to uphold the Mississippi law were asked about Roe v. Wade during their confirmation hearings, saying they would broadly respect legal precedents, but declined to comment on abortion rights cases specifically. https://t.co/EzLRdA73oA","date":"Fri Jun 24 20:40:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former President Clinton says the Supreme Court's decision \"puts partisanship ahead of precedent, ideology ahead of evidence, and the power of a small minority ahead of the clear will of the people.\" https://t.co/2nQNjZ9lRx","date":"Fri Jun 24 20:33:17 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Protesters gather outside of Jackson Women's Health Organization, an abortion clinic in Mississippi that is at the center of a decision to reverse abortion rights. https://t.co/mT3xZk7OOk","date":"Fri Jun 24 20:32:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"How the U.S. compares with the rest of the world on attitudes toward abortions. https://t.co/M6B3ueirHV https://t.co/IcJRdkxpXV","date":"Fri Jun 24 20:11:24 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court’s decision to overturn Roe v. Wade reverberated across the world, with health groups and U.S. allies criticizing the ruling as a step backward that could have global implications. https://t.co/HILX4yfItN","date":"Fri Jun 24 20:03:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Head of International Planned Parenthood: “The highest court in the land has reached its lowest point.\"\n\n\"We know for a fact that banning abortion does not mean fewer abortions and that when abortion bans are enacted, women and pregnant people die.\" https://t.co/Z7yOwMWYhj","date":"Fri Jun 24 20:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Vice President Harris: \"You have the power to elect leaders who will defend or protect your rights.\" https://t.co/PBWdDDOxEG","date":"Fri Jun 24 19:57:58 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden: \"This fall, Roe is on the ballot. Personal freedoms are on the ballot.\"\n\nThe Supreme Court’s ruling to overturn Roe v. Wade ignited a political firestorm in a heated election year, with Democrats vowing political revenge at the ballot box. https://t.co/S19cnjqPeN","date":"Fri Jun 24 19:27:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Litigation Director of the Center for Reproductive Rights: \"Generations of people have relied on this right and they’ll now be thrown into a world without it.\"\n\n\"The impact of this ruling truly will be swift and severe.\" https://t.co/8M8RE23ieU","date":"Fri Jun 24 19:24:41 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Hawley predicts the ruling will impact voters’ decisions on what jobs to take, where to locate their families, “probably redraw some demographic lines around the country, and will lead to impacts in voting patterns.\" https://t.co/e8CHxRI1WA","date":"Fri Jun 24 19:12:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Some of the country’s biggest companies — including Paramount, Disney, Amazon and Netflix — are telling employees that their benefits include travel costs for abortions. https://t.co/uR4gXmhT2u","date":"Fri Jun 24 18:53:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former DNC Chair and Virginia Gov. Terry McAuliffe: \"If this doesn’t mobilize folks to come out and talk bout how important elections are, and how people can’t sit at home, and how elections really do matter, this has proven the case.\" https://t.co/oil24w4rOu","date":"Fri Jun 24 18:50:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Senate Minority Leader McConnell calls the ruling “courageous and correct” and a \"historic victory for the Constitution and for the most vulnerable in our society.” https://t.co/sFXO3f6jOO","date":"Fri Jun 24 18:46:16 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Collins: “This decision is inconsistent with what Justices Gorsuch and Kavanaugh said in their testimony.\"\n\nManchin: \"I trusted Justice Gorsuch and Justice Kavanaugh.\"\n\nThese senators suggest they were misled by Kavanaugh and Gorsuch on Roe v. Wade. https://t.co/Ez1TXL648V","date":"Fri Jun 24 18:34:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"People protest the decision to overturn Roe v. Wade in front of U.S. Supreme Court in Washington, D.C.\n\n📷 Brandon Bell / Getty Images https://t.co/Y7ZbXwb9mx https://t.co/Bl0cUTwM9b","date":"Fri Jun 24 18:18:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Thomas, in a concurring opinion to the Roe decision, says the court must revisit and overrule past landmark decisions that legalized the right to obtain contraception, the right to same-sex intimacy and the right to same-sex marriage. https://t.co/wBGTLRtgF8","date":"Fri Jun 24 18:16:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Secretary of Defense Lloyd Austin says the Pentagon will \"closely\" examine the decision and evaluate its policies to ensure it continues to provide seamless access to reproductive health care as permitted by federal law. https://t.co/Ta5KVMLdKx","date":"Fri Jun 24 18:13:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Hillary Clinton: \"Today’s Supreme Court opinion will live in infamy as a step backward for women's rights and human rights.\" https://t.co/WvSj5Qa68X","date":"Fri Jun 24 18:05:39 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"With Roe v. Wade overturned, exceptions to abortion bans — such as in the case of rape or incest — are expected to be the only way to getting abortions in many states.\nBut meeting those qualifications can be complex and traumatizing, experts say. https://t.co/IHSBXOIE2e","date":"Fri Jun 24 18:03:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In a letter, Oklahoma's AG John O'Connor says he will begin efforts immediately to enforce Oklahoma’s abortion prohibitions. https://t.co/dcbkXjL4Xn","date":"Fri Jun 24 17:55:19 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former President Trump takes credit for the Supreme Court's decision to overturn Roe, saying the ruling and \"other decisions\" recently announced \"were only made possible because I delivered everything as promised.\" https://t.co/9QcO27vpDY","date":"Fri Jun 24 17:50:46 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Kennedy: \"Roe v. Wade has misrepresented the Constitution since the ruling was rendered, and today’s decision to return the issue of abortion to the American people and the states corrects a legal and moral error.\" https://t.co/eFdMOXHFkq","date":"Fri Jun 24 17:43:25 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: House passes the most expansive gun legislation in nearly 30 years, sending it to President Biden for his signature. https://t.co/Gg11mXRDgB","date":"Fri Jun 24 17:38:59 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Liz Cheney says she has \"always been strongly pro-life.\"\n\n\"Today’s ruling by the Supreme Court returns power to the states and the people of the states to address the issue of abortion under state law.\" https://t.co/Zi9kRIgqJC","date":"Fri Jun 24 17:31:45 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden urges people to \"to keep all protests peaceful,\" during a White House speech, reiterating: \"Peaceful, peaceful, peaceful. No intimidation. Violence is never acceptable.\" https://t.co/pTDzWkh2ZG","date":"Fri Jun 24 17:18:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Alexandria Ocasio-Cortez: “People will die because of this decision. And we will never stop until abortion rights are restored in the United States of America.” https://t.co/S4bIaz7bWH","date":"Fri Jun 24 17:18:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Head of the World Health Organization: \"I am very disappointed, because women’s rights must be protected. And I would have expected America to protect such rights.\" https://t.co/fyjZAJJcya","date":"Fri Jun 24 17:14:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Sanders: \"Democrats must now end the filibuster in the Senate, codify Roe v. Wade, and once again make abortion legal and safe.\" https://t.co/vz9I6lKWgs","date":"Fri Jun 24 17:12:17 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden says \"voters need to make their voices heard\" at the ballot box in November's midterm elections because he is unable to restore abortion protections and Congress lacks the votes to take that action. https://t.co/G0Tp6rjJ91","date":"Fri Jun 24 17:07:31 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Jim Obergefell, the plaintiff in the Supreme Court decision that established the right to same-sex marriage, calls today's verdict \"a sad day for women's rights.\"\n\n\"This Supreme Court continues to erode the rights of citizens at an alarming rate.\"  https://t.co/gvj9F7q7EU","date":"Fri Jun 24 17:04:13 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Public tours of the U.S. Capitol were abruptly halted after the Supreme Court's ruling, allowing Capitol Police to shift some of their resources to the court complex, a source familiar with the decision says. https://t.co/p9SCnqlkNi","date":"Fri Jun 24 16:59:47 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Scotland First Minister Nicola Sturgeon: \"One of the darkest days for women’s rights in my lifetime.\"\n\n\"Solidarity doesn’t feel enough right now — but it is necessary.\" https://t.co/EmuI0aeDY4","date":"Fri Jun 24 16:58:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Longtime civil rights advocate Rev. Al Sharpton says the court's decision \"is a blatant attempt to bring us back to the dark ages\" and \"will disproportionately impact Black women, and poor women.\" https://t.co/saGtQyQHAp","date":"Fri Jun 24 16:56:30 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justices Breyer, Sotomayor, and Kagan: \"With sorrow — for this Court, but more, for the many millions of American women who have today lost a fundamental constitutional protection — we dissent.\" https://t.co/V6PnFm5gmp","date":"Fri Jun 24 16:55:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Planned Parenthood Wisconsin announces it is “temporarily suspending” abortion services.\n\n“Please know that we are looking at all legal options available. This news is so incredibly devastating.\" https://t.co/mvXLEZxmbm","date":"Fri Jun 24 16:54:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Activists on both sides of the abortion issue gather outside the Supreme Court to bear witness to the end of the Roe era. https://t.co/EGtf2F1UgX","date":"Fri Jun 24 16:52:52 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden lays out actions his administration will take in an effort to ease access to abortion after the Supreme Court's decision to overturn Roe v. Wade. https://t.co/YN9SmjJ1iq https://t.co/lyiQ6PZWxn","date":"Fri Jun 24 16:51:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Canadian PM Trudeau: \"The news coming out of the United States is horrific.\"\n\n\"No government, politician, or man should tell a woman what she can and cannot do with her body.\" https://t.co/xoMBZukffh","date":"Fri Jun 24 16:45:16 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Attorney General Merrick Garland vows to protect access to Mifepristone, which is used along with another medication to end early pregnancies. https://t.co/KUoZIiVv9R","date":"Fri Jun 24 16:42:23 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE: President Biden speaks on the Supreme Court's decision to overturn Roe v. Wade. https://t.co/NF7PA004vJ https://t.co/1ofJwbcgIH","date":"Fri Jun 24 16:38:40 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Collins: \"Throwing out a precedent overnight that the country has relied upon for half a century is not conservative. It is a sudden and radical jolt to the country that will lead to political chaos.\" https://t.co/xyZ5yVTpvO","date":"Fri Jun 24 16:38:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"One result of today’s decision is certain: the curtailment of women’s rights, and of their status as free and equal citizens.”\n\nJustices of the Supreme Court's liberal wing slammed the “draconian” decision of overturning Roe v. Wade. https://t.co/G1XsSvsM1B","date":"Fri Jun 24 16:33:16 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"British PM Boris Johnson: “This is not our court, it’s another jurisdiction, but it clearly has massive impacts on people’s thinking around the world.\"\n\n\"I think it’s a big step backwards.\" https://t.co/n2yGFa0nwt","date":"Fri Jun 24 16:29:22 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Missouri Gov. Parson signs a proclamation making it illegal for doctors to perform abortions and also makes anyone who knowingly induces an abortion guilty of a felony. https://t.co/dB5Bwtg7GY","date":"Fri Jun 24 16:25:36 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Texas AG Ken Paxton: \"SCOTUS just overruled Roe &amp; Casey, ending one of the most morally &amp; legally corrupt eras in US history. Praise the Lord. Abortion is now illegal in Texas.\" https://t.co/BMRevEFyUZ","date":"Fri Jun 24 16:22:30 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"At least 150 Democratic lawmakers march to the Supreme Court to protest the overturning of Roe v. Wade.\n\n\"They did it in utter disregard for the 60% of the American people who support Roe and did not want it overturned,\" Rep. Butterfield says. https://t.co/MuzByanxEx","date":"Fri Jun 24 16:20:20 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"God made the decision,\" former President Trump tells Fox. \n\n\"In the end, this is something that will work out for everybody ... This brings everything back to the states where it has always belonged.\" https://t.co/x4SKCSzqlf","date":"Fri Jun 24 16:18:53 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"House Speaker Pelosi criticized the Supreme Court for overturning Roe v. Wade and suggested that Trump-appointed justices lied when they told lawmakers during their confirmation hearings that they respected the precedent of the 1973 ruling. https://t.co/gc2ww1HixM","date":"Fri Jun 24 16:17:15 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Attorney General Merrick Garland: “The Justice Department will use every tool at our disposal to protect reproductive freedom. And we will not waver from this Department’s founding responsibility to protect the civil rights of all Americans.\" https://t.co/rxWffYX5NK","date":"Fri Jun 24 16:01:37 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Attorney General Merrick Garland: \"The Justice Department strongly disagrees with the Court’s decision.\" https://t.co/rxWffYX5NK","date":"Fri Jun 24 16:00:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"New York City Mayor Eric Adams says New Yorkers can still access safe, legal abortions in the city and people around the country seeking the procedure are \"welcome here\" to access those services. https://t.co/giW8hSOu8B","date":"Fri Jun 24 15:56:22 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Massachusetts Gov. Charlie Baker signs an executive order protecting health care providers performing abortions from losing their licenses or receiving other discipline based on potential charges from out of state. https://t.co/O8pK17xaro","date":"Fri Jun 24 15:54:41 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Without Roe v. Wade, people seeking an abortion in states where the procedure will be banned will face long treks, often by multiple means of transportation, in order to get care. https://t.co/QFbTgLsVwA","date":"Fri Jun 24 15:50:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Someone without a car in Columbia, Missouri, will have a hard time traveling to the nearest clinic, more than 150 miles away in Overland Park, Kansas. https://t.co/QFbTgLsVwA https://t.co/ijKIQh3Mn4","date":"Fri Jun 24 15:45:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"From Boise, Idaho, the drive is more than 250 miles to a health center in Washington. A patient in Idaho Falls won’t even be able to get to the nearest clinic — approximately 290 miles away in Helena, Montana — without a car. https://t.co/QFbTgLsVwA https://t.co/fBx2k2zqBw","date":"Fri Jun 24 15:42:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former first lady Michelle Obama says she is \"heartbroken for people around this country who just lost the fundamental right to make informed decisions about their own bodies.\" https://t.co/ikJqclSk9G","date":"Fri Jun 24 15:41:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former President Obama: \"The Supreme Court not only reversed nearly 50 years of precedent, it relegated the most intensely personal decision someone can make to the whims of politicians and ideologues.\" https://t.co/ikJqclSk9G","date":"Fri Jun 24 15:40:35 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"For someone living in Salt Lake City, it will require driving six hours and traveling roughly 335 miles to the nearest open clinic in Steamboat Springs, Colorado. https://t.co/QFbTgLsVwA https://t.co/RlvafjuVlp","date":"Fri Jun 24 15:37:57 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A recent @NBCNews poll showed only 30% of U.S. voters wanted Roe v. Wade overturned. https://t.co/PC7HrCFzpY","date":"Fri Jun 24 15:37:25 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The White House has been preparing for the Supreme Court's decision to overturn Roe v. Wade, and is poised to release a range of federal actions aimed at easing access to abortion. https://t.co/CNWZ5AOjqP","date":"Fri Jun 24 15:36:51 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NAACP General Counsel Janette McCarthy Wallace: \"There is no denying the fact that this is a direct attack on all women, and Black women stand to be disproportionately impacted by the court's egregious assault on basic human rights.\" https://t.co/XekA7kk4jQ","date":"Fri Jun 24 15:36:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden will address the Supreme Court's ruling in remarks at approximately 12:30 p.m. ET, according to the White House. https://t.co/UbAZOUdU4o","date":"Fri Jun 24 15:35:44 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Senate Majority Whip Durbin says the Senate Judiciary Committee will hold a hearing next month to \"explore the grim reality of a post-Roe America.\" https://t.co/1YoI2qswYp","date":"Fri Jun 24 15:35:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":".@nbcnews analyzed the distance to the nearest open abortion clinic from major cities in 21 states that either have pre-existing or pending state-level abortion bans that will go into effect following the ruling to overturn Roe v. Wade. https://t.co/la1UZQPrl6","date":"Fri Jun 24 15:34:29 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"If you live in a state set to ban abortions, how far might you have to travel to get one? On average, it's a 4 hour drive. https://t.co/la1UZQPrl6","date":"Fri Jun 24 15:31:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LGBTQ rights activists fear the willingness of the court to overturn precedent could signal other federally protected rights of minorities may be in jeopardy, such as same-sex marriage. https://t.co/1V9IItV43B","date":"Fri Jun 24 15:28:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Manchin: \"I trusted Justice Gorsuch and Justice Kavanaugh when they testified under oath that they also believed Roe v. Wade was settled legal precedent and I am alarmed they chose to reject the stability the ruling has provided ...\" https://t.co/6ONQSovmcv","date":"Fri Jun 24 15:26:41 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Manchin says he was raised \"pro-life\" as a Catholic and still maintains that view.\n\n\"But I have come to accept that my definition of pro-life may not be someone else’s definition of pro-life. I believe that exceptions should be made.\" https://t.co/6ONQSoMX43","date":"Fri Jun 24 15:23:29 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"American Civil Liberties Union: “Second-class status for women has once again become the law.\"\n\n“The Supreme Court has just plunged this country and itself into a historic crisis, one that will reverberate far beyond the ability to get an abortion.\" https://t.co/xxt7kC9Jsk","date":"Fri Jun 24 15:19:46 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former Vice President Pence: \"Having been given this second chance for Life, we must not rest and must not relent until the sanctity of life is restored to the center of American law in every state.\" https://t.co/gdMKgLBymj","date":"Fri Jun 24 15:16:21 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"March for Life President Jeanne Mancini praises decision to overturn Roe v. Wade: “We will continue to march until abortion is unthinkable because equality begins in the womb.” https://t.co/msyu2t6qh8","date":"Fri Jun 24 15:11:24 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Senate Majority Leader Schumer says a fundamental right was \"stolen\" from American women Friday, making it \"one of the darkest days our country has ever seen.\" https://t.co/xSL1nB8c4a","date":"Fri Jun 24 15:05:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Speaker Pelosi: \"American women today have less freedom than their mothers.\" https://t.co/NF7PA00Clh https://t.co/olDXeEaF9v","date":"Fri Jun 24 14:59:54 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Speaker Pelosi: \"Because of Donald Trump, Mitch McConnell, the Republican Party and their supermajority on the Supreme Court, American women today have less freedom than their mothers.\" https://t.co/mesrhxQQDu","date":"Fri Jun 24 14:51:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"INTERACTIVE: Without Roe v. Wade, people seeking an abortion in states where the procedure will be banned will face long treks. How far might you have to travel? On average, it's a 4 hour drive. https://t.co/Y6xRy3Ivad","date":"Fri Jun 24 14:49:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Planned Parenthood: \"The court has failed us all — but this is far from over.\" https://t.co/bPKe87J4l7","date":"Fri Jun 24 14:46:59 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE UPDATES: SUPREME COURT OVERTURNS ROE V. WADE. https://t.co/aGgVmgAzRc","date":"Fri Jun 24 14:32:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Supreme Court overturns Roe v. Wade, wiping away constitutional guarantee of abortion rights. https://t.co/y8fu4aT1wU https://t.co/1ofJwbcgIH","date":"Fri Jun 24 14:16:23 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Supreme Court overturns Roe v. Wade, wiping away constitutional guarantee of abortion rights. https://t.co/Yqya2WXU06","date":"Fri Jun 24 14:15:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"J.K. Rowling tricked into believing she was talking with President Zelenskyy during a Zoom chat. https://t.co/2hlFx8R3Wn","date":"Fri Jun 24 14:12:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Second of two Wisconsin teenagers ordered to a mental institution in the 2014 “Slender Man” stabbing case is seeking a conditional release. https://t.co/9s1c7fdpAa","date":"Fri Jun 24 14:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"House scheduled to vote on Friday on the most sweeping legislation designed to prevent gun violence in nearly 30 years after the Senate passed the bill Thursday night. https://t.co/o52kGLJfxE","date":"Fri Jun 24 13:44:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. Senate votes 65-33 to pass most sweeping gun bill in decades, setting up House vote. https://t.co/gRP3ixnfVl","date":"Fri Jun 24 13:30:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"We'll fight for them and we'll get them back.\"\n\nUkraine's President Zelenskyy pledges to return Americans captured fighting with Russia in interview with @RichardEngel at @aspenideas. https://t.co/N6GjvM0Jg9","date":"Fri Jun 24 13:28:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“They are heroes, and for me they seem like Ukrainians.”\n\nPresident Zelenskyy pledges to return Americans captured in fighting with Russia to families in interview with @RichardEngel at @aspenideas  https://t.co/q8H2whZEgi","date":"Fri Jun 24 13:13:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Findings show that Israeli forces fired the bullets that killed Palestinian-American reporter Shireen Abu Akleh, and not indiscriminate firing from Palestinians, spokesperson for the UN human rights office says. https://t.co/4h3iF8sRMq","date":"Fri Jun 24 13:00:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"15-year-old boy in critical condition after hitting his head while subway surfing on top of a New York City train, officials say. https://t.co/nDrfsqYhuq","date":"Fri Jun 24 12:47:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Olympic swimmer rescued by her coach after fainting during world championships says the last thing she remembered was not feeling \"too great\" before going down. https://t.co/5po5eetaRj","date":"Fri Jun 24 12:13:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The sign posted on the window of the Harry E. Reed Insurance Agency on Monday read, “Juneteenth ~it’s whatever... We're closed. Enjoy your fried chicken &amp; collard greens.” https://t.co/UhzLpvfnEA","date":"Fri Jun 24 12:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LATEST: Ukrainian forces will retreat from key eastern city Sievierodonetsk after weeks of battles with invading Russian forces, local official says. https://t.co/ZYggilUqRy","date":"Fri Jun 24 11:44:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"WATCH: Olympic swimmer rescued by her coach after fainting during world championships says the last thing she remembered was not feeling \"too great\" before going down. https://t.co/PAVNKkmwFX - @NBCNightlyNews","date":"Fri Jun 24 11:30:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Parents of a Bowling Green State University student who died in a hazing incident last year have filed a lawsuit against the school, saying his death “could have been prevented.” https://t.co/y6kcSQXCp2","date":"Fri Jun 24 11:13:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"These ER doctors say that profit-driven company officials pressed them to work while they had Covid symptoms.\n\nOne doctor says in a lawsuit there was an unwritten policy: “Motrin, mask, man-up and must not test.” https://t.co/mhi8c9snN1","date":"Fri Jun 24 11:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Aung San Suu Kyi, who was ousted in a military coup last year, moved to solitary confinement in Myanmar. https://t.co/X2qL9rIOoA","date":"Fri Jun 24 10:47:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The sign posted on the window of the Harry E. Reed Insurance Agency on Monday read, “Juneteenth ~it’s whatever... We're closed. Enjoy your fried chicken &amp; collard greens.” https://t.co/xoC8p6fUKk","date":"Fri Jun 24 10:31:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elizabeth Svoboda: Why Rusty Bowers testified against Trump — but would still vote for him. https://t.co/XRlojrYxTH - @NBCNewsTHINK","date":"Fri Jun 24 10:14:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"House Speaker Pelosi's husband was charged with two alcohol-related driving misdemeanors stemming from a collision last month in Napa County. https://t.co/cj0dgt04o0","date":"Fri Jun 24 10:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Second of two Wisconsin teenagers ordered to a mental institution in the 2014 “Slender Man” stabbing case is seeking a conditional release. https://t.co/iwMzV2vp8D","date":"Fri Jun 24 09:45:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Authorities in Alabama are searching for a jail escapee who overpowered a sheriff’s deputy and stole an ambulance at a hospital on Wednesday, officials say. https://t.co/GteyOMVokH","date":"Fri Jun 24 09:30:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Amazon’s Alexa might soon replicate the voice of family members — even if they’re dead. https://t.co/cAfLRLENTa","date":"Fri Jun 24 09:15:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Here are some key takeaways from Thursday's hearing of the House committee investigating the Jan. 6 attack on the Capitol.  https://t.co/TjB2La1u1F","date":"Fri Jun 24 09:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Brazilian prosecutors say an 11-year-old girl had received a legal abortion after a judge blocked her for weeks from ending her pregnancy after she was raped. https://t.co/C73UwolPgT","date":"Fri Jun 24 08:46:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Ukraine military families voice frustration over the government's handling of the war, a worrying sign that public unity could be cracking under pressure of Russian assault.\n\n\"The longer this goes on, the more people will become upset,” one wife says. https://t.co/El2TZkuxoD","date":"Fri Jun 24 08:28:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Ukrainian forces will retreat from key eastern city Sievierodonetsk after weeks of battles with invading Russian forces, local official says. https://t.co/kCLNIjzMnd","date":"Fri Jun 24 08:10:13 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. woman was told by doctors her pregnancy would not survive after suffering heavy bleeding while on vacation in Malta.\n\nNow she fears her life is at risk after she was denied an abortion — Malta is the only EU country to ban terminations in all cases. https://t.co/fehmUiW0ce","date":"Fri Jun 24 07:29:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Advocates of distributed computing technology say recent market issues have less to do with blockchain technology and more to do with people trying to make a quick buck. https://t.co/I2Ig9jock5","date":"Fri Jun 24 07:01:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Robert J. Spitzer: The pop culture image of American gun-toting throughout history, unencumbered by laws, is mostly a fiction. - @NBCNewsTHINK https://t.co/RxxeQMdb9F","date":"Fri Jun 24 06:41:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The decision by the leaders of the 27-nation bloc to grant Ukraine candidate status Thursday was uncharacteristically rapid for the E.U. https://t.co/lmIUiFY9eY","date":"Fri Jun 24 06:21:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Large majorities of more than 1,000 registered Latino voters in seven battleground states support gun reforms and access to abortion, according to polling data released by Voto Latino. https://t.co/AV6q9KyqYg","date":"Fri Jun 24 06:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The bipartisan legislation would spare some of the dozens of child nutrition waivers that Congress gave the Agriculture Department the authority to issue. The pandemic-era waivers had been set to expire June 30. https://t.co/95l3RX8Pxv","date":"Fri Jun 24 05:41:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Max Burns: The GOP’s Jan. 6 committee woes are a rare opportunity for Democrats to hammer Republicans on an issue for which they simply have no good answers. - @NBCNewsTHINK https://t.co/1pR9IiGBhd","date":"Fri Jun 24 05:21:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"State Department and CIA officials told senators that within days, the administration will release a plan to compensate U.S. personnel who have suffered injuries and how much to pay them, with some payments expected to exceed $100,000 per person. https://t.co/DhCRxyArpX","date":"Fri Jun 24 05:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Most bacteria are microscopic, but this one is so big it can be seen with the naked eye. https://t.co/nGZCMSgx8L","date":"Fri Jun 24 04:41:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Monkeypox cases have been disproportionately reported among men who have sex with men, prompting health authorities to expand vaccine access to people at high risk. https://t.co/25WAQcewgG","date":"Fri Jun 24 04:21:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Four weeks after the shooting at Robb Elementary School, more questions than answers plague Uvalde. People struggle to mourn because they are too busy seeking accountability from their leaders. https://t.co/FlTTEKcClC","date":"Fri Jun 24 04:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"For advocates of new laws to combat mass shootings, the sting of the court's ruling dulled the impending achievement of the Senate bill, which is slated for final passage by the end of the week. https://t.co/7jxHO4s5sL","date":"Fri Jun 24 03:41:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elwood Mead's great-granddaughter said the U.S. government official and skilled engineer would be appalled by the plunging water levels at the nation's largest reservoir. https://t.co/HiYPUc9qZg","date":"Fri Jun 24 03:21:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The sign posted on the window of the Harry E. Reed Insurance Agency on Monday read, “Juneteenth ~it’s whatever... We're closed. Enjoy your fried chicken &amp; collard greens.” https://t.co/DzWAxHOOoT","date":"Fri Jun 24 03:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Here are some key takeaways from Thursday's hearing of the House committee investigating the Jan. 6 attack on the Capitol. https://t.co/d8K5UsNjlT","date":"Fri Jun 24 02:46:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Republican lawmakers and veterans' groups are calling for an investigation and open congressional hearings into how the Biden administration conducted its withdrawal of U.S. troops and evacuation of Americans and Afghan allies from Afghanistan in 2021. https://t.co/Mml9u6xiGv","date":"Fri Jun 24 02:31:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The bipartisan measure, which the House is expected to pass, would enhance background checks, tackle the \"boyfriend loophole\" and provide grants to states to implement \"red flag\" laws or crisis prevention programs.","date":"Fri Jun 24 02:22:18 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: U.S. Senate votes 65-33 to pass most sweeping gun bill in decades, setting up House vote. https://t.co/MRpFXNo8cK","date":"Fri Jun 24 02:20:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Two men have died while cave diving in Florida, authorities say. https://t.co/a7FONpzvzr","date":"Fri Jun 24 02:16:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"House GOP leadership has expressed frustration over Stefanik's endorsement because they were not consulted and are now associated with unflattering stories, including reports about Paladino's past praise of Hitler and past racist remarks, NBC News learned. https://t.co/rsqSTs4WYt","date":"Fri Jun 24 02:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former Yankees slugger Hideki Matsui is honored for his contributions to baseball and helping build cultural connections between the U.S. and Japan through the game. - @NBCAsianAmerica https://t.co/z0WdRp4CC1","date":"Fri Jun 24 01:46:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"It is outrageous that at a moment of national reckoning on gun violence, the Supreme Court has recklessly struck down a New York law that limits those who can carry concealed weapons,\" New York Gov. Hochul said. https://t.co/u6aigqztw4","date":"Fri Jun 24 01:30:13 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Supreme Court's religious school ruling has sparked concerns about the potential implications of the ruling on LGBTQ rights. The two schools cited in the case have a history of homophobic and transphobic policies. - @NBCOUT https://t.co/I0KrT3dh7C","date":"Fri Jun 24 01:16:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Over 100 cases of gastrointestinal illness have been reported at the Grand Canyon, with cases cropping up among visitors to the Colorado River and backcountry campers, according to park officials. https://t.co/FTtuyCx5Nj","date":"Fri Jun 24 01:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. woman was told by doctors her pregnancy would not survive after suffering heavy bleeding while on vacation in Malta.\n\nNow she fears her life is at risk after she was denied an abortion — Malta is the only EU country to ban terminations in all cases. https://t.co/b9L7p5vyZ4","date":"Fri Jun 24 00:46:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court just vastly expanded gun rights. Here’s what happens next. https://t.co/6ysVSf7O62","date":"Fri Jun 24 00:26:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Ukraine military families voice frustration over the government's handling of the war, a worrying sign that public unity could be cracking under pressure of Russian assault.\n\n\"The longer this goes on, the more people will become upset,” one wife says. https://t.co/e4HfWXbmZY","date":"Fri Jun 24 00:17:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Federal authorities were at the home of Jeffrey Clark, a central figure in the Jan. 6 panel hearings. https://t.co/9JNXywz9VD","date":"Fri Jun 24 00:02:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Reps. Matt Gaetz, Mo Brooks and Marjorie Taylor Greene were among those who sought pardons for their role in the plot to overturn the 2020 election, Trump officials testified. https://t.co/fhTmpA53BO","date":"Thu Jun 23 23:46:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A man inside a Las Vegas psychiatric ward stabbed two fellow patients, one fatally, early Thursday morning, authorities say. https://t.co/7kk7UuAaJ0","date":"Thu Jun 23 23:30:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Supreme Court rules that law enforcement officers can’t be sued when they violate the rights of criminal suspects by failing to provide the familiar Miranda warning before questioning them. https://t.co/CgH0hHp4WI","date":"Thu Jun 23 23:16:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“I’m here begging for you guys to do something.”\n\nThe sister of a 9-year-old girl killed in the Uvalde school shooting pleads with Texas lawmakers to pass gun safety legislation and questions why so many security measures failed. https://t.co/yT8qfEXVfX","date":"Thu Jun 23 23:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The vehicle of a homicide suspect wanted in the death of elite cyclist Anna Moriah \"Mo\" Wilson has been been located in Austin, Texas. https://t.co/I1GgvU3QQ5","date":"Thu Jun 23 22:41:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The biological mother of two California brothers allegedly killed by their adoptive parents filed a federal lawsuit stating that her sons were unlawfully removed from her care. https://t.co/kkRKpnVPve","date":"Thu Jun 23 22:34:39 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“I feel like we can’t break the cycle of violence if we are not willing to listen to one another.”\n\nThe mother of a U.S. journalist beheaded by ISIS meets with one his imprisoned captors in an effort to carry on her son’s legacy. https://t.co/xB74zFmSXz","date":"Thu Jun 23 22:19:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Layoffs have hit Netflix again, with the streamer letting go of roughly 300 staffers on Thursday, the company says. https://t.co/m4FX47kqEm","date":"Thu Jun 23 22:09:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"The fact that you’re pushing us and pushing us, this is not a safety culture.\" \n\nAn American Airlines pilot is calling on the FAA to monitor airlines he says are scheduling more flights than they can staff. https://t.co/A6WBZ8hT9Q","date":"Thu Jun 23 22:03:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Cheney's closing remarks: \n\"You have heard from more than a dozen Republicans.\"\n\n\"It can be difficult to accept that President Trump abused your trust. That he deceived you. Many will invent excuses to ignore that fact. But that is a fact.\" https://t.co/xcYmU0E8c6","date":"Thu Jun 23 21:41:50 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: At least five Republicans asked Trump’s White House for presidential pardons after the Capitol riot, according to testimony from top White House officials shown by the Jan. 6 committee. https://t.co/lA7SNp2hrV","date":"Thu Jun 23 21:38:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Committee discusses the evolution of how a conspiracy theory involving Italians changing the U.S. election results and then loading them into “military satellites” made its way through the Trump administration. https://t.co/115fchdU1X","date":"Thu Jun 23 21:15:31 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"White House call logs obtained by the committee show that the White House had already started labeling Jeffrey Clark as the acting attorney general by Jan. 3.\n\nClark was not, in fact, the acting attorney general. https://t.co/wExMmnMcwA","date":"Thu Jun 23 21:11:39 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Kinzinger says former President Trump \"rushed back early\" on New Year's Eve and \"called an emergency meeting\" with the DOJ's leadership.\n\n“There was a point at which the president said something about, ‘Why don’t you guys seize machines?’\" https://t.co/tWQbG8cTn1","date":"Thu Jun 23 21:05:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Kinzinger says the committee's investigation found that then - President Trump \"went as far as to promise the job of special counsel to now-discredited former Trump campaign lawyer Sidney Powell\" in a December 2020 meeting. https://t.co/PdNOhkMT0w","date":"Thu Jun 23 20:50:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Richard Donoghue says when he and another DOJ official wouldn't declare election fraud, then-President Trump said, \"People tell me I should just get rid of both of you. I should just remove you and make a change in leadership.\" https://t.co/EwFOu1QYdk","date":"Thu Jun 23 20:49:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Donoghue reveals his notes of a conversation with then-President Trump: “Just say the election was corrupt and leave the rest to me and the Republican Congressmen,\" former President Trump said. https://t.co/6fuyB7eIiv","date":"Thu Jun 23 20:16:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former DOJ official Donoghue says he started taking notes when then-President Trump made an allegation he hadn't heard before on a 90-minute call with him on Dec. 27, 2020. \n\n\"He had this arsenal of allegations that he wanted to, to rely on.\" https://t.co/uPTXwkjNxU","date":"Thu Jun 23 20:14:39 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"In video testimony, former DOJ official Donoghue describes why he didn't see Jeffrey Clark as fit to serve as attorney general.\n\n\"You’re an environmental lawyer. How about you go back to your office, and we’ll call you when there’s an oil spill.” https://t.co/vEzPUrBTRs","date":"Thu Jun 23 20:13:19 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 Committee uses former President Trump's own words in their presentation on Thursday to show how he was pressuring the Justice Department to overturn the election. https://t.co/cBTB6i31Og","date":"Thu Jun 23 20:08:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"Just say it was corrupt and leave the rest to me and the Republican congressmen.\"\n\nFormer DOJ official Richard Donoghue recalls what he says then-President Trump told him about the 2020 election. https://t.co/FS0gAeQfve","date":"Thu Jun 23 20:07:12 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Committee plays a montage of pro-Trump members of Congress making false claims about the election, even after then-Attorney General Barr publicly said that those allegations had no merit. https://t.co/M9uCsSTeic","date":"Thu Jun 23 19:53:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Justice Breyer invokes the nation’s epidemic of gun violence in a dissent to the Supreme Court’s ruling that the Constitution provides a right to carry a gun outside the home. https://t.co/sAakiWI7Xj","date":"Thu Jun 23 19:44:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Kinzinger: \"Imagine the country’s top prosecutor ... pursuing the agenda of the other party instead of that of the American people as a whole.\"\n\n\"Today, President Trump’s total disregard for the Constitution and his oath will be fully exposed.\" https://t.co/ew80LupEaU","date":"Thu Jun 23 19:38:18 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Here's what you need to know about the three witnesses at Thursday's hearing: \nhttps://t.co/JQhL7RDdhr","date":"Thu Jun 23 19:30:41 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Committee plays a montage of video testimony from former DOJ and White House officials describing a meeting they had with then-President Trump on Jan. 3, as the president was considering appointing a new attorney general who would back his fraud claims. https://t.co/OBoa7Y5SZ9","date":"Thu Jun 23 19:29:42 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"When the president tried to misuse the department and install a loyalist at its helm, these brave officials refused and threatened to resign,\" Rep. Kinzinger says in his statement. https://t.co/ZRY9u3fvSl","date":"Thu Jun 23 19:29:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Kinzinger: \"If we’re going to ask Americans to be willing to die in service to our country, we as leaders must at least be willing to sacrifice our political careers.\"\n\n\"Losing a job is nothing compared to losing your life.\" https://t.co/5375zxhSBa","date":"Thu Jun 23 19:27:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Cheney highlights a DOJ official's draft letter to states falsely warning of fraud. https://t.co/NFB1oEfQzm","date":"Thu Jun 23 19:23:54 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Thompson outlines the focus of Thursday's hearing: “Trump didn’t just want the Justice Department to investigate. He wanted the Justice Department to help legitimize his lies. https://t.co/IT3xqE9gtA”","date":"Thu Jun 23 19:14:13 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 committee will present evidence that former President Trump tried to enlist the DOJ in his failed bid to overturn the 2020 election, according to panel officials. https://t.co/tanXehFAPy","date":"Thu Jun 23 18:38:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE: The Jan. 6 committee returns for its fifth public hearing, focusing on then-President Trump's efforts to pressure the DOJ to aid in his campaign to overturn the 2020 election. https://t.co/zclygJGY2K https://t.co/OhNwTKaSAX","date":"Thu Jun 23 18:31:36 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Thompson says the panel's fifth public hearing will include “conversations about pardons.” https://t.co/1D8xfRS9wA","date":"Thu Jun 23 18:23:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Tech employees say caste discrimination persists at work and their bosses aren't doing enough to protect them. - @NBCAsianAmerica   https://t.co/qVV5MbKhW0","date":"Thu Jun 23 18:17:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE UPDATES: The Jan. 6 committee returns for its fifth public hearing, focusing on then-President Trump's efforts to pressure the DOJ to aid in his campaign to overturn the 2020 election. https://t.co/oBgNcZiQuU","date":"Thu Jun 23 17:56:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elon Musk's transgender daughter's request to legally change her name has been granted by a Los Angeles County Superior Court judge, according to a court document obtained by @NBCNews. https://t.co/tjrPx9jnLD","date":"Thu Jun 23 17:53:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Federal authorities were at the home of Jeffrey Clark, a central figure in the Jan. 6 panel hearings. https://t.co/jmoracmn84","date":"Thu Jun 23 17:43:51 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Chinese city has been stripped of its honorary “civilized” status after video surfaced of a group of men beating four women outside of a restaurant. https://t.co/DbAeONtlwv","date":"Thu Jun 23 17:31:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"Our sport is no different than others, just in a pool, we push through limits and sometimes we find them,\" Fuentes said. \"Anita feels good now and the doctors also say she is okay.\" https://t.co/LTIgnuyXPJ https://t.co/Ajwqh5rvcX","date":"Thu Jun 23 17:17:50 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Republicans want to ignore the Jan 6. committee's hearings, but former President Trump is increasingly criticizing the lack of defense being waged in his name. https://t.co/fkmeeP8OxW","date":"Thu Jun 23 17:17:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Her coach, Andrea Fuentes leapt into action. She swam to Alvarez before pulling the swimmer up toward the surface of the water.\n\nFuentes said she jumped into the water \"because I saw that no one, no lifeguard, was diving in.\" \nhttps://t.co/LTIgnuQzej https://t.co/TjvWbn3MOz","date":"Thu Jun 23 17:14:26 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Anita Alvarez could be seen floating toward the bottom of the pool, apparently unconscious, after completing her solo free routine. https://t.co/tL94IWZKt5 https://t.co/o1WNqJ0IEL","date":"Thu Jun 23 17:07:31 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Tina Smith will introduce a new bill that aims to shore up access to abortion pills in states that have not yet restricted access, focusing on codifying current regulatory language around the drugs. - @MeetThePress https://t.co/eMC2SJ2W8C","date":"Thu Jun 23 17:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Team USA Artistic swimmer was dramatically rescued by her coach after she appeared to faint in the water during the world aquatics championships in Budapest. https://t.co/tL94IWZKt5","date":"Thu Jun 23 17:00:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A new photo exhibit from a renowned photojournalist pushes for action on abortion access in the face of the looming Roe decision, documenting the violence, love and spirit in women's lives. https://t.co/kutAqfpbqY","date":"Thu Jun 23 16:52:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: Senate’s gun legislation clears procedural vote with enough Republican support, setting up final passage as soon as Thursday evening. https://t.co/VUOCeNzkEw","date":"Thu Jun 23 16:37:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. woman was told by doctors her pregnancy would not survive after suffering heavy bleeding while on vacation in Malta.\n\nNow she fears her life is at risk after she was denied an abortion — Malta is the only EU country to ban terminations in all cases. https://t.co/3HStsF7X9z","date":"Thu Jun 23 16:28:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Oil company executives are scheduled to meet with top administration officials as President Biden increasingly blames the oil and gas industry for high prices at the pump. https://t.co/SRlvHDOxHX","date":"Thu Jun 23 16:15:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"This opinion will result in more guns in public spaces, and more Americans will die.\"\n\nThe Supreme Court’s landmark decision to expand gun rights will have deadly and far-reaching repercussions, gun-safety advocates warn. https://t.co/Y5IlzHboYD","date":"Thu Jun 23 16:01:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Biden admin. agrees to cancel billions of dollars in student debt for about 200,000 borrowers who say they were scammed by their for-profit colleges. https://t.co/3ZowfSLknD","date":"Thu Jun 23 15:54:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Cities such as Pensacola, Jacksonville and Tallahassee are set to reach the 100-degree mark for the first time since 2019. https://t.co/qUX5Dbftxf","date":"Thu Jun 23 15:42:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A judge gave final approval to a settlement topping $1 billion for victims of the collapse of a Florida beachfront condominium building that killed 98 people. https://t.co/lK2iuQyUwG","date":"Thu Jun 23 15:32:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: FDA orders Juul to stop selling and distributing its e-cigarette products, citing a lack of data and evidence to assess their potential public health risk. https://t.co/CdUVtHK2tE","date":"Thu Jun 23 15:09:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Biden admin. proposes sweeping changes to Title IX that would revoke Trump admin. rules surrounding sexual misconduct that advocates for assault survivors say discriminated against victims. https://t.co/PPXh3at5Uy","date":"Thu Jun 23 15:04:28 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Anybody surfing the internet these past few weeks has likely come across the latest social media trend: the \"She's/he's a 10\" meme. https://t.co/NAZyP2Ixzd","date":"Thu Jun 23 15:01:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Supreme Court rules that the Constitution guarantees the right to carry a gun outside the home, issuing a major decision on the meaning of the Second Amendment. https://t.co/mjMwS2UBhG","date":"Thu Jun 23 14:39:29 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE: Supreme Court rules that the Constitution guarantees the right to carry a gun outside the home, issuing a major decision on the meaning of the Second Amendment right to \"keep and bear arms.\" https://t.co/0HxXHh7vmn https://t.co/X8xVbSt7IM","date":"Thu Jun 23 14:37:42 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court ruled that leaders of North Carolina’s Republican legislature can step in to advocate for a voter ID law in court that they believe the state’s Democratic attorney general isn’t fighting hard enough to defend. https://t.co/cRRuhKTayX","date":"Thu Jun 23 14:07:52 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rapper Lil Tjay shot multiple times and another man also injured during an attempted armed robbery in New Jersey, officials say. https://t.co/ZRiry6YiYG","date":"Thu Jun 23 14:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A corrections officer was fatally shot on Wednesday night inside an Arkansas jail, state authorities say. https://t.co/82XkzRqfe7","date":"Thu Jun 23 13:45:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Team USA Artistic swimmer dramatically rescued by her coach after she appeared to faint in the water during the world aquatics championships in Budapest. https://t.co/SCDEGrtQmA","date":"Thu Jun 23 13:31:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Italian judge rules that Paul Haggis is to remain under house arrest in the case that sees the 'Crash' director accused of repeated sexual assault and aggravated personal injury. https://t.co/NuWCeBp3U7","date":"Thu Jun 23 13:14:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"White House Coronavirus Task Force members during the Trump administration expressed concern with each other about “misinformation” being shared with the president, according to emails shared with @NBCNews. https://t.co/unwNBZleMr","date":"Thu Jun 23 13:02:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Health officials recommend that men in Florida who have sex with other men get a meningococcal vaccine following one of the worst outbreaks among gay and bisexual men in U.S. history. https://t.co/pYxV4zvOzM","date":"Thu Jun 23 12:46:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Federal prosecutors ask judge to sentence former Minneapolis officer Derek Chauvin to 25 years for violating the rights of George Floyd. https://t.co/qedKi2dqVi","date":"Thu Jun 23 12:32:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"An associate of Giuliani who was convicted of campaign finance crimes at trial and later pleaded guilty to a separate fraud charge is asking that he be spared from prison at his sentencing next week. https://t.co/let6u4HoOy","date":"Thu Jun 23 12:16:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Team USA Artistic swimmer dramatically rescued by her coach after she appeared to faint in the water during the world aquatics championships in Budapest. https://t.co/Ai3HVmP8Yl","date":"Thu Jun 23 12:15:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rapper Lil Tjay shot multiple times and another man also injured during an attempted armed robbery in New Jersey, officials say. https://t.co/zOi3dQOrKL","date":"Thu Jun 23 12:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"6 people are dead after a helicopter crashed in Logan County, West Virginia, on Wednesday, authorities say. https://t.co/3V5u7N04Ic","date":"Thu Jun 23 11:43:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"1 man was killed and another wounded in a shooting on a San Francisco subway train that ended in the city’s historically LGBTQ neighborhood just days before Pride celebrations, police say. https://t.co/9avX3KJciG","date":"Thu Jun 23 11:32:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Team USA Artistic swimmer dramatically rescued by her coach after she appeared to faint in the water during the world aquatics championships in Budapest. https://t.co/FgLAeag7XL","date":"Thu Jun 23 11:20:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: Ukraine military families voice frustration over the government's handling of the war, a worrying sign that public unity could be cracking under pressure of Russian assault.\n\n\"The longer this goes on, the more people will become upset,” one wife says. https://t.co/Ct8JogCz9B","date":"Thu Jun 23 11:17:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The NAACP is teaming up with https://t.co/ifStylP9gu to register and mobilize Black voters ahead of the midterm elections to boost turnout at the polls and counter new voting restrictions. https://t.co/aADi9IWqoP","date":"Thu Jun 23 10:56:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Jan 6. committee’s fifth public hearing will focus on former President Trump’s effort to draw upon the Justice Dept’s legal muscle and authority as he tried to overturn the 2020 election. https://t.co/ZhPWQ9b6Yh","date":"Thu Jun 23 10:38:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Most Americans don't know Jeffrey Clark — the environmental lawyer whom fmr. President Trump wanted to take over the Justice Dept. to aid his effort to overturn the 2020 election.\n\nJan. 6 committee hopes its Thursday hearing might change that. https://t.co/E7BrF0lrC6","date":"Thu Jun 23 10:18:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"War in Ukraine has “sounded an alarm for humanity,” Chinese President Xi says, as China continues to assume a position of neutrality while backing its ally Russia. https://t.co/d3tHtLLovo","date":"Thu Jun 23 10:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Republicans want to ignore the Jan 6. committee's hearings, but former President Trump is increasingly criticizing the lack of defense being waged in his name. https://t.co/bQUvGigIUE","date":"Thu Jun 23 09:47:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"France’s top court rules against allowing body-covering “burkini” swimwear in public pools for religious reasons. https://t.co/3sy0sehEH3","date":"Thu Jun 23 09:30:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Anybody surfing the internet these past few weeks has likely come across the latest social media trend: the \"She's/he's a 10\" meme. https://t.co/VWXRUkWouI","date":"Thu Jun 23 09:07:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A woman and her two dogs were killed in a lightning strike in the Los Angeles area on Wednesday morning as thunderstorms rolled through Southern California, officials say. https://t.co/nasX6HJPbm","date":"Thu Jun 23 08:48:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"James Rado, co-creator of the groundbreaking hippie musical “Hair,” has died aged 90, publicist says. https://t.co/MGKOfvdVGW","date":"Thu Jun 23 08:29:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: Federal prosecutors say convicted sex trafficker Ghislaine Maxwell should be sentenced to a minimum of 30 years. https://t.co/8CBNoh4Wok","date":"Thu Jun 23 08:09:59 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"After being ousted last year, Benjamin Netanyahu is once again center stage as Israel prepares for its fifth election in less than four years. https://t.co/bOFR06253o","date":"Thu Jun 23 08:01:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Researchers found that people who couldn't stand on one foot were nearly twice as likely to die in the next 10 years. https://t.co/CNGDDU7eh1","date":"Thu Jun 23 07:32:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"An episode of \"Sesame Street,\" allegedly removed from syndication for being too frightening for children, has been posted to social media sites like YouTube and Reddit. https://t.co/l9j6BaURTu","date":"Thu Jun 23 07:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Meet the family behind 'Texas Thighs' – an OnlyFans account paying their bills. But strict moderation on some social media apps is costing them. https://t.co/Er0BW8uF16","date":"Thu Jun 23 06:42:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elon Musk’s transgender daughter files request to change her name in accordance with her new gender identity and because “I no longer live with or wish to be related to my biological father in any way, shape or form.” https://t.co/MIh18GlzJD","date":"Thu Jun 23 06:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Lake Mead's water levels drop to historic lows and put the reservoir at risk of becoming a dead pool, researchers say.\n\"This is the 23rd year of drought, and we don't know if it's a 23-year drought, a 50-year drought or maybe it's a 100-year drought.\" https://t.co/e9Aqi8EgxT","date":"Thu Jun 23 06:02:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Frankie de la Cretaz: Those who have access to transition in childhood will be deemed more acceptable or less threatening and therefore “better.” - @NBCNewsTHINK https://t.co/FY8Nt6gGdT","date":"Thu Jun 23 05:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Miami-Dade police officer is caught on video telling a Black motorist during a traffic stop, “This is how you guys get killed out here, man,” police say. - @NBCBLK https://t.co/Lo5Bk0yweI","date":"Thu Jun 23 05:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Megan Gerhardt: Pilots are not safe to work past age 65, but our neurosurgeons are? If doctors are not mandating a retirement age, why is anyone else? - @NBCNewsTHINK https://t.co/2nHP9L4TwO","date":"Thu Jun 23 05:02:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A jury in New York City accepted an insanity defense claiming the man was so psychologically disturbed he didn’t know what he was doing. https://t.co/YfqB3J7ixF","date":"Thu Jun 23 04:42:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Bleak seed harvests from 2021 have sprouted into paltry mustard supplies in France. And U.S. grocery shelves might be next. https://t.co/wC7nJ6dwwe","date":"Thu Jun 23 04:22:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"After years of legal wrangling, OSU was awarded trademark protection for the three-letter article from the U.S. Patent and Trademark Office. https://t.co/IoiAP0wSsQ","date":"Thu Jun 23 04:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A bloodhound named Trumpet has won the Westminster Kennel Club Dog Show, besting six other finalists to snare U.S. dogdom’s most coveted best in show prize. https://t.co/o0zyIuzL31","date":"Thu Jun 23 03:42:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Brittney Griner has been named an honorary starter for the WNBA All-Star Game despite being detained in Russia. https://t.co/9rKbpvbxwP","date":"Thu Jun 23 03:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Yellowstone's south loop, where the Old Faithful geyser and the colorful Grand Prismatic Spring are, have reopened, but the north loop remains closed, officials say. https://t.co/mESBF6TdUN","date":"Thu Jun 23 03:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Two key Biden administration agencies have instructed their staffers not to provide information or communicate with the government watchdog responsible for tracking waste and corruption in Afghanistan, according to the head of the watchdog agency. https://t.co/bqQWHbLev5","date":"Thu Jun 23 02:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The 89er Theatre sparked controversy with a since-removed sign saying it would “fast-forward through” a brief kissing scene in the animated film 'Lightyear.' https://t.co/XrEV7ERAjI","date":"Thu Jun 23 02:22:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A joint investigation with the Louisiana Bureau of Investigations alleges that the nursing home owner refused to move residents out of the warehouse following Hurricane Ida, despite life-threatening conditions. https://t.co/KCr8eZAZYq","date":"Thu Jun 23 02:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A swimmer in Northern California has suffered significant injuries after being attacked by a shark, police say. https://t.co/m5ywPCnGfV","date":"Thu Jun 23 01:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"The situation is very bad.\"\n\nThe earthquake, which killed more than 1,000 people, has hit at a time when Afghanistan is already deep in one of the world’s worst humanitarian crises. https://t.co/DDeupYPKmH","date":"Thu Jun 23 01:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The man who was arrested near Supreme Court Justice Kavanaugh’s home earlier this month has pleaded not guilty to trying to kill Kavanaugh. https://t.co/9jUTxhnB50","date":"Thu Jun 23 01:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A bird flu outbreak might be the reason hundreds of dead birds have washed up on Martha’s Vineyard, local animal control officials say. https://t.co/3Vv7zFwLRN","date":"Thu Jun 23 00:42:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"After being ousted last year, Benjamin Netanyahu is once again center stage as Israel prepares for its fifth election in less than four years. https://t.co/IIyU6SRM9M","date":"Thu Jun 23 00:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Lake Mead's water levels drop to historic lows and put the reservoir at risk of becoming a dead pool, researchers say.\n\"This is the 23rd year of drought, and we don't know if it's a 23-year drought, a 50-year drought or maybe it's a 100-year drought.\" https://t.co/wHI4QWT5lN","date":"Thu Jun 23 00:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Russian hackers have engaged in “strategic espionage” against governments, think tanks, businesses and aid groups in 42 countries supporting Kyiv, Microsoft says in a report. https://t.co/0jTlBe7JZy","date":"Wed Jun 22 23:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Tony Siragusa, former Baltimore Ravens player and broadcaster, has died at age 55. https://t.co/9psA1gfKDP","date":"Wed Jun 22 23:22:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: Pete Arredondo has been put on administrative leave as the police chief of the Uvalde school district, after more than a month of sharp criticism for his decision to delay confronting the gunman in the May 24 shooting at Robb Elementary School. https://t.co/b4790xUkNK","date":"Wed Jun 22 23:02:56 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Even a crypto crash can't deter NFT enthusiasts, as more than 15,000 are expected to gather for the https://t.co/MydQHbFVjV conference in Times Square. https://t.co/YM0E2cAOc9","date":"Wed Jun 22 22:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A former West Virginia lawmaker who stormed the U.S. Capitol and livestreamed it on Facebook is sentenced to three months. https://t.co/aowtAYn31m","date":"Wed Jun 22 22:22:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Miami-Dade police officer is caught on video telling a Black motorist during a traffic stop, “This is how you guys get killed out here, man,” police say. - @NBCBLK https://t.co/teIN0oliVQ","date":"Wed Jun 22 22:02:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"After more than five decades, authorities link a twelfth victim to the \"Torso Killer.\" https://t.co/QxjqyL9LLg","date":"Wed Jun 22 21:53:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sen. Kevin Cramer injured his right hand while doing yard work and required immediate surgery. https://t.co/Kqorcx1ZZ4","date":"Wed Jun 22 21:43:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Hundreds of people across the U.S. were defrauded out of more than $13 million in an elaborate scheme that promised big returns on wine and whiskey investments, federal authorities say. https://t.co/fKYDJi4iZe","date":"Wed Jun 22 21:31:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The only Latino officer in a police department in Ohio says he was \"constantly harassed\" by the department's chief at the time over his ethnicity and religion. - @NBCLatino https://t.co/q8iH1mmxz0","date":"Wed Jun 22 21:15:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"About 200 people broke into an $8 million Florida home, threw a party and posted videos of it on social media. https://t.co/YclqknLSFD","date":"Wed Jun 22 21:02:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"WATCH: Sunbathing walrus sinks boats in Norway while sunbathing, prompting authorities to hatch a plan to prevent her from sinking more. https://t.co/NWWMKifpwa","date":"Wed Jun 22 20:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A New York woman was rescued from a hostage situation after sending a note to a restaurant through Grubhub, according to police and the restaurant. https://t.co/ov6osA19JZ","date":"Wed Jun 22 20:33:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A federal judge delayed a Jan. 6 trial that had been set for August involving members of the Proud Boys, citing the work of the House committee investigating the U.S. Capitol attack. https://t.co/KdwskREg0L","date":"Wed Jun 22 20:17:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A pilot shortage prompts American Airlines to end services to some airports in Iowa, New York and Ohio beginning in September, the company says. https://t.co/Ff4pL5CfpH","date":"Wed Jun 22 20:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Police search for the gunman who opened fire on a San Francisco train Wednesday, killing one person and injuring another, officials say. https://t.co/jTyewwrKC8","date":"Wed Jun 22 19:46:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Washington Commanders owner Dan Snyder commissioned a \"shadow investigation\" into employees who spoke out against the team's \"toxic workplace\" in a bid to influence the NFL's review of sexual harassment allegations, a congressional report alleged. https://t.co/RwAbdfomcn","date":"Wed Jun 22 19:36:52 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Bangladesh and northeastern India are no strangers to flooding.\n\nBut this year, their floods came early, and climate change is partially to blame, scientists say.\nhttps://t.co/gBtppxNeiq","date":"Wed Jun 22 19:30:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The proposal comes as gas prices have soared for most of the year. The average price of a gallon of gas is approximately $5, data shows. https://t.co/U1NJ9GcdUG https://t.co/isGXkNjf4l","date":"Wed Jun 22 19:25:16 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"If approved by Congress, the proposal would suspend the 18-cent-per-gallon federal tax on gas. https://t.co/U1NJ9GcdUG https://t.co/BXNDGDrDm1","date":"Wed Jun 22 19:20:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden’s proposed 3-month federal gas tax holiday would shave a couple of dollars off driver’s bills each time they filled up their tanks. https://t.co/zDrb34Vqpb","date":"Wed Jun 22 19:15:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The first week of summer brings “incredibly high temperatures” to the Gulf of Mexico, which is concerning because warm Gulf water can fuel hurricanes, making them stronger. https://t.co/KReC8aD7Y6","date":"Wed Jun 22 19:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"VidCon is back with TikTok as its official partner, showing just how much has changed for content creators during its 3-year hiatus. Here's what to expect. https://t.co/v0b3mCVo2w","date":"Wed Jun 22 18:44:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"An episode of \"Sesame Street,\" allegedly removed from syndication for being too frightening for children, has been posted to social media sites like YouTube and Reddit. https://t.co/OPhmMcTFCw","date":"Wed Jun 22 18:32:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"About 200 people broke into an $8 million Florida home, threw a party and posted videos of it on social media. https://t.co/EqeKf9TxLT","date":"Wed Jun 22 18:17:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Texas GOP Rep. Tony Gonzales, who represents Uvalde, announced that he will support the bipartisan gun safety legislation. - @MeetThePress https://t.co/KzwgLcJXAY","date":"Wed Jun 22 18:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A New York woman was rescued from a hostage situation after sending a note to a restaurant through Grubhub, according to police and the restaurant. https://t.co/coGnEIW4p5","date":"Wed Jun 22 17:43:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"WATCH: Sunbathing walrus sinks boats in Norway while sunbathing, prompting authorities to hatch a plan to prevent her from sinking more. https://t.co/3J89gxVce5","date":"Wed Jun 22 17:33:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Chairman Jerome Powell says the Federal Reserve plans to continue increasing interest rates, which he warns could lead to a recession. https://t.co/oU4LIjMGkk","date":"Wed Jun 22 17:26:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Police are investigating a Girl Scout cookie scam after a young girl and man took money for orders and never delivered the cookies. https://t.co/tWb1mKCzVb","date":"Wed Jun 22 17:22:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The International Rugby League bans transgender players from its women's international competition, citing a need to further consult and balance transgender participation and its \"perceived risk\" to other players. - @NBCOUT \n https://t.co/Cce7dADDH8","date":"Wed Jun 22 17:18:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Meet the family behind 'Texas Thighs' – an OnlyFans account paying their bills. But strict moderation on some social media apps is costing them. https://t.co/cFaEiBm2sP","date":"Wed Jun 22 17:03:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Andrew Gillum, the once-rising Democratic star who ran for governor in Florida, says he expects to be indicted in federal court as early as today for alleged fraud tied to his campaign. https://t.co/UsFBj9K5CO","date":"Wed Jun 22 16:45:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"House GOP leaders said they will formally whip against the bipartisan legislative package to combat gun violence, and request that their members vote no if it passes the Senate. https://t.co/kkYRhdrQkL","date":"Wed Jun 22 16:26:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The bivalent vaccine, which Moderna has said it hopes will be authorized for use in the U.S. this fall, is designed to target both the original omicron variant and the original coronavirus strain in a single shot.","date":"Wed Jun 22 16:11:58 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: An updated version of Moderna’s Covid-19 booster shot appears to work against the fast-spreading omicron subvariants, the company said. https://t.co/ogjPyWHK5A","date":"Wed Jun 22 16:10:48 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Robb Elementary School in Uvalde, Texas, where a gunman killed 19 students and two teachers last month will be demolished, the city's mayor says. https://t.co/ct7CkUzU9D","date":"Wed Jun 22 16:04:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A fisherman in Cambodia hooked a 661-pound stingray, believed to be the largest freshwater fish ever caught. https://t.co/PHfG7svOqj","date":"Wed Jun 22 15:42:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Ukraine has lost ground around the key eastern city of Lysychansk in a “clear setback” as Russian forces advance.\n\nHere's why it matters. https://t.co/10JhX5poF7","date":"Wed Jun 22 15:31:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A 5-year-old boy in Texas has died after being left in a sweltering car for several hours as the child’s family prepared for his sibling’s birthday party, authorities say. https://t.co/BtSwLNNvML","date":"Wed Jun 22 15:16:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Jaylon Ferguson, the outside linebacker of the Baltimore Ravens, has died at the age of 26, the team says. https://t.co/MumCdB3exM","date":"Wed Jun 22 15:07:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Facebook will change its algorithms to prevent discriminatory housing advertising and its parent company will subject itself to court oversight to settle a lawsuit brought by the U.S. Dept. of Justice. https://t.co/0SW0A3h1Ye","date":"Wed Jun 22 15:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Georgia Supreme Court overturned the murder conviction of a Georgia father sentenced to life in prison after leaving his 22-month-old son in a hot car. https://t.co/NMBGqE3d6X","date":"Wed Jun 22 14:46:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Georgia Supreme Court overturned the murder conviction of a Georgia father sentenced to life in prison after leaving his 22-month-old son in a hot car. https://t.co/WxfDawQIUs","date":"Wed Jun 22 14:41:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Mortgage applications to purchase a home rose 8% last week compared with the previous week, Mortgage Bankers Association’s seasonally adjusted index shows. https://t.co/HgG6NhDOih","date":"Wed Jun 22 14:28:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A New York woman was rescued from a hostage situation after sending a note to a restaurant through Grubhub, according to police and the restaurant. https://t.co/owPnYLI79w","date":"Wed Jun 22 14:14:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The officer attempted to storm Robb Elementary School after his wife, Eva Mireles, called him telling him she had been shot, the head of the Texas Department of Public Safety said. He was detained. https://t.co/V9uU14ZvEV","date":"Wed Jun 22 13:57:44 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Film director Paul Haggis appears in court in southern Italy amid sexual assault investigation. https://t.co/kQNlUqN06V","date":"Wed Jun 22 13:44:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: After being ousted last year, Benjamin Netanyahu is once again center stage as Israel prepares for its fifth election in less than four years. https://t.co/HX1oD8TaO3","date":"Wed Jun 22 13:30:16 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former Purdue basketball star Caleb Swanigan has died aged 25, coroner’s office says. https://t.co/2mh24frwHx","date":"Wed Jun 22 13:17:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Robb Elementary School in Uvalde, Texas, where a gunman killed 19 students and two teachers last month will be demolished, the city's mayor says. https://t.co/vsPDGGRtbR","date":"Wed Jun 22 12:59:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Louisiana Gov. Edwards signs bill that would make doctors who perform abortions subject to prison terms of one to 10 years — a measure that would take effect when and if Roe v. Wade is overturned. https://t.co/0G5kkwwbrL","date":"Wed Jun 22 12:39:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Black former elevator operator at Tesla’s flagship California assembly plant on Tuesday rejected a $15,000,000 award in his lawsuit alleging racial abuse by coworkers, opening the door for a new trial after a judge slashed a $137,000,000 jury verdict. https://t.co/tHLO2jxfi2","date":"Wed Jun 22 12:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"American airman arrested following an investigation into an attack that wounded four troops at a small U.S. base in eastern Syria in April, Air Force spokesperson says. https://t.co/6yez2RQYbO","date":"Wed Jun 22 12:00:22 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"‘X Factor’ alum Tom Mann says his fiancée died on their wedding day. https://t.co/mTiL3TXjp0","date":"Wed Jun 22 11:46:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Sri Lanka’s PM says its debt-laden economy has “collapsed” after months of shortages of food, fuel and electricity. https://t.co/EerJFap5XE","date":"Wed Jun 22 11:28:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: At least 1,000 people killed after 6.1 magnitude earthquake strikes eastern Afghanistan, government spokesperson says. https://t.co/mZHIDswyF3","date":"Wed Jun 22 11:18:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: Louisiana lawmakers pass first law restricting solitary confinement for youth after 2 suicides and an @NBCNews, @ProPublica and @MarshallProj investigation into harsh conditions in a new state juvenile facility. https://t.co/18q0G3ONR1","date":"Wed Jun 22 11:00:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Passenger jet crash-lands at Miami International Airport Tuesday, causing a fire and prompting 3 people to seek medical attention for minor injuries, officials say. https://t.co/q9oyWjraJM","date":"Wed Jun 22 10:45:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Mayor of Philadelphia offering $20K reward for information on the killing of a Filipino lawyer in the city over the weekend, senior Philippine diplomat says. https://t.co/kyod4Q61DK","date":"Wed Jun 22 10:27:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Researchers found that people who couldn't stand on one foot were nearly twice as likely to die in the next 10 years. https://t.co/nk48qedap0","date":"Wed Jun 22 10:16:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: At least 1,000 people killed after 6.1 magnitude earthquake strikes eastern Afghanistan, government spokesperson says. https://t.co/L18rXGTlhF","date":"Wed Jun 22 09:59:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden will call on Congress to pass legislation creating a federal tax holiday on gas and diesel fuel for three months, senior administration officials say. https://t.co/9CLlyujIzP","date":"Wed Jun 22 09:49:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. says it is rallying its allies against forced labor as it begins implementing an import ban on goods from China’s Xinjiang region, where Washington says Beijing is committing genocide. https://t.co/xiI3uMzEiM","date":"Wed Jun 22 09:34:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Brooklyn Center agrees to pay $3.25M to the family of Daunte Wright, family attorneys say. https://t.co/sXbH7bQsaB","date":"Wed Jun 22 09:17:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Passenger jet crash-lands at Miami International Airport Tuesday, causing a fire and prompting 3 people to seek medical attention for minor injuries, officials say. https://t.co/1Hxk1yAfkF","date":"Wed Jun 22 09:03:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"U.S. Coast Guard is searching for a couple who went missing after setting sail for the Azores, officials say. https://t.co/ZGAY6FIBaM","date":"Wed Jun 22 08:46:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"UK hit by the biggest rail strike in 30 years, bringing chaos to the country's transport network. \n\nThe strikes come as Britain faces a near-unprecedented rise in the cost of living. https://t.co/FJYD21bEkb","date":"Wed Jun 22 08:31:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"DEVELOPING: At least 300 people killed after 6.1 magnitude earthquake strikes eastern Afghanistan, officials say. https://t.co/XyiqW9fOuI","date":"Wed Jun 22 08:10:43 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The first National Park Service visitor center focused on teaching LGBTQ history will open right next door to New York City’s historic Stonewall Inn. https://t.co/vTQ3lbvonW","date":"Wed Jun 22 07:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"AG Garland is meeting with Ukraine's prosecutor general to discuss international efforts to prosecute people involved in war crimes. https://t.co/pDuZYQFagF","date":"Wed Jun 22 07:22:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The $500,000 investment comes as hate crimes targeting the Asian American community reached unprecedented highs during the pandemic. https://t.co/10Y7QfLVoQ","date":"Wed Jun 22 07:02:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"‘X Factor’ alum Tom Mann says his fiancée died on their wedding day. https://t.co/WfYvAWc93l","date":"Wed Jun 22 06:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Ilya Somin: The 6-3 decision in Carson v. Makin is an important victory for the constitutional principle that government may not discriminate on the basis of religion. - @NBCNewsTHINK https://t.co/pPxPYTHlEG","date":"Wed Jun 22 06:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Black former elevator operator at Tesla’s flagship California assembly plant on Tuesday rejected a $15,000,000 award in his lawsuit alleging racial abuse by coworkers, opening the door for a new trial after a judge slashed a $137,000,000 jury verdict. https://t.co/3qvrKwRRjE","date":"Wed Jun 22 06:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The lawyer for several victims of a Mexican megachurch leader who pleaded guilty of sexually abusing minors said they are planning to sue other leaders of the church, alleging they were complicit in the abuse. https://t.co/2GQ9RXWfK7","date":"Wed Jun 22 05:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Vaccines have previously been available only for health workers taking care of monkeypox patients or for cleaners disinfecting areas contaminated by the virus. https://t.co/410uZ0KdLx","date":"Wed Jun 22 05:22:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Researchers found that people who couldn't stand on one foot were nearly twice as likely to die in the next 10 years. https://t.co/pMmSj0Kihh","date":"Wed Jun 22 05:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"For the average healthy adult, experts think there’s not a good reason to start taking dietary supplements, and they might even be a waste of money. https://t.co/WjbiuZxFqH","date":"Wed Jun 22 04:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A popular Arizona drag queen is blasting Kari Lake — the front-runner in the state's Republican primary for governor — as a \"hypocrite\" for targeting drag performers, saying she was a frequent attendee of his shows. https://t.co/jqvS9NgDrH","date":"Wed Jun 22 04:22:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"2 women seriously injured while skydiving in Wisconsin, officials say. https://t.co/uw7KaMSkdn","date":"Wed Jun 22 04:02:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A 5-year-old boy in Texas has died after being left in a sweltering car for several hours as the child’s family prepared for his sibling’s birthday party, authorities say. https://t.co/KLvPxGE9rD","date":"Wed Jun 22 03:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The additional traffic, plus lower numbers of pilots and flight crews, have translated to serious headaches for travelers. But some of the pilots are pointing fingers at their own airlines. https://t.co/CB6RB09wui","date":"Wed Jun 22 03:22:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The rule is expected in May 2023 and would be crafted with the goal of making it easier for tobacco users to quit and help prevent youth from becoming regular smokers. https://t.co/KbMr5B0oGD","date":"Wed Jun 22 03:02:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Cleveland police officer who was once recognized as officer of the year is under investigation after he was accused of glorifying Adolf Hitler and spreading antisemitism in old social media posts that have resurfaced. https://t.co/Vq6SMqcHQ1","date":"Wed Jun 22 02:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Police response to Uvalde mass shooting was an 'abject failure,' but other basic school safety measures also failed, Texas official says. https://t.co/Hf00Lv3pqu","date":"Wed Jun 22 02:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Michael Avenatti’s remaining 31 criminal charges to be dropped after guilty plea; the charges carry a maximum 83 years in prison, though Avenatti will likely get far less. https://t.co/HmZ3X4Vys6","date":"Wed Jun 22 02:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"A Japanese court ruled on Monday that a ban on same-sex marriage was not unconstitutional, dealing a setback to LGBTQ rights. https://t.co/UbXKxGCSzB","date":"Wed Jun 22 01:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“There is nowhere I feel safe. Nowhere.\"\n\nEmotional testimony at Tuesday's Jan. 6 committee hearing by Ruby Freeman and Shaye Moss underscored the direct and dangerous effects former President Trump's lies had on election workers. https://t.co/soyiZibEOL","date":"Wed Jun 22 01:22:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Trump-backed Katie Britt defeats Rep. Mo Brooks in runoff to be the GOP nominee for Senate in Alabama, NBC News projects. https://t.co/v5emqcIDYo","date":"Wed Jun 22 01:12:35 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Yesli Vega wins U.S. House Republican primary in Virginia's 7th congressional district, NBC News projects. https://t.co/ydQb99zVA8 https://t.co/g5ExWcjCYT","date":"Wed Jun 22 01:02:37 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"UK hit by the biggest rail strike in 30 years, bringing chaos to the country's transport network. \n\nThe strikes come as Britain faces a near-unprecedented rise in the cost of living. https://t.co/CAPRJzqixd","date":"Wed Jun 22 01:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elon Musk’s transgender daughter files request to change her name in accordance with her new gender identity and because “I no longer live with or wish to be related to my biological father in any way, shape or form.” https://t.co/uewU0aNQYF","date":"Wed Jun 22 00:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The new Latino-centered reboot of “Father of the Bride,” starring Andy García and Gloria Estefan, attracted the largest audience of any HBO Max movie that has streamed exclusively on the platform.\nhttps://t.co/IWoyPIvOND","date":"Wed Jun 22 00:22:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Kellogg is planning to separate into three independent public companies, sectioning off its iconic brands into distinct snacking, cereal and plant-based businesses. https://t.co/TQm3fSUvLU","date":"Wed Jun 22 00:02:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Terry Namkung wins U.S. House Republican primary in Virginia's 3rd congressional district, NBC News projects. https://t.co/BzeiFzATDr https://t.co/GhyOaVvgmr","date":"Tue Jun 21 23:57:21 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Progressive challenger Jessica Cisneros concedes to Rep. Henry Cuellar of Texas after a recount in a race that was decided by less than 300 votes. https://t.co/1UlDRnWuLP","date":"Tue Jun 21 23:42:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Jen Kiggans wins U.S. House Republican primary in Virginia's 2nd congressional district, NBC News projects. https://t.co/NamZB3PXKx https://t.co/YuqagVL2y6","date":"Tue Jun 21 23:39:42 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Donald Beyer wins U.S. House Democratic primary in Virginia's 8th congressional district, NBC News projects. https://t.co/6piCzNQ9bI https://t.co/kR54XOGrzr","date":"Tue Jun 21 23:28:48 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Bee Nguyen is the Democratic nominee for secretary of state in Georgia, NBC News projects; she will face GOP incumbent Brad Raffensperger in November. https://t.co/OTTeFNYlKj","date":"Tue Jun 21 23:23:50 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Here are the top takeaways from Tuesday's hearing of the House committee investigating the Jan. 6 attack on the Capitol. https://t.co/qWV3s80Nxg","date":"Tue Jun 21 23:22:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: Bipartisan group of senators overcome last-minute hurdles and release legislative text on a narrow set of provisions to combat gun violence, including state funding to implement “red flag” laws and enhanced background checks. https://t.co/o2ncqL1GIl","date":"Tue Jun 21 23:12:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Netflix's “Squid Game: The Challenge,\" promises a social experiment and $4.56 million for the winner, but some fans say the series disregards the show's message. https://t.co/FFzq7YfLYO","date":"Tue Jun 21 23:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"BREAKING: Jury finds Bill Cosby sexually assaulted a 16-year-old girl at the Playboy Mansion in 1975, awards her $500,000. https://t.co/2rctuNjCNG","date":"Tue Jun 21 22:50:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Four-time All-Pro tight end Rob Gronkowski announced his retirement again, meaning he will not join Tom Brady for a third season in Tampa Bay. https://t.co/JhtZNHhMcq","date":"Tue Jun 21 22:42:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: A verdict has been reached in a civil trial against Bill Cosby brought by a woman who said he sexually assaulted her at the Playboy Mansion in 1975 when she was 16. https://t.co/eHJYxX9eYC","date":"Tue Jun 21 22:22:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Clela Rorex, a former Colorado county clerk who was the first public official to issue a same-sex marriage license in 1975, has died. She was 78. https://t.co/tLM0dMX0Hv","date":"Tue Jun 21 22:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former President Trump's Save America PAC cut $1 million checks to groups helping Dr. Oz in the Pennsylvania GOP Senate primary and another to a group that sought to dethrone Georgia Gov. Brian Kemp. - @MeetThePress https://t.co/y2s661Sk4m","date":"Tue Jun 21 21:44:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former President Trump's lawyers orchestrated a plot to overturn the 2020 election by organizing slates of alternate \"fake electors\" in seven pivotal states, according to testimony and documents presented by the Jan. 6 committee. https://t.co/rdifxbj75W","date":"Tue Jun 21 21:31:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Widespread layoffs at crypto startups may be just the beginning of a reckoning, some analysts said, as the still-young market faces a sudden reversal from the celebrity-driven boom it experienced a few months ago. https://t.co/Fbcb5LwNGv","date":"Tue Jun 21 21:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The clash between Katie Britt and Rep. Mo Brooks in the Alabama GOP Senate primary offers another test of Trump's endorsement. https://t.co/P8uM7inIzX","date":"Tue Jun 21 20:49:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Chicago police officers won’t be allowed to chase people on foot if they suspect them of minor offenses. This comes more than a year after two foot pursuits ended with officers fatally shooting a 13-year-old boy and 22-year-old man. https://t.co/RGST6fS1Ct","date":"Tue Jun 21 20:18:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“I don't go to the grocery store at all.\"\n\nFormer Georgia elections worker Wandrea \"Shaye\" Moss, who was aggressively targeted in the weeks after the 2020 election, explained how the harassment she faced by pro-Trump supporters irreversibly changed her life. https://t.co/5bGXMzNIz6","date":"Tue Jun 21 19:51:40 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“I have lost my name and I have lost my reputation.\"\n\nRuby Freeman, an election worker who was aggressively targeted in the weeks after the 2020 election, explained how the harassment she faced by pro-Trump supporters irreversibly changed her life. https://t.co/1KYuxFBdiA","date":"Tue Jun 21 19:44:00 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“Do you think they’ll be working after Christmas, to keep it going fast? Because you know we have the date of the 6th, which is a very important date,” Trump said during the call. https://t.co/RiukwaQYoF","date":"Tue Jun 21 19:22:43 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"AARP, the advocacy group for Americans over fifty, is launching new TV ads in West Virginia urging Sen. Joe Manchin to support a budget reconciliation bill that includes a major prescription drug savings policy. - @MeetThePress https://t.co/ONUMZji36N","date":"Tue Jun 21 19:17:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Uber is bringing back shared rides in some U.S. cities after suspending the service in March 2020 due to the Covid-19 pandemic. https://t.co/eZlawzuXyK","date":"Tue Jun 21 19:01:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"“Three counts, all remarkably close, which showed that President Trump did come up short,” Georgia Secretary of State Raffensperger testified. https://t.co/AUXnxLbhDe","date":"Tue Jun 21 18:53:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Arizona House Speaker Rusty Bowers testified that he did not tell former President Trump that the election was rigged and he won Arizona, responding to Trump's claim that he had said so. https://t.co/MWIUNlCHL9","date":"Tue Jun 21 18:33:26 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"'We’ve got lots of theories but we just don’t have the evidence,'\" Arizona's state House speaker Rusty Bowers recalled Rudy Giuliani telling him during a December 2020 meeting.\n\nMore: https://t.co/cYM80mNXFG https://t.co/S47cB7tWRr","date":"Tue Jun 21 18:32:39 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Arizona's House speaker testified that then-President Trump and Rudy Giuliani asked him to organize a hearing on voter fraud allegations and have the legislature appoint an alternate slate of electors — giving Arizona's electoral college votes to Trump. https://t.co/pFHo2J0aID","date":"Tue Jun 21 18:22:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Louisville Mayor Fischer is “doing fine,” according to a tweet from the Louisville Metropolitan Police Department. The dept released photos of a suspect they are trying to locate. https://t.co/eyRsmDNZhA","date":"Tue Jun 21 18:13:46 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 Committee revealed the Trump campaign had put together a phone call script for supporters to pressure state elections officials to advance a fake slate of electors designed to overturn the 2020 election in their states.\n\nMore: https://t.co/c260QqQkCp https://t.co/VLWfpyNG8h","date":"Tue Jun 21 18:08:32 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"'We’ve got lots of theories but we just don’t have the evidence,'\" Arizona's state House speaker Rusty Bowers recalled Rudy Giuliani telling him during a December 2020 meeting. https://t.co/5zCAgsJdhq","date":"Tue Jun 21 18:03:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Arizona's state House speaker Rusty Bowers was asked to respond to former President Trump's claim that Bowers told him in Nov. 2020 that the election was rigged and Trump won Arizona.\n\n\"That certainly isn't it,\" Bowers said. https://t.co/KJBBZr3VgB","date":"Tue Jun 21 17:53:51 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"These are the witnesses testifying at Tuesday's hearing: https://t.co/hyoPxjbhQs","date":"Tue Jun 21 17:49:59 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 Committee revealed the Trump campaign had put together a phone call script for supporters to pressure state elections officials to advance a fake slate of electors designed to overturn the 2020 election in their states. https://t.co/gs377vOaM2","date":"Tue Jun 21 17:45:20 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Thompson highlighted an event in which a court had to step in and order a GOP-controlled county commission to certify results of a recent election after the body's three members refused to do so. While two members relented, one still refused. https://t.co/ejtnoPAcxh","date":"Tue Jun 21 17:29:45 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Rep. Cheney said in her opening statement that Trump had a \"direct and personal role\" in the effort to pressure state officials to overturn the 2020 election and said it \"deserves\" the attention of the DOJ. https://t.co/Hf6PIAxfP2","date":"Tue Jun 21 17:17:26 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Cleveland Browns quarterback Deshaun Watson has reached confidential settlements with all but four women who accused him of sexual misconduct during massage sessions, the women’s lawyer said. https://t.co/xqt973VRwP","date":"Tue Jun 21 17:09:49 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 committee returns to focus on then-President Trump’s direct efforts to pressure state officials to overturn the 2020 election, hearing testimony from GOP witnesses from Georgia and Arizona. https://t.co/LaP9vEvcXd","date":"Tue Jun 21 16:43:33 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"WATCH LIVE: The Jan. 6 Committee is holding its fourth public hearing, focusing on efforts by then-President Trump to strong-arm state officials into defying voters and handing him the 2020 election. https://t.co/mhywnd6WZ1 https://t.co/pFzjjHOVDq","date":"Tue Jun 21 16:31:57 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The law enforcement response to the Uvalde school shooting was an \"abject failure\" with police lives prioritized over those of children, the Texas Department of Public Safety Director said. https://t.co/edU9o3eRSc","date":"Tue Jun 21 16:23:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Former Tesla employees are suing over a \"mass layoff\" without advance notice of job cuts, according to the suit. https://t.co/LsIds1J5SF","date":"Tue Jun 21 16:15:08 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"AG Garland is making a surprise visit to Ukraine, Dept. of Justice spokesperson says. https://t.co/V8f74yAVuG","date":"Tue Jun 21 16:01:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Twitter's board of directors advised shareholders to vote to approve Elon Musk's $44 billion offer to buy the social media company. https://t.co/8CVpIiZZA8","date":"Tue Jun 21 15:41:41 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Kim Kardashian is putting to rest any rumors that she damaged the iconic Marilyn Monroe dress she wore at the Met Gala last month.\n\n“No, and Ripley’s, we worked together so well,” she said on @todayshow. “There were handlers in gloves that put it on me.” https://t.co/CsTLiIxgJu","date":"Tue Jun 21 15:29:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Before Georgia Secretary of State Brad Raffensperger is expected to testify in front of the Jan. 6 committee, former President Trump defended a Jan. 2021 phone call during which he asked Raffensperger to \"find\" enough votes to overturn Joe Biden's win. https://t.co/en8FUIx833","date":"Tue Jun 21 15:19:18 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Jan. 6 committee issued a subpoena last week to documentary filmmaker Alex Holder, a source familiar with the move confirmed.\n\nHolder had access to Trump before and after Jan. 6. Holder is fully complying and has provided 15 to 20 hours of video. https://t.co/toAO3xykwP","date":"Tue Jun 21 15:17:11 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: UK hit by the biggest rail strike in 30 years, bringing chaos to the country's transport network. \n\nThe strikes come as Britain faces a near-unprecedented rise in the cost of living. https://t.co/y8lxPTX1Uh","date":"Tue Jun 21 15:13:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"LIVE UPDATES: The House committee investigating the Jan. 6 attack will hold its fourth public hearing, focusing on efforts by then-President Trump to strong-arm state officials into defying voters and handing him the 2020 election. https://t.co/VXVDIyvgkb","date":"Tue Jun 21 15:07:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elon Musk’s transgender daughter files request to change her name in accordance with her new gender identity and because “I no longer live with or wish to be related to my biological father in any way, shape or form.” https://t.co/OHlZqd3NnQ","date":"Tue Jun 21 14:56:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The Supreme Court ruled that state programs providing money for public school tuition cannot exclude schools that offer religious instruction. https://t.co/d9zFR1mSP9","date":"Tue Jun 21 14:36:27 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Dave Chappelle reveals that he’s decided against having the theater at his former high school named after him. https://t.co/umeOziTHhV","date":"Tue Jun 21 14:30:14 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Child hospitalized after being stabbed in the chest by a catfish's stinger and experiencing difficulty breathing in Florida, officials say. https://t.co/XsevvqP1mX","date":"Tue Jun 21 14:15:06 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"It worked.\"\n\nA Florida dog breeder who was being forced to drive by three alleged kidnappers saved himself by deliberately violating the rules of the road — in front of some sheriff’s deputies. https://t.co/3zjRfnCOei","date":"Tue Jun 21 14:01:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"South Dakota senators begin hearing evidence for the impeachment of AG Ravnsborg. https://t.co/F3N2PqRIdf","date":"Tue Jun 21 13:46:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"President Biden and first lady Jill Biden will visit a Covid vaccination clinic in D.C. to highlight the recent approval of the shots for children under age 5. https://t.co/JcR03cRPwr","date":"Tue Jun 21 13:30:15 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: U.S. citizen was killed in combat in Ukraine last month, State Dept. says, the second U.S. citizen reported to have been killed since the war began. https://t.co/h8nI9HiJHU","date":"Tue Jun 21 13:09:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"JUST IN: President Biden to nominate first Native American as U.S. treasurer. https://t.co/J0BHJv93s2","date":"Tue Jun 21 12:55:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"'Zoolander' meets Zelenskyy as actor Ben Stiller visits Kyiv to mark World Refugee Day. https://t.co/aESvUbmGhI","date":"Tue Jun 21 12:48:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Dartmouth College is removing all federal and institutional loans from its undergraduate financial aid awards and replacing them with expanded scholarship grants, school’s president says. https://t.co/iV01TC3EWY","date":"Tue Jun 21 12:30:10 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Elon Musk’s transgender daughter files request to change her name in accordance with her new gender identity and because “I no longer live with or wish to be related to my biological father in any way, shape or form.” https://t.co/THDFJLlX3F","date":"Tue Jun 21 12:15:09 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"10 weeks after women's rights activist Roshan Mashal escaped to safety in the U.S. as part of 'Operation Allies Welcome,' she found herself out of food and money, with no access to healthcare or transportation, and separated from 3 of her kids. https://t.co/LdwKhweJ6q","date":"Tue Jun 21 12:02:03 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"EXCLUSIVE: Russian President Putin's spokesman would not guarantee that two American military veterans captured in Ukraine won’t face the death penalty in an interview with @NBCNews https://t.co/HWbocoGJJD","date":"Tue Jun 21 11:46:02 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Record 42M people around the U.S. expected to hit the road for trips over the July 4 weekend, AAA says. https://t.co/w8SMFUF7t5","date":"Tue Jun 21 11:29:01 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Police in San Leandro, California, have arrested a 25-year-old on suspicion of vandalizing a neighbor's home with anti-Asian graffiti. https://t.co/nwDmio0qLW","date":"Tue Jun 21 11:13:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"NEW: U.S. Navy warship fires a warning flare to wave off an Iranian Revolutionary Guard speedboat coming straight at it during a tense encounter in the Strait of Hormuz, officials say. https://t.co/pQr24eQQKS","date":"Tue Jun 21 11:02:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"\"It worked.\"\n\nA Florida dog breeder who was being forced to drive by three alleged kidnappers saved himself by deliberately violating the rules of the road — in front of some sheriff’s deputies. https://t.co/A5fRCmlopv","date":"Tue Jun 21 10:45:04 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"World swimming’s governing body effectively bans transgender athletes from competing in women’s events. https://t.co/FaSAr7bdh5","date":"Tue Jun 21 10:31:07 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"Russian President Putin’s top spokesperson gave no indication that WNBA star Brittney Griner will be released soon. https://t.co/MCo7NDhKR9","date":"Tue Jun 21 10:16:05 +0000 2022","user_id":"14173315"},{"handle":"NBCNews","text":"The far-right has sent a shockwave through France's political establishment, winning a historic number of seats in Sunday's parliamentary elections with an unexpected surge. https://t.co/W1bm6qyArI","date":"Tue Jun 21 09:57:07 +0000 2022","user_id":"14173315"}]