[{"handle":"npr","text":"With the Supreme Court overturning Roe v. Wade, Minnesota will be one of the states where abortion remains legally protected. But legal doesn't necessarily mean accessible, advocates warn. https://t.co/CVrWlXc2YH","date":"Sat Jun 25 20:39:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Many people are getting hurt financially because mortgage rates rose sharply while they were waiting for their new homes to be built. And now it's hard or impossible to buy them. Share your story. https://t.co/Cym28UX983","date":"Sat Jun 25 19:46:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A landmark study that followed women for a decade found that those denied an abortion were 4 times as likely to be living in poverty years later. Data show that the consequences don't stop there.\nhttps://t.co/WBDGWAOaLf","date":"Sat Jun 25 18:59:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here's what you should read, watch and listen to this weekend, as selected by our friends over at @pchh. \nhttps://t.co/8LzILAmPPw","date":"Sat Jun 25 18:13:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"At least one person was killed and two others wounded in a shooting at a WeatherTech facility in the Chicago suburb of Bolingbrook, Ill., police said.\nhttps://t.co/w3fy1ayFlA","date":"Sat Jun 25 17:26:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Even if employers and coworkers genuinely want to be inclusive of their trans teammates, they often aren't sure where to start. Here are four ways that you can make your workplace — digital or otherwise — more welcoming and equitable for trans people: https://t.co/lSnDGl4Hby","date":"Sat Jun 25 17:07:53 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Bodily autonomy is a principle of the disability rights movement. With the overturn of Roe v. Wade, people with disabilities worry about how they will be disproportionately affected. https://t.co/dcUra0tNgq","date":"Sat Jun 25 16:16:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"People in prison will soon have access to Pell grants — and the money doesn't need to be repaid. That means more than half a million incarcerated people will have a chance at higher education.\nhttps://t.co/sAW5vjjox5","date":"Sat Jun 25 15:34:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Lil Nas X's contentions with BET speak to a paradox that's played out over the last decade: How to square the ostensible subjectivity of entertainment awards with historical biases among awards voting groups?\n https://t.co/9pogmSPoX0","date":"Sat Jun 25 14:52:32 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: President Biden has signed into law the first major gun safety legislation passed by Congress in nearly 30 years.\nhttps://t.co/E5YREdpOyI","date":"Sat Jun 25 13:23:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A gunman opened fire in Oslo's nightlife district — including outside a gay bar — killing 2 people and leaving 10 seriously injured early Saturday, in what police are investigating as a possible terrorist attack. \n\nThe city's Pride festival was canceled.\nhttps://t.co/xNV9NJStNx","date":"Sat Jun 25 13:19:20 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In less than 24 hours since the Supreme Court overruled Roe v. Wade, abortion has already been made illegal or heavily restricted in at least 11 states. https://t.co/zLuqQzp4xi https://t.co/d1thZewrkt","date":"Sat Jun 25 12:38:32 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"It's been four months since Russia invaded Ukraine on Feb. 24. As Friday draws to a close in Kyiv and in Moscow, here are the key developments: https://t.co/IbJMGdpbcc","date":"Sat Jun 25 11:41:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The 2022 tour was a victory lap for Contest winner Alisa Amador and also showcased local talents in Washington, D.C., Atlanta, Seattle, Los Angeles and New York. https://t.co/un6gk2uMLE","date":"Sat Jun 25 09:40:40 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The legendary saxophonist Gary Bartz shares stories from his 60-plus-year career, covering everything from bebop to hip-hop. Hear his heartfelt conversation with host Christian McBride. https://t.co/Fg0qnmb7rJ","date":"Sat Jun 25 09:00:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Roe v. Wade has fallen.\n\nHere are five scenarios that could play out in the coming months following the Supreme Court's reversal of the landmark ruling.\nhttps://t.co/y7x7oxeuog","date":"Sat Jun 25 08:44:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"NPR's Leila Fadel talks to Naomi McPherson, Katie Gavin and Josette Maskin of the band MUNA about their third album: MUNA. https://t.co/dyzd9FOApr","date":"Sat Jun 25 08:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Monica delivers a vibrant vocal masterclass in this Tiny Desk (home) concert that spans decades. https://t.co/CUFL2ccSkI","date":"Sat Jun 25 07:54:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The end of Roe has sparked speculation — including by President Biden — that other landmark rulings could now be on shaky ground, including those that legalized same-sex marriage and birth control.\n\nHere's what to know.\nhttps://t.co/uL1NjjqLRl","date":"Sat Jun 25 07:08:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Researchers have found that the rates of abortion are basically the same in countries where the procedure is broadly legal and those where it's prohibited. \n\nHere's why.\nhttps://t.co/Zjh081A7Lb","date":"Sat Jun 25 06:26:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A U.N. human rights review found that the shots that killed Al Jazeera journalist Shireen Abu Akleh came from Israeli forces — not Palestinians, despite Israel's claim that it is unclear which side killed her. https://t.co/JYsDW8ebz0","date":"Sat Jun 25 05:46:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In 1993, the Lesbian Avengers organized the first Dyke March. They were secretaries, cab drivers, teachers and artists — brought together on a mission for lesbian visibility and political change. https://t.co/I00M4sF168","date":"Sat Jun 25 05:03:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"At the last G-7, President Biden announced a plan for the West to counter China's influence in low- and middle-income countries. But not much has happened since. This year, there's a relaunch. https://t.co/hkwuwB33pO","date":"Sat Jun 25 04:44:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Demonstrators from both sides of the abortion issue gathered outside the Supreme Court after the justices overturned the constitutional right to an abortion. https://t.co/tmdmwvlTnC","date":"Sat Jun 25 03:59:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Rents have soared by double digits, but landlords say they're also struggling with higher costs. https://t.co/cqQaTnUG64","date":"Sat Jun 25 03:30:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here are some tips to help you become a better ally to your trans teammates this Pride Month and beyond: https://t.co/HJDRUQx6kK","date":"Sat Jun 25 03:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Physicians must treat in line with patients' wishes and standards of care. Some medical ethicists say that abortion bans will force doctors to disregard these obligations in order to follow the law. https://t.co/zxVPNtXcWp","date":"Sat Jun 25 02:45:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A new study found that reading accurate articles about climate change influenced participants to support climate policies — but those beliefs were reversed when exposed to articles doubting climate change. https://t.co/EQj9pyXkdM","date":"Sat Jun 25 02:44:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ukrainians who were held in Russia detail their detention, hoping to help find a teacher still missing. She is one of more than 200 civilians that U.N. human rights workers say Russia has disappeared. https://t.co/dXANhFsJX2","date":"Sat Jun 25 02:00:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Voting Rights Act requires some states and local areas to offer election materials in more than just English.\n\nBut the support for voters is limited to Spanish, Asian and Native American languages. https://t.co/NjvIN1dKem","date":"Sat Jun 25 01:30:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"The Constitution does not confer a right to abortion,\" Justice Samuel Alito wrote for the majority. The court's liberals warn that other rights could now be vulnerable. https://t.co/aQkp3kybhA","date":"Sat Jun 25 01:00:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Netflix is laying off roughly 300 more of its employees. The decision comes shortly after the company laid off 150 employees in May. https://t.co/aJUftUDVMv","date":"Sat Jun 25 00:42:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The \"Dobbs\" in the case title refers to Thomas Dobbs, an infectious diseases doctor who became Mississippi's top health officer the same year the state adopted new abortion restrictions. https://t.co/t7PYJIdQZF","date":"Sat Jun 25 00:00:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Both pro- and anti-abortion demonstrators gathered outside the Supreme Court after the court overturned the constitutional right to an abortion that was guaranteed nearly 50 years ago by Roe v. Wade. https://t.co/ypi4kub8ud","date":"Fri Jun 24 23:30:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Condé Nast CEO Roger Lynch calls it a \"crushing blow\" and says in an internal memo to employees of Vogue, New Yorker and Vanity Fair among others to use their journalism to respond to the moment. https://t.co/aBnQy9nWlh","date":"Fri Jun 24 22:53:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Many global reproductive rights groups warn that the U.S. overturning of the constitutional right to abortion will have far-reaching effects worldwide. https://t.co/7vmjVqGKMm","date":"Fri Jun 24 22:17:38 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Kentucky Attorney General Daniel Cameron says now that the Supreme Court has overturned Roe v. Wade, most abortions are now banned in the commonwealth. https://t.co/MEARMyHq3B https://t.co/XdVD5RvDT2","date":"Fri Jun 24 22:00:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Supreme Court overturned the constitutional right to an abortion that was guaranteed nearly 50 years ago by the decision in Roe v. Wade.\n\nHere are scenes from D.C., and across the country after the news broke. \n\nhttps://t.co/AncQ44iV84","date":"Fri Jun 24 21:16:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚡️ “What conservative justices said about Roe at their confirmation hearings” by @NPR https://t.co/YDE65IVTxo","date":"Fri Jun 24 21:11:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Follow live updates on the Supreme Court decision overturning Roe v. Wade: https://t.co/zBjr5r8a2y","date":"Fri Jun 24 21:06:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"6. John Roberts (2005)\n\nDuring his confirmation hearing, Roberts said Roe was \"settled as a precedent of the court.\"\n\nFor the court to overturn a prior decision, Roberts said he thought it was not sufficient to believe the case had been wrongly decided.\n\nhttps://t.co/zun18jG1oq https://t.co/XYOkTHi952","date":"Fri Jun 24 21:06:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"5. Amy Coney Barrett (2020)\n\nBarrett was asked if she considered Roe to be a \"super-precedent.\"\n\nShe answered by defining super-precedent as \"cases that are so well settled that no political actors and no people seriously push for their overruling.\"\n\nhttps://t.co/zun18jG1oq https://t.co/pppZtmBiqi","date":"Fri Jun 24 21:06:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"4. Brett Kavanaugh (2018)\n\nSen. Susan Collins said Kavanaugh had told her he considered Roe to be \"settled law.”\n\nBut Kavanaugh stopped short of repeating that line in his hearing, instead focusing on Roe's status as Supreme Court precedent.\n\nhttps://t.co/zun18jG1oq https://t.co/6h8R2AjLPd","date":"Fri Jun 24 21:06:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"3. Neil Gorsuch (2017)\n\nDuring Gorsuch's confirmation hearing in early 2017, he refused to take a position on Roe. He told Sen. Lindsey Graham, that he \"would have walked out the door\" had Trump asked him to overturn Roe.\n\nhttps://t.co/zun18jG1oq https://t.co/6EGqMDdVRL","date":"Fri Jun 24 21:06:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"2. Clarence Thomas (1991)\n\nDuring his confirmation hearing in 1991, Thomas refused to state an opinion on abortion or whether Roe had been properly decided. Doing so could compromise his future ability to rule on cases related to Roe, he said. \n\nhttps://t.co/zun18jG1oq https://t.co/EtFNG4UUVF","date":"Fri Jun 24 21:06:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"1. Samuel Alito (2006)\n\nDuring his confirmation hearing, which took place in January 2006, Alito declined to say much directly about Roe. He called it an \"important precedent of the Supreme Court\" but stopped short of calling it settled law.\n\nhttps://t.co/zun18jGzdY https://t.co/PGqFQ2JbhB","date":"Fri Jun 24 21:06:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"For decades, nominees to the Supreme Court have had to answer questions about Roe v. Wade, the landmark 1973 ruling that, until now, guaranteed the right to abortion in the U.S.\n\nhttps://t.co/hRRcI3djR6","date":"Fri Jun 24 21:06:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"That includes the six conservative justices who have now overturned Roe, ending the right to an abortion.\n\nHere's what each of the court's six conservative justices said about the case at their confirmation hearings:\nhttps://t.co/Qs0y9mCrsK","date":"Fri Jun 24 21:06:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Advocates are worried that the reversal of Roe will give rise to dangerous underground abortions.\n\nThis is the story of a family matriarch who died from one such procedure generations ago.\n\nHer family is still grieving.\nhttps://t.co/ay3aiU4aQv","date":"Fri Jun 24 20:43:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Neil Gorsuch in 2017: Precedent is the \"anchor of law.\"\n\nNeil Gorsuch in 2022: Joined the majority opinion overturning the constitutional right to abortion.\nhttps://t.co/oDttEqODGf","date":"Fri Jun 24 19:59:55 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Abortion remains legal in Florida, but a new law scheduled to go into effect July 1 shortens access from 24 weeks to 15 weeks for most abortions. @wusf  https://t.co/RnXRGDk8vB","date":"Fri Jun 24 19:59:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"At least 13 states had already passed “trigger laws,” meaning abortion will be outlawed within 30 days, and 13 others are likely to heavily restrict access. The right to abortion is protected in Massachusetts. @wgbh https://t.co/jNEcp4tVpt","date":"Fri Jun 24 19:59:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Tennessee Attorney General Herbert Slatery has already asked the 6th Circuit Court of Appeals to lift an injunction on the 2020 6-week abortion ban that has never been enforced.  https://t.co/1SWXyKOS6M","date":"Fri Jun 24 19:59:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"North Carolina is set to become a destination for people seeking abortions, after the U.S. Supreme Court on Friday overturned Roe v. Wade in a 6-3 decision. @WFAE  https://t.co/MOp0VLOU9K","date":"Fri Jun 24 19:59:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Supreme Court dealt a fatal blow to Roe v. Wade, a decision that allows Missouri to implement a \"trigger ban\" outlawing almost all abortions. Here's what you need to know about the new state of reproductive rights in Missouri. @kcur https://t.co/uUVBBY4ovl","date":"Fri Jun 24 19:59:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Supreme Court has overturned Roe v. Wade. Here's what it means for California. @CapRadioNews  https://t.co/MFctRu4ccF","date":"Fri Jun 24 19:59:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"What to know about Mississippi abortion rights after SCOTUS overturns Roe v. Wade. @MPBNews  https://t.co/VO5HK2Jmgt","date":"Fri Jun 24 19:59:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"What to know about Louisiana abortion rights after Supreme Court overturns Roe v. Wade. @WWNO  https://t.co/hBK1QG2Zjy","date":"Fri Jun 24 19:59:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Roe v. Wade ruling opens the door for U.S. states to ban or heavily restrict abortions immediately or in the near future, including in the Gulf South. Here are answers to some frequently asked questions about abortion laws in Alabama: @WBHM  https://t.co/cBneaItvWo","date":"Fri Jun 24 19:59:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"With the federal ruling, Kansas voters will now decided whether to remove the last barrier protecting abortion rights from the state’s constitution. @kcur  https://t.co/CK7ZtbwBbm","date":"Fri Jun 24 19:59:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Supreme Court decision does not affect any of the protections guaranteed by the RHEA. Abortions will remain legal in Colorado unless the state legislature decides to repeal the law. @cprnews https://t.co/pjG5gzQgll","date":"Fri Jun 24 19:59:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Supreme Court has ruled in favor of the state of Mississippi in Dobbs v. Jackson Women’s Health Organization. \n\nNow, abortion is illegal in Kentucky in almost all circumstances.  https://t.co/vUqbnDZOXA @WFPLNews","date":"Fri Jun 24 19:59:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Supreme Court's ruling on Dobbs v. Jackson Women's Health Organization effectively bans abortions outright in Texas in the next 30 days. @keranews \nhttps://t.co/4bWyjmSGSP","date":"Fri Jun 24 19:59:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Nearly all abortions in Idaho are poised to be outlawed in 30 days after the U.S. Supreme Court Friday gave individual states the right to prohibit abortion. @KBSX915\n https://t.co/336gVn8SWi","date":"Fri Jun 24 19:59:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Residents in Pennsylvania, Delaware, and New Jersey won’t be immediately affected by the Supreme Court’s decision — however, that could change by November’s midterm elections, especially in the Keystone State. @whyy https://t.co/xP9fEpaaOM","date":"Fri Jun 24 19:59:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Missouri anti-abortion advocates are praising a decision Friday by the U.S. Supreme Court that overturns Roe v. Wade, the landmark 1973 ruling that legalized abortions across the country. @stlpublicradio  https://t.co/VzAJiGpUMX","date":"Fri Jun 24 19:59:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Clinics here are already stretched, but with several neighboring states now set to all but completely ban the procedure, more people are likely to travel to New Mexico for abortion care. @KUNMnews  https://t.co/67exJxNq0q","date":"Fri Jun 24 19:59:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"U.S. Supreme Court overturns Roe v. Wade. What comes next in Ohio is unclear. @WKSU  https://t.co/PlWRHf3UTf","date":"Fri Jun 24 19:59:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Nearly all abortions are now illegal in Wisconsin after the U.S. Supreme Court released a decision Friday overturning Roe v. Wade. @WPR \nhttps://t.co/jz5iVdmTmO","date":"Fri Jun 24 19:59:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🧵Reproductive rights are in flux. Here’s what’s happening with abortion in each state.","date":"Fri Jun 24 19:59:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The end of Roe has sparked speculation — including by President Biden — that other landmark rulings could now be on shaky ground, including those that legalized same-sex marriage and birth control.\n\nHere's what to know.\nhttps://t.co/1bbXgiI5ri","date":"Fri Jun 24 19:37:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here is an essential guide to your reproductive health options in a post-Roe world, including:\n\n• How to layer contraceptives \n• When to use emergency contraception\n• Resources for unplanned pregnancies\n• What to do in case of complications\nhttps://t.co/ALJOkjVT0B","date":"Fri Jun 24 18:40:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"22 states have laws in place that will immediately ban abortions or pave the way to ban — or severely restrict — access to them.\n\nHere's a deeper look at what could happen: https://t.co/ylma06un8u https://t.co/bl18l5qmnH","date":"Fri Jun 24 17:59:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The decision to overturn Roe was the culmination of years of efforts by abortion opponents and an emboldened conservative arm of the Supreme Court, fortified by 3 Trump appointees.\n\nIn D.C. on Friday, the air was filled with cheers and chants of \"I will aid and abet abortion.\" https://t.co/KYZ3SEdYRr","date":"Fri Jun 24 17:23:53 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden said the Supreme Court “expressly took away a constitutional right for the American people,\" calling it “a sad day for the court and for the country.”\n\nHe called on voters to make their voices heard: \"This fall, Roe is on the ballot.\"\nhttps://t.co/rKB6LSnQOP","date":"Fri Jun 24 17:15:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In remarks after the Supreme Court overturned Roe v. Wade, President Biden said the decision was a “tragic error” with “real and immediate consequences.” https://t.co/PZolVyEJgY https://t.co/MxapNz919L","date":"Fri Jun 24 17:00:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Pink House in Mississippi is the clinic at the center of today's Supreme Court ruling overturning Roe v. Wade. Here's the story of how it took center stage — and what it plans to do next.\n\n🎧 Listen:\nhttps://t.co/TcynkEfIyE","date":"Fri Jun 24 16:50:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Now that Roe v. Wade has been struck down, a legal process that lets minors seek an abortion without telling their parents could disappear.\nhttps://t.co/WPFoEXodHW","date":"Fri Jun 24 16:46:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden addressing the nation after Roe v Wade is overturned https://t.co/AkaLRn4YXT","date":"Fri Jun 24 16:41:20 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"POTUS has taken the podium.","date":"Fri Jun 24 16:37:56 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"WATCH LIVE: President Biden will deliver remarks on the Supreme Court's ruling overturning Roe v. Wade.\nhttps://t.co/LFMe0a82v8","date":"Fri Jun 24 16:26:45 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Talking Roe v Wade with NPR reporters on @TwitterSpaces https://t.co/AkaLRnmAmt","date":"Fri Jun 24 16:03:50 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Researchers have found that the rates of abortion are basically the same in countries where the procedure is broadly legal and those where it's prohibited. \n\nHere's why.\nhttps://t.co/PG5Poa01G9","date":"Fri Jun 24 15:56:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Note: This post has been updated to reflect new developments.","date":"Fri Jun 24 15:40:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: Missouri has become the first state in the U.S. to ban most abortions after Roe was overturned. The so-called “trigger ban,” passed in 2019, took effect after the Supreme Court decision was certified by the attorney general. @kcur https://t.co/4M7wOOLAcq https://t.co/ghVhyfS24I","date":"Fri Jun 24 15:39:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Legal experts say the SCOTUS decision will pose new questions for other courts — specifically about how to apply its language to individual state laws.\n\nOne reproductive rights attorney predicts \"legal chaos\" in the ruling's immediate aftermath.\nhttps://t.co/Qs0y9mCrsK","date":"Fri Jun 24 15:24:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Nearly all abortions in Idaho are poised to be outlawed in 30 days after the U.S. Supreme Court Friday gave individual states the right to prohibit abortion. https://t.co/uY85AsBSkS https://t.co/9WiJfXqyVu","date":"Fri Jun 24 15:16:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"LIVE: NPR's legal affairs correspondent Nina Totenberg is live now on our airwaves discussing the reversal of Roe v. Wade.\n\nListen here:\nhttps://t.co/c7OWhVmXNj","date":"Fri Jun 24 15:12:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Roe's reversal means that, for all practical purposes, abortion will not be available in large swaths of the U.S.\n\nStates including Mississippi, North Carolina and Wisconsin could revert to pre-Roe abortion bans that have been on the books for decades.\nhttps://t.co/Qs0y9mCrsK","date":"Fri Jun 24 15:07:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We’ll be discussing Roe v Wade with reporters around the country, hearing live reactions on @TwitterSpaces at 12pm ET. https://t.co/AkaLRnmAmt","date":"Fri Jun 24 15:05:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Dissenting were Justices Stephen Breyer, appointed by President Clinton, and Justices Sonia Sotomayor and Elena Kagan, appointed by President Obama.\n\nHere's what they wrote. https://t.co/OOjnOtMasF","date":"Fri Jun 24 15:00:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Roe v. Wade has fallen.\n\nHere are five scenarios that could play out in the coming months following the Supreme Court's reversal of the landmark ruling.\nhttps://t.co/daqkB2DUUD","date":"Fri Jun 24 14:44:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"The Constitution does not prohibit the citizens of each State from regulating or prohibiting abortion. Roe and Casey arrogated that authority,\" the court's conservatives wrote in their majority opinion.\n\nThe three liberals dissented.\nhttps://t.co/Qs0y9mCrsK","date":"Fri Jun 24 14:20:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"BREAKING: The Supreme Court has officially overturned Roe v. Wade in a seismic ruling ending the right to abortion upheld for nearly half a century. https://t.co/wBetRhdEOA","date":"Fri Jun 24 14:15:50 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"El senador estatal Roland Gutierrez demandó al Departamento de Seguridad Pública de Texas el miércoles después de que la agencia denegó la solicitud del legislador de los registros relacionados con el tiroteo del mes pasado en Uvalde. (@TPRNews)\nhttps://t.co/RHGQFKxFBh","date":"Fri Jun 24 13:39:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A U.N. human rights review found that the shots that killed Al Jazeera journalist Shireen Abu Akleh came from Israeli forces — not Palestinians, despite Israel's claim that it is unclear which side killed her. https://t.co/v2fqFPQdlI","date":"Fri Jun 24 12:58:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"For the first time in 18 years, five planets — Mercury, Venus, Mars, Jupiter and Saturn — will be sequentially aligned and visible at dawn throughout June.\nhttps://t.co/kwZ0zhRoxf","date":"Fri Jun 24 12:23:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Senate passed a narrow, bipartisan bill late Thursday that could become Congress' first gun control measure in nearly 3 decades. It includes expanded background checks and incentives for red flag laws.\nhttps://t.co/lbDdK5DE0b","date":"Fri Jun 24 11:40:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Correction: A previous version of this tweet incorrectly referred to the hearing as happening today. In fact, it was Thursday.","date":"Fri Jun 24 11:00:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Witnesses in Thursday's Jan. 6 hearing revealed details of a dramatic Oval Office meeting on Jan. 3, 2021.\nhttps://t.co/oneNZvehML","date":"Fri Jun 24 10:58:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Read the full transcript from the June 23 hearing from the House select committee investigating the Jan. 6 Capitol attack. https://t.co/zb7ynC99sp","date":"Fri Jun 24 08:50:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A bunch of small but hungry bugs might hold the key to saving the planet. A new study from Australia shows that larvae of the darkling beetle can eat polystyrene — the material behind plastic foam. https://t.co/5s5y11gOEC","date":"Fri Jun 24 07:24:40 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A Florida judge has approved a $1.2 billion settlement for unit owners and families of the 98 victims who died in the collapse of a condo tower in Surfside last year. https://t.co/9qrEqSl536","date":"Fri Jun 24 06:09:22 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Looks like Elvis has left the chapel: Elvis’ licensing company is no longer allowing Las Vegas businesses to use The King’s likeness. https://t.co/gtaOBW5YgZ","date":"Fri Jun 24 05:24:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Health officials are warning that as the war in Ukraine stretches on an outbreak of cholera — an ancient, deadly but easily treatable disease — may break out in Mariupol.\nhttps://t.co/w4v8CKeNBO","date":"Fri Jun 24 04:43:24 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"For many people, especially queer people, having a healthy relationship is the ultimate validation for your core identity,\" says queer mindset coach Nathan Serrato. Let go of that need for validation, and find a connection based on your wants and needs: https://t.co/GIxs14QbkV","date":"Fri Jun 24 03:59:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Despite some major roads still being washed out, three of Yellowstone's five entrances opened this morning, to lines hundreds of cars long. https://t.co/ZAE8V3ClMz","date":"Fri Jun 24 03:59:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Almost 30 musicians, choir members and staff of the contemporary worship music collective Maverick City Music crowded behind the Tiny Desk for this performance. https://t.co/IbkEaKXDOj","date":"Fri Jun 24 03:30:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Saxophonist Charles Lloyd, who began his career in the '70s, has played with notable names like the Beach Boys and Cannonball Adderley. He's still flowing with music. https://t.co/zNCYW7bbuN","date":"Fri Jun 24 03:19:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The largest bacteria known to science have been discovered in the Caribbean. They're visible to the naked eye and surprisingly complex. https://t.co/UAsFeeXeWg","date":"Fri Jun 24 03:15:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"About a week before the Jan. 6 attack, there was an \"escalation\" of then-President Donald Trump's demands about election fraud allegations, a former acting deputy attorney general testified. https://t.co/giyp3hpbE0","date":"Fri Jun 24 02:35:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Former Justice Department officials described the relentless pressure Donald Trump put on them to find evidence of voter fraud when it didn't exist at Thursday's Jan. 6 hearing. Here are the key takeaways: https://t.co/FuyiEMuyFa https://t.co/6RxLDz6FYm","date":"Fri Jun 24 02:18:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"👋🏽Welcome to your evening news digest.\n\nHere are NPR Newscast's top stories right now.\n\n🎧Listen here: https://t.co/TgNSJL9ocL https://t.co/dm2RGHg9f4","date":"Fri Jun 24 02:03:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Various Republican House members requested pardons from President Donald Trump in the final days of his administration, according to testimony presented before the Jan. 6 committee. https://t.co/SSvGHM5M4Z","date":"Fri Jun 24 02:00:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Paula, thank you for making a donation! Join them in making our work possible by donating to your NPR station here:  https://t.co/tp1ajGlmpP https://t.co/ukCYnKWNDb","date":"Fri Jun 24 01:40:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"There are only three Ukrainian-run ports that are still operating in the country. All are on the Danube River in this secretive, multiethnic region that locals say has been long overlooked by Kyiv.\n\nIt's not overlooked anymore. https://t.co/vUjTSWZd5K","date":"Fri Jun 24 01:35:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The dating game can be hard, but navigating the dating world for the first time as a queer person? That can add even more complexity – and a lot of room for creativity. Face your dating fears, find queer community and stay true to yourself - here's how: https://t.co/Ji7gE78p4j?","date":"Fri Jun 24 01:00:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Baz Luhrmann's latest spectacle tackles the life of Elvis Presley, as filtered through his shady longtime manager. https://t.co/6A50uSCcJI","date":"Fri Jun 24 00:45:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Cuatro semanas después del tiroteo en la Escuela Primaria Robb de Uvalde, aún sigue surgiendo información increíble acerca de lo que sucedió – y lo que no sucedió. (@TPRNews)\nhttps://t.co/mOUXvjTXMF","date":"Fri Jun 24 00:08:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Lawmakers are racing the clock to pass a bill that would extend pandemic school meal waivers through the summer and next school year. https://t.co/aZw0dtzTyr","date":"Fri Jun 24 00:00:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Vladyslav Krasnoshchok describes himself as a \"geopolitical surrealist\" painter. Since Russia's invasion of Ukraine began, he's been photographing the war with a vintage Olympus 35 mm camera. https://t.co/9Bgf3rJVbK","date":"Thu Jun 23 23:30:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Amazon unveiled a new feature in the works for its virtual assistant Alexa that can read aloud in a deceased loved one's voice based on short recording of the person. https://t.co/SCI17PtnR9","date":"Thu Jun 23 23:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Federal law prevents some convicted domestic abusers from owning a gun, depending on their relationship to the victim. The new gun safety bill would expand that definition to include dating partners. https://t.co/hSmhvgjI73","date":"Thu Jun 23 22:30:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"As Thursday draws to a close in Kyiv and in Moscow, here are the key developments of the day: https://t.co/xZcz2SkjIQ https://t.co/qzPl18Rv8p","date":"Thu Jun 23 22:30:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Fifty years ago, Title IX banned discrimination based on sex in educational institutions. College sports had to change.\n\nHere's how four women fought to make that happen. https://t.co/fhBLRC1Hyl","date":"Thu Jun 23 22:09:19 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Recapping todays Jan 6th Hearing with @ilyamarritz and @NPRrelving https://t.co/JlrFgDBLVj","date":"Thu Jun 23 21:31:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Former Acting Deputy Attorney General Richard Donoghue, then-President Donald Trump asked top Justice Department officials to seize voting machines from states in late December 2020 in an effort to prove baseless claims that the election was rigged. https://t.co/wX6XCvqC2m https://t.co/TgBgXNaZ0l","date":"Thu Jun 23 21:21:49 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A Florida judge has approved a $1.2 billion settlement for unit owners and families of the 98 victims who died in the collapse of a condo tower in Surfside last year. https://t.co/BEFEgybvZR","date":"Thu Jun 23 21:19:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Actor Sean Penn attends Thursday's Jan. 6 hearing in person https://t.co/JTUFD64LZ5 https://t.co/lcRvVK1AD1","date":"Thu Jun 23 21:04:57 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A neurosurgeon, two nurses and a care coordinator are among those who were caring for soccer legend Diego Maradona after brain surgery and are now facing a homicide trial over his death.\nhttps://t.co/s33uC7tc0E","date":"Thu Jun 23 20:58:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Jan 6. panel discussed Rep. Scott Perry. Here's how he is involved https://t.co/hM6Z1dLPVw https://t.co/eB2pBKUuPE","date":"Thu Jun 23 20:45:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"DOJ officials pushed back on Trump's baseless election fraud claims https://t.co/JOuAGXM6qx https://t.co/CUx35cP21n","date":"Thu Jun 23 20:43:46 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Richard Donoghue, the former Deputy Attorney General, testified that he told Trump that Clark had no experience with election or criminal law nor the experience of running an agency the size of the Department of Justice. https://t.co/D6gwgRRtP2 https://t.co/7MnhsSQFy4","date":"Thu Jun 23 20:41:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Jan 6. committee detailed an Oval Office meeting where Trump proposed installing Jeffrey Clark to lead the Department of Justice. https://t.co/o3TLVRYZoW https://t.co/jKU1oyNEFq","date":"Thu Jun 23 20:15:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Education Dept. plans to reinstate Title IX regulations tossed out by the Trump administration — including an expansion of LGBTQI+ protections and requiring schools to respond to all sexual discrimination complaints. \nhttps://t.co/SGfgHNuuUa","date":"Thu Jun 23 20:12:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Rep. Liz Cheney previewed a key element of today's hearing — a draft letter from former Justice Department official Jeffrey Clark who was sympathetic to former President Trump's election lies. https://t.co/jdwudnbD3z https://t.co/PbWYrzI9HP","date":"Thu Jun 23 20:08:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here's a rundown of the three biggest Supreme Court cases we're still waiting on.\nhttps://t.co/BFCmoPxRSj","date":"Thu Jun 23 19:59:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Filmmaker Alex Holder testified behind closed doors to Jan. 6 committee today https://t.co/cjjUhpuL2J","date":"Thu Jun 23 19:31:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Jan 6. committee's public hearings on its investigation continue. Today's hearing will focus on the pressure former President Donald Trump put on the Justice Department to help him to overturn the 2020 election. Follow live updates here: https://t.co/oGKFnLBNto","date":"Thu Jun 23 19:29:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"PFLAG was started almost 50 years ago when gay people and their families were isolated and stigmatized.\n\nNow, the organization is finding new families to support and new legal battles to fight. https://t.co/At94ccJjIW","date":"Thu Jun 23 19:26:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Live coverage of the Jan 6th House Committee Hearings on @TwitterSpaces https://t.co/JlrFgDBLVj","date":"Thu Jun 23 19:02:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Footage shows firefighters pulling children, adults and a dog from flooded apartment buildings in the city of Yingde in China’s Guangdong province. More than 30,000 people have been evacuated due to severe flooding, local media said. https://t.co/oDXjSDUsDx","date":"Thu Jun 23 18:42:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Interior Secretary Deb Haaland and tribal leaders are advocating for a congressional commission to examine the impacts of the federal Native American forced-assimilation policy. https://t.co/8LKGIoCJLW","date":"Thu Jun 23 18:19:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Join us today at 3pm ET for live coverage of the Jan 6th Committee Hearing. \n\nLater we’ll be joined by @ilyamarritz and @NPRrelving for a recap and to answer audience questions. https://t.co/JlrFgDBLVj","date":"Thu Jun 23 18:16:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In a shocking moment, U.S. artistic swimmer Anita Alvarez began to sink to the bottom of the pool, unconscious, after finishing her routine.\n\nThat's when Team USA coach Andrea Fuentes jumped into action — diving in and quickly pulling her to the surface.\nhttps://t.co/W0o3hmkxvs","date":"Thu Jun 23 18:11:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: Federal authorities searched the home of former DOJ official Jeffrey Clark on Wednesday, a person familiar with the activity said. He was seen as sympathetic to Trump's election fraud claims.\nhttps://t.co/kJ4CHhvwMF","date":"Thu Jun 23 18:06:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Kenny Butler and Daniel Duron worked toward their degrees while in prison. With Pell grants becoming available to incarcerated people, their journey could become more common. https://t.co/JIprIW3U6o","date":"Thu Jun 23 17:37:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The FDA has issued a marketing denial order to Juul, telling the company to remove its e-cigarettes from the U.S. marketplace — a decision that promises to shake up the vaping market. https://t.co/hJzQRq51db https://t.co/8jrZVKdn5c","date":"Thu Jun 23 16:58:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Jan 6. hearings have relied on subtle TV news techniques and choices to tell a story founded in facts — without caving to sensationalism. A former ABC News exec helped guide them.\nhttps://t.co/gB5LVYuc9B","date":"Thu Jun 23 16:16:21 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Previewing todays Jan 6th hearing with @BPC_Bipartisan https://t.co/COWRHn3q8x","date":"Thu Jun 23 15:58:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Trumpet the bloodhound has taken home the top prize at the Westminster Kennel Club Dog Show — the first of his breed to do so in the event's 145-year history.\n\nHere are a few things to know about the long-eared breed. https://t.co/DQzm17EF2m","date":"Thu Jun 23 15:36:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Join us today at 12pm ET for a @TwitterSpaces conversation previewing the 5th Jan 6 Committee Hearing with @BPC_Bipartisan.\n\n🎙@MilesParks \n🎙@mattiweil \n🎙@bcburden \n🎙@NMSOSMaggie \n🎙@cstewartiii https://t.co/COWRHn3q8x","date":"Thu Jun 23 15:15:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"BREAKING: The FDA has ordered Juul to remove its e-cigarettes from the U.S. market — a move that promises to shake up the vaping market.\nhttps://t.co/NHXre3nQRn","date":"Thu Jun 23 14:54:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"BREAKING: The Supreme Court's conservative majority strikes down a New York law that limits the right to carry concealed handguns.\nhttps://t.co/LfA1WlRo2X","date":"Thu Jun 23 14:42:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Abortion — and whether to get one — changed two sisters' lives in ways that affected them for years to come. https://t.co/296EXoVyk8","date":"Thu Jun 23 14:36:34 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Jeanette Taylor's viral tweet exposed the inefficiencies in Chicago's public housing. Now an alderwoman for the city, she's pushing for change. https://t.co/D4dCqoaNiE","date":"Thu Jun 23 13:54:47 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In its fifth hearing, the Jan. 6 committee will outline former President Trump's pressure on Justice Department officials to overturn the 2020 election in his favor. https://t.co/eMAbW0szxr","date":"Thu Jun 23 13:11:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Members of other unions took advantage of the lull in the proceedings to shout out support for their comrades at Amazon, with cries of \"Teamsters in the house!\" \"UAW in the house!\" \"When we fight, we win!\" briefly taking over the Zoom call. https://t.co/C3A5OP29OW","date":"Thu Jun 23 12:27:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In his new book, \"An Immense World,\" science writer Ed Yong explores the diversity of perception in the animal world — including echolocation, magnetic fields and ultraviolet vision. https://t.co/SsVeAMZrPM","date":"Thu Jun 23 11:44:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The FDA is poised to set a maximum nicotine level in cigarettes and some other tobacco products, looking to make them less addictive. https://t.co/fNStwV8V5t","date":"Thu Jun 23 11:00:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"It can be hard to think about saving money when we're experiencing high inflation and rising interest rates. \n\n@NPRLifeKit has these expert tips to help. https://t.co/3p5uDNzEIE","date":"Thu Jun 23 10:42:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden's appointment of Marilynn Malerba would make her the first Native American to serve as U.S. treasurer — and the first Native woman to have her signature appear on American currency.\nhttps://t.co/wOTGBoZVUJ","date":"Thu Jun 23 10:00:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Republicans accuse the Biden administration of organizing \"secret\" migrant flights across the U.S. The routine flights for unaccompanied minors are required by law — and happened exactly the same under Trump.\nhttps://t.co/p9N8It0uSP","date":"Thu Jun 23 09:18:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In an interview with Morning Edition, rapper Logic explains the central message of his new album, Vinyl Days: \"I rap good! Let's just be honest here.\" https://t.co/LyjrK5LQwZ","date":"Thu Jun 23 09:13:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A new NPR survey finds 11% of Americans have experienced extreme heat in the past five years and had serious health problems stemming from a lack of air conditioning at home. https://t.co/JSV0zbyYoR","date":"Thu Jun 23 09:00:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"COVID reinfections were considered rare in 2020, but emerging variants have now made them increasingly likely.\n\nHere's what we know. https://t.co/ZeQPw5HsrY","date":"Thu Jun 23 06:19:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"All 41 theaters on Broadway will go \"mask optional\" beginning July 1, theater officials said. The policy will be re-evaluated on a monthly basis. (@Gothamist)\nhttps://t.co/THd5GcvBHA","date":"Thu Jun 23 06:19:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Registration has opened for Florida's annual python hunting challenge. The competition is not for the faint of heart. https://t.co/Vh22kGlV8T","date":"Thu Jun 23 05:28:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"With abortion access in jeopardy, advocates worry about a return to dangerous underground procedures.\n\nOne family matriarch died in one such procedure generations ago. Her family is still grieving. https://t.co/8aq0fQRukY","date":"Thu Jun 23 05:28:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Hit play and vibe all day. Roséwave is a lifestyle, not a genre, based around summer feels.\n\nTo kick things off, here's a seven-hour soundtrack for your getaway or staycation. https://t.co/AAz03n0Vze","date":"Thu Jun 23 05:19:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Figuring out how to best handle our finances takes a steep learning curve in the best of times. It can feel overwhelming to do so when we’re experiencing inflation, rising interest rates and predictions of a recession.\n\n@NPRLifeKit has these tips to help: https://t.co/6qWzQ1vQdY","date":"Thu Jun 23 03:00:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A former Georgia election worker testified at the Jan. 6 hearing about the violent threats she and her family received when Trump and Giuliani targeted them with false accusations, forcing her to go into hiding. \n\n\"It's turned my life upside down.\" https://t.co/3m27KoUKZU","date":"Thu Jun 23 02:16:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"👋🏼Welcome to your evening news digest.\n\nHere are NPR Newscast's top stories right now.\n\n🎧Listen here: https://t.co/TgNSJL9ocL https://t.co/HtOv0pbPti","date":"Thu Jun 23 02:05:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden wants Congress to give people a break on the federal gas tax this summer. Economists say that won't translate into big savings at the pump — and could hurt efforts to curb inflation. https://t.co/wilSo0oLck","date":"Thu Jun 23 01:45:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Scientists in Britain have detected multiple versions of the virus in wastewater. Officials say the risk to the public is extremely low and urge people to ensure their polio vaccines are up to date. https://t.co/NxgmX9myG3","date":"Thu Jun 23 01:15:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The National Labor Relations Board is asking a court to reinstate seven Starbucks workers who were allegedly fired illegally because they were involved in union organizing. https://t.co/IFTQp6ENNS","date":"Thu Jun 23 00:54:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The House Committee on Oversight and Reform found that Washington Commanders owner Daniel Snyder conducted a \"shadow investigation\" to detract from another internal probe into the football organization. https://t.co/GiU0r04IhM","date":"Thu Jun 23 00:09:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The genre-melding R&amp;B artist @ravynlenae brings a funky, futuristic set to the Tiny Desk. https://t.co/TvdoHCFXoh","date":"Wed Jun 22 23:52:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Join us tomorrow at 12pm ET for a @TwitterSpaces conversation previewing the 5th Jan 6 Committee Hearing with @BPC_Bipartisan. \n\n🎙@MilesParks \n🎙@mattiweil \n🎙@bcburden \n🎙@NMSOSMaggie \n🎙@cstewartiii https://t.co/COWRHn3q8x","date":"Wed Jun 22 23:25:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Smithsonian is one step closer to creating two new museums.\n\nThey have 4 possible locations for the National Museum of the American Latino and the Smithsonian American Women's History Museum.\nhttps://t.co/DIiFNbVXtx","date":"Wed Jun 22 23:22:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Even students who spent the least amount of time learning remotely during the 2020-21 school year — just a month or less — missed the equivalent of 7 to 10 weeks of math learning, an education researcher says.\nhttps://t.co/xcK1CsVCfI","date":"Wed Jun 22 23:14:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"As Wednesday draws to a close in Kyiv and in Moscow, here are the key developments of the day: https://t.co/ijkUTWFrnH https://t.co/yZINLmOmoB","date":"Wed Jun 22 23:00:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Frank DeAngelis was principal at Columbine High School in Colorado when 12 students and a teacher were killed there. He helps lead a group that offers aid and a sounding board after each fresh attack. https://t.co/6zJpFl7U1R","date":"Wed Jun 22 22:30:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We spoke to an immunization expert about some of the challenges involved in quickly getting shots out to millions of young kids. https://t.co/3fIunm60nE","date":"Wed Jun 22 22:00:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"COVID reinfections were considered rare in 2020, but emerging variants have now made them increasingly likely.\n\nHere's what we know. https://t.co/F2oqVFK86l","date":"Wed Jun 22 21:15:49 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"All 41 theaters on Broadway will go \"mask optional\" beginning July 1, theater officials said. The policy will be re-evaluated on a monthly basis. (@Gothamist)\nhttps://t.co/yxFe1wsygj","date":"Wed Jun 22 20:35:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden's appointment of Marilynn Malerba would make her the first Native American to serve as U.S. treasurer — and the first Native woman to have her signature appear on American currency.\nhttps://t.co/oNpmmtaALn","date":"Wed Jun 22 19:58:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Fed is committed to regaining control over inflation, chairman Jerome Powell said, even as he acknowledged the central bank has little power to address its most visible symptoms at the gas pump or supermarket.\nhttps://t.co/M6CwSHxSb1","date":"Wed Jun 22 19:11:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The FDA is poised to set a maximum nicotine level in cigarettes and some other tobacco products, looking to make them less addictive. https://t.co/0YioP1IysF","date":"Wed Jun 22 18:49:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Jan. 6 panel is extending its public hearings into July. https://t.co/LcNiXAgbA7","date":"Wed Jun 22 18:20:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Andrew Gillum, Florida's former Democratic candidate for governor, now faces indictment on campaign fraud charges. https://t.co/xbnGx9J6ga","date":"Wed Jun 22 18:06:51 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Republicans accuse the Biden administration of organizing \"secret\" migrant flights across the U.S. The routine flights for unaccompanied minors are required by law — and happened exactly the same under Trump.\nhttps://t.co/DmDvHDJWKd","date":"Wed Jun 22 17:23:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The world's largest recorded freshwater fish — a giant stingray measuring nearly 13 feet and weighing just under 660 pounds — has been caught in the Mekong River in Cambodia, scientists reported. https://t.co/oEGrNtySey","date":"Wed Jun 22 16:36:34 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"South Dakota's attorney general — who investigators say was looking at articles on his phone about a minute before he hit and killed a pedestrian with his car — was impeached and barred from holding future office in the state. https://t.co/fespdjZdCe","date":"Wed Jun 22 15:56:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A new NPR survey finds 11% of Americans have experienced extreme heat in the past five years and had serious health problems stemming from a lack of air conditioning at home. https://t.co/vV4Tl0jjrs","date":"Wed Jun 22 15:11:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"There are 13 total decisions yet to be announced, and the court usually tries to wrap by the end of June.\n\nThe next opinion date is Thursday, but the court probably won't announce all of the remaining decisions that day.\n\nIt's likely that more cases will be decided next week. https://t.co/1vvBLUeTCQ","date":"Wed Jun 22 14:33:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚖️ 'Remain in Mexico'\n\nBiden v. Texas is the case over the so-called \"Remain in Mexico\" immigration policy, which was enacted by then-President Trump in 2019.\nhttps://t.co/0r417PoWBW","date":"Wed Jun 22 14:33:38 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚖️ Guns\n\nNew York State Rifle &amp; Pistol Association, Inc., v. Bruen is the court's biggest gun control case since 2008.\n\nNow, the court is considering whether states can regulate an individual's ability to carry a gun outside the home.\nhttps://t.co/ew68i3tFAy","date":"Wed Jun 22 14:33:38 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚖️ Environmental protection\n\nWest Virginia v. Environmental Protection Agency is about the federal government's ability to create environmental regulations.\n\nThe challengers are a group of 27 Republican attorneys general. https://t.co/QIVPy3Xr5D","date":"Wed Jun 22 14:33:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚖️ Abortion\n\nIn the nearly 50 years since Roe v. Wade found a constitutional right to abortion, conservatives have been working to overturn it.\n\nDobbs v. Jackson Women's Health Organization is their most serious chance yet.\nhttps://t.co/69KWNzeZnT","date":"Wed Jun 22 14:33:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"One of the biggest Supreme Court terms in recent memory still has a handful of major cases left on the docket — cases that could alter the political landscape.\n\nHere are the biggest remaining cases.\nhttps://t.co/2q7VhcvCIL","date":"Wed Jun 22 14:33:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Read the full transcript from the fourth Jan. 6 committee hearing 👇\nhttps://t.co/WUoTAbvvlz","date":"Wed Jun 22 14:28:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A racist sign about Juneteenth, displayed on the front of an insurance agency in Millinocket, Maine, has provoked outrage and disappointment on social media.\nhttps://t.co/E2mbkERP78","date":"Wed Jun 22 13:46:57 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A former Georgia election worker testified at the Jan. 6 hearing about the violent threats she and her family received when Trump and Giuliani targeted them with false accusations, forcing her to go into hiding. \n\n\"It's turned my life upside down.\" https://t.co/EnG8QO5gne","date":"Wed Jun 22 13:06:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden wants Congress to give people a break on the federal gas tax this summer. Economists say that won't translate into big savings at the pump — and could hurt efforts to curb inflation. https://t.co/IC5zPE3LTK","date":"Wed Jun 22 12:25:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"More than 920 people were killed and 600 others injured after a powerful 5.9 magnitude earthquake shook eastern Afghanistan overnight, causing cinder block homes to collapse over sleeping families.\nhttps://t.co/xx1IUFI8wc","date":"Wed Jun 22 12:04:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Daily Harvest, a food home delivery service, issued a recall on its lentil and leek crumbles dish after multiple customers reported nausea, vomiting and liver damage after consuming it. https://t.co/MeCGDN7Bkb","date":"Wed Jun 22 11:32:51 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Katie Britt has secured the GOP nomination for an Alabama U.S. Senate seat, ousting U.S. Rep. Mo Brooks in a runoff, according to a race call by The Associated Press. https://t.co/yh1TjnTXTJ","date":"Wed Jun 22 10:51:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Rep. Adam Schiff details how Trump and his campaign \"were directly involved in advancing and coordinating the plot to replace Biden electors with fake electors not chosen by the voters.\"  https://t.co/qHprboiuxJ","date":"Wed Jun 22 10:06:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Most Americans have recently been affected by extreme weather — and support efforts to protect against future disasters, a new survey finds.\n\nAnd many end up suffering long-term financial problems. https://t.co/aNlmpT3qN9","date":"Wed Jun 22 09:25:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Zola Jesus has spent years contemplating the spiritual quandaries of what it means to be an artist.\n\nOn her album 'Arkhon,' she grapples with political and economic structures of power and disconnection. https://t.co/CsI5G5Toc2","date":"Wed Jun 22 08:43:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The town of Orick sits just steps away from Redwood National Park. It has prime real estate for recreation and tourism.\n\nSo why is the town so distressed? Here's a quick history. https://t.co/TcTpwMFMTs","date":"Wed Jun 22 08:00:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"British documentarian Alex Holder has complied with a Jan. 6 panel subpoena for never-before-seen footage of then-President Trump in the leadup to the insurrection. https://t.co/ekUq5pM8AC","date":"Wed Jun 22 07:19:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Queen is back. https://t.co/AL52QTV9eS","date":"Wed Jun 22 06:36:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Patrice Lumumba was the first democratically elected prime minister of the Congo, and was assassinated in a Belgian-supported coup. Can the return of his remains help them reconcile over colonialism? https://t.co/8XXH64ODwE","date":"Wed Jun 22 05:53:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A fisherman caught a giant stingray that weighed 660 pounds and measured almost 13 feet from snout to tail in the Mekong River.\nhttps://t.co/TWxReUYxDQ","date":"Wed Jun 22 05:09:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A major study finds that the omicron variant is much less likely than delta to cause long COVID — but scientists are split on the finding. https://t.co/ZcYu2Y1NpB","date":"Wed Jun 22 04:24:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"One couple has made it their mission to document buildings and signs across the country.\n\nIn doing so, they busted a few myths — and maybe even their own misconceptions about modern rural America.\n https://t.co/pN9kkCO2jy","date":"Wed Jun 22 03:44:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Under a South Carolina law, practitioners can refuse care, such as family planning, that conflicts with their religious or moral beliefs. Critics say the law allows discrimination, especially against LGBTQ people. https://t.co/Ut0g7bk5cx","date":"Wed Jun 22 03:03:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The decentralized tech system used in cryptocurrency might not be working as well as crypto enthusiasts assume, a new analysis finds.\nhttps://t.co/LwZXowgleK","date":"Wed Jun 22 02:16:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A closely watched Democratic primary in South Texas has finally been decided.\n\nHenry Cuellar, a longtime congressman, has narrowly defeated progressive challenger Jessica Cisneros, according to a race call by The Associated Press.  https://t.co/xY4QO6ffAp","date":"Wed Jun 22 02:08:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"👋🏻Welcome to your evening news digest.\n\nHere are NPR Newscast's top stories right now.\n\n🎧Listen here: https://t.co/TgNSJL9ocL https://t.co/aA3LGAzj3W","date":"Wed Jun 22 02:03:47 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A viral image of a 7-Eleven charging $7.11 was taken in 2021 and doesn't reflect the current state of gas prices in the U.S. https://t.co/OKXh8OfzH0","date":"Wed Jun 22 01:42:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"At Thursday's hearing, Rep. Adam Schiff played clips from a recording of a Trump phone call with Georgia officals, pausing to ask them questions and fact-check the former president's false claims in real time. https://t.co/z8YOUKnUPm","date":"Wed Jun 22 01:30:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Allyson Felix is the most decorated U.S. track and field athlete in history. As she wraps up her last season, she's focusing on supporting other athlete moms.\nhttps://t.co/BqRAwGLC4w","date":"Wed Jun 22 01:09:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Yellowstone is working to fully reopen, but many visitors could be turned away at the gates in the meantime.\n\nHere are some other spots nearby that are worth your while.\nhttps://t.co/4K5S9BYfmA","date":"Wed Jun 22 00:57:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A bipartisan group of four lawmakers on Tuesday announced a bill that would extend the school meal waivers that have been a lifeline for schools and families during the pandemic. https://t.co/l81PTDEXTX","date":"Wed Jun 22 00:16:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Dartmouth says it will no longer offer loans in its financial aid packages for undergrads.\n\nThe school is also increasing the household income limit for full scholarships to $125,000. https://t.co/1mt5y2vWw9","date":"Tue Jun 21 23:41:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: Senators have finalized a bipartisan gun safety bill. It could be the first breakthrough on gun legislation in decades. https://t.co/wdEBWUHI4O","date":"Tue Jun 21 23:00:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Former President Donald Trump's team not only pressured GOP state officials to overturn the results of the 2020 presidential election he lost, but they knew there was no authority to do so. \n\nHere are 4 takeaways from today's Jan 6 hearing.  https://t.co/Spq3LczS8V","date":"Tue Jun 21 22:59:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Author Angela Garbes argues that the work of raising children has always been undervalued and under-compensated in the U.S.\n\nThen the pandemic came — and everything got even harder.\nhttps://t.co/kYOdaxIBHi","date":"Tue Jun 21 22:25:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In his new book, Pulitzer-winning journalist Ed Yong writes in a perfect balance of scientific rigor and personal awe — as he invites readers to grasp something of how other animals experience the world. https://t.co/UvJB4JpQCG","date":"Tue Jun 21 21:44:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"As Tuesday draws to a close in Kyiv and in Moscow, here are the key developments of the day: https://t.co/ozonT6w6lc https://t.co/bNVXAoMTVr","date":"Tue Jun 21 21:30:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here are the biggest Supreme Court decisions we're still waiting for this term — including major cases on abortion, climate law and gun control.\nhttps://t.co/GFr4wrc44E","date":"Tue Jun 21 21:02:27 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A Russian journalist has auctioned off his Nobel Peace Prize medal for a record $103.5 million to help Ukraine.\nhttps://t.co/jlT1JKWbYd","date":"Tue Jun 21 20:22:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Some of Stephen Colbert's production staff were detained while filming a puppet segment in a congressional building.\n\nHe says conservative media's response — spreading a false \"insurrection\" narrative about his team — was predictable.\nhttps://t.co/3lKaGtJUGN","date":"Tue Jun 21 20:02:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Now in @TwitterSpaces, @AndreaBNYC and @ilyamarritz talking about the Jan 6th hearings  https://t.co/jlNZ0QyZGg","date":"Tue Jun 21 19:47:56 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Arizona lawmaker Rusty Bowers says he and other GOP legislators pushed for Rudy Giuliani to provide sufficient evidence of fraud.\n\n“He said, 'We have lots of theories, we just don’t have the evidence,'\" Bowers said of Giuliani.\nhttps://t.co/v6kB1M31zf","date":"Tue Jun 21 19:43:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"British documentarian Alex Holder has complied with a Jan. 6 panel subpoena for never-before-seen footage of then-President Trump in the leadup to the insurrection. https://t.co/Kl37RwsYiM","date":"Tue Jun 21 19:07:20 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"“You are asking me to do something against my oath, and I will not break my oath.” - Arizona House Speaker Rusty Bowers, speaking about the pressures put on him by Former President Trump and his allies, including Rudy Giuliani. https://t.co/jlNZ0QyZGg","date":"Tue Jun 21 19:06:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"Namaste\" has a meaning among Hindi speakers. But in the U.S., the word has been wrangled out of its context and tossed around to mean whatever people want it to.\n\nThis #InternationalYogaDay, revisit a 2020 @NPRCodeSwitch episode. https://t.co/fxMtWIHsIj","date":"Tue Jun 21 18:52:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"Anyone who got in the way of Donald Trump’s continued hold on power after he lost the election was the subject of a dangerous and escalating campaign of pressure,\" Rep. Adam Schiff said in his opening statement. https://t.co/533NyaYpNY","date":"Tue Jun 21 18:49:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"House Jan. 6 committee vice chair Rep. Liz Cheney urged the Department of Justice to pay attention the evidence the committee is presenting.\n\n\"We cannot let America become a nation of conspiracy theories and thug violence,\" she said. https://t.co/WVJyzJUfzi","date":"Tue Jun 21 18:18:47 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Most Americans have recently been affected by extreme weather — and support efforts to protect against future disasters, a new survey finds.\n\nAnd many end up suffering long-term financial problems. https://t.co/09Pwxcb5qa","date":"Tue Jun 21 18:10:19 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Medical debt can ruin lives, and in many states patients have few financial protections.\n\nNow, North Carolina is considering a new law that could lead the way in shielding patients from high medical bills. https://t.co/exIqAE7MKr","date":"Tue Jun 21 17:21:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"LIVE: Jan 6th House Committee Hearing https://t.co/jlNZ0QyZGg","date":"Tue Jun 21 17:04:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"What is the future of Orick? Read more from @elliswonk in the @planetmoney newsletter. https://t.co/W5OkyRaETK","date":"Tue Jun 21 16:57:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Lawmakers and environmental groups sold tourism as the gleaming plug to fill Orick's economic hole.\n\nBut it hasn't been enough.\n\nLocals have long blamed management of the national park for failing to deliver on the promise of tourism. https://t.co/9Rfx5EKFN6","date":"Tue Jun 21 16:57:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The @NatlParkService estimates that, in 2019, Redwood National Park contributed about $32 million to the regional economy.\n\nBut wherever this money is going, most of it is not going to Orick. The town has dwindled to a population of under 400 people — 26% of whom live in poverty.","date":"Tue Jun 21 16:57:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"The problem was when the national park took over, you could just start to see the demise of logging,\" Donna Hufford, a local Orick businesswoman who has lived in the town since 1970.\n\n\"And that was the people's lifeblood, and they were fighting for it.\" https://t.co/oVtCP77ivy","date":"Tue Jun 21 16:57:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In 1968, President Lyndon Johnson signed into law an act that created Redwood National Park, protecting 58,000 acres of the forest. \n\nIn 1978, President Carter expanded the Redwood National Park by 48,000 acres, nearly doubling its size. https://t.co/4YwNsFyjQ0","date":"Tue Jun 21 16:56:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"When environmentalists began a movement to create a new national park in the area to protect the ancient redwoods, the livelihoods of Orick's logging workers were threatened. https://t.co/HPg95GwkiR","date":"Tue Jun 21 16:56:57 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The town of Orick, California sits just steps away from Redwood National Park.\n\nIt has prime real estate for recreation and tourism, so why are its motels and restaurants shuttered and its residents impoverished? \n\nPlanet Money's @elliswonk explores. 🧵 https://t.co/2YCMCDUydd","date":"Tue Jun 21 16:56:56 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In the 1960s, Orick was a thriving lumber community.\n\nThe town boasted four sawmills, good union timber jobs, a highway bustling with cars and trucks, a slew of restaurants, bars, motels, and shops, and a population of almost 3000 people. https://t.co/2YCMCDUydd","date":"Tue Jun 21 16:56:56 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Voters in this Virginia swing district are testing whether Democrats can balance attention on the Jan. 6 hearings — while also convincing voters they're working on issues like rising prices. https://t.co/TPagUS5aEh","date":"Tue Jun 21 16:36:48 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Join us today at 1pm ET for live coverage of the Jan 6th House Committee Hearings. \n\nAfter today’s hearing we’ll be joined by @AndreaBNYC and @ilyamarritz https://t.co/jlNZ0QyZGg","date":"Tue Jun 21 15:55:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Police could have stopped the Uvalde school shooting in 3 minutes, says a top Texas law enforcement official.\n\nInstead, it took them about an hour and 14.\nhttps://t.co/iQKv6tbYX9","date":"Tue Jun 21 15:54:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A schoolteacher in Hawaii connected with a student through skateboarding, only to find out he couldn't afford a board of his own.\n\nShe started a grassroots organization to fix that.\nhttps://t.co/YkvUK80Ql6","date":"Tue Jun 21 15:42:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: The Supreme Court has ruled that states must use taxpayer money to pay for students to attend religious schools if they also use taxpayer funds to pay for attendance at nonreligious private schools. \nhttps://t.co/7PuR2rNOU5","date":"Tue Jun 21 15:01:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The summer solstice has arrived in the Northern Hemisphere, marking the longest day of the year and the first day of the new season.\n\nHundreds of people gathered near Stonehenge at sunrise to celebrate. https://t.co/mIIAkdfUrX","date":"Tue Jun 21 15:00:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A fisherman caught a giant stingray that weighed 660 pounds and measured almost 13 feet from snout to tail in the Mekong River.\nhttps://t.co/MjItK0AEgr","date":"Tue Jun 21 14:20:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"☀️ The summer solstice is here — marking the longest day of the year and the first day of the new season. https://t.co/oKWybmVz4D","date":"Tue Jun 21 13:38:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Today's Jan. 6 hearing is expected to focus on Trump's attempts to pressure state officials to overturn the 2020 election.\n\nHere's what to know. https://t.co/IeaHRRFdUh","date":"Tue Jun 21 13:22:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Queen is back. https://t.co/X7ru7kpKIH","date":"Tue Jun 21 12:41:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"I basically got second graders,\" one fourth-grade teacher said after witnessing how disruptive the pandemic has been to students' development. \"Academically, we're back to working miracles.\"\nhttps://t.co/KPe2FF66ui","date":"Tue Jun 21 12:00:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Over 100 million people in America are now affected by medical debt, as the U.S. health care system pushes patients into debt on a mass scale.\n\nHere are their stories — what they've given up for it, and how they're living with the burden.\nhttps://t.co/MNzvZoRwFh","date":"Tue Jun 21 11:21:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A major study finds that the omicron variant is much less likely than delta to cause long COVID — but scientists are split on the finding. https://t.co/ugpW0QSbmY","date":"Tue Jun 21 10:55:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"After a deadly school shooting, a group of Michigan students are suing their district to force policy changes ahead of the new academic year.\nhttps://t.co/oJL1qNrZoE","date":"Tue Jun 21 10:14:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Nearly 200 Hollywood producers, directors and writers — including Shonda Rhimes, Jimmy Kimmel and Mark Ruffalo — are pledging to revisit the use of guns in their storytelling.\n\nThey also say they'll incorporate gun safety best practices into their scripts.\nhttps://t.co/tENnXnPFqJ","date":"Tue Jun 21 09:31:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The French city of Grenoble approved wearing burkinis — full-body covering bathing suits — in public pools.\n\nBacklash came almost immediately.\nhttps://t.co/Zhy6SqYJuS","date":"Tue Jun 21 09:30:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Cryptocurrencies — including Bitcoin — are in steep decline. Here's what's happening. https://t.co/iR1We7SteY","date":"Tue Jun 21 09:08:44 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Russia has rebranded its former McDonald's locations as \"Vkusno I Tochka,\" which translates to \"Delicious, that's all.\"\n\nThe golden arches were replaced with orange backslashes.\nhttps://t.co/QCm4QBAZ0N","date":"Tue Jun 21 08:27:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Yellowstone will partially reopen on Wednesday after historic floods hit the park, washing away roads and damaging buildings.\nhttps://t.co/capNx3Y5pZ","date":"Tue Jun 21 07:44:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Many of the actors who star alongside Adam Sandler in the new basketball movie \"Hustle\" are real NBA athletes.\n\nDirector Jeremiah Zagar talked with NPR about the film — and bringing his hometown love for Philly to the big screen 👇\nhttps://t.co/sCylP5co83","date":"Tue Jun 21 07:00:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This series of photographs by Hamza Abdul-Mumit captures the beauty and tenderness of Black fatherhood.\nhttps://t.co/J7hXEptCYq","date":"Tue Jun 21 06:35:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Oakland has declared racism a public health crisis — and vowed to work on studies to advance racial equity.\nhttps://t.co/f692ss8gh6","date":"Tue Jun 21 05:54:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"40 years have passed since Vincent Chin was killed.\n\nBut today's wave of hate incidents against Asian Americans make what happened in 1982 even more relevant in the fight for civil rights.\nhttps://t.co/H4QutvlyHg","date":"Tue Jun 21 05:09:24 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We spoke to some of the hundreds of protesters who gathered in D.C. last week to take a stand against gun violence in America. \n\nHere's what they said.\nhttps://t.co/zPniYxhSx6","date":"Tue Jun 21 04:27:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The world governing body for swimming voted to effectively ban trans women from participating in women's swimming competitions.\nhttps://t.co/Rd0n58VX8Y","date":"Tue Jun 21 03:47:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A gallon of regular gas has fallen just under $5 in the U.S. for the first time since April.\nhttps://t.co/LbaUFBtvyV","date":"Tue Jun 21 03:00:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Something In The Water Festival had its first run in Washington, D.C. this year. Here are some of our favorite photos from the 3-day music. https://t.co/RqlfwkEaCx","date":"Tue Jun 21 02:30:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A thousand pages of correspondence by Oscar Hammerstein II, the lyricist for such musicals as Show Boat, Oklahoma!, Carousel and The Sound of Music are available to a wide public for the first time. https://t.co/g9vzWkPHWQ","date":"Tue Jun 21 02:00:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Jeremy Allen White plays a wunderkind chef who returns to his family's restaurant after a tragedy. The Bear knows exactly what it's doing, and it does it well. https://t.co/06K6STilWZ","date":"Tue Jun 21 01:30:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Portugal’s ambitious 2021 Right to Disconnect law made a promise of work-life balance that appealed to just about everyone. \n\nIn @Roughly's new episode we confront ghosts, ghouls and bureaucrats to find out who this promise is really for. https://t.co/t8av82qwr3","date":"Tue Jun 21 01:00:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Our reporting on the the Russian invasion of Ukraine to climate change and beyond is possible because people like you contribute. Do your part with a donation to your NPR station today. https://t.co/eqGOQ9ttmz https://t.co/jURj1Sk81r","date":"Tue Jun 21 00:40:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Hong Kong's iconic Jumbo Floating Restaurant capsized in the South China Sea less than a week after it was towed away from the city. https://t.co/rbntVGfzlC","date":"Tue Jun 21 00:30:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"He's the first buyer of the electric Ford F-150. Here's what he had to say.\nhttps://t.co/jmz7PgFjYO","date":"Tue Jun 21 00:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Prime Minister Naftali Bennett says he will step down, bringing Israel to its fifth round of elections in just over three years. It comes as former leader Benjamin Netanyahu tries to return to power. https://t.co/C7oYfuuWLZ","date":"Mon Jun 20 23:30:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Workers at a Maryland Apple store voted to form a union. But forming a union is a lengthy process that labor experts say is heavily stacked against workers in favor of their employers. https://t.co/gqRMmqJgio","date":"Mon Jun 20 23:00:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"President Biden is the \"acting\" president because he didn't win legally; Texans should vote on seceding; the Voting Rights Act of 1965 should be repealed; any gun control is a rights violation: this is the world as seen by the Republican Party of Texas.\n\n https://t.co/g5fcmBKpud","date":"Mon Jun 20 22:33:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A Utah man has found himself in the middle of a controversy over a set of challenge coins he sold on eBay. \n\nThe coins depict the now-infamous, real-life incident of a Border Patrol agent on horseback chasing down Haitian migrants. https://t.co/83GbG7wcUa","date":"Mon Jun 20 22:00:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here's how to celebrate Juneteenth without misappropriating it — and how to support Black Americans year-round, according to Anna Gifty Opoku-Agyeman, editor of the Black Agenda.\nhttps://t.co/wITS7Iotw1","date":"Mon Jun 20 21:57:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A new ad from Eric Greitens, the controversial Republican running for Missouri's U.S. Senate seat, has left him accused of glorifying political violence. \n\n\"Today, we're going RINO hunting,\" said Greitens in the ad while holding a shotgun. https://t.co/v1Qvlmpz9f","date":"Mon Jun 20 21:16:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The contractors working on the roof of the Balsora Baptist Church took a lunch break, upon returning they found the building on fire.\n\nThe church was completely destroyed except for a lone cross in the sanctuary seen standing among the smoke and ruin.\n\nhttps://t.co/990azjMTd3","date":"Mon Jun 20 20:36:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The lunch law suspension expired this year, and French workers are going back to their daily ritual.\n\nNinety minutes, free-flowing conversation, perhaps a glass of wine (or two). The French lunch is back.\n\nListen to the full episode from @Roughly. https://t.co/tArP5hVMok","date":"Mon Jun 20 20:00:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A teacup and saucer. Mother's ruby earrings. Dozens of marbles.\n\nThese were some of the objects survivors of the Marshall Fire were able to find sifting through the ashes of their former homes.\nhttps://t.co/BR0vlw8IOJ","date":"Mon Jun 20 19:30:48 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Throughout this month, five planets — Mercury, Venus, Mars, Jupiter and Saturn — are sequentially aligned and visible at dawn.\n\nThat hasn't happened since 2004.\n https://t.co/dbyP2JCyW5","date":"Mon Jun 20 18:49:56 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Lana Cooper-Jones and Marla Cooper's dad taught them many lessons on family and community, but he also taught them the importance of celebrating Juneteenth — even when no one else in his community was acknowledging the holiday. @storycorps https://t.co/0JaK1Q00RC https://t.co/fcw7pikdkY","date":"Mon Jun 20 18:08:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"As conservative media ramp up attacks on queer and trans people, extremist groups like Patriot Front and Proud Boys have used the moment to target LGBTQ community events.\nhttps://t.co/HEDON8qMSw","date":"Mon Jun 20 18:04:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"GOP Rep. Elise Stefanik's defense of Trump after Jan. 6 — and her repeated conspiracies about the 2020 election — have roiled a pro-democracy group where she's a board member.\n\nNow, some staff are demanding her removal.\nhttps://t.co/a2mNKaMs9e","date":"Mon Jun 20 17:22:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"With Juneteenth now recognized as a federal holiday, the city of Galveston, Texas — where the day traces its roots — hopes it will become a must-visit site for American history.\nhttps://t.co/qwEDSBJDEj","date":"Mon Jun 20 16:41:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A gallon of regular gas has fallen just under $5 in the U.S. for the first time since April.\nhttps://t.co/IcEJ9KSGit","date":"Mon Jun 20 15:57:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ford and other legacy automakers are investing billions of dollars in developing electric vehicles to catch up with Tesla.\n\nHere's what the first buyer thought of his electric Ford F-150.\nhttps://t.co/vXjy3lSg9c","date":"Mon Jun 20 15:16:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here are 4 common myths about the origins and history of Juneteenth — and what really happened.\nhttps://t.co/DmUBc5eQQg","date":"Mon Jun 20 14:32:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The world governing body for swimming voted to effectively ban trans women from participating in women's swimming competitions.\nhttps://t.co/O4DaGdVzWV","date":"Mon Jun 20 13:50:22 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Oakland has declared racism a public health crisis — and vowed to work on studies to advance racial equity.\nhttps://t.co/OxHTcFpmFe","date":"Mon Jun 20 11:40:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Many of the actors who star alongside Adam Sandler in the new basketball movie \"Hustle\" are real NBA athletes.\n\nDirector Jeremiah Zagar talked with NPR about the film — and bringing his hometown love for Philly to the big screen 👇\nhttps://t.co/z7j8tg5hh4","date":"Mon Jun 20 10:59:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Russia has rebranded its former McDonald's locations as \"Vkusno I Tochka,\" which translates to \"Delicious, that's all.\"\n\nThe golden arches were replaced with orange backslashes.\nhttps://t.co/3ePl6IBOKo","date":"Mon Jun 20 10:18:45 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"@nprbooks asked state poets laureate, librarians and bookstore owners to recommend books they love about their states — here’s what they said. https://t.co/mnapszuhHb","date":"Mon Jun 20 08:17:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Nearly 200 Hollywood producers, directors and writers — including Shonda Rhimes, Jimmy Kimmel and Mark Ruffalo — are pledging to revisit the use of guns in their storytelling.\n\nThey also say they'll incorporate gun safety best practices into their scripts.\nhttps://t.co/CS4Jnae0Ua","date":"Mon Jun 20 07:37:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"I basically got second graders,\" one fourth-grade teacher said after witnessing how disruptive the pandemic has been to students' development. \"Academically, we're back to working miracles.\"\nhttps://t.co/iM0qvMQ0uT","date":"Mon Jun 20 02:30:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In her new film, Emma Thompson portrays a widow who reckons with her own sexual discovery in an experience she calls \"irresistibly delicious.\"\nhttps://t.co/BdG6b51JOb","date":"Mon Jun 20 01:46:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We spoke to some of the hundreds of protesters who gathered in D.C. last week to take a stand against gun violence in America. \n\nHere's what they said.\nhttps://t.co/SsWKyHcsaA","date":"Mon Jun 20 01:02:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The French city of Grenoble approved wearing burkinis — full-body covering bathing suits — in public pools.\n\nBacklash came almost immediately.\nhttps://t.co/PRLCLllAf8","date":"Mon Jun 20 00:17:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This series of photographs by Hamza Abdul-Mumit captures the beauty and tenderness of Black fatherhood.\nhttps://t.co/2FW1vcPB15","date":"Sun Jun 19 23:33:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"After a deadly school shooting, a group of Michigan students are suing their district to force policy changes ahead of the new academic year.\nhttps://t.co/fUXyHruvSq","date":"Sun Jun 19 22:47:17 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Film director Paul Haggis is being detained in Italy on charges of sexual assault and aggravated personal injury.\nhttps://t.co/GHY0aBO5Ws","date":"Sun Jun 19 22:03:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In roughly half of the country, Juneteenth still isn't an official day off.\nhttps://t.co/E0CpHUj3JV","date":"Sun Jun 19 21:25:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Yellowstone will partially reopen on Wednesday after historic floods hit the park, washing away roads and damaging buildings.\nhttps://t.co/t1o8Dh2Xdt","date":"Sun Jun 19 21:12:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":".@NPRCodeSwitch spoke with chef Nicole A. Taylor about the history of Juneteenth, the intersection of food and Black celebration and her favorite recipe to mark the holiday.\nhttps://t.co/5S20UD6IEO","date":"Sun Jun 19 20:30:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Over 100 million people in America are now affected by medical debt, as the U.S. health care system pushes patients into debt on a mass scale.\n\nHere are their stories — what they've given up for it, and how they're living with the burden.\nhttps://t.co/cLuQN3i1ya","date":"Sun Jun 19 19:45:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Retired federal judge J. Michael Luttig says the U.S. is in a war over its democracy.\n\nHe says \"only the party that instigated this war can end it\" — calling on the Republican Party to start reconciliation.\nhttps://t.co/3pmustOzUm","date":"Sun Jun 19 19:02:25 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"For one NPR correspondent's dad, this spanakopita recipe traveled over generations from Greece to Egypt and back again.\n\nIt will never mean the same thing to the people who randomly find it online — but it will still be delicious.\nhttps://t.co/89Kghs7QF6","date":"Sun Jun 19 18:17:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Fatherhood comes in many different forms.\n\nTo celebrate Father's Day, we spoke with 3 single gay dads about their families, surrogacy, and their journeys to parenthood.\nhttps://t.co/jGdmA9oSfE","date":"Sun Jun 19 18:08:41 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The French city of Grenoble approved wearing burkinis — full-body covering bathing suits — in public pools.\n\nBacklash came almost immediately.\nhttps://t.co/4ZeOZJlZdQ","date":"Sun Jun 19 17:28:21 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"For many dads, the last two years of the pandemic have brought new perspectives on fatherhood. \n\nHere's what a few had to say.\nhttps://t.co/KavwqcQWZY","date":"Sun Jun 19 16:42:19 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"40 years have passed since Vincent Chin was killed.\n\nBut today's wave of hate incidents against Asian Americans make what happened in 1982 even more relevant in the fight for civil rights.\nhttps://t.co/3X43y9l4FR","date":"Sun Jun 19 16:00:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"To mark Juneteenth, there will be colorful parades, coast-to-coast music festivals, visits to historical sites, local gatherings, team sports, and plenty of barbecue.\n\nBut many will also start the day with a long-standing tradition: worship.\nhttps://t.co/2RNgOxzJi4","date":"Sun Jun 19 15:16:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Thousands of demonstrators gathered for the Poor People's Campaign in D.C. on Saturday.\n\nThey rallied around a range of issues — including an end to poverty, voter suppression, systemic racism and environmental damage.\nhttps://t.co/moxD7Y8BRA","date":"Sun Jun 19 14:46:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Growing up, Amanda Gorman's family would mark Juneteenth by going to an African American history museum or celebrating and reflecting with her church and community.\n\nTo mark the holiday this year, she reads her poem \"Fury and Faith.\" https://t.co/miYRoflmDh","date":"Sun Jun 19 13:45:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Here's what's open and closed on Juneteenth. https://t.co/ZAKUAyNLVH","date":"Sun Jun 19 11:45:18 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"I basically got second graders,\" one fourth-grade teacher said after witnessing how disruptive the pandemic has been to students' development. \"Academically, we're back to working miracles.\"\nhttps://t.co/yQVVH8nrSd","date":"Sun Jun 19 05:30:25 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Federal Reserve's hike of interest rates by 0.75% aims to tamp down rising inflation. Here’s what that actually means for everyday Americans. https://t.co/BtfJKL0hJw","date":"Sun Jun 19 03:48:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Cryptocurrencies — including Bitcoin — are in steep decline. Here's what's happening. https://t.co/dPxGSlM3jb","date":"Sun Jun 19 01:47:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"It's said that the best medicine for what ails democracy is more democracy. But what does more democracy mean? \n\nIf it just means more of the kind of politics we have now then it hardly offers a remedy, NPR's Ron Elving writes.\nhttps://t.co/vGA9qMiVPq","date":"Sun Jun 19 01:00:24 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A major study finds that the omicron variant is much less likely than delta to cause long COVID — but scientists are split on the finding. https://t.co/Qh8zR7pBKm","date":"Sun Jun 19 00:18:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This series of photographs by Hamza Abdul-Mumit captures the beauty and tenderness of Black fatherhood.\nhttps://t.co/badWEagJ8u","date":"Sat Jun 18 23:33:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In 1968, a caravan of mule-driven wagons left Mississippi for D.C.\n\nIt was part of Martin Luther King Jr.'s last major effort to mobilize impoverished Americans of different races.\n\n\"We're coming to Washington in a 'Poor People's Campaign,'\" he said.\nhttps://t.co/AaObSYWVaC","date":"Sat Jun 18 22:53:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The National Museum of the American Latino likely won't be finished for another decade, but a pop-up exhibit from the museum has opened on the National Mall in Washington, D.C.\nhttps://t.co/DfE5hJ8gdP","date":"Sat Jun 18 22:08:51 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Una recién graduada comparte la historia de cómo la violencia con armas de fuego en las escuelas, la motiva a involucrarse políticamente. (@TPRNews)\nhttps://t.co/K2mbZS6ERv","date":"Sat Jun 18 21:25:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"The teachers are just feeling overwhelmed, and they're breaking down underneath it,\" one teacher-coach in Iowa said. \"I find people crying in the bathroom.\"\nhttps://t.co/3MQmkBnpYm","date":"Sat Jun 18 20:40:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: The CDC has cleared COVID vaccines for kids under 5, paving the way for the shots to be available as early as next week.\nhttps://t.co/zJJCOZgd9L","date":"Sat Jun 18 19:59:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":".@NPRCodeSwitch spoke with chef Nicole A. Taylor about the history of Juneteenth, the intersection of food and Black celebration and her favorite recipe to mark the holiday.\nhttps://t.co/cqJLa9yAW3","date":"Sat Jun 18 19:50:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We spoke to some of the hundreds of protesters who gathered in D.C. last week to take a stand against gun violence in America. \n\nHere's what they said.\nhttps://t.co/qjTL2iHt7s","date":"Sat Jun 18 19:03:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In her new film, Emma Thompson portrays a widow who reckons with her own sexual discovery in an experience she calls \"irresistibly delicious.\"\nhttps://t.co/3Uzq83N2tX","date":"Sat Jun 18 18:18:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Primaries have become dominated by ideological partisans who please agenda-driven elements in their party. Ranked-choice voting may be an antidote — with Alaska's special election as an example.\nhttps://t.co/XKqiV0qu9v","date":"Sat Jun 18 17:37:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Lizzo's new song sparked heated discussions about ableist language. \n\nBut Black disabled people felt overlooked as they called out double standards and pointed to the need for cultural nuance.\nhttps://t.co/fBTYQLohx0","date":"Sat Jun 18 16:49:22 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The witty PBS News commentator Mark Shields, who provided expansive insights into the administrations of six U.S. presidents during his 33-year tenure, has died at the age of 85.\nhttps://t.co/S0O7cah3dk","date":"Sat Jun 18 16:02:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Uvalde officials are using the legal \"dead suspect\" loophole to prevent the release of police records related to last month's mass shooting, according to a letter obtained by NPR, as calls for transparency grow.\nhttps://t.co/2uhKhd2bgj","date":"Sat Jun 18 15:02:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Gambling on sports has become a billion-dollar industry in the U.S. But critics warn that the torrent of ads — and limited regulation — could pose risks for problem gamblers and young people.\nhttps://t.co/PToTmOlJ5q","date":"Sat Jun 18 14:05:40 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Limits with @realjaywilliams is back with former @nba star Al Harrington @violajefe. Al talks about the multibillion dollar cannabis opportunity, battling marijuana stigmas, and why Black ownership in the industry is so important.  https://t.co/B3wIYHINMW","date":"Sat Jun 18 12:04:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Just months ago, crypto companies were advertising heavily during the Super Bowl after virtual currencies enjoyed a dizzying rally in 2021.\n\nNow, cryptocurrencies including Bitcoin, are in steep decline today. Here's what's happening. https://t.co/Preem7Vzsa","date":"Sat Jun 18 07:00:20 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In Alaska, at least one child was taken to a hospital after a dozen students were served floor sealant during breakfast on Tuesday instead of milk. An investigation into the incident has been launched with the help of local authorities.\n\nhttps://t.co/28fAdSQlki","date":"Sat Jun 18 06:14:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"NPR's Pop Culture Happy Hour asked listeners to vote on their favorite American Idol contestants of all time. Here are the top 15. https://t.co/BuqNeB3tHc","date":"Sat Jun 18 04:54:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Companies and brands are facing backlash for their efforts to sell Juneteenth themed products, from ice cream to Juneteenth paper plates or watermelon salads. \n\nJuneteenth-branded products, according to experts, are only profiting off Black suffering. https://t.co/azFALNizBL","date":"Sat Jun 18 04:10:27 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"My one wish is that people who try the recipe enjoy the process of brushing the butter onto the dough, of folding the phyllo up and over itself again and again,\" @anastasiat writes of her father's spanakopita recipe. https://t.co/0eBNLjSx8L","date":"Sat Jun 18 02:42:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The former president's campaign to get his vice president to overturn the election \"was not just wrong,\" said Jan. 6 committee Vice Chair Liz Cheney, \"it was illegal and unconstitutional.\" https://t.co/0ZGI2Ruwgy","date":"Sat Jun 18 02:00:23 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Shermain Baptiste lives in Queens, with her son, Elais. When it came time to send Elais to middle school, Shermain knew she wanted the best for him. \nWe learn more about being a Southside parent in District 28 on a new episode of School Colors. https://t.co/X9Wtzb0LYX https://t.co/YAmf7N94K2","date":"Sat Jun 18 01:15:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"Violence and injustice against environmental defenders and journalists are distressingly common in the Brazilian Amazon,\" writes @robmuggah. \"Dom and Bruno are not the first victims to gain global attention.\" https://t.co/nEZ4wtIWwG","date":"Sat Jun 18 01:12:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"We bring you first-hand accounts and on-the-ground perspective of the day’s most important events. Take a moment and support the reporting you depend on by donating to your NPR station now. https://t.co/8SZrBNxEqp https://t.co/XnNG2fHmhz","date":"Sat Jun 18 00:49:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Georgetown University owes its survival to slavery. A new album by Carlos Simon, an assistant professor at the school, unflinchingly confronts that legacy. https://t.co/4GfGluZ9Pa","date":"Sat Jun 18 00:02:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Two races that are supposed to be tune-up events for the Tour de France are instead raising worries about COVID-19's impact on cycling's biggest event, with dozens of riders forced to withdraw because of positive tests. https://t.co/lBOqhL9mqE","date":"Fri Jun 17 23:45:45 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.K. government announced a proposal to rework part of the Northern Ireland Protocol it made with the EU during Brexit in a move one European official called \"illegal.\" https://t.co/hfhWHxef6D","date":"Fri Jun 17 23:00:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"ICYMI: The Limits with @realjaywilliams is back with former @nba star Al Harrington @violajefe. Al talks about the multibillion dollar cannabis opportunity, battling marijuana stigmas, and why Black ownership in the industry is so important. Listen: https://t.co/NAxzeEAEQg","date":"Fri Jun 17 22:45:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The omicron variant is much less likely than delta to cause long COVID, new research finds. https://t.co/2ed5t5RV12","date":"Fri Jun 17 22:15:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Capitol building has more than 540 different rooms, dozens of which are named after distinguished lawmakers from throughout history. But none bore the names of women senators — until this week. https://t.co/W7jbACEZVU","date":"Fri Jun 17 22:00:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Bartees Strange has been the subject of glowing profiles and recognition from indie stars like Phoebe Bridgers and Courtney Barnett.\n\nFor his new album, Farm to Table, he explains that the subject of family has taken center stage.\n\nhttps://t.co/Vw3DnQMCYw","date":"Fri Jun 17 22:00:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Russian president blamed the U.S. for fostering crises in global relations, food security, inflation and trade. https://t.co/tT7FTGxOs8","date":"Fri Jun 17 21:30:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"WikiLeaks founder Julian Assange will face 18 federal counts when he's brought to a U.S. courthouse in Virginia. Here's where his case stands now. https://t.co/njpygQxldb","date":"Fri Jun 17 21:09:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"On the 10-year anniversary of the DACA program, recipients reflect on the opportunities it has given them, but also its limitations. https://t.co/Jm6UpKENxN","date":"Fri Jun 17 20:46:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This week, the CDC ended the COVID-19 testing rule for air passengers traveling to the U.S. from abroad. Should you still take a COVID test anyway? https://t.co/HJO4yhluLN","date":"Fri Jun 17 20:23:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"On Sunday, the U.S. commemorates Juneteenth.\n\n@LeilaFadel talks to @TheAmandaGorman, who reflects on the day and reads a poem. https://t.co/XotMPSD2t6","date":"Fri Jun 17 20:19:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Legislators and doctors in California want cannabis producers to warn consumers about health risks on packaging labels and in advertisements, like the requirements for cigarettes. https://t.co/PApt3z56HM","date":"Fri Jun 17 20:00:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ukraine faces a shortfall of weapons and troops while battling Russia's latest offensive, according to U.S. Gen. Mark Milley.\n\n\"The math problem is very difficult for the Ukrainians,\" said Milley.\n\nhttps://t.co/PQXDBOJwua","date":"Fri Jun 17 19:45:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"More than a decade ago, former Congresswoman Gabby Giffords was shot in the head. This week, she threw the first pitch at Fenway Park as part of its Gun Violence Awareness Day. https://t.co/qO0aGnni2x","date":"Fri Jun 17 19:07:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This WNBA season will be the final one for Sue Bird. https://t.co/2oxyQobdHl","date":"Fri Jun 17 18:40:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The company that makes Sriracha, Huy Fong Foods, wrote in an email to customers in late April that it will have to stop making the sauce for the next few months due to \"severe weather conditions affecting the quality of chili peppers.\" https://t.co/YzVg2YvCv6","date":"Fri Jun 17 18:00:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"After winning Eurovision, Ukrainian folk-rap group Kalush Orchestra was hoping Ukraine would host the 2023 international songwriting competition.\n\nDue to the war, a panel of experts said it was not a viable option.  https://t.co/7egnsNXHPK","date":"Fri Jun 17 17:30:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Despite support for student loan forgiveness, a recent poll found that Americans would rather rein in college costs.  https://t.co/Vf49Et7qZP","date":"Fri Jun 17 16:58:21 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"There's a line in Ms. Marvel where the father quotes the Quran and tells the titular heroine Kamala, \"If you save one life, you save the world.\"  In this moment, the show reveals a different depiction of Muslims and South Asians than previously seen on TV. https://t.co/oRg4eLvd0p","date":"Fri Jun 17 16:11:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Golden State Warriors clinched the team's fourth NBA title in eight years Thursday night, decisively defeating the Boston Celtics on the road, 103-90, to win the seven-game championship series, 4-2. It was the franchise's seventh overall title. https://t.co/So3EvryhCt","date":"Fri Jun 17 15:29:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In his new memoir, Randy Rainbow opens up about his experiences with sexual assault — something that's seldom talked about in the gay community, he says. \n\nThough reluctant to tell the story, he’s happy he did because of the support he’s received. https://t.co/V9cmefXJRS","date":"Fri Jun 17 15:25:52 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Thursday's Jan 6th House Committee hearing revealed more detail about John Eastman's efforts to push bogus legal arguments — even after the attack on the Capitol. https://t.co/8MI2SU9dCP","date":"Fri Jun 17 15:25:50 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"World Wrestling Entertainment CEO Vince McMahon is stepping aside away from the business side of the wrestling company while an investigation is conducted into an alleged hush-money payment to cover up sexual misconduct.  https://t.co/dycHWmjTKU","date":"Fri Jun 17 14:39:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Wendy Williams Show will air its final episode after nearly 14 years filled with hundreds of notable guests, accolades and numerous controversies.\n\nWilliams will not be present for the episode, instead a video montage celebrating her TV run will air. https://t.co/zBXpsb0GFu","date":"Fri Jun 17 13:58:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"It's these types of stories — these unsung heroes, especially ones that came after Jackie Robinson — that we're excited to be able to tell,\" said Gaines.\n\nhttps://t.co/424cb86AI2","date":"Fri Jun 17 13:17:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚾️ Curt Flood, one of the top center fielders of the 1960s, is also known for taking MLB to court.\n\nHe challenged the league's contracts that prevented players from choosing their own teams. While he lost his case, his fight led the league to establish free agency. https://t.co/cRiExxBljh","date":"Fri Jun 17 13:17:36 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚾️ Bob Gibson was one of the most dominant pitchers in the major leagues during his prime.\n\nGibson's game was so dominant that Major League Baseball lowered the pitching mound from 15 inches down to 10 inches to give hitters more of a chance. https://t.co/OMhugWDC4O","date":"Fri Jun 17 13:17:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"⚾️ Bill White, first baseman, later became the first Black play-by-play announcer to regularly call games for a major league team.\n\nHe was elected to become the president of the National League in 1989, another first for a Black player. https://t.co/ryhh4J9oEe","date":"Fri Jun 17 13:17:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"\"What we see in Jackie Robinson is a player first, and then he becomes an activist in his retirement,\" said Andre Gaines, director of \"After Jackie.\"\n\n\"With Bill, Bob and Curt, it's the sort of first wave in our nation's history of the player-activist.\"\nhttps://t.co/20rHmwdSMT","date":"Fri Jun 17 13:17:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A new documentary on @HISTORY focuses on three more legends that followed, all with the World Series-winning St. Louis Cardinals of the 1960's:\n\n⚾️ Bill White\n⚾️ Bob Gibson\n⚾️ Curt Flood https://t.co/xsiMumcVrX","date":"Fri Jun 17 13:17:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"It's often said that Jackie Robinson opened the door for Black baseball players to enter the majors.\n\nBut that was just the first door. A lot of doors still stood between Black players and equality. https://t.co/5odHFvLrDH","date":"Fri Jun 17 13:17:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Just months ago, crypto companies were advertising heavily during the Super Bowl after virtual currencies enjoyed a dizzying rally in 2021.\n\nNow, cryptocurrencies including Bitcoin, are in steep decline today. Here's what's happening. https://t.co/ay74oeoCN0","date":"Fri Jun 17 13:14:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Companies and brands are facing backlash for their efforts to sell Juneteenth themed products, from ice cream to Juneteenth paper plates or watermelon salads. \n\nJuneteenth-branded products, according to experts, are only profiting off Black suffering. https://t.co/hpeVR7bQJ3","date":"Fri Jun 17 12:17:53 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The nation's largest labor federation made history when Elizabeth Shuler became the first woman ever elected president of the AFL-CIO.\n\nNow, she's focusing on the goal of adding 1 million new union members. https://t.co/EMR0oVnbSm","date":"Fri Jun 17 11:28:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Intense heat that baked Kansas over the weekend is being blamed for killing thousands of cattle — a toll documented in striking images on social media. https://t.co/qb8UQPoz8B","date":"Fri Jun 17 10:39:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ukraine faces a shortfall of weapons and troops while battling Russia's latest offensive, according to U.S. Gen. Mark Milley.\n\n\"The math problem is very difficult for the Ukrainians,\" said Milley.\n\nhttps://t.co/638mB537L7","date":"Fri Jun 17 09:31:48 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Republican legislators in Florida, Arizona, Texas and other states are trying to crack down on drag shows, with proposals to ban minors from drag shows. https://t.co/5lokzIzYMs","date":"Fri Jun 17 07:31:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"American democracy is more vulnerable today than it was on January 6 because the \"big lie\" that Donald Trump won the 2020 election has spread, says Rep. Adam Schiff. https://t.co/4RPOyCMf2g","date":"Fri Jun 17 06:40:15 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Justice Department has asked the lead investigator for the House Jan. 6 select committee for speedy access to transcripts of witness interviews. It says the lack of sharing is complicating its criminal probe.\nhttps://t.co/V8dD1Pu0XW","date":"Fri Jun 17 05:38:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The omicron variant is much less likely than delta to cause long COVID, new research finds. https://t.co/o3j2ZiOt1r","date":"Fri Jun 17 04:08:13 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"On Thursday, the Jan 6. committee laid out how Trump and a lawyer advising him pressured Pence even after Trump was aware there was a riot. \n\nHere are the key takeaways from the third hearing: https://t.co/yYonMeTd98","date":"Fri Jun 17 03:25:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"NPR's Pop Culture Happy Hour asked listeners to vote on their favorite American Idol contestants of all time. Here are the top 15. https://t.co/LjeuzATMKf","date":"Fri Jun 17 02:51:47 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"👋🏽Welcome to your evening news digest.\n\nHere are NPR Newscast's top stories right now.\n\n🎧Listen here: https://t.co/TgNSJL9ocL https://t.co/K39vP1Visz","date":"Fri Jun 17 02:07:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Can artificial intelligence come alive? Engineer Blake Lemoine seems to think so. https://t.co/uSq5WvSiRq","date":"Fri Jun 17 01:24:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Retired federal judge J. Michael Luttig was questioned by one of his former law clerks about the role of another in the insurrection. He has spoken out against former clerks John Eastman and Ted Cruz. https://t.co/8cXujbz3YQ","date":"Fri Jun 17 00:43:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In Alaska, at least one child was taken to a hospital after a dozen students were served floor sealant during breakfast on Tuesday instead of milk. An investigation into the incident has been launched with the help of local authorities.\n\nhttps://t.co/3oYBpSu7nP","date":"Thu Jun 16 23:55:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"This WNBA season will be the final one for Sue Bird. https://t.co/9Xzer4ssoX","date":"Thu Jun 16 23:33:19 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Elon Musk addressed Twitter employees for the first time since striking a deal to buy the social network for $44 billion. https://t.co/iTu3T8NuBq","date":"Thu Jun 16 22:52:51 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A day after the Federal Reserve announced its largest rate hike in decades, the Dow Jones Industrial Average sank more than 700 points. https://t.co/yk9DxoDCaW","date":"Thu Jun 16 22:09:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The announced host cities for 2026 include:\n- Vancouver\n- Seattle\n- San Francisco\n- Guadalajara, Mexico\n- Kansas City\n- Boston\n- Philadelphia\n- Miami\n⚽️ See the full list: https://t.co/yUE8LFuGM5","date":"Thu Jun 16 21:55:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Senate has approved a proposal that would allow borrowers stuck with student loan debt linked to a spouse or ex-spouse to separate those loans. https://t.co/aFQ4wqIbLL","date":"Thu Jun 16 21:28:35 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The House select committee revealed on Thursday that Jan. 6 rioters came within 40 feet of former Vice President Mike Pence during the Capitol insurrection as Pence was being escorted to a safer location.\n\nhttps://t.co/bacD9A3YCz https://t.co/FjjFKrjVCF","date":"Thu Jun 16 20:41:43 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The NACDL published a report last August warning the public that, without the legal protections under Roe v. Wade, thousands of abortion laws could lead to a new chapter of mass incarceration. @Laur_npr reports on this latest story. \n\nhttps://t.co/2QiJx2AE25","date":"Thu Jun 16 20:40:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Four summers from now, 48 countries will vie for the 2026 World Cup. The lucky host cities will be announced today. https://t.co/BqfIioI838","date":"Thu Jun 16 20:17:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Following the Jan. 6 riot at the U.S. Capitol, attorney John Eastman emailed Trump's personal lawyer Rudy Giuliani seeking a preemptive presidential pardon for his role in what occurred. https://t.co/rz8265qgsu https://t.co/7MP5lehQI2","date":"Thu Jun 16 20:03:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Now talking todays Jan 6th live hearing with @ilyamarritzand @TomDreisbach https://t.co/UuEbBXzQWO","date":"Thu Jun 16 19:50:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A respected conservative judge, J. Michael Luttig, is now a critic of his party — and former clerks https://t.co/WDFe700bTD https://t.co/hwjWelTJiY","date":"Thu Jun 16 19:23:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Trump ally John Eastman himself knew his legal theory to overturn the election would be rejected by the Supreme Court, a witness says https://t.co/XSpzSy1TEO https://t.co/0x6W6Dfrlz","date":"Thu Jun 16 19:07:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Meet Huntah, a not-quite two-year-old black lab. She’s trained to detect COVID at places like Freetown Elementary School in Massachusetts.\n\nHer reward after she does her job? Lots of pets and loving from the students. https://t.co/LiJxWEvesn","date":"Thu Jun 16 19:07:25 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"White House Chief of Staff Meadows apparently agreed that Pence couldn't overturn the election, according to Marc Short https://t.co/IawqGhlBZw https://t.co/WRlvCby5da","date":"Thu Jun 16 18:59:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ginni Thomas said she looks forward to talking to Jan. 6 committee\nhttps://t.co/ccZ41iOGXB https://t.co/Zi7s0xQ6Hf","date":"Thu Jun 16 18:57:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Fed's goal with the interest rate hikes is bringing the inflation rate down to 2%, while keeping unemployment around 4%.\n\nIf they achieve that, inflation could go back to normal – alongside a healthy labor market with wages and balanced consumer demand.https://t.co/vCT4xmJAZt","date":"Thu Jun 16 18:51:30 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"While economists are starting to feel pessimistic about the odds of avoiding a recession, it's still possible.\n\nAmericans just have to be patient while things play out, they say. https://t.co/ee74E52T1w","date":"Thu Jun 16 18:51:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🏧 Got money in a savings account?\n\nWith the Fed's benchmark rate rising, interest rates are ticking up, too.\n\nSome banks are starting to offer interest rates on savings accounts of 1% or more. https://t.co/vCT4xmJAZt","date":"Thu Jun 16 18:51:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"📉 In the short term, we're all likely to feel the squeeze.\n\nA survey of economists published this week found that most expect a recession to begin next year.\n\nThat means the U.S. could see widespread layoffs – even as inflation is still high. https://t.co/vCT4xmJAZt","date":"Thu Jun 16 18:51:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🏠 Trying to buy a home?\n\nMortgage lenders move their rates up and down based in part on what they expect the Fed to do.\n\nToday, the average 30-year rate is well above 6%. Earlier this year, a 30-year fixed-rate mortgage could be had for around 3.25%. https://t.co/vCT4xmJAZt","date":"Thu Jun 16 18:51:27 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Interest rates are the Federal Reserve's main tool to combat inflation.\n\n💳 By raising interest rates, which makes things more expensive, the Fed is hoping to dampen Americans' willingness to spend money. https://t.co/UxRytTrJyG","date":"Thu Jun 16 18:51:27 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Federal Reserve has hiked its benchmark interest rate by 0.75%, the largest interest rate hike in 28 years.\n\nBut what does that actually mean for Americans? ⬇️\nhttps://t.co/vCT4xmJAZt","date":"Thu Jun 16 18:51:26 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The 12th Amendment outlines the electoral vote counting process, which was at the crux of Trump and his allies' scheme to overturn the 2020 election results. The amendment, ratified in 1804, also addresses how a president can be certified into office.\n\nhttps://t.co/UStNuvN5no https://t.co/5wgoZ3N9qB","date":"Thu Jun 16 18:45:45 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Abbott has stopped production of its infant formula at its Sturgis, Mich., plant less than two weeks after restarting due to severe thunderstorms that caused flooding inside the plant. https://t.co/nHKOkHincy","date":"Thu Jun 16 18:27:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Greg Jacob, former Vice President Pence's lawyer at the time, said in his testimony Thursday that he first had a conversation with Pence about the Jan. 6 certification process about a month prior, around Dec. 7, 2020.\n\nhttps://t.co/HTEoyVxkWZ https://t.co/C6pgwtsaX1","date":"Thu Jun 16 18:24:49 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Decades after the break-in at the Democratic National Committee headquarters in Washington, D.C., reporter Bob Woodward visits a National Portrait Gallery exhibition about the Watergate scandal. https://t.co/LT6Bn7ubz6","date":"Thu Jun 16 18:13:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. Consumer Product Safety Commission and Fisher-Price are urging parents not to let babies fall asleep in rockers, citing at least 13 reported deaths between 2009 and 2021. https://t.co/0hcOefihGA","date":"Thu Jun 16 18:04:37 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Rep. Bennie Thompson began his remarks during Thursday's Jan 6. hearing by referencing a video clip of the former vice president in February, describing how he did not have the power to overturn the results of the presidential election.\n\nhttps://t.co/by6ffP5s12 https://t.co/zKweLPDbsz","date":"Thu Jun 16 18:01:54 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"“What the President wanted the Vice President to do was not just wrong it was unconstitutional.” - Rep. Liz Cheney https://t.co/UuEbBXzj7g","date":"Thu Jun 16 17:53:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Committee leaders Bennie Thompson and Liz Cheney said the hearing today will reveal the details of a pressure campaign led by former President Donald Trump against his vice president. https://t.co/HsRJs6R65q https://t.co/dUCD7tVsrD","date":"Thu Jun 16 17:51:33 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: The leaders of the House Jan. 6 committee say they plan to invite Ginni Thomas, the wife of Supreme Court Justice Clarence Thomas, to speak to the committee. https://t.co/Wub7YGt1QR","date":"Thu Jun 16 17:24:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"LIVE coverage of the Jan 6th House Committee Hearing https://t.co/UuEbBXzj7g","date":"Thu Jun 16 17:02:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Cosmetics giant and makeup aisle staple Revlon has filed for bankruptcy. The international beauty company, which sells products in more than 150 countries, has struggled with heavy debt. https://t.co/uN6OzLyBH3","date":"Thu Jun 16 16:57:51 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Former Vice President Mike Pence will not take part in today's hearing despite being the focus of today's hearing.  \n\nGreg Jacob, an attorney, and J. Michael Luttig, a former federal judge who provided legal counsel to Pence will testify. https://t.co/Woz8xwvmzI https://t.co/q6FQrjxXLb","date":"Thu Jun 16 16:56:39 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Senate Judiciary Committee has deadlocked 11-11 along party lines on the nomination of Steve Dettelbach to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives. https://t.co/17hOIYaLZC","date":"Thu Jun 16 16:08:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. health system now produces debt on a mass scale, a new investigation shows. Patients face gut-wrenching sacrifices. \n\nA new invesigation from @KHNews and NPR. #DiagnosisDebt\n\nhttps://t.co/qbvZg4UYX4","date":"Thu Jun 16 16:01:49 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"America's debt crisis is driven by a simple reality: Half of U.S. adults don't have the cash to cover an unexpected $500 health care bill. As a result, many simply don't pay. The flood of unpaid bills has made medical debt the most common form of debt on consumer credit records.","date":"Thu Jun 16 15:45:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Read more of the investigation here:  #DiagnosisDebt\nhttps://t.co/cpx4XzMYJr","date":"Thu Jun 16 15:45:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The couple diligently saved money. And they had retiree health insurance through Con Edison. Sherrie's surgery was complicated, she spent months in the hospital, and her medical bills exceeded the $1 million cap on their health plan.","date":"Thu Jun 16 15:45:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"When Foy couldn't pay more than $775,000 she owed the University of Virginia Health System, the medical center sued, a once common practice that the university said it has reined in. The couple declared bankruptcy. https://t.co/qRrWPlRvlp","date":"Thu Jun 16 15:45:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Sherrie Foy, 63, and her husband, Michael, saw their carefully planned retirement upended when Foy's colon had to be removed.","date":"Thu Jun 16 15:45:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"For many Americans, debt from medical or dental care may be relatively low. About a third owe less than $1,000, the KFF poll found. Even small debts can take a toll.","date":"Thu Jun 16 15:45:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Edy Adams, a 31-year-old medical student, was pursued by debt collectors for years for a medical exam she received after she was sexually assaulted. \n\nPolice never found the perpetrator. Two years later, she started receiving calls from debt collectors, saying she owed $130.68. https://t.co/JATDWRYcNy","date":"Thu Jun 16 15:45:00 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The burden is forcing families to cut spending on food and other essentials. Millions are being driven from their homes or into bankruptcy, the poll found. https://t.co/VJFjjfXbh5","date":"Thu Jun 16 15:44:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Allyson Ward and her husband loaded up credit cards, borrowed from relatives, and delayed repaying student loans after the premature birth of their twins left them with $80,000 in debt. Ward, a nurse practitioner, took on extra nursing shifts, working days and nights. https://t.co/ISU1vAZFPM","date":"Thu Jun 16 15:44:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A KFF poll found that more than half of U.S. adults reported going into debt because of medical or dental bills in the past five years. A quarter of those with health care debt owe more than $5,000. One in 5 who have any amount of debt believe they will never pay it off. https://t.co/thE10sB6BV","date":"Thu Jun 16 15:44:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"To calculate the true extent and burden of this debt, the KHN-NPR investigation draws on a nationwide poll conducted by KFF for this project. The survey aimed to capture not just bills patients couldn't pay, but other borrowing used to pay for health care as well.  #DiagnosisDebt https://t.co/zTwURHFCdV","date":"Thu Jun 16 15:44:58 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🧵 More than 100 million Americans, including 41% of adults, are plagued by a health care system that drives people into debt to pay for their care.\n\nAn investigation by @KHNews and NPR shows the problem is far more pervasive than previously reported. \nhttps://t.co/cpx4XzMYJr","date":"Thu Jun 16 15:44:57 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Federal Reserve has hiked its benchmark interest rate by 0.75%.\n\nBut what does that actually mean for hundreds of millions of Americans – Americans who have jobs, who buy things, who have bank accounts? https://t.co/jt5SE5erab","date":"Thu Jun 16 15:30:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Join us today at 1pm ET as we share live coverage of the Jan 6th House Committee Hearing on @TwitterSpaces. \n\nFollowed by a conversation with @TomDreisbach and @ilyamarritz https://t.co/UuEbBXzQWO","date":"Thu Jun 16 15:14:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The House select committee investigating the Jan. 6 insurrection at the Capitol will hold its next hearing at 1 p.m. ET on Thursday. Here's what to expect. https://t.co/MZFjjESCrW","date":"Thu Jun 16 14:58:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Did you know that dolphins can tell each other apart by tasting each other’s pee? Well, now you do!\n\nLearn more about how dolphins communicate in the latest episode of @waitwait’s Everyone &amp; Their Mom: https://t.co/rlZZcMQ3DX","date":"Thu Jun 16 14:25:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Beyoncé is back. https://t.co/zeHiXRG9aD","date":"Thu Jun 16 13:44:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Are you in debt for medical bills you can't pay?\n\nWe want to hear from you! Share your story with NPR and KHN for a special series investigating medical debt in the U.S. https://t.co/qCU5zVOaEZ","date":"Thu Jun 16 13:04:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Former Atlanta Mayor Keisha Lance Bottoms will be joining the Biden administration, as the Senior Advisor for Public Engagement. Previously she was being considered to be President Joe Biden's running mate in the 2020 presidential election. https://t.co/6mjC7sbqpQ","date":"Thu Jun 16 13:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ukraine's President Volodymyr Zelenskyy welcomed the U.S. announcement that it's sending an additional $1 billion in military aid that includes heavy weapons for the outgunned Ukrainian military. https://t.co/FPiZFrIAWy","date":"Thu Jun 16 12:31:31 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A bill that would grant security to families of Supreme Court justices passed the House of Representatives this week and will now go to President Joe Biden for a decision.\n\nhttps://t.co/H1qx3IA34P","date":"Thu Jun 16 12:00:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Southern Baptist Convention offered commitments to address sexual abuse problems kept hidden for years at its annual meeting. https://t.co/BqZn2QKcqU","date":"Thu Jun 16 11:26:49 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"When Democratic aide Seth Rich was murdered in 2016, it rocked his family's world.\n\nWithin days, his grieving parents were contending with a wave of far-right conspiracies and outright lies.\n\nNow, they’re opening up about the emotional toll it has taken.\nhttps://t.co/Y71zkoOvFD","date":"Thu Jun 16 10:44:34 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Meghan Stabile, a promoter, presenter and producer whose impassioned advocacy helped spark a resurgence of mainstream interest in jazz, died on Sunday. She was 39. https://t.co/whnv895CWe","date":"Thu Jun 16 10:00:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🐢 A little heartwarming news: These kindergarteners in New Jersey helped raise 18 orphaned turtles for a year, then released them back into the wild.\nhttps://t.co/24mD8h5ePD","date":"Thu Jun 16 10:00:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Amber Heard said she will \"stand by every word of my testimony\" in an interview with NBC — adding that, \"I think (the) vast majority of this trial was played out on social media.\"\nhttps://t.co/Ixvo02DNER","date":"Thu Jun 16 09:45:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Jim Marchant, a former Nevada state lawmaker, is the latest Trump ally to take a step closer to running elections in their state. He will face off against Democratic candidate Cisco Aguilar for Nevada's secretary of state position. https://t.co/FxDX0vsdKs","date":"Thu Jun 16 09:00:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Monkeypox is poised to get a new name after scientists criticized the current one as being discriminatory and stigmatizing.\nhttps://t.co/UuPyn2hsv1","date":"Thu Jun 16 07:30:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In Colombia's presidential election, a 77-year-old populist candidate who campaigns over TikTok is now neck-and-neck with his leftist opponent.\nhttps://t.co/fyfzGm2azX","date":"Thu Jun 16 07:00:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The family of Seth Rich — a Democratic aide killed in 2016 — has been the target of far-right conspiracies.\n\nA man with ties to Fox News even plotted to wiretap their home, according to a sworn deposition.\n\n\"You're a pawn in the game,\" Rich’s mom says.\n\nhttps://t.co/z5DO9vwv11","date":"Thu Jun 16 05:13:01 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"John Hinckley Jr., who tried to assassinate President Reagan, has been inching his way toward freedom for years. On Wednesday, an order lifting some remaining restrictions went into effect granting full release.\n\nhttps://t.co/iPTgvggOSb","date":"Thu Jun 16 03:30:14 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The discovery of the Clotilda on an Alabama river bottom has fostered a renewed hope for descendants of the Clotilda's captives, and the community they founded called Africatown. https://t.co/lSGWEst6HY","date":"Thu Jun 16 03:00:11 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The northern half of Yellowstone will probably not reopen this summer after being hit by historic floods, officials say.\n\nBut some other entrances could re-open \"as early as this weekend.\"\nhttps://t.co/0QquxiON4b","date":"Thu Jun 16 02:57:16 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The U.S. has a home shortage. But builders may be slowing down construction instead of increasing it — because of worries that houses won't be sold.\nhttps://t.co/M2Crr2fyOX","date":"Thu Jun 16 02:16:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"👋🏿Welcome to your evening news digest.\n\nHere are NPR Newscast's top stories right now.\n\n🎧Listen here: https://t.co/TgNSJL9ocL https://t.co/sjyN5CeBKz","date":"Thu Jun 16 02:01:25 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Limits with @RealJayWilliams speaks with @mPinoe about the historic equal pay win for the @USWNT, retirement, and the 2023 world cup team. \nhttps://t.co/yCoUp5SsQ2","date":"Thu Jun 16 02:00:07 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Ryann Stevenson's debut collection Human Resources won the Max Ritvo Poetry Prize. It looks at how technology both connects and separates us. https://t.co/0av9RrZmG8","date":"Thu Jun 16 01:45:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"After visiting Nyarugusu refugee camp in Tanzania, these two trainees in medicine and public health are reflecting on disparities in the quality of medical and surgical care that refugees receive.\nhttps://t.co/434bJXJJKh","date":"Thu Jun 16 01:12:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Biden administration says it has a plan to curb fatal overdoses by 13% by 2025. But as more synthetic opioids reach the U.S., there's skepticism interdiction can slow the flow of deadly drugs. https://t.co/EYOJbi5YSg","date":"Thu Jun 16 00:44:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Gov. Phil Murphy sent a letter to nearly 60 businesses suggesting they expand into New Jersey because the state protects abortion rights.\nhttps://t.co/agBc9Mn2Va","date":"Thu Jun 16 00:40:03 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"RIP Internet Explorer. No one will miss you. https://t.co/pEgxz7BDl5","date":"Thu Jun 16 00:29:08 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The South China Morning Post says new textbooks for use in Hong Kong contend that the territory was never a British colony — a rewriting of more than a century and a half of colonial history.\nhttps://t.co/v6SQG81FMU","date":"Wed Jun 15 23:50:02 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Under intense political pressure to address soaring gasoline prices, President Biden is trying to push the nation's largest refiners to do more to boost supplies and lower prices.  https://t.co/SZaOFM9tuI","date":"Wed Jun 15 23:10:29 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Yellowstone National Park officials say some entrances could re-open \"as early as this weekend,\" but the park's northern half is unlikely to reopen this summer due to damage caused by flooding. https://t.co/hYx2IRyOaA","date":"Wed Jun 15 22:30:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Millions depend on us, we depend on you. NPR and NPR station newsrooms are non-profit organizations, powered by your support. Donate to your NPR station today. https://t.co/dxWrwZivlA https://t.co/FZtRxBAPAV","date":"Wed Jun 15 22:15:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Meghan Stabile, a promoter, presenter and producer whose impassioned advocacy helped spark a resurgence of mainstream interest in jazz, died on Sunday. She was 39. https://t.co/foLr7qG1Ij","date":"Wed Jun 15 22:01:06 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"As Wednesday draws to a close in Kyiv and in Moscow, here are the key developments of the day: https://t.co/K8yTrNWtIn https://t.co/NmcQLNYFtL","date":"Wed Jun 15 22:00:12 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The number of Americans seeking abortions rose for the first time in nearly 30 years. A report from the Guttmacher institute suggests increased access and growth of funds could be behind the increased 2020 numbers. https://t.co/mtTGA9Wpx6","date":"Wed Jun 15 21:57:10 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"In Colombia's presidential election, a 77-year-old populist candidate who campaigns over TikTok is now neck-and-neck with his leftist opponent.\nhttps://t.co/Om8RMQE2Ju","date":"Wed Jun 15 21:02:24 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Advisers have voted unanimously to recommend that the FDA authorize COVID vaccines from Moderna and Pfizer for children as young as 6 months.\nhttps://t.co/7GU8pwp8xs","date":"Wed Jun 15 20:18:28 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Pro-Trump candidates, many of whom are spouting his election lies, are cropping up everywhere — and winning key primaries.\n\nHere are 3 lessons from Tuesday's elections 👇\nhttps://t.co/J3A3XuiS2S","date":"Wed Jun 15 20:10:05 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: Dr. Anthony Fauci, the chief medical advisor to President Joe Biden, tested positive for COVID-19. He is experiencing mild symptoms and will continue to isolate and work from home. https://t.co/7ts3iSKNxD","date":"Wed Jun 15 19:25:09 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"The Biden administration is taking steps that could change how the U.S. census and federal surveys produce racial and ethnic data — which is used for redrawing voting districts and enforcing civil rights protections.\nhttps://t.co/2ev6dySUgV","date":"Wed Jun 15 19:11:59 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"🐢 A little heartwarming news: These kindergarteners in New Jersey helped raise 18 orphaned turtles for a year, then released them back into the wild.\nhttps://t.co/XA4zLkLOAa","date":"Wed Jun 15 19:08:04 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"A North Carolina company is offering $2,000 to release cockroaches into your home — to study the effects of different pest controls.\nhttps://t.co/tbbtlt9tJ6","date":"Wed Jun 15 19:06:42 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"JUST IN: The Federal Reserve raised interest rates by three-quarters of a percentage point, the biggest increase since 1994, in a bid to combat surging inflation.\nhttps://t.co/CAZYlfZnU9","date":"Wed Jun 15 18:17:20 +0000 2022","user_id":"5392522"},{"handle":"npr","text":"Monkeypox is poised to get a new name after scientists criticized the current one as being discriminatory and stigmatizing.\nhttps://t.co/lqoI2XSZr6","date":"Wed Jun 15 18:00:56 +0000 2022","user_id":"5392522"}]