[{"handle":"nytimes","text":"China’s congested and highly regulated capital is not known for either its natural refuges or its rule-bending. But swimming in the city’s lakes and waterways is a cherished, if contested, tradition. https://t.co/pJjAzuJGkS https://t.co/ZBcpkXpz48","date":"Sat Jun 25 22:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After more than a year of silence, the mysterious figure behind the QAnon conspiracy theory has reappeared.\n\nThe figure, who is known only as Q, posted for the first time in over a year on Friday, writing, \"Shall we play the game again?\" https://t.co/wIRSJTQLAs","date":"Sat Jun 25 22:36:39 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A Chihuahua mix named Mr. Happy Face won the 2022 World’s Ugliest Dog contest out of a field that included a \"hairless mutant,\" a creature that resembled \"a hyena or mandrill baboon\" and a dog with a \"gorilla-looking head,\" contest organizers said.\nhttps://t.co/JqKX5OdPQT","date":"Sat Jun 25 22:32:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The beginning of the end of Roe v. Wade began 12 years ago, after Republicans swept state house elections and passed hundreds of restrictions. Even some of the most ardent anti-abortion activists did not see the shift coming. https://t.co/YmlXq6eVfQ","date":"Sat Jun 25 22:25:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Commuting by bike. Working from home. Hunting for deals at the pump. \n\nAmericans are changing their habits and getting creative to hack high gas prices. https://t.co/53P1xlBAPP","date":"Sat Jun 25 22:25:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"For Amy Gutmann, a respected democracy scholar, her role as President Biden’s envoy to Germany is not a job. \"It’s a mission,\" she said. https://t.co/JAGgd6Ykdc https://t.co/X4YflIbKOe","date":"Sat Jun 25 21:55:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The list of companies that have said they will cover travel expenses for employees in need of abortions continues to grow, including H&amp;M, Bank of America and Intuit. Google said employees could apply to relocate \"without justification.\" https://t.co/ZnP6Frej7o","date":"Sat Jun 25 21:53:30 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"Given this climate, Pride cannot be just a gay party or a corporate branding opportunity,\" Mark Gevisser writes in a guest essay. \"It must once more find its role as an emblematic struggle against the gathering of illiberal forces.\" https://t.co/dhdQwKK8I1","date":"Sat Jun 25 21:40:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"I didn’t retire,\" Serena Williams said on Saturday, ahead of her 21st Wimbledon appearance.\n\n\"I had no plans to be honest. I just didn’t know when I would come back. I didn’t know how I would come back.\" https://t.co/v9Mt6wI25q","date":"Sat Jun 25 21:25:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Kansas has become a haven for women seeking abortions from surrounding states where the procedure is severely restricted or outlawed. But that could soon change, with a ballot initiative slated for an August vote that would strip away that protection. https://t.co/h1djyKih0F","date":"Sat Jun 25 21:10:59 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Cristian Javier and two Houston Astros relievers combined for a no-hitter against the Yankees in a 3-0 victory in the Bronx. \n\nIt was only the seventh time that the Yankees have gone without a hit in 120 seasons and more than 18,500 games. https://t.co/57SHZLHD9N","date":"Sat Jun 25 20:55:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"What does NASA want with a few dead insects, the contents of their innards and a specks of lunar material?\nhttps://t.co/IkP6un9Cwp","date":"Sat Jun 25 20:40:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As of Friday, New York City has confirmed at least 39 monkeypox cases and expanded access to a vaccine. Officials have said the virus is spreading primarily through communities of men who have sex with men. https://t.co/bpXsoP4Txl","date":"Sat Jun 25 20:26:21 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Dozens of liberal prosecutors and municipal leaders have pledged to shield their residents from abortion bans in the wake of the Supreme Court ruling ending Roe v. Wade. But the threat of prosecution could still have a chilling effect on providers. https://t.co/ECPhdJf50n","date":"Sat Jun 25 20:26:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"During a two-hour meeting in 2018, Senator Susan Collins of Maine pressed Brett Kavanaugh on why she should trust him not to overturn Roe v. Wade.\n\nMeeting notes show Kavanaugh worked vigorously to reassure her that he was no threat to the landmark ruling. https://t.co/1jUW6ypGVT","date":"Sat Jun 25 20:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After signing into law the bipartisan gun bill at the White House on Saturday morning, President Biden was asked by a reporter if he thought the Supreme Court was broken. \n\n\"I think the Supreme Court has made some terrible decisions,\" he said. https://t.co/MuTJBcHE7i https://t.co/NtqilLWmyv","date":"Sat Jun 25 20:01:43 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In March, talk of victory for Ukraine was in the air. \n\nNow, maintaining unity against Vladimir Putin is looking harder, with President Biden heading to Germany and Spain to rally Europe for a long conflict. https://t.co/XXNoqxkRO5","date":"Sat Jun 25 19:55:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"While the pro-life movement has won the right to legislate against abortion, it has not yet proven that it can do so in a way that can command durable majority support. Its weaknesses will not disappear in victory,\" writes @DouthatNYT. https://t.co/53VbzWypWb","date":"Sat Jun 25 19:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Broadway farce \"POTUS\" features a moment in which a character blurts out that she volunteers at an abortion clinic in Iowa. On Friday night, her line saying that \"affordable, safe reproductive health care is a basic human right\" stopped the show. https://t.co/JXmiMj57FO https://t.co/q9Hf5hz4BN","date":"Sat Jun 25 19:32:35 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A year ago, Champlain Towers South collapsed in Surfside, Florida, killing 98 people.\n\nThe lives of those who lost loved ones and homes have never been the same. These are their stories, in their own words.\n\nPhotographs by Rose Marie Cromwell. https://t.co/mqKNoscfv1 https://t.co/xSCpeeKNzh","date":"Sat Jun 25 19:25:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"A phenomenal work of the Lord.\"\n\nFor nearly 50 years, conservative Christians marched, strategized and prayed for the end of Roe v. Wade. For many, the Supreme Court’s decision was not just a political victory but a spiritual one. https://t.co/BIUeycwHbZ","date":"Sat Jun 25 18:40:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Some CIA personnel have continued to operate in Ukraine secretly, mostly in Kyiv, directing much of the intelligence the U.S. is sharing with Ukrainian forces, according to current and former officials. https://t.co/4VWdybmome","date":"Sat Jun 25 18:25:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After running out his contract with Real Madrid, Gareth Bale has agreed to join Los Angeles F.C. https://t.co/sudntqEFyz","date":"Sat Jun 25 18:15:55 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In her latest letter to Democratic lawmakers about the decision to end Roe v. Wade, Speaker Nancy Pelosi said the Supreme Court was \"guilty of a miscarriage of justice.\" https://t.co/sLRt2YJ76A https://t.co/vimEO7cVXL","date":"Sat Jun 25 18:05:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"If you want to cool or heat specific rooms with better efficiency and less clutter than window ACs and space heaters, consider installing a mini-split system. Here's how via experts @wirecutter. https://t.co/cRKuIXfgqG","date":"Sat Jun 25 18:00:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A Biden administration policy that prioritized the arrest of undocumented immigrants who are considered a threat to public safety and national security has been suspended as of Saturday, rendering millions of people vulnerable to deportation. https://t.co/Gx3NfmmQex","date":"Sat Jun 25 17:53:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\nThursday's Supreme Court decision \"reveals the vast gulf between ideologues on the court and those Americans — ordinary people and their representatives in Congress — who want this country to be safer from guns,\" the editorial board writes. https://t.co/ubIGTNj3L8","date":"Sat Jun 25 17:40:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After signing the bipartisan gun bill at the White House on Saturday morning, President Biden was asked by a reporter if he thought the Supreme Court was broken. \n\n\"I think the Supreme Court has made some terrible decisions,\" he said. https://t.co/CGhPMBbBPy","date":"Sat Jun 25 17:30:58 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As the leaders of the Commonwealth wrapped up a week of meetings on Saturday in Rwanda, the \"family of nations\" still stood at a crossroads, with questions remaining about its usefulness and whether it can reinvent itself for the 21st century. https://t.co/D4c20slilM","date":"Sat Jun 25 17:25:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"It’s finally summer, but more importantly: It’s time for tomatoes to shine.\n\nThese are some of our best recipes for tomato lovers. \nhttps://t.co/3SQgIBFfzT","date":"Sat Jun 25 17:15:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In the newly redrawn map of the U.S. taking shape Saturday, abortion was banned in at least nine states, prompting vows of swift enforcement from officials in conservative states. Prosecutors in liberal states and counties responded with defiance. https://t.co/RGzSl4n5Ry","date":"Sat Jun 25 16:55:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In “Dollars for Life,” Mary Ziegler argues that, over the course of decades, the anti-abortion movement laid the groundwork for an insurgent candidate like Donald Trump. https://t.co/AVDEG1lCsO","date":"Sat Jun 25 16:55:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Read our annotated version of the Supreme Court's 6-3 decision ending Roe v. Wade, with analysis from New York Times reporters. https://t.co/qkSMXfn1kC","date":"Sat Jun 25 16:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Despite New York's reputation as a bastion of abortion rights, crisis pregnancy centers — which encourage women to give birth — have existed there for years. They now may ramp up their services for a post-Roe world. https://t.co/jjdWem8gRQ","date":"Sat Jun 25 16:25:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden on Saturday addressed the Supreme Court's Roe decision, before leaving for summits in Europe. He said his administration will focus on states' decisions and \"how they administer it and whether or not they abide by their own laws.\" https://t.co/6dyFwy96PM https://t.co/8B2gt649ta","date":"Sat Jun 25 16:02:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Arizona, police deployed tear gas and state senators called a recess late Friday after abortion rights protesters amassed outside the State Capitol, with some banging on the glass. https://t.co/AC0oyvYspk","date":"Sat Jun 25 15:55:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Grilling food over an open fire is one of life’s great pleasures, at least if you set yourself up for success. Here’s our guide to the fundamentals and a handful of techniques to master, whether you’re a beginner or an advanced cook. https://t.co/fbXunVuvNr https://t.co/qoAfZit83q","date":"Sat Jun 25 15:45:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"An earthquake this week wreaked havoc on a remote region of eastern Afghanistan, killing around 1,000 people. It was a devastating blow for a place that has seen unrelenting hardship for decades, and had been hoping for respite after the war ended. https://t.co/uQFpPnemcI https://t.co/lJBZsrxLaj","date":"Sat Jun 25 15:40:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Nearly 50 years ago, the Supreme Court legalized abortion. The decision has since divided the country. Now that the court has overturned Roe v. Wade, here are 10 books that outline the history and the terms of the debate.\n\nhttps://t.co/rhWU2PAuKd","date":"Sat Jun 25 15:25:01 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"This was the New York Times front page on the day in 1973 that the Supreme Court decided Roe v. Wade in a 7-2 vote. https://t.co/EZMsBqhCtq","date":"Sat Jun 25 15:09:43 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In 10 of the 26 states that have already banned abortion or are now most likely to do so, more voters favor abortion rights than oppose them, according to a poll that has surveyed nearly a quarter million registered voters since 2016. https://t.co/aElJcHHUIR","date":"Sat Jun 25 15:06:50 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Wisconsin, Michigan and other states, old laws criminalizing abortion — some of which were written before the Civil War — were never repealed by state legislatures. Now, they could be enforced. https://t.co/0c9fO2CiNz","date":"Sat Jun 25 14:55:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"This is the time of reckoning.\"\n\nThe Supreme Court decision overruling Roe v. Wade sent business leaders and employees scrambling for answers about how to react. Some executives are already starting to focus on the potential for other shoes to drop. https://t.co/N33qLfRsec","date":"Sat Jun 25 14:40:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"While his wife ran around helping Trump with his coup, Thomas was the senior firebrand in a coup of extremists on the court,\" @maureendowd writes. https://t.co/ZJ4ApCTj99","date":"Sat Jun 25 14:25:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Meta, which owns Facebook and Instagram, told its workers not to openly discuss the Supreme Court’s ruling overturning Roe v. Wade on wide-reaching communication channels inside the company. https://t.co/LIisUqyHKX","date":"Sat Jun 25 14:04:44 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"All six Supreme Court justices in the majority opinion striking down Roe v. Wade avoided directly stating in their confirmation hearings how they would rule on it. They typically stuck to expressing their belief in the importance of precedent. https://t.co/7n2bQRyKKL https://t.co/VTaE7XJPPj","date":"Sat Jun 25 13:55:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As more trigger laws banning abortion take effect, the country is rapidly sorting into two — a half where abortion was still legal, and a half where it was now outlawed or severely restricted. https://t.co/FO2Dyme424","date":"Sat Jun 25 13:50:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"If we sound angry and alarmed, that’s because we are. This decision is devastating — and we have seen what happens next,\" Senators Elizabeth Warren and Tina Smith write. \"We both lived in an America where abortion was illegal.\" https://t.co/9JwxIcoC8l","date":"Sat Jun 25 13:39:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: President Biden signed into law a bipartisan gun bill, breaking years of stalemate over whether to toughen the nation’s gun laws. https://t.co/1wH4qxqN6t","date":"Sat Jun 25 13:25:31 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The front page of The New York Times for Saturday, June 25, 2022. https://t.co/l94XJdVttu","date":"Sat Jun 25 13:24:24 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A shooting near a popular gay club in downtown Oslo that killed two people and seriously wounded at least 10 is being investigated as an act of terrorism, as Norwegians grappled with a rare gun attack that shattered an expected Pride weekend celebration. https://t.co/N8IRrL8abx","date":"Sat Jun 25 13:11:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Through multiple rounds of testing over the last decade, one electric kettle has remained @wirecutter's favorite. Here's why they recommend it above all others. https://t.co/9rLSNzgatr https://t.co/Q3EsKESq39","date":"Sat Jun 25 13:00:21 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Taking pills to end a pregnancy accounts for a growing share of abortions in the U.S.\n\nNow that the Supreme Court overturned Roe v. Wade, medication abortion will play a larger role, especially among women who lose access to abortion clinics. https://t.co/6oRc2pyodq","date":"Sat Jun 25 12:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Planned Parenthood v. Casey in 1992, the Supreme Court affirmed what it called the central holding of Roe v. Wade: that states may not prohibit abortions before the point when a fetus could survive outside the womb, which is now about 23 weeks. https://t.co/EntyQiEPWO","date":"Sat Jun 25 11:06:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court decision that overturned Roe v. Wade ruled that states should be allowed to ban abortions.\n\nHere are the key passages from the majority opinion written by Justice Samuel Alito, with analysis from our reporters. https://t.co/oJEGhWnOGU","date":"Sat Jun 25 10:04:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Many governments around the world have been moving toward easier access to abortion, with more than 50 countries liberalizing their laws in the past three decades. https://t.co/vONrNUAp4A","date":"Sat Jun 25 09:06:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russia has slowly been turning off the gas tap to Germany in recent days. On Friday, EU leaders asked for policy proposals to handle the possibility that Russia could further reduce the gas flow — or even cut off countries completely. https://t.co/vCJsIhI9Dy","date":"Sat Jun 25 08:04:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With famine stalking Africa, the Middle East and elsewhere in Asia, Russia's invasion has trapped millions of tons of wheat and corn inside Ukraine, causing a frenetic scramble to find new suppliers and alternate shipping routes. https://t.co/PexICfVotZ","date":"Sat Jun 25 06:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The State Department on Friday released its rules and guidelines for providing financial support to victims of Havana syndrome, the mysterious ailments that have affected U.S. diplomats, CIA officers and others since 2016. https://t.co/UWJuWIkUf8","date":"Sat Jun 25 05:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Abortion funds, the local organizations that provide financial and logistical support for people seeking abortions, have received millions of dollars in new funding after the Supreme Court struck down Roe v. Wade on Friday. https://t.co/QjPCBQLEKN https://t.co/YXuO6DfjCs","date":"Sat Jun 25 04:00:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Two people were killed and at least 19 injured early Saturday morning in downtown Oslo when a gunman opened fire outside two nightclubs and a diner, the police and Norway’s state broadcaster said. https://t.co/fmcbxg4f5v","date":"Sat Jun 25 03:40:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court’s decision overturning the constitutional right to abortion unleashed waves of confusion for doctors and women across the U.S. as they tried to understand a legal landscape that was changing by the hour. https://t.co/ah50C97L7n","date":"Sat Jun 25 03:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Advocates for LGBTQ rights on Friday sounded the alarm over Justice Clarence Thomas’s concurring opinion overturning Roe v. Wade, calling it a potential assault on the legal doctrine protecting a wide array of Americans’ civil rights. https://t.co/T1m2LxRpzb","date":"Sat Jun 25 03:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Hours after the U.S. Supreme Court ruled to overturn Roe v. Wade on Friday, thousands gathered in New York City to voice their fears and rage over the decision. https://t.co/SNqFZJz6JL","date":"Sat Jun 25 02:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The FBI raided the Orlando Museum of Art on Friday, taking all 25 works that had been part of an exhibition on the life and work of Jean-Michel Basquiat, the museum said. https://t.co/YjNpECz9FG","date":"Sat Jun 25 02:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Prior to his confirmation hearing, Brett Kavanaugh worked vigorously to reassure Sen. Susan Collins that he was no threat to Roe v. Wade, according to notes obtained by The New York Times from their two-hour conversation in August 2018. https://t.co/WU5GFl53lU https://t.co/ju0oRUSzcX","date":"Sat Jun 25 02:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"From @nytopinion: \n \nSo much for precedent. Before they were confirmed, this is what Justices Kavanaugh, Thomas, Gorsuch, Alito and Coney Barrett had to say about Roe v. Wade. https://t.co/1ZZ33Ccp2K","date":"Sat Jun 25 01:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gov. Ron DeSantis of Florida signed a law in April banning abortions after 15 weeks of pregnancy, severely curtailing access to the procedure. On Friday, he praised the Supreme Court’s decision, saying \"the prayers of millions have been answered.\" https://t.co/RmlIFg9H8z","date":"Sat Jun 25 01:10:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Hundreds of protesters gathered in front of the Supreme Court to condemn the decision to overturn Roe v. Wade. Next to the protesters, anti-abortion activists celebrated the end of the landmark ruling. https://t.co/847J2vGztX https://t.co/phDsKf8UpM","date":"Sat Jun 25 01:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion \n\n\"The overturning of Roe is the perfect time for every supporter of abortion rights to examine their own commitment to the cause,\" Robin Marty of the West Alabama Women’s Center writes in a guest essay about what people can do to help. https://t.co/1DOuTEUUfv","date":"Sat Jun 25 00:38:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Megan Rapinoe, the star of the U.S. women’s soccer team, was among several athletes to criticize the Supreme Court’s decision to overturn Roe v. Wade. She said it was “oddly cruel” timing as women celebrate the 50th anniversary of Title IX legislation. https://t.co/nfcXamfPDc","date":"Sat Jun 25 00:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Democrats instantly appealed to donors on Friday after the Supreme Court overturned Roe v. Wade. Republicans are seeking donations by raising the prospect that Democrats in Congress will erase the conservative victory in the courts. https://t.co/PyaHcRz5x9","date":"Sat Jun 25 00:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Dr. Thomas Dobbs III, who is named in the Supreme Court decision to let states ban abortions, had \"no direct involvement in any component of this legal action,\" he said when the draft opinion was leaked in May. He has said little about the case since. https://t.co/TL9X7G2jBN","date":"Fri Jun 24 23:40:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Clinic escorts directed traffic outside the Jackson Women’s Health Organization in Mississippi as a small group of anti-abortion demonstrators gathered outside following the Supreme Court reversal of Roe v. Wade. https://t.co/WHRuIft8YM https://t.co/gLbO1LhA3k","date":"Fri Jun 24 23:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Though the decision by the Supreme Court to overturn Roe v. Wade was leaked in May, the official ruling drew a wave of strongly worded responses from world leaders on Friday. https://t.co/AmrRnm7ANv https://t.co/3EsfrtBWmb","date":"Fri Jun 24 22:40:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With Roe v. Wade overturned, a new set of political fights will begin across the U.S.\n\nBy the time they're done, a quarter of women of reproductive age in the country would have to travel more than 200 miles to obtain a legal abortion. https://t.co/AZk7YY6xP9","date":"Fri Jun 24 22:00:21 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"This map shows how far a woman in the U.S. needed to drive to reach an abortion clinic with Roe v. Wade in place. Within weeks, abortion will be outlawed in many states, and the map will start to change. https://t.co/spBgB1x2Uf","date":"Fri Jun 24 21:45:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gov. Kathy Hochul of New York described Friday as a \"dark day for women across this nation,\" following the Supreme Court's decision to overturn Roe v. Wade. She declared her state a \"safe harbor\" for those seeking abortions. https://t.co/KFN7YXDvhT https://t.co/QcFfdjSkHU","date":"Fri Jun 24 21:35:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court decision that overruled Roe v. Wade does not indicate that the court would revisit past decisions about birth control, which remains legal everywhere in the U.S., though several states allow doctors to refuse to prescribe contraceptives. https://t.co/pk5H5Ohbtu","date":"Fri Jun 24 21:30:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Abortion is now banned in at least nine states, with trigger bans in several more set to take effect in the coming days. Laws in eight states took effect on Friday after the Supreme Court ruled to overturn Roe v. Wade. https://t.co/urnXjV1uNF https://t.co/3pYUVKlmvA","date":"Fri Jun 24 21:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gov. Kathy Hochul of New York condemned the Supreme Court overturning Roe v. Wade on Friday as “repulsive.” She said it was a “dark day for women across this nation” who have “long fought for the right to have control over their own lives.” https://t.co/5MstqS6wVO https://t.co/SW9npKtcZX","date":"Fri Jun 24 21:10:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"For most Americans, abortion has become less a question of morality than one of politics, and the Supreme Court decision that overturned Roe v. Wade made it even more so. https://t.co/LtrEmpUYoK","date":"Fri Jun 24 21:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Now that the Supreme Court has struck down Roe v. Wade, the most important election this year in America when it comes to abortion will be the contest for governor of Pennsylvania. https://t.co/nxzvLcxXkT","date":"Fri Jun 24 20:50:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Dick’s Sporting Goods said it would provide up to $4,000 in travel reimbursement for employees who live in states that restrict abortion access and that the policy would apply to any spouse or dependent covered by the company’s medical plan.\nhttps://t.co/xO775TTQ9Y","date":"Fri Jun 24 20:45:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The decision by Republican-appointed justices to end a constitutional right to abortion conflicted with the views of a majority of Americans. https://t.co/nQ5FXQ7w77 https://t.co/1yX7KcCXYp","date":"Fri Jun 24 20:40:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Our reporters are reading and analyzing the Supreme Court’s majority opinion that eliminated the constitutional right to an abortion.\n\nHere’s an annotated version of the decision, known as Dobbs v. Jackson: https://t.co/xTmu7DQYpI","date":"Fri Jun 24 20:30:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\nThe fight to undo Roe \"seems even more ominous when one looks around the globe: Other countries that have recently undone abortion rights are backsliding democracies,\" writes Mary Ziegler, a law professor.\nhttps://t.co/mwKRAiziab","date":"Fri Jun 24 20:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The S&amp;P 500 rose 6.5% this week after a brutal selloff earlier in June. Still, analysts predict more pain ahead. https://t.co/m4fhNsHNA5","date":"Fri Jun 24 20:17:58 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The vegan food delivery service Daily Harvest recalled a lentil-based product after receiving hundreds of reports of illness or adverse reactions from customers and viral posts from influencers. The wave of reported illnesses has flummoxed health experts.https://t.co/VuvCxdezNj","date":"Fri Jun 24 20:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"La Corte Suprema de Estados Unidos anuló el viernes el caso Roe contra Wade, y eliminó el derecho constitucional al aborto después de casi 50 años. El fallo pone a prueba la legitimidad de la corte y reivindica un proyecto del Partido Republicano. https://t.co/uE4Vuq4xII","date":"Fri Jun 24 20:05:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Women who were denied an abortion had more psychological problems in the short term than those who received one, and also experienced more long-term physical and financial problems, landmark research known as the Turnaway study found. https://t.co/dhSB1cU0ZX","date":"Fri Jun 24 20:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Mike Pence, the former vice president under Donald Trump and a likely Republican presidential candidate in 2024, praised the Supreme Court’s ruling on abortion, saying, “Today, Life won.” https://t.co/8XPsVOrQ36 https://t.co/5BIBdofj3e","date":"Fri Jun 24 19:50:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The decision by five Supreme Court justices to end the constitutional right to abortion has cast a renewed spotlight on what they said about Roe v. Wade during their confirmation hearings. Here is a sampling: https://t.co/8oYkmTPFsX https://t.co/sRw3ZIpdKb","date":"Fri Jun 24 19:40:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan. 6 committee outlined on Thursday how Donald Trump tried to strong-arm the Justice Department to overturn the 2020 election, the most brazen attempt by a sitting president since Watergate to manipulate the department to keep himself in power. https://t.co/RmzgpuVhfY https://t.co/aR7aIkCOcr","date":"Fri Jun 24 19:30:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The House passed a bipartisan bill on Friday to extend free meals and other food assistance for children, clearing it for President Biden’s signature one week before a series of pandemic-era waivers was set to expire. https://t.co/8r8jJxHg5t","date":"Fri Jun 24 19:25:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The ruling eliminating the constitutional right to an abortion after almost 50 years was met with celebration and anger across the country. Demonstrators, filled with emotion, gathered outside the Supreme Court on Friday. https://t.co/TGr6cUAE4n https://t.co/NyDkINeFYB","date":"Fri Jun 24 19:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court’s decision to overturn Roe v. Wade could deal a blow to the financial well-being of women, who will bear a steep economic burden from unwanted pregnancies. https://t.co/l2GsDtplXY","date":"Fri Jun 24 19:15:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russia made unfounded claims that Lithuania, a NATO member, was choking off the flow of goods to Kaliningrad as part of sanctions over the Ukraine war. \"Nobody wanted or expected any of this,\" said the chairman of Lithuania’s defense and security committee.https://t.co/51FLT6I9FM","date":"Fri Jun 24 19:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Mississippi, the state at the center of the case that led to the Supreme Court overturning Roe v. Wade, nearly all abortions will likely be illegal within days. https://t.co/n46OqBExEV","date":"Fri Jun 24 19:00:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Donald Trump has privately told friends and advisers that he believes the Supreme Court decision ending Roe will anger suburban women, a group who helped tilt the 2020 election to Joe Biden, and lead to a backlash against the GOP in the November midterms. https://t.co/UxeuYADtCy https://t.co/WHuEx0bBsA","date":"Fri Jun 24 18:52:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court's public approval ratings have been dropping, and its conservative supermajority has raised questions about whether it is out of step with public opinion.\n\nHere's how they voted in major cases this term. https://t.co/uHuQZFApVh","date":"Fri Jun 24 18:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A protester outside the Supreme Court said she was on a train from New York back to her home in Virginia on Friday morning, but decided to get off when the train reached Washington, getting a sign on her way. https://t.co/dZWSQVp3nb https://t.co/RqLrsNwN8O","date":"Fri Jun 24 18:35:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Anti-abortion demonstrators celebrated in front of the Supreme Court on Friday morning after the 6-3 ruling that overturned Roe v. Wade. https://t.co/OWyFF2GAv5 https://t.co/dOrwVfDzcp","date":"Fri Jun 24 18:30:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court's decision to overturn Roe v. Wade and give individual states the choice of banning or allowing abortions will immediately affect 13 states that have trigger laws. https://t.co/ppj1MChGaQ https://t.co/SeYIUewsM8","date":"Fri Jun 24 18:23:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Attorney General Merrick Garland vowed to use the Justice Department’s authority to protect abortion rights and said states cannot ban the FDA-approved abortion pill mifepristone. https://t.co/m2HjGyAkSz","date":"Fri Jun 24 18:20:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Senator Susan Collins, the Maine Republican who was a key supporter of Brett Kavanaugh in his 2018 confirmation, said he and Neil Gorsuch misrepresented their views on Roe v. Wade in private meetings with her. https://t.co/RWNdmks29h https://t.co/r6m4yeS0cF","date":"Fri Jun 24 18:15:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The decision by five Supreme Court justices to end the constitutional right to abortion has cast a renewed spotlight on what they said about Roe v. Wade during their confirmation hearings. Here is a sampling: https://t.co/KjW3MFhbqY","date":"Fri Jun 24 18:10:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Attorney General Merrick Garland called the Supreme Court's decision to strike down Roe v. Wade “a devastating blow to reproductive freedom,” and he vowed to use the Justice Department’s authority to protect the right to abortions. https://t.co/FPF3Tspnv1 https://t.co/7Vv6frMdS7","date":"Fri Jun 24 17:53:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Germany ended a Nazi-era ban on the advertisement of abortion services, a measure that had effectively criminalized doctors who provided information about the procedure. The vote came on the same day that Roe v. Wade was overturned in the U.S. https://t.co/D9fPFMMGq2","date":"Fri Jun 24 17:45:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Congress passed a bipartisan gun bill intended to stop dangerous people from accessing firearms, sending it to President Biden and ending nearly three decades of congressional inaction on gun policy. https://t.co/W1xS5UAD5r","date":"Fri Jun 24 17:37:28 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Justices Elena Kagan, Sonia Sotomayor and Stephen Breyer dissented to the Supreme Court's decision to overturn Roe v. Wade. Read the majority opinion and the dissent. https://t.co/Cf2V2Q58Hz https://t.co/BwxUzh0Qsr","date":"Fri Jun 24 17:36:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Tens of millions of Americans face an onslaught of litigation and legislative revision after a sweeping Supreme Court decision making it easier to carry a firearm in public upended gun control laws in at least a half-dozen states. https://t.co/qFPlIrzrPI","date":"Fri Jun 24 17:30:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden said the health of women in the U.S. \"is now at risk\" after the Supreme Court decision overturning Roe v. Wade. He said his administration \"will use all of its appropriate lawful powers\" and told Americans, \"with your vote, you can act.\" https://t.co/B3DEvVcxYJ https://t.co/BrKbBrgnrj","date":"Fri Jun 24 17:27:40 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Speaker Nancy Pelosi was clearly shaken by the Supreme Court's decision to overturn Roe v. Wade, telling reporters “I am personally overwhelmed by this decision.” https://t.co/caGrEGygwV https://t.co/1N8PMvL5mk","date":"Fri Jun 24 17:21:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Companies that have said they would cover travel expenses for employees who need abortions include Starbucks, Tesla, Yelp, Airbnb, Netflix, Patagonia, DoorDash, JPMorgan Chase, Levi Strauss &amp; Co. and Reddit. https://t.co/7QGnu34x4H","date":"Fri Jun 24 17:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court’s decision in Dobbs v. Jackson Women’s Health Organization upended a half-century of precedent on abortion law set in Roe v. Wade. About half the states are expected to ban or further restrict abortions. https://t.co/nx19J0MeGH https://t.co/sIUecYpwWu","date":"Fri Jun 24 17:07:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court voted 6 to 3 to overturn Roe v. Wade, ending the constitutional right to an abortion.\n\nRead the majority opinion of the court: https://t.co/gGGw6aW8zs","date":"Fri Jun 24 17:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Justice Clarence Thomas, in his concurring opinion overturning Roe v. Wade, fomented fears about what other rights could disappear: The same rationale, he said, should also be used to overturn rights to contraception and same-sex marriage. https://t.co/tMsDFDqmAI","date":"Fri Jun 24 16:45:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden took a deep breath before addressing the decision to overturn Roe v. Wade. “Today the Supreme Court expressly took away a constitutional right for the American people,” he said. “They didn’t limit it, they simply took it away.”\n\nWatch live: https://t.co/IBOqN1REqH","date":"Fri Jun 24 16:42:36 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Donald Trump is the man most responsible for shaping the Supreme Court that delivered the conservative movement a victory in overturning Roe v. Wade. But privately, he has told people repeatedly that he believes the decision will be “bad for Republicans.” https://t.co/Ph5GcjIXJr","date":"Fri Jun 24 16:38:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Senator Mitch McConnell spoke on the ruling to overturn Roe. v Wade on Friday. He arguably shaped the Supreme Court that handed down this decision. https://t.co/wfhjVjv8FN https://t.co/lebRo8apsW","date":"Fri Jun 24 16:30:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Speaker Nancy Pelosi said that she was \"personally overwhelmed\" by the Supreme Court decision to end Roe v. Wade.\n\n\"This cruel ruling is outrageous and heart-wrenching,\" she said. https://t.co/wzSXaab35t https://t.co/AX8yJvW5mm","date":"Fri Jun 24 16:22:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After the Supreme Court’s decision eliminating the constitutional right to an abortion, the street outside the courthouse was nearly full with demonstrators celebrating and protesting the ruling. Some brought signs reading “I will aid and abet abortion.” https://t.co/AnLrs1NEyb https://t.co/y4AtGXZlab","date":"Fri Jun 24 16:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After hearing that the Supreme Court overturned Roe v. Wade, Dr. Louis Monnig, an obstetrician-gynecologist, said he would head to work knowing that Kentucky’s 2019 trigger law had already criminalized abortion for his patients. https://t.co/GUlgROzufp https://t.co/ZQzucdF9gO","date":"Fri Jun 24 16:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden will give remarks at 12:30 p.m. at the White House on the Supreme Court’s ruling to overturn the constitutional right to abortion. https://t.co/LL2dlgcgiG","date":"Fri Jun 24 15:45:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"By a 7-to-2 vote in 1973, the Supreme Court established a constitutional right to abortion in Roe v. Wade. Today, after almost 50 years, the decision was overturned. https://t.co/8t4In3itnr","date":"Fri Jun 24 15:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Senator Joe Manchin of West Virginia, one of the few congressional Democrats who has frequently opposed abortion rights, criticized two conservative justices after the Supreme Court decision overruling Roe v. Wade. https://t.co/yBGN8w9B8X https://t.co/Dr8oa8OLuh","date":"Fri Jun 24 15:27:31 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Mayor Eric Adams offered New York City as a safe haven to Americans seeking abortions after the Supreme Court overturned Roe v. Wade. https://t.co/7yhcO3wczS https://t.co/GDlBUUZtxl","date":"Fri Jun 24 15:15:20 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The decision by Republican-appointed justices to end a constitutional right to abortion conflicted with the views of a majority of Americans. In a recent SCOTUSPoll, 62.3% of respondents opposed overturning Roe v. Wade. https://t.co/R3G3P2Z5I5","date":"Fri Jun 24 15:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court ruling to overturn Roe v. Wade will be one of the signal legacies of President Donald Trump, who vowed to name justices who would overrule Roe. All three of his appointees were in the majority in the 6-to-3 ruling. https://t.co/QMcMKpWFxC","date":"Fri Jun 24 15:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Chief Justice John Roberts joined the Supreme Court's conservative majority in the decision overruling Roe v. Wade. The court’s three liberal members dissented. https://t.co/QdssdvcjXC https://t.co/g1K9LicrWb","date":"Fri Jun 24 14:54:59 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"We took a look at the current state of abortion in the U.S. Most abortions occur in the first trimester. Though some women have more than one abortion in their lifetime, the typical abortion patient has never had one before. https://t.co/usvFnC8Cpm https://t.co/AVIBYxJctZ","date":"Fri Jun 24 14:45:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Supreme Court overruled Roe v. Wade, eliminating the constitutional right to abortion in a decision that will lead to all but total bans on the procedure in about half of the U.S. Chief Justice John Roberts voted with the majority. https://t.co/KiIUF7WKC1 https://t.co/XfZ2HqIFZ2","date":"Fri Jun 24 14:30:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Supreme Court overturned Roe v. Wade, eliminating the constitutional right to abortion after almost 50 years in a decision that will transform American life. https://t.co/bqkMP7tfby","date":"Fri Jun 24 14:17:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Ukrainian guerrilla fighters claimed to have killed a Kremlin-backed politician in the Russian-controlled region of Kherson.\n\nThe politician was blown up in his car, Ukrainian and Russian officials said.\nhttps://t.co/6hPXg3po4p","date":"Fri Jun 24 14:10:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"New Yorkers who live in rent-stabilized apartments will soon pay higher rents — 3.25% more on one-year leases and 5% more on two-year leases.\n\nHere’s what to know about the sharpest increase in nearly a decade.\nhttps://t.co/ImeA8Vx6vS","date":"Fri Jun 24 14:01:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Relief efforts intensified on Friday to aid victims of the earthquake that struck southeastern Afghanistan this week.\n\nLarge numbers of people are missing, and aid agencies expect the death toll in the hard-to-reach region to rise.\nhttps://t.co/DCnr82mPLj","date":"Fri Jun 24 13:35:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Chaotic stock markets, high interest rates and the pain of inflation have many people asking if the U.S. is in a recession.\n\nHere’s what to know about recessions and why some people are talking about the next one now.\nhttps://t.co/abi00rlguh","date":"Fri Jun 24 13:31:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Leaders of countries in the Commonwealth, a 54-nation organization born out of the embers of the British Empire, gathered in Rwanda to discuss the issues facing their nations. Rwanda’s human rights record was conspicuously missing from the agenda.\nhttps://t.co/dJ7O9fotc0","date":"Fri Jun 24 13:15:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"At least half a dozen Republican members of Congress sought pre-emptive pardons from Donald Trump as he fought to remain in office after his defeat in the 2020 election, witnesses have told the House Jan. 6 committee, the panel disclosed on Thursday. https://t.co/rqpIXqvfvK","date":"Fri Jun 24 13:05:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"China and India are emerging as pivotal financiers for Moscow by purchasing large amounts of Russian crude. Undercutting European and American efforts to isolate Russia after its invasion of Ukraine risks serious diplomatic fallout.\nhttps://t.co/t72Ij3Oqze","date":"Fri Jun 24 13:00:21 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The U.S. on Friday complied with a court order and released a former Afghan militiaman from detention in Guantánamo Bay. Assadullah Haroon Gul, who was held for 15 years at the military prison, was handed over to the Taliban government of Afghanistan.\nhttps://t.co/OJvE0gYPE1","date":"Fri Jun 24 12:45:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Want to know why you played so well — or so badly — in Wordle 370? Meet WordleBot, your daily wordle companion that will tell you how efficient and lucky you were — and it could help improve your results. https://t.co/pJXg1sBtVA https://t.co/jTS7hoLUYS","date":"Fri Jun 24 12:33:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“I lost everything, my whole world, my whole family, I don’t have any hope for the future.”\n\nSurvivors of the Afghanistan earthquake told New York Times reporters harrowing tales of death and destruction.\nhttps://t.co/OF8fvgk6en","date":"Fri Jun 24 12:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The 215-pound snake was the largest Burmese python ever found in Florida, breaking a record set by the invasive species in 2016 at 140 pounds, according to the Conservancy of Southwest Florida. https://t.co/CJmvohpo5K https://t.co/oaEuCM4czY","date":"Fri Jun 24 12:01:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Questions are being asked about the tests that often sit at the heart of admissions to the top schools in the U.S.\n\nWho do they benefit and who do they exclude? Listen to today’s episode of The Daily.\nhttps://t.co/KNmYRQ7ICE","date":"Fri Jun 24 11:44:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Myanmar’s ousted civilian leader, Daw Aung San Suu Kyi, has been transferred from house arrest to prison and is being held in solitary confinement, according to a spokesman for the military junta that seized power last year.\nhttps://t.co/6JdWDzVvaD","date":"Fri Jun 24 11:28:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here are 5 takeaways from Thursday’s hearing by the Jan. 6 committee. https://t.co/7COuCPxa4h","date":"Fri Jun 24 11:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"South Asia is used to downpours, and occasional floods, during monsoon season. But this year, the rains have been extreme, especially in Bangladesh, a harsh reminder that climate change is bringing more extreme weather around the world.\nhttps://t.co/mBfhdmfftR","date":"Fri Jun 24 10:32:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A mural of George Washington had been on display at a San Francisco high school since the 1930s. But a recent push to remove it set off a debate across the U.S.\n\nNow, the school board has voted to keep it. https://t.co/1pBSixAy5Y","date":"Fri Jun 24 10:00:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"Every afternoon at a park outside a distinctively Stalinesque skyscraper in central Warsaw, scores of Ukrainian teenagers come together,\" Jeffrey Gettleman writes. \"They are young refugees, trying to cope.\"\nhttps://t.co/ua0VdgROzG","date":"Fri Jun 24 09:31:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Ukrainian forces will withdraw from the key eastern city of Sievierodonetsk, an official said, after weeks of fighting and Russian bombardment.\nhttps://t.co/BSevT3ONxY","date":"Fri Jun 24 09:04:23 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Conservatives lost two parliamentary seats in the U.K., adding to the pressure on Prime Minister Boris Johnson after a series of scandals. https://t.co/kEl6MrI2HD","date":"Fri Jun 24 09:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The arrival of Australia’s new government has set the stage for ministerial talks with China and overtures for easing tensions. But plenty still divides the two nations.\nhttps://t.co/zuikfSLRKe","date":"Fri Jun 24 08:27:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here's a look at some of the highlights worth watching from late-night TV. https://t.co/zOW8PdZwaN","date":"Fri Jun 24 08:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The EU \"is expanding as a liberal empire of the 21st century\" while \"Russia’s influence is shrinking as a result of it being an empire,\" Ukraine’s foreign minister said as his country was granted the coveted status as a candidate to join the bloc. https://t.co/76vtpmtTS4","date":"Fri Jun 24 07:00:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Erriyon Knighton, 18 years old and just out of high school, has already lowered Usain Bolt's world junior sprinting record in the 200 meters. \"It's almost like he's a pogo stick,\" Knighton's coach said. https://t.co/mrXaA189Y7","date":"Fri Jun 24 06:00:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A 7-Eleven owner in Japan defied corporate edicts by closing his store for a few hours every night. A judge ordered him to hand over the store and pay company damages. His fight has become a rallying point for convenience store owners across the country. https://t.co/twRHFXIcur","date":"Fri Jun 24 05:20:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Senate passed a bipartisan measure aimed at gun safety, breaking a stalemate over legislation to address rampant violence in the U.S. \n\nFifteen Republican senators broke with their party to vote in favor of the bill. https://t.co/h8BwugTLxs","date":"Fri Jun 24 05:00:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Conservatives lost two parliamentary seats in the U.K., adding to the pressure on Prime Minister Boris Johnson after a series of scandals. https://t.co/8vVEljgOZ5","date":"Fri Jun 24 04:37:55 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"An 1898 film of Mardi Gras, rediscovered after decades of searching, is believed to be the oldest footage of New Orleans. The film shows traditions both familiar and obscure.\nhttps://t.co/KFrXzdiuuk","date":"Fri Jun 24 04:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A prescribed burn that got out of control destroyed hundreds of homes across northern New Mexico, becoming one of the U.S. Forest Service’s most destructive mistakes in decades. https://t.co/h7EmhDXpJT","date":"Fri Jun 24 03:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Paul Pelosi, the husband of House Speaker Nancy Pelosi, has been charged with a DUI in connection with a car crash in Napa County, California, in May, the Napa County District Attorney’s Office said Thursday.\nhttps://t.co/mJ472biGH9","date":"Fri Jun 24 03:30:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"At least half a dozen Republican members of Congress sought pre-emptive pardons from Donald Trump as he fought to remain in office after his defeat in the 2020 election, witnesses have told the House Jan. 6 committee, the panel disclosed on Thursday. https://t.co/aCBeDwrnXm","date":"Fri Jun 24 03:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Senate passed a bipartisan gun safety bill 65 to 33, with 15 Republicans supporting the measure, breaking nearly three decades of inaction on substantial gun legislation. https://t.co/DHPzpbWexe https://t.co/RsndCtan4W","date":"Fri Jun 24 02:55:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Senate has passed a bipartisan gun safety bill, breaking nearly three decades of inaction on substantial gun legislation. https://t.co/lwMUf8tSwR","date":"Fri Jun 24 02:30:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here are 5 takeaways from Thursday’s hearing by the Jan. 6 committee. https://t.co/vPhsPE9niv","date":"Fri Jun 24 02:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“A Transparent Musical,” with music and lyrics by Faith Soloway, will have its world premiere in May 2023 at Mark Taper Forum in Los Angeles. https://t.co/j96NPS3VDe","date":"Fri Jun 24 01:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The European Union officially made Ukraine a candidate for membership on Thursday. The decision sends a powerful message of solidarity to Kyiv and a rebuke to Vladimir Putin, who has worked for years to keep Ukraine from building Western ties. https://t.co/U8Jy1iH1Cy","date":"Fri Jun 24 01:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The 215-pound snake was the largest Burmese python ever found in Florida, breaking a record set by the invasive species in 2016 at 140 pounds, according to the Conservancy of Southwest Florida. https://t.co/tOzb5Gc3WL","date":"Fri Jun 24 00:35:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Orlando Magic selected Paolo Banchero, a power forward from Duke University, with the No. 1 overall pick in the NBA draft. https://t.co/tvaHQc4b5E","date":"Fri Jun 24 00:18:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As debate rages on a plan to renovate Penn Station in New York City, Amtrak awarded a contract to design a $12 billion expansion that would add train capacity — and might replace an entire block of Midtown. https://t.co/rXeH7sIasV","date":"Thu Jun 23 23:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gov. Kathy Hochul of New York said her team was preparing legislation to counteract a Supreme Court ruling that struck down the state’s law restricting the carrying of handguns. Mayor Eric Adams of New York City pledged to work to limit the ruling’s impact.https://t.co/fQBO2kZP1n https://t.co/1tHgXYRSU8","date":"Thu Jun 23 23:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Jan. 6 committee hearing recap: The panel showed evidence of how Donald Trump tried repeatedly to use the Justice Department to help him overturn the 2020 election. https://t.co/FwWNo90GhJ","date":"Thu Jun 23 22:40:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A White House lawyer told Jeffrey Clark, a former Justice Department official who wanted to push forward with a plan by Donald Trump to subvert the 2020 election results, that he would be committing a felony if he did so, the Jan. 6 committee revealed. https://t.co/uePBQyCCoe","date":"Thu Jun 23 22:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"If you would like to send in a written question or ask one live during the conversation, please send a DM to \n@nytimesevents. https://t.co/oAC4B2FeD9","date":"Thu Jun 23 21:31:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court struck down New York's limits on carrying guns in public. Join @jessemckinley, @AshleyAtTimes and @Jonesieman to discuss what's next with @SenKennedy, @SenSeanRyan and Corey Stoughton of @LegalAidNYC. Join us now: https://t.co/fTVz9zUruo","date":"Thu Jun 23 21:31:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A New York Times investigation found dozens of websites that mimic the look and feel of abortion provider sites, and traced them to a Texas nonprofit quietly orchestrating a national effort to end abortion — one woman at a time. https://t.co/amoADTDy1w","date":"Thu Jun 23 21:20:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Representative Mo Brooks, stinging from his resounding defeat in Alabama’s Republican runoff for the Senate on Tuesday and a snub from Donald Trump, now appears to be willing to testify as part of the Jan. 6 investigation under certain conditions. https://t.co/VZZHonYGoD","date":"Thu Jun 23 21:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In the U.S., the annual number of firearms manufactured has nearly tripled since 2000 and spiked sharply in the past three years, according to a federal tally of gun commerce. https://t.co/tASoIaDaUx","date":"Thu Jun 23 21:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A new slate of left-leaning candidates in New York are challenging Democratic incumbents in the June 28 primary. https://t.co/GeVTLLTgwD","date":"Thu Jun 23 20:40:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Join The New York Times on June 27 for a conversation with Rep. Jamie Raskin, a member of the House Select Committee investigating the roots of the Jan. 6 attack, about what the hearings have accomplished so far. https://t.co/FQyJ3lVWkS","date":"Thu Jun 23 20:20:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"If you would like to send in a written question or ask one live during the conversation, please send a DM to @nytimesevents. https://t.co/uzCqxSlldo","date":"Thu Jun 23 20:16:49 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court has struck down New York's limits on carrying guns in public. Join @jessemckinley, @AshleyAtTimes and @Jonesieman to discuss the ruling and what's next with @SenKennedy, @SenSeanRyan and @CoreyStoughton. DM questions to @nytimesevents. https://t.co/fTVz9Ac2lW","date":"Thu Jun 23 20:16:48 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"We pieced together the narrative of Donald Trump’s monthslong campaign to subvert American democracy and cling to power. Revisit the full timeline as the House Jan. 6 committee continues its fifth day of hearings. https://t.co/aMF33bw51Z","date":"Thu Jun 23 20:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan. 6 committee’s fifth hearing on Thursday will focus on Donald Trump’s efforts to corrupt the Justice Department and bend it to his scheme to overturn the results of the 2020 election. Here's a timeline of his campaign's efforts to do so. https://t.co/2VxyOtsEen","date":"Thu Jun 23 20:00:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Pope Francis is scheduled to visit Canada next month to apologize for the Roman Catholic church’s role in a residential school system for Indigenous children that eroded their culture and subjected many to sexual and physical abuse. https://t.co/CxsFPIsdjy","date":"Thu Jun 23 19:40:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Representative Liz Cheney, a Republican of Wyoming, is urging Democrats in her home state to switch parties to support her in the Aug. 16 primary as her polling remains far behind her Trump-endorsed challenger. https://t.co/kIUE3ojcLZ","date":"Thu Jun 23 19:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: At the fifth hearing held by the Jan. 6 committee, lawmakers plan to present new evidence on how Donald Trump tried to manipulate the Justice Department to help him cling to power after he lost the 2020 election. Follow our live analysis. https://t.co/ZF6JTsONU9","date":"Thu Jun 23 19:07:30 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court’s decision to strike down New York State’s concealed carry gun law was “appalling,” and “just not rooted in reality,” Mayor Eric Adams said Thursday. “This decision has made every single one of us less safe from gun violence,” he said. https://t.co/l4f3JNdHnQ","date":"Thu Jun 23 19:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: European leaders granted Ukraine EU candidate status, a historic decision that begins a yearslong process of becoming a member. https://t.co/eeiv2TfD8E","date":"Thu Jun 23 18:51:28 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Netflix laid off 300 people on Thursday, the second consecutive month that the streaming giant has cut staff as it confronts declining subscriber growth and a falling share price. https://t.co/PqiOpM29g9","date":"Thu Jun 23 18:50:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Los productos con cannabis de la actualidad, que tienen niveles de THC cercanos al 100%, están envenenando a muchos consumidores frecuentes, entre ellos los adolescentes, dicen los expertos. https://t.co/G9Xaeb15Au","date":"Thu Jun 23 18:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Communal bathrooms can harbor plenty of germs, but simple precautions can help keep them at bay.\n\nNew York Times readers shared their tips and experiences with public restrooms. https://t.co/1bfDLhrVgk https://t.co/U107Um9JAF","date":"Thu Jun 23 18:20:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Everleigh McCarthy was less than 2 weeks old when she died at a Boston hospital. Then her parents were told the hospital lost her body. Police said it \"was probably mistaken as soiled linen\" and discarded. \"It's like she died all over again,\" her mom said. https://t.co/jvL287eT7B","date":"Thu Jun 23 18:12:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden's top aides are weighing a ban on new oil and gas drilling off U.S. coasts. The move would elate climate activists but could leave the administration vulnerable to GOP accusations that it's exacerbating an energy crunch as gas prices soar. https://t.co/0Ve28W20Ef","date":"Thu Jun 23 18:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A new poll of likely Republican primary voters in New Hampshire signals weakening support for Donald Trump as the party's presidential nominee in 2024 — and growing strength for Gov. Ron DeSantis of Florida. https://t.co/hr9mWlvQ3h","date":"Thu Jun 23 17:47:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Trumpet, a magnificently be-wrinkled and be-jowled bloodhound from Illinois, won Best in Show at the Westminster Kennel Club Dog Show on Wednesday night. He is the first bloodhound to win. https://t.co/JDvl4Qhtbr https://t.co/grk7mpg7My","date":"Thu Jun 23 17:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court's reluctance to hear Second Amendment cases changed as its membership shifted to the right in recent years. The court's conservative bloc voted on Thursday to overturn a century-old New York law restricting the carrying of handguns. https://t.co/FjVGDHuB0h https://t.co/i5nXE34kmu","date":"Thu Jun 23 17:38:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Federal investigators searched the home of Jeffrey Clark, a former Justice Department official in the Trump administration, as part of the inquiry into efforts to overturn the 2020 election. https://t.co/dFEsF20H0Y","date":"Thu Jun 23 17:24:34 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Erriyon Knighton, 18 years old and just out of high school, has already lowered Usain Bolt's world junior sprinting record in the 200 meters. \"It's almost like he's a pogo stick,\" Knighton's coach said. https://t.co/PMrjebyXi2","date":"Thu Jun 23 17:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Senate moved closer to approving a bipartisan gun safety bill, as a small group of Republicans joined Democrats in a crucial test vote. https://t.co/dVZOVhD7yP","date":"Thu Jun 23 17:02:22 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Andrea Prudente developed potentially life-threatening pregnancy complications while in Malta, where abortion is illegal. Unless she can leave, her only option is to wait for the fetus to die — and hope the pregnancy does not kill her in the meantime. https://t.co/SclGgoQb1j","date":"Thu Jun 23 17:00:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Ohio State University has received a trademark for one of the most common words in the English language, one that the school’s supporters often forcefully emphasize when uttering its name: \"The.\" https://t.co/Sm2Tsv3O5h https://t.co/N4vC6XsmbO","date":"Thu Jun 23 16:57:00 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A 5.9-magnitude earthquake in Afghanistan’s remote southeast near the Pakistan border is believed to have killed more than 1,000 people. It was the deadliest quake in the country in two decades. Entire villages were believed to have been nearly wiped out. https://t.co/t0reWqKHI0 https://t.co/r41fkQPYZm","date":"Thu Jun 23 16:51:46 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A single button could have saved more lives in the Surfside, Florida, condo collapse last year. But a security guard wasn’t trained to use the alarm system. https://t.co/uIXWfxy3sA","date":"Thu Jun 23 16:40:42 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Biden administration is throwing out the narrowed definition of \"habitat\" for endangered animals, returning to an understanding that existed before the Trump administration shrank the areas that could be protected for animals threatened by extinction. https://t.co/EksQk9xut6","date":"Thu Jun 23 16:20:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"New York officials and law enforcement are preparing for a new legal regime after the Supreme Court struck down a law limiting handgun carrying. Gov. Kathy Hochul called the ruling \"absolutely shocking\" and said she already had language for new measures. https://t.co/0aD5FWlAtT","date":"Thu Jun 23 16:08:54 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The U.S. will cancel $6 billion in student loans for 200,000 people who attended for-profit colleges and other schools accused of fraud. https://t.co/6lGrPSJvbe","date":"Thu Jun 23 16:02:30 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A 7-Eleven owner in Japan defied corporate edicts by closing his store for a few hours every night. A judge ordered him to hand over the store and pay company damages. His fight has become a rallying point for convenience store owners across the country. https://t.co/LGWYFAfgEP","date":"Thu Jun 23 16:00:19 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court on Thursday ruled 6-3 on overturning a New York law limiting the carrying of guns in public, with the three liberal justices in dissent.\n\nSee how the court's members voted on other major decisions this year. https://t.co/HLclRY35HH","date":"Thu Jun 23 15:54:52 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Maybe you just graduated from college and are on your own for the first time, or perhaps you never quite got the hang of cooking. This small but mighty collection of recipes is for absolute beginners. https://t.co/M5sx87Gets https://t.co/b709jqdsXr","date":"Thu Jun 23 15:30:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Biden administration has proposed new rules that would bar discrimination against transgender students under Title IX and cement their rights into law. https://t.co/AljktNpGuc","date":"Thu Jun 23 15:26:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The FDA ordered Juul to stop selling e-cigarettes in the U.S., a big setback to the brand blamed for the teen vaping crisis. https://t.co/YkyMalicqG","date":"Thu Jun 23 15:02:32 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With THC levels close to 100%, today’s cannabis products are poisoning some heavy users, including teenagers, experts say.  https://t.co/QJKSLTSGzb","date":"Thu Jun 23 15:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Supreme Court overturned a New York law limiting guns in public, a ruling with major implications on laws restricting guns outside the home. https://t.co/BeXW6AcpOP","date":"Thu Jun 23 14:47:33 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Safeguarding elections is no longer Mark Zuckerberg’s top concern, four of his employees said.\n\nThe Meta CEO once called securing elections “the most important thing,” but has now shifted focus to the metaverse. That may have real-world implications. https://t.co/9x6VyKQinx","date":"Thu Jun 23 14:46:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Countries across Europe have been rapidly pumping fuel into their natural gas storage tanks, hoping to fill them in time for the winter.\n\nThe usual summer routine has taken on new urgency since Russia reduced the flow of gas after its invasion of Ukraine.\nhttps://t.co/DsjRWhQj3z","date":"Thu Jun 23 14:29:01 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"It's hot out there. Again.\n\nMuch of the U.S. is now in the third consecutive week of unrelenting heat. Minneapolis, Nashville and Charlotte, North Carolina, all reached 101 degrees Fahrenheit this week, breaking previous records. https://t.co/9HW5dmPDOz","date":"Thu Jun 23 14:28:30 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Shakhtar Donetsk, one of Ukraine’s top soccer clubs, rushed to evacuate its youth team as Russia invaded.\n\nAfter months of separation from their families and homes, the loneliness and uncertainty have taken their toll on the boys.\nhttps://t.co/D6Z6yKIuR3","date":"Thu Jun 23 14:15:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As the American artistic swimmer Anita Alvarez fainted and sank toward the bottom of the pool at the world championships, her coach Andrea Fuentes made a split-second decision: She dove in to save her.\n\nAlvarez is doing \"fine\" now, her coach said. https://t.co/ptsESwZoIw","date":"Thu Jun 23 14:05:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“Everyone here cried from night to morning.”\n\nZakiullah Atal, a religious scholar, was asleep when an earthquake hit Afghanistan on Wednesday. His 1-year-old son, Osman, was killed, along with his brother and sister-in-law and three of their children.\nhttps://t.co/I61gN7FvlZ","date":"Thu Jun 23 14:01:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Hundreds of thousands of people have been displaced by extreme flooding in China. \n\nWater levels in more than a hundred rivers have surged past flood warning levels, state-run media said, and record-high heat in some provinces is causing roads to buckle. https://t.co/eAx2r8tD9B","date":"Thu Jun 23 13:50:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A lawsuit, about how far the Environmental Protection Agency can regulate greenhouse gas emissions from power plants, could affect the way the entire U.S. government makes climate rules. Listen to today's episode of The Daily. https://t.co/NF6ebadlrr","date":"Thu Jun 23 13:45:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Germany triggered the second stage of its three-step emergency gas plan, warning that the country is in a crisis that could worsen in coming months.\n\n“Even if you don’t feel it yet: We are in a gas crisis,” Germany’s economy minister said.\nhttps://t.co/YnKCM3r0oM","date":"Thu Jun 23 13:39:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"This is my Super Bowl,\" a news anchor said off camera during the public hearings held by the House committee investigating Jan. 6.\n\nThis is one photographer’s account of the commotion surrounding the biggest investigation in Washington since Watergate. https://t.co/SpZWHjJiMb https://t.co/HZHFy298bF","date":"Thu Jun 23 13:30:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Dr. Deborah Birx, Donald Trump’s Covid coordinator, told congressional investigators that Trump White House officials asked her to change or delete parts of guidance to states, in what she called an effort to stifle information as cases surged in 2020.\nhttps://t.co/SUMZIDWPfC","date":"Thu Jun 23 13:20:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"By the time summer arrives, California has typically gone months without rain, and warm weather has left vegetation bone-dry. So the fires that erupt then tend to burn hotter and faster — and are harder to control. https://t.co/swX6BnSjaL","date":"Thu Jun 23 13:20:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Mayor Eric Adams of New York City has not enforced the city’s Covid vaccine mandate for employees at private businesses, and has no plans to begin inspecting businesses or begin fining those that are not in compliance, his office said. https://t.co/xSzHmkmg2F","date":"Thu Jun 23 13:10:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"An 1898 film of Mardi Gras, rediscovered after decades of searching, is believed to be the oldest footage of New Orleans. The film shows traditions both familiar and obscure.\nhttps://t.co/DhnWsM3Zcc","date":"Thu Jun 23 13:05:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"News Analysis: Those closest to Donald Trump have been deposed, portrayed or shown dismissing his false claims that the 2020 election was stolen. And yet the fight to thwart the will of the people continued unabated, Shane Goldmacher writes. https://t.co/HSVmKicqv7","date":"Thu Jun 23 13:00:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court on Thursday is set to issue opinions in one or more cases from its current term. Here are the court's major decisions in 2022 so far, and which ones are yet to come. https://t.co/FVpZAjZ3hP","date":"Thu Jun 23 12:50:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Federal prosecutors asked a judge to sentence Ghislaine Maxwell to at least 30 years in prison for helping Jeffrey Epstein abuse girls. https://t.co/ruHbt1FDJO","date":"Thu Jun 23 12:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Want to know why you played so well — or so badly — in Wordle 369? Meet WordleBot, your daily wordle companion that will tell you how efficient and lucky you were — and it could help improve your results. https://t.co/MoQoTtM1kT https://t.co/00mEQcNCzM","date":"Thu Jun 23 12:29:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan 6. committee’s public hearings, with their clear, uninterrupted narratives about Donald Trump’s effort to undercut the peaceful transfer of power, have left some pro-Trump Republicans regretting a decision to boycott the panel.\nhttps://t.co/H0mPWZ1WRA","date":"Thu Jun 23 12:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The House committee investigating the Jan. 6 attack plans to unveil new evidence about how Donald Trump tried to manipulate the Justice Department to help him cling to power after he lost the 2020 election, aides said. https://t.co/XXlYkiHB3p","date":"Thu Jun 23 12:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With their perky ears, their please-pick-me-up-and-cradle-me gaze and their short-legged waddle, French bulldogs have become the second-most-popular dog breed in the U.S.\n\nThey are also being violently stolen from their owners with alarming frequency. https://t.co/RvEqLXO6We https://t.co/iRUDkNv5wb","date":"Thu Jun 23 12:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rupert Murdoch and Jerry Hall are said to be getting divorced. Murdoch’s fourth divorce is unlikely to change the ownership structure of his empire, but it could reverberate through companies such as Fox News and The Wall Street Journal. https://t.co/O4LmCtJ5JO","date":"Thu Jun 23 11:45:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Trumpet the bloodhound: Best in Show. 🎺\n\nHe competed in his first dog show in January — and on Wednesday he became the first of his breed to win the Westminster Dog Show. https://t.co/PUwLEWA8pz https://t.co/uyvp62HXQn","date":"Thu Jun 23 11:30:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Desperate rescue efforts are underway in a remote part of southeastern Afghanistan where an earthquake killed more than 1,000 people, according to officials, with the toll expected to climb as rescuers dig through the rubble.\n\nFollow our updates.\nhttps://t.co/efyb3wwyoq https://t.co/fdGB10Ea9M","date":"Thu Jun 23 11:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A convicted serial killer and rapist, Richard Cottingham, was charged with the 1968 murder of Diane Cusick. DNA evidence linking Cottingham to the killing prompted prosecutors to review 13 years of unsolved murders of women. https://t.co/Ssx1JYagR1","date":"Thu Jun 23 11:00:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As the American artistic swimmer Anita Alvarez fainted and sank toward the bottom of the pool at the world championships, her coach Andrea Fuentes made a split-second decision: She dove in to save her.\n\nAlvarez is doing \"fine\" now, her coach said. https://t.co/w5b9w4t1Iz https://t.co/msOBUa3PY7","date":"Thu Jun 23 10:45:41 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Members of Russia's elite fled their country after the invasion of Ukraine. But others who had close ties to the West stayed behind, struggling to redefine their lives.\n\nTheir choices do not add up to a broad challenge to Vladimir Putin’s war. https://t.co/deZLRNDRgu","date":"Thu Jun 23 10:28:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Thousands of refugees from Ukraine have been sent to so-called filtration camps, where they have been interrogated and then forced to resettle in Russia. Some Ukrainians escaped to Estonia. They told us their stories. https://t.co/hdSAOJUOdw https://t.co/DROTq6Ajr5","date":"Thu Jun 23 10:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"EU leaders will meet on Thursday to put Ukraine on a path toward joining the bloc. Their approval would allow Ukraine to be a candidate to become a member, starting what could be a long road to fully join. https://t.co/c6AoU58XNc","date":"Thu Jun 23 09:28:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As it did with pineapples last year, Beijing has banned imports of lucrative grouper from Taiwan, a move the island calls politically motivated. https://t.co/769QMz23l8","date":"Thu Jun 23 09:15:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The U.S. and the UN took steps toward helping Afghanistan in the wake of the earthquake on Wednesday, as aid groups and the Taliban called for urgent assistance.\n\nFollow our live updates. https://t.co/TD3mlJBnkm","date":"Thu Jun 23 09:00:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here's a look at some of the highlights worth watching from late-night TV. https://t.co/OkJje3pTqN","date":"Thu Jun 23 08:28:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The band Muna is on the verge of breaking out of its cult following and bringing its anthems about queer joy to a wider audience. Their new label, Saddest Factory Records, is run by Phoebe Bridgers. https://t.co/cJTnauzywp","date":"Thu Jun 23 08:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russian soldiers who control a giant nuclear power plant in Ukraine are detaining workers and subjecting them to brutal interrogations in a search for possible saboteurs, Ukrainian officials said. \n\nFollow our live updates. https://t.co/hwo5pn4e9n","date":"Thu Jun 23 07:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Hundreds of thousands of people have been displaced by extreme flooding in China. \n\nWater levels in more than a hundred rivers have surged past flood warning levels, state-run media said, and record-high heat in some provinces is causing roads to buckle. https://t.co/AhqAq4mHNr https://t.co/YXFpZrNgAT","date":"Thu Jun 23 07:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A generation of young men in Libya have grown up knowing little but war. More than 40 of them — mostly veterans of Libya’s conflicts — now act at the National Theater in Misurata. They hope to bring entertainment, they say, and some semblance of normalcy. https://t.co/yomOCp902b","date":"Thu Jun 23 06:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Families whose relatives have been abducted or imprisoned by North Korea are seeking to hold the country financially accountable despite the long odds of collecting money from the isolated nation. https://t.co/o1W6eLtYfZ","date":"Thu Jun 23 05:40:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Federal prosecutors asked a judge to sentence Ghislaine Maxwell to at least 30 years in prison for helping Jeffrey Epstein abuse girls. https://t.co/RpvwrlGH9w","date":"Thu Jun 23 04:46:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"🎺 Trumpet the bloodhound has made history. 🎺\n\nHe competed in his first dog show in January — and now he's the first of his breed to become the Westminster Dog Show champion. https://t.co/wzF9xetUYz https://t.co/Pg40cQW7X4","date":"Thu Jun 23 04:39:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Andrew Gillum, the Democrat who lost the 2018 Florida governor’s race, was charged with conspiracy and 19 counts of fraud stemming from his time as Tallahassee mayor and gubernatorial candidate. https://t.co/NecYjdnllv","date":"Thu Jun 23 04:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Trumpet, a bloodhound, won Best in Show at the Westminster Dog Show. \n\nGet a recap of the action and see photos of all the very good dogs from the competition. https://t.co/X018uoZxzD https://t.co/STXHSFmTyp","date":"Thu Jun 23 03:41:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"El jefe de la policía estatal de Texas calificó la respuesta de la policía al tiroteo de Uvalde como “un fracaso abyecto” que contravenía décadas de entrenamiento. Dijo que los agentes perdieron tiempo buscando una llave que “nunca fue necesaria” https://t.co/0zULmNnXDm","date":"Thu Jun 23 03:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The earthquake that killed more than 1,000 people in Afghanistan was the deadliest one there in two decades — striking another blow to a country that has grappled with a dire humanitarian and economic crisis since the Taliban takeover in August.\nhttps://t.co/blvZ8rRcqj","date":"Thu Jun 23 03:10:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Our latest literary travel guide is focused on Stockholm. To explore the Swedish capital, we asked the nation's best-selling author, Lars Kepler (the pen name of a husband-and-wife team) to recommend books that take readers to the soul of the city. https://t.co/aktFyn2CVF","date":"Thu Jun 23 03:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The owner of seven nursing homes in Louisiana who sent more than 800 residents to a squalid warehouse last year when Hurricane Ida battered the region was arrested on Wednesday on state fraud and cruelty charges, the authorities said. https://t.co/dJQGYr20Jz","date":"Thu Jun 23 02:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Roller skating is having another flash of popularity, but the DiscOasis sets itself apart from New York’s other rinks and pop-up events through its production value, theatricality and pedigree. https://t.co/Fmg2Dh7YzM","date":"Thu Jun 23 02:10:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Six people were killed in a helicopter crash on Wednesday evening in Logan County, West Virginia, according to the deputy director of the county’s Office of Emergency Management. https://t.co/atOKIWcW76","date":"Thu Jun 23 02:05:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"For generations, America’s major publishers focused almost entirely on white readers. Now a new cadre of executives like Lisa Lucas is trying to open up the industry. https://t.co/uyaAaN1W6l","date":"Thu Jun 23 01:40:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The New York Times, which still uses honorifics like “Mr.” and “Ms.” in its articles, once referred to show dogs with the courtesy title “Ch.” – short for “champion.” \n\nMore live updates from the 2022 Westminster Dog Show: https://t.co/1pwFEndkXb https://t.co/RkoBIN0SWs","date":"Thu Jun 23 01:30:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As fuel prices soar in the U.S., President Biden called on Congress to temporarily lift the federal gas tax — about 18 cents per gallon of gasoline and 24 cents per gallon of diesel — through the end of September.\nhttps://t.co/KZhZYt3Vav https://t.co/ZWwWV6tNPD","date":"Thu Jun 23 01:10:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The New York City novel has become its own literary category, one that @tmagazine explored for this project, which compiles what they’ve deemed to be the 25 most influential New York novels published between 1921 and 2021. https://t.co/iK1d1gPUia","date":"Thu Jun 23 01:00:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"From San Bernardino, California, to Orlando, Florida, permanent memorials across the U.S. honor those killed in gun violence, and survivors. \"We didn’t want a place of sorrow, but of light,\" said a landscape architect. https://t.co/aIetVXqnwo","date":"Thu Jun 23 00:40:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Our reporters are providing live coverage of the Westminster Kennel Club Dog Show tonight, with commentary, analysis and photos. \n\nFollow along here for updates: https://t.co/OuqwGlcmnY https://t.co/6mLwVMjhSM","date":"Thu Jun 23 00:30:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Senate on Tuesday agreed to take up a compromise bill on gun violence that, if passed, would become the most significant overhaul of U.S. gun laws in decades. https://t.co/Xn8mL4lP77 https://t.co/ikYnaPMe7W","date":"Thu Jun 23 00:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The quarterback Deshaun Watson reached settlements with 20 of the 24 women who filed sexual misconduct lawsuits against him.\n\nHere’s what we know about the cases against him: https://t.co/R17lSGnTW4","date":"Thu Jun 23 00:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The 2022 Westminster Kennel Club Dog Show is underway, with dogs of all sizes competing for Best in Show. \n\nFollow along for live updates on the action. https://t.co/WQKE6JNO26 https://t.co/Eyq4ySllZR","date":"Wed Jun 22 23:36:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The chief of the school district police force in Uvalde, Texas, was placed on administrative leave after the state’s top police official faulted him for delaying the confrontation with a gunman at Robb Elementary School last month, the school district said.https://t.co/QMnBNaSocb","date":"Wed Jun 22 23:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"The stolen election conspiracy theory has, in effect, become the adhesive holding the dominant Trump wing of the party in lock-step,\" writes @edsall. https://t.co/Ni6aNrNldC","date":"Wed Jun 22 23:10:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Justice Department subpoenaed at least three more people linked to an effort to use fake electors to keep Donald Trump in power. https://t.co/sdbrv6o3bS","date":"Wed Jun 22 23:00:28 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Tony Siragusa, the Super Bowl champion defensive tackle and former football analyst for Fox Sports, has died. He was 55. https://t.co/NSfGEfFYTg","date":"Wed Jun 22 22:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"We recently published our list of 88 books to read this summer, organized by category, from romances to sports. https://t.co/Ew2yJXFX6N","date":"Wed Jun 22 22:30:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Please DM us at @nytimesevents if you would like to submit a written question or book suggestion or would like to discuss your book live during the conversation. https://t.co/dYqyKA3EPW","date":"Wed Jun 22 22:30:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"And here are some new releases that are worth checking out. https://t.co/N84djBChvo","date":"Wed Jun 22 22:30:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"What makes for a great summer book? Join our journalists @heyitsfranklin2, @LizEgan and @sarahlyall for a discussion about summer reading and which books, new and old, to add to your reading list this season. DM your own suggestions to @nytimesevents. https://t.co/MUSDpBAs3f","date":"Wed Jun 22 22:30:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A review of 433 active shooter attacks in the U.S. from 2000 to 2021 reveals that most are over before the police arrive. Bystanders sometimes stop attackers, but seldom shoot them. https://t.co/0420HYFxB4 https://t.co/byZKnapYS5","date":"Wed Jun 22 22:00:20 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The MTA said it would add elevators and ramps to 95% of New York City’s subway stations by 2055 as part of a settlement agreement in two class-action lawsuits over the issue. Currently, just 27% of stations are fully accessible. https://t.co/e24zMQ9uWa","date":"Wed Jun 22 21:45:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Georgia Supreme Court on Wednesday overturned a father’s conviction on murder and other charges, nearly six years after he was found guilty of having deliberately left his toddler son to die in a hot car. https://t.co/50ezvZAhqe","date":"Wed Jun 22 21:20:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"La Piraña, a trailer in the South Bronx serving lechón asado and other Puerto Rican classics, is open only on Saturdays and Sundays. But it packs more joy into two days than most restaurants manage in a full week. \n\nRead the 3-star review by Pete Wells. https://t.co/DFIepX3jcq","date":"Wed Jun 22 21:15:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"One person was dead and another injured after a shooting on a light rail train in San Francisco on Wednesday morning, the authorities said. \"This appears to be an isolated incident,\" Officer Kathryn Winters said, adding that no arrests had been made. https://t.co/CF8myCZ8Nw","date":"Wed Jun 22 21:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Russian soprano Anna Netrebko is opera’s biggest star. But her career is in disarray because of her ties to President Vladimir Putin, and arts companies around the world are divided on whether to welcome her back. https://t.co/bHfJQ8tFjX","date":"Wed Jun 22 21:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In the week since a federal judge granted New York City at least another six months to reform its troubled jail system, three people who had recently been held at the troubled Rikers Island jail complex have died. https://t.co/XcEOhkKqlK","date":"Wed Jun 22 20:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"After an earthquake in Afghanistan killed at least 1,000 people, aid workers face new challenges delivering humanitarian supplies to the country, which is already struggling with drought and hunger. https://t.co/Iw35bPtzm3","date":"Wed Jun 22 20:30:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"I felt like I’d been punched in the gut. My partner’s annual income is five times what mine is.\"\n\nWhat should you do when your partner lies about his earnings? Read The Ethicist's response: https://t.co/qFSaJEAOXL","date":"Wed Jun 22 20:20:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"Should the primary aim of elite sports be competitive fairness? Or does maintaining integrity mean that inclusiveness is just as important as a level playing field?,\" writes our sports reporter, Jeré Longman, on the debate around transgender athletes. https://t.co/DRehxCSDiZ","date":"Wed Jun 22 20:10:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With supply chain issues leading to a tampon shortage, some women are considering alternatives to disposables, including reusable menstrual cups and period underwear. https://t.co/dx1o1nud48","date":"Wed Jun 22 20:00:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Best in Show will be awarded at the Westminster dog show tonight, ending the run of reigning champion Wasabi the Pekingese. Things are expected to wrap up around 11 p.m. Eastern. \n\nHere's how to watch: https://t.co/tEGSvAYGne","date":"Wed Jun 22 19:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Jaylon Ferguson, a Baltimore Ravens linebacker, died after the authorities found him unresponsive in a Baltimore home late Tuesday, the police said. Ferguson, 26, a Louisiana native, broke the all-time NCAA record for career sacks with 45. https://t.co/5Uysk5vtMw","date":"Wed Jun 22 19:37:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rep. Alexandria Ocasio-Cortez will endorse Ana María Archila for New York's lieutenant governor. Archila, who gained prominence after she confronted a senator over the confirmation of Justice Brett Kavanaugh, would be the first Latina elected statewide. https://t.co/KcmjPg4QZC","date":"Wed Jun 22 19:30:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Biden administration is looking at ways to help Afghanistan after an earthquake killed at least 1,000 people, national security adviser Jake Sullivan said, adding that humanitarian partners were in the process of delivering medical care and supplies. https://t.co/goj54Xl8p3","date":"Wed Jun 22 19:20:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Dozens of groups called on President Biden to strike a deal for the release of Brittney Griner, the WNBA star who has been detained in Russia since February. https://t.co/jxo2JiMVCL","date":"Wed Jun 22 19:05:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rupert Murdoch and Jerry Hall are said to be getting divorced. Murdoch’s fourth divorce is unlikely to change the ownership structure of his empire, but it could reverberate through companies such as Fox News and The Wall Street Journal. https://t.co/cz2tXZseU2","date":"Wed Jun 22 19:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A Manhattan jury found Richard Rojas, a Navy veteran who struck Times Square pedestrians with his car, not responsible because of mental illness. One person was killed and 23 were injured in the 2017 attack. https://t.co/ZK8k8Dx0Q1","date":"Wed Jun 22 18:40:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Andrew Gillum, the Democrat who lost the 2018 Florida governor’s race, was charged with conspiracy and 19 counts of fraud stemming from his time as Tallahassee mayor and gubernatorial candidate. https://t.co/RuUluuqd4E","date":"Wed Jun 22 18:30:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Britain declared a national incident after finding evidence suggesting local spread of poliovirus in London. No cases of polio have been identified so far, but officials urged those who were not fully immunized to seek vaccines immediately. https://t.co/BwaLh50ja4","date":"Wed Jun 22 18:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A New York Times investigation analyzing more than 100,000 government bidding documents found that China's ambition to collect digital and biological data from its citizens is more expansive and invasive than previously known. https://t.co/M2EA3YO9NE https://t.co/WO6DSVgUPm","date":"Wed Jun 22 18:05:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The city of Brooklyn Center, Minnesota, has agreed to pay a $3.2 million settlement to the family of Daunte Wright, a 20-year-old Black man who was fatally shot by a white police officer during a traffic stop in April 2021.\nhttps://t.co/xPASXeNoBd","date":"Wed Jun 22 18:00:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Georgia election workers Shaye Moss and her mother, Ruby Freeman, told the Jan. 6 committee that their lives had been upended by violent threats after being falsely accused of fraud in a conspiracy theory pushed by Donald Trump and Rudy Giuliani. https://t.co/ivOWW9h3KU https://t.co/nJsxG4O1rN","date":"Wed Jun 22 17:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"More than 1,000 people were killed and 1,600 others injured after a 5.9-magnitude earthquake struck a remote and mountainous region of southeastern Afghanistan near the Pakistani border on Wednesday, officials said. Follow updates: https://t.co/HLd7cFOcxu https://t.co/bFXNtHushF","date":"Wed Jun 22 17:40:40 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The recent arrest of Paul Pelosi, Speaker Nancy Pelosi’s husband, in Napa Valley has shone a light on their lavish California life. It has also refocused attention on his troubled driving record, including a crash when he was 16 that left his brother dead. https://t.co/lOwqnUjvcd","date":"Wed Jun 22 17:30:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n\"We tell the improbable story of two men,\" writes Brian Dawson. \"They were political rivals, but rather than wallow in resentment and rage, the two men began talking to each other, and something unusual happened: listening and then friendship.\" https://t.co/zTIeuU9JHb","date":"Wed Jun 22 17:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Sabyasachi Mukherjee is not just the most famous designer in India but also arguably the world’s most influential creator of wedding wear. He has outfitted the biggest Bollywood weddings, including that of Priyanka Chopra and Nick Jonas. https://t.co/AFax0ZKEh6","date":"Wed Jun 22 17:00:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rob Gronkowski announced Tuesday that he was (again) retiring from the NFL. His surname was “the perfect nickname for a 6-foot-6, 265-pound tight end,” @benshpigel writes, “as Gronk joined the lexicon as a noun, verb and, sometimes, even an adjective.” https://t.co/u2ruP2LIB5","date":"Wed Jun 22 16:45:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Brooklyn has put another sky-high rental in its books, with a sprawling duplex being leased for $40,000 a month. The previous tenant was paying $17,500. https://t.co/vw2utU8hhv","date":"Wed Jun 22 16:30:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“It’s direct, indisputable, empirical evidence that this kind of common claim that ‘the only thing that stops a bad guy with the gun is a good guy with the gun’ is wrong,” said an Alabama professor who has studied mass shootings for more than a decade. https://t.co/V4w8UEyqHn","date":"Wed Jun 22 16:15:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A former Alibaba employee accused her manager and a company client of sexually assaulting her after a work dinner last summer. She was fired and her boss was not charged. But now, in the latest development, the client has been found guilty. https://t.co/w0rdR2VgbC","date":"Wed Jun 22 16:00:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"How Often Do Police Stop Active Shooters?\nA review of 433 shootings in the U.S. shows that most are over by the time the police arrive, and bystanders seldom shoot the attacker. https://t.co/qT4CwJLiJh","date":"Wed Jun 22 15:50:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Helicopters were unable to land and families whose homes were destroyed in Afghanistan were exposed to the cold, as wind and heavy rain hampered search and rescue operations after the deadly earthquake, a UN emergency response agency said. https://t.co/OcFZO9wmUX","date":"Wed Jun 22 15:45:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Jerome Powell told lawmakers that the Fed was not trying to “provoke” a recession but said that the central bank would keep raising rates. https://t.co/XjF6N5cf6w","date":"Wed Jun 22 15:36:40 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Who stops a \"bad guy with a gun?\" It's usually not law enforcement. A review of 433 shootings in the U.S. shows that most are over by the time the police arrive. Bystanders sometimes stop attackers, but seldom shoot them. https://t.co/mhNvTuCEa9 https://t.co/LhUMBZxdB5","date":"Wed Jun 22 15:30:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"News Analysis: Finland and Sweden expected to be greeted by NATO as fast-track applicants. Those hopes are quickly fading.\n\n“Finland is especially frustrated, mindful of its 830 miles of border with Russia,” @StevenErlanger writes.\nhttps://t.co/n3veaXEvJW","date":"Wed Jun 22 15:16:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Budae jjigae, or army base stew, is a symbol of resourcefulness and survival during a time of great poverty. It is one of @ericjoonho's 10 essential Korean dishes. https://t.co/mflhuEa2ms https://t.co/T3bBtDwHvb","date":"Wed Jun 22 15:05:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"What makes for a great summer book? Join our journalists @heyitsfranklin2, @LizEgan and @sarahlyall for a discussion about summer reading and what books, new and old, to add to your reading list this season. DM your own suggestions to @nytimesevents. https://t.co/MUSDpBAs3f","date":"Wed Jun 22 14:55:49 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"More than 1,000 people were killed and 1,600 others injured after a 5.9-magnitude earthquake struck a remote and mountainous region of southeastern Afghanistan near the border with Pakistan early Wednesday, officials said.\n\nFollow live coverage: https://t.co/iiSzbWKyYS https://t.co/3WSd6O002Q","date":"Wed Jun 22 14:45:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Washington Commanders owner Daniel Snyder led a campaign against women who alleged widespread sexual harassment on the NFL team, a House panel found. https://t.co/TVsgerteIB","date":"Wed Jun 22 14:37:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Ukrainian port city of Mykolaiv has been pummeled by Russia since the war began. But the city’s resistance has hardened, and it has become a linchpin of Ukrainian defiance on the southern front.\nhttps://t.co/8mBoBnK2ow","date":"Wed Jun 22 14:14:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A review of 433 shootings in the U.S. shows that most are over by the time the police arrive, and bystanders seldom shoot the attacker.\nhttps://t.co/sZwSVPUNP8","date":"Wed Jun 22 13:43:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russia’s blockade of the Black Sea has inflated global grain prices, raised fears of hunger in some countries and drawn widespread condemnation.\n\nIt has also provoked a vexing problem: how to find a new route out for Ukraine’s agricultural exports.\nhttps://t.co/9ZoiyXew8V","date":"Wed Jun 22 13:33:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The head of Texas' state police called the police response to the Uvalde shooting \"an abject failure\" that ran counter to decades of training. He said officers wasted time looking for a classroom door key that was \"never needed.\" https://t.co/InsjmTIDE6","date":"Wed Jun 22 13:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Want to know why you played so well — or so badly — in Wordle 368? Meet WordleBot, your daily wordle companion that will tell you how efficient and lucky you were — and it could help improve your results. https://t.co/KtePVezv37 https://t.co/rW2E5vq9zt","date":"Wed Jun 22 13:01:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Many of Afghanistan’s densely populated towns and cities sit on or near several geological faults. Wednesday’s quake appeared to originate from movement between the India and Eurasia tectonic plates, the U.S. Geological Survey said.\nhttps://t.co/5xxMHTR9XH","date":"Wed Jun 22 12:57:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The earthquake was felt in several parts of Pakistan, especially in the northwest, but the country was spared the kind of damage seen in neighboring Afghanistan, officials said.\nhttps://t.co/K10QpR6YEV","date":"Wed Jun 22 12:46:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"At least 1,000 people were killed and more than 1,500 others injured after a 5.9-magnitude earthquake struck southeastern Afghanistan near the border with Pakistan, the state-run Bakhtar news agency said.\n\nFollow our updates.\nhttps://t.co/sY3xuy0UJ5 https://t.co/RivPrTfHAm","date":"Wed Jun 22 12:44:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A poor harvest of chiles has caused an “unprecedented shortage” of Asian hot sauces, said a California-based firm that produces one of the world's most popular sriracha sauces.\n\n“I only have like three bottles. What am I going to do?” said one sriracha fan.https://t.co/Mhhmc17N48","date":"Wed Jun 22 12:29:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden’s approval rating has reached the lowest level of his presidency, while 70% of Americans say that the U.S. is on the wrong track.\n\nHow did his approval rating fall so low? Listen to today’s episode of The Daily.\nhttps://t.co/kxNo3e9ZPX","date":"Wed Jun 22 12:15:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Scandals, economic pain and an uproar over lockdown parties have left Prime Minister Boris Johnson’s Conservative Party at risk of losing seats in two elections in Britain.\nhttps://t.co/mFZeko5irG","date":"Wed Jun 22 12:01:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"More than 150 people across the U.S., mostly older adults, were defrauded of about $13 million in an elaborate scheme that promised returns on whiskeys and fine wines, according to court documents.\nhttps://t.co/hN8paUS7uq","date":"Wed Jun 22 11:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Taiwan’s lucrative grouper industry is bracing for heavy losses after China recently banned all imports of the fish from the island. The abrupt ban is an apparent attempt at turning the economic screws on the island that Beijing claims as its own.\nhttps://t.co/bLte1emiST","date":"Wed Jun 22 11:28:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Saudi crown prince was expected in Turkey on Wednesday for his first visit since Saudi agents murdered the prominent dissident and journalist Jamal Khashoggi in Istanbul in 2018, driving a deep rift between the two regional powers.\nhttps://t.co/cGpauzhbVU","date":"Wed Jun 22 11:15:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Families in New York City are preparing to vaccinate children younger than 5 against Covid on Wednesday after the CDC endorsed the vaccines over the weekend.\nhttps://t.co/uipecXee9l","date":"Wed Jun 22 11:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Prices in Britain climbed 9.1% in May from a year earlier. The inflation rate was pushed to a fresh 40-year high, the nation’s statistics agency said, by rising food prices in particular. \nhttps://t.co/UtMLWhYbMB","date":"Wed Jun 22 10:28:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: At least 920 people were killed and hundreds more injured after a 5.9-magnitude earthquake struck southeastern Afghanistan, an official said.\nhttps://t.co/gFdaoNdgLB","date":"Wed Jun 22 10:19:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“For Boris Johnson, Britain’s embattled and scandal-ridden prime minister, nowhere is safe,” writes Samuel Earle, a British journalist, in a guest essay. “On Thursday, that may become inescapably clear.”\nhttps://t.co/t2Oj3tumDf","date":"Wed Jun 22 10:00:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Namibian investigators tracing money transfers by men suspected of stealing cash from a farm belonging to President Cyril Ramaphosa of South Africa say their cross-border calls for help were met with an unusual response: silence.\nhttps://t.co/XOIV6icrEk","date":"Wed Jun 22 09:29:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: President Biden will push Congress to temporarily lift the federal gas tax, an effort to dampen soaring fuel prices that have stoked frustration.\nhttps://t.co/l8wIXCUAgO","date":"Wed Jun 22 09:09:26 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here's a look at some of the highlights worth watching from late-night TV. https://t.co/jzaT2KS0mh","date":"Wed Jun 22 09:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"As Ukrainian forces launched an assault on Snake Island in the Black Sea, recent strikes by Ukraine suggested that powerful Western anti-ship weapons were arriving in the country, analysts said. https://t.co/eBi9evAiH4","date":"Wed Jun 22 08:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“Lilo &amp; Stitch,” released 20 years ago this week, featured nuanced depictions of Hawaii and strong female characters. The director wishes more people would notice how the relationship between the two sisters anticipated “Frozen” by more than a decade. https://t.co/VPHE6KXmmT","date":"Wed Jun 22 07:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: An earthquake struck southeastern Afghanistan, killing more than 250 people, the country's state-run news agency said. \n\nThe quake occurred about 28 miles southwest of the city of Khost. https://t.co/IgrSAljkdl","date":"Wed Jun 22 06:11:53 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Compositions by women and people of color now make up about 23% of the pieces performed by U.S. orchestras, up from only about 5% in 2015, according to a report released on Tuesday. https://t.co/G4WJT0NQMG","date":"Wed Jun 22 06:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A new law cracking down on Chinese forced labor could have major ramifications in the U.S. The law bans products from entering the U.S. if they have links to Xinjiang, where China has carried out a sweeping crackdown on Uyghurs and other minorities. https://t.co/8moc9sTZkU","date":"Wed Jun 22 05:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Despite the large number of U.S. sites dispensing antiviral Covid medications in disadvantaged communities, people who live in those areas were half as likely as those in wealthier areas to be prescribed the drugs in recent months, a CDC study found. https://t.co/FpERa1g25S","date":"Wed Jun 22 04:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“I don’t know what I’m going to do if anything gets any worse than it is now.” Inflation is expected to remain high later this year even as the economy slows and layoffs rise. Already, signs of financial stress are surfacing. https://t.co/IDDezUb65s","date":"Wed Jun 22 03:40:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Clela Rorex, a county clerk who in 1975 issued the first marriage license to a gay couple in Colorado, has died. She was 78. https://t.co/nrjgGvjbon","date":"Wed Jun 22 03:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A group of drivers seeking class-action status have sued Uber and Lyft, claiming that the companies have deprived them of employee benefits while also denying them the freedoms of independent contractors. https://t.co/8ucMQEQd28","date":"Wed Jun 22 02:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: A New York City panel that regulates rents for roughly one million rent-stabilized apartments approved the highest increases in almost a decade. https://t.co/1apZ859Nu6","date":"Wed Jun 22 02:00:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here are full results and maps from the Alabama primary runoff elections. https://t.co/1KHLGd417G","date":"Wed Jun 22 01:48:44 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Katie Britt, a former lobbyist and chief of staff to Senator Richard Shelby, defeated Representative Mo Brooks in a runoff for the Republican nomination in the open Senate race in Alabama. \nhttps://t.co/tJqISD3Pg7","date":"Wed Jun 22 01:40:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Two Florida men were charged last week in widespread prescription fraud cases that could have left unsuspecting patients across the country without the proper medication to treat cancer, HIV and psychiatric conditions, according to federal officials. https://t.co/CSrgJRoFXR","date":"Wed Jun 22 01:10:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rusty Bowers, a Republican and Arizona’s House speaker, described the pressure campaign he faced to overturn his state’s 2020 election results in testimony to the Jan. 6 committee on Tuesday. https://t.co/7jjpYvWqwO https://t.co/4uPrV7U01l","date":"Wed Jun 22 01:00:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Georgia’s secretary of state, Brad Raffensberger, testified to the Jan. 6 committee that his investigation into voter fraud in the state found that only four votes were cast using dead people’s names — nowhere near Donald Trump's claims of thousands. https://t.co/u9CLpRkCpu https://t.co/EmGVM5GxqL","date":"Wed Jun 22 00:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"South Dakota’s Senate voted to remove the attorney general, Jason Ravnsborg, from office after he fatally struck a man with his car in 2020. https://t.co/jKOCjZW6eZ","date":"Wed Jun 22 00:30:01 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Maybe you just graduated from college and are on your own for the first time, or perhaps you never quite got the hang of cooking. For these 10 easy recipes, all you need are a few basic tools. https://t.co/7Fen2bAn5v https://t.co/zOVil9w87q","date":"Wed Jun 22 00:00:20 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: State Rep. Bee Nguyen has won the Democratic nomination for Georgia secretary of state. She will face the incumbent Brad Raffensperger in the November general election. https://t.co/Ya5pLf6lhF","date":"Tue Jun 21 23:47:36 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Organizers of Documenta, an international art exhibition in Germany, said they would remove a nearly 60-foot-long painted banner after diplomats and lawmakers said it contained antisemitic images. https://t.co/rL5WrEnuvd","date":"Tue Jun 21 23:45:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: A group of senators presented a bipartisan gun safety bill that would enhance background checks and direct funds to help states implement red flag laws, which allow authorities to temporarily confiscate guns from people deemed dangerous. https://t.co/YgmzbAL2dy","date":"Tue Jun 21 23:25:57 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Have you sought Covid treatments? Did you run into barriers or have trouble proving you were eligible? Or did you avoid Paxlovid or other therapeutics for some reason? We’d like to hear from you: https://t.co/7yHztFPcsT","date":"Tue Jun 21 23:20:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The fourth hearing held by the Jan. 6 committee focused on the elaborate efforts by Donald Trump and his allies to hijack one of the foundations of democracy: the process behind the peaceful transfer of power. Here are some takeaways. https://t.co/xOsmUDk39a","date":"Tue Jun 21 23:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Ivanka Trump told a film crew in Dec. 2020 that Donald Trump should “continue to fight until every legal remedy is exhausted,” describing his efforts to overturn the election differently than she did in the portion of her deposition that’s been made public.https://t.co/ANItgCcYIR","date":"Tue Jun 21 23:00:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"We're tracking results in tonight's key races, including primaries in Virginia and congressional runoffs in Alabama and Georgia. Here’s what to watch. https://t.co/VAy7TqoYqJ","date":"Tue Jun 21 22:50:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: A jury in California found that Bill Cosby sexually assaulted a 16-year-old girl in 1975 and awarded her $500,000 in damages. https://t.co/eSF7fAIa8e","date":"Tue Jun 21 22:44:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"\"It was such a hard right-wing, racist society that I grew up in. I have a lot of friends and even kinfolk who never tried to move beyond the racism. But I try every day. It’s been an ongoing, gradual transformation,\" the writer John Grisham tells @NYTmag. https://t.co/qMJK6iMZCr","date":"Tue Jun 21 22:20:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The U.S. on Tuesday limited its military’s use of land mines worldwide, except in defense of South Korea, meeting President Biden’s campaign pledge to undo a Trump-era policy that he had called “reckless.” https://t.co/oFtvgP9ere","date":"Tue Jun 21 22:10:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A verdict in the Bill Cosby civil trial has been reached. It's expected to be read at 3:30 p.m. Pacific, or 6:30 p.m. Eastern, the court said. Here's what to know. https://t.co/XoQvmXJ6lq","date":"Tue Jun 21 22:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Henry Cuellar, a nine-term congressman, overcame a looming FBI probe to defeat Jessica Cisneros in a Democratic primary runoff, a recount shows. https://t.co/iyL7a3AsVO","date":"Tue Jun 21 21:50:59 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"If there’s one thing about Wasabi the Pekingese, last year’s Westminster dog show winner, it’s that you’re not the boss of him. “If I throw a toy for him, he’ll go get it, but he won’t bring it back,” said his owner. “He knows I’m going to get it for him.” https://t.co/X2O3JvEE9a","date":"Tue Jun 21 21:50:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"During the Jan. 6 committee hearing on Tuesday, Donald Trump’s direct involvement in a plan to put forward fake electors was revealed and election officials testified about the violent threats they faced. https://t.co/6A2BuLNCD9","date":"Tue Jun 21 21:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Millions of 2021 taxpayer returns have not been processed, the Treasury Department said on Tuesday, as the IRS faces a larger-than-normal backlog at this point in the tax season. Most of the backlog relates to paper returns, which take longer to process. https://t.co/29VLS2rJoC","date":"Tue Jun 21 21:30:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The FDA is set to propose a reduction of nicotine in cigarettes to help prevent addiction. It’s likely to face fierce industry opposition. https://t.co/BKvxc1JeFK","date":"Tue Jun 21 21:25:40 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion \n\n“There is no one long Covid experience. Therefore, there is no one magic cure.” Dr. Lekshmi Santhosh spoke with @ezraklein on what we know about long Covid so far, and what questions remain. Listen to the podcast episode: https://t.co/askJR7aiig","date":"Tue Jun 21 21:20:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan. 6 committee sought on Tuesday to show that Donald Trump’s false claims of election fraud were a significant threat to the U.S. election system and democracy itself — putting sharp focus on the pressure officials faced to overturn the 2020 results. https://t.co/3ImshKbptW https://t.co/8RlWUd1wW9","date":"Tue Jun 21 21:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Microsoft will restrict the use of its facial recognition tool and stop offering automated tools that predict a person’s gender, age and emotional state — AI software that many critics have said can be biased, unreliable or invasive. https://t.co/vAovjnXzqa","date":"Tue Jun 21 20:45:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan. 6 committee sought on Tuesday to show that Donald Trump’s false claims of election fraud were a significant threat to the U.S. election system and democracy itself — putting sharp focus on the pressure officials faced to overturn the 2020 results. https://t.co/8GwAkx1XA4","date":"Tue Jun 21 20:30:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“Who threw the first brick at Stonewall?” has become a rallying cry, a cliche and a queer inside joke on the internet. We take you through the story (and myths) of Stonewall and why its legacy matters. \n\nWatch our full video here: https://t.co/n7nMAJgBa6 https://t.co/3n7ZFpqM64","date":"Tue Jun 21 20:20:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Rusty Bowers, a Republican and Arizona’s House speaker, described the pressure campaign he faced to overturn his state’s 2020 election results. \"I will not play with laws I swore allegiance to,\" he wrote in a journal entry that he read to the Jan. 6 panel. https://t.co/1VDVIOhonN","date":"Tue Jun 21 20:10:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A wildfire in a remote section of a forest in New Jersey was threatening to become the state’s largest fire in 15 years, and may have been started by an illegal campfire, officials said on Tuesday. https://t.co/l3xTQ8XJEI https://t.co/0kyKlrAjIt","date":"Tue Jun 21 20:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Two of Amazon’s most senior Black executives are departing the company, leaving Amazon without any Black leaders on its senior leadership team, which includes more than two dozen executives responsible for running the company. https://t.co/aD4wsbGtsD","date":"Tue Jun 21 19:50:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Many are wondering if — or when — there will be a recession in the U.S. Here’s what people on Wall Street, in the White House and beyond have recently said about the odds of one occurring. https://t.co/mc380htLHQ","date":"Tue Jun 21 19:40:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Jan. 6 panel issued a subpoena to a British filmmaker for footage taken inside the White House as the Capitol riot unfolded. The footage was taken in connection with a series on Donald Trump’s re-election campaign. https://t.co/GPskkIHtID","date":"Tue Jun 21 19:10:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A New York City panel charged with regulating the rents for roughly one million rent-stabilized apartments is expected to approve on Tuesday some of the largest increases in almost a decade. https://t.co/pIYtThlyDe","date":"Tue Jun 21 19:00:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A wildfire in a remote section of a forest in New Jersey was threatening to become the state’s largest fire in 15 years, and may have been started by an illegal campfire, officials said on Tuesday. https://t.co/8aQeYsyien","date":"Tue Jun 21 18:50:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"If Wasabi the Pekingese seems largely unchanged by success, it’s because winning the Westminster dog show is more glory than lucre. Retired at age four, Wasabi’s life consists of a nonstop schedule of sleeping, eating, primping, romping and reclining. https://t.co/Nh2YW6Eq3i https://t.co/Hn5b9JdRUE","date":"Tue Jun 21 18:40:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A visitor center commemorating the 1969 Stonewall uprising and its legacy will be the first within the national park system dedicated to LGBTQ history. It will open in 2024 and be next door to the Stonewall Inn bar. https://t.co/6Rt53jNXa9","date":"Tue Jun 21 18:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"For Representative Adam Schiff, a spot on the House panel investigating the Jan. 6 riot is his latest prominent role in a high-profile congressional investigation of Donald Trump. He was the lead impeachment manager for Trump's first trial in 2020. https://t.co/Og7jbyRRuM","date":"Tue Jun 21 18:20:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"We all have to start somewhere. That’s the inspiration behind this small but mighty collection of recipes for absolute beginners. \nhttps://t.co/RAn6JGEMwR https://t.co/q8tLT2Fykg","date":"Tue Jun 21 18:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Broadway theaters will be allowed to drop their mask mandates starting July 1, the Broadway League announced Tuesday. https://t.co/CmlitcLmbc","date":"Tue Jun 21 17:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Under arcane rules, Treasury Secretary Janet Yellen’s signature couldn’t appear on the dollar until a treasurer was in place. On Tuesday, President Biden named Marilynn Malerba as U.S. treasurer. She will be the first Native American to hold the position. https://t.co/cYuGSDN0Dc","date":"Tue Jun 21 17:20:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: On Day 4, the Jan. 6 panel investigating the Capitol attack will highlight Donald Trump’s pressure campaign on state officials in Georgia and Arizona to overturn their state’s election results. Watch live. https://t.co/fMXlOPGGo5","date":"Tue Jun 21 17:09:51 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Whether you want to find joy in your body, or just greater self-acceptance, here are four strategies from psychologists, activists and nudists that might help you feel better naked. https://t.co/nVw6EwS5DV","date":"Tue Jun 21 17:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gov. Kathy Hochul is expected to win next week’s primary for governor of New York. But some Democratic allies worry her campaign’s low-key approach is failing to energize Black, Latino and union voters for November’s election. https://t.co/XW5ZjyCXOG","date":"Tue Jun 21 16:45:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The House Jan. 6 committee investigating the Capitol attack is publicly unveiling its findings, after interviewing more than 1,000 witnesses and gathering over 140,000 documents. @maggieNYT weighs in on the biggest surprises to come out so far. https://t.co/fs1SYFz9DX","date":"Tue Jun 21 16:15:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The NFL quarterback Deshaun Watson reached settlements with 20 of the 24 women with sexual misconduct lawsuits against him, a lawyer for the accusers said. The lawyer said that the terms and amounts of the settlements were confidential. https://t.co/UdTzzVI3uL","date":"Tue Jun 21 16:13:29 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The head of Texas' state police called the police response to the Uvalde shooting \"an abject failure\" that ran counter to decades of training. He said officers wasted time looking for a classroom door key that was \"never needed.\" https://t.co/TreJ8yJfPV","date":"Tue Jun 21 16:10:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Supreme Court ruled on Tuesday that Maine may not exclude religious schools from a state tuition program. Here are the major Supreme Court decisions in 2022 so far. https://t.co/aIVPK8gZZT","date":"Tue Jun 21 16:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"When you're in a communal restroom, how well you clean your hands after using the bathroom is more important than whether you use a toilet seat cover, sit or hover, one doctor said. https://t.co/ADMQdyDU4F https://t.co/RiaB6J1LeU","date":"Tue Jun 21 15:30:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Correction: An earlier tweet misspelled the first name of Dmitri Muratov. It is Dmitri, not Dimitri. We've deleted the incorrect tweet.","date":"Tue Jun 21 15:27:19 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A Nobel Peace Prize medal put up for auction by a Russian journalist to help Ukrainian child refugees sold for $103.5 million to an anonymous buyer.\n\nDmitri Muratov will donate the proceeds to UNICEF. https://t.co/JQNQaQoUW5","date":"Tue Jun 21 15:27:19 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Mike Pence, in a speech on Monday, sounded like a future presidential candidate, but not like someone interested in discussing the specifics of what he lived through on Jan. 6. https://t.co/OfVXHrwtY5","date":"Tue Jun 21 15:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russia’s ruble hit a seven-year high, cementing its status as the world’s best-performing currency.\n\nIt has gained about 35% so far this year, and has more than doubled from a low after the invasion of Ukraine.\nhttps://t.co/fPA689PnyY","date":"Tue Jun 21 14:44:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: The Supreme Court rejected Maine’s ban on state aid for religious schools in its latest decision favoring religious interests. https://t.co/ipE46mWKRE","date":"Tue Jun 21 14:42:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Voters in Alabama and Georgia will make their final selections in congressional runoffs, and Virginia primary voters will select nominees for two of the most closely watched House races in the U.S.\n\nHere’s what to watch in Tuesday’s primary elections.\nhttps://t.co/7BNpO7OFeQ","date":"Tue Jun 21 14:28:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Faces. Voice prints. Mobile device data. DNA. \n\nChina has ambitions to use massive amounts of personal data for maximum surveillance, documents analyzed by The New York Times reveal. Watch our video investigation.\nhttps://t.co/67b35gLcIr","date":"Tue Jun 21 14:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In its fourth public hearing, the Jan. 6 committee plans to detail Donald Trump’s involvement in a pressure campaign on state officials to subvert the 2020 election.\n\nFollow our updates.\nhttps://t.co/IUikHwdLAM","date":"Tue Jun 21 14:00:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Merrick Garland, the U.S. attorney general, traveled to Ukraine to discuss the prosecution of Russians for war crimes, his spokesman said.\nhttps://t.co/Fc1rhlmPlC","date":"Tue Jun 21 13:54:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Two Americans captured while fighting for Ukraine should be “held responsible for the crimes they have committed,” the Kremlin said. The statement signaled that Moscow might prosecute them as terrorists or war criminals and hand them a harsh sentence. https://t.co/bKyGrwX8AT","date":"Tue Jun 21 13:44:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A wildfire in a remote section of a forest in New Jersey could become the state’s largest fire in 15 years, the authorities said.\n\nOfficials ruled out natural causes as the source of the fast-moving blaze.\nhttps://t.co/P7bQMT6oPP","date":"Tue Jun 21 13:40:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Want to know why you played so well — or so badly — in Wordle 367? Meet WordleBot, your daily wordle companion that will tell you how efficient and lucky you were — and it could help improve your results. https://t.co/MZyN79Sp5o https://t.co/NmQGZjPCG6","date":"Tue Jun 21 13:28:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Svitlana Zhyvaga’s mission was simple: She was going shopping, and she would not be deterred. She just needed to cross the Siversky Donets River in eastern Ukraine, which is currently one of the most dangerous river crossings in the world.\nhttps://t.co/Zdv3wwrd3c https://t.co/bJv82twiRa","date":"Tue Jun 21 13:15:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Plunging home prices, hesitant buyers, pandemic fallout: Why China’s housing market is a growing crack in an already fragile economy.\nhttps://t.co/moJe4GCE1W","date":"Tue Jun 21 13:00:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The criminal trial of a man charged with sexually assaulting Brittany Higgins, a government employee, inside Australia’s Parliament House has been delayed after a judge ruled that a journalist’s public comments could prejudice jurors.\nhttps://t.co/ePuWCAi3ws","date":"Tue Jun 21 12:46:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Health experts will call on Tuesday for an overhaul of the U.S. public health system that would expand the role of the federal government, giving Washington the authority to set minimum health standards and coordinate a patchwork of nearly 3,000 agencies.\nhttps://t.co/M4OUsrVeCU","date":"Tue Jun 21 12:28:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Jumbo Floating Restaurant, which had sat in the same Hong Kong harbor for nearly half a century and closed in 2020, capsized in the South China Sea after being towed from the city.\n\nThe sinking triggered nostalgia for a happier period of Hong Kong history.\nhttps://t.co/b8kIoHpOcP","date":"Tue Jun 21 12:25:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"South Korea sent a small satellite into orbit using its first homemade rocket, it said. The launch brings the country closer to its dream of becoming a player in the space industry and deploying its own spy satellites to better monitor North Korea. https://t.co/WwEsKVYINk","date":"Tue Jun 21 12:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"House prices and competition to secure properties have risen to jaw-dropping levels across the U.S.\n\nWhy is it so hard to buy a house in the U.S. right now? Listen to today’s episode of The Daily.\nhttps://t.co/WkIwVrcL0A","date":"Tue Jun 21 11:50:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The New York Times analyzed over 100,000 government bidding documents and found that China’s approach to collecting digital and biological data from its citizens is far more expansive than previously known.\n\nHere are four takeaways from our investigation.\nhttps://t.co/2oxWUWeWSU","date":"Tue Jun 21 11:29:00 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A new Chinese study about the relatively low risks associated with the Omicron variant of the coronavirus has reignited discussion about whether the country’s “zero Covid” policy is necessary.\nhttps://t.co/l0sIlVSiso","date":"Tue Jun 21 11:15:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A giant stingray, hauled out of the Mekong River in Cambodia, measured 13 feet in length and weighed 661 pounds. It’s thought to be the world’s largest freshwater fish.\n\nThe find is a positive sign of the health of the river, which faces many challenges.\nhttps://t.co/SpmLOzqBeW","date":"Tue Jun 21 11:00:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Find more visual investigations here: https://t.co/XKoSbFfUAY","date":"Tue Jun 21 10:33:58 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Chinese government’s goal is clear: to design a system to maximize what it can find out about a person’s identity, activities and social connections, which could ultimately help it maintain its authoritarian rule.\n\nRead all our takeaways: https://t.co/DyvXkxDnXk","date":"Tue Jun 21 10:33:58 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The government wants to connect all these data points to build comprehensive profiles of citizens.\n\nSoftware being used by the police takes data collected about a person and displays their movements, clothing, vehicles, mobile device information and social connections. https://t.co/VGjNYI5L1e","date":"Tue Jun 21 10:33:57 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Our analysis shows at least 25 of 31 provinces and regions in mainland China are building large databases of male DNA. Many countries limit DNA collection to criminals and suspects, but China stands out in its focus on building ever-larger databases despite privacy concerns.","date":"Tue Jun 21 10:33:48 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"DNA, iris scans and voice prints are being collected indiscriminately from people with no known connection to crime.\n\nIn the city of Zhongshan, the police wanted devices to record audio in public from 300 to 600 feet around cameras and analyze voice prints.https://t.co/lxujONGqbI https://t.co/xxhJrGB3vC","date":"Tue Jun 21 10:33:47 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"China is using phone trackers to link people’s digital lives to their physical movements. In one case, the documents revealed that the police from a county in Guangdong bought trackers in hopes of detecting a Uyghur-to-Chinese dictionary app on phones.\nhttps://t.co/lxujONGqbI https://t.co/5fo6H309jq","date":"Tue Jun 21 10:33:34 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Chinese police analyze citizens’ behaviors to ensure facial-recognition cameras capture as much activity as possible.\n\nThe police said that they wanted to place cameras where people eat, travel and shop. They also wanted to put them inside places, like hospitals and hotels. https://t.co/cxNpWwaLju","date":"Tue Jun 21 10:33:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The documents, which call for companies to bid on contracts to provide surveillance technology, often include requirements and budget details, and sometimes describe at length the strategic thinking behind the purchases. @ChinaFile shared them with us exclusively. https://t.co/Q1pQcKmdSa","date":"Tue Jun 21 10:33:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The New York Times studied China’s surveillance capabilities by examining more than 100,000 government bidding documents.\n\nChina’s ambition to collect personal data is more expansive and invasive than previously known, our investigation found.\nhttps://t.co/I56kVq7n4p","date":"Tue Jun 21 10:29:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A 21-year-old man was killed and eight other people were wounded in a shooting at a barbecue in Harlem. Investigators found a handgun at the scene. https://t.co/1J4kTjpnQX","date":"Tue Jun 21 10:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“The Umwelt concept is one of the most profound and beautiful in biology,” says Ed Yong, a writer, in a guest essay. “It tells us that the all-encompassing nature of our subjective experience is an illusion.”\nhttps://t.co/CAWBCf36tN","date":"Tue Jun 21 09:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Here's a look at some of the highlights worth watching from late-night TV. https://t.co/MiDwz6KuJw","date":"Tue Jun 21 08:30:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Payment apps like Zelle have become easy targets for scammers. Despite a U.S. law that requires banks to reimburse customers for unauthorized electronic transfers, they often refuse, leaving victims with little recourse. https://t.co/5kav3ZfcC0","date":"Tue Jun 21 08:00:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Attacks by jihadist rebels over the weekend in central Mali killed 132 civilians, the government said. The attacks suggest that Islamic extremist violence is spreading from Mali’s north to more central areas. https://t.co/LCwzUvIBlR","date":"Tue Jun 21 07:46:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Britain’s largest railway strike in three decades has halted trains across the country and thrown travel plans for tens of millions of Britons and visitors into chaos. Union leaders have warned that it could be the beginning of a summer of labor unrest.\nhttps://t.co/lV3oEVk2F2","date":"Tue Jun 21 07:33:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A Nobel Peace Prize medal put up for auction by a Russian journalist to help Ukrainian child refugees sold for $103.5 million to an anonymous buyer.\n\nDimitri Muratov will donate the proceeds to UNICEF. https://t.co/OaSVCKPcfe https://t.co/n7M5G5ZBWU","date":"Tue Jun 21 07:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“The government of hope has arrived,” Gustavo Petro said as he celebrated his victory as the first leftist elected president of Colombia.\n\nThe former rebel proposed major reforms if he was elected. He’ll now have to prove he can carry out those changes. https://t.co/9aBMd308A0","date":"Tue Jun 21 06:00:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Ukraine struck three Russian drilling rigs in the Black Sea but gas supplies were not affected, a Russian official said. https://t.co/dGAjQD9AYG","date":"Tue Jun 21 05:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Biden said that he was considering seeking a gas tax holiday to ease high fuel prices, a major political dilemma for the White House as it struggles to address record inflation. https://t.co/sij9clIbPl","date":"Tue Jun 21 04:45:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The jury in the Bill Cosby sexual assault trial deliberated for a third day without reaching a verdict, even though the judge indicated at the end of last week that the jurors were close to reaching a decision. https://t.co/5D1LLkSNne","date":"Tue Jun 21 04:00:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Kremlin’s chief spokesman said that two American fighters who went missing in Ukraine, Alex Drueke and Andy Tai Ngoc Huynh, were “soldiers of fortune,” and were taken into custody. He also claimed that they were not protected by the Geneva Conventions. https://t.co/xOfFKCiwQN","date":"Tue Jun 21 03:30:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The House committee investigating the Jan. 6 Capitol attack will also underscore the vitriol and suffering that election workers endured because of former President Trump’s pressure campaign to subvert the will of voters. https://t.co/uSoPJ8JXyh","date":"Tue Jun 21 03:00:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Heavy monsoon rains and lightning strikes in India and Bangladesh have killed at least 116 people, cut off communications for millions and forced the evacuation of hundreds of thousands.\n\nOne of Bangladesh’s largest airports has been flooded. https://t.co/ZRNUwMuvkQ https://t.co/dNOhCU9ILZ","date":"Tue Jun 21 02:31:40 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Bears Ears in Utah will become the first national monument to be jointly managed by the U.S. government and Native American tribes. https://t.co/Nil2Xy16pd","date":"Tue Jun 21 02:00:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Russian blockade that has stopped Ukraine from exporting its vast storehouses of grain and other goods, threatening starvation in some countries, is a “war crime,” the EU’s top foreign policy official declared. https://t.co/AVKKjjBCRX","date":"Tue Jun 21 01:30:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“The Spur,” Joan Shelley’s sixth solo album, contains death and renewal, romance and retreat, self-doubt and societal hope.\n\n“Music made me a whole person — it allowed for the survival of the softer parts of me,” Shelley said.\nhttps://t.co/7Jm4CjJa8Y","date":"Tue Jun 21 01:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Stress can take a serious toll on mental and physical health. New research suggests that certain types of stress can even age your immune system.\nhttps://t.co/CldaWRLf38","date":"Tue Jun 21 00:29:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Thousands of Ukrainians were taken to “filtration camps” and forced to resettle in Russia. Some escaped. These are their stories.\nhttps://t.co/7ZKBdjbray https://t.co/8xttsQXC3B","date":"Tue Jun 21 00:00:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Israel confirmed on Monday that it is part of a regional military partnership to combat threats from Iran, in the latest example of Israel’s growing engagement with some Arab governments and the recalibration of Middle Eastern alliances.\nhttps://t.co/A3OxEkz02I","date":"Mon Jun 20 23:28:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Fellowship of Friends, una secta que cree en alcanzar una conciencia superior a través de las bellas artes y la cultura, se afianzó en una unidad de negocios de Google. Un productor de video dice que lo despidieron tras denunciar la influencia del grupo.\nhttps://t.co/r3Cnwf6Shk","date":"Mon Jun 20 23:00:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Afghan government has released five British citizens from custody, British officials said in a statement that included an apology on behalf of the men and an expression of regret from the UK government.\nhttps://t.co/XaotMm3T0h","date":"Mon Jun 20 22:28:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"His money doesn’t jiggle jiggle, and he doesn’t want to be a rapper.\n\nLouis Theroux’s unlikely TikTok hit shows \"the weirdness of the world that we live in,\" the British American journalist said.\nhttps://t.co/0WRIjJ6H4Y https://t.co/JIe5QZ8aQW","date":"Mon Jun 20 22:01:21 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"What to do with Grenfell Tower five years after a fire killed 72 people is one of the tragedy’s many unresolved issues.\n\nSome of the victims’ families and survivors want the London structure to stand as a memorial. Others see it as a source of trauma.\nhttps://t.co/uAUYGwe3Zm","date":"Mon Jun 20 21:31:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"There is a widespread belief that viruses evolve to become gentler over time. But a virus’s evolution often takes unexpected twists and turns.\n\nA pathogen that has ravaged rabbits in Australia for 72 years exemplifies that unpredictability.\nhttps://t.co/ThU4x8cqms","date":"Mon Jun 20 21:00:16 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"An article in a British newspaper claimed that Prime Minister Boris Johnson, when he was the foreign secretary in 2018, proposed appointing his mistress at the time, Carrie Symonds, as his chief of staff. Then the article vanished abruptly.\nhttps://t.co/lFbnF4axFV","date":"Mon Jun 20 20:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A New York Times investigation found that the bullet that killed Shireen Abu Akleh, a Palestinian American journalist, was fired from the approximate location of an Israeli military convoy — most likely by a soldier from an elite unit. https://t.co/QWZOfMTWsk","date":"Mon Jun 20 20:29:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Germany will restart coal-fired power plants in order to conserve natural gas, the country’s economy minister announced. The move comes amid concerns about a looming supply shortage after Russia cut gas deliveries to Europe. https://t.co/gDmTzYDxtP","date":"Mon Jun 20 20:10:23 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Google is charging some small businesses for email and other apps after more than a decade of free use as the company looks for ways to get more money out of its existing business.\n\n“It struck me as needlessly petty,” one user said.\nhttps://t.co/QszRaj2RJZ","date":"Mon Jun 20 20:03:01 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“Proof,” a three-disc compilation album from BTS, opened at No. 1 on the Billboard 200 album chart. It is the group’s sixth album to top the chart and comes as BTS takes a break to let its seven members focus on solo projects. https://t.co/TeYnuni9ex https://t.co/8Sv1noQFMz","date":"Mon Jun 20 19:45:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Black Sea blockade that is preventing Ukraine from exporting food and other goods is a “war crime” and Russia will be held accountable if it continues, the EU’s foreign policy chief said.\nhttps://t.co/cGixzzyYzB","date":"Mon Jun 20 19:29:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"The Dutch government said that Russia’s tightening of gas supplies to Europe had prompted it to declare an “early warning” stage of a natural gas crisis, a move that will allow more electric power to be generated by burning coal.https://t.co/mkO32uFw5j","date":"Mon Jun 20 19:02:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Three people were in critical condition after a taxi cab jumped the sidewalk in Manhattan’s Flatiron district and struck several pedestrians, the authorities said.\nhttps://t.co/rz8bJ09epu","date":"Mon Jun 20 18:48:58 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“If it seemed in recent decades that the justices were more or less in sync with the public, that may simply have been because the swing justice, by happenstance, mostly reflected public sentiment,” @adamliptak writes of the U.S. Supreme Court.\nhttps://t.co/TF4HCfy8B7","date":"Mon Jun 20 18:45:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"An abortion clinic in Florida is facing increasing restrictions, an influx of patients from Texas and a looming Supreme Court decision on Roe v. Wade.\n\nThe New York Times documented what it's like at the center now.\nhttps://t.co/7cdgMSQ4vP","date":"Mon Jun 20 18:28:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Francia Márquez, an environmental activist, became a phenomenon in Colombia, mobilizing decades of voter frustration. She became the country’s first Black vice president on Sunday.\n\nPhoto: Federico Rios for The New York Times\nhttps://t.co/KbxQ2O87Wp https://t.co/sgCRSX0Usu","date":"Mon Jun 20 18:15:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“What the United States is doing in Ukraine is not not war,” writes Bonnie Kristian. “If we have so far avoided calling it war, and can continue to do so, maybe that’s only because we’ve become so uncertain of the meaning of the word.”\nhttps://t.co/sQoNWppVO3","date":"Mon Jun 20 18:00:18 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Eric Greitens, a Republican candidate for the Senate in Missouri, released a violent new political ad showing himself with a shotgun accompanying a team of heavily armed men as they storm a home in search of “RINOs,” or Republicans in name only. https://t.co/IP8FCHKAJm","date":"Mon Jun 20 17:45:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Toshkivka, a small town in eastern Ukraine, has become a flash point in the country’s struggle to defend a slowly shrinking pocket around the two strategically important cities of Sievierodonetsk and Lysychansk.\nhttps://t.co/5nyKoXCsCB","date":"Mon Jun 20 17:29:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Want to know why you played so well — or so badly — in Wordle 366? Meet WordleBot, your daily wordle companion that will tell you how efficient and lucky you were — and it could help improve your results. https://t.co/rGUbQxMTsT https://t.co/oua8Y4W6Vr","date":"Mon Jun 20 17:20:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A giant stingray, hauled out of the Mekong River in Cambodia, measured 13 feet in length and weighed 661 pounds. It’s thought to be the world’s largest freshwater fish.\n\nThe find is a positive sign of the health of the river, which faces many challenges.\nhttps://t.co/54YEWiQ6dA https://t.co/9isqEWbipe","date":"Mon Jun 20 17:00:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"“Proof,” a three-disc compilation album from BTS, opened at No. 1 on the Billboard 200 album chart. It is the group’s sixth album to top the chart and comes as BTS takes a break to let its seven members focus on solo projects.\nhttps://t.co/XDViaWP9eJ","date":"Mon Jun 20 16:45:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Breaking News: Israeli coalition lawmakers will dissolve Parliament, the government announced, ushering in Israel’s fifth election in three years.\nhttps://t.co/7v56pn8DGc","date":"Mon Jun 20 16:32:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“I’m having a hard time joining the ‘Mike Pence the Hero’ bandwagon that some of my old friends on the right have jumped aboard,” Bret Stephens tells Gail Collins in their latest conversation.\nhttps://t.co/Y1VGfewUGV","date":"Mon Jun 20 16:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"One year after Juneteenth became a federal holiday, more than 30 states have not authorized funds for state employees to take the day off. Some opponents of the funding bills said not enough people know about the holiday to make the effort worthwhile. https://t.co/Fj2aiAD4R4","date":"Mon Jun 20 16:14:01 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Uvalde, Texas, was set to cancel a Little League tournament after 21 people were killed in a school shooting. Then, a decision was made: The games would go on.\n\n\"You don't want to use the word 'fun,' but you want to see children happy again,\" a parent said.https://t.co/M48vsoVnOm https://t.co/CIbekks6Td","date":"Mon Jun 20 16:00:30 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Moscow threatened Lithuania with retaliation if it did not quickly reverse a ban on the rail transportation of some goods to Kaliningrad, a landlocked Russian region. The restrictions are a response to European sanctions, a Lithuanian official said. https://t.co/rPIEQiQVf5","date":"Mon Jun 20 15:45:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“Mr. Garland’s decisions will be deeply controversial and have consequences beyond his lifetime,” writes Jack Goldsmith, a professor. “It is easy to understand, contrary to his many critics, why he is gathering as much information as possible.”\nhttps://t.co/6aF3lH9boI","date":"Mon Jun 20 15:30:15 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Hundreds of thousands of Ukrainians have been forcibly removed and pressured to take Russian citizenship.\n\nThe New York Times traveled to Estonia to speak to Ukrainian refugees who survived the siege of Mariupol and were then forced to resettle in Russia. https://t.co/DRlRygfUz6 https://t.co/BzcqgpgCJ8","date":"Mon Jun 20 15:15:03 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Many of the items stolen in a 1972 art heist were found at a Manhattan thrift shop weeks later. But a pair of paintings remained missing.\n\nMore than 50 years later, the portraits were recovered, thanks to two local sleuths — a curator and a librarian.\nhttps://t.co/04PZtnSdpw","date":"Mon Jun 20 15:00:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Volodymyr Zelensky of Ukraine warned late Sunday of increased Russian aggression ahead of a EU decision this week on whether to accept his country as a candidate for inclusion in the bloc.\nhttps://t.co/Wbb7B9Oq62","date":"Mon Jun 20 14:46:05 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"In Opinion\n\n“How did modern feminism lose Roe v. Wade?” asks Susan Faludi, a journalist, in a guest essay. “An answer lies in Depp v. Heard.” https://t.co/kQuujy5Uue","date":"Mon Jun 20 14:30:09 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Parts of Yellowstone National Park will reopen to a limited number of visitors on Wednesday, officials said, a week after historic flooding prompted the evacuation of thousands of people and the park’s closure at the start of the summer tourist season.\nhttps://t.co/K2WMJwpR9r","date":"Mon Jun 20 14:15:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Nearly three months since a set of ultra-contagious Omicron variants took hold, the rate of Covid deaths in the U.S. is nonetheless near the lowest of the pandemic. Most people now have some immune protection, experts say, from vaccines, infection or both. https://t.co/crithBhQ8i","date":"Mon Jun 20 14:00:12 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Companies using potentially forced labor are playing a larger role in the supply chain behind the batteries that power electric cars and store renewable energy — even as China’s crackdown on minorities in Xinjiang fuels outrage around the world. https://t.co/1S0fhL6ODT","date":"Mon Jun 20 13:30:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Russia surpassed Saudi Arabia to become China’s largest source of petroleum in May, as Chinese companies stepped in to buy oil that has fallen under widening Western sanctions. https://t.co/OgYJHjPxsE","date":"Mon Jun 20 13:10:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A growing wildfire in Arizona, known as the Contreras fire, destroyed four buildings of the Kitt Peak National Observatory on Friday. No telescopes were damaged. https://t.co/0sLTSfW5Gb","date":"Mon Jun 20 13:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Colombia tendrá un presidente de izquierda por primera vez. Gustavo Petro, un exguerrillero y senador experimentado que se ha comprometido a transformar el sistema económico del país, ganó las elecciones del domingo. https://t.co/tcr0Coj4ZA","date":"Mon Jun 20 12:50:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Two cast members of the Netflix show \"The Chosen One\" died after an accident on Thursday in Baja California Sur, Mexico, that left six other cast and crew members injured. Netflix said the accident was not on set and happened in transit to the airport. https://t.co/1TP0BtOFdw","date":"Mon Jun 20 12:40:06 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Colombia will have a leftist president for the first time. Gustavo Petro, a former rebel and a longtime senator, won the country's election on Sunday, galvanizing voters frustrated by decades of poverty and inequality under conservative leaders. https://t.co/5oyEH0eDM6","date":"Mon Jun 20 12:30:08 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A 15-year-old boy was killed and three adults, including a police officer, were shot on Sunday at an unauthorized music event known as Moechella in Washington, D.C., the authorities said. The police had shut down the event after earlier disturbances. https://t.co/1e7N4l9kL2","date":"Mon Jun 20 12:15:02 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"A New York Times investigation found that the bullet that killed Shireen Abu Akleh, a Palestinian American journalist, was fired from the approximate location of an Israeli military convoy — most likely by a soldier from an elite unit. https://t.co/zHh33rknVT","date":"Mon Jun 20 12:00:04 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"President Emmanuel Macron of France lost his absolute majority in the lower house of Parliament, leaving France to wonder if he will be able to govern effectively. Opposition groups have threatened to block his agenda and even bring down his cabinet. https://t.co/0bjxwIOZJY","date":"Mon Jun 20 11:30:10 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"With Roe v. Wade expected to end, women with high-risk pregnancies and their doctors are agonizing over what bar they would need to clear to legally justify an abortion in some states.\n\n“How almost dead does someone need to be?” one physician asked. https://t.co/Nt1UsU6hkK","date":"Mon Jun 20 11:00:14 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Three African wild dogs traveled 1,300 miles over nine months, which, scientists say, is more than twice the previous record for the species.\n\nThe sisters braved lions, crocodiles, poachers and raging rivers on their journey to find a new home. https://t.co/doq0InhfOR https://t.co/FOTDRLN68Z","date":"Mon Jun 20 10:30:07 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"New home prices in China have fallen, jeopardizing the already fragile economy and putting at risk an important investment for millions of Chinese families. https://t.co/nvZ0GQnyey","date":"Mon Jun 20 10:00:17 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Germany will restart coal-fired power plants in order to conserve natural gas, the country’s economy minister announced. The move comes amid concerns about a looming supply shortage after Russia cut gas deliveries to Europe. https://t.co/tgp46vFAlc","date":"Mon Jun 20 09:30:11 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Young, mostly female activists, many from Eastern Europe, believe that the Ukraine war is a brutal demonstration of the world’s dependence on fossil fuels. They are cornering Europe’s leaders and pressing them for a total energy embargo on Russia. https://t.co/vIUv6VHhCQ","date":"Mon Jun 20 09:00:13 +0000 2022","user_id":"807095"},{"handle":"nytimes","text":"Gustavo Petro, exrebelde y senador con experiencia, gana la segunda vuelta en Colombia y se convertirá en el primer presidente de izquierda del país. Los resultados ponen al tercer país más poblado de América Latina en un rumbo muy distinto. https://t.co/pUvSJ9xcfD","date":"Mon Jun 20 08:29:05 +0000 2022","user_id":"807095"}]