[{"handle":"OccupyDemocrats","text":"If you’re glad that the Vatican just called out American pro-lifers for cherrypicking the Bible on abortion, reminding them that pro-life “also means worrying about the mortality rates of women” who give birth and “defending life against the threat of firearms,” RT &amp; follow us!","date":"Sat Jun 25 21:22:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Vatican calls out American pro-lifers for cherrypicking the Bible on abortion, reminds them that pro-life “also means being concerned about the mortality rates of women” who give birth and “defending life against the threat of firearms.” RT IF THE VATICAN IS RIGHT!","date":"Sat Jun 25 20:47:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"CATTLE CRAZINESS! Republicans can find a \"Deep State\" conspiracy anywhere.\nhttps://t.co/0SES39JPFw","date":"Sat Jun 25 18:57:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Utah Republican Congresswoman Karianne Lisonbee says that she’s not worried about “controlling men’s ejaculations” to “stop unwanted pregnancies” because women can “control their intake of semen.” RT IF YOU THINK THAT SHE’S AN IDIOT!","date":"Sat Jun 25 13:15:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A truck driver plows into a crowd of women pro-choice protesters in Iowa, sending at least one woman to the hospital before spending away. The driver is yet to be identified. RT IF YOU THINK THAT HE MUST BE IDENTIFIED, ARRESTED, &amp; LOCKED UP!\n\n https://t.co/2TWkVeH7C0","date":"Sat Jun 25 03:19:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Trump’s act is getting old, even for some Republicans. https://t.co/uoLB8zf81V","date":"Sat Jun 25 01:08:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Congresswoman Alexandria Ocasio-Cortez responds to Marjorie Taylor Greene after Greene accuses her of “launching an insurrection” this morning at a pro-choice protest, telling her, only “one of us” has tried to “get a pardon for that, and it ain’t me!” RT TO THANK @AOC!","date":"Fri Jun 24 22:48:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"It you’re glad that, in response to the Supreme Court overturning Roe v. Wade, America’s biggest companies, including Meta &amp; JPMorgan Chase, just announced that they’ll cover travel costs for ALL red state employees who seek legal abortions in a blue state, please RT &amp; follow us!","date":"Fri Jun 24 22:11:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In response to the Supreme Court overturning Roe v. Wade, America’s biggest companies, including Meta and JPMorgan Chase, announce that they will cover travel costs for ALL red state employees who seek legal abortions in a blue state. RT IF EVERY COMPANY MUST DO THIS!","date":"Fri Jun 24 22:07:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Somehow we doubt that they were discussing their golf scores.\nhttps://t.co/wkpWYB4MZq","date":"Fri Jun 24 20:59:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Texas’ truly disgusting Republican Attorney General Ken Paxton closes his office early and declares an “annual holiday” to celebrate the overturning of Roe v. Wade and to “memorialize” the “70 million lives lost” from abortion. RT IF YOU THINK FETUSES AREN’T PEOPLE!","date":"Fri Jun 24 20:51:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Soccer superstar Megan Rapinoe rips into the Republican repeal of Roe as “sad” and “cruel,” and says that “cruelty is the point” because there is nothing “pro-life” about this horrendous ruling. RT TO THANK HER FOR SPEAKING OUT!","date":"Fri Jun 24 20:30:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you are pro-democracy and believe that Justice Clarence Thomas MUST be impeached over his wife Ginni’s efforts to overthrow our democracy to keep Donald Trump in power — please retweet and follow us to join the fight!","date":"Fri Jun 24 20:13:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Justice Clarence Thomas’ wife and confidant Ginni illegally tried to foment a coup against Joe Biden, he shouldn’t be on the Supreme Court let alone repealing Roe. Retweet to demand that Democrats impeach him!","date":"Fri Jun 24 20:02:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Pro-choice protestors call Marjorie Taylor Greene a “piece of shit” to her face and a “traitor,” tell her to “eat shit” as the MAGA congresswoman celebrates the overturning of Roe outside of the Supreme Court. RT IF YOU’D LOVE THE CHANCE TO SAY THAT TO HER!","date":"Fri Jun 24 19:45:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Republican Sen. Susan Collins whines that the overturning of Roe v. Wade is a “radical jolt” that’s “ill-considered” and “inconsistent” with what Kavanaugh and Gorsuch promised when she gullibly voted for them. RT IF YOU THINK THAT SHE SHOULD RESIGN IN SHAME!","date":"Fri Jun 24 19:39:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Religious fanatic Mike Pence demands that Republicans “not rest” until every state in America outlaws abortions completely now that the conservative Supreme Court has destroyed Roe v. Wade. RT IF YOU WOULD NEVER VOTE FOR MIKE PENCE!","date":"Fri Jun 24 19:22:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re proud of Taylor Swift for using her platform to slam the court’s overturn of Roe, saying that she is “absolutely terrified” that “this is where we are” and women’s rights have been “stripped” away after “decades” of “fighting,” please retweet and follow us!","date":"Fri Jun 24 19:17:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Conservative Dave Portnoy, founder of Barstool Sports, slams the Roe ruling as “nuts” and decries taking away abortion rights while defending guns, points out the Constitution was written by slave owners. RT IF YOU THINK EVERY SANE CONSERVATIVE SHOULD CONDEMN THE COURT!","date":"Fri Jun 24 19:11:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This thread is ON POINT…","date":"Fri Jun 24 19:09:14 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Matt Gaetz loves trafficking underage women, but hates them having rights.","date":"Fri Jun 24 18:52:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump rejoices over the disgusting repeal of Roe v. Wade that he directly caused, calling it the “biggest WIN for LIFE in a generation” and claiming that “in the end” it will “work out for everybody.” RT IF YOU THINK THAT TRUMP HATES WOMEN!","date":"Fri Jun 24 18:49:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This ruling makes the mid-term elections even more important than ever.\n\n#RoeVsWade \nhttps://t.co/IYvlRU8dwC","date":"Fri Jun 24 18:48:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"They said they were just following orders at Nuremberg, too.\nhttps://t.co/SyL21glCuu","date":"Fri Jun 24 18:48:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Music superstar Taylor Swift uses her huge platform to slam the court’s overturn of Roe, says that she is “absolutely terrified” that “this is where we are” and women’s rights have been “stripped” away after “decades” of “fighting.” RT TO THANK TAYLOR FOR SPEAKING UP!","date":"Fri Jun 24 18:33:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Justice Clarence Thomas announces that Republicans want to kill gay marriage next, issues an official opinion calling for the right-wing court to consider overturning marriage equality as well as the right to contraception. RT IF YOU THINK THAT WE MUST EXPAND THE COURT!","date":"Fri Jun 24 18:19:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: AOC slams the Republican-controlled Supreme Court for overturning Roe, says “outlawing abortions” won’t make them “go away” but “only makes them more dangerous” and “people will die” because of this ruling. RT IF YOU VOW TO ELECT DEMOCRATS TO ENSHRINE ABORTION RIGHTS!","date":"Fri Jun 24 18:15:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you would crawl through glass to vote out the vile Republicans who overturned Roe v. Wade, please retweet and follow us to join the fight!","date":"Fri Jun 24 17:24:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden says that the Republican Party’s overturning of Roe v. Wade is a “sad day for our country” but “it doesn’t mean the fight is over” and we need to “restore” Roe as “law of the land” by electing more Democrats. RT IF YOU VOW TO VOTE BLUE!","date":"Fri Jun 24 17:23:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Senator Joe Manchin, a “Democrat,” claims that he “trusted” Neil Gorsuch and Brett Kavanaugh “when they testified under oath” that Roe v. Wade was “settled legal precedent” and he’s “alarmed.” RT TO DEMAND THAT HE ABOLISH THE FILIBUSTER TO ENSHRINE ABORTION RIGHTS!","date":"Fri Jun 24 16:05:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Republicans think that overturning Roe v. Wade won’t hurt them. Retweet this if you would crawl through glass to vote against them next election!","date":"Fri Jun 24 15:50:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Insiders reveal that Trump is “hate-watching” every minute of the January 6 Committee’s public hearings and is regularly “reaching the point of being about to scream at the TV” because “no one” is “defending” him. RT IF YOU FEEL ZERO PITY FOR TRUMP!","date":"Fri Jun 24 13:24:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The US Senate defies the Supreme Court, passes the first bipartisan gun safety reforms bill in nearly three decades. The bill will now head to President Biden’s desk, where he has already decided that he will sign it. RT IF YOU THINK THAT THIS IS GREAT NEWS!","date":"Fri Jun 24 02:33:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Now why do you suppose they would ask for a pardon if they hadn't done anything criminal?\nhttps://t.co/LNevC0UCQI","date":"Fri Jun 24 00:41:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"https://t.co/pvPgq00G12","date":"Thu Jun 23 23:42:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Harvard’s constitutional law expert demands that Marjorie Taylor Greene be disqualified from running for November’s election now that the January 6 Committee just revealed that she begged Trump for a pardon for “engaging in insurrection.” RT IF SHE MUST BE DISQUALIFIED!","date":"Thu Jun 23 23:32:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Actor Sean Penn attends today’s January 6 public hearing, shakes hands with each Capitol Officer and thanks them for their service to our nation and democracy. RT TO THANK SEAN PENN FOR TAKING A STAND AGAINST TRUMP!","date":"Thu Jun 23 23:18:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"These people are sick.\nhttps://t.co/S09KmtxrQw","date":"Thu Jun 23 21:48:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"An FBI raid infuriated Jeffrey Clark, but it looks like the raid may be the least of his problems.\n\n#January6thCommiteeHearings \nhttps://t.co/Rzg09g7iqx","date":"Thu Jun 23 21:47:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"LISTEN to the deranged Trump supporter's threats against Congressman Swalwell and his children.\nhttps://t.co/S09KmtxrQw","date":"Thu Jun 23 18:57:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Biden’s Justice Department follows up yesterday’s two subpoenas with several more subpoenas — this time against the Michigan Republicans who signed the “fake slate” of electors in an attempt to help Trump try to steal Biden’s win. RT IF YOU THINK THEY MUST BE LOCKED UP!","date":"Thu Jun 23 18:39:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Republican-controlled Supreme Court escalates its war against the American people, rules that citizens cannot sue police officers for failing to read them their Miranda rights during an arrest. RT IF YOU SUPPORT EXPANDING THE COURT!","date":"Thu Jun 23 17:35:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Whoopi Goldberg rips the Republican-controlled Supreme Court for striking down a NY law limiting concealed carry for guns, calling it “worse than stupid” and a “middle finger to New York.” RT IF YOU SUPPORT EXPANDING THE SUPREME COURT!","date":"Thu Jun 23 17:16:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: New York’s Democratic Gov. Kathy Hochul slams the right-wing Supreme Court for striking down a law limiting who can carry concealed guns, calling it “outrageous” for them to “recklessly” endanger lives like this. RT IF YOU SUPPORT EXPANDING THE SUPREME COURT!","date":"Thu Jun 23 17:06:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Thank you for sharing our meme, @MarkRuffalo. When you follow the NRA’s blood money, all roads lead back to Republican Senators.","date":"Thu Jun 23 16:21:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thankful to the landlord of the building leased by Trumper Lauren Boebert’s gun-themed “Shooters” restaurant who just notified her that he’s ending her lease because he has a “moral” imperative to shut her business down due to her extremism, please RT and follow us!","date":"Thu Jun 23 13:48:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The landlord of the building leased by Trumper Congresswoman Lauren Boebert for her gun-themed “Shooters” restaurant notifies he’s ending her lease because he has a “moral” imperative to shut her business down due to her extremist politics. RT TO THANK THE LANDLORD!","date":"Thu Jun 23 13:41:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Watch the full video where legendary drag queen Barbra Seville EXPOSES Kari Lake as a complete fraud here and follow Occupy Democrats for more breaking news updates! https://t.co/TAg7Y4I4i4","date":"Thu Jun 23 02:34:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Legendary drag performer Barbra Seville just exposed MAGA Arizona Governor Candidate Kari Lake, showing that she partied at Arizona drag bars for over 10 years. Lake recently attacked drag queens and called them groomers. RT IF YOU THINK KARI LAKE IS A HUGE HYPOCRITE!","date":"Thu Jun 23 02:33:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thankful to the thousands of Colorado Democrats who just  registered as unaffiliated in order to vote against Trumper Congresswoman Lauren Boebert In Tuesday’s Republican Party primary election, please RT and follow us for more breaking political news!","date":"Thu Jun 23 01:49:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Thousands of Colorado Democrats register as unaffiliated to vote against Trumper Congresswoman Lauren Boebert In Tuesday’s Republican Party primary election. RT TO THANK COLORADO DEMOCRATS!","date":"Thu Jun 23 01:45:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The coward police chief who horribly bungled the Uvalde school shooting response is placed on administrative leave as the scandal grows. RT IF YOU THINK THAT HE MUST BE FIRED!","date":"Wed Jun 22 23:57:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Trump's guy in Wisconsin isn't taking any chances of alienating his endorser.\nhttps://t.co/E5bsB7jj2a","date":"Wed Jun 22 23:54:54 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The DOJ has been on Trump’s case all along!\n\nhttps://t.co/UxDgV1dXj5","date":"Wed Jun 22 23:54:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Uvalde, Texas School District Superintendent announces that Chief of Police Pete Arredondo has been placed on leave as the investigation into his failed response to the school massacre heats up. RT IF YOU THINK THAT HE MUST BE FIRED!","date":"Wed Jun 22 23:07:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that Trumper Congressman Mo Brooks, who helped Trump plot the January 6 insurrection, just lost his primary, announced his retirement, AND revealed that he got subpoenaed by the January 6 Committee, please RT and follow us for more breaking political news!","date":"Wed Jun 22 21:39:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Trumper Congressman Mo Brooks, who helped Trump plot the January 6 insurrection, loses his primary, announces his retirement, AND reveals that he just got subpoenaed by the January 6 Committee. RT IF YOU FEEL ZERO PITY FOR HIM!","date":"Wed Jun 22 21:34:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that, in BIG escalation of its investigation into Trump’s attempt to steal Biden’s win, the Justice Department just raided the home of one of Trump’s “phony electors” in Georgia and the Virginia home of a lawyer who helped plan the scheme, please RT and follow us!","date":"Wed Jun 22 20:44:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a major escalation of its investigation into Trump’s  attempt to steal Biden’s win, Biden’s Justice Department raids the home of one of Trump’s “phony electors” in Georgia and the Virginia home of a lawyer who helped plan the scheme. RT IF YOU THINK IT’S GREAT NEWS!","date":"Wed Jun 22 20:39:14 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Both @CharlieCrist and @NikkiFried would be a million times better than homophobic loser Ron DeathSantis…","date":"Wed Jun 22 17:47:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Hundreds of America’s top judges demand that U.S. Supreme Court justices be bound by a strict code of ethics in response to Justice Clarence Thomas refusing to recuse himself from January 6 cases that implicate his wife Ginni. RT IF YOU’RE WITH THE HUNDREDS OF JUDGES!","date":"Wed Jun 22 17:39:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re THRILLED that Florida Republican Governor Ron DeSantis’ re-election chances just got put in serious jeopardy as a new poll of Florida voters shows that he’s losing to Democrat Charlie Crist, who is at 48% of the vote compared to DeSantis’ 47%, please RT and follow us!","date":"Wed Jun 22 15:20:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Florida Republican Governor Ron DeSantis’ re-election chances are put in major jeopardy as a new poll of Florida voters shows that he’s losing to Democrat Charlie Crist, who is at 48% of the vote compared to DeSantis’ 47%. RT IF YOU HOPE THAT DESANTIS LOSES IN NOVEMBER!","date":"Wed Jun 22 15:16:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: South Dakota’s legislature impeaches the Republican attorney general who ran over and killed a man on a highway in 2020, ran away from the scene — leaving him to die — and then tried to say that he “thought” that he “hit a deer.” RT IF YOU WISH HIM GOOD RIDDANCE!","date":"Tue Jun 21 23:56:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Two former Tesla employees file a massive class-action lawsuit against Elon Musk’s company, accusing the executives of unjustly approving “mass layoffs” without proper legally-required notice. RT IF YOU HOPE THAT THEY TAKE ELON TO THE CLEANER’S!","date":"Tue Jun 21 22:52:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you support expanding the Supreme Court after Justice Sonia Sotomayor accused the right-wing justices of trying to \"dismantle” the “separation between church and state\" after they struck down a law barring religious schools from receiving taxpayer aid, retweet and follow us!","date":"Tue Jun 21 22:25:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re grateful to CNN's Dana Bash for ripping into Donald Trump and Rudy Giuliani for overseeing a campaign of \"racist terror\" by smearing Africa American election workers in Georgia that resulted in an avalanche of death threats from the MAGA cult, retweet and follow us!","date":"Tue Jun 21 21:52:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: CNN's Dana Bash rips into Donald Trump and disgraced mayor Rudy Giuliani for overseeing a campaign of \"racist terror\" by smearing Africa American election workers in Georgia that resulted in an avalanche of death threats from the MAGA cult. RT TO THANK DANA BASH!","date":"Tue Jun 21 21:28:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"🔥 YES! Republican Eric Greitens should be locked up for this. Democrat Lucas Kunce is running to replace him! Rush a donation to help him flip this seat from Republican to Democrat: https://t.co/p8k8zsPNSU https://t.co/UBo7nVsglU","date":"Tue Jun 21 21:18:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled that Fox News viewers had their delusional bubble popped when anchor Martha MacCallum admitted on-air that the Jan. 6th committee's witnesses are laying out a \"huge, stunning and clear moment” showing a lack of evidence for Trump's Big Lie — RT and follow us!","date":"Tue Jun 21 20:02:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Fox News viewers have their bubble popped as anchor Martha MacCallum admits on-air that the Jan. 6th committee's witnesses are laying out a \"huge, stunning and clear moment” showing a lack of evidence for Trump's Big Lie. RT IF YOU'VE ALWAYS KNOWN BIDEN WON FAIRLY!","date":"Tue Jun 21 19:47:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Marjorie Taylor Greene melts down after Democratic Rep. Marie Newman, whose daughter is trans, hangs the trans flag outside her office across the hall from Greene's — Greene whines she'd be \"rotting in jail\" if she attacked the flag. RT IF YOU SUPPORT TRANS RIGHTS!","date":"Tue Jun 21 19:05:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Texas Department of Public Safety Director Steve McCraw slams the behavior of the cowardly Uvalde police as an \"abject failure\" and reveals that the classroom door was unlocked while the cops incompetently searched for a key. RT IF YOU THINK THE COPS MUST BE FIRED!","date":"Tue Jun 21 18:56:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Ultra MAGA Sen. Ron Johnson belongs in prison after bombshell texts revealed that one of his top staffers tried to deliver a slate of fake electors to Vice President Mike Pence to illegally overturn Joe Biden's election victory — please retweet and follow us!","date":"Tue Jun 21 18:34:25 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Maryland police arrest a 13-year-old middle schooler after he allegedly brought a loaded, untraceable \"ghost gun\" to school this morning, causing a 90-minute lockdown — proving that Joe Biden is right to target ghost guns. RT IF YOU SUPPORT GUN LAW REFORM IMMEDIATELY!","date":"Tue Jun 21 18:32:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Bombshell text messages reveal that a top staffer for Ultra MAGA Sen. Ron Johnson attempted to deliver a slate of fake electors to Vice President Mike Pence to help illegally overturn Joe Biden's election victory. RT IF YOU THINK THAT WE NEED TO LOCK THESE PEOPLE UP!","date":"Tue Jun 21 18:22:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Arizona GOP House Speaker Rusty Bowers exposes Rudy Giuliani during testimony to the Jan. 6th committee, says he admitted: “We’ve got lots of theories, but we just don’t have the evidence\" for their bogus election claims. RT IF YOU THINK THAT GIULIANI MUST BE INDICTED!","date":"Tue Jun 21 18:04:41 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump gets VERY bad news as the Jan. 6th committee subpoenas the documentary filmmaker who had unprecedented access to Trump and his conspirators and filmed raw footage of them discussing the 2020 election. RT IF YOU THINK THAT AMERICANS MUST SEE THOSE TAPES!","date":"Tue Jun 21 17:32:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Justice Sonia Sotomayor accuses the six right-wing justices of trying to \"dismantle the wall of separation between church and state\" after they strike down a Maine law barring religious schools from receiving tax-payer aid. RT IF YOU THINK THAT WE MUST EXPAND THE COURT!","date":"Tue Jun 21 17:13:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you LOVE that a Fox News host humiliated GOP Senate candidate Dr. Oz on-air for lying that he’s “favored” to beat Democrat John Fetterman by pointing out that Oz is actually “trailing significantly” in the polls — please retweet, follow us, and donate to Fetterman!","date":"Tue Jun 21 16:50:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Fox News host Bill Hemmer humiliates Republican Senate candidate Dr. Oz on air for claiming that he’s “favored” to beat Democrat John Fetterman by pointing out that Oz is actually “trailing significantly” in the polls. RT IF YOU HOPE THAT JOHN FETTERMAN CRUSHES DR. OZ!","date":"Tue Jun 21 16:29:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a clear sign that the GOP is circling the drain for good, Donald Trump praises the Texas Republican Party as “powerful” for officially rejecting Joe Biden’s election win and falsely asserting mass voter fraud in “key metropolitan areas.” RT TO CONDEMN THE GOP!","date":"Tue Jun 21 16:04:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that, in a historic move, President Biden just announced that he is appointing Chief Malerba, the longtime chief of the Mohegan Tribe, as U.S. Treasurer — making her the first Native American to serve as the U.S. Treasurer — please RT &amp; follow us for more news!","date":"Tue Jun 21 12:05:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a historic move, President Biden announces that he is appointing Chief Malerba, the longtime chief of the Mohegan Tribe, as U.S. Treasurer, making her the first Native American to serve as the U.S. Treasurer. RT IF YOU SUPPORT PRESIDENT BIDEN’S HISTORIC DECISION!","date":"Tue Jun 21 12:01:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The parents of victims of the Uvalde, Texas Elementary school mass shooting officially demand the resignation of the Police Chief who ordered officers to stand down as the shooter gunned down their kids, saying that he “must be held accountable.” RT IF HE MUST RESIGN!","date":"Tue Jun 21 03:46:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Meidas is reporting on the story we expressed in Arizona of EXTREME HYPOCRISY about Arizona’s Republicans gubernatorial nominee.\n\nYou’ve gotta watch this.\n\nhttps://t.co/Vrgqlnlk1t","date":"Tue Jun 21 02:46:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: California Governor Gavin Newsom gives Trumpers a badly-needed wake up call with a new post on Trump’s TruthSocial, telling them that “California’s GDP growth outpaced every single red state this year,” and that “the top three states are Democratic.” RT TO THANK NEWSOM!","date":"Tue Jun 21 02:18:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Missouri Fraternal Order of Police releases an official statement blasting Missouri Republican Senate Candidate Eric Greiten’s new ad in which he “hunts” politicians, calling it “deplorable” &amp; “reprehensible.” RT IF YOU THINK THAT GREITENS MUST DROP OUT OF THE RACE!","date":"Tue Jun 21 02:13:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Another HUGE bombshell about the Uvalde police department drops as it’s exposed that the coward cops had four ballistic shields that would have protected them but still refused to enter the classroom as the killer rampaged. RT TO DEMAND THE COPS RESIGN!","date":"Mon Jun 20 23:12:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that the January 6 Committee just announced that Georgia Secretary of State Brad Raffensperger will testify at tomorrow’s hearing about how Trump ordered him to illegally “find 11,780 votes” in order to steal Biden’s win, please RT and follow us for more news!","date":"Mon Jun 20 22:57:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Uvalde, Texas Fire Marshall kicks a chaplain, father of a victim, and reporters out of a City Hall meeting so that Texas legislators &amp; law enforcement can meet in secret to discuss the Uvalde elementary school mass shooting. RT IF YOU THINK THE MEETING SHOULD BE PUBLIC!","date":"Mon Jun 20 22:00:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In a deplorable display of hypocrisy, former Trump Vice President Mike Pence declares that he has “never” in his “lifetime” seen a president use as many “falsehoods” as President Biden. RT IF YOU THINK THAT MIKE PENCE IS A SHAMELESS HYPOCRITE!","date":"Mon Jun 20 21:43:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Disgraced, defeated GOP Rep. Madison Cawthorn finally turns on his cult leader Donald Trump, says that he shouldn't have sent his Jan. 6th mob to the Capitol because it \"put everything in a dangerous setting.\" RT IF YOU THINK THAT TRUMP IS TO BLAME FOR THE INSURRECTION!","date":"Mon Jun 20 21:21:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Anti-Trump GOP Rep. Adam Kinzinger reveals that his wife received a horrific letter from someone who lives near them saying that he will be \"executed\" and that she and their 5-month-old son \"will be joining\" him in \"hell.\" RT TO DEMAND THAT THE FBI INVESTIGATE!","date":"Mon Jun 20 19:00:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled that minister Kevin Smith slammed MAGA pastors as \"whores\" for Trump and “losing their minds when a Black man was elected president\" during his remarks at the Southern Baptist  Conference — causing many of them to erupt in outrage, please RT and follow us!","date":"Mon Jun 20 18:24:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"“Mr. Garland, if you allow Trump to walk, then you have to ask yourself this — because this is something that I and many Americans are already asking ourselves — what is the point of the Constitution if criminals walk free?” via @davidmweissman \n\nhttps://t.co/QLlJKofiXo","date":"Mon Jun 20 18:18:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Minister Kevin Smith slams MAGA pastors as \"whores\" for Donald Trump and “losing their minds when a Black man was elected president\" during his remarks at the Southern Baptist  Conference — causing many of them to erupt in outrage. RT TO THANK HIM FOR CALLING THEM OUT!","date":"Mon Jun 20 18:06:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden announces that he hopes to have a decision \"by the end of the week\" on whether or not to support a federal gas tax holiday — which could also include sending gas rebate cards to Americans. RT TO SHOW BIDEN YOU SUPPORT THIS IDEA!","date":"Mon Jun 20 17:38:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thankful to Democratic Rep. Jamie Raskin for sounding the alarm that Trump is \"essentially\" admitting that he attempted a coup and if we \"allow impunity\" for \"attempts at unconstitutional seizures of power\" we are \"inviting it again,\" please retweet and follow us!","date":"Mon Jun 20 17:30:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Democratic Rep. Jamie Raskin sounds the alarm, says Trump is \"essentially\" admitting that he attempted a coup and if we \"allow impunity\" for \"attempts at unconstitutional seizures of power\" we are \"inviting it again.\" RT IF YOU THINK THAT TRUMP BELONGS BEHIND BARS!","date":"Mon Jun 20 16:55:30 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"In the DeSantis regime, lying is the most important qualification.\nhttps://t.co/bsS8MHul0f","date":"Mon Jun 20 16:15:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: GOP Senate candidate Eric Greitens releases a DEEPLY disturbing video of him \"RINO hunting\" with a shotgun and armed men, a reference to \"Republicans In Name Only\" — urges voters to \"join the MAGA crew\" and start \"bagging\" RINOS. RT IF YOU THINK IT'S A CALL TO VIOLENCE!","date":"Mon Jun 20 15:59:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a major loss for Trump, the January 6 Committee announces that Georgia Secretary of State Brad Raffensperger will testify at tomorrow’s hearing about how Trump ordered him to illegally “find 11,780 votes” in order to steal Biden’s win. RT TO THANK BRAD RAFFENSPERGER!","date":"Mon Jun 20 15:42:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A far-right activist humiliates Ted Cruz in public, saying: \"Remember how Trump made fun of your wife and then you go become best friends with Trump?\"  Cruz responds with a pathetic, stammering: \"God bless you.\" RT IF YOU THINK THAT TED CRUZ IS SPINELESS!","date":"Mon Jun 20 15:39:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Our news report:\n\nhttps://t.co/ybPldb5n82","date":"Mon Jun 20 11:45:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: A Louisiana judge revokes child custody from a woman who was raped when she was underage, gives full custody to the rapist who impregnated her, and even forces her to pay child support to her rapist. RT IF YOU THINK THAT THE JUDGE MUST BE REMOVED FROM THE BENCH!","date":"Sun Jun 19 23:59:44 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you support the January 6 Committee and think that Trump must be criminally prosecuted for orchestrating the deadly January 6 insurrection that sent over 140 Capitol Officers to the hospital, please RT and follow us so that, together, we can continue to hold Trump accountable!","date":"Sun Jun 19 23:23:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The January 6 Committee drops bombshell, reveals that it has evidence that directly ties Donald Trump to the “fraudulent elector” plot that attempted to steal Biden’s win by overturning the election. RT IF YOU THINK THAT TRUMP MUST BE CRIMINALLY CHARGED!","date":"Sun Jun 19 23:21:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Donald Trump will be exceedingly unhappy about this new poll.\nhttps://t.co/CupHjPujDr","date":"Sun Jun 19 21:59:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a HUGE win for the January 6 Committee, a new ABC poll shows that public support for a criminal prosecution of Trump for inciting the insurrection has skyrocketed since the public hearings began, up to 58% from 50% before. RT IF YOU SUPPORT THE JANUARY 6 COMMITTEE!","date":"Sun Jun 19 20:13:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Truly, a higher level of hypocrisy was discovered by this Republican. \n\nhttps://t.co/QuJwjsVN0I","date":"Sun Jun 19 19:28:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Happy #FathersDay! Hopefully the last one without this clown getting indicted. https://t.co/CupHjPujDr","date":"Sun Jun 19 19:27:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Worst father EVER.\nhttps://t.co/10CgYSemV3","date":"Sun Jun 19 17:01:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that a Watergate prosecutor just declared that Georgia prosecutors will “send Trump to prison” because the evidence they against him for trying to steal Biden’s win is “beyond a reasonable doubt” since it’s “all on tape,” please RT and follow us for more news!","date":"Sun Jun 19 13:43:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Watergate prosecutor declares that Georgia prosecutors will “send Trump to prison” because the evidence they against him for trying to steal Biden’s win is “beyond a reasonable doubt” — and Trump “has no defense” since it’s “all on tape.” RT IF TRUMP MUST BE CHARGED!","date":"Sun Jun 19 13:36:56 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former U.S. Army prosecutor announces that Trump “is on the hook” for “treason and seditious conspiracy” because he “levied war against the United States,” demands that he be “criminally prosecuted” to save our democracy. RT IF YOU THINK THAT TRUMP MUST BE LOCKED UP!","date":"Sun Jun 19 12:41:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Trump’s Proud Boys physically attack Republican Congressman Dan Crenshaw and his staff for refusing to support Trump’s Big Lie, call Crenshaw “a traitor” who “should be hanged for treason.” RT IF YOU THINK THAT TRUMP’S PROUD BOYS MUST BE ARRESTED IMMEDIATELY!","date":"Sun Jun 19 01:34:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"I'd be losing my religion over this if I were an Evangelical. https://t.co/RYwsXJtQOz","date":"Sat Jun 18 23:23:01 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Even a die-hard conservative like Crenshaw isn't far-right enough for these extremists.\nhttps://t.co/HLH9z6XyNd","date":"Sat Jun 18 21:49:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Accusations of manipulation are dogging Musk!\nhttps://t.co/b6qWaizE91","date":"Sat Jun 18 20:18:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The Starbucks chief has something to say about kids these days and it's not particularly positive.\nhttps://t.co/0TOWkdkkfy","date":"Sat Jun 18 19:15:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that Al Franken just demanded that Trumper Senator Ted Cruz be expelled from the Senate for helping incite Trump’s insurrection, plotting to overturn the election with John Eastman, &amp; then voting to steal Biden’s win AFTER the attack on our Capitol, RT &amp; follow us!","date":"Sat Jun 18 18:19:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Al Franken demands that Trumper Senator Ted Cruz be expelled from the Senate for helping incite Trump’s insurrection, plotting to overturn the election with John Eastman, and then voting to steal Biden’s win AFTER the attack on our Capitol. RT IF YOU’RE WITH AL FRANKEN!","date":"Sat Jun 18 18:13:44 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Let's see how she tries to talk her way out of this!\nhttps://t.co/neEViQKqma","date":"Sat Jun 18 17:13:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that the New Mexico Republicans who refused to certify a Democrat who won his election just folded, certifying the Democrat’s victory after facing legal threats from the state’s Supreme Court and Attorney General, please RT and follow us for more breaking news!","date":"Sat Jun 18 02:06:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The New Mexico Republicans who refused to certify a Democrat who won his election fold, certify the Democrat’s victory after facing legal threats from the state’s Supreme Court and Attorney General. RT IF YOU THINK THAT THIS IS GREAT NEWS!","date":"Sat Jun 18 01:55:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Legendary Watergate reporters Bob Woodward and Carl Bernstein call out Ginni Thomas for being “very obviously involved” in a “conspiracy” for a “coup” and suggest that Clarence Thomas may have leaked her info about the court. RT TO DEMAND THAT CLARENCE THOMAS RESIGN!","date":"Fri Jun 17 22:02:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Heartbreaking new poll reveals that 4 out 10 Americans are saddled with crippling active debt from medical and dental bills — clearly demonstrating that it's time for the United States to pass universal healthcare for all. RT IF YOU SUPPORT UNIVERSAL HEALTHCARE!","date":"Fri Jun 17 21:08:56 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump offensively compares the Jan. 6th rally that evolved into a deadly Capitol riot to MLK Jr.'s beloved \"I have a dream\" rally — and brags that his crowd was actually bigger than the Civil Rights rally. RT IF YOU THINK THAT TRUMP BELONGS IN JAIL!","date":"Fri Jun 17 20:42:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Gun freak Lauren Boebert rants that there can be no \"compromise\" of any kind on gun control even though innocent children are paying for Republican gun fetishism with their lives — proving that the GOP can't be reasoned with. RT IF YOU THINK THAT BOEBERT IS A MONSTER!","date":"Fri Jun 17 20:04:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump absurdly claims that politics has become the \"religion\" of the left and \"warped\" us so that we can't tell the difference between \"good and evil,\" an ironic smear since Trump is basically a cult leader at this point. RT IF YOU RECOGNIZE TRUMP AS TRUE EVIL!","date":"Fri Jun 17 19:41:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump attacks Democratic superstar Adam Schiff at a right-wing religious conference, bizarrely calling him \"watermelon head\" in a confusing rant. RT IF YOU THINK THAT ADAM SCHIFF IS A MUCH BETTER AMERICAN THAN TRUMP!","date":"Fri Jun 17 19:09:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Music legend Dolly Parton donates a \"transformative gift\" of $1 million to aid research into pediatric infectious disease research, including ways to fight COVID-9 in children — Parton says she loves \"all children\" and none should \"have to suffer.\" RT TO THANK DOLLY!","date":"Fri Jun 17 18:56:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Video shows Deputy Brittany Brokop more concerned about losing her gun after fatally shooting Michael Trappett, a man suffering from a mental health crisis, than she was his life, saying: \"Guess I’m gonna lose my gun again.\" RT IF YOU THINK THAT OUR POLICING IS BROKEN!","date":"Fri Jun 17 18:36:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MyPillow CEO Mike Lindell melts down after Walmart announces that they'll no longer sell his crappy products as he pushes the Big Lie — he calls it a \"battle of historical proportions\" and \"evil itself\" that is \"kinda like back in Nazi Germany.\" RT TO THANK WALMART!","date":"Fri Jun 17 18:07:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The coward cops of Uvalde who stood by as children were killed are working with a law firm to prevent the release of the records on the school shooting, claiming they contain “highly embarrassing information.\" RT IF YOU THINK THAT WE HAVE A RIGHT TO SEE THE RECORDS!","date":"Fri Jun 17 18:00:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Caroline Edwards, the Capitol cop who was knocked unconscious and suffered a brain injury during the Jan. 6th insurrection, and who has FINALLY been medically cleared to return to duty should sue Donald Trump for all he's worth — please retweet and follow us!","date":"Fri Jun 17 17:57:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that New Mexico’s Secretary of State just referred the Trumper County Commissioner who is refusing to certify a Democrat who won his election this week to the Justice Department for criminal prosecution, please RT &amp; follow us for more breaking political news!","date":"Fri Jun 17 17:30:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Congressman Bill Pascrell demands that Supreme Court Justice Clarence Thomas “resign” for “poisoning” America by “participating in the worst breach of judicial trust ever seen” when he covered up his wife’s planning of Trump’s insurrection. RT IF THOMAS SHOULD RESIGN!","date":"Fri Jun 17 17:23:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Caroline Edwards, the Capitol cop who was knocked unconscious and suffered a brain injury during the Jan. 6th insurrection, is finally medically cleared to return to duty. RT IF YOU THINK THAT SHE SHOULD SUE DONALD TRUMP!","date":"Fri Jun 17 17:13:56 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that billionaire Elon Musk is a complete fake for firing numerous SpaceX employees for calling out his asinine public behavior as an \"embarrassment\" even though he is constantly saying he loves “free speech,” please retweet and follow us!","date":"Fri Jun 17 17:07:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Ted Cruz is unfit to serve because he’s focused on whining about the Buzz Lightyear movie selling “lesbian toys” while meanwhile his state of Texas hits a record high for power demand as climate change drives a brutal heat wave, please RT and follow us!","date":"Fri Jun 17 16:52:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: SpaceX fires numerous workers for criticizing billionaire boss Elon Musk's asinine public behavior as an \"embarrassment\" — proving that all of his vocal support for \"free speech\" is just a farce to help right-wingers. RT IF YOU THINK THAT ELON MUSK IS A COWARD!","date":"Fri Jun 17 16:36:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Ted Cruz throws a fit over the new Buzz Lightyear movie because they’re selling “lesbian toys” for it — meanwhile his state of Texas hits a record high for power demand as climate change drives a brutal heat wave. RT IF YOU THINK THAT CRUZ IS UNFIT TO SERVE!","date":"Fri Jun 17 16:17:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: New Mexico’s Secretary of State refers the Trumper County Commissioner who is refusing to certify a Democrat who won his election this week to the Justice Department for criminal prosecution. RT IF YOU THINK THAT THE JUSTICE DEPARTMENT MUST PROSECUTE HIM!","date":"Fri Jun 17 04:37:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Three people shot, one dead, in a shooting inside of a church in Birmingham, Alabama. RT IF YOU THINK THAT IT’S TIME FOR CONGRESS TO ADDRESS AMERICA’S GUN CRISIS!","date":"Fri Jun 17 02:00:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled to hear that Walmart, the biggest retailer in the world, will no longer sell MyPillow products as its founder and CEO Mike Lindell continues to push deranged lies about the 2020 election being stolen from Trump — please retweet and follow us!","date":"Fri Jun 17 00:41:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Walmart, the biggest retailer in the world, announces that it will no longer sell MyPillow products as its founder and CEO Mike Lindell continues to push deranged lies about the 2020 election being stolen from Trump. RT TO THANK WALMART FOR TAKING A STAND!","date":"Thu Jun 16 23:40:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that it’s a great idea that California Gov. Gavin Newsom, a proud Democrat, has joined Donald Trump's website Truth Social in order to start \"calling out Republican lies\" and force the MAGA crowd to actually hear the truth for once, please retweet and follow us!","date":"Thu Jun 16 23:20:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: California Gov. Gavin Newsom, a proud Democrat, announces that he has joined Donald Trump's website Truth Social in order to start \"calling out Republican lies\" and force the MAGA crowd to actually hear the truth for once. RT IF YOU THINK THAT'S A GREAT IDEA!","date":"Thu Jun 16 23:02:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"TOWN HALL📹📹📹\n\nAmerica Speaks with fmr. Representative Max Rose is starting at 7pm eastern.\n\nhttps://t.co/7fS9t0u8bS","date":"Thu Jun 16 21:58:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you agree with hero cop Michael Fanone who survived the deadly Jan. 6th insurrection that those who tried to illegally overturn the election need to be prosecuted for \"conspiracy\" if there is any \"evidence of criminal activity,\" please retweet and follow us!","date":"Thu Jun 16 21:25:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Hero cop Michael Fanone who survived the deadly Jan. 6th insurrection calls for those who tried to illegally overturn the election to be prosecuted for \"conspiracy\" if there is any \"evidence of criminal activity.\" RT IF YOU WANT THE SAME THING!","date":"Thu Jun 16 21:08:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Angered by the Facebook police banning liberal opinions, liberals are flocking to https://t.co/IO2pIBwKJt a new Facebook competitor. Download the app here: https://t.co/0g1ow6UStu","date":"Thu Jun 16 20:44:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you love that Democratic Rep. Hakeem Jeffries ripped into Justice Clarence Thomas and his treasonous wife Ginni for trying to \"steal the election\" and \"overturn the United States government\" to \"install a tyrant\" because she \"didn't like the outcome,\" please RT and follow us!","date":"Thu Jun 16 20:31:14 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Democratic Rep. Hakeem Jeffries rips into Justice Clarence Thomas and his treasonous wife Ginni for trying to \"steal the election\" and \"overturn the United States government\" to \"install a tyrant\" because she \"didn't like the outcome.\" RT TO THANK HAKEEM JEFFRIES!","date":"Thu Jun 16 19:46:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Jan. 6th committee drops another stunning bombshell — reveals that Donald Trump intentionally wrote his tweet attacking Mike Pence AFTER he learned that the Capitol had been violently breached. RT IF YOU THINK THAT IT'S TIME TO LOCK UP DONALD TRUMP FOR GOOD!","date":"Thu Jun 16 19:17:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: SpaceX employees begin writing an open letter that publicly calls out CEO Elon Musk’s “embarrassing” tweets, declaring them “a distraction” that “does not reflect” the company’s “work, mission, or values.” RT TO THANK THE SPACEX EMPLOYEES FOR SETTING ELON MUSK STRAIGHT!","date":"Thu Jun 16 19:16:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Justice Clarence Thomas' deranged wife Ginni arrogantly boasts that she's \"can't wait\" to talk to the Jan. 6th committee about her attempts to illegally overturn the 2020 election for Trump, claims there are \"misconceptions.\" RT IF YOU HOPE THAT SHE ENDS UP IN JAIL!","date":"Thu Jun 16 19:02:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former federal judge J. Michael Luttig, a former advisor to Mike Pence, testifies that Pence would have led a \"revolution within a constitutional crisis\" if he had followed Trump's illegal order to reject the 2020 election results. RT TO DEMAND THAT TRUMP BE INDICTED!","date":"Thu Jun 16 18:35:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Trump must be indicted after Mike Pence's former counsel revealed that attorney John Eastman admitted in front of Trump on Jan. 4th that his proposals would violate the Electoral Count Act — meaning Trump knew they were breaking the law, please RT and follow us!","date":"Thu Jun 16 17:56:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Mike Pence's former counsel drops a HUGE bombshell, reveals that attorney John Eastman admitted in front of Trump on Jan. 4th that his proposals would violate the Electoral Count Act — meaning Trump knew they were breaking the law. RT TO DEMAND THAT TRUMP BE INDICTED!","date":"Thu Jun 16 17:42:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Attorney John Eastman, who emailed with Ginni Thomas about overturning the election, claimed to have \"inside\" information that the Supreme Court had a \"heated fight\" over whether to hear Trump's election challenges. RT IF YOU THINK THAT THE COURT MUST BE INVESTIGATED!","date":"Thu Jun 16 17:21:30 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: January 6 Committee Chairs Bennie Thompson &amp; Liz Cheney announce that “it’s time” to interview Supreme Court Justice Clarence Thomas’ wife Ginni after she was busted plotting to steal Biden’s win with “Big Lie” architect John Eastman. RT IF YOU THINK THAT’S GREAT NEWS!","date":"Thu Jun 16 17:05:54 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thankful to the judge who showed no sympathy to the doctor who illegally entered the Capitol on Jan 6th after she whined her \"reputation has been shredded,\" telling her: \"I think you well knew what you were doing\" and sentencing her to prison — please RT and follow us!","date":"Thu Jun 16 17:05:01 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Judge shows ZERO sympathy to a doctor who illegally entered the Capitol during the Jan. 6th insurrection after she whines her \"reputation has been shredded,\" telling her: \"I think you well knew what you were doing\" and sentencing her to prison. RT TO THANK THE JUDGE!","date":"Thu Jun 16 16:56:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that MAGA Senate candidate Herschel Walker should suspend his campaign after he was exposed for having TWO more secret children — despite him hypocritically railing against other people being deadbeat parents, please retweet and follow us!","date":"Thu Jun 16 16:51:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump throws a massive fit over the Jan. 6th hearings, says they’re broadcast by “sick people” and are “slanderous” before pathetically “demanding EQUAL TIME” to push his Big Lie on TV. RT IF YOU THINK THAT TRUMP IS A BIG BABY!","date":"Thu Jun 16 16:17:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA candidate for Senate Herschel Walker is exposed for having TWO more secret children — but hypocritically he constantly rails against other people being deadbeat parents. RT IF YOU THINK THAT IT’S TIME FOR THIS LIAR TO SUSPEND HIS CAMPAIGN!","date":"Thu Jun 16 15:37:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that disgraced Trump “Big Lie” election attorney Sidney Powell just revealed that the Texas Bar Association just served her with official disbarment papers, meaning that she will no longer be able to practice law in the state, please RT and follow us for more!","date":"Thu Jun 16 02:48:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Disgraced Trump “Big Lie” election attorney Sidney Powell reveals that the Texas Bar Association just served her with official disbarment papers, meaning that she will no longer be able to practice law in the state. RT IF YOU THINK THAT SHE DESERVES IT!","date":"Thu Jun 16 02:44:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Apparently, they use the word \"talent\" VERY loosely.\nhttps://t.co/OmOscLHSdQ","date":"Thu Jun 16 02:43:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Clarence Thomas must resign after the  Jan. 6th committee revealed they have emails from Thomas' wife Ginni to Trump attorney John Eastman — proving that her efforts to overturn the election were far more extensive than previously known, please RT and follow us!","date":"Thu Jun 16 01:45:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The first poll of Texas voters since the Uvalde elementary school shooting shows that Trumper Governor Greg Abbott’s lead is evaporating as Beto O’Rourke surges, propelled by women and young voters concerned with Abbott’s obsession with guns. RT IF YOU SUPPORT BETO!","date":"Thu Jun 16 00:48:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This is incredible news. Workers hold all of the real power when they unite!","date":"Thu Jun 16 00:05:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Jan. 6th committee drops the HUGE bombshell that they have emails from Justice Clarence Thomas' wife Ginni to Trump attorney John Eastman — proving that her efforts to overturn the election were far more extensive than previously known. RT TO DEMAND THAT THOMAS RESIGN!","date":"Thu Jun 16 00:02:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The Republican Party escalates its assault on democracy as a New Mexico county that is controlled by Trumpers refuses to certify the election of a Democrat who won his race yesterday. RT IF YOU THINK THAT THIS STORY SHOULD BE GETTING A LOT MORE ATTENTION!","date":"Wed Jun 15 23:38:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: January 6 Committee drops bombshell, reveals that Congress’ underground tunnels that were filmed during Trumper Congressman Barry Loudermilk’s January 5th “Capitol tour” are the very same tunnels that members of Congress evacuated through on January 6. RT TO EXPOSE HIM!","date":"Wed Jun 15 23:20:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Ex-CEO of Cyber Ninjas, the firm Trump hired for his “election fraud audit,” complains that his firm went broke because of “all the lawsuits” filed against it and the fact he “couldn’t recruit new people” because of all the bad press. RT IF YOU FEEL ZERO PITY FOR HIM!","date":"Wed Jun 15 23:00:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: An insurrectionist who carried a treasonous Confederate flag into the Capitol on Jan. 6th is convicted along with his MAGA adult son of entering a restricted area and illegally protesting inside the Capitol. RT TO DEMAND THAT THEY GET SERIOUS PRISON TIME!","date":"Wed Jun 15 22:10:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Does this make you happy for Steve Bannon? https://t.co/pHGBupVGUO","date":"Wed Jun 15 21:44:30 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're deeply grateful to the 81-year-old Dr. Anthony Fauci for leading us through the pandemic even as Trump sabotaged us — and you're wishing him a speedy recovery after contracting COVID-19 for the first time, please retweet and follow us!","date":"Wed Jun 15 19:37:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that MAGA Rep. Barry Loudermilk belongs in jail after the Jan. 6th committee released footage proving that he lied when he said he \"never\" gave a tour of the Capitol on Jan. 5th and at least one insurrectionist was on the tour — please retweet and follow us!","date":"Wed Jun 15 19:26:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Dr. Anthony Fauci, the 81-year-old medical hero who guided the United States through the pandemic, tests positive for COVID-19 for the first time. RT TO WISH DR. FAUCI A SPEEDY RECOVERY!","date":"Wed Jun 15 19:21:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Barry Loudermilk is caught in a damning lie by the Jan. 6th committee after they release footage of him giving a Capitol tour to at least one insurrectionist — Loudermilk previously claimed that he \"never\" gave such a tour. RT IF YOU THINK HE BELONGS IN JAIL!","date":"Wed Jun 15 18:46:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Ron DeSantis makes an offensive joke after billionaire Elon Musk endorses him for 2024, says that he welcomes \"support from African Americans\" — Musk was born in Apartheid South Africa where the white minority brutally oppressed the Black majority. RT TO SHAME THEM!","date":"Wed Jun 15 18:33:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Prosecutors reveal that the mass shooter who killed 10 people in Buffalo left a note for his parents saying that he \"had\" to do the attack to save \"the future of the White race,\" mirroring talking points pushed by Tucker Carlson. RT IF YOU THINK FOX NEWS IS DANGEROUS!","date":"Wed Jun 15 17:25:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Billionaire Elon Musk announces that he wants to vote for far-right Ron DeSantis for president in 2020 — proving that men like Musk will support the vilest anti-LGBTQ politicians if it means they'll get a tax cut. RT IF YOU THINK THAT WE MUST TAX BILLIONAIRES MORE!","date":"Wed Jun 15 17:05:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden to sign a historic, executive order to protect LGBTQ youth from the onslaught of Republican \"bullies\" pushing \"extreme MAGA laws\" to spread bigotry — it will direct some federal agencies to release new plans for being more inclusive. RT TO THANK BIDEN!","date":"Wed Jun 15 16:57:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled to hear that a new poll shows Dr. Oz, who lives in New Jersey, trailing by 9 points to rising Democratic star John Fetterman in the Pennsylvania Senate race, meaning Democrats might take real control of the Senate — please retweet and follow us!","date":"Wed Jun 15 16:32:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Snake-oil salesman Dr. Oz gets some VERY bad news as a new poll shows rising Democratic star John Fetterman leading him by 9 points in the Pennsylvania Senate race, meaning Democrats might be able to take real control of the Senate. RT IF YOU HOPE THAT FETTERMAN WINS!","date":"Wed Jun 15 16:23:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Texas police shoot and kill a man who ran into an elementary school and fired gunshots — one of the shots into a classroom full of children attending a summer camp. Luckily, no children where hit. RT IF YOU THINK THAT IT’S TIME FOR AMERICA TO ADDRESS ITS GUN CRISIS!","date":"Wed Jun 15 05:31:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: So-called “Christian” Lauren Boebert claims that Jesus “didn’t have enough” AR15s to “stop his government from killing him,” because apparently the Republican version of Jesus is a bloodthirsty machine-gun wielding murderer. RT IF YOU THINK THAT BOEBERT IS INSANE!","date":"Wed Jun 15 00:43:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Why is Lauren Boebert so on-brand for Republicans?\n\nBecause the cruelty is always her point.\n\nhttps://t.co/4n1TgTCfip","date":"Wed Jun 15 00:02:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden announces that he has \"never been more optimistic about America\" than he is today because we \"made extraordinary progress by laying a new foundation for our economy\" which will become clear once \"global inflation\" recedes. RT IF YOU SUPPORT JOE BIDEN!","date":"Tue Jun 14 23:35:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Boebert crashes and her reputation burns.\nhttps://t.co/4n1TgTCfip","date":"Tue Jun 14 23:04:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: A new national poll finds that a vast majority of Americans, a whopping 67%, think that Biden’s Justice Department must criminally charge Trump and every other Republican who tried to steal Biden’s win by overturning the election. RT IF YOU ARE ONE OF THOSE 67%!","date":"Tue Jun 14 21:48:06 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Cincinnati Bengals quarterback Joe Burrow demands that Congress implement a “rigorous process” for gun ownership in order to make it much harder to buy “one of those crazy guns that everybody is using” to commit mass shootings. RT TO THANK HIM FOR TAKING A STAND!","date":"Tue Jun 14 21:39:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled to hear that New York's highest court has dealt a huge blow to Donald Trump by rejecting his desperate last-ditch attempt to avoid testifying in NY AG Letitia James' investigation into his crooked business practices — please retweet and follow us!","date":"Tue Jun 14 21:33:25 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In a HUGE win President Biden, Republican Senate Minority Leader Mitch McConnell announces his support for the Senate’s bipartisan gun safety bill, paving the way for increased background checks and “red flag” laws across America. RT IF YOU SUPPORT GUN REFORM!","date":"Tue Jun 14 21:28:56 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The people who did this should not be working at the Border patrol!\nhttps://t.co/buQriJlfu0","date":"Tue Jun 14 21:26:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Lauren Boebert leaves the Budget Committee scratching their heads as she claims that the government is \"addicted to spending\" and this \"addiction\" is \"similar to parmesan cheese and Hunter Biden.\" RT IF YOU THINK THAT REPUBLICANS ARE GETTING DUMBER BY THE DAY!","date":"Tue Jun 14 20:41:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: New York's highest court deals a HUGE blow to Donald Trump and rejects his desperate last-ditch attempt to avoid testifying in NY AG Letitia James' investigation into his crooked business practices — meaning he will now be deposed. RT TO THANK THE COURT!","date":"Tue Jun 14 20:34:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Legal trouble in store for the Uvalde weapon maker.\nhttps://t.co/u4g8Wy46Hd","date":"Tue Jun 14 20:33:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Newsmax host pushes the truly insane conspiracy theory that Speaker Nancy Pelosi wants Justice Kavanaugh to get assassinated so that President Biden can replace him on the Supreme Court. RT IF YOU THINK THAT NEWSMAX MUST BE TAKEN OFF THE AIR!","date":"Tue Jun 14 20:27:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Trump solidifies his position as the pettiest ex-POTUS ever. \nhttps://t.co/2tCswPx9GV","date":"Tue Jun 14 20:14:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The American Muckrackers PAC alleges that Lauren Boebert used to be an \"unlicensed, paid escort\" and met clients using a sugar daddy website — allegedly her escort work led to her having an abortion. The facts are still unconfirmed. RT IF YOU THINK THAT IT SOUNDS TRUE!","date":"Tue Jun 14 20:13:06 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Republican Sen. Kevin Cramer admits that his party cares more about power than saving lives, says they're \"more interested in the red wave\" than in \"red flags,\" referring to proposed gun measures to stop mass shootings. RT IF YOU'LL NEVER VOTE REPUBLICAN!","date":"Tue Jun 14 19:43:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thrilled that New York Attorney General Letitia James just announced that it’s her “duty to investigate” now that the January 6 Committee revealed that Trump stole $250 million dollars from his supporters through his fraudulent “Election Defense Fund,” RT and follow us!","date":"Tue Jun 14 18:48:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Rudy Giuliani melts down after it's revealed that he was drunk when he told Trump to declare election victory while votes were being counted, says he's \"disgusted and outraged\" and claims he only drank his \"favorite drink\" Diet Pepsi. RT IF YOU THINK THAT RUDY IS LYING!","date":"Tue Jun 14 17:53:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Daniel Defense, the gun manufacturer who made the rifle used in Uvalde, must have its lucrative federal contracts revoked for violating the law by donating $100,000 to the Gun Owners Action Fund — please RT and follow us!","date":"Tue Jun 14 17:43:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: House Democrats propose a defense appropriations bill that would ban the Department of Defense from denying active duty service members and civilian employees leave to obtain an abortion. RT IF YOU THINK THAT THIS IS A GREAT IDEA!","date":"Tue Jun 14 17:38:41 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you support former GOP Rep. Mark Stanford's dire warning to his party that they’re “on a path to political extinction” because they're no longer “about ideas” and eventually Trump will die and his “cult of personality” will collapse — please retweet and follow us!","date":"Tue Jun 14 17:34:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Daniel Defense, the gun manufacturer who made the rifle used in Uvalde, is accused of breaking the law by contributing $100,000 to the Gun Owners Action Fund PAC despite holding several federal contracts, which is forbidden. RT TO DEMAND THAT THEIR CONTRACTS BE REVOKED!","date":"Tue Jun 14 16:56:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The truth about Fox News from a former employee!\nhttps://t.co/MU6AI8mqPP","date":"Tue Jun 14 16:46:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former GOP Rep. Mark Stanford sends his party a dire warning, saying they’re “on a path to political extinction” because they are no longer “about ideas” and eventually Trump will die and his “cult of personality” will collapse. RT IF YOU HOPE THAT HE’E RIGHT!","date":"Tue Jun 14 16:35:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Some people JUST can't handle the truth. \nhttps://t.co/yEhSbdItGP","date":"Tue Jun 14 15:58:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: After the January 6 Committee reveals that Trump stole $250 million dollars from his supporters through his fraudulent “Election Defense Fund,” New York Attorney General Letitia James announces that it’s her “duty to investigate.” RT TO THANK ATTORNEY GENERAL JAMES!","date":"Tue Jun 14 14:10:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thankful to the mom who just kicked one of the 31 “Patriot Front” white supremacists who was arrested for trying to storm an Idaho LGBTQ+ pride event out of her house for being a “repugnant” bigot, telling him, “pack your stuff and get out of my house,” RT &amp; follow us!","date":"Tue Jun 14 12:59:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The mother of one of the 31 “Patriot Front” white supremacists who was arrested for trying to storm an Idaho LGBTQ+ pride event kicks him out of her home for being a “repugnant” bigot, telling him, “pack your stuff and get out of my house!” RT TO THANK THE MOM!","date":"Tue Jun 14 12:50:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that Biden Interior Secretary Deb Haaland just announced that Mount Doane in Yosemite National Park, named after an Army officer who massacred 173 Native Americans, will now be renamed First Peoples Mountain in honor of Native Americans, please RT and follow us!","date":"Tue Jun 14 08:05:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Biden Interior Secretary Deb Haaland announces that Mount Doane in Yosemite National Park, named after a U.S. Cavalry Officer who brutally massacred 173 Native Americans, will now be renamed First Peoples Mountain in honor of Native Americans. RT TO THANK DEB HAALAND!","date":"Tue Jun 14 07:50:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Former Republican Congressman Denver Riggleman blasts “liar” Trump and the “2,000 mules” Big Lie documentary he is pushing, declaring that it “was produced by a dozen jackasses.” RT TO THANK HIM FOR TELLING THE TRUTH ABOUT TRUMP AND HIS PHONY “DOCUMENTARY!”","date":"Tue Jun 14 01:57:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Mick Mulvaney defines garbage. https://t.co/pU2zVqUXRH","date":"Tue Jun 14 00:32:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Lock him up! https://t.co/88gtlMjBPW","date":"Mon Jun 13 23:10:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Even though Bitcoin is crashing now, crypto money is flowing freely into Congress and its influence is causing bipartisan problems.\n\nhttps://t.co/oSHQyJimG0","date":"Mon Jun 13 22:11:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you hope that Attorney General Merrick Garland indicts Donald Trump after he announced that he and the \"January 6th prosecutors\" are \"watching all of the hearings\" as the committee unveils their bombshell evidence — please retweet and follow us!","date":"Mon Jun 13 22:03:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Biden's AG Merrick Garland sends shivers through Trump and his insurrectionists by announcing that he and the \"January 6th prosecutors\" are \"watching all of the hearings\" as the committee unveils their bombshell evidence. RT IF YOU THINK THAT HE MUST INDICT TRUMP!","date":"Mon Jun 13 21:22:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that GOP Senate candidate Herschel Walker must suspend his campaign after he was caught in a humiliating lie as it was exposed that he falsely claimed to have worked as a police officer and even an FBI agent — please retweet and follow us to expose him!","date":"Mon Jun 13 21:17:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you LOVE that Bernie Sanders ripped Lindsey Graham apart on Fox News, telling him that candidates he supports are \"maintaining\" Trump's Big Lie and creating \"a real threat to the existence of democracy in America\" for the first time in his life — please retweet and follow us!","date":"Mon Jun 13 20:32:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Bernie Sanders rips Lindsey Graham apart on Fox News, telling him that candidates he supports are \"maintaining\" Trump's Big Lie and creating \"a real threat to the existence of democracy in America\" for the first time in his life. RT TO THANK BERNIE FOR THE TRUTH!","date":"Mon Jun 13 19:48:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Story: https://t.co/IVbgmMPVz9","date":"Mon Jun 13 19:18:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"It's Trump University all over again.\nhttps://t.co/IVbgmMPVz9","date":"Mon Jun 13 19:09:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"These people don't care if they destroy the planet for your children and grandchildren so long as they can hold onto money and power in the short term.","date":"Mon Jun 13 18:57:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Texas' Department of Public Safety asks the state's AG to block the public from seeing the body cam footage from the cowardly cops who responded to the Uvalde shooting, claiming that it could reveal \"weaknesses\" to criminals. RT TO DEMAND TO SEE THE FOOTAGE!","date":"Mon Jun 13 18:33:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think Trump is a grifter after the January 6 Committee just revealed that he “ripped off” his fans to the tune of $250 million by raising money for an “Election Defense Fund” that never existed — and then funneled that money to himself and his inner circle, RT &amp; follow us!","date":"Mon Jun 13 18:05:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: January 6 Committee drops bombshell, reveals that Trump “ripped off” his gullible fans to the tune of $250 million by raising donations for an “Election Defense Fund” that never existed — and then funneling that money to himself and his inner circle. RT TO EXPOSE TRUMP!","date":"Mon Jun 13 17:56:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: GOP Senate candidate Herschel Walker is caught in ANOTHER humiliating lie as it's exposed that he falsely claimed to have worked as a police officer and even an FBI agent. There is absolutely no truth to the claims. RT IF YOU THINK THAT HE MUST SUSPEND HIS CAMPAIGN!","date":"Mon Jun 13 17:52:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former AG Bill Barr testifies to Jan. 6th committee that there was no \"supporting information\" for Trump's \"bullshit\" claim that voting machines were \"designed\" for \"fraud\" and he thought Trump had \"become detached from reality.\" RT TO FORCE TRUMPERS TO HEAR THE TRUTH!","date":"Mon Jun 13 17:31:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Not the guy who lives in New Jersey.\n#VoteFetterman","date":"Mon Jun 13 17:20:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The GOP is slowly slipping away from Trump.\n\nhttps://t.co/q64mQebWUd","date":"Mon Jun 13 16:50:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Story: https://t.co/q64mQebWUd","date":"Mon Jun 13 16:50:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Al Schmidt, the former Republican Philadelphia City Commissioner, torches Trump’s Big Lie about voter fraud saying: “Not only was there not evidence of 8,000 dead voters voting in Pennsylvania. There wasn't evidence of eight.\" RT TO THANK HIM FOR SPEAKING THE TRUTH!","date":"Mon Jun 13 16:36:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Arkansas GOP Governor Asa Hutchison blames the events of January 6th on former president Donald Trump. Hutchison told a Fox host the twice-impeached former Republican president is “politically” and “morally” responsible for the violent events of insurrection day.\n\nRT IF YOU AGREE","date":"Mon Jun 13 16:33:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Jan. 6th committee reveals that Donald Trump “knowingly” relied on false claims about voter fraud and tried to “rob” the American people of their “voice” in their “democracy” which “led to the horrific violence on January 6th.” RT IF YOU THINK THAT HE MUST BE INDICTED!","date":"Mon Jun 13 16:27:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING : A crazed Rudy Giuliani rips up his last few scraps of dignity and ironically smears GOP Rep. Liz Cheney as “completely hysterical” and “gone of her deep end” in response to her Jan. 6th committee remarks. RT IF YOU THINK THAT RUDY IS OFF THE DEEP END!","date":"Mon Jun 13 16:07:41 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"He's the worst. https://t.co/Z6aHQhwT3k","date":"Mon Jun 13 11:36:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that the Department of Justice MUST indict Donald Trump after the Jan. 6th committee dropped its biggest bombshell yet by announcing that they have uncovered enough evidence for a criminal indictment of the disgraced former president — please retweet and follow us!","date":"Mon Jun 13 03:13:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Jan. 6th committee drops its biggest bombshell yet and announces that they have uncovered enough evidence for the Department of Justice to bring a criminal indictment against Donald Trump — possibly leading to hard prison time. RT IF YOU THINK THAT THE DOJ MUST INDICT!","date":"Mon Jun 13 02:58:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled to see viewers shocked after Fox News host Arthel Neville admits that Trump shouldn’t have ended the Iran deal because at least it was “something” and now Iran is closer than ever to nuclear weapons because he refused to negotiate — retweet and follow us!","date":"Mon Jun 13 01:04:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Shocking viewers, Fox News host Arthel Neville admits that Trump shouldn’t have ended the Iran deal because at least it was “something” and now Iran is closer than ever to nuclear weapons because he refused to negotiate. RT IF YOU THINK THAT TRUMP WAS A TOTAL DISASTER!","date":"Sun Jun 12 23:50:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Dr. Oz pretends to hate “illegal immigration” but one of his companies was fined $95 million by ICE for knowingly employing undocumented immigrants — the largest fine ever levied by ICE. RT IF YOU THINK THAT HE’S A LYING HACK!","date":"Sun Jun 12 23:38:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Lauren Boebert appears to pray for President Biden's death at a \"Christian\" event, saying to a crowd \"may his days be few and another take his office\" as the crowd claps and roars with evil laughter. RT IF YOU THINK THAT SHE MUST BE CENSURED!","date":"Sun Jun 12 20:08:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"AOC goes after Boebert, Gaetz, and MTG with her bold challenge.\nhttps://t.co/jQDZvnLKHm","date":"Sun Jun 12 19:32:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"You expected consistency from Donald Trump?\nhttps://t.co/vnEIOyyj5g","date":"Sun Jun 12 18:25:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Trump's lawyers asked Pence to break the law. \n\nWhen that wasn't enough, Trump let the murder mob descend on the Capitol, hoping they'd kill his Vice President for doing his job and following the law.\n\nThat's a crime.\n\n#LockHimUP\n\nhttps://t.co/kziQDgcmAt","date":"Sun Jun 12 18:21:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Stopped BEFORE they could create havoc!\nhttps://t.co/R1rqoZCryk","date":"Sun Jun 12 18:20:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"John Fetterman will be the \"kind of senator\" who's actually from Pennsylvania, the state he's running to represent — unlike this snake-oil merchant who lives in New Jersey.","date":"Sun Jun 12 06:52:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The Fulton County, Georgia District Attorney announces that she will make her decision on whether to slap Trump with felony charges for trying to overturn the 2020 election “as early as this month.” RT IF YOU THINK THAT SHE MUST CHARGE TRUMP!","date":"Sun Jun 12 02:35:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Elon Musk may want to burn his cowboy hat now.\nhttps://t.co/YMhXKVFEJI","date":"Sun Jun 12 00:25:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Is Rupert Murdoch only a fair-weather friend to Donald Trump?\nhttps://t.co/yLlroaW3WM","date":"Sat Jun 11 22:57:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you proudly support the thousands of Americans who have gathered on the National Mall for the \"March for Our Lives\" rally against gun violence, joining their voices together to call for lifesaving gun reform laws — please retweet and follow us to join the fight!","date":"Sat Jun 11 21:31:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Letitia James has the NRA right in her crosshairs now.\nhttps://t.co/4W5vFL7gzd","date":"Sat Jun 11 21:27:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Thousands of Americans gather on the National Mall for the \"March for Our Lives\" rally against gun violence, joining their voices to call for lifesaving gun reform laws. RT IF YOU SUPPORT NEW GUN LAWS!","date":"Sat Jun 11 21:16:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"It's time to cancel Fox News, the author contends.\nhttps://t.co/2SoDwutoHF","date":"Sat Jun 11 16:11:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Parkland survivor David Hogg gives a message of hope and says that he believes attitudes towards gun reform are \"changing for what feels like the first time\" because Americans are \"tired of seeing children being slaughtered.\" RT IF YOU HOPE THAT'S HE'S RIGHT!","date":"Fri Jun 10 23:16:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that MAGA Rep. Scott Perry is a treasonous liar after he melted down because Liz Cheney exposed him for begging Trump for a pardon, calling it “an absolute, shameless, and soulless lie,” even though he won’t testify under oath about it — please retweet and follow us!","date":"Fri Jun 10 23:11:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Scott Perry melts down after Liz Cheney exposes him for begging Trump for a pardon, calling it “an absolute, shameless, and soulless lie,” even though he won’t testify under oath about it. RT IF YOU THINK THAT PERRY IS A TREASONOUS LIAR!","date":"Fri Jun 10 21:59:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Washington Commanders fine coach Jack Del Rio $100,000 for disgracefully calling the deadly Capitol insurrection a “dust-up” compared to the George Floyd protests — the money will be donated to the United States Capitol Police Memorial Fund. RT TO THANK THE COMMANDERS!","date":"Fri Jun 10 21:17:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden bashes ExxonMobil, the oil company that’s destroying the planet and robbing Americans blind at the pump, saying “Exxon made more money than God this year” and needs to start paying their taxes. RT TO THANK BIDEN FOR TAKING A STAND!","date":"Fri Jun 10 21:05:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that it’s hilarious that AOC decimated MAGA Rep. Matt Gaetz, calling him a \"bad haircut in a cheap suit\" who relies on his \"papa's money\" and asked him if he was one of the Republicans who begged Trump for a pardon for working to overturn the election, RT and follow!","date":"Fri Jun 10 21:00:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: AOC decimates MAGA Rep. Matt Gaetz, calling him a \"bad haircut in a cheap suit\" who relies on his \"papa's money\" and asks him if he was one of the slimy Republicans who begged Trump for a pardon after working to overturn the election. RT IF YOU THINK THAT AOC NAILED IT!","date":"Fri Jun 10 20:38:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you were one of the 19 million patriotic Americans who helped deal a crushing blow to Trump and his fellow insurrectionists by watching the Jan. 6th committee's first public hearing yesterday — please retweet and follow us to keep up the fight!","date":"Fri Jun 10 20:26:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Bombshell report reveals that Jared Kushner \"absolutely was intimately involved\" in Trump's Big Lie and helped him plan a \"scorched earth\" scheme to illegally remain in office but \"bailed on the mission early to save himself.\" RT IF YOU THINK KUSHNER BELONGS IN JAIL!","date":"Fri Jun 10 20:07:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In a major loss for Trump and his fellow insurrectionists, new data reveals that a whopping 19 million Americans watched the January 6 Committee’s first pubic hearing yesterday. RT IF YOU WERE ONE OF THE 19 MILLION!","date":"Fri Jun 10 20:07:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled to see AOC turning up the heat on Marjorie Taylor Greene by demanding to know if she or her \"friend\" Lauren Boebert begged Trump for pardons for trying to overturn the 2020 election — please retweet and follow us for more breaking news!","date":"Fri Jun 10 19:53:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you support AOC asking Lauren Boebert if she was one of the Republicans who begged Trump for a pardon after \"tweeting the Speaker's location\" during the insurrection, adding that the \"KKK Caucus\" has been \"really quiet about it today,\" please retweet and follow us!","date":"Fri Jun 10 19:19:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: AOC turns up the heat on Marjorie Taylor Greene and demands to know if she or her \"friend\" Lauren Boebert begged Trump for pardons for trying to overturn the 2020 election, says that she's just \"trying to clear some things up.\" RT IF YOU THINK AMERICA DESERVES TO KNOW!","date":"Fri Jun 10 19:03:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: AOC owns Lauren Boebert for calling the Biden admin \"dystopian\" by asking her if she begged Trump for a pardon after \"tweeting the Speaker's location\" during the insurrection, adding that the \"KKK Caucus\" has been \"really quiet about it today.\" RT TO DEMAND AN ANSWER!","date":"Fri Jun 10 18:50:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Trump fanatic Lauren Boebert claims that \"1984 called\" and wants its \"bleak, immoral, thuggish and deadly totalitarian dystopian future back,\" in the most ridiculous smear of Joe Biden to date. RT IF YOU THINK BOEBERT'S DESCRIPTION SOUNDS MORE LIKE THE TRUMP YEARS!","date":"Fri Jun 10 18:40:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The CEOS of over 220 U.S. companies send a commanding letter to the Senate urging them to \"take bold urgent action to address our gun violence epidemic\" in the wake of the Uvalde shooting. RT TO DEMAND A BOYCOTT OF ANY COMPANY THAT DOESN'T SUPPORT GUN REFORM!","date":"Fri Jun 10 17:25:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Justice Clarence Thomas must resign in shame after bombshell emails revealed that his wife Ginni pressured a staggering 29 Republican lawmakers in Arizona to overturn the 2020 election, far more people than previously realized — please RT and follow us!","date":"Fri Jun 10 17:03:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Bombshell emails reveal that Supreme Court Justice Clarence Thomas’ wife Ginni pressured a staggering 29 Republican lawmakers in Arizona to overturn the 2020 election, far more people than previously realized. RT IF YOU THINK THAT CLARENCE THOMAS SHOULD RESIGN IN SHAME!","date":"Fri Jun 10 16:39:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Reporters reveal that Trumper Congresswoman Lauren Boebert lost crashed her ATV while off-roading and “bailed” out — leaving her son &amp; dog “abandoned” — and then offered “hush money” to her “severely injured” ex-sister-in-law. RT IF YOU THINK THAT BOEBERT IS A DISGRACE!","date":"Fri Jun 10 16:14:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former U.S. Attorney Chuck Rosenberg rips Jared Kushner as “remarkably arrogant and remarkably dumb” for dismissing a White House counsel’s concerns about the attempts to overturn the election as “whining.” RT IF YOU THINK THAT KUSHNER SHOULD BE INDICTED!","date":"Fri Jun 10 16:04:14 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Less than 24 hours into its public launch, Facebook competitor Tribel skyrockets to number 162 on the App Store’s rankings for social networks. You can download the app here: https://t.co/0g1ow6UStu. RT IF YOU’RE GLAD THAT FACEBOOK FINALLY HAS COMPETITION!","date":"Fri Jun 10 15:52:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump hits back at daughter Ivanka, says she “was not involved in looking at, or studying, Election results” and had “checked out” after she told the Jan. 6th committee that she “accepted” that the election was NOT stolen. RT IF YOU DON’T BELIEVE THE BIG LIE!","date":"Fri Jun 10 15:48:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Capitol cop Carolyn Edwards testifies that her \"breath\" caught on Jan. 6th because what she saw was \"just a war zone\" and there were officers \"on the ground, bleeding and throwing up\" and she was \"slipping in people's blood.\" RT TO THANK HER FOR HER BRAVERY!","date":"Fri Jun 10 01:59:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: GOP Rep. Liz Cheney plays a clip of Ivanka Trump testifying to the Jan. 6th committee in which she admits that she \"accepted\" it as fact when former AG Bill Barr said the election wasn't stolen — even though Donald Trump still insists it was. RT TO EXPOSE IVANKA!","date":"Fri Jun 10 01:52:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"To demand indictments all around after GOP Rep. Liz Cheney dropped a bombshell, revealing that numerous House Republicans begged Donald Trump for pardons for their roles in trying to illegally overturn the election — proving they knew they committed crimes, RT and follow us!","date":"Fri Jun 10 01:39:54 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Capitol cop Caroline Edwards gives powerful testimony, says she was \"called a lot of things\" on Jan. 6th including \"Nancy Pelosi's dog,\" a \"traitor,\" and a \"villain\" but adds: \"In actuality, I was none of those things. I was an American.\" RT IF YOU THINK SHE'S A HERO!","date":"Fri Jun 10 01:32:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: GOP Rep. Liz Cheney drops a bombshell, reveals that numerous House Republicans begged Donald Trump for pardons for their roles in trying to illegally overturn the election — proving they knew they committed crimes. RT IF YOU THINK EVERY SINGLE ONE SHOULD BE INDICTED!","date":"Fri Jun 10 01:15:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that GOP Rep. Liz Cheney nailed it by throwing down the gauntlet to her MAGA colleagues for \"defending the indefensible,\" warning them that \"there will come a day when Donald Trump is gone\" but their \"dishonor will remain,\" please retweet and follow us!","date":"Fri Jun 10 01:07:44 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: GOP Rep. Liz Cheney throws down the gauntlet to her Trumper colleagues for \"defending the indefensible,\" warning them that \"there will come a day when Donald Trump is gone\" but their \"dishonor will remain.\" RT IF YOU THINK THAT SHE IS ABSOLUTELY RIGHT!","date":"Fri Jun 10 01:01:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Desperate to keep viewers in the dark about the Jan. 6th hearing, Fox News runs Tucker Carlson's show tonight without commercials — ensuring Republicans don't switch to a real news channel and accidentally see the truth. RT IF YOU THINK THAT FOX VIEWERS ARE BRAINWASHED!","date":"Fri Jun 10 00:55:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: At tonight’s January 6 Committee’s public hearings, Republican Chairwoman Liz Cheney brilliantly lays out the evidence proving that it was “corrupt” Donald Trump who orchestrated the deadly insurrection — and should be held criminally responsible. RT TO THANK LIZ!","date":"Fri Jun 10 00:36:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President of the NAACP calls for the firing of Washington Commanders coach Jack Del Rio for his “offensive and ignorant” comments about the deadly Jan. 6th insurrection which he dismissed as just a “dust-up” when in reality it was an “attempted coup.” RT IF YOU AGREE!","date":"Fri Jun 10 00:07:06 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you love AOC for mocking Marjorie Taylor Greene for stupidly claiming that Republican gun rights are being \"fragrantly\" violated by saying you \"gotta love the smell of gun safety legislation in the morning\" with a nose emoji — please retweet and follow us!","date":"Thu Jun 09 23:35:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Rep. Alexandria Ocasio-Cortez mocks Marjorie Taylor Greene for stupidly claiming that Republican gun rights are being \"fragrantly\" violated by saying you \"gotta love the smell of gun safety legislation in the morning\" with a nose emoji. RT IF YOU LOVE AOC!","date":"Thu Jun 09 22:10:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: At least three people are killed and a Maryland state trooper wounded in a mass shooting at the Columbia Machine manufacturing plant in Smithsburg, Maryland — the Sheriff's office says that the shooter is \"no longer a threat.\" RT IF YOU THINK THAT WE NEED GUN REFORM!","date":"Thu Jun 09 21:43:25 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: On the day of its launch, Tribel social network breaks into the top 200 social networks in Apple’s App Store, sending a clear sign that it is poised to potentially become a Facebook competitor. Download the app here: https://t.co/0g1ow6UStu. RT TO SPREAD THE WORD!","date":"Thu Jun 09 21:13:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Gun nut Lauren Boebert says that Republican Sen. Mitt Romney should \"switch\" parties after he announces his reasonable support for raising the age to buy assault weapons from 18 to 21. RT IF YOU THINK EVERY REPUBLICAN SHOULD SUPPORT THIS MEASURE!","date":"Thu Jun 09 20:53:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Marjorie Taylor Greene humiliates herself in Congress by whining that Republicans' due process rights are being \"fragrantly\" violated, meaning sweet-smelling — what she should have said was \"flagrantly.\" RT IF YOU THINK THAT MTG IS TOO STUPID TO BE IN CONGRESS!","date":"Thu Jun 09 20:34:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Marjorie Taylor Greene melts down on the House floor saying there is \"there is something terrible\" happening in the Jan. 6th probe because Donald Trump's \"character is being defamed\" and it makes her \"sick\" to see it. RT IF YOU THINK THAT DONALD TRUMP IS A MONSTER!","date":"Thu Jun 09 19:55:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Officer Daniel Hodges, the cop who went viral for a video of him bloody and crushed in a door on Jan. 6th, is a hero for saying that Trump has \"no redeeming value\" and Republican leaders shouldn't be able to \"sleep at night,\" please retweet and follow us!","date":"Thu Jun 09 19:06:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Matt Gaetz shamelessly claims that \"young adults\" need access to AR-15s because Democrats want conservatives to be \"vulnerable\" to \"false flag acts of violence\" and \"midterm violence.\" RT IF YOU THINK THAT REPUBLICANS ARE THE VIOLENT ONES!","date":"Thu Jun 09 19:05:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Bombshell testimony from the head of Trump's Secret Service on Jan. 6th reveals that Trump privately discussed the idea of joining his violent and treasonous MAGA mob at the Capitol — proving he supported their riot. RT IF YOU THINK THAT IT'S TIME TO INDICT HIM!","date":"Thu Jun 09 18:33:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: \"Democratic\" Rep. Jared Golden betrays his constituents and party by refusing to vote to nationalize \"red flag laws\" which would permit courts to seize firearms from dangerous individuals deemed a threat to themselves and others. RT TO SHAME HIM INTO DOING HIS DUTY!","date":"Thu Jun 09 18:29:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Officer Daniel Hodges, the cop who went viral for a video of him bloody and crushed in a door on Jan. 6th, says Trump has \"no redeeming value\" and \"managed to con\" his followers, adding that he doesn't know how Republicans \"sleep at night.\" RT TO THANK OFFICER HODGES!","date":"Thu Jun 09 18:23:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think Trump must be barred from holding office after he said that the treasonous Jan. 6th insurrection was the “greatest movement in the history of our country” because it “was not simply a protest” and the election was “stolen,” please retweet and follow us!","date":"Thu Jun 09 18:06:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Donald Trump proudly declares that the deadly Jan. 6th insurrection “represented the greatest movement in the history of our Country” because it “was not simply a protest” and the election was “stolen.” RT IF YOU THINK THAT TRUMP MUST BE BANNED FROM OFFICE FOR LIFE!","date":"Thu Jun 09 17:53:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Ryan Kelley, MAGA candidate for Governor of Michigan, belongs in jail after the FBI arrested him for participation in the deadly Jan. 6th insurrection during which he yelled on video “This is war, baby!\" while marching to the Capitol, please RT and follow us!","date":"Thu Jun 09 17:49:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Ted Cruz is an international joke.\nhttps://t.co/6lJCALRETz","date":"Thu Jun 09 16:55:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Twitter is censoring this video announcement of a new social media competitor. If you can see this, retweet it out to every corner of the country, follow @TribelSocial, and reply with #SaveSocialMedia! https://t.co/dz0nJMtKSo","date":"Thu Jun 09 16:46:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Interestingly, it appears he's somehow registered in two states. \nhttps://t.co/IDvogRDbuL","date":"Thu Jun 09 16:38:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"We CAN’T let them get away with this!","date":"Thu Jun 09 16:24:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A new competitor to Facebook just launched! It has awesome new features and is free of hate, fake news, and bots. They’re going to release their new ad as soon as we get 300 replies with hashtag: #SaveSocialMedia. \n\nGO!","date":"Thu Jun 09 16:06:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"We need 500 replies with the hashtag #SaveSocialMedia  before the video drops.\n\nGO!","date":"Thu Jun 09 15:40:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The FBI arrests Ryan Kelley, a MAGA candidate for Governor of Michigan, for his participation in the deadly Jan. 6th insurrection during which he yelled on video “This is war, baby!\" while marching to break into the Capitol. RT IF YOU THINK THAT HE BELONGS IN JAIL!","date":"Thu Jun 09 15:34:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"@MeidasTouch It is TIME! #SaveSocialMedia","date":"Thu Jun 09 15:34:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Someone just sent Trumper Senator Lindsey Graham this brilliant “donation.” RT IF YOU THINK THAT EVERY REPUBLICAN SENATOR MUST BE FLOODED WITH THESE “DONATIONS!” https://t.co/wsPIvYNNVa","date":"Thu Jun 09 14:40:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thankful to President Biden after he just announces that he will likely issue an executive order to protect abortion rights if the Supreme Court overturns Roe v. Wade later this month, please RT and follow our account to join our fight to protect abortion rights!","date":"Thu Jun 09 14:31:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: President Biden announces that he will likely issue an executive order to protect abortion rights if the Supreme Court overturns Roe v. Wade later this month. RT TO THANK PRESIDENT BIDEN FOR STANDING UP FOR ABORTION RIGHTS!","date":"Thu Jun 09 14:14:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"https://t.co/w9dJUHLi7I","date":"Thu Jun 09 11:20:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The United Nations announces that the ripple effects of Putin's disastrous invasion of Ukraine will wipe out a staggering FIFTEEN YEARS of economic gains for Russia by the end of 2023. RT IF YOU THINK THAT PUTIN IS A FOOL FOR INVADING!","date":"Thu Jun 09 05:06:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: New court filing reveals that Donald Trump, Ivanka Trump, and Trump Jr. will have to testify under oath on July 15 in the financial fraud case brought against the Trump Organization by New York Attorney General Letitia James. RT TO THANK ATTORNEY GENERAL LETITIA JAMES!","date":"Thu Jun 09 01:02:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In a rare bipartisan vote, the House votes to raise the legal age to purchase semi-automatic assault weapons to 21. The bill now goes to the Senate for approval. RT IF YOU THINK THAT THE SENATE MUST PASS IT!","date":"Thu Jun 09 00:34:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Listen to Scott Dworkin, Grant Stern and @ChristopherHahn about Republicans have become the nightmare we warned you about on The Report Card. Join us live now! https://t.co/5wSTjzj5rm","date":"Wed Jun 08 23:05:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Desperate to misdirect from guns, MAGA Rep. Louie Gohmert offensively claims that if we had \"more prayers from leaders,\" plus prayer in schools, and less \"taking God's name in vain,\" we wouldn't have \"mass killings.\" RT IF YOU THINK THAT GUNS CAUSE THE VIOLENCE!","date":"Wed Jun 08 22:07:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Miah Cerillo — the 11-year-old who survived the Uvalde shooting by covering herself in her friend's blood — bravely testifies to Congress about her ordeal and says that she wants \"to have security\" so she doesn't have to fear school anymore. RT IF YOU'RE IN AWE OF MIAH!","date":"Wed Jun 08 21:34:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Rep. Lauren Boebert must be investigated after muckrakers exposed her for allegedly inflating her mileage totals for 2020 and illegally using $20,000 of \"ill-gotten funds” from campaign reimbursements to pay taxes on her restaurant — please RT and follow us!","date":"Wed Jun 08 20:01:41 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Dem. Rep. Hank Johnson shreds through the NRA's lies about guns, pointing out that \"19 good guys with guns didn't stop the killer of 19 school kids and 2 teachers\" in Uvalde and \"we've done it the Republican way for far too long now.\" RT IF YOU AGREE WITH REP JOHNSON!","date":"Wed Jun 08 19:48:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Democratic Sen. Bob Casey boldly urges his colleagues to reconsider new gun laws, stating that he changed his pro-gun stance after Sandy Hook and he “didn’t burst into flames or get run out of town\" because of it. RT IF YOU HOPE THAT CONGRESS HEEDS CASEY'S CALL!","date":"Wed Jun 08 19:25:46 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Republican Rep. Steve Scalise makes the jaw-dropping argument that we shouldn't ban assault weapons because \"airplanes were used\" on 9/11 as \"the weapon\" to \"kill thousands of people\" but there was no \"conversation about banning airplanes.\" RT IF HE DISGUSTS YOU!","date":"Wed Jun 08 18:47:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Jack Del Rio, defensive coordinator for the Washington Commanders NFL team, dismisses the deadly Capitol insurrection as a \"dust up\" because \"nothing burned down\" and questions why anyone is making it a \"major deal.\" RT IF YOU THINK THAT HE SHOULD BE FIRED!","date":"Wed Jun 08 18:23:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If Trump's consiglieri turns, then maybe we'll see indictments after all.\nhttps://t.co/HJ27Mmb1ga","date":"Wed Jun 08 18:21:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Lauren Boebert is exposed by a muckraker PAC for allegedly inflating her mileage totals for 2020 and illegally using $20,000 of \"ill-gotten funds” from campaign reimbursements to pay taxes on her restaurant. RT IF YOU THINK THAT SHE BELONGS IN PRISON!","date":"Wed Jun 08 17:56:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Rep. Alexandria Ocasio-Cortez boldly slams American gun violence as \"internationally embarrassing\" during a House hearing on the topic because we spend \"billions and trillions\" on \"national security\" but our schools are \"being turned into a war zone.\" RT TO THANK AOC!","date":"Wed Jun 08 17:33:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Federal judge deals a HUGE blow to Trump by ordering attorney John Eastman — who tried to overturn the election — to surrender a trove of documents to the Jan. 6th committee including at least one email that could demonstrate evidence of a crime. RT TO THANK THE JUDGE!","date":"Wed Jun 08 16:54:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Kimberly Rubio, a mom whose child was killed in Uvalde, demands a ban on assault rifles &amp; high capacity magazine but says that “for some reason” the “people who fund political campaigns” think “guns are more important than children.” RT TO DEMAND GUN REFORM!","date":"Wed Jun 08 16:23:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think it’s hilarious that Mexican President López Obrador humiliated Sen. Ted Cruz at a press conference by slamming him as an NRA stooge and playing the infamous video of Cruz fleeing from a reporter when asked about the Uvalde school shooting, please RT &amp; follow us!","date":"Wed Jun 08 16:15:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Mexican President López Obrador humiliates Sen. Ted Cruz at a press conference by accusing him of being an NRA stooge and playing the infamous video of Cruz fleeing from a reporter when asked about the Uvalde school shooting. RT TO THANK PRESIDENT OBRADOR!","date":"Wed Jun 08 16:07:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Democrats kill former Trump Education Secretary Betsy DeVos’ controversial “school voucher” program that would have skyrocketed privatization and been the final nail in the coffin for America’s public school system. RT IF YOU THINK THAT THIS IS GREAT NEWS!","date":"Wed Jun 08 03:11:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In a huge slap in the face to Russian President Vladimir Putin and the Kremlin, Russian climber Katya Lipka climbs Mount Everest and unfurls the Ukrainian flag at the summit. RT TO THANK KATYA FOR HAVING THE GUTS TO STAND WITH UKRAINE!","date":"Wed Jun 08 02:52:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This is what Republicans are enabling with weak gun laws. \nhttps://t.co/LcLyoaNz4w","date":"Tue Jun 07 23:57:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you agree with MSNBC's Nicolle Wallace’s statement that Fox News’ refusal to broadcast the Jan. 6th committee's historic hearings provides “smoking gun evidence\" that Republicans are terrified of the committee's findings — please retweet and follow us to spread the truth!","date":"Tue Jun 07 22:49:37 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MSNBC's Nicolle Wallace rips Fox News for refusing to broadcast the Jan. 6th committee's historic hearings, saying that the decision is \"smoking gun evidence\" that Republicans are terrified of the committee's findings. RT IF YOU THINK THAT FOX NEWS IS BAD FOR AMERICA!","date":"Tue Jun 07 22:25:16 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that MAGA lunatic Dr. Oz should suspend his campaign for Pennslyvania Senator and concede to Democrat John Fetterman now that we know that Oz is actually registered to vote in New Jersey and has been since the 1980s — please retweet and follow us!","date":"Tue Jun 07 21:58:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Dr. Oz, the MAGA snake-oil candidate for Senate in Pennslyvania, is humiliated as it's exposed that he's actually registered to vote in New Jersey rather than PA and has been since the 1980s. RT IF YOU HOPE THAT DEMOCRAT JOHN FETTERMAN WINS!","date":"Tue Jun 07 21:38:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Chuck Schumer shreds Fox News for its \"cowardly\" decision to not televise the Jan. 6th committee's historic hearing this week, saying that \"few things obstruct\" the country from \"hearing the truth\" more than Fox's decision. RT IF YOU THINK FOX VIEWERS ARE BRAINWASHED!","date":"Tue Jun 07 21:24:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former Trump official Peter Navarro whines that \"illegal aliens\" and \"Al-Qaeda terrorists\" were \"treated better\" than he was and it felt like \"Stalinist Russia\" when the FBI arrested him for defying a subpoena from the Jan. 6th committee. RT IF YOU HAVE ZERO SYMPATHY!","date":"Tue Jun 07 20:40:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're demanding gun reform after Matthew McConaughey gave a powerful White House press briefing and displayed the green shoes with a heart used to identify one of the children murdered in his hometown of Uvalde before slamming the podium in anger — please RT and follow us.","date":"Tue Jun 07 20:32:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The dating market for killers just isn't what Republicans think it should be...\n\nhttps://t.co/7pNq2KaTJz","date":"Tue Jun 07 20:28:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Fox News host Sandra Smith mocks Matthew McConaughey as \"someone from Hollywood calling to restore our family values\" after his White House press briefing about the mass shooting in his hometown of Uvalde. RT IF YOU THINK MCCONAUGHEY HAS BETTER MORALS THAN FOX NEWS!","date":"Tue Jun 07 20:11:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A disgraceful reporter shouts to ask Matthew McConaughey if he's \"grandstanding\" after he concludes his deeply emotional White House press briefing about innocent children murdered in his hometown of Uvalde. RT IF YOU SUPPORT MCCONAUGHEY SPEAKING OUT FOR GUN REFORM!","date":"Tue Jun 07 19:27:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Arnulfo Reyes, a teacher who was shot multiple times in the Uvalde massacre, says from his hospital bed that he will \"never forgive\" the \"cowards\" in the police who stood outside as children were murdered inside the school. RT IF YOU THINK THAT THE COPS SHOULD RESIGN!","date":"Tue Jun 07 19:19:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Matthew McConaughey holds back tears at his White House press briefing as he showcases the art of Alithia Ramirez, a 10-year-old who was murdered in his hometown of Uvalde — her parents believe sharing her art might make her \"smile in heaven.\" RT TO DEMAND GUN REFORM!","date":"Tue Jun 07 18:58:41 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Actor Matthew McConaughey gives a moving White House press briefing calling for gun reform and displays the green shoes with a heart used to identify one of the children murdered in his hometown of Uvalde before slamming the podium in anger. RT TO DEMAND GUN REFORM NOW!","date":"Tue Jun 07 18:50:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that the Secret Service must investigate Kyle Rittenhouse for a threatening video of him firing a fully automatic military-grade rotary machine gun with a caption directed at President Biden to \"come and take'em, Joe\" — please retweet and follow us!","date":"Tue Jun 07 18:28:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Kyle Rittenhouse posts a threatening video of himself firing a fully automatic rotary machine gun, the same weapon used on military helicopters, with a caption directed at President Biden: \"Come and take'em, Joe.\" RT IF YOU THINK THE SECRET SERVICE SHOULD INVESTIGATE!","date":"Tue Jun 07 18:15:18 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Pennsylvania Democratic Senate candidate John Fetterman — who is facing off against the vile MAGA snake-oil salesman Dr. Oz  — will remain off the campaign trail until July as he recovers from a stroke. RT TO WISH HIM A FULL AND SPEEDY RECOVERY!","date":"Tue Jun 07 18:02:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Republican Sen. Jon Thune of South Dakota absurdly insists that there are \"legitimate reasons\" for owning an AR-15, claiming that in his state \"they use them to shoot prairie dogs\" and \"other types of varmint.\" RT IF YOU THINK THAT YOU DON'T NEED A WAR WEAPON FOR THAT!","date":"Tue Jun 07 17:51:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"AR-15s are for soldiers, not civilians writes veteran @davidmweissman.\n\nhttps://t.co/vPZpdlSVns","date":"Tue Jun 07 17:38:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Democratic Rep. Steve Cohen rips Fox news and says \"it’s harder to get the news through Fox than it is to get it in Russia through Russian television\" even though Russian television is all pro-Putin Kremlin propaganda. RT IF YOU THINK THAT REP. COHEN NAILED IT!!","date":"Tue Jun 07 17:17:50 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"It seems like the election interference is all coming from the Trump side.\nhttps://t.co/F2jFIS2IMR","date":"Tue Jun 07 17:03:56 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re thankful to Watergate reporter Bob Woodward for announcing that he agrees “completely” with Jan. 6th committee member Jamie Raskin that there’s “overwhelming” evidence Trump was involved in a “criminal conspiracy” and the DOJ should indict, please retweet and follow us!","date":"Tue Jun 07 16:46:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Legendary Watergate reporter Bob Woodward agrees “completely” with Jan. 6th committee member Rep. Jamie Raskin that there is “overwhelming” evidence that Trump was involved in a “criminal conspiracy” and the DOJ should indict. RT TO THANK WOODWARD FOR SPEAKING OUT!","date":"Tue Jun 07 16:35:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A Uvalde teacher who survived multiple gunshots and lost ALL of his students calls out the “cowardly” Uvalde police who “just sat there and did nothing” while the shooting occurred, declares that he “will never forgive them.” RT IF YOU WILL NEVER FORGIVE THEM EITHER!","date":"Tue Jun 07 12:47:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Desperate to keep viewers in the dark, Fox News will be the only major network to not air the Jan. 6th committee's primetime hearing on Thursday — and will instead have some paltry coverage on the Fox Business Network. RT IF YOU THINK THAT FOX VIEWERS ARE BRAINWASHED!","date":"Tue Jun 07 04:57:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that every state should copy NY's Democratic Gov. Kathy Hochul's historic bill creating stronger \"red flag\" laws &amp; raising the age to buy semi-automatic rifles to 21 \"so no 18-year-old can walk in on their birthday and walk out with an AR-15,\" retweet and follow us!","date":"Mon Jun 06 23:16:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Kenosha Killer Kyle Rittenhouse whines that the end of high school was \"robbed\" from him and now claims that he will be attending Blinn College District after a Texas A&amp;M spokesperson exposed him for lying and saying that he was going to A&amp;M. RT TO THANK TEXAS A&amp;M!","date":"Mon Jun 06 23:05:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Trump's latest endorsement has many in the MAGA-verse crying foul.\nhttps://t.co/EF0bOa19pO","date":"Mon Jun 06 22:54:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Two violent right-wing extremist groups with ties to Trump's oldest political advisor Roger Stone have been tied together in a seditious conspiracy indictment. \n\n#TrumpCoupAttempt \n\nhttps://t.co/scthgp93Me","date":"Mon Jun 06 22:34:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The owner of the gun store “Leesburg Guns” in Alabama ignites outrage by hanging up a racist sign to mock the killing of George Floyd which reads: “CONGRATULATIONS TO GEORGE FLOYD ON 2 YEARS OF SOBRIETY.” RT TO JOIN THE CALL FOR A FULL BOYCOTT!","date":"Mon Jun 06 22:32:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Proud Boys charged in plot to overthrow America.\n\nhttps://t.co/scthgp93Me","date":"Mon Jun 06 22:24:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Fox News' Jesse Watters whines that Joe Biden isn't wasting his time \"playing golf like other presidents\" even though he can \"play at any course he wants to\" because it shows he's \"given up.\" RT IF YOU'RE GLAD THAT BIDEN ACTUALLY WORKS UNLIKE TRUMP!","date":"Mon Jun 06 21:49:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Sounds like President Biden already \"addressed\" the issue by seizing the fentanyl in question.","date":"Mon Jun 06 21:29:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: U.S. court issues warrants to seize two luxury planes owned by Russian billionaire oligarch Roman Abramovich worth $410 million as punishment for Putin's brutal and illegal invasion of Ukraine. RT IF YOU THINK WE SHOULD KEEP GOING TILL WE BANKRUPT THE OLIGARCHS!","date":"Mon Jun 06 21:27:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Parkland survivor and activist Lauren Hogg hilariously dunks on Marjorie Taylor Greene, saying that MTG \"harasses\" her brother David more than she does and she's \"literally his little sister.\" RT IF YOU STAND WITH THE PARKLAND ACTIVISTS AGAINST THE GOP!","date":"Mon Jun 06 20:45:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Trumper Congresswoman Marjorie Taylor Greene hires disgraced white supremacist Mylo Yiannopoulos, who was previously disowned by Republicans for being caught on an audio recording defending pedophilia. RT TO EXPOSE @RepMTG FOR HIRING AN ACTUAL GROOMER!","date":"Mon Jun 06 20:42:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Philadelphia police arrest an 18-year-old suspect for the weekend's deadly mass shooting that resulted in 3 deaths and 11 people being wounded on the popular, tourist-heavy South Street. RT IF YOU THINK THAT NO 18-YEAR-OLD SHOULD HAVE ACCESS TO GUNS!","date":"Mon Jun 06 20:31:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Tiny violins for these wanna-be Bonnie &amp; Clyde’s Supreme Court loss.\nhttps://t.co/YgNvUjL1Cz","date":"Mon Jun 06 20:28:33 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that top January 6 Committee member Congressman Jamie Raskin just dropped a bombshell, revealing that the committee has evidence against Trump that supports a charge of not only  “incitement” of insurrection, but “conspiracy” charges as well, please RT &amp; follow us!","date":"Mon Jun 06 20:23:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that there MUST be a full investigation after court documents revealed that Amy Coney Barrett's religious group \"People of Praise\" exerted \"almost total control\" over a female member and its founder did \"sexual displays\" in front of his children — RT and follow us!","date":"Mon Jun 06 20:17:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: NY's Democratic Gov. Kathy Hochul signs historic bill creating stronger \"red flag\" laws &amp; raising the age to buy semi-automatic rifles to 21 \"so no 18-year-old can walk in on their birthday and walk out with an AR-15.\" RT IF YOU THINK THAT EVERY STATE SHOULD DO THIS!","date":"Mon Jun 06 20:00:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Proud Boys' leader Henry “Enrique” Tarrio is indicted on new charges of seditious conspiracy along with four of his top lieutenants for their role in the deadly Jan. 6th insurrection. RT IF YOU THINK THAT THEY BELONG IN PRISON!","date":"Mon Jun 06 19:47:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The scandal over Justice Amy Coney Barrett's religious group \"People of Praise\" deepens as court documents reveal that the group's founder allegedly regularly showered with his 10 and 11-year-old daughters. RT TO DEMAND AN INVESTIGATION IMMEDIATELY!","date":"Mon Jun 06 19:35:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Shocking court documents reveal that Justice Amy Coney Barrett's religious group \"People of Praise\" exerted \"almost total control\" over one of its female members and its founder did \"sexual displays\" in front of his children. RT TO DEMAND AN INVESTIGATION!","date":"Mon Jun 06 19:17:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The University Health System in San Antonio announces that a 9-year-old student who was injured in the tragic Uvalde mass shooting has been released from the hospital. RT TO WISH HER A FULL RECOVERY!","date":"Mon Jun 06 18:31:54 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a rare moment of sanity, Sen. Joe Manchin announces that he supports raising the age requirement for buying semi-automatic weapons to 21 and questions why anyone could \"need\" something with the \"magnitude\" of an AR-15. RT TO DEMAND THAT HE SUPPORT NEW GUN LAWS!","date":"Mon Jun 06 18:25:06 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This is how Republicans normalize hate.\n\nhttps://t.co/rLStU8arnn","date":"Mon Jun 06 18:20:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that the Jan. 6th insurrectionist who left her six minor children unattended to travel to D.C. to overturn Trump's loss in the hopes of starting a \"civil war\" and causing \"bloodshed\" must be locked up — please retweet and follow us to hold these traitors accountable!","date":"Mon Jun 06 18:15:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Prominent January 6 Committee member Congressman Jamie Raskin drops bombshell, reveals that the committee has evidence against Trump that supports a charge of not only  “incitement” of insurrection, but “conspiracy” charges as well. RT TO THANK THE JANUARY 6 COMMITTEE!","date":"Mon Jun 06 18:12:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Even the world's richest man has to be careful what he wishes for.\nhttps://t.co/wmQSI8ZVLj","date":"Mon Jun 06 17:52:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Federal prosecutors allege that a Jan. 6th insurrectionist left her six minor children unattended to travel to D.C. to overturn Trump's loss in the hopes of starting a \"civil war\" and causing \"bloodshed.\" RT IF YOU THINK THAT SHE MUST BE LOCKED UP!","date":"Mon Jun 06 17:36:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Putin loses ANOTHER general as Ukrainian forces ambush &amp; kill Major-General Roman Kutuzov of the Donetsk People’s Republic’s 1st Army Corps — making him the 11th Russian general to die in the disastrous invasion. RT IF YOU THINK THAT IT'S TIME FOR RUSSIA TO WITHDRAW!","date":"Mon Jun 06 17:08:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A brave activist is arrested for chaining and locking himself to the non-scalable fence outside of the Supreme Court in an act of \"civil disobedience\" to protest the Republican court's overturning of Roe v. Wade. RT IF YOU THINK THAT HE'S A HERO!","date":"Mon Jun 06 16:52:38 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Blake Masters, MAGA candidate for Senate in Arizona, absurdly claims that America’s gun violence problem can be blamed on “Black people, frankly” because of “gang violence,” instead of guns. RT IF YOU THINK THAT HE’S A RACIST!","date":"Mon Jun 06 16:18:24 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that a former U.S. Army prosecutor just dropped a bombshell, revealing that the January 6 Committee has “worked its way up the criminal ladder” and will demand that Biden’s Justice Department “indict Trump” at this week’s public hearings, please RT and follow us!","date":"Mon Jun 06 15:11:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Former U.S. Army prosecutor drops bombshell, reveals that the January 6 Committee has “worked its way up the criminal ladder” and will demand that Biden’s Justice Department “indict Trump” after this week’s public hearings. RT IF YOU THINK THAT TRUMP MUST BE INDICTED!","date":"Mon Jun 06 15:04:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Parkland survivor David Hogg calls out Marjorie Taylor Greene for “attacking the survivors” of the Uvalde shooting so that she “can fundraise” off them after she tweeted at him that he “and his girls” should visit her office. RT TO THANK DAVID FOR SETTING HER STRAIGHT!","date":"Mon Jun 06 01:08:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This is INCREDIBLE! Democrats might be able to pass one very real #GunReformNow without a single GOP vote.\n\nhttps://t.co/e1wX0HLZqm","date":"Sun Jun 05 21:48:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that Texas A&amp;M University just humiliated Kyle Rittenhouse by announcing that he has NOT been admitted to the university after Rittenhouse claimed that he was going to enroll and study there, please RT and follow us for more breaking political news!","date":"Sun Jun 05 21:42:44 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: After Kyle Rittenhouse announces that he will be attending Texas A&amp;M University in the fall, the university announces that he has NOT been admitted. RT TO THANK TEXAS A&amp;M UNIVERSITY FOR SETTING KYLE RITTENHOUSE STRAIGHT!","date":"Sun Jun 05 21:26:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a major twist in the battle for gun reform, three of the top Texas Republican donors, who are self-proclaimed “gun enthusiasts,” sign a letter demanding raising the gun purchase age to 21, increased background checks, and red flag laws. RT IF YOU SUPPORT GUN REFORM!","date":"Sun Jun 05 21:07:53 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"It didn't even take a month for @elonmusk to flip flop on Democrats.\n\nWelcome back! \n\nhttps://t.co/GSKjHABQcr","date":"Sun Jun 05 21:07:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"This is the best idea for gun reform now!\n\nhttps://t.co/e1wX0HLZqm","date":"Sun Jun 05 19:55:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: 3 dead, 14 injured, 1 critically, after a shooting outside of a Tennessee nightclub. RT IF YOU THINK THAT IT’S TIME FOR AMERICA TO ADDRESS ITS GUN CRISIS!","date":"Sun Jun 05 19:28:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Which order would you put them in? https://t.co/79nb8nps49","date":"Sun Jun 05 19:14:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Prominent abortion rights advocates demand that more pro-choice men “get off the sidelines and step in the fight as allies” alongside women in the fight for abortion rights. RT IF YOU’RE A MAN WHO SUPPORTS ABORTION RIGHTS!","date":"Sun Jun 05 18:51:11 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"NEW! Liz Cheney says the things that other Republicans are just too afraid to admit.\nhttps://t.co/csp0KMQNU3","date":"Sun Jun 05 18:16:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Mastriano's Jan. 6th actions finally get scrutiny. \nhttps://t.co/eGKtL5rZX0","date":"Sun Jun 05 16:54:26 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A new poll from Harvard University shows Florida Governor DeSantis losing to Vice President Kamala Harris in a hypothetical head-to-head match up for the presidential race in 2024, throwing cold water on his presidential aspirations. RT IF YOU THINK THIS IS GREAT NEWS!","date":"Sun Jun 05 16:49:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: In yet another telling and humiliating gaffe, Marjorie Taylor Greene says that Puerto is not a part of America — not realizing that Puerto Rico has been a U.S. territory for over 124 years. RT IF IF YOU THINK THAT @RepMTG IS AN IGNORANT FOOL!","date":"Sun Jun 05 16:22:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that it’s hilarious that disgraced former Trump attorney Rudy Giuliani just hired  the “Manhattan Madam” as a new PR person, who got her name after building a reputation as a high-end female pimp for New York sex workers, please RT &amp; follow us for more breaking news!","date":"Sun Jun 05 10:09:29 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Disgraced former Trump attorney Rudy Giuliani hires the “Manhattan Madam” as a new PR person, who got her name after building a reputation as a high-end female pimp for New York sex workers. RT IF YOU COULDN’T MAKE THIS UP EVEN IF YOU TRIED!","date":"Sun Jun 05 10:05:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"DeSantis proves again why he's THE WORST!\nhttps://t.co/vEWMfU4YU4","date":"Sat Jun 04 23:39:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKIMG: One dead, eight injured, two critically, after a shooting at an Arizona shopping mall. RT IF YOU THINK THAT AMERICA MUST ADDRESS ITS GUN CRISIS!","date":"Sat Jun 04 23:15:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"What is wrong with prosecutors? \nhttps://t.co/1KRfwiz2iA","date":"Sat Jun 04 22:16:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING! Flynn, Powell, and Byrne pushed a \"chilling\" idea to keep Trump in the White House that is worse than you could imagine.\nhttps://t.co/Lzc8w20eXJ","date":"Sat Jun 04 21:31:30 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re outraged that the Uvalde mom who ran into the school during the shooting to save her sons just revealed that “law enforcement” called her to notify her that, if she keeps humiliating Uvalde police by talking to the media, she could be prosecuted, please RT &amp; follow us!","date":"Sat Jun 04 20:48:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Greg Abbott and his despicable GOP agenda just got slapped down!\nhttps://t.co/UWw3KJr7WB","date":"Sat Jun 04 19:54:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The Uvalde, Texas mom who ran into the school during the shooting to save her sons reveals that “law enforcement” called her to notify her that, if she keeps humiliating Uvalde police by talking to the media, she could be charged “with a crime.” RT IF SHE’S A HERO!","date":"Sat Jun 04 19:00:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"He's taking Trump's mocking and turning it into fascist state action\n\nhttps://t.co/RX7xhq7NEm","date":"Sat Jun 04 18:06:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"NRA funded lawmakers across America are waging war on America’s youth. We will remember in November we vote in the midterm elections.\n\nCan we get 500 quick replies using the hashtag #StandWithUvalde to help get it trending?","date":"Sat Jun 04 14:46:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A brave Florida teacher launches a GoFundMe fundraiser for a “banned book” drive that will buy books banned by Florida Governor Ron DeSantis “for students to read over the summer.” It already raised $17,500. Donate here: https://t.co/OansY7k0cu. RT TO SPREAD THE WORD!","date":"Sat Jun 04 14:14:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"We’re being harassed by Trump’s trolls and NRA gun nuts because of our viral tweets this week calling for Congress to ban assault weapons in America. If you want to join our fight and piss off the trolls, please consider following our account to stay up to date on political news!","date":"Sat Jun 04 13:23:20 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that ex-Obama Attorney General Eric Holder just demanded that Trump be criminally “indicted” for “fomenting a coup” against the United States, and predicted that “a lot of high-level people in the Trump administration” will be indicted as well, plz RT &amp; follow us!","date":"Sat Jun 04 12:48:54 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Former Obama Attorney General Eric Holder demands that Trump be criminally “indicted” for “fomenting a coup” against the United States, predicts that “a lot of high-level people in the Trump administration” will be indicted as well. RT TO THANK ERIC HOLDER!","date":"Sat Jun 04 12:46:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re THRILLED that a new poll of Texas voters just put Texas Trumper Governor Greg Abbott’s re-election chances in serious jeopardy, showing that Democratic challenger Beto O’Rourke has eaten away at his lead and is now nearly tied with him, please RT and follow us!","date":"Sat Jun 04 11:33:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Texas Trumper Governor Greg Abbott’s re-election chances are put in serious jeopardy as a new poll of Texas voters shows that Democratic challenger Beto O’Rourke has eaten away at his lead and is now nearly tied with him. RT IF YOU WANT BETO TO BEAT ABBOTT IN NOVEMBER!","date":"Sat Jun 04 11:30:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Tucker finally admits Russia got Trump elected. Progress…","date":"Sat Jun 04 04:18:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The January 6 Committee announces the schedule for its “bombshell” public hearings. It is as follows:\n\nJune 9: 8 PM Eastern Time\nJune 13: 10 AM ET\nJune 15: 10 AM ET \nJune 16: 10 AM ET \nJune 21: 10 AM ET \nJune 23:  8 PM ET \n\nRT TO HELP THE COMMITTEE SPREAD AWARENESS!","date":"Sat Jun 04 00:57:57 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Father of Uvalde shooting victim hires the lawyers who successfully sued the maker of the AR-15 assault rifle used by the Sandy Hook shooter, initiates legal proceedings against Daniel Defense, the maker of the AR-15 used to gun down his daughter. RT IF YOU SUPPORT HIM!","date":"Sat Jun 04 00:24:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Ex- top Trump Administration official Peter Navarro furiously exits jail and rages outside of the jailhouse, whining that the FBI publicly humiliated him by handcuffing him as he was boarding a flight, “threw him” in a cell &amp; put him “in leg irons.” RT TO THANK THE FBI!","date":"Fri Jun 03 23:37:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Pennsylvania Senate candidate David McCormick concedes to snake-oil salesman Dr. Oz in the Republican primary — meaning Oz will now face off against Democratic star John Fetterman in the general election.  RT IF YOU HOPE THAT FETTERMAN CRUSHES DR. OZ!","date":"Fri Jun 03 22:52:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MSNBC's John Heilemann humiliates former Trump official Peter Navarro by cutting away from his post-jail rant, saying that there's \"only so much bug-eyed gibberish\" he can \"tolerate\" from Trumpers like Navarro. RT IF YOU THINK NAVARRO BELONGS IN JAIL!","date":"Fri Jun 03 21:51:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a rare bipartisan move, Speaker Nancy Pelosi and House Minority Leader Kevin McCarthy will come together to present Ukrainian President Zelensky with the Ronald Reagan Freedom Award for defending his country against Putin. RT IF YOU THINK THAT HE DESERVES IT!","date":"Fri Jun 03 21:33:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that every state should copy Nevada and end their investments in businesses that sell or manufacture assault-style weapons because as Nevada says while it won’t “fix this crisis” we must all still \"do something,\" please retweet and follow us to fight for gun reform!","date":"Fri Jun 03 20:55:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Louie Gohmert unleashes the jaw-dropping complaint that Republicans \"can’t even lie to Congress or lie to an FBI agent or they’re coming after you\" and \"they'll bury you.\" RT IF YOU THINK THAT'S A GOOD THING!","date":"Fri Jun 03 20:45:09 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"We need you to call the Senate TODAY to help America's veterans.\n\nhttps://t.co/HLzsyAae6h","date":"Fri Jun 03 19:42:10 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The European Union deals a devastating blow to Putin by formally adopting a punishing ban on Russian oil imports — something many experts predicted they’d never have the courage to do. RT TO THANK THE EU!","date":"Fri Jun 03 19:39:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Former top Trump Administration official Peter Navarro official is arrested and thrown in jail after being charged with felony contempt for refusing to obey the January 6 Committee’s subpoena. RT IF YOU THINK THAT THIS IS GREAT NEWS! https://t.co/XCFytzn9WY","date":"Fri Jun 03 19:20:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Capitol Police arrest a suspicious former NYPD officer armed with body armor, high-capacity magazines, ammo, a BB gun, and a fake ID that said “Department of the INTERPOL.” RT IF YOU THINK THAT HE SHOULD BE PROSECUTED!","date":"Fri Jun 03 19:18:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Last week, Trump was \"stunned\" that he couldn't beat the Georgia Secretary of State in a primary. \n\nNow, he's got bigger problems! https://t.co/Ec2KlJjhb5","date":"Fri Jun 03 18:34:34 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you are in awe of Miah Cerrillo, the 11-year-old who survived the Uvalde shooting by covering herself in her friend’s blood, who has bravely agreed to testify before Congress next week as part of a hearing on gun violence, retweet and follow us to join the fight against guns!","date":"Fri Jun 03 18:29:47 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: 11-year-old Miah Cerrillo, the brave child who survived the Uvalde shooting by covering herself in her friend’s blood, will testify before Congress next week as part of a hearing on gun violence. RT TO SHOW MIAH YOUR SUPPORT!","date":"Fri Jun 03 18:13:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Oh, Susan Sarandon. https://t.co/onG53Sca73","date":"Fri Jun 03 17:50:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"House Democrats are working relentlessly to improve America's healthcare system.\n\nWATCH:\n\nhttps://t.co/AZyMjoTlf2","date":"Fri Jun 03 17:49:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Joe Biden mocks GOP-supporting billionaire Elon Musk for saying he wants to fire 10% of Tesla employees because he has a \"super bad feeling\" about the economy, jokingly wishes him \"lots of luck on his trip to the moon.\" RT IF YOU LOVE WHEN BIDEN SHADES RIGHT-WINGERS!","date":"Fri Jun 03 17:39:52 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Ron DeSantis abuses his vast powers as governor AGAIN to veto $35 million in funding for a training facility and youth complex for the Tampa Bay Rays MLB team simply because they tweeted support of gun control after Uvalde. RT IF YOU THINK DESANTIS MUST BE VOTED OUT!","date":"Fri Jun 03 17:33:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Australian billionaire Scott Farquhar rips into the world’s richest man Elon Musk for ordering employees to return to the office or be fired, calling it “something out of the 1950s” and tells Tesla employees to jump ship to his company. RT IF YOU AGREE WITH FARQUHAR!","date":"Fri Jun 03 16:47:39 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Federal grand jury indicts former Trump official Peter Navarro on two charges of criminal contempt of Congress for refusing to obey subpoenas from the Jan. 6th committee. RT IF YOU THINK THAT HE SHOULD BE LOCKED UP!","date":"Fri Jun 03 16:21:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Gov. Ron DeSantis bullies the Special Olympics into ending its lifesaving vaccine requirement by threatening to sue them for $27.5 million in fines. RT IF DESANTIS DISGUSTS YOU!","date":"Fri Jun 03 15:47:28 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A special education clerk who hid to survive the Uvalde school mass shooting takes legal action to depose Daniel Defense, the company that created the gun used, in a major step towards a possible lawsuit. RT IF YOU THINK THAT DANIEL DEFENSE SHOULD BE SUED!","date":"Fri Jun 03 15:34:13 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Nevada boldly announces that it will end its investments in businesses that sell or manufacture assault-style weapons because while it won’t “fix this crisis” completely the state believes “we all must do something.” RT IF YOU THINK THAT EVERY STATE SHOULD DO THIS!","date":"Fri Jun 03 15:00:48 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Humiliating new report reveals that Trump officials mocked GOP Sen. Susan Collins as a \"cheap date\" in secret while \"deliberately\" manipulating her to confirm predator Brett Kavanaugh to the Supreme Court with \"vague assurances.\" RT IF YOU THINK THAT SHE SHOULD RESIGN!","date":"Fri Jun 03 14:35:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: Washington’s Supreme Court slaps a $28,000 fine on a pro-Trump “Big Lie” group and its lawyer for shamelessly pushing false claims of “voter fraud” while “offering no competent evidence.” RT TO THANK THE WASHINGTON SUPREME COURT FOR MAKING THEM PAY!","date":"Fri Jun 03 13:57:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you’re glad that the Uvalde, Texas teacher who was falsely accused of leaving the back door “propped open” just launched court proceedings against the gunmaker of the AR-15 assault rifle the gunman used, please RT and follow us for more updates on her legal proceedings!","date":"Fri Jun 03 13:09:30 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Uvalde, Texas teacher who was falsely accused of leaving the back door “propped open” launches court proceedings against Daniel Defense, the gunmaker of the AR-15 assault rifle the gunman used, for aggressively “marketing its guns to young people.” RT TO THANK HER!","date":"Fri Jun 03 13:03:51 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: January 6 Committee puts Trump and his fellow insurrectionists on notice that it will hold a June 9th hearing to release a summary of its bombshell findings about “the coordinated, multi-step effort to overturn the 2020 election.” RT TO THANK THE JANUARY 6 COMMITTEE!","date":"Fri Jun 03 03:32:55 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: The Uvalde, Texas mom who jumped a fence and ran into the elementary school to save her 2 kids from the shooter fights back tears as she calls out the Uvalde police for being “more aggressive” toward her than they were toward the shooter. RT IF YOU THINK SHE’S A HERO!","date":"Fri Jun 03 03:13:14 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: House Committee on Oversight and Reform is investigating the deeply crooked $2 billion investment Jared Kushner's firm received from Saudi Arabia to see if he abused his White House position to secure it. RT IF YOU SUPPORT THIS INVESTIGATION!","date":"Fri Jun 03 03:06:12 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: The Uvalde, Texas elementary teacher who Texas officials and Republicans falsely accused of leaving the door that the gunman used to enter the school “propped open” reveals that she’s “heartbroken” and “traumatized” by their lies. RT TO HELP HER CLEAR HER NAME!","date":"Fri Jun 03 02:55:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: “Pro-life” Florida Governor Ron DeSantis has his security drag a brave Florida student out of an event after the student bravely confronts him for “making it easier” for mass shooters to buy guns, asking him, “Why don’t you care about MY life!?” RT TO THANK THE STUDENT!","date":"Fri Jun 03 02:31:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Press Secretary Karine Jean-Pierre projects fiery optimism about tackling America's gun violence, saying President Biden has \"beat the gun lobby before\" and will speak on \"behalf\" of the American people tonight. RT IF YOU'RE GLAD THAT WE HAVE BIDEN AS PRESIDENT!","date":"Thu Jun 02 21:46:01 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: At least 5 people are shot in Racine, Wisconsin at a funeral for Da’Shontay King — a Black man who was shot and killed by police. RT TO DEMAND NEW GUN LAWS NOW!","date":"Thu Jun 02 21:06:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Greg Steube pulls out several guns with high-capacity magazines during a remote Congressional hearing on gun control — rants that he \"can do whatever\" he wants at home with his guns when asked if they're loaded. RT IF YOU THINK THAT HE SHOULD BE CENSURED!","date":"Thu Jun 02 21:03:27 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Press Secretary Karine Jean-Pierre smacks down Fox's Peter Doocy for asking if Joe Biden's gun speech tonight is to distract from \"inflation\" and baby formula responding that \"people have died\" including \"nineteen kids\" from a \"mass shooter.\" RT TO THANK JEAN-PIERRE!","date":"Thu Jun 02 20:32:08 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Angry constituents confront Republican Senator Chuck Grassley at a town hall over he and Republicans taking NRA bribes as children are slaughtered, demand that he “stop filibustering” gun reforms and “do SOMETHING!” RT TO THANK THE CONSTITUENTS FOR CALLING GRASSLEY OUT!","date":"Thu Jun 02 19:43:03 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you think that Republicans are heartless for not passing gun reform after MAGA Rep. Louie Gohmert melted down over Democrats saying they care more about guns than victims, ranting \"how dare you\" and saying: \"You think we don't have hearts?\" — please RT and follow us!","date":"Thu Jun 02 18:07:19 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Police arrest a 16-year-old boy for allegedly trying to recruit fellow students to assist him in a \"mass shooting and/or bombing\" at a California high school — explosive parts and assault weapons were found at his house. RT IF YOU THINK THAT WE MUST BAN ASSAULT WEAPONS!","date":"Thu Jun 02 18:05:21 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: In a crushing blow to democracy, Florida's Supreme Court declines to hear a challenge to Gov. Ron DeSantis' new heavily gerrymandered congressional map that unfairly favors Republicans and targets Black voters. RT IF YOU THINK THAT THIS IS AN OUTRAGE!","date":"Thu Jun 02 17:36:17 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: MAGA Rep. Louie Gohmert melts down into a fury after Democrats say he cares more about guns than victims, ranting \"how dare you,\" calling it an \"outrage,\" and saying: \"You think we don't have hearts?\" RT IF YOU THINK REPUBLICANS ARE HEARTLESS FOR NOT PASSING GUN REFORM!","date":"Thu Jun 02 17:17:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKing: In a big win for fairness, the Biden administration will begin paying White House interns for the first time in history in a “significant milestone” aimed at opening the doors to low-income and more diverse individuals. RT IF YOU SUPPORT THIS MOVE!","date":"Thu Jun 02 16:10:15 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Just as @tomaskenn reported last month, the Proud Boys violent extremist group has infiltrated the Miami GOP, and the NY Times did report on it. https://t.co/CO1jhw5V9F","date":"Thu Jun 02 14:16:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: CNN reports that the Tulsa mass shooter who gunned down five people at a hospital yesterday legally bought his rifle just a few hours before the shooting. RT IF YOU THINK THAT AMERICA NEEDS STRONGER GUN LAWS!","date":"Thu Jun 02 13:51:02 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Listen live now! https://t.co/Qp98eIKuhK","date":"Thu Jun 02 00:06:32 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING NEWS: President Biden announces that he is canceling a whopping $5.8 billion in student debt for over 560,000 borrowers who attended fraudulent Corinthian Colleges, making it the largest cancelation of student debt in American history. RT TO THANK PRESIDENT BIDEN!","date":"Wed Jun 01 23:58:05 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you're thrilled to hear that Speaker Nancy Pelosi has announced that Democrats will move forward with legislation to ban military-style assault weapons in the hopes of preventing future tragedies like the Uvalde school mass shooting — please retweet and follow us!","date":"Wed Jun 01 22:48:35 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Police in Tulsa respond to an active shooter situation at the Warren Clinic in which several people have been hit — it's being treated as a \"catastrophic incident.\"","date":"Wed Jun 01 22:46:43 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Speaker Nancy Pelosi announces that Democrats will move forward with legislation to ban military-style assault weapons in the hopes of preventing future tragedies like the Uvalde school mass shooting. RT IF YOU SUPPORT BANNING ASSAULT WEAPONS!","date":"Wed Jun 01 22:42:06 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"When Republicans run out of pro-death talking points, this is what happens.\n\nOUCH.\n\nhttps://t.co/ptp21zCvsV","date":"Wed Jun 01 22:26:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: An anti-abortion fanatic is charged for threatening to kill Chuck Schumer over Roe v. Wade — he left a voicemail calling Schumer a \"fucking evil pile of shit\" and a \"Jew f*ggot* and said he'd \"blow\" his \"fucking head off.\" RT IF YOU THINK THAT HE MUST BE LOCKED UP!","date":"Wed Jun 01 21:55:59 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Maybe not, but underage girls can catch your husband exposing himself in bowling alleys.","date":"Wed Jun 01 21:16:00 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Baltimore files a lawsuit against ghost gun manufacturer Polymer80 Inc. for creating a deadly public health crisis in the city by undermining laws to manufacture, design, and sell untraceable gun kits and parts without background checks. RT IF YOU SUPPORT THE LAWSUIT!","date":"Wed Jun 01 21:13:40 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you love seeing Republican Rep. Liz Cheney destroy crazed MAGA MyPillow CEO Mike Lindell for alleging voter fraud in her state of Wyoming, calling it \"lunacy\" and saying Lindell is an \"unhinged conspiracy theorist\" — please retweet and follow us for more anti-MAGA news!","date":"Wed Jun 01 20:11:23 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Thanks Obama! https://t.co/NSnTEHcUXU","date":"Wed Jun 01 20:03:31 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Republican Rep. Liz Cheney destroys crazed MAGA MyPillow CEO Mike Lindell for alleging voter fraud in her state of Wyoming, calling it \"lunacy\" and saying Lindell is an \"unhinged conspiracy theorist.\" RT IF YOU AGREE WITH LIZ!","date":"Wed Jun 01 19:47:07 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"If you support the group of brave Florida health care providers including Planned Parenthood who have filed a lawsuit challenging the state's draconian 15-week abortion ban which doesn't include exemptions for rape, incest, or human trafficking — please retweet and follow us!","date":"Wed Jun 01 19:41:58 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A jury finds Amber Heard guilty of defaming Johnny Depp, orders her to pay him $15 million in damages.","date":"Wed Jun 01 19:27:45 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Johnny Depp wins the defamation case brought against him by Amber Heard. DO YOU AGREE WITH THE VERDICT?","date":"Wed Jun 01 19:26:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: A brave group of Florida health care providers including Planned Parenthood files a lawsuit challenging the state's draconian 15-week abortion ban which doesn't include exemptions for rape, incest, or human trafficking. RT IF YOU SUPPORT THE LAWSUIT!","date":"Wed Jun 01 19:11:01 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING! The plan for Trump's sedition can be found in a newly available document.\nhttps://t.co/mwO4szsHRo","date":"Wed Jun 01 18:47:36 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: President Biden celebrates the \"historic first\" and says \"it's about time\" as Admiral Linda Fagan becomes the first woman to lead a branch of the military as Commandant of the US Coast Guard. RT IF YOU THINK THAT THIS IS GREAT NEWS!","date":"Wed Jun 01 18:20:49 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"The walls are closing in on Trump as a grand jury is set to begin hearing testimony in the Georgia D.A.'s case against him. \nhttps://t.co/NFKJQ7yGl0","date":"Wed Jun 01 17:12:42 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"@funder #UnionStrong","date":"Wed Jun 01 17:05:04 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: New York judges humiliates Sarah Palin by bluntly refusing to grant her a new defamation trial against The New York Times, saying that she utterly failed to introduce \"even a speck\" of evidence that she deserves it. RT TO THANK THE JUDGE!","date":"Wed Jun 01 17:02:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"BREAKING: Daniel Goldman, the former prosecutor who led the valiant Democratic efforts to impeach Donald Trump the first time, announces that he is running for Congress in New York City. RT IF YOU THINK THAT WE NEED MORE ANTI-MAGA DEMOCRATS LIKE HIM IN OFFICE!","date":"Wed Jun 01 16:52:22 +0000 2022","user_id":"878284831"},{"handle":"OccupyDemocrats","text":"Pro-Death Republicans fail to lock down the Governor's public health emergency powers to save lives.\n\nhttps://t.co/86qCzWF3Aq","date":"Wed Jun 01 16:31:43 +0000 2022","user_id":"878284831"}]