[{"handle":"politico","text":"Subscribe to Digital Future Daily to stay on top of the most important stories determining the future of tech from Washington to Silicon Valley, and beyond. \nhttps://t.co/bpE3EOuhqZ https://t.co/nwdgYM4Elv","date":"Sat Jun 25 15:20:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Everything was going right for Republicans in the midterm campaign. Then the Supreme Court decision came down.\nhttps://t.co/WjRR7cuRuv","date":"Sat Jun 25 15:00:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A range of thinkers on the future of abortion post-Roe in America — and how that will affect everything else\nhttps://t.co/HZ7lApbsaN","date":"Sat Jun 25 14:01:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As Gov. Phil Murphy tries to burnish his image as someone who's putting progressive policies to work, he faces a major obstacle: A skittish Legislature led by members of his own party\nhttps://t.co/3AgGpasK49","date":"Sat Jun 25 13:00:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Despite a spike in infections earlier this year, U.S. officials opted to guard the institutions’ names, citing privacy https://t.co/YSfkUi9TdE","date":"Sat Jun 25 12:41:54 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Chief Justice John Roberts had zero support for his middle of the road effort on Roe v. Wade https://t.co/MKWCkPF9NG","date":"Sat Jun 25 12:38:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"What's really happening on Capitol Hill? Keep up with Congress by reading Huddle, our scoop-filled newsletter for everything you need to know on the Hill. Subscribe today\nhttps://t.co/dfpSNWPYfR https://t.co/mFwfFUOvgi","date":"Sat Jun 25 01:00:28 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Six years later, Republicans who held their noses and backed Trump are vindicated: Roe has fallen.\n\nWas it worth it? \"Now, with victory won, they’d prefer that Trump remain in retirement,\" says @continetti. They may not get their wish.\n\nNightly has more: https://t.co/EV9sXpiMqi","date":"Fri Jun 24 23:39:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Florida Republican Gov. Ron DeSantis promised to expand “pro-life protections” on Friday in the wake of the Supreme Court ruling striking down Roe v. Wade.\n\nhttps://t.co/hudoYTFJvR","date":"Fri Jun 24 23:05:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Supreme Court Justice Samuel Alito’s sharp opinion overturning Roe v. Wade is virtually unchanged from his initial draft. \n\nHe did use his rewrite, however, to take shots at Chief Justice John Roberts and liberal dissenters. Here’s what else is new ⬇️\n\nhttps://t.co/7aAxc1b44Z","date":"Fri Jun 24 22:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Voters in 3 of those battleground states – Arizona, Kansas and Michigan – will head to the polls for primary elections on Aug. 2. If you live in those states, you may receive more political mailers soon. We want to see them. \n\nhttps://t.co/XXIJeoVYfW","date":"Fri Jun 24 22:05:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Send us photos of your mailers and help us bring more transparency to elections in our campaign coverage ⬇️\n\nhttps://t.co/XXIJeoVYfW","date":"Fri Jun 24 22:05:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Earlier this month, we asked leading gubernatorial candidates in 7 battleground states to explain where they stand on abortion access.\n\nhttps://t.co/mS3U8NrhTk","date":"Fri Jun 24 22:05:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"All eyes are on state elections, including the race for governor, as state leaders gain new powers to decide abortion access. Here are 5 races where the Supreme Court’s abortion decision could have the biggest impact. \n\nhttps://t.co/UhTRCHpv2J","date":"Fri Jun 24 22:05:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"California has been preparing for a post-Roe future for months.\n\nOn deck: a legislative bill package, funding to expand abortion access and a proposed Nov. ballot measure that would enshrine the right to abortion in the state constitution.\n\nhttps://t.co/p9NmFhvbap","date":"Fri Jun 24 21:40:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former president Trump, another Republican weighing a 2024 bid, avoided rhetoric that could be construed as proposing a national abortion ban. \n\nhttps://t.co/gL03PvLqUZ","date":"Fri Jun 24 21:12:21 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republicans eyeing a presidential bid in 2024 all agreed: Friday’s reversal of Roe v. Wade is a landmark victory for the conservative cause.\n\nWhere they parted ways is over how far the GOP should go to end abortion in America.\n\nhttps://t.co/sdZ14VGI7k","date":"Fri Jun 24 20:56:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Mike Pence set the bar. He called for a nationwide ban on abortion, though notably did not say Washington should enact it.\n\nhttps://t.co/OO1fODTyRD","date":"Fri Jun 24 20:56:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Digital Future Daily is a newsletter that chronicles how the next wave of tech will reshape civic and political life, including activism, fundraising, lobbying and legislating.  Subscribe now.\nhttps://t.co/bpE3EOuhqZ https://t.co/SDnSzLhZYU","date":"Fri Jun 24 20:40:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court decision to overturn Roe v. Wade could upend the 2022 midterm elections and reverberate in other contests for years.\n\nHere are the 5 races where the SCOTUS decision could have the biggest impact ⬇️\n\nhttps://t.co/UhTRCHpv2J","date":"Fri Jun 24 20:30:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Justice Thomas argued that the Supreme Court “should reconsider” past rulings codifying rights to contraception access and same-sex marriage. \n\nThe suggestion came in the concurring opinion he wrote in response to the SCOTUS ruling overturning Roe v. Wade. https://t.co/jxDHIiMKoX","date":"Fri Jun 24 19:55:38 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republican Virginia Gov. Glenn Youngkin will pursue a ban on most abortions after 15 weeks of pregnancy, his office said Friday, making immediate use of the Supreme Court’s decision to reverse Roe v. Wade.\n\nhttps://t.co/XDjCt5ZXdk","date":"Fri Jun 24 19:54:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We’ll take a few audience questions during this Space. \n\nHave something you’d like to ask? Read this first 👇 https://t.co/60aunSK78M","date":"Fri Jun 24 19:03:18 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We’re live on Spaces discussing the Supreme Court decision to overturn Roe v. Wade with reporters @joshgerstein, who broke the news of the leaked draft opinion in May, and @marianne_levine, who's tracking how it will impact November elections.\n\nJoin us👇\nhttps://t.co/b1plVxbmE7","date":"Fri Jun 24 19:03:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Nancy Pelosi called the Supreme Court \"radical\" after its decision to overturn Roe v. Wade, revoking the constitutional right to an abortion.\n\n\"It's a slap in the face to women about using their own judgement to make their own decisions about their reproductive freedom.\" https://t.co/o1eGyD1vU9","date":"Fri Jun 24 18:44:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We’ll be on Spaces to discuss the Supreme Court’s landmark decision to overturn Roe v. Wade with @joshgerstein, the reporter who broke the news of the leaked draft opinion in May. \n\nJoin us at 3 p.m. ET👇 https://t.co/b1plVxbmE7","date":"Fri Jun 24 18:08:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House has passed its bipartisan gun safety bill, Congress’ first major response to mass shootings in nearly three decades. \n\nNow it’s headed to Biden’s desk.\nhttps://t.co/Ij8N9EynS7","date":"Fri Jun 24 17:36:27 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"https://t.co/VYyb1iywql https://t.co/cRIRRRrMtk","date":"Fri Jun 24 17:21:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"https://t.co/VYyb1iywql https://t.co/R8U7unwSEo","date":"Fri Jun 24 17:21:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"https://t.co/DapiUOSebL https://t.co/PHvT2Gresx","date":"Fri Jun 24 17:21:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Some key passages from the dissenting opinion by Justices Stephen Breyer, Sonia Sotomayor and Elena Kagan: \n\nhttps://t.co/DapiUOACNb https://t.co/HHV0uAq8lB","date":"Fri Jun 24 17:21:00 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Chief Justice John Roberts staked out a middle ground position in a solo concurring opinion. \n\nHe argued the court had no need to overrule Roe in its entirety and should have simply upheld Mississippi’s 15-week limit on abortion:\n\nhttps://t.co/YCUOvmRd6r https://t.co/08h0ofYKW3","date":"Fri Jun 24 17:06:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"SCOTUS Justice Brett Kavanaugh joined the majority opinion overruling Roe, but also wrote his own concurring opinion: \n\nhttps://t.co/YCUOvmQFgT https://t.co/fEIIj6nhwQ","date":"Fri Jun 24 16:59:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Biden called the SCOTUS decision to overturn Roe v. Wade  a “sad day for the Court and for the country” and called on Congress to restore abortion right protections.\n\n“Let’s be very clear: The health and life of women of this nation are now at risk.” https://t.co/s2bl0pj547","date":"Fri Jun 24 16:54:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden addresses the Supreme Court decision overturning Roe v. Wade. https://t.co/cV6mLIXC1Y https://t.co/mNHqW0CsdX","date":"Fri Jun 24 16:42:54 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Justices Stephen Breyer, Sonia Sotomayor and Elena Kagan wrote a scathing dissent of the SCOTUS ruling.\n\n“With sorrow—for this Court, but more, for the many millions of American women who have today lost a fundamental constitutional protection—we dissent.” https://t.co/7TtfNRqXaV","date":"Fri Jun 24 15:50:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The court’s conservative majority went beyond simply resolving the case before them — Mississippi’s near-ban on abortion at 15 weeks of pregnancy. \n\nInstead, they overturned both Roe v. Wade and Planned Parenthood v. Casey. https://t.co/w54N3TZDxp https://t.co/cr0dGUVfAI","date":"Fri Jun 24 15:44:46 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Abortion policy is in states' hands after the Supreme Court’s ruling to overturn Roe v. Wade.\n\nRight now, abortion is:\n\n- legal or legal for now in 35 states\n- illegal or soon to be illegal in 11 states\n- illegal in 5 states\n\nSee where your state stands👇\nhttps://t.co/qpKBN2zqAw","date":"Fri Jun 24 14:47:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court’s decision to overturn Roe v. Wade will dramatically alter the landscape for people seeking abortions in Florida.\n\nThe Republican-leaning state has one of the highest rates of abortion in the country. https://t.co/1pHs9AkzmO","date":"Fri Jun 24 14:35:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Start each day with POLITICO Playbook for the big stories and scoops you need to know – and the insider nuggets that you want to know – from Washington and across the political landscape. Subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/7ihI1cMJAi","date":"Fri Jun 24 14:35:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Roe v. Wade has fallen. In a 5-4 vote, the Supreme Court overturned the landmark case that guaranteed the constitutional right to an abortion for 50 years.\n\nThe decision clears the way for dozens of states to swiftly ban the procedure. https://t.co/v07mmW9HEd","date":"Fri Jun 24 14:21:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The partnership between Chris Murphy and Kyrsten Sinema proved to be exactly what Dems needed to break through on gun safety after nearly 30 years of attempts https://t.co/ixnyRSNe5b","date":"Fri Jun 24 13:12:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"If Alex Holder’s memory is accurate, Trump was on the phone with Putin just minutes after news broke that Putin had dismissed Trump’s Hunter Biden allegations https://t.co/SSnHb4uZNc","date":"Fri Jun 24 12:37:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook is the unofficial guide to official Washington. Subscribe today for the latest from our team covering every corner of power in D.C.\nhttps://t.co/Ceig2eRhJ2 https://t.co/IyyKtrzYGQ","date":"Fri Jun 24 01:25:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"\"What it really means is that the NRA and gun rights advocates will be in court tomorrow, challenging hundreds of gun laws all across the United States,\" @mawaldman says of SCOTUS striking down New York's century-old gun law today.\n\nNightly has more 👇 https://t.co/Xd5JODZZmJ","date":"Fri Jun 24 00:15:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The DNC’s rules committee listened to presentations from 17 states during a three-day meeting while its members consider how to reorder the early states to better reflect the party’s racial diversity and eliminate caucuses https://t.co/9K5zEIXgSo","date":"Thu Jun 23 23:06:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Florida’s Publix Super Markets will not offer the Covid-19 vaccine to young children despite approval by the FDA last week.\n\nhttps://t.co/rPfRNnWzgj","date":"Thu Jun 23 22:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"House Democrats are working to shore up protections for service members or family members who want access to abortions ahead of an expected Supreme Court decision to strike down Roe v. Wade.\n\nhttps://t.co/gGWmzM90w9","date":"Thu Jun 23 22:20:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republicans are launching a super PAC called Show Me Values  to stop disgraced former Gov. Eric Greitens from winning the Missouri Senate primary.\n\nGreitens stepped down as governor in 2018 amid allegations that he sexually assaulted his hairdresser.\n\nhttps://t.co/h5nVc65UDP","date":"Thu Jun 23 21:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"NJ Gov. Phil Murphy echoed Hochul's sentiments. \"We will do everything in our power to protect our residents,” he said in a statement.\n\nMurphy said he is considering more new gun control legislation following the SCOTUS ruling.\n\nhttps://t.co/saWf9JWZtP","date":"Thu Jun 23 21:27:15 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Following the decision, two of the lawyers responsible for the win said they are parting with their law firm, Kirkland &amp; Ellis, after it announced it would no longer handle Second Amendment litigation.\n\nhttps://t.co/OkqMx40Oqn","date":"Thu Jun 23 21:09:54 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"For the latest updates, check out these threads by POLITICO reporters @nicholaswu12 and @kyledcheney:\n\n➡️ https://t.co/H9pmnpcNdl\n➡️ https://t.co/2CsxGUeFdh","date":"Thu Jun 23 20:46:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A number of top Trump aides have churned out books after his presidency ended. The public isn’t buying. \n\n“Each of the people who have written a book so far was telling stories that we pretty much already knew,\" said one top publishing executive. https://t.co/KGt8NKRLmM","date":"Thu Jun 23 20:01:46 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Today we're watching:\n\n1️⃣ How the panel explains this complex piece of the investigation to the nation.\n2️⃣ How key Congress members like Rep. Scott Perry helped Trump.\n3️⃣Testimony of how the DOJ debunked election fraud claims Trump advanced.\n\nFollow along👇https://t.co/q765vV5XJV","date":"Thu Jun 23 19:46:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rosen, Donoghue and Engel will all be testifying today.\n\nRosen's written statement to the Jan. 6 panel argues that the DOJ was presented with no evidence of election fraud. \nhttps://t.co/q765vV5XJV","date":"Thu Jun 23 19:46:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"First, some background from @playbookdc: \n\nTrump wanted acting AG Jeffrey Rosen and his deputy, Richard Donoghue, to cast doubt on the election and give GOP states a pretense to appoint alternate electors to keep Biden from winning.\nhttps://t.co/lqCsoctK66","date":"Thu Jun 23 19:46:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The fifth public Jan. 6 hearing is underway. \n\nToday, the panel is set to dig into Trump's DOJ meddling and show how some allies counted on his presidential pardon power to shield them from potential criminal consequences.\n\nHere's what to know👇https://t.co/q765vV5XJV","date":"Thu Jun 23 19:46:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"When top DOJ officials wouldn’t comply, Trump threatened to replace them. \n\nIn response, Rosen, Donoghue, and Steven Engel (who ran a key DOJ office) threatened to resign and implied they’d take a number of officials with them. \n\nTrump backed down. https://t.co/lqCsoctK66","date":"Thu Jun 23 19:46:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Hochul vowed to call NY lawmakers into session to pass legislation in response to the SCOTUS ruling.\n\n“If the federal government will not have sweeping laws to protect us, then our states and our governors have a moral responsibility to do what we can.\"\nhttps://t.co/zawENjvCJX","date":"Thu Jun 23 19:05:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Gov. Kathy Hochul called the Supreme Court ruling to overturn New York's concealed gun law “frightful in its scope.” \n\n“This decision isn’t just reckless. It’s reprehensible. It’s not what New Yorkers want.” https://t.co/AIzzHG85TR","date":"Thu Jun 23 18:53:27 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The DOJ searched the home of former top official Jeffrey Clark a day before the Jan. 6 committee hearing is expected to scrutinize him and other Trump allies, according to Clark's employer https://t.co/nTCwVsBswt","date":"Thu Jun 23 18:33:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Step inside the West Wing and get the latest updates on the president and his team. Subscribe to West Wing Playbook today.\nhttps://t.co/AsF2TXHAuK https://t.co/29Pkc774Xb","date":"Thu Jun 23 18:20:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Senate took a critical step on the bipartisan gun safety legislation, avoiding a filibuster and clearing the way for a passage vote no later than the end of the week https://t.co/xHK2Kotpcf","date":"Thu Jun 23 16:51:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Massachusetts Democratic primary for governor is over.\n\nState Sen. Sonia Chang-Díaz, the last remaining Democrat running against state AG Maura Healey, has dropped out of the race. https://t.co/pue3bzRwRj","date":"Thu Jun 23 15:57:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The FDA has ordered Juul to take all of its vapes off the market.\n\nRegulators found Juul’s data on the toxicity of its products was lacking and conflicting, which impeded the FDA from fully assessing potential risks of the vapes and their pods.  https://t.co/7a8vb729kU","date":"Thu Jun 23 15:22:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court ruled in favor of New York gun owners who want to carry weapons outside the home. \n\nThe 6-3 decision, which divided the court along the usual ideological lines, follows a series of high-profile mass shootings. https://t.co/ftQC03eEOT","date":"Thu Jun 23 14:41:56 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Today's Jan. 6 committee hearing will focus on presenting how Trump pressured DOJ officials to advance what committee members have repeatedly called an attempted coup.\n\nMore in today's @playbookdc 👇 \nhttps://t.co/lqCsoctK66","date":"Thu Jun 23 14:29:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"llinois Gov. J.B. Pritzker trekked to New Hampshire last weekend to rally Democrats for abortion rights. New Jersey Gov. Phil Murphy’s allies launched a federal super PAC and a nonprofit, which have aired $2 million in TV ads.\n\nhttps://t.co/pdVtZsuWG8","date":"Thu Jun 23 11:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Add Huddle, our must-read for Hill staff, to your morning reads to stay up on the latest news coming from Capitol Hill. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/tB7v0RudxB","date":"Thu Jun 23 11:40:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A year after Donald Trump lost the 2020 election, his former chief of staff Mark Meadows released a tell-all book about his 10 months in the White House that promised to be a “frank, candid account” of running Trump’s chaotic West Wing\n\nhttps://t.co/KGt8NKRLmM","date":"Thu Jun 23 11:35:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Democrats are calling the Senate’s bipartisan gun safety bill a first step to combat gun violence. The reality is, the second step isn’t coming anytime soon\n\nhttps://t.co/ug8e7rrIsZ","date":"Thu Jun 23 11:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As Donald Trump publicly second-guesses Kevin McCarthy over the Jan. 6 hearings, House Republicans once again risk getting caught between their conference leader and the former president\n\nhttps://t.co/rO3XGTji5v","date":"Thu Jun 23 11:05:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Hospitals look to Washington to provide more security for what they consider critical national infrastructure\nhttps://t.co/q3EnGqz3iv","date":"Thu Jun 23 11:00:53 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"California Gov. Gavin Newsom and Democratic legislators can agree on one thing: They should channel billions of dollars from the state’s overflowing budget to Californians pinched by high gas prices\n\nhttps://t.co/DnIN4WZUAH","date":"Thu Jun 23 10:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"West Wing Playbook is the definitive guide to the Biden administration. Don't miss out on the latest whispers percolating from inside the White House. Subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/1VOy9tuD24","date":"Thu Jun 23 00:35:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The question isn't whether we're headed toward a recession, @morningmoneyben writes — we always are. Instead, we should be asking: When will recession hit? What will cause it? And how bad will it be? \n\nNightly has more 👇 https://t.co/YIwSF4GRj4","date":"Thu Jun 23 00:18:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Biden’s gas tax holiday is too little, too late for vulnerable Democrats running for reelection this fall https://t.co/MLb4sDjqol","date":"Wed Jun 22 23:37:51 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Even if Congress was in a mood to cooperate with Biden’s plan, most studies show that only a small portion of the savings from halting the gas tax would make its way to consumers. https://t.co/2rXJ8EYUie","date":"Wed Jun 22 23:00:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A top progressive firm signed LA mayoral candidate Rick Caruso as a client. Its staff revolted.\n\nhttps://t.co/U522EeLTsf","date":"Wed Jun 22 22:45:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Since 2017, Canadian companies have illegally shipped more than 2,300 metric tons of garbage. Most of it was sent to Hong Kong, India, Vietnam and Malaysia.\n\nhttps://t.co/kRdrJLgSOg","date":"Wed Jun 22 22:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Technology is always evolving, so to make sure you're always in the know, read our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/7PLgrz3GeA","date":"Wed Jun 22 21:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Sen. Roger Marshall (R-Kan.) is considering blocking a bipartisan deal to extend school meals funding because of a policy banning discrimination against LGBTQ students who participate in lunch programs that receive the money.\n\nhttps://t.co/mlt8Z2GTjW","date":"Wed Jun 22 21:45:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden on Wednesday again blamed Russia’s war in Ukraine for recent hikes in fuel prices, as he pushed for Congress to suspend the federal gas tax.\n\nhttps://t.co/FzzhKjeCi5 https://t.co/94m2ngir25","date":"Wed Jun 22 21:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The trial for 5 Proud Boys leaders will be postponed until at least December, a federal judge ruled today, citing the ongoing publicity and uncertainty surrounding the Jan. 6 select committee.\n\nhttps://t.co/jJ6ZuF3hib","date":"Wed Jun 22 20:43:53 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Federal Reserve Chair Jerome Powell vowed to tackle inflation but said he can’t control some cost spikes, including the most politically sensitive one — prices at the pump. https://t.co/CAbmDgPrAd\n\nHere's Congress questioning Powell at today's Senate Banking Committee hearing: https://t.co/4pMRd3t5lX","date":"Wed Jun 22 20:08:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A bipartisan guns deal endorsed by Mitch McConnell is landing with a thud among most House Republicans.\n\nRepublican members said to expect “15 or 20” of them to support the legislation.\n\nhttps://t.co/cKVkcECA53","date":"Wed Jun 22 19:45:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"He's one of Putin’s most prominent supporters — a man of the cloth who offers spiritual cover for the autocrat’s invasion of Ukraine, all while suspected of profiting from that connection.\n\nMeet the pro-Putin preacher the U.S. won't touch.\n\nhttps://t.co/QZhxZdbVLq","date":"Wed Jun 22 19:11:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former gubernatorial candidate Andrew Gillum is facing a federal indictment alleging that he illegally solicited campaign contributions between 2016 and 2019 and promised political favors in return for the financial support https://t.co/nco9NdFzJh","date":"Wed Jun 22 18:39:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"New evidence is prompting the Jan. 6 panel to change its hearing schedule, which could include adding more hearings.\n\nRep. Thompson said the panel had to consider new footage of the Trump family, National Archives docs and tips from previous hearings. https://t.co/2ZKxhHpvfC","date":"Wed Jun 22 18:24:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Thousands of kids have been routinely detained in cold, overcrowded cells built for adults. Border Patrol has resisted improvements even as officials acknowledge that \"a Border Patrol facility is no place for a child.”\n\nRead the full investigation here👇https://t.co/gPYrCJT0Wn","date":"Wed Jun 22 18:02:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"1 in 3 people held in Border Patrol cells is a child and authorities have resisted changes to adapt, a @MarshallProj investigation co-published with @POLITICOMag shows.\n\nWe're live on Spaces discussing the story with @ruairiak &amp; reporter @JuliaPrestonNow👇https://t.co/hwpnEQ0fWx","date":"Wed Jun 22 18:02:12 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"@MarshallProj We'll be live on Spaces with @MarshallProj to discuss the reporting and data findings from their investigation into how Border Patrol routinely detains children. \n\nJoin reporter @JuliaPrestonNow and @POLITICOMag's @ruairiak today at 2 p.m. ET👇 https://t.co/xbGRxoRDsq","date":"Wed Jun 22 17:15:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We're live on Spaces discussing last night's primary results.\n\nJoin politics editor @PoliticoScott and reporters @ZachMontellaro and @natalie_allison👇 \nhttps://t.co/WfOEt02PZX","date":"Wed Jun 22 16:02:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The IRS has made little progress in taming a backlog of millions of unprocessed tax returns despite a concerted effort by the agency, a government watchdog said https://t.co/blaFm9lXqH","date":"Wed Jun 22 14:48:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Add Huddle to your daily reads to get behind-the-scenes nuggets and scoops about the people, politics and power centers in Congress. Don't miss this Capitol Hill must-read. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/FfL1BUKFOm","date":"Wed Jun 22 13:05:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"DeSantis’ reluctance to seek the former president’s public support comes as the Florida governor prepares for a likely 2024 White House bid\nhttps://t.co/eN4alON3Qu","date":"Wed Jun 22 13:01:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As the select panel's work continues, a core few people are emerging as vital for their willingness to defy former President Donald Trump's election subversion\nhttps://t.co/WVP5a9LrIT","date":"Wed Jun 22 12:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Sen. John Cornyn feels confident in his decision to lead a bipartisan gun bill, even after a tough reception back in his home state\nhttps://t.co/amJAbuwGVN","date":"Wed Jun 22 12:02:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Lobbying firms increasingly shift money and staff to where they see their influence have greater impact — in state capitals\nhttps://t.co/sAyWJcxT70","date":"Wed Jun 22 11:30:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Proud Boys leaders facing seditious conspiracy charges shouldn’t face a jury until early 2023, the DOJ contended.\n\nThe DOJ said the ongoing work of the Jan. 6 committee had made it difficult for both sides to prepare for trial. https://t.co/ufKZM4vuy6","date":"Wed Jun 22 03:24:46 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Go inside the minds of the biggest tech players, policymakers and regulators to learn how their decisions affect our lives and our future with our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/xD8fNsRIr8","date":"Wed Jun 22 02:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Dale Strong has beat out Casey Wardynski for Alabama’s 5th District Republican nomination. \n\nThe winner in November will succeed Mo Brooks.\n\nLive results: https://t.co/YMOnggxBLR https://t.co/0YF5ISobGe","date":"Wed Jun 22 01:53:27 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Yesli Vega, Prince William County Supervisor, emerged from a crowded race to win the GOP nomination for Virginia’s 7th District.\n\nShe will face off against Dem. Rep. Abigail Spanberger in November.\n\nLive results: https://t.co/Wa5gCnjNDS https://t.co/PtwvKrMI2n","date":"Wed Jun 22 01:48:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Katie Britt has defeated Mo Brooks in the Alabama GOP Senate primary runoff that divided MAGA world.\n\nBritt won Trump's endorsement after he memorably un-endorsed Brooks, one of his most loyal acolytes, in March. https://t.co/FJ82JGzmkN https://t.co/mNtYHQsztu","date":"Wed Jun 22 01:39:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"South Dakota Senate Attorney General Jason Ravnsborg was impeached over a 2020 fatal crash. The stinging rebuke showed most state senators didn’t believe his account of the crash. https://t.co/RRtNaBgOX6","date":"Wed Jun 22 01:20:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rich McCormick has beat out Jake Evans for the Republican nomination in Georgia’s 6th District. \n\nMcCormick, a surgeon who narrowly lost to Bourdeaux in 2020, was endorsed by Sen. Ted Cruz.\n\nLive results: https://t.co/HCmFnTpLxF https://t.co/OtVDHn9wcw","date":"Wed Jun 22 01:00:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Katie Britt, the former chief of staff to retiring Sen. Richard Shelby, is favored to win over Rep. Mo Brooks, the firebrand conservative who led efforts in Congress to overturn the 2020 presidential election.\n\nFollow the live results tonight👇\nhttps://t.co/R2JyxCHiH7","date":"Wed Jun 22 00:13:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We'll be on Spaces recapping the Alabama primaries and more with our politics editor @PoliticoScott and reporters @natalie_allison and @ZachMontellaro.\n\nJoin us tomorrow at 12 p.m. EDT👇 https://t.co/WfOEt02PZX","date":"Wed Jun 22 00:13:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republican voters in Alabama are set to resolve a high-profile feud in MAGA world tonight.\n\nThe GOP Senate primary runoff pits Mo Brooks, one of Trump’s most loyal acolytes, against Katie Britt, the candidate Trump actually endorsed. https://t.co/RiE1FPY2wD","date":"Wed Jun 22 00:13:00 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Jen Kiggans has won the Republican primary for Virginia's 2nd Congressional District.\n\nShe’ll go on to face Democratic Rep. Elaine Luria in November.\n\nLive results: https://t.co/r2u004mUmE https://t.co/01OksqcUQG","date":"Tue Jun 21 23:55:22 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Senators have released the long-awaited text of their bipartisan gun safety bill , setting up a possible floor vote on final passage by the end of the week https://t.co/FFPRNw1KSi","date":"Tue Jun 21 23:33:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"An unfiltered memoir by NASA’s former No. 2 rips the agency’s administrator and a “male-dominated” culture for wasting billions on a government-owned moon rocket https://t.co/6JoolG8fLl","date":"Tue Jun 21 23:29:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Police responding to the Uvalde school shooting had enough officers and firepower to have stopped the gunman 3 minutes after he entered the building, the head of the Texas state police testified. \n\nHe called law enforcement's response an “abject failure.” https://t.co/bzxwhCkZPn","date":"Tue Jun 21 23:12:38 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Thousands of patients turning to online help for opioid addiction could lose access to life-saving services that rapidly expanded during the pandemic — even as opioid deaths reach record levels. \n\nhttps://t.co/AXyLM0EJaJ","date":"Tue Jun 21 23:00:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Senators are expected to release the long-awaited text of their bipartisan gun safety bill later today, setting up a possible floor vote on final passage by the end of the week.\n\nhttps://t.co/FFPRNvK9tI","date":"Tue Jun 21 20:12:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Georgia Sec. of State Brad Raffensperger, who refused to comply with Trump's push to \"find\" votes, testified at today's Jan. 6 hearing.\n\n\"The numbers don’t lie,\" he said, debunking Trump’s election fraud claims.\n\nhttps://t.co/I6Az7TkLtD https://t.co/8L8rNhAMdb","date":"Tue Jun 21 19:55:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rusty Bowers, the GOP speaker of Arizona's state House, testified at today's Jan. 6 hearing that Rudy Giuliani was unable to show evidence of alleged election fraud. https://t.co/I6Az7TkLtD https://t.co/2dcEsXmFrf","date":"Tue Jun 21 19:15:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"For live updates, follow POLITICO reporters @nicholaswu12's and @kyledcheney's threads:\n\n➡️ https://t.co/jWQpCzPIz5\n➡️ https://t.co/5ZHhlfOJhd","date":"Tue Jun 21 18:36:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Liz Cheney speaking at the fourth Jan. 6 hearing:\n\n\"Trump had been told over and over again that his stolen election allegations were nonsense. For example, this is what former AG Bill Barr said to President Trump about allegations in GA.\" ⬇️ https://t.co/B5XRwLd8yh","date":"Tue Jun 21 18:12:40 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After a POLITICO scoop this morning that the Jan. 6 committee subpoenaed documentarian Alex Holder for his 2020 footage of Donald Trump and his inner circle, Holder said he would fully cooperate with the probe.\n\nhttps://t.co/NEffuRzEFB","date":"Tue Jun 21 16:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Twitter’s board advised shareholders to approve  Elon Musk’s $44 billion bid to purchase the social media giant.\n\nThe endorsement comes amid Musk's recent threats to pull out of the agreement over questions about fake and spam accounts on the platform.\n\nhttps://t.co/f2FFN2GJZb","date":"Tue Jun 21 16:45:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former Missouri Gov. Eric Greitens put up an ad on Monday, imploring supporters in the state's Senate GOP primary to get their \"RINO hunting permit,\" referring to an acronym for so-called Republicans in name only.\n\nThe backlash was swift.\n\nhttps://t.co/WTuKjGD7f0","date":"Tue Jun 21 16:10:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to West Wing Playbook to get daily scoops and nuggets from inside the White House. Don't miss out. \nhttps://t.co/AsF2TXHAuK https://t.co/rUTTLPX9LO","date":"Tue Jun 21 16:03:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court has broadened the rights of parents and students to use government subsidies to attend religious schools in a 6-3 ruling that split cleanly along ideological lines.\n\n https://t.co/tiflFIJPND","date":"Tue Jun 21 15:32:26 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The White House announced today it will commit to limiting the use of anti-personnel land mines in most places around the world, reversing a Trump-era expansion of the policy.\n\nhttps://t.co/UK9UUkUX4q","date":"Tue Jun 21 15:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Attorney General Merrick Garland made an unannounced visit to Ukraine today to discuss efforts to prosecute war crimes resulting from Russia’s invasion.\n\nhttps://t.co/hKbSfyywxq https://t.co/JmguEViAM0","date":"Tue Jun 21 14:24:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 committee sent a subpoena last week to Alex Holder, a documentary filmmaker who shot interviews with then-president Trump both before and after Jan. 6. The existence of this footage is previously unreported.\n\nhttps://t.co/7GWAgfLCtx","date":"Tue Jun 21 13:48:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Elise Stefanik, the House Republican No. 3, is backing a candidate with a long string of controversial remarks. His primary opponent happens to chair her state party.\n\nhttps://t.co/OSFa1XbflW","date":"Tue Jun 21 13:25:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Start your day with POLITICO Playbook for the insider nuggets and scoops you need to know from Washington. Subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/6ifj9lFZFs","date":"Tue Jun 21 12:30:14 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republican voters will pick the next member of Congress for a handful of open, deep-red congressional seats in Tuesday’s primaries — including a Senate seat in Alabama that’s been the subject of one of the strangest and most dramatic races of 2022\n\nhttps://t.co/xT8KfctKkU","date":"Tue Jun 21 12:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Bad blood is brewing between Rep. Elise Stefanik and the head of her home-state GOP. And the hotter it runs, the more it threatens to monopolize a Republican primary in her backyard.\n\nhttps://t.co/OSFa1XbflW","date":"Tue Jun 21 11:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Current and former employees at Defenders of Wildlife referred to the group as a \"motorized revolving door\" where morale is low and turnover is high\n\nhttps://t.co/o0ODAFPPGa","date":"Tue Jun 21 11:35:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Donald Trump’s attempt to overturn the 2020 election depended on one key thing that he never received: the blessing of Republican-controlled state legislatures. But it wasn’t for a lack of trying.\n\nhttps://t.co/yqo1zTDKa2","date":"Tue Jun 21 11:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In every poll running in every targeted House district around the country, House Democrats’ campaign arm is testing how voters feel about the Supreme Court likely overturning Roe v. Wade\n\nhttps://t.co/3j6ZW1M7hM","date":"Tue Jun 21 10:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"West Wing Playbook chronicles the policies, power players, and newsy nuggets from the White House and across the Cabinet. Don't miss out. Keep up with the Biden administration and subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/8MRGMa6Gay","date":"Tue Jun 21 01:15:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Looking for the inside scoop on the policy debates, political maneuvering and power plays on Capitol Hill? Add Huddle, our essential newsletter for Hill staff, to your morning reads.\nhttps://t.co/dfpSNWPYfR https://t.co/vmKQhAwbCc","date":"Mon Jun 20 20:01:18 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook is the unofficial guide to official Washington. Subscribe today for the latest from our dynamic team covering every corner of power in the nation's capital.\nhttps://t.co/Ceig2eRhJ2 https://t.co/DpGw4esGmS","date":"Mon Jun 20 15:40:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Lt. Gov. Antonio Delgado’s experience winning competitive elections rivals that of any of the 62 people who have ever been elected lieutenant governor in New York\n\nhttps://t.co/Hlf1T8yiOY","date":"Mon Jun 20 13:34:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Our Digital Future Daily newsletter unlocks the most important stories determining the future of tech from Washington to Silicon Valley and around the world. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/XvO4LLnc8U","date":"Mon Jun 20 11:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Huddle is our scoop-filled Capitol Hill must-read that pulls back the curtain to reveal the state of play in the House and Senate. Subscribe to Huddle today.\nhttps://t.co/dfpSNWPYfR https://t.co/8pu5bQFaLX","date":"Sun Jun 19 22:00:33 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook: The unofficial guide to official Washington. Subscribe today for the latest from our Playbook team covering every corner of power in D.C.\nhttps://t.co/Ceig2eRhJ2 https://t.co/AtcX4QMtlq","date":"Sun Jun 19 16:05:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The U.S.-China relationship, hobbled by bitter feuds over tariffs and Taiwan, is facing new tensions as family members urge the Biden administration to get tough with Beijing to win the release of unjustly imprisoned Americans https://t.co/VNPLUAMq7F","date":"Sun Jun 19 16:02:19 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Fifty years later, Watergate has remained the scandal by which subsequent ones are measured. Why does it stand the test of time, still provoke interest, still lead us every five or 10 years to look at it anew? https://t.co/3Vat4u4sTW","date":"Sun Jun 19 15:01:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Under Aaron Mair's leadership, the Sierra Club began championing a broad range of social justice causes. Some saw a predominantly white organization’s belated embrace of diversity and inclusion — others, an abandonment of core principles. https://t.co/4kfyYFMZjJ","date":"Sun Jun 19 14:02:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As DeSantis gears up for a likely 2024 White House bid — with or without Trump in the race — the Florida governor is winning over some of the former president’s biggest benefactors https://t.co/M9V35vpOhm","date":"Sun Jun 19 13:15:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Shots will be be available for children from 6 months to 5 years as early as next week\nhttps://t.co/bs0D37X2Yy","date":"Sat Jun 18 19:46:18 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Add West Wing Playbook to your daily reads for details you can't find anywhere else about the Biden administration and the latest buzz percolating inside the West Wing. Subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/v2dRF91iHF","date":"Sat Jun 18 19:40:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to Digital Future Daily to stay on top of the most important stories determining the future of tech from Washington to Silicon Valley, and beyond. \nhttps://t.co/bpE3EOuhqZ https://t.co/yOqYHz61do","date":"Sat Jun 18 14:10:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Executive Editor Sally Buzbee took over the famed D.C. publication amid a backdrop of staffing challenges and directing coverage in a post-Trump world. https://t.co/V7iI0ITZrp","date":"Sat Jun 18 13:00:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The recent collapse of the upstart crypto market has not only cost investors billions in wealth, it’s also threatening to diminish the industry’s once surging clout in Washington\nhttps://t.co/urPtD6OVfK","date":"Sat Jun 18 12:12:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Donald Trump drew applause at this week's Faith &amp; Freedom conference — but so did speeches from other potential GOP presidential candidates\nhttps://t.co/ZzdTM25SKO","date":"Sat Jun 18 12:10:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Join the Playbook community for a daily dose of newsy nuggets about the biggest news dominating Washington. Don't miss out, subscribe today.\nhttps://t.co/Ceig2ezGks https://t.co/cyONUYghKc","date":"Sat Jun 18 01:20:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Pence was invited to the Faith &amp; Freedom conference but decided not to attend, underscoring the crossroads he finds himself in politically.\nhttps://t.co/6ibwRbcmYB","date":"Sat Jun 18 01:18:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"HHS Secretary Xavier Becerra has Covid — for the second time in roughly a month. So does the conventional wisdom that infection grants you a few months of immunity still apply with Omicron? \n\nNightly asked immunologist @PGTimmune⬇️\nhttps://t.co/ojggh80i28","date":"Fri Jun 17 23:07:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Some abortion advocates and providers have reassessed their digital security strategies preparing for a post-Roe world. https://t.co/xN5NI7EsFw","date":"Fri Jun 17 22:30:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Digital Future Daily is a newsletter that chronicles how the next wave of tech will reshape civic and political life, including activism, fundraising, lobbying and legislating.  Subscribe now.\nhttps://t.co/bpE3EOcG2p https://t.co/uHYvpfqjnO","date":"Fri Jun 17 22:30:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The inflation plaguing Biden’s presidency is also shrinking his biggest legislative achievement — the infrastructure bill.\n\nInflation has already slashed billions from its value, forcing states to cancel or delay projects as costs balloon.\nhttps://t.co/WuGSHwSMUE","date":"Fri Jun 17 21:45:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The founder of “Cowboys for Trump” avoided more jail time for breaching restricted Capitol grounds on Jan. 6.\n\nA judge blistered New Mexico County Commissioner Couy Griffin for continuing to claim he was innocent, but also gave him credit for time-served. https://t.co/aAzEV8fCoK","date":"Fri Jun 17 21:14:15 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"How far can House Republicans stray from the party line without losing their seats? \n\nIt’s a tricky question that’s becoming ever more relevant as they march toward a likely majority next year. https://t.co/xTPRZnLXSu","date":"Fri Jun 17 17:37:22 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Vince McMahon is stepping down as CEO and chairman of WWE during an investigation into alleged misconduct involving the longtime leader of the organization https://t.co/QZqynCrfCG","date":"Fri Jun 17 16:48:14 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Iowa Supreme Court cleared the way for lawmakers to severely limit or even ban abortion in the state, reversing a decision from just four years ago that protected the right under the state constitution https://t.co/q4ZJWhHP4G","date":"Fri Jun 17 15:36:25 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former judge J. Michael Luttig both flummoxed and shocked viewers yesterday with his testimony before the January 6 Committee, and his sobering warning about the ongoing threat to democracy.\n\nHere's his full opening statement: \nhttps://t.co/oms4szbSzB https://t.co/2vcFjwpDey","date":"Fri Jun 17 13:30:00 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The World Trade Organization, which had produced only one new multilateral agreement between its members in its 27-year existence, finally broke its negotiating slump with a package of deals.\n\nhttps://t.co/uiFzh5pxBY","date":"Fri Jun 17 12:55:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to West Wing Playbook to get daily scoops and nuggets from inside the White House. Don't miss out.\nhttps://t.co/AsF2TXHAuK https://t.co/rpphjNBN4L","date":"Fri Jun 17 11:55:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The sliding faith in Federal Reserve Chair Jerome Powell also marks another low in the relationship between the business world and Washington\nhttps://t.co/ADPEv8HCIr","date":"Fri Jun 17 11:01:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Detroit's effort to create a cannabis industry that mirrors — and benefits — its majority Black population has led to lawsuits and a collapsing marketplace. Meanwhile, the rest of the state thrives.\nhttps://t.co/s1o5NlWwnh","date":"Fri Jun 17 10:30:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The party's primary to take on Democratic Gov. Gretchen Whitmer has been a rollercoaster ride in recent weeks.\nhttps://t.co/L3wPXAKRBp","date":"Fri Jun 17 10:01:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After appearing stalled out for months, Chuck Schumer and Joe Manchin have taken significant steps behind the scenes to cobble together another bill on climate and tax reform https://t.co/GA9WB6mGKB","date":"Fri Jun 17 09:56:18 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"It's been a punishing couple of years for religious conservatives. But with the Supreme Court poised to overturn Roe, and Republicans’ 2024 presidential primary campaign in sight, their fortunes may be about to change.\n\nNightly has more ⬇️ https://t.co/XdmZq0OGfS","date":"Fri Jun 17 00:35:32 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Secretary of State Antony Blinken says he brings up LGBTQI rights with his Saudi counterpart “invariably, in every conversation,” but defends President Joe Biden’s planned July visit to the kingdom — where homosexual acts carry the death penalty. https://t.co/pxKCQeLTnI","date":"Thu Jun 16 23:30:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 select committee made its most forceful case Thursday that Donald Trump’s attempt to overturn the 2020 election was more than an affront to the democratic process — it was a crime.\n\nhttps://t.co/jbtdbB1CDn","date":"Thu Jun 16 22:30:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Speaker Nancy Pelosi made clear Thursday she sees the political rancor in the U.S. over abortion access as unique to this country, noting heavily Catholic countries have expanded access for women.\n\n https://t.co/sx4IpcJNs6 https://t.co/BrzhqvIw7R","date":"Thu Jun 16 22:03:52 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Get the latest buzz percolating in the West Wing and offices across the President's cabinet. Don't miss out. Subscribe to West Wing Playbook today.\nhttps://t.co/AsF2TXHAuK https://t.co/uC44Dsbe1T","date":"Thu Jun 16 21:55:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"1 in 3 migrants held in Border Patrol facilities is a minor.\n\nThousands of kids have been detained in cold, overcrowded cells built for adults. Authorities have resisted improving conditions.\n\nThe full @MarshallProj investigation, published with POLITICO👇\nhttps://t.co/gPYrCJSt6P","date":"Thu Jun 16 21:52:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"GREG JACOB was Pence’s top lawyer. Internally, he pushed back against Eastman’s legal strategy, and externally, he recruited Luttig to serve as a respected source for Pence to cite when explaining what he would do on Jan. 6. \n\nHere he is testifying at today’s hearing: https://t.co/tfKGcKMeIV","date":"Thu Jun 16 21:42:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"MICHAEL LUTTIG is the former federal appeals court judge who advised Pence that, contrary to what Eastman was saying, the VP had no authority to reject electors on Jan. 6.\n\nHere he is testifying at today’s hearing:\nhttps://t.co/rJC3c9Q90e https://t.co/jNkgfDXX4h","date":"Thu Jun 16 21:42:33 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"JOHN EASTMAN was the intellectual force behind the idea that Pence had the authority to reject electors and have GOP-dominated state legislatures appoint new slates.\n\nHere’s a deposition footage of Eastman that was shared at today’s hearing: https://t.co/iR230ehh5H","date":"Thu Jun 16 21:42:19 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"REP. PETE AGUILAR took the lead today in laying out the details of the pressure campaign against Mike Pence. \n\nThis is a big moment for Aguilar. He's often talked about as part of the next generation of House Dem leaders.\n\nhttps://t.co/KWSrgnwJRJ","date":"Thu Jun 16 21:42:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"There are four key people to know  from today’s Jan. 6 committee hearing:\n\n1⃣ Rep. Pete Aguilar\n2⃣ John Eastman\n3⃣ Michael Luttig\n4⃣ Greg Jacob\n\nhttps://t.co/PnXnmN86at","date":"Thu Jun 16 21:42:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Gov. Ron DeSantis said today that Florida will not provide state programs to administer vaccinations for toddlers or infants.\n\nhttps://t.co/yZAxACXNxf https://t.co/BifF1kL8CQ","date":"Thu Jun 16 20:15:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Covid didn't stop Anthony Fauci from his usual sparring with Rand Paul while testifying by video in a Senate committee hearing on the federal pandemic response.\n\n“Are you going to let me answer a question?” Fauci asked Paul after a slew of interruptions. https://t.co/juSzqo3TWB","date":"Thu Jun 16 19:49:25 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former Pence adviser Greg Jacob testified before the Jan. 6 panel that it's \"unambiguous\" that the VP can't reject electors.\n\n\"There is no mention of rejecting or objecting to electors anywhere in the 12th amendment.\" https://t.co/HjlE5N8Jwe","date":"Thu Jun 16 19:32:40 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A rift between the DOJ and the Jan. 6 panel is deepening. \n\nThe DOJ accused the panel of a “failure” to share its 1,000 witness transcripts, which it says would aid the prosecution of people who breached the Capitol, including leaders of the Proud Boys. https://t.co/WECuep61jp","date":"Thu Jun 16 19:16:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Pelosi called the political firestorm over abortion access  \"uniquely American.\" \n\n\"I’m a very Catholic person and I believe in every woman’s right to make her own decisions,\" she said. https://t.co/A3KLSjHZDI","date":"Thu Jun 16 17:52:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Nancy Pelosi called out the politicization of abortion rights when asked in a press conference if she agreed with popes on the subject. \n\n\"Whatever I agree with the popes on is not necessarily what public policy should be in the United States.\" https://t.co/cNtRfce13z","date":"Thu Jun 16 17:51:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Leaders of the Jan. 6 committee say the time has come to interview Ginni Thomas about her connections to Donald Trump’s attempts to overturn the election https://t.co/ta99NsWsVr","date":"Thu Jun 16 17:30:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Our Huddle newsletter takes you behind the scenes on Capitol Hill, delivering the latest nuggets and scoops about the people, politics, and power centers in Congress. Don't miss out. Subscribe today.\nhttps://t.co/dfpSNWQw5p https://t.co/lEVmOyDdBk","date":"Thu Jun 16 17:20:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 committee will try to convince the public that Trump’s work with Eastman turned into a criminal effort to subvert the election.\n\nFollow our coverage of today's hearing here👇\nhttps://t.co/IPJeIEmtJr","date":"Thu Jun 16 17:02:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"“America is at war with herself. One war is for the cultural heart and soul of America. The other is a war over America’s democracy,” Luttig plans to say today.\n\n“Both of these wars must end in peace if America is to go forward.”\nhttps://t.co/FDyCJbPrIT","date":"Thu Jun 16 17:02:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Michael Luttig will be a witness today.\n\nLeading up to Jan. 6, the former federal judge told Pence to ignore John Eastman, who tried to persuade Pence to overturn the election results.\n\nLuttig first told us the full story of his role that day in February👇\nhttps://t.co/zlGVquELS6","date":"Thu Jun 16 17:02:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Today’s Jan. 6 hearing is starting — and it's going to be one for the history books.\n\nExpect a focus on the intense pressure campaign against Mike Pence. \n\nOne of today's intended takeaways is that Trump — knowingly — almost got Pence killed.\nhttps://t.co/FDyCJbPrIT","date":"Thu Jun 16 17:02:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 panel will juxtapose 3 things to make their point:\n\n- Trump’s comment about Pence deserving to hang.\n- Frantic pleas from Pence aides that the VP was in danger.\n- Pence’s whereabouts in the Capitol as rioters came extraordinarily close to him. https://t.co/FDyCJbPrIT","date":"Thu Jun 16 17:02:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Covid deaths are down, ICUs are emptier than they’ve been in years and vaccines are widely available.\n\nIt’s the progress Dems once hoped would boost Biden’s popularity and his party’s midterm chances. The only problem: Voters long ago stopped caring. https://t.co/gRrABj7Ljc","date":"Thu Jun 16 14:53:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Democrats’ main political group focused on redistricting is expanding its scope, sketching out a midterm target list focused on countering the Trump-backed push to take over election administration offices around the country\n\nhttps://t.co/bXTvsTN9Si","date":"Thu Jun 16 12:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Not long after he was nominated to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives, David Chipman received a call from a longtime associate: firearms attorney and lobbyist Mark Barnes\n\nhttps://t.co/AR0vjoBevz","date":"Thu Jun 16 12:30:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Wake up, read Playbook! @RyanLizza, @EugeneDaniels2, &amp; @rachaelmbade translate Washington for you. Subscribe today to the unofficial guide for official Washington.\nhttps://t.co/Ceig2eRhJ2 https://t.co/Lx6Hi2cAXV","date":"Thu Jun 16 12:10:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In the final month of Ohio’s hard-fought Republican Senate primary, Matt Dolan had a surge in momentum that stunned political observers. They assumed a candidate defying Donald Trump wouldn’t find traction with GOP primary voters.\n\nhttps://t.co/rIcbcKp4Mx","date":"Thu Jun 16 12:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Mitch McConnell is breaking character yet again, and this time it’s on one of the most polarizing issues in American politics\n\nhttps://t.co/vjAHhgXP3u","date":"Thu Jun 16 11:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"It reads like a time capsule from an alternate universe: Kimberly Guilfoyle, a card-carrying Trump World insider, heaping praise upon Rep. Liz Cheney for helping the former president’s reelection\n\nhttps://t.co/fiXgsxDWa0","date":"Thu Jun 16 11:30:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The select panel investigating the Capitol attack will turn its focus Thursday to a particularly explosive chapter in former President Donald Trump’s efforts to overturn the 2020 election: his pressure campaign aimed at then-Vice President Mike Pence\n\nhttps://t.co/IPJeIEmtJr","date":"Thu Jun 16 11:10:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Federal programs that have elevated thousands of U.S. homes above floodwaters may violate civil rights law by shutting out many homeowners who are Black or Hispanic or who have low incomes.\n\nhttps://t.co/h4W7YIsAu2","date":"Thu Jun 16 10:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Huddle is our morning Capitol Hill must-read, with assists from POLITICO's deeply sourced Congress team. Subscribe to Huddle today.\nhttps://t.co/dfpSNWPYfR https://t.co/phLh1j6BxZ","date":"Thu Jun 16 02:05:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Biden will order his health agency to begin efforts to ban conversion therapy and expand access to gender-affirming treatment after a slew of state attempts to limit transgender health care https://t.co/ZHR78WQmfo","date":"Wed Jun 15 21:00:00 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Technology is always evolving, so to make sure you're always in the know, read our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/1TlyBrTcgz","date":"Wed Jun 15 20:45:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Anthony Fauci has tested positive for Covid-19 and is experiencing mild symptoms.\n\nHe “will isolate and continue to work from home\" and has not recently been in close contact with Biden, the National Institute of Allergy said.\nhttps://t.co/Q0h0i8kQxK","date":"Wed Jun 15 19:49:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"FDA advisers voted unanimously to endorse Moderna's Covid-19 vaccines for babies and toddlers. \n\nThe FDA is expected to quickly authorize the vaccine for emergency use. A vote on Pfizer's vaccine is coming soon. https://t.co/M1ieAe4eWD","date":"Wed Jun 15 19:21:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Fed raised interest rates by three-quarters of a percentage point, the largest increase in borrowing costs in a single meeting in nearly 30 years https://t.co/nJmhI9gpSW","date":"Wed Jun 15 18:06:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The U.S. will send more than $1 billion in weapons and humanitarian aid to Ukraine amid the country's war with Russia.\n\nThat includes artillery and ammunition, along with coastal defense weapons and advanced rocket systems to assist forces in Donbas. https://t.co/PDBXYCGX7o","date":"Wed Jun 15 18:03:39 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Biden administration is considering removing former President Trump’s tariffs on China as Biden struggles to choose between taming runaway inflation or pleasing allies in organized labor.\n\nhttps://t.co/AO3qhOpcJG","date":"Wed Jun 15 16:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden announced today a slate of senior personnel changes ahead of November's midterm elections, extending a high-profile position to former Atlanta Mayor Keisha Lance Bottoms and appointing a new White House counsel.\n\nhttps://t.co/TOxMVrH21k","date":"Wed Jun 15 16:15:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The white gunman who killed 10 Black people in a racist attack at a Buffalo supermarket was charged Wednesday with federal hate crimes and could face the death penalty.\n\nhttps://t.co/Fy0750pfZh","date":"Wed Jun 15 15:51:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Elon Musk said he's 'leaning' towards supporting Florida Gov. Ron DeSantis for president in 2024.\n\nhttps://t.co/hY32mlvv7x","date":"Wed Jun 15 15:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook cuts through the clutter and provides a steady dose of newsy nuggets about Washington's biggest power players. Subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/imKtpywcVf","date":"Wed Jun 15 15:25:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The GOP-led commission of a rural New Mexico county refused to certify primary votes over its distrust of  Dominion vote-tallying machines. \n\nNM's secretary of state asked the state Supreme Court on Tuesday to intervene and certify the results.\n\nhttps://t.co/lNzgJiXMae","date":"Wed Jun 15 15:05:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Trump got his revenge on his first impeachment victim while Democrats lost a crucial House seat in Texas.\n\nHere are 5 takeaways from yesterday's big primary night ⬇️\n\nhttps://t.co/lY2qAibDBs","date":"Wed Jun 15 14:40:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Russian troops control about 80% of the key city Sievierodonetsk but have destroyed all three bridges leading out of it even though Ukrainians were still trying to evacuate the wounded, a regional official said Tuesday.\n\nhttps://t.co/aCX3DoXtta","date":"Wed Jun 15 14:03:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The inside story of how the administration came to slowly realize that Saudi Arabia was too valuable to keep at arm's length\nhttps://t.co/217G5mhcUP","date":"Wed Jun 15 13:01:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Offering free rides on public transit gives state and local officials one way to show they’re doing something to address the longstanding socioeconomic inequities laid bare by the pandemic\nhttps://t.co/wvJya71zgA","date":"Wed Jun 15 12:30:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Activists said they spoke to officials not only about their fears of the international impact if Roe were to fall but also proposed changes to U.S. policy that has long restricted funding for abortions abroad\nhttps://t.co/4FuI2Ewukx","date":"Wed Jun 15 12:02:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The next Republican facing a primary challenge backed by the former president is a supermarket scion from Grand Rapids whose first ad goes up today\nhttps://t.co/oo0ZDg158W","date":"Wed Jun 15 11:00:54 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The industry-backed initiative, which parallels employers’ efforts in other states like California, had divided drivers and sparked fierce debate among Massachusetts politicians and union allies https://t.co/0PhdLCagMi","date":"Wed Jun 15 10:01:14 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Trump’s focus on two congressional races in South Carolina shows just how far he’ll go to get back at Republicans who cross him https://t.co/yNghfulWix","date":"Wed Jun 15 04:31:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Fed is poised to send a message that it has the worst inflation in 40 years under control.\n\nBut many investors and economists are taking a less reassuring signal from the central bank: A recession could come as early as this year. https://t.co/eZd7QYPbuw","date":"Wed Jun 15 04:00:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Tonight's results in South Carolina give an idea of how much room Republicans have to challenge Trump in the primaries, @POLITICO_Steve writes.\n\nMore: https://t.co/J8eeFzAn0l\nLive results: https://t.co/M76RbmPdOV https://t.co/w2J6OJFU5M","date":"Wed Jun 15 03:45:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republican Mayra Flores flipped a Democratic House seat in South Texas in a major special election victory building on GOP gains among Latino voters.\n\nFlores had 51% of the vote when Dem challenger Dan Sanchez conceded. She'll hold the seat until January. https://t.co/L0emskXjO3","date":"Wed Jun 15 03:33:14 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"GOP Rep. Nancy Mace has won her GOP primary in South Carolina, defeating Trump-backed challenger Katie Arrington\nhttps://t.co/QUVhXQikog https://t.co/kbLbIgmFEi","date":"Wed Jun 15 03:23:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Tom Rice has lost his GOP primary in South Carolina to Trump-endorsed challenger Russell Fry.\n\nTrump had rallied voters against  Rice after he voted to impeach the former president last year. https://t.co/cm2E4lRBoa https://t.co/WtWs5H0eE0","date":"Wed Jun 15 03:11:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In the South Texas special election, GOP candidate Mayra Flores has crossed the 50% threshold with over 74% of votes in.\n\nIf she wins, it would be a momentous victory for Republicans, says @POLITICO_Steve.\n\nLive chat: https://t.co/kan5UImO9J\nLive results: https://t.co/IoyycjeUUG https://t.co/uOGNHUzdhc","date":"Wed Jun 15 02:53:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Go inside the minds of the biggest tech players, policymakers and regulators to learn how their decisions affect our lives and our future with our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/BxCW9sJyHj","date":"Wed Jun 15 01:20:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Join our live chat for more analysis of tonight’s primary results from our reporters👇https://t.co/zDyTJHUzk6","date":"Wed Jun 15 00:47:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"It's primary night in South Carolina, Nevada, Maine and North Dakota (+a special election in Texas).\n\nTrump is likely watching South Carolina — he backed GOP candidates taking on Reps. Tom Rice and Nancy Mace — but Nevada is worth keeping an eye on too. @ZachMontellaro explains👇 https://t.co/3TEX3E3v2W","date":"Wed Jun 15 00:42:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 committee indicated today that it will unfurl evidence that a key lawyer for Trump resumed his election-related efforts on Jan. 7, a day after the attack on the Capitol https://t.co/KgyBXuVsmM","date":"Wed Jun 15 00:22:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Get POLITICO Playbook sent to your inbox each morning for an insider's look at Washington's biggest political stories and trends. Don't miss out, subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/tbbD7KJe7z","date":"Tue Jun 14 23:25:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Trump’s endorsement is on the line in more primaries tonight that will shape the future of Congress, continuing his drive to punish even partial opposition inside the GOP https://t.co/GbvI9STVaG","date":"Tue Jun 14 23:11:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After years of failed gun negotiations,  the Senate's ability to tackle mass shootings with bipartisan support relied on four lawmakers with disparate political identities coming together https://t.co/n5pjfC3DwW","date":"Tue Jun 14 22:41:32 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Following a threat to Justice Kavanaugh’s life, the House voted to pass a bill that would extend security to the family members of Supreme Court justices. The bill is now headed to President Biden’s desk.\n\nhttps://t.co/xeymEQI42I","date":"Tue Jun 14 20:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"On DACA’s 10th anniversary, a group of GOP business leaders said protecting Dreamers would help ease the nation’s labor shortages, reduce food prices and create jobs for all.\n\nhttps://t.co/1L2o2uCcRX","date":"Tue Jun 14 19:45:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Training and logistics are complicating the possible sale of armed drones to Ukraine as leaders in Kyiv plead for the advanced weaponry amid Russian battlefield advances.\n\nhttps://t.co/48Y3g3V2hd","date":"Tue Jun 14 19:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Arkansas Sen. Tom Cotton huddled with top donors Tuesday morning to describe his planning for a potential 2024 White House campaign, telling them a comeback bid by former President Trump wouldn’t deter him from running.\n\nhttps://t.co/AxXwas0NAf","date":"Tue Jun 14 18:53:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Join POLITICO's Telegram channel for biggest updates and takeaways of the 2022 midterms\n\nhttps://t.co/saHQuFUa06","date":"Tue Jun 14 18:05:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"➡️ In Nevada, a leader of a Trump-aligned group of election conspiracy theorists could get one step closer to becoming the battleground state’s chief elections officer.\n\nhttps://t.co/ZRbSx8UfQv","date":"Tue Jun 14 18:05:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"➡️ In Texas’ special election, Republicans are testing their strength among Latino voters in the Rio Grande Valley. They’re supporting Mayra Flores while Democrats are backing Daniel Sanchez.","date":"Tue Jun 14 18:05:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"➡️ Keep your eyes on South Carolina where Trump has endorsed two GOP candidates: Katie Arrington, who is taking on Rep. Nancy Mace, and Russell Fry, who is taking on Rep. Tom Rice. Rice has supported impeaching Trump from office last year.\n\nhttps://t.co/GPxZtlk78Z","date":"Tue Jun 14 18:05:35 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Today we’ve got primaries in Maine, Nevada, North Dakota and South Carolina. Plus, there’s a special election in Texas. Here’s what you should know:\n\nhttps://t.co/V4EXKEw3EJ","date":"Tue Jun 14 18:05:34 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden said Tuesday that the U.S. will build temporary silos on Poland’s border with Ukraine to facilitate the export of grain out of the war-torn nation and address surging food prices amid Russia’s invasion.\n\nhttps://t.co/qzKrO29Yju https://t.co/ArLjh2wMju","date":"Tue Jun 14 17:46:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After two major hearings from the Jan. 6 select panel, there have been just two clear-cut denials of specific allegations:\n\n1) Rudy Giuliani reasserted his sobriety on Election Night\n2) Rep. Scott Perry (R-Pa.) said he never sought a pardon\n\nhttps://t.co/wytepZvnsg","date":"Tue Jun 14 17:16:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"One of the biggest lenders within the crypto market, Celsius Network, announced it was suspending withdrawals and trading due to “extreme market conditions” — a decision that'll prevent people from accessing their digital assets.\n\nhttps://t.co/cOB2YpyIA0","date":"Tue Jun 14 16:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Go behind-the-scenes on Capitol Hill by subscribing to Huddle for scoops on the maneuvering, policy initiatives, and power players making waves in Congress. Start reading today. \nhttps://t.co/dfpSNWPYfR https://t.co/HkXxUWIt51","date":"Tue Jun 14 16:03:34 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"An advocacy group had challenged the Bronx Zoo’s confinement of a 41-year-old  elephant, arguing that Happy, as an intelligent being, should be able to sue under habeas corpus rights against improper detention. \n\nNew York’s top court disagreed.\n\nhttps://t.co/VOlPNHKM8U","date":"Tue Jun 14 15:45:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Six of the nation’s biggest financial firms have been told that they will be denied access to state contracts in West Virginia as Republican leaders there continue their pushback on what they see as bias against the fossil fuel industry.\n\nhttps://t.co/gh5Jd1S8Iu","date":"Tue Jun 14 14:37:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden will travel to the Middle East next month, making stops in Israel, the West Bank and then Saudi Arabia, where he’ll seek to rebuild relations after vowing to make the kingdom a “pariah.”\n\nhttps://t.co/3UXJ0AObFI","date":"Tue Jun 14 14:09:27 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"From the West Wing to cabinet departments and agencies across the Executive Branch, West Wing Playbook is the definitive guide to the inner workings of the Biden administration. Subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/wcqDVjpuD7","date":"Tue Jun 14 13:05:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former President Donald Trump’s revenge tour lands in South Carolina on Tuesday.\n\nIt has been a bumpy ride so far.\n\nhttps://t.co/V4EXKEw3EJ","date":"Tue Jun 14 11:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"GOP Rep. Tom Rice had barely ever criticized Donald Trump before he shocked just about everyone by voting to impeach him in January 2021.\n\nHis experience over the next 17 months in his district might explain why so few in his party have chosen to join him\n\nhttps://t.co/GPxZtlk78Z","date":"Tue Jun 14 11:35:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"House liberals are ready to embrace the modest Senate gun deal as a huge breakthrough after years of rising mass shootings. That is, if a bill actually makes it to them.\n\nhttps://t.co/C5NQYxouU5","date":"Tue Jun 14 11:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Ukraine’s president isn’t the only one who’s frustrated that cutting-edge U.S. military gear isn’t making its way to the battlefield\n\nhttps://t.co/52CkFXUBps","date":"Tue Jun 14 10:55:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Keep up with Congress when you read Huddle, our indispensable guide to Capitol Hill. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/cNpx97N0JH","date":"Tue Jun 14 02:05:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Here are the aides and advisers who told former President Donald Trump he lost the 2020 election https://t.co/vuLopxNPeB","date":"Tue Jun 14 01:34:46 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Consumer sentiment has plunged to levels not seen since the 2008 financial crisis, down more than 40 percent over the past 12 months, according to one closely watched survey. https://t.co/E3RHkdOjQe","date":"Mon Jun 13 23:43:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden will run for re-election, said W.H. Press Secretary Karine Jean-Pierre. https://t.co/HnFFOYgWFP","date":"Mon Jun 13 21:51:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Ohio school districts could begin arming employees as soon as this fall under a bill signed into law Monday by GOP Gov. Mike DeWine.\n\nhttps://t.co/P6sPe05OQU","date":"Mon Jun 13 21:34:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Senate is racing to finalize a gun safety package before Congress leaves for recess in under 2 weeks. \n\n10 Republicans have agreed to back a legislative framework, but  the path forward is still rocky as parties haggle over the specifics.\n\nhttps://t.co/tUBce2yzpk","date":"Mon Jun 13 21:20:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Former Trump campaign peels back curtain on Jan. 6, in 180 seconds ⬇️ https://t.co/mkNwaF6csb","date":"Mon Jun 13 20:52:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Investigators claim former President Trump scammed donors out of more than $250M for his \"Election Defense Fund\" — a fund they say never actually existed.\n\nHere's Rep. Adam Schiff speaking on the matter: https://t.co/4StkiKHQk3","date":"Mon Jun 13 19:49:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"New York Gov. Kathy Hochul on Monday signed a package of bills fortifying abortion protections ahead of a potential SCOTUS ruling that could overturn Roe v. Wade.\n\nNY is among the first in the nation to act ahead of the looming federal decision.\n\nhttps://t.co/u5Mcqs6dVr","date":"Mon Jun 13 19:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Crypto markets plummeted on Monday, dropping below $1 trillion in market capitalization for the first time since early 2021.\n\nhttps://t.co/8a42m7XdTe","date":"Mon Jun 13 18:45:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to West Wing Playbook to get daily scoops and nuggets from inside the White House and across the Cabinet. Don't miss out.\nhttps://t.co/AsF2TXHAuK https://t.co/HQwlmadne9","date":"Mon Jun 13 18:20:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House committee investigating Jan. 6 just wrapped up today’s hearings. Here are the top takeaways ⬇️\n\nhttps://t.co/kCvlpznRnj","date":"Mon Jun 13 18:10:34 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The second day of the Jan. 6 hearings on Monday focused on former President Trump's promotion of his false fraud claims.\n\nHere's BJay Pak's testimony debunking Trump's 'suitcase full of ballots' claim: https://t.co/CCfgqbaMfc https://t.co/9090rNM6vf","date":"Mon Jun 13 17:49:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Amazon will begin using drones to deliver parcels — nearly a decade after Jeff Bezos first floated the concept — beginning in Lockeford, a small town in California later this year.\n\nhttps://t.co/3RCodmAWo1","date":"Mon Jun 13 17:21:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The DOJ is increasingly seeking and receiving permission to secretly reach into Americans’ computers to delete malware — a shift officials say reflects a growing embrace of aggressive and creative tactics for combating a surge in cyberattacks.\n\nhttps://t.co/9pL16L9UZV","date":"Mon Jun 13 16:40:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"An “apparently inebriated” Rudy Giuliani advised Trump to declare victory in the middle of the night after Election Day 2020, the former president's top aides told the Jan. 6 committee in testimony https://t.co/f78HI3To18","date":"Mon Jun 13 16:03:40 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Bipartisan resentment is building among lawmakers who say they're being cut out of Biden’s trade agenda as he begins brokering deals around the globe https://t.co/TSrGzHVjYT","date":"Mon Jun 13 15:48:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"FDA reviewers said Pfizer and Moderna vaccines for kids under 6 are safe and effective, setting the stage for regulators to potentially authorize the shots for emergency use later this week https://t.co/Jp8FTSrTRz","date":"Mon Jun 13 13:51:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Both campaigns are a test of whether less traditional, more progressive Democratic candidates can win high-profile Senate races in battleground states https://t.co/qGboroXgQK","date":"Mon Jun 13 12:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Our newsletter Digital Future Daily unlocks the most important stories determining the future of tech from Washington to Silicon Valley and around the world. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/YqW5FUPAGW","date":"Mon Jun 13 12:02:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Marco Rubio’s work has mostly faded from the headlines since his time as an immigration deal-cutter and presidential candidate. He’s at peace with it. https://t.co/pE6zFB68Zh","date":"Mon Jun 13 11:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Nevada Republicans are about to decide whether the leader of a Trump-aligned group of election conspiracy theorists will be one step away from becoming the battleground state’s chief elections officer https://t.co/ZRbSx8UfQv","date":"Mon Jun 13 11:30:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As Western investors and developing world leaders pursue new initiatives that encourage countries to adopt Bitcoin as an official currency, the stewards of the global financial system are increasingly pushing back https://t.co/NabvTpw1Ae","date":"Mon Jun 13 11:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The possible end to federal abortion protections is spotlighting down-ballot races in the upcoming midterm elections, particularly for judges who could soon be asked to decide whether their state constitution protects a person’s right to end a pregnancy https://t.co/0JMuSM107j","date":"Mon Jun 13 10:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rice has relied on internal maneuvering and bureaucratic know-how to place herself at the center of some of the fiercest debates roiling Washington. https://t.co/WK4wk1UuCn","date":"Mon Jun 13 00:46:28 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to Digital Future Daily to stay on top of the most important stories determining the future of tech from Washington to Silicon Valley, and beyond. \nhttps://t.co/bpE3EOuhqZ https://t.co/9Xqwbz7Igk","date":"Mon Jun 13 00:05:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Step inside the West Wing and get the latest updates on the president and his team. Subscribe to West Wing Playbook today.\nhttps://t.co/AsF2TXHAuK https://t.co/HpTdvSqnve","date":"Sun Jun 12 16:35:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Ten GOP senators have backed a bipartisan framework for a gun safety bill, released today by Senate negotiators — the number needed to overcome a filibuster https://t.co/17dshVOlI7","date":"Sun Jun 12 16:04:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Senators are preparing to release a bipartisan gun safety framework today, according to people familiar with the negotiations. Their next challenge? Writing legislation that can get 60 votes. https://t.co/17dshVOlI7","date":"Sun Jun 12 15:19:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After the lockout ended in March, Sanders promised to revoke one of Major League Baseball’s most important privileges: its century-old antitrust exemption https://t.co/06oORkM5AX","date":"Sun Jun 12 15:00:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court is expected to issue a ruling this month hobbling the Biden administration’s efforts to rein in climate change — but its impact could weaken the executive branch's power to oversee wide swaths of American life https://t.co/7BKSkm8O4F","date":"Sun Jun 12 14:01:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Chewing gum heir Beau Wrigley’s cannabis company is beset by lawsuits filed by angry investors alleging fraud https://t.co/DjhU5OuWU9","date":"Sun Jun 12 12:57:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Keep up with Congress with Huddle, our indispensable Capitol Hill morning newsletter. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/N15QopX2zD","date":"Sat Jun 11 22:10:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Nobody covers \"this town\" quite like Playbook. Subscribe to the unofficial guide to official Washington.\nhttps://t.co/Ceig2eRhJ2 https://t.co/Y4XyUUCuYG","date":"Sat Jun 11 15:05:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The swing state could soon lose all abortion access if Roe is overturned. It could also become a destination for patients across the midwest.\nhttps://t.co/JIN26udgQ8","date":"Sat Jun 11 14:01:32 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Val Demings may not get any measurable help in a state that may be slipping away from her party\nhttps://t.co/KMPCgs9SJk?","date":"Sat Jun 11 13:00:51 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Summit of Americas still got overshadowed by drama over the guest list and a lack of concrete achievements\nhttps://t.co/RHRiNnKir8","date":"Sat Jun 11 12:17:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"New York passed a series of bills to bolster abortion rights, but failed to pass a measure to add it to the state constitution. It's an issue facing other states, as well.\nhttps://t.co/3IWhFeXW4n","date":"Sat Jun 11 12:06:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Add West Wing Playbook to your daily reads for newsy nuggets and details you won't find anywhere else about the Biden administration.  Subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/J2j694iP3W","date":"Sat Jun 11 01:50:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"An Illinois man was arrested for an alleged attempt to firebomb the Chinese embassy in Washington.\n\nHe warned officers about a week earlier that he would attempt to firebomb the embassy. https://t.co/6kE5kFItMz","date":"Fri Jun 10 21:55:39 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Doug Mastriano's come-from-nowhere popularity is fusing religion and politics in a new way. He's either Democrats' dream opponent, or the establishment's worst nightmare. https://t.co/ziDRQon8wl","date":"Fri Jun 10 21:11:00 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Start each day with POLITICO Playbook for the big stories and scoops you need to know – and the insider nuggets that you want to know – from Washington and from across the political landscape. Subscribe today.\nhttps://t.co/Ceig2eRPyA https://t.co/gcDKEPa0Ds","date":"Fri Jun 10 21:00:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The average U.S. gas price flirted with $5 a gallon on Friday, a record high.\n\nBut even as Americans complain about rising gas prices, they’re filling up their tanks at the fastest pace in three years. \nhttps://t.co/eD3J6J2tfK","date":"Fri Jun 10 20:35:22 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The CDC is asking clinicians to watch for a widening range of monkeypox symptoms as U.S. cases rise and evidence of community spread mounts.\n\nWhile monkeypox can be spread at close range, the CDC said it can't be transmitted over long distances by air.\nhttps://t.co/rZBsZFrpSQ","date":"Fri Jun 10 18:37:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Opinion: The new information from the Jan. 6 hearings reinforced what we already knew, making it unlikely that any minds will be changed https://t.co/pDB6LoDHuY","date":"Fri Jun 10 18:26:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The surge in U.S. consumer prices in May surprised economists and undercut the Biden administration’s hopes that inflation would moderate in the coming months https://t.co/9vINVHo8Nt","date":"Fri Jun 10 16:06:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The White House said that the CDC still may bring back the requirement depending on rising Covid-19 cases \nhttps://t.co/ifNQXJP5R8","date":"Fri Jun 10 15:02:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The United States has ordered 500,000 more monkeypox vaccine doses for delivery this year https://t.co/v4b73Lltig","date":"Fri Jun 10 14:15:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"What's really happening on Capitol Hill? Keep up with Congress by reading Huddle, our scoop-filled newsletter for everything you need to know on the Hill. Subscribe today\nhttps://t.co/dfpSNWPYfR https://t.co/vf5w25atw8","date":"Fri Jun 10 13:25:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Biden administration has opted not to go with Donald Trump’s red, white and blue paint scheme for Air Force One after a new study showed it could drive up the cost https://t.co/GsluFj7M8X","date":"Fri Jun 10 12:41:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The progressive district attorney's recall defeat was counterbalanced by victories around the state https://t.co/T9RHbMV63m","date":"Fri Jun 10 11:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"At the select committee's first hearing, members mostly took a back seat while airing the testimony from members of Donald Trump's inner circle https://t.co/C6nW8Oqkfv","date":"Fri Jun 10 10:30:09 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Washington Post has fired Felicia Sonmez for “insubordination” after the well-known reporter spent days publicly accusing fellow colleagues and leadership at the paper of fostering an environment unsupportive of female staffers. https://t.co/JlOkYUhpCM","date":"Fri Jun 10 01:48:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Add Huddle, our must-read for Hill staff, to your morning reads to stay up on the latest news coming from Capitol Hill. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/ZyKoHDXzJm","date":"Fri Jun 10 01:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Washington Post has fired reporter Felicia Sonmez after she complained publicly about a perceived lack of institutional willingness to confront misogynistic treatment of female staffers.\n\nhttps://t.co/JlOkYUhpCM","date":"Thu Jun 09 22:04:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A shooting at a Maryland business has claimed multiple victims. \n\nThe suspect is no longer a threat to the community, according to law enforcement. \nhttps://t.co/BbTgLCCL7y","date":"Thu Jun 09 21:37:38 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Biden says he’s looking at ways to shore up abortion rights if the Supreme Court overturns Roe v. Wade.\n\nHe has few options in states determined to restrict abortion – but there are actions his admin can take to bolster reproductive rights.\nhttps://t.co/3U56Yu0XRV","date":"Thu Jun 09 21:24:40 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"NASA is launching a scientific study of reported UFO sightings to better understand the series of unidentified aircraft flying in protected airspace in recent years. \n\nThe study isn’t related to a Pentagon Task force investigation of the phenomena. \nhttps://t.co/nChpWOCdAH","date":"Thu Jun 09 20:55:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 committee is opening its case to Americans with one overarching conclusion about the violence at the Capitol: It was carefully planned and orchestrated https://t.co/NBqTe0nQJf","date":"Thu Jun 09 19:55:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Opinion: Biden somehow decided during the 2020 election he was the revolutionary figure the country had long been waiting for. His hand has proven anything but steady. \nhttps://t.co/MxA3FH8TIs","date":"Thu Jun 09 19:03:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A former top aide to Mark Meadows has replaced her lawyer ahead of the Jan. 6 hearings.\n\nHer previous attorney has deep Trump World connections, while her new lawyer is a longtime close ally of Jeff Sessions.\nhttps://t.co/Lch9qt2FEZ","date":"Thu Jun 09 18:12:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Digital Future Daily is a newsletter that chronicles how the next wave of tech will reshape civic and political life, including activism, fundraising, lobbying and legislating.  Subscribe now.\nhttps://t.co/bpE3EOuhqZ https://t.co/5TeahJe95w","date":"Thu Jun 09 17:05:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Republican candidate for Michigan governor Ryan Kelley was arrested on misdemeanor charges for participation in the Jan. 6 Capitol riot https://t.co/DCXfkJrO2q","date":"Thu Jun 09 16:44:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A growing number of lawyers inside America’s top legal organization say there’s something rotten at the American Bar Association: The leadership is in the pockets of Big Tech https://t.co/Trp5qCgRKT","date":"Thu Jun 09 15:11:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Every time Oleksiy and his fellow artillerymen hit a Russian target, they have one person to thank: Elon Musk, the world’s richest man\n\nhttps://t.co/JyR2kYkbkm","date":"Thu Jun 09 12:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"House Democrats know that even the most damning findings from their probe into the Capitol attack may not save their majority in November. They’re still pleading with voters to pay attention.\n\nhttps://t.co/6ERXrKDSdm","date":"Thu Jun 09 12:02:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As former U.N. Ambassador Nikki Haley crisscrosses the country ahead of an anticipated 2024 presidential bid, she is also fixated on defending her home turf — from an incursion led by her onetime boss, former President Donald Trump\n\nhttps://t.co/4PLPcIOfyH","date":"Thu Jun 09 11:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"White House officials initially thought the situation was under control when a major infant formula plant shut down and issued a recall in February\n\nhttps://t.co/pmsILqrkvJ","date":"Thu Jun 09 11:40:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 select committee’s hearings are all about one man, and it’s not the one you think.\n\nIt’s Mike Pence.\n\nhttps://t.co/cVi2ltXPh8","date":"Thu Jun 09 11:30:12 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Bernie Sanders has something to get off his chest: Without a course correction, he sees the Democratic Party on track to get shellacked this fall\n\nhttps://t.co/qWETG5X4Eq","date":"Thu Jun 09 11:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Colorado isn’t viewed as a prime Republican Senate pickup opportunity this fall — not yet at least\n\nhttps://t.co/sUbA0pT8pq","date":"Thu Jun 09 11:10:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As much of the political world tunes in to the Jan. 6 commission’s opening hearing Thursday evening, former President Barack Obama will be half-a-world away, preparing his own presentation about the potholed path that democracy is on\n\nhttps://t.co/ej4e6GPqZM","date":"Thu Jun 09 11:00:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Michigan is one of more than 20 states with a law on the books that would outlaw nearly all abortions if the Supreme Court overturns Roe v. Wade\n\nhttps://t.co/7kFALFJLdY","date":"Thu Jun 09 10:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Technology is always evolving, so to make sure you're always in the know, read our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/GwYguNZ8yq","date":"Thu Jun 09 02:00:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Trump took a lot of heat for his decision to replace the traditional Air Force One paint scheme with his signature red, white and dark blue. Now, the Air Force says Trump’s paint job could contribute to excessive temperatures on the plane. https://t.co/GH4NRgpZCJ","date":"Thu Jun 09 01:00:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House committee investigating the Jan. 6 attack will soon hold its first primetime hearing on efforts to overturn the 2020 election. \n\nTrump World is still figuring out what to do about it.\nhttps://t.co/lZl0RcupX6","date":"Thu Jun 09 00:05:15 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook is the unofficial guide to official Washington. Subscribe today for the latest from our team covering every corner of power in D.C.\nhttps://t.co/Ceig2eRhJ2 https://t.co/lqbpbeXhgn","date":"Wed Jun 08 22:40:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Fourth grade Uvalde survivor Miah Cerrillo recounted horrific details of the school shooting in a video testimony before Congress.\n\n\"He shot my friend that was next to me, and I thought he was going to come back to the room, so I grabbed the blood and put it all over me.\" https://t.co/foneXyRSlW","date":"Wed Jun 08 21:28:12 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"California could become the first state to explicitly enshrine abortion rights in the state constitution.\n\nThe proposed amendment is up against a tight deadline and needs supermajority approval to make it on the November ballot. https://t.co/sYRlMyPB1H","date":"Wed Jun 08 20:09:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The emotional testimonies before Congress come after a national outcry over the Buffalo and Uvalde mass shootings. Here’s how legislative efforts to pass a gun safety package in the House and Senate are going ⬇️\n\nhttps://t.co/HztV3bYarb","date":"Wed Jun 08 20:00:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A fourth grader recounted the Uvalde shooting to lawmakers in a gun violence hearing. \n\nShe recalled smearing blood on herself to hide from the gunman and grabbing her dead teacher's phone to dial 911. \n\n\"I don't want it to happen again,\" she said. https://t.co/M4KLJB0TND","date":"Wed Jun 08 19:58:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A man was charged with attempted murder after he allegedly entered Brett Kavanaugh’s neighborhood with a gun.​\n\nAuthorities say the man had threatened to kill “a specific Supreme Court justice.”\nhttps://t.co/0VL5PwZQyg","date":"Wed Jun 08 18:56:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Pentagon pledged to designate an agency to oversee the development of defenses against cruise missiles by the end of July after lawmakers threatened to cut the travel budget of its No. 2 official over the issue.\nhttps://t.co/K0BSr4HBak","date":"Wed Jun 08 18:37:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"‘I do not feel protected’: Mother of Buffalo shooting survivor testifies https://t.co/o3bSxuzwAc","date":"Wed Jun 08 16:25:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"‘My mother’s life mattered’: Son of Buffalo shooting victim testifies https://t.co/LpvMgUUJ56","date":"Wed Jun 08 16:25:34 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"🎙️ We're live on Spaces!\n\nJoin @PoliticoScott, @lara_korte, @ZachMontellaro and @JeremyBWhite for a debrief of last night's primary races:\nhttps://t.co/uu4xO8XdaR","date":"Wed Jun 08 16:07:41 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Following the incident, Sen. Mitch McConnell bashed the House for not yet passing legislation boosting security for Supreme Court justices and their families.\n\nhttps://t.co/7GC097U0hK","date":"Wed Jun 08 15:55:53 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court said today that an armed man who made threats against Justice Kavanaugh was arrested near the justice’s house in Maryland.\n\nThe California man, in his 20s, was armed with a gun and a knife, according to a law enforcement official. \n\nhttps://t.co/r8EMuhpMjE","date":"Wed Jun 08 15:22:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"House and Senate Republicans are breaking apart in their response to riot hearings: One side’s pushing back, and the other is ready to move on.\n\nhttps://t.co/pPE2rx5xtR","date":"Wed Jun 08 15:10:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We'll be on Spaces later today breaking down the biggest takeaways from last night's primaries.\n\nJoin @PoliticoScott, @lara_korte, @ZachMontellaro and @JeremyBWhite at 12 pm EST 👇\nhttps://t.co/uu4xO8XdaR","date":"Wed Jun 08 14:42:26 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The first big Senate race of 2024 is taking shape with the GOP setting its sights on Democrat Bob Casey’s Senate seat.\n\nhttps://t.co/hBEZmTMQOm","date":"Wed Jun 08 14:40:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House GOP’s campaign arm is laying down its first round of fall TV ad reservations: a $52.3 million investment.\n\nThe bulk of the buy targets Democratic-held seats — a sign that there's a plethora of pickup opportunities for the GOP.\n\nhttps://t.co/tXYrtBmgp7","date":"Wed Jun 08 14:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Donald Trump came into Tuesday’s primaries on the heels of a dismal May 24 performance. This time around, he didn’t have as much at stake. He endorsed 16 candidates. Here are the winners.\n\nhttps://t.co/p0uoGoyVX2","date":"Wed Jun 08 13:40:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Here are six takeaways from yesterday's big primary night.\n\nP.S. California — legendary for taking its time counting votes — still has contests up in the air.\n\n⬇️\n\nhttps://t.co/WyXJqGPQt2","date":"Wed Jun 08 13:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO asked leading gubernatorial candidates in seven battleground states to explain where they stand on one of the most contentious issues of the 2022 midterms\nhttps://t.co/mS3U8NrhTk","date":"Wed Jun 08 12:30:12 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to West Wing Playbook to get daily scoops and nuggets from inside the White House. Don't miss out. \nhttps://t.co/AsF2TXHAuK https://t.co/onemGUVGyO","date":"Wed Jun 08 12:15:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Most of the NRCC's money is targeting House Democratic incumbents, as Republicans fight to flip the majority\nhttps://t.co/tXYrtBmgp7","date":"Wed Jun 08 12:02:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"One chamber's Republicans want to fight the select committee messaging that will go on blast this month. Their colleagues across the Capitol plan to ignore it\nhttps://t.co/pPE2rx5xtR","date":"Wed Jun 08 11:30:11 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Pennsylvania Democrat Bob Casey could get a challenge from Republican David McCormick\nhttps://t.co/hBEZmTMQOm","date":"Wed Jun 08 11:00:51 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Voters have recalled San Francisco District Attorney Chesa Boudin in a blow to a national movement toward more lenient prosecution. https://t.co/MM6P7aVLtI","date":"Wed Jun 08 04:21:22 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"@politicoca California is the state to watch tonight, but @POLITICO_Steve explains why Mississippi and Montana are worth keeping an eye on too.\n\nLive chat: https://t.co/4KsGc6nxF8\nRaces to watch: https://t.co/O1SWqb8oBI https://t.co/uoIxLv2XUi","date":"Wed Jun 08 03:22:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Tonight, our @politicoca crew is joining our primary night live chat to walk through what’s happening on the ballot in California.\n\nFollow along👇\nhttps://t.co/wj2qkstvSx","date":"Wed Jun 08 03:17:25 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Michael Franken has won the Democratic nomination for Iowa Senate, defeating former Rep. Abby Finkenauer. \n\nHe will face off against GOP Sen. Chuck Grassley in November. https://t.co/asGUyQWzNU https://t.co/KkQzIi7lfG","date":"Wed Jun 08 02:23:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Mark Ronchetti has won the Republican primary for New Mexico governor https://t.co/RlgKVEDBAT https://t.co/oRXdzx446v","date":"Wed Jun 08 01:59:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Start your day with POLITICO Playbook for the insider nuggets and scoops you need to know from Washington. Subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/xZIgGRMkPU","date":"Wed Jun 08 00:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Massachusetts Dems wary of GOP rule are lining up behind a candidate they think can win the governor's race. \n\n“People don’t want ... Donald Trump acolytes or supporters in office. That’s why people are being very clear-eyed about who they support.\"\nhttps://t.co/ujrN6hDMIw","date":"Tue Jun 07 23:49:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Dems acknowledge gun safety talks will fall far short of what they want. \n\nThey’re desperate for a deal anyway — and seem willing to take whatever the GOP will give them. https://t.co/7wRcyJZr2K","date":"Tue Jun 07 22:38:39 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The FDA’s independent vaccine advisory committee voted to recommend that regulators authorize the Novavax Covid-19 vaccine for emergency use in adults https://t.co/GkxeC3sXXj","date":"Tue Jun 07 21:50:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"McConaughey stressed the need for gun restrictions, such as background checks, red flag laws, raising the minimum age of purchase and a waiting period for guns such as AR-15 rifles.\n\nMore from his visit to the White House👇 https://t.co/Ggg2cJTBIH","date":"Tue Jun 07 21:41:54 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"\"We start by making the loss of these lives matter.\"\n\nIn an emotional speech at the White House, Matthew McConaughey called for lawmakers to act on gun reforms — two weeks after a school shooting in his hometown left 19 students and two teachers dead. https://t.co/0BZvgK3omL","date":"Tue Jun 07 21:39:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Alexandria Ocasio-Cortez is backing Alessandra Biaggi in her headline-grabbing run against Rep. Sean Patrick Maloney, the House Democrats' campaign chief.\n\nhttps://t.co/nnem35hgqk","date":"Tue Jun 07 19:55:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"For the most important election updates, follow POLITICO's Telegram channel: https://t.co/saHQuFUa06","date":"Tue Jun 07 19:28:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"By 2024, all mobile devices in the EU will have the same charger. The new rule is aimed to reduce electronic waste.","date":"Tue Jun 07 19:17:24 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"U.S. Senators are closing in on a gun reform deal. Here's what they've said so far: https://t.co/BprIgfBNgH https://t.co/gSclNJIcHs","date":"Tue Jun 07 18:17:30 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Senior House Republicans will preview their response to the Jan. 6 select committee hearings before a select group of press later today. \n\nPOLITICO was denied access to the call by Rep. Elise Stefanik's office.\n\nhttps://t.co/rTpNaFBxuT","date":"Tue Jun 07 18:05:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 select committee has interviewed the top Secret Service agent on then-President Donald Trump’s protective detail during the Capitol attack, according to sources.\n\nhttps://t.co/x7F3bM7NMF","date":"Tue Jun 07 17:26:47 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Democratic lawmakers held a memorial on the National Mall to the 45,000 lives lost to gun violence. https://t.co/NkMJtIwiGf\n\nHere's Sen. Amy Klobuchar speaking at the event: https://t.co/HEKgE0y0s1","date":"Tue Jun 07 17:16:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"It's primary day in California, which is once again poised to be the epicenter of the battle for the House.\n\nThe state has at least 10 potential swing districts, from the Sacramento suburbs to Orange County. @POLITICO_Steve runs through them all here👇 https://t.co/K0AgMiPokt","date":"Tue Jun 07 16:53:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"There are now over 1,000 cases of monkeypox across 29 countries. Here's what researchers do — and don’t — know about it  ⬇️\n\nhttps://t.co/O1CaJQLVU9","date":"Tue Jun 07 16:15:51 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Florida Gov. Ron DeSantis is building momentum in the West. Over the weekend, he won a straw poll at \"the largest gathering of conservatives in the Western U.S.,\" topping former President Trump.\n\nhttps://t.co/ECyFHGokfY","date":"Tue Jun 07 15:19:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In non-Cali news: Rep. Dusty Johnson (R-S.D.) is defending his seat from state Rep. Taffy Howard, who has spread Trump’s lies that the 2020 election was stolen. Johnson had voted to create a bipartisan commission to investigate the Jan. 6 attack.\n\nhttps://t.co/54EKIkP02F","date":"Tue Jun 07 14:01:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"What else? Keep your eyes on LA’s mayoral race, where billionaire (and former Republican) Rick Caruso is neck-and-neck with progressive Democratic Rep. Karen Bass.\n\nhttps://t.co/AjXRk1SOUr","date":"Tue Jun 07 14:01:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Two CA House Republicans — Reps. David Valadao and Young Kim — in particular could be in trouble. They face uncomfortably close primary contests — and a loss by either could seriously endanger the GOP’s hold on their swing seats in the fall.\n\nhttps://t.co/DRPUdAX6cs","date":"Tue Jun 07 14:01:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Everyone’s watching CA’s all-party primaries, and with good reason: the path to the House majority crosses through the Golden state (again). \n\nhttps://t.co/I0Bx0QlA4O","date":"Tue Jun 07 14:01:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"It's another big primary day, folks. Today voters in California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota will head to the polls. Here’s what to know ⬇️\n\nhttps://t.co/evYhamaBQw","date":"Tue Jun 07 14:01:16 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"National Democrats are making a last-minute foray into a special House election next week in South Texas, spending six-figures to keep Republicans from flipping a seat that’s been blue for decades\n\nhttps://t.co/6UeH8VB9sU","date":"Tue Jun 07 12:05:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Concern about rising crime is overtaking key elections in California Tuesday, where liberal voters are putting pressure on Democrats around the state to address a growing sense of lawlessness spurred during the pandemic\n\nhttps://t.co/evYhamaBQw","date":"Tue Jun 07 11:40:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Indivisible Project, a network of local progressive organizing groups that sprang up during the Trump administration, is spending $7 million in the 2022 midterms to help elect Democrats by emphasizing “MAGA extremism.”\n\nhttps://t.co/UKDRjBuGd5","date":"Tue Jun 07 11:15:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Progressives two years ago won a big battle by getting the Federal Reserve to ease up on inflation. Now, the staying power of that hard-fought victory is in doubt.\n\nhttps://t.co/wZorhvIsfL","date":"Tue Jun 07 10:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Eric Garcetti allies privately pressured Sen. Mark Kelly to support the LA mayor's ambassadorial nomination, according to sources.\n\nThe White House reiterated that Garcetti played no part in the pressure campaign.\n\nhttps://t.co/NTVtpmSNmb","date":"Mon Jun 06 22:01:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A U.S. gov report to be released Tuesday backs Afghan President Ashraf Ghani's claims that he and his coterie didn't flee with millions following the Taliban's takeover of Afghanistan.\n\n“[It] may have been closer in value to $500,000,” the report states.\n\nhttps://t.co/s4ewQkNrBs","date":"Mon Jun 06 21:25:28 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Justice Department has charged leaders of the Proud Boys — the pro-Trump extremist group that played a central role in the Jan. 6, 2021 Capitol attack — with conspiring to use force to oppose the presidential transfer of power.\n\nhttps://t.co/GRiU4zg4Hz","date":"Mon Jun 06 20:14:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"House Democrats spent former President Trump’s final years in office passing bills that withered in the Senate but shaped the party’s presidential-campaign agenda — and as 2024 approaches, their GOP colleagues are poised to follow the same model.\n\nhttps://t.co/yplHRbvdaK","date":"Mon Jun 06 19:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The office of Rep. Marjorie Taylor Greene confirmed to POLITICO that far-right provocateur Milo Yiannopoulos is now an intern there. The Daily Beast was first to report the hire.\n\nhttps://t.co/zT3bfxkT7B","date":"Mon Jun 06 19:00:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As President Joe Biden prepares to host the Summit of the Americas, expectations are low that he'll deliver. He has no serious trade deals to offer and migration remains unresolved.\n\nHere’s what to watch for during the gathering ⬇️\n\nhttps://t.co/nuxZA0MS11","date":"Mon Jun 06 17:40:13 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"🗣️ We're live on Spaces!\n\nPolitico's @ZachMontellaro joins @GrandjeanAmanda, @BPC_Bipartisan's @mattiweil and @NCSBE's Karen Brinson Bell for a conversation on ballot paper shortages in 2022 and 2024 👇\nhttps://t.co/BqDFCLaK4Q","date":"Mon Jun 06 16:21:52 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"New York signed stronger gun-control measure into law today. \n\nThe new laws will bolster existing ones and close what state leaders viewed as loopholes, including those that allowed the Buffalo shooter to slip through the state's Red Flag statute.\n\nhttps://t.co/BJCEwwFRY0","date":"Mon Jun 06 16:12:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Mexican President Andrés Manuel López Obrador says he'll skip the Summit of the Americas this week after the U.S. didn't invite authoritarian leaders from Cuba, Nicaragua and Venezuela.\n\n“There cannot be a summit if all countries are not invited,” he said. https://t.co/YnfRv4sa1N","date":"Mon Jun 06 16:00:07 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A college campus free-speech group is broadening its efforts to fight so-called cancel culture and other perceived threats to free speech in America.\n\nSome see the push as a challenge the ACLU's primacy as a defender of free speech. https://t.co/jCz4y7qBDQ","date":"Mon Jun 06 15:47:39 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Communication around the pandemic and its eventual end have long presented a challenge for the White House https://t.co/9lCvu9Khel","date":"Mon Jun 06 11:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The campaign has fueled a lobbying bonanza on the part of digital asset startups, venture capitalists and consumer watchdogs https://t.co/F54Bb73h96","date":"Mon Jun 06 11:20:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"For decades, billionaire Rick Caruso has quietly wielded influence and curried political capital in one of the nation’s most sprawling and diverse metropolises. Now, he wants to cash in that clout for the top job in city hall. https://t.co/AjXRk1SOUr","date":"Mon Jun 06 10:50:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Joe Biden and his aides have grown increasingly frustrated by their inability to turn the tide against a cascade of challenges threatening to overwhelm the administration https://t.co/oTzYMUF5uo","date":"Mon Jun 06 10:20:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House select committee investigating the Jan. 6 insurrection starts its much-anticipated public hearings on Thursday, and Biden and his aides are carefully keeping their distance from the committee’s work. https://t.co/Xg98KAUvIM","date":"Sun Jun 05 13:45:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As Trump looks to play kingmaker across the country by boosting GOP candidates with his coveted endorsement, perhaps no race is as personal and as vexing for him as the Republican primary in New York — a battle that will test Trump’s loyalties https://t.co/grmCkZeoBu","date":"Sun Jun 05 12:44:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"POLITICO Playbook: The unofficial guide to official Washington. Subscribe today for the latest from our Playbook team covering every corner of power in D.C.\nhttps://t.co/Ceig2eRhJ2 https://t.co/nBP4YvYBVo","date":"Sat Jun 04 20:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The president and the first lady are now back at the beach house with no threat apparent https://t.co/ffY8dGX7HD","date":"Sat Jun 04 19:02:26 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"While Team Adams also notched several wins, more than half a dozen lawmakers and legislative aides said in interviews that the city’s high-profile losses were sealed by unrealistic expectations and outreach from the mayor https://t.co/HAKfgMxsI9","date":"Sat Jun 04 14:02:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to Digital Future Daily to stay on top of the most important stories determining the future of tech from Washington to Silicon Valley, and beyond. \nhttps://t.co/bpE3EOuhqZ https://t.co/q3oRElSMXx","date":"Sat Jun 04 13:50:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The former president could use a win after his Georgia shellacking. But his endorsement choices in the GOP runoff are tricky.\n\nhttps://t.co/qTpccK4SMf","date":"Sat Jun 04 13:01:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Our Huddle newsletter takes you behind the scenes on Capitol Hill, delivering the latest nuggets and scoops about the people, politics, and power centers in Congress. Don't miss out. Subscribe today.\nhttps://t.co/dfpSNWPYfR https://t.co/Y42u5CWHhA","date":"Sat Jun 04 02:35:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Breaking: McCormick concedes in Pennsylvania GOP Senate primary https://t.co/B8oyt5UR6X","date":"Fri Jun 03 22:53:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden is expected to visit Saudi Arabia to pursue a “foreign policy for the middle class” while “putting human rights at the center of U.S. foreign policy.”\n\nThe tension? You can have one or the other, but not truly both.\n\nhttps://t.co/0156I14ibB","date":"Fri Jun 03 22:25:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Discord, a popular chat app, has hired its first federal lobbyists. \n\nThe platform recently made negative headlines after the company confirmed the alleged gunman in the Buffalo mass shooting had posted his plans on Discord before the incident.\n\nhttps://t.co/QcojizTcD7","date":"Fri Jun 03 21:55:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Digital Future Daily is a newsletter that chronicles how the next wave of tech will reshape civic and political life, including activism, fundraising, lobbying and legislating.  Subscribe now.\nhttps://t.co/bpE3EOuhqZ https://t.co/NNub9aR6s4","date":"Fri Jun 03 21:25:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"NY Republican Chris Jacobs won't seek reelection to his Buffalo-area seat after expressing support for an assault weapons ban. \n\nHis sudden departure shows that budging on gun control measures could easily be a career-ender. \n\nhttps://t.co/AYc1gzkApO","date":"Fri Jun 03 21:16:36 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"This Monday: \n\nPolitico's @ZachMontellaro joins @BPC_Bipartisan's @mattiweil, @GrandjeanAmanda, and @NCSBE's Karen Brinson Bell to talk about preparations for ballot paper shortages in 2022 and 2024. \n\nJoin us at 12 p.m. EST 👇\nhttps://t.co/BqDFCLaK4Q","date":"Fri Jun 03 20:40:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Jan. 6 committee staff director David Buckley issued an internal warning to colleagues in a Wednesday email obtained by POLITICO. He said former Rep. Riggleman’s CNN interview was in “in direct contravention to his employment agreement.” https://t.co/9ypbTg9c4T","date":"Fri Jun 03 20:01:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The commanding general of the California National Guard is calling on U.S. and other Western officials to explore sending fighter jets to Ukraine “as soon as possible,” rekindling a longstanding request by Kyiv\nhttps://t.co/r36HdiQ1j5","date":"Fri Jun 03 19:58:20 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The CDC warned that monkeypox may be spreading person-to-person in the U.S., after the agency confirmed three cases in individuals with no recent links to international travel https://t.co/kMS11I82QA","date":"Fri Jun 03 19:43:22 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Special Olympics reversed its Covid-19 vaccine mandate for upcoming competitions in Orlando after Florida threatened event organizers with a $27.5 million fine over the requirement  https://t.co/rvEDojBWIa","date":"Fri Jun 03 19:13:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"We're live! \n\nJoin Politico's @eleanor_mueller, @vtg2 and @morningmoneyben along with @joelle_gamble and @EconBerger for a conversation on the latest labor report 👇\nhttps://t.co/tRtHmUTN9W","date":"Fri Jun 03 19:08:21 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"For 70 years, the slave-owning Confederate general Robert E. Lee has stared down at West Point cadets from a massive portrait in the academy’s library, a slave guiding his horse in the background.\n\nBut that portrait could be coming down. https://t.co/FDGUzEZMrp","date":"Fri Jun 03 18:35:56 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The nation’s leading gun violence prevention group is launching an ad campaign across a dozen states urging senators to reach an agreement on a range of firearms measures https://t.co/4iiffBpXJf","date":"Fri Jun 03 17:50:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Peter Navarro, a former Trump adviser and early election denier, has been indicted for contempt of Congress after defying the Jan. 6 panel's subpoena  https://t.co/IraaaPbK8J","date":"Fri Jun 03 16:21:33 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The New York Legislature approved a two-year, limited moratorium on digital currency mining at fossil fuel power plants https://t.co/RpBgzyImkU","date":"Fri Jun 03 16:03:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Gina McCarthy says she is \"leaving no stone unturned\" to meet Biden's climate goals. Her office's critics say it's producing interference and delay.\nhttps://t.co/DzHrZZtf5m","date":"Fri Jun 03 15:29:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"🎙️ We'll be on Spaces this afternoon to discuss our takeaways from the May jobs report. \n\nJoin Politico reporters @eleanor_mueller, @vtg2 and @morningmoneyben in conversation with @joelle_gamble and @EconBerger at 3 p.m. EST: https://t.co/tRtHmUTN9W","date":"Fri Jun 03 14:07:52 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After months of robust hiring, U.S. employers might have pulled back slightly in May, to levels that would still be consistent with a healthy job market https://t.co/t5ds8sNBDi","date":"Fri Jun 03 14:02:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Florida’s Medicaid regulator has determined that Medicaid should not include transition-related medical care for the treatment of gender dysphoria https://t.co/2Adgd0DsTX","date":"Fri Jun 03 13:11:14 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Join the Playbook community for a daily dose of newsy nuggets about the biggest news dominating Washington. Don't miss out, subscribe today.\nhttps://t.co/Ceig2eRhJ2 https://t.co/91LiCmDgcv","date":"Fri Jun 03 12:02:18 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A review at the CDC, the details of which POLITICO obtained, is the first of its kind and indicates that long Covid and the health complications associated with it could lead to death https://t.co/OygPyOSrYz","date":"Fri Jun 03 11:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As Russian forces pulverize everything in their path to capture as much of the eastern Donetsk and Luhansk regions as possible, eastern Ukraine has largely emptied out. \n\nBut many remain caught in the crossfire with nowhere to go. https://t.co/onI1G1b7vk","date":"Fri Jun 03 10:45:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"If the Senate can’t agree on a legislative response after the killings in Uvalde, Texas, Sen. John Cornyn said, “it will be embarrassing.” https://t.co/Ugu2UHojOP","date":"Fri Jun 03 09:43:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Wake up, read Playbook! @RyanLizza, @EugeneDaniels2 &amp; @rachaelmbade translate Washington for you. Subscribe today to the unofficial guide for official Washington.\nhttps://t.co/Ceig2eRhJ2 https://t.co/db2qDfBV4u","date":"Fri Jun 03 02:05:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Facebook has transformed in recent years into a slick political operation focused on crisis management — a far cry from the nominally apolitical, grow-at-any-cost corporation that Sheryl Sandberg once led https://t.co/90yXuiDRYJ","date":"Fri Jun 03 00:24:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Covid-19 vaccinations for kids under 5 could begin as early as June 21. The rollout of vaccines to roughly 19 million young children is the last step in making shots available to the entire U.S. population. \n\nhttps://t.co/DRNUgslHlt","date":"Thu Jun 02 22:00:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"VP Kamala Harris formally announced the cancellation of all remaining student loan debt from Corinthian Colleges today, capping off one of the most notorious for-profit college fraud scandals.\n\nhttps://t.co/CeJcLnV7gX https://t.co/qUEwEv7797","date":"Thu Jun 02 20:59:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The financial health of Social Security improved slightly over the past year. But the program’s reserves are on track to be depleted by the mid-2030s.\n\nhttps://t.co/WQTZUV2rB8","date":"Thu Jun 02 20:30:08 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"OPEC+ announced that members of the oil cartel agreed to a larger-than-expected hike in output, signaling a potential thaw in relations between the U.S. and Saudi Arabia https://t.co/p1pTRib44P","date":"Thu Jun 02 20:01:19 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Following a visit to the site of America’s latest school massacre, Education Secretary Miguel Cardona is demanding lawmakers take new action on guns https://t.co/JEZi6sabot","date":"Thu Jun 02 19:51:39 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Florida Gov. Ron DeSantis’ push to redraw the state’s congressional map and give a substantial advantage to Republicans will likely remain in place for this year’s elections \nhttps://t.co/C4vMKwOAQz","date":"Thu Jun 02 19:16:52 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Analysis: Bill Clinton and Tony Blair no longer have power, but they still have advice. They perceive plenty of people in need of it. https://t.co/xYPLMzZbFS","date":"Thu Jun 02 19:00:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Subscribe to West Wing Playbook to get daily scoops and nuggets from inside the White House. Don't miss out.\nhttps://t.co/AsF2TXHAuK https://t.co/LtoZVm3MN6","date":"Thu Jun 02 18:20:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The White House had been keeping strategic distance from the legislative negotiations around guns. That will change.\nhttps://t.co/lOhLaccxx0","date":"Thu Jun 02 17:24:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Michael Avenatti was sentenced to 4 years in prison for cheating client Stormy Daniels out of hundreds of thousands of dollars in book proceeds https://t.co/5fr8almEGD","date":"Thu Jun 02 16:16:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Opinion The U.S. has already experienced a century of criminalized abortion. If abortion is criminalized once again in the 21st century, history tells us what we can expect — whether or not the Supreme Court chooses to take that history into consideration. https://t.co/LIO5fpDwVv","date":"Thu Jun 02 16:02:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Huddle is our morning Capitol Hill must-read, with assists from POLITICO's deeply sourced Congress team. Subscribe to Huddle today.\nhttps://t.co/dfpSNWPYfR https://t.co/LQhOzLMo95","date":"Thu Jun 02 13:10:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Where Democratic lawmakers saw chaos and shrinking opportunities in New York State’s new congressional maps, Yuh-Line Niou saw an open door with Asian American voters\n\nhttps://t.co/OcqJlDBr0S","date":"Thu Jun 02 11:50:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Jan. 6 select committee received materials this week from Pennsylvania GOP gubernatorial nominee Doug Mastriano — and with them, perhaps, a new dilemma\n\nhttps://t.co/PgtOHYyNtG","date":"Thu Jun 02 11:20:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Pentagon was already struggling to keep up with Congress’ demands for oversight of its spending. Then, lawmakers earmarked an extra $40 billion for Ukraine.\n\nhttps://t.co/J1bBX8piiO","date":"Thu Jun 02 10:55:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Get the latest buzz percolating in the West Wing and offices across the President's cabinet. Don't miss out. Subscribe to West Wing Playbook today.\nhttps://t.co/AsF2TXHAuK https://t.co/zSpovP1wYA","date":"Thu Jun 02 01:55:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"New laws sought by Gov. Kathy Hochul and New York’s Legislature would further tighten and strengthen the state’s gun ownership restrictions, including raising the age to 21 for the purchase of semi-automatic rifles like those used in recent shootings https://t.co/CtXJzmzMOg","date":"Wed Jun 01 23:52:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Technology is always evolving, so to make sure you're always in the know, read our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/lUs1ZNoTWb","date":"Wed Jun 01 22:40:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"With their eye on midterms, House Republicans are preparing to release a six-part climate change strategy on Thursday.\n\nThe strategy calls for increasing production of all types of energy and sets no greenhouse gas targets.\n\nhttps://t.co/Kzs58T1kAA","date":"Wed Jun 01 21:58:31 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"5/ The Sierra Club is pushing back on the idea that any technology that can drive down heat-trapping carbon emissions deserves a spot in Biden’s climate plan.\n\nA coal plant or oil refinery with the technology would still pollute in other ways, from air toxins to water discharges.","date":"Wed Jun 01 21:36:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"6/ Meanwhile, farmers like the Stockdales see the pipeline as unnecessary and a scar on their land. And they’ll take any allies they can get.\n\n“The land ultimately belongs to [God] and I need to take care of it,\" Kathy said. \"It is our responsibility.” \n\nhttps://t.co/uzTlro6GfH","date":"Wed Jun 01 21:36:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"7/Read more about how White House support for a carbon capture pipeline is scrambling alliances in Iowa👇\n\nhttps://t.co/uzTlro6GfH","date":"Wed Jun 01 21:36:59 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"3/ Kathy Stockdale is no climate activist. The Iowa farmer &amp; conservative Christian says God controls the weather — “not the carbon dioxide.”\n\nUntil now, she and her husband couldn’t imagine teaming up with @SierraClub, a corn ethanol industry critic and Biden environmental ally. https://t.co/WxXF89vuVp","date":"Wed Jun 01 21:36:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"4/ Environmental groups like @SierraClub have long opposed carbon capture and storage technology. \n\nThey argue it props up coal, oil, natural gas and some biofuels like ethanol that should be on their way out because of their climate-warming emissions.\n\nhttps://t.co/uzTlro6GfH","date":"Wed Jun 01 21:36:58 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"2/ The drama centers around 3 proposed carbon dioxide pipelines that would carry emissions from ethanol refineries to storage in underground rock formations in North Dakota and Illinois.\n\nOne $4.5B project would cut through Iowa’s prized cornfields. \n\nhttps://t.co/uzTlro6GfH","date":"Wed Jun 01 21:36:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"1/ In Iowa, conservative farmers and an environmental group are forming an unlikely alliance. \n\nThe common enemy? A carbon dioxide pipeline. Farmers fear it could ruin their crop yield and expose their families to a hazardous gas. \n\nhttps://t.co/uzTlro6GfH","date":"Wed Jun 01 21:36:56 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"John Hinckley, who shot Ronald Reagan in 1981, is “no longer a danger to himself or others” and will be freed from all restrictions this month https://t.co/1yJWvtqDWo","date":"Wed Jun 01 21:00:42 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Video recordings of GOP operatives reveal the Republican Party's strategy to target and potentially overturn votes in Democratic precincts.\n\nPlacing operatives as poll workers are among the tactics to be deployed in swing states.\n\nhttps://t.co/pcuBfiDad2","date":"Wed Jun 01 20:18:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Sheryl Sandberg, the chief operating officer of Meta, Facebook’s parent company, is leaving the company after 14 years https://t.co/vnYZrSIB9N","date":"Wed Jun 01 20:02:25 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Billionaire Rick Caruso has catapulted himself into contention for mayor of Los Angeles \nhttps://t.co/qzRpS78Zrc","date":"Wed Jun 01 20:01:26 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A grand jury charged the white 18-year-old accused of fatally shooting 10 Black people at a Buffalo supermarket with domestic terrorism motivated by hate and 10 counts of first-degree murder https://t.co/DODK0v2rg7","date":"Wed Jun 01 19:28:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A coalition of abortion rights groups filed a lawsuit in state court to block Florida’s new 15-week abortion ban https://t.co/VeAM9yxvyg","date":"Wed Jun 01 19:00:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden applauded Adm. Linda Fagan’s ascension to commandant of the Coast Guard, making her the first woman to lead a military service branch \nhttps://t.co/xQJwJfCsMk","date":"Wed Jun 01 18:40:43 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The House Oversight Committee sent letters to Roger Goodell and Daniel Snyder asking that they appear at a hearing that will examine the Washington Commanders’ workplace culture https://t.co/nZ7kcx0f68","date":"Wed Jun 01 18:08:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"From the West Wing to cabinet departments and agencies across the Executive Branch, West Wing Playbook is the definitive guide to the inner workings of the Biden administration. Subscribe today.\nhttps://t.co/AsF2TXHAuK https://t.co/FMxehEKJKh","date":"Wed Jun 01 17:35:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The United Kingdom is asking the U.S. to sign off on a plan to send advanced, medium-range rocket systems to Ukraine within a few weeks https://t.co/lRV11zcET0","date":"Wed Jun 01 17:25:48 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Biden administration could soon finalize the transport of 1.25 million cans of baby formula into the U.S. from Australia as shortages continue \nhttps://t.co/zIn7mbLPE5","date":"Wed Jun 01 15:51:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Go behind-the-scenes on Capitol Hill by subscribing to Huddle for scoops on the maneuvering, policy initiatives, and power players making waves in Congress. Start reading today. \nhttps://t.co/dfpSNWPYfR https://t.co/j7wkumTrBz","date":"Wed Jun 01 14:03:21 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"After suffering humiliating defeats, Russia is making slow but steady progress as it employs a scorched-earth campaign\nhttps://t.co/QecIgEBxYO","date":"Wed Jun 01 13:02:37 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"White House officials reject the corporate complaints and say the administration has strong working relationships with the business world\nhttps://t.co/PUsyJw7Qnz","date":"Wed Jun 01 12:30:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Chesa Boudin's fight has become a test case for criminal justice reformers — and their foes\nhttps://t.co/oWg7CglGnc","date":"Wed Jun 01 12:01:03 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"“We can't just check the box” after the Uvalde shooting, said one influential advocate who lost his son. “But we can't also do nothing.”\nhttps://t.co/340tqH4yup","date":"Wed Jun 01 11:30:12 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"With opinion essentially hardened on guns in rural and urban America, the suburbs have become the political crucible for winning support for more significant restrictions\nhttps://t.co/giNen31ees","date":"Wed Jun 01 11:00:55 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Rep. Vicente Gonzalez (D-Texas) is warning his party of a \"self-inflicted tragedy\" in the making among Latino voters.\nhttps://t.co/Ud9sO5saKY","date":"Wed Jun 01 10:30:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Go inside the minds of the biggest tech players, policymakers and regulators to learn how their decisions affect our lives and our future with our Digital Future Daily newsletter. Subscribe today.\nhttps://t.co/bpE3EOuhqZ https://t.co/VLJnunTKjP","date":"Wed Jun 01 02:15:02 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In a frantic effort to try to slow gas prices that have risen by a dollar per gallon in just the last three months, Biden aides have internally debated a host of ideas https://t.co/A8t1qBYyfJ","date":"Wed Jun 01 00:43:49 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Around the world, food prices are soaring amid wheat and grain shortages deepened by Russia’s invasion — and inflation has only made matters worse https://t.co/AiM8M81MdJ","date":"Tue May 31 21:54:29 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The Supreme Court has blocked enforcement of a Texas law banning online platforms from restricting users’ posts based on their political views https://t.co/71hJcdDYXg","date":"Tue May 31 21:25:50 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"How powerful is a Trump endorsement? \n\n@POLITICO_Steve explains Trump’s mixed endorsement record so far, recapping highs and lows as the future of the GOP hangs in the balance. https://t.co/JE9S5KmEtl","date":"Tue May 31 16:33:23 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Michael Sussmann was acquitted on a charge that he lied when he allegedly denied he was acting on behalf of any client in alerting the FBI to claims that a secret server linked Trump and a Moscow bank https://t.co/j1HSHMA0ma","date":"Tue May 31 16:09:56 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Texas, the West and Midwest are bracing for potentially dangerous and costly blackouts this summer due to extreme weather and volatile gas prices https://t.co/aV3sakrK8L","date":"Tue May 31 15:57:44 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"At least 21 Black staffers have left the White House since late last year or are planning to leave soon. Some who remain say it’s no wonder why: They describe a work environment with little support from their superiors and fewer chances for promotion.\n\nhttps://t.co/X8uYuviRjO","date":"Tue May 31 11:30:10 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Politicians don’t enjoy it, but most change positions at least once in their careers. Then there’s Tom Cotton.\n\nhttps://t.co/ZCBezlqQUn","date":"Tue May 31 11:00:45 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Despite a recent spike in Covid transmission in hospitals, the agency that controls the purse strings for hospitals is unlikely to issue meaningful penalties, according to policy experts https://t.co/W6tm65h4rl","date":"Mon May 30 13:45:04 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Elon Musk’s apparent breach of stock-disclosure rules in his Twitter takeover bid is putting pressure on regulators to revamp decades-old market safeguards that watchdogs say are failing to protect investors https://t.co/z5Lu9W9zqX","date":"Mon May 30 12:45:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"As East Coast states jockey to attract offshore wind developers and the jobs the new industry promises, proponents of the Gulf of Mexico believe their region is ready to join the green push https://t.co/2VekDIVFsw","date":"Mon May 30 12:15:05 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"In the months ahead, amid lingering questions about whether U.S. intelligence on Russia and Ukraine was accurate enough, it will likely fall to CIA Director William Burns to offer many of the answers https://t.co/Czwk8NwTpM","date":"Mon May 30 11:14:34 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Austin City Council is proposing a resolution that would direct the city’s police department to make criminal enforcement of abortions its lowest priority and restrict city funds and staff from being used to investigate suspected abortions https://t.co/nIHun1Yfvt","date":"Mon May 30 10:17:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"President Biden on Sunday comforted family members mourning the loss of 19 children and two adults as well as those who survived the elementary school massacre in Uvalde, Texas https://t.co/VnFECn6Fm8","date":"Sun May 29 22:11:38 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Herschel Walker’s post-primary victory lap was a fresh reminder of his promise and peril as GOP nominee in Georgia https://t.co/OYfHOsqqj4","date":"Sun May 29 15:45:01 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"A Republican commissioner on a federal mine safety agency sought advice on personnel matters from a closely held collection of outside advisers that appears to have included at least one coal industry executive, according to documents obtained by POLITICO https://t.co/8mGxO9AY8w","date":"Sun May 29 15:00:40 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The replacement for the aging planes, still at least half a decade away, has for years lost out to internal budget battles that tend to favor shiny new fighter jets and bombers https://t.co/O2GeYUXSiP","date":"Sun May 29 14:01:17 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Farmers in Iowa who sell their crop to ethanol makers have been thrust into President Joe Biden’s search for a climate policy that both slashes greenhouse gas emissions and satisfies crosscutting political interests https://t.co/uzTlro6GfH","date":"Sun May 29 13:30:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Step inside the West Wing and get the latest updates on the president and his team. Subscribe to West Wing Playbook today.\nhttps://t.co/AsF2TXZbmi https://t.co/ONn7CKVupS","date":"Sat May 28 21:55:06 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Mass shooters overwhelmingly fit a certain profile, say Jillian Peterson and James Densley, which means it’s possible to ID and treat them before they commit violence https://t.co/lddVovOlQf","date":"Sat May 28 19:06:46 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Democrats see electric vehicles as an answer to climate change, and high fuel costs mean more Americans are interested. But inflation and a shortage of new cars are making that transition painful.\nhttps://t.co/GWKmZlbWek","date":"Sat May 28 16:01:27 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"The 56-year-old two-term Democrat was reelected in 2020 by just 1 percentage point over his Republican opponent\nhttps://t.co/RiqIFJlYHD","date":"Sat May 28 15:00:57 +0000 2022","user_id":"9300262"},{"handle":"politico","text":"Allies of Donald Trump Jr. issued a stark warning to Elise Stefanik recently: Keep friends’ kids out of your political rivalries\nhttps://t.co/WWKX0s0fdM","date":"Sat May 28 14:01:42 +0000 2022","user_id":"9300262"}]