[{"handle":"TheEconomist","text":"Drugs in America are notoriously pricey. Can critics shake things up? https://t.co/YrckN0w6ln","date":"Sat Jun 25 22:29:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court has overturned Roe v Wade, ending the constitutional right to an abortion. Now states will be able to write their own abortion laws https://t.co/SZ215VlkKC","date":"Sat Jun 25 22:20:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Every city in China has slipped down the rankings https://t.co/J0H2kwVgPP","date":"Sat Jun 25 22:08:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The best way to change the reputation of the kingdom is surely to change the kingdom itself https://t.co/7EJf4XO83I","date":"Sat Jun 25 22:02:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Find out why rising mortgage rates are dampening demand even in red-hot property markets like Miami on this week’s “Money Talks” https://t.co/V4Rv3yabwy","date":"Sat Jun 25 21:57:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The cost of making hydrogen from renew­ables is high—but it is also plunging. Analysts predict that by the end of this decade green hydro­gen will be cost­-competitive with hydrogen from fossil fuels \nhttps://t.co/JLQLpOkb7h","date":"Sat Jun 25 21:40:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Lithium­-ion batteries, the cost of which has crashed due to a mixture of innovation and economies of scale, have provided by far the greatest recent advances in “grid scale” electric storage \nhttps://t.co/hZKEU58nVT","date":"Sat Jun 25 21:35:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"How can governments fight inflation? The Nobel prize-winning economist @paulkrugman talks to @AnneMcElvoy and @Henry_Curr on “The Economist Asks” podcast https://t.co/NumlAEnHt9","date":"Sat Jun 25 20:51:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“The Lazarus Heist”, a new book, is a pacey insight into cybercrime and a fascinating portrait of life inside North Korea https://t.co/PnhqmormL3","date":"Sat Jun 25 20:31:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“They certainly seem to be circling in on the possibility of actors who were involved in the so-called seditious conspiracy.” \n\nOn “Checks and Balance”, @Edanyaperry examines the possible criminal charges being laid out by the January 6th committee https://t.co/KVSVJtRbAZ https://t.co/QOBuYwtGh3","date":"Sat Jun 25 20:26:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Halal food carts were unknown in New York a couple of decades ago, when souvlaki was the street lunch of choice. But as immigration from Greece slowed and Greek vendors aged, newer arrivals took their place https://t.co/oMt8N90njo","date":"Sat Jun 25 20:23:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The World Ahead” podcast, @tomstandage travels to 2042 to find children being taught by personalised learning assistants powered by AI, and funded by corporate advertising. What does this mean for teachers? https://t.co/3Y3WMZQhaN","date":"Sat Jun 25 20:19:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Europe is looking towards hydrogen. But a transition based on moving to hydrogen via liquefied natural gas could fal­ter well before it reaches its goal https://t.co/ExQuzkhBD8","date":"Sat Jun 25 20:16:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The plight of the would-be buyers illustrates just how swift and brutal the rise in interest rates has been, and how immediate its impact is on interest-sensitive sectors such as housing \nhttps://t.co/GlZ1fiuDcC","date":"Sat Jun 25 20:11:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Smears, intimidation, expulsion: Our correspondent on his expulsion from Ethiopia, a country torn apart by war https://t.co/G3NoLjFkEk","date":"Sat Jun 25 19:53:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The solution is obvious: America should reflect five decades of practice and the settled opinion of the majority by passing a national law that guarantees the right to an abortion https://t.co/rgqp57gFRU","date":"Sat Jun 25 19:32:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The suppression of “New Portuguese Letters”—a book about women’s lives in Portugal—discredited the dictatorship, which was then overthrown in 1974 https://t.co/yo8qDW59Lf","date":"Sat Jun 25 19:06:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Clinics are bracing themselves for the next phase of America’s long abortion war https://t.co/QN0ijgaUEV","date":"Sat Jun 25 19:05:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The French gave him his job back, but they also decided to strip him of much of his authority. Clearly, Emmanuel Macron will need to do things differently https://t.co/rWU3cnjfIW","date":"Sat Jun 25 18:47:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Ethiopia has taken disturbing lessons from China and other authoritarian states. It is learning how to become a modern, digital dictatorship.”\n\n@TomGardner18, our correspondent, on civil war, intimidation and his expulsion from Ethiopia https://t.co/QP2gELiR9R","date":"Sat Jun 25 18:46:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Big ﬁrms can afford to clamp down on methane in a way ﬁrms less well endowed with capital and human resources cannot. That said, the expense is not likely to be crippling \n\nhttps://t.co/C3qUPCzoBb","date":"Sat Jun 25 18:37:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The climate case has given rise to a lot of excitement about new, smaller reactors. But they are still at early stages of development. Today’s cumbersome reactors are the alternative \nhttps://t.co/IR9o4WfqQb","date":"Sat Jun 25 18:25:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The fall­ing cost of renewable energy itself is being ampliﬁed by improvements in the technol­ogies of hydrogen manufacture https://t.co/5GjTaxKZVm","date":"Sat Jun 25 18:20:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If Joe Biden steps aside, Kamala Harris is expected to be the Democratic nominee. But many fear she would lose to Donald Trump or one of his imitators, because of another combination of dire fundamentals and poor political skills https://t.co/x2kXU9WqrA","date":"Sat Jun 25 18:10:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Struggling to understand abortion rights in America? Try these four books https://t.co/JjwL931aBV","date":"Sat Jun 25 17:50:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As America transforms overnight into a patchwork of abortion rights, efforts to widen access for women in states hostile to abortion will grow https://t.co/bQ1XjjgKBq","date":"Sat Jun 25 17:49:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Choices, an abortion clinic in Tennessee has performed abortions in the state capital for half a century. Now that the Supreme Court has overturned Roe v Wade it will stop doing so https://t.co/MiHwQYqf9z","date":"Sat Jun 25 17:46:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Directing the £4.6trn ($7.4trn) of assets held in British pension and insurance funds into more productive areas should be a top priority https://t.co/YGCFmHyuPv","date":"Sat Jun 25 17:45:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In much of the region sex education is indistinguishable from a biology lesson https://t.co/ExKXwpidYV","date":"Sat Jun 25 17:43:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If Fallopian-tube recanalisation does turn out routinely to enable pregnancy, it suggests that fertility clinics may be missing an important trick https://t.co/49ubZdWJhv","date":"Sat Jun 25 17:32:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Perhaps the best thing that can be said about the tax holiday is that it is unlikely to get through Congress https://t.co/D24fECEOzh","date":"Sat Jun 25 17:22:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Automating demand management on the electric grid is good for avoiding blackouts, good for profits and all done without haranguing customers to make fiddly green choices https://t.co/U30lvWJJSs","date":"Sat Jun 25 17:18:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“The Star-Spangled Banner” remains the perfect song for America, suggests a new book. The anthem is contradictory, beautiful and full of aspirations unfulfilled https://t.co/13UisafT4r","date":"Sat Jun 25 17:07:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The river is home to more species of huge freshwater fish than any other in the world. But they are suffering https://t.co/OWM9ulWD4h","date":"Sat Jun 25 17:00:47 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The euro zone is at less risk from doom loops than it was ten years ago. But the danger has not disappeared https://t.co/FdqmLjNnID","date":"Sat Jun 25 16:40:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"What does the tension between the European commission’s vision of “green” and the European Investment Bank’s thinking mean for increasing investment in gas? \n\nhttps://t.co/m1sNLE1LPK","date":"Sat Jun 25 16:37:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Running one of New York’s halal carts is gruelling work. Our food columnist spent the day with Sherif Baioumy in Midtown https://t.co/UhSb706xuI","date":"Sat Jun 25 16:22:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Robert Golob’s new government marks a turnaround for a country that was sliding towards autocracy https://t.co/i02Br1bA9X","date":"Sat Jun 25 16:16:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Many listed fintechs have seen their market capitalisation crash by more than 75% since July 2021 \nhttps://t.co/dV9h639Dhn","date":"Sat Jun 25 16:03:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Pet Shop Boys set feelings of heartache to tunes that urge you to wave your arms, stamp your feet and chant the chorus https://t.co/KcQFpnQRx4","date":"Sat Jun 25 16:02:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Most Americans support the right to an abortion. The Supreme Court has overturned it https://t.co/Af3TmlGmN9","date":"Sat Jun 25 15:53:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On the first day of the Russian invasion of Ukraine, he volunteered. Before proper volunteer units were even formed he had made his own in Kyiv https://t.co/4DcAC8QqOM","date":"Sat Jun 25 15:41:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new book tells the story of the Lazarus Group, state-sponsored hackers who are thought to have netted billions of dollars of precious foreign currency for the North Korean regime https://t.co/fTMfVG81v9","date":"Sat Jun 25 15:30:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"International ﬁnancial institutions must strike a tricky balance. Bailing out bad governments could entrench their bad policies. Saying no could spell chaos \n\nhttps://t.co/IgtzYxwNv9","date":"Sat Jun 25 15:21:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Breaking the “doom loop” running between indebted sovereigns and the local banks that own their debt would ease the burden on the ECB https://t.co/bqgG0OFADf","date":"Sat Jun 25 15:19:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Mario Draghi, Italy’s prime minister, has backed European sanctions on Russia—at the cost of Italy’s economy. Some lawmakers in Italian parliament are rebelling https://t.co/BVhTVwK4S7","date":"Sat Jun 25 15:15:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Where does your city rank? https://t.co/eRp0fgSPuT","date":"Sat Jun 25 15:08:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The results point to the fading importance of Brexit as an electoral issue and cast fresh doubt over Boris Johnson’s future as Britain’s prime minister https://t.co/EUQP5LlVin","date":"Sat Jun 25 15:06:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The high-margin market of servers, the high-spec machines found in data centres has for decades been dominated by Intel, but recently Arm has scored notable victories https://t.co/AOTRppNBHk","date":"Sat Jun 25 15:03:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The murder rate in rural areas in the Amazon is rising and is now above the national average https://t.co/bUUqEAWU7j","date":"Sat Jun 25 14:44:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Alaa Abd el-Fattah, a computer programmer, rocketed to fame as the voice of a new set of tech-savvy revolutionaries in Egypt. He has spent much of the past decade in prison https://t.co/6b0ldhHy6R","date":"Sat Jun 25 14:35:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Until the 1990s Elvis Presley was iconic, worshipped by fans. Then he faded from view https://t.co/SeRcGqjz0R","date":"Sat Jun 25 14:25:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In 2018 it transpired that Caribbean-born Britons were being harassed and even deported on the ground that they could not prove their legal status. Now the government is trying to atone https://t.co/H1bizOjnx2","date":"Sat Jun 25 14:06:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The 50th anniversary of “New Portuguese Letters” may prompt more readers to seek out the feminist book, which has also inspired a play and an exhibition https://t.co/Exchx29uGv","date":"Sat Jun 25 14:05:15 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On Monday @Redfin realtor Lindsay Garcia had two buyers who agreed to buy properties in Miami. By Friday, with mortgage rates climbing, she tells @alice_fulwood, they both had to abandon their offers. Learn more on “Money Talks” https://t.co/aeux00ulPj","date":"Sat Jun 25 13:56:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new study, based in part on The Economist’s estimates of the pandemic’s true death toll, attempts to model just how many lives have been spared since vaccines became widely available to the public https://t.co/ZHSboEW70F","date":"Sat Jun 25 13:44:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new law responds to research showing the effects of early starts and sleep deprivation on teens https://t.co/fOHXrZ83n4","date":"Sat Jun 25 13:33:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Finland and Sweden have mostly stopped prescribing blockers to under-18s in favour of talking therapy, because the evidence base for them is thin. Joe Biden’s order asks federal departments to expand access to “gender-affirming care” https://t.co/cmylNEJ0Gj","date":"Sat Jun 25 13:29:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In the fraught and never-ending debate over how women end pregnancies, lawmakers should remember that most of them simply take two pills with a glass of water, and that the process is remarkably safe https://t.co/aWneHSfDbr","date":"Sat Jun 25 13:20:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Two decades ago the high price of emissions-free electricity generating capacity made the energy transition look both far-fetched and scary. Our report looks at the opportunities and obstacles facing it today https://t.co/twIwaIq4yq","date":"Sat Jun 25 13:20:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In anticipation of a future crisis in the euro zone, the once-familiar realities of markets fretting over which country owes how much have returned https://t.co/FNf0kc1CeZ","date":"Sat Jun 25 13:13:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Right wing, left wing: football and politics are frequent bedfellows. “Soccer Against the Enemy” provides a vivid illustration of this relationship https://t.co/rdqIIIJy2e","date":"Sat Jun 25 13:08:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Laws banning abortion will go into effect in 13 states: Arkansas, Idaho, Kentucky, Louisiana, Mississippi, Missouri, North Dakota, Oklahoma, South Dakota, Tennessee, Texas, Utah and Wyoming https://t.co/lIIdKzMvzX","date":"Sat Jun 25 12:48:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The question of what comes after Roe v Wade is no longer an abstract one. On “Checks and Balance” last month, @steviehertz visited two very different states that provide clues to what the new post-Roe era will look like https://t.co/greGjKG6ds","date":"Sat Jun 25 12:46:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Anyone who can hum a tune from “Star Wars”, “Indiana Jones” or the “Harry Potter” series has absorbed the sound-world that Erich Korngold largely forged https://t.co/QiTGuJM5L5","date":"Sat Jun 25 12:40:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One of Egypt’s tragedies is that many of its most brilliant minds are locked up or in exile. Alaa Abd el-Fattah is one of them https://t.co/28qVPtNF0O","date":"Sat Jun 25 12:35:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Too often, when it comes to scaling a promising startup into a domestic heavyweight, equity capital dries up along the way https://t.co/tt0fVJrLGu","date":"Sat Jun 25 12:32:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"This week on “Checks and Balance” with @imkahloon, @JamesMAstill and @JohnPrideaux: what is the purpose of the January 6th committee? What new information has it revealed—and can it make a difference? https://t.co/pcnWjC37U7","date":"Sat Jun 25 12:26:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Joe Biden’s administration should take urgent steps to safeguard the reproductive rights of American women https://t.co/oyfizCAIzh","date":"Sat Jun 25 12:19:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If European countries had more nuclear plants, their reliance on Russian gas would be reduced \nhttps://t.co/qVdbwOhIHk","date":"Sat Jun 25 12:05:53 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“I would think it would be wrong for the Fed to stop here.”\n\n@paulkrugman talks to @AnneMcElvoy and @Henry_Curr about how to fight inflation, on “The Economist Asks” podcast https://t.co/HD4TmkCK0X","date":"Sat Jun 25 11:50:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"What explains Pet Shop Boys’ staying power? Their best music still pulls off an emotional alchemy that few bands—and no other art form—can match https://t.co/5X9DurrHRN","date":"Sat Jun 25 11:48:57 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Whether it paves the way for widespread prosecutions depends on a state whose enfeeblement the reports exhaustively reveal https://t.co/vb7ly9QPJe","date":"Sat Jun 25 11:32:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Elections in 2015 had seemed to usher in a new era of democracy, after years of authoritarian rule. A military coup in February 2021 changed all that https://t.co/GBVKpTkeKw","date":"Sat Jun 25 11:12:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s GDP was 5.2% lower by the end of last year than it would have been if Brexit hadn’t taken place, calculates one think-tank https://t.co/isLhP2s8Be","date":"Sat Jun 25 11:08:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Voters in Andalucía gave the Socialist Party the biggest kicking it has ever had in the region. Could the People’s Party’s triumph be a prelude to taking power nationally next year? https://t.co/VSt7ZiWUPD","date":"Sat Jun 25 11:05:30 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Committee on Climate Change, which advises the government, reckons that up to 82,100 properties across England could fall into the sea by the end of the century https://t.co/KIYxdaqjn1","date":"Sat Jun 25 10:49:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new study was motivated by concerns that the vaccine’s efficacy was almost identical in each of the five age groups examined. The developer of Sputnik V disputes the findings https://t.co/iq4CFQ5gmE","date":"Sat Jun 25 10:45:28 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"They are handling the most baffling material on Earth: people https://t.co/ehumNj0cyb","date":"Sat Jun 25 10:27:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The band have a fan base of unprecedented reach and engagement and have embraced popular progressive causes abroad. The announcement of their break came as a shock https://t.co/NVNXkYnl2i","date":"Sat Jun 25 10:26:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"To study a disease scientists need reliable samples. These are the places—the libraries of maladies—that provide them https://t.co/53RlUwmfWd","date":"Sat Jun 25 10:09:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"By June 22nd, some 83% of Sylhet and 90% of Sunamganj—two districts in the north-east of Bangladesh that are home to 6m people—were completely underwater https://t.co/V4xPTCrjiQ","date":"Sat Jun 25 09:57:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In tennis, despite all the speed, power and whizzbangery on show, some of the most enthralling matches in history have taken five sets and several hours https://t.co/nZrePxYfi6","date":"Sat Jun 25 09:54:30 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"♦️ Protests were held across America after the Supreme Court overturned Roe v Wade.\n\n♦️ Two people were killed and at least 21 injured in a shooting in Oslo, police say. A man has been arrested.\n\n♦️ We profile Emily Eavis, the Glastonbury heiress.\n\nCatch up on today’s news ⬇️","date":"Sat Jun 25 09:54:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Aircraft-carriers remain critical to ensuring American military dominance in Asia. China’s carrier fleet is catching up—but remains far from parity with America's https://t.co/YmD8zQyCpt","date":"Sat Jun 25 09:37:57 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China’s nationalists want their country to get tougher on Taiwan. Soon “the dragon will fight the tiger” in the strait, a Chinese academic warned online https://t.co/JKoX7gm6qB","date":"Sat Jun 25 09:18:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It is the country’s deadliest quake in recent decades. The remote areas which it hit are home to poor settlements on steep slopes prone to landslides, and are particularly ill-equipped to cope https://t.co/6UFfZT1deD","date":"Sat Jun 25 08:59:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As a result of Italy’s reliance on Russian gas, shortages threaten in winter. This will influence elections due next year https://t.co/fR4CMV8Lur","date":"Sat Jun 25 08:47:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Elvis” is an opportunity to define the King for generations to whom he has never been a pivotal figure https://t.co/e7PWRPEPJz","date":"Sat Jun 25 08:31:37 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“In the short time since I left in May, many Ethiopian journalists and activists have been detained.”\n\nExpelled from Ethiopia in May 2021, our correspondent @TomGardner18 explains the crackdown on press freedom there https://t.co/AtVy6FPAvi","date":"Sat Jun 25 08:15:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The suppression of “New Portuguese Letters” became the first international feminist cause. Women round the world put pressure on the country’s government by signing petitions and writing letters https://t.co/pvVWFG823N","date":"Sat Jun 25 07:55:19 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The hashtag #FreeAlaa has floated around the internet since Abdel-Fattah al-Sisi’s regime arrested Alaa Abd el-Fattah in 2013, a final lingering demand from the ghost of revolution past https://t.co/HwLLUIZMYK","date":"Sat Jun 25 07:38:53 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s courts, excellent universities and world-class financial centre should make it unusually fertile ground for firms to grow. What should be done? https://t.co/Xg44BIHzDa","date":"Sat Jun 25 07:23:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The political demise of Janez Jansa, a fan of Donald Trump and of Hungary’s Viktor Orban, marks an about ­turn for the tiny country of 2.1m people https://t.co/jJgLO3wian","date":"Sat Jun 25 07:07:58 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It is not quite impossible to govern without a majority in the National Assembly, but for the next five years Emmanuel Macron will be scratching around for the votes he needs to get anything done https://t.co/IGceFbBtkk","date":"Sat Jun 25 06:47:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In 2019 he set up a group called Save Protasiv Yar, which from then on became his cause and his life. He set up mild protests, but most of his fighting was done in the courts https://t.co/0I18gkJaQA","date":"Sat Jun 25 06:40:45 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Money sent back from Russia, which is relatively cheap and easy to reach and has a familiar language, is a crucial lifeline. Russia’s invasion of Ukraine may cut it https://t.co/zTaNBlctRO","date":"Sat Jun 25 06:23:57 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The anti-Conservative electorate appears capable of tactically piling in behind the most viable opposition candidate with only the lightest of cues from party leaders https://t.co/4gqh7UrEq6","date":"Sat Jun 25 06:07:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Green hydrogen will not be a one-­for-­one replacement for natural gas in all applications https://t.co/GOwv7oZ6Hw","date":"Sat Jun 25 05:47:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Where is the best city in the world to live? @TheEIU has released its latest rankings https://t.co/Z3uV0DoeBg","date":"Sat Jun 25 05:30:42 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Europe has gone through a period of remarkable unity recently. Could this carry the EU through a revived euro crisis? https://t.co/Up8G5BgwaG","date":"Sat Jun 25 05:14:43 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"By presenting Dubai as secure, fun and permissive, the series plays by the emirate’s rules. But some human-rights groups say it ignores the dark side of the United Arab Emirates https://t.co/3cdBAMT5ZF","date":"Sat Jun 25 04:58:16 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Saudis have long used cash as a diplomatic tool. Money only goes so far, though https://t.co/z6CNBvapqr","date":"Sat Jun 25 04:38:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"North Korea is technologically backward. So how did a group of hackers from the “hermit kingdom” become some of the world’s most prolific cybercriminals? A new book explains https://t.co/svnP0DHS71","date":"Sat Jun 25 04:21:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Abiy Ahmed, Ethiopia's prime minister, has poured fuel on the fire of the propaganda war https://t.co/z15OmwDrZF","date":"Sat Jun 25 04:01:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China’s carrier fleet is now the second biggest after America’s. But China’s carriers are not designed for direct confrontation with America, naval experts say https://t.co/6Z22KW9oKy","date":"Sat Jun 25 03:40:49 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court's decision means that states now have the power to draft their own abortion legislation. At least 13 are implementing “trigger laws” to restrict access to the procedure https://t.co/9vJ8MwEIoI","date":"Sat Jun 25 03:18:58 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Cyril Ramaphosa dismisses the claims. But questions remain https://t.co/BJ2h4eAw11","date":"Sat Jun 25 02:57:54 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China regards transits of the Taiwan Strait by Western powers as expressions of solidarity with Taiwan, which China claims as its territory https://t.co/4HPJiy638I","date":"Sat Jun 25 02:37:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A poll conducted for The Economist by YouGov found that only 28% of adults surveyed “would like to see Roe v Wade overturned” https://t.co/cBtker2xhe","date":"Sat Jun 25 02:16:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In recent months Chinese authorities have been signalling that their two-year crackdown on the consumer internet was easing. That may be short-lived https://t.co/DgRjcQcxdw","date":"Sat Jun 25 01:59:37 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It is the most sweeping reversal of a constitutional right in American history https://t.co/hAeF3hPl5x","date":"Sat Jun 25 01:43:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For the tax break to work, it would have to deliver much lower prices at the pumps. That is unlikely for three reasons https://t.co/rKYhjqgfLm","date":"Sat Jun 25 01:22:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The European Commission is taking a lead on cleaner infrastructure. As well as seeking to eliminate methane leakage, it wants to see investment only in new gas power plants with low emissions of greenhouse gases https://t.co/z9HRRyH0Iq","date":"Sat Jun 25 01:15:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The reports document the astonishing scale of graft under the ruling African National Congress https://t.co/aCjAR7kySV","date":"Sat Jun 25 01:04:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It has become steadily more difficult to find reasons to be hopeful about Myanmar. How to make sense of it all? These seven books go some way towards explaining a land of lamentations https://t.co/EsPrr9nDjC","date":"Sat Jun 25 00:51:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Making remarks that “insult” the ruling elite, or sharing what a task force deems to be “fake news” on social media, can be enough to attract the government’s attention https://t.co/VVOAPb4RC3","date":"Sat Jun 25 00:35:19 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The solution is obvious: America should reflect five decades of practice and the settled opinion of the majority by passing a national law that guarantees the right to an abortion https://t.co/ALL9gVBSDk","date":"Sat Jun 25 00:17:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"From the lives of the billionaires who made Brazil rich to that of a favela-born artist, these books get to the heart of the sprawling country and its people https://t.co/d2dVbs0FJZ","date":"Sat Jun 25 00:07:53 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"California is the first state to require later start times for public schools. For 3.3m children, this will be a welcome relief https://t.co/TBk6e3AvV1","date":"Fri Jun 24 23:50:33 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"At issue are two opposing visions for the region, and two groups of people https://t.co/g3Lqoh4PoW","date":"Fri Jun 24 23:33:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Joe Biden rightly fears a second Trump term would be calamitous; the fact that he thinks he is the likeliest impediment to that points to another Democratic problem https://t.co/gL3heP7eTm","date":"Fri Jun 24 23:15:42 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If unrest spreads this year, it could add to the economic pain. Investors grow skittish when rioters burn shops or overthrow governments \nhttps://t.co/c4iH1NANTY","date":"Fri Jun 24 22:56:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Big Four accounting firm is considering spinning off its fast-growing consultancy practice from the unfashionable audit side of the business https://t.co/B1PrNt4B2L","date":"Fri Jun 24 22:30:11 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Whether it is deemed green or not, gas is an increasingly unattractive investment, the high prices for the fuel after Russia’s invasion of Ukraine notwithstanding \n\nhttps://t.co/JhaeRHeSMq","date":"Fri Jun 24 22:09:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It is probably but a first step to an even stronger Second Amendment under the court’s conservative supermajority https://t.co/RLnH6Y0mNa","date":"Fri Jun 24 21:44:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In “Elvis” the viewer truly feels the jolt of electricity that Presley sent through audiences—and through society, culture and the world—when he stood up to sing, play and gyrate https://t.co/GpOJ8jdbQY","date":"Fri Jun 24 21:24:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The invasion of Ukraine underscores an argument in favour of nuclear power plants: they can aﬀord their owners a security of electricity supply \nhttps://t.co/fHFUMQojsY","date":"Fri Jun 24 21:23:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The court has harmed its own standing, the fabric of the union and—most of all—the lives of millions of blameless American women https://t.co/K1DHYfAj6D","date":"Fri Jun 24 21:17:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The solution is obvious: America should reflect five decades of practice and the settled opinion of the majority by passing a national law that guarantees the right to an abortion https://t.co/d2jC3hIxzg","date":"Fri Jun 24 21:13:23 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court has never before withdrawn a constitutional right that so many Americans have relied upon for so long. It has harmed its own standing, the fabric of the union and—most of all—the lives of millions of blameless American women https://t.co/3KXbkS7L06","date":"Fri Jun 24 21:13:22 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"And if abortion is no longer recognised as a constitutional right, other rights, such as contraception and same-sex marriage might, by implication, be discredited and destabilised https://t.co/waXhJoj5A1","date":"Fri Jun 24 21:13:22 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Before the decision, it was predicted that more than 20 states would severely restrict or completely ban the practice including, in some instances, in cases of rape or incest https://t.co/yN5AZVYBdQ https://t.co/I3a1CiIy3L","date":"Fri Jun 24 21:13:21 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"By erasing the constitutional right to an abortion, America, which sets out to be a beacon for democracy and freedom, has taken a dangerous step towards oppression ⬇️ https://t.co/d2jC3hIxzg https://t.co/JgtWDdjuMF","date":"Fri Jun 24 21:13:20 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Who performed “The Star-Spangled Banner” best? The author of a book about the song reckons it was Whitney Houston at the Super Bowl in 1991—but salutes Jimi Hendrix’s rendition at Woodstock https://t.co/GkO7O5zaOo","date":"Fri Jun 24 21:07:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The fear for Britain’s Conservatives is that they are now caught in a pincer movement between two opposition parties that are increasingly aligned on policy https://t.co/KWYH8UfD9l","date":"Fri Jun 24 21:05:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Donald Trump’s pledge in the 2016 presidential campaign—that Roe would “automatically” disappear if he had a chance to reshape the Supreme Court—has been fulfilled https://t.co/vz2bLhVlOn","date":"Fri Jun 24 20:46:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It takes nerve to buy when markets are plunging. Delay always seems advisable. And delay often ends up meaning not making a decision at all \nhttps://t.co/H1AZGSNUqq","date":"Fri Jun 24 20:44:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“New Portuguese Letters” was published in 1972. A section on abortion might profitably be read by American judges today https://t.co/mE8svyd14z","date":"Fri Jun 24 20:28:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Deals will eventually be struck. But expect more disputes in the meantime https://t.co/0xPNppgPJD","date":"Fri Jun 24 20:21:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If the ECB has to raise rates a lot, it will not be able to protect indebted countries such as Italy. The only fix is more collective spending by the euro zone https://t.co/pSEuDy0xZ7","date":"Fri Jun 24 20:18:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Israelis are heading for the polls (again). Whatever the election result, the now-defunct coalition has changed Israeli politics \nhttps://t.co/mugwggFBDt","date":"Fri Jun 24 20:18:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Spain’s second-­biggest and most populous region has long tended to the left. The People’s Party rampaging victory marks a radical shift https://t.co/n3sWbriytq","date":"Fri Jun 24 20:17:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The war in Ukraine is weighing on liveability https://t.co/7pwmwwAveI","date":"Fri Jun 24 20:07:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Independent Ethiopian journalists were already under pressure. Soon the regime escalated its attacks against me and other foreign journalists.”\n\nOur correspondent @TomGardner18 on Ethiopia's slide into modern dictatorship https://t.co/peAxSk6dHh","date":"Fri Jun 24 20:00:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Saudi Arabia is not the first Gulf country to pour money into sport. Qatar has spent an estimated $200bn to prepare for hosting the football World Cup in November https://t.co/6Y7JNcg7rj","date":"Fri Jun 24 20:00:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Around the world, the cost-of-living squeeze is adding to people’s grievances and raising the chance that they will take to the streets. The greatest risk is in places that were already precarious \nhttps://t.co/aiIwBcPoTN","date":"Fri Jun 24 19:56:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The White Mesa mill in southern Utah is still converting uranium ore into yellowcake. For decades the facility has seemed a relic of the region’s boom times. But two things have conspired to breathe new life into the industry https://t.co/ZaXRO8HVjo","date":"Fri Jun 24 19:35:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Photos: Getty Images","date":"Fri Jun 24 19:34:27 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The overturning of Roe v Wade is one of the most consequential rulings by America’s Supreme Court in recent history, affecting tens of millions of women. \n\nBut what does it mean for the future of other rights in the country? Learn more ⬇️","date":"Fri Jun 24 19:33:55 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Therapy has been dismissed as “gatekeeping”, even when applied to trans-identifying minors for whom gender-affirming drugs can be particularly harmful https://t.co/zIce8FI92E","date":"Fri Jun 24 19:28:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Unless Ukraine’s allies supply it with modern guided missiles, or Russia can increase its production of advanced munitions, pilots will continue to lob unguided rockets and hope for the best \nhttps://t.co/17CuZrBwrU","date":"Fri Jun 24 19:20:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Many Americans are uninformed on the details of abortion https://t.co/HAlsbIwMtB","date":"Fri Jun 24 19:20:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The anti­-establishment Five Star Movement is the biggest parliamentary contingent in Italy’s broad coalition. It is splitting apart over Ukraine https://t.co/VQw0n0SSZ5","date":"Fri Jun 24 19:14:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The economic fallout from the pandemic and the war in Ukraine will revive old debates that tend to tear Europe apart https://t.co/06atLHrHlY","date":"Fri Jun 24 19:13:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"At a stroke, the court has in effect made terminating a pregnancy illegal in 13 states that have “trigger laws”. This sudden disappearance of abortion provision will cause great harm https://t.co/yqBBL8aSCa","date":"Fri Jun 24 19:12:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Ukraine and Moldova have both been granted candidate status to join the EU. Moldova’s deputy prime minister recently wrote a guest essay for The Economist on why expanding the EU is important https://t.co/ZLYYQOIwG5","date":"Fri Jun 24 19:12:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On this week’s “Money Talks” @JohnJoDevlin goes on a tour of Oslo open houses to find out why Norway’s property sector is looking vulnerable https://t.co/TxmNHBqmbj","date":"Fri Jun 24 18:56:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Despite most Americans being in favour of the right to abortion, the Supreme Court has overturned Roe v Wade https://t.co/JDRP9wkFtW","date":"Fri Jun 24 18:52:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Ethiopia’s civil war has been bad news for press freedom. The government arrests and sometimes beats journalists who criticise it https://t.co/dZomSP3Vpp","date":"Fri Jun 24 18:50:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Less Jupiter than Icarus, Emmanuel Macron came crashing down this week https://t.co/WDBwx9Rw3g","date":"Fri Jun 24 18:47:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court has ended the constitutional right to an abortion. Last month, our podcast asked: what will the post-Roe era look like in America? Listen to “Checks and Balance” with @JohnPrideaux, @mianridge and @jonfasman https://t.co/wDYbfghMFm","date":"Fri Jun 24 18:46:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Long­-duration energy storage tech­nologies, which can provide large amounts of electricity for hours, days or weeks when called on, are important complements to intermittent renewables. But you need a lots of it \nhttps://t.co/EfqInTsgAw","date":"Fri Jun 24 18:34:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The hashtag #FreeAlaa has floated around the internet since Abdel-Fattah al-Sisi’s regime arrested Alaa Abd el-Fattah in 2013, a final lingering demand from the ghost of revolution past https://t.co/It8PQ7PY1u","date":"Fri Jun 24 18:33:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"To fill the void left by the men’s football World Cup this summer, have a ball with these books instead https://t.co/2ZZrQt2DH0","date":"Fri Jun 24 18:27:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Why has Elvis Presley faded from the forefront of the world’s collective consciousness? Baz Luhrmann’s new film offers clues https://t.co/XWZe84RG9u","date":"Fri Jun 24 18:24:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Sport now looks increasingly divided between those that continue to follow the International Olympic Committee and those that are rebelling against it https://t.co/WFhps3MH3D","date":"Fri Jun 24 18:16:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Norfolk, a county on the east coast of England, loses an average of 0.4-2 metres of coastline every year. Climate change will make the problem worse https://t.co/JbUcIuT8pR","date":"Fri Jun 24 18:07:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Rising interest rates and the threat of an economic slowdown are hanging over the industry \nhttps://t.co/gcRzaX79zJ","date":"Fri Jun 24 18:03:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"With the Supreme Court’s decision to overturn Roe v Wade, American liberals are hunting for silver linings. But liberal activists focus solely on the gender gap at their peril: women are almost as likely as men to oppose abortion https://t.co/6IXEfAguS5","date":"Fri Jun 24 17:49:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"While America has spawned four trillion-dollar behemoths in the past 50 years, Britain has not created a business worth even a tenth as much in more than a century https://t.co/rP3nkFxkjH","date":"Fri Jun 24 17:44:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s four national culture collections (one each for bacteria, viruses, fungi and cell lines) store the cultures that matter, and have done so for a long time https://t.co/DJSxjqYLeu","date":"Fri Jun 24 17:40:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Cricket and tennis matches and golf tournaments may be derided for being slow, but they all permit a steady build-up of tension https://t.co/FiFla7416M","date":"Fri Jun 24 17:35:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If there is one thing guaranteed to get Americans to stand to attention it is cheap Viagra https://t.co/P1aeeRObJA","date":"Fri Jun 24 17:29:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"With the overturning of Roe v Wade, at least 21 states could ban all or nearly all abortions https://t.co/4OldQp94bn","date":"Fri Jun 24 17:26:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The daily flow into the country suggests that many Ukrainians are eager to return—or, at least, that they deem it safe enough to do so temporarily https://t.co/2ek5AH5Uoo","date":"Fri Jun 24 17:17:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Tiverton and Honiton had been one of the Tories’ safest seats. The swing of 30% is an exceptionally poor result https://t.co/Xoo5VdKo6G","date":"Fri Jun 24 17:05:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Jamaican sculptor Basil Watson has portrayed a man, a woman and a child dressed in 1940s clothes standing on old-fashioned suitcases. The sculpture aims for historical accuracy. Some argue that it misses https://t.co/KwDutFx1i1","date":"Fri Jun 24 17:05:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Get to the heart of the world’s most important stories with the latest in-depth analysis and fair-minded opinion https://t.co/Y0Smmspcwu https://t.co/MgrcOtJfjD","date":"Fri Jun 24 17:00:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As prices have fallen, cracks have appeared in the crypto infrastructure. The risk of a fresh downward spiral remains \nhttps://t.co/n7r56OJ2hM","date":"Fri Jun 24 16:53:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Can a recession be avoided? Nobel prize-winning economist Paul Krugman finds reasons to be hopeful, on “The Economist Asks” podcast https://t.co/ASQn0evhXL","date":"Fri Jun 24 16:50:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America, which sets out to be a beacon for democracy and freedom, has taken a dangerous step towards oppression. A constitutional right granted almost half a century ago has been torn up https://t.co/5h0tWqm4zr","date":"Fri Jun 24 16:48:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"At a rally for a right-wing green activist in Kyiv last year, Roman Ratushny was accused of hooliganism and sentenced to two months’ house arrest. But he didn’t let that stop him https://t.co/ZOr9c6gzhm","date":"Fri Jun 24 16:41:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Our former South-East Asia correspondent picks his guides to a troubled Myanmar https://t.co/7np4cCq1ld","date":"Fri Jun 24 16:33:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Using electricity to do things currently done with fossil fuels means generating more of it. Here’s how hydrogen can help \nhttps://t.co/olOM7aKPnN","date":"Fri Jun 24 16:24:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If the ECB has to raise rates a lot, it will not be able to protect indebted countries such as Italy. The only fix is more collective spending by the euro zone https://t.co/GMUnFdhwUa","date":"Fri Jun 24 16:19:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The war in Ukraine has prompted a need to reduce reliance on hydrocarbons from geopolitically dodgy sources. Yet ditching Russian gas creates a complex trade-off: “Get new gas, then go green” v “To go green means no new gas” https://t.co/73xAFzVlhH","date":"Fri Jun 24 16:15:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Some American liberals hope that women enraged by the loss of Roe v Wade will vote en masse for Democrats in November. But data show that religion, not gender, is the best predictor of views on abortion https://t.co/sQlxBcueF4","date":"Fri Jun 24 16:08:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A world without managers is a nice idea. But teams need leaders. Someone has to take decisions, even if they are bad ones https://t.co/Hz9PR2K8dV","date":"Fri Jun 24 16:04:34 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Chinese activists have long had a term for political depression: “zhengzhixing yiyu”. Now many ordinary people are experiencing it, too https://t.co/Cxm1u35fVS","date":"Fri Jun 24 15:45:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“We discovered the protective effect of spending time outdoors.” \n\nIan Morgan of @ourANU tells @tcross81 how to prevent short-sightedness, on our “Babbage” podcast https://t.co/v4O4YjpK3U","date":"Fri Jun 24 15:44:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Central banks’ battle with inflation today threatens to make the fiscal position of indebted governments more perilous \nhttps://t.co/94p1IpXAu8","date":"Fri Jun 24 15:44:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A 6-3 majority strikes down New York’s century-old law requiring those carrying concealed weapons to have a permit https://t.co/zV5lnr95Df","date":"Fri Jun 24 15:43:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Although on paper every government in the region tells schools they must teach their pupils about the birds and the bees, many fail to do so https://t.co/jNZb00kNEf","date":"Fri Jun 24 15:42:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s Supreme Court has overturned Roe v Wade. Recent analysis found that women in anti-abortion states will, for the most part, have to travel hundreds of miles farther to find a clinic than they do now https://t.co/pUMPWFblR9","date":"Fri Jun 24 15:40:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The five-decade-old ruling in Roe v Wade is overruled https://t.co/OjS1tuy6pv","date":"Fri Jun 24 15:36:11 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For much of the past two years estate agents enjoyed a bonanza. Now a fresh spike in mortgage rates seems to have slammed the brakes on altogether \n\nhttps://t.co/QaNKhjxlCX","date":"Fri Jun 24 15:36:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s Supreme Court has overturned the constitutional right to abortion. \n\nBefore the decision, it was predicted that more than 20 states would severely restrict or completely ban the practice, including, in some instances, in cases of rape or incest","date":"Fri Jun 24 15:30:29 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Analytically, it is true that Russia’s invasion of Ukraine is the main reason for the global energy crisis. Politically, though, that has not given much cover to Joe Biden, whose popularity has sagged https://t.co/RxQjuvLAkD","date":"Fri Jun 24 15:22:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s Supreme Court has reversed abortion rights. In a recent guest essay, Peggy Cooper Davis argued that the decision is “without regard for the country’s post-Civil War history” https://t.co/kn4NwUarfy","date":"Fri Jun 24 15:14:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court has overturned Roe v Wade. We recently looked at what losing the legal right to abortion means for women in America https://t.co/1YCiZgNneB","date":"Fri Jun 24 15:01:20 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“In the grips of civil war, an already brutal authoritarian regime was taking a darker turn. Anyone could become the enemy. Including me.”\n\nOur correspondent @TomGardner18 on his expulsion from Ethiopia, a country split by civil war https://t.co/5beKQBeVgD","date":"Fri Jun 24 14:42:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Energetic efforts are needed to soften the blow https://t.co/GykVTqqcRk","date":"Fri Jun 24 14:41:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s Supreme Court has overturned Roe v Wade, the landmark ruling from 1973 that protected the right to an abortion.\n\nCatch up on the latest updates ⬇️","date":"Fri Jun 24 14:36:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"E-cigarettes are bad for you, but not nearly as bad as their combustible cousins. The FDA will no longer allow Juul to sell their products in America. Last year we explored whether such widespread bans are a good idea https://t.co/awMYOGNO0c","date":"Fri Jun 24 14:31:49 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The only commercial power station in the world currently using carbon capture and storage captures 1m tonnes of CO2 a year (The International Energy Agency calls for 430m). And it runs on coal https://t.co/M6rTN8Ossh","date":"Fri Jun 24 14:15:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Tory Brexiteers warn darkly of a fragile Brexit being killed by stealth if they lose power. If only it were so easy, writes our Bagehot columnist https://t.co/TyDT7kr4TF","date":"Fri Jun 24 14:11:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Today on “The Intelligence”: Expanding gun rights in America, catching up with Ukraine’s First Lady, and the origins of the Black Death https://t.co/ACITGSxQho","date":"Fri Jun 24 14:10:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A partial return to normality from covid-19 has seen many western cities climb the rankings https://t.co/dRhc3TFADu","date":"Fri Jun 24 14:07:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Running one of New York’s halal carts is gruelling work. Our food columnist spent the day with Sherif Baioumy in Midtown https://t.co/yhvlas3WMM","date":"Fri Jun 24 13:54:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"How did history’s deadliest pandemic start? On “The Intelligence”, @gileadamit discusses new research into the origins of the Black Death https://t.co/fv0VcXFhhs https://t.co/Da8HHvCDsg","date":"Fri Jun 24 13:40:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"No Democrat relishes the idea of Joe Biden fighting another campaign. Yet his aides have described plans for one—because if Donald Trump runs again, it seems the president wants to https://t.co/DFTTJR1qYk","date":"Fri Jun 24 13:35:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Deep geological disposal is widely held to be the safest way to deal with the more than 260,000 tonnes of spent nuclear fuel which has accumulated since the first nuclear-power plants began churning out electricity https://t.co/W69WSqeZ2i","date":"Fri Jun 24 13:29:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Broad consensus suggests that political compromise around abortion rights is conceptually possible,” says the law professor in an opinion piece. “Yet it remains elusive” https://t.co/n2Ec8X02hB","date":"Fri Jun 24 13:26:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Overturning Roe and related precedents does not [...] ‘criminalise abortion’,” the @NDLaw professor argues. “Rather, it simply returns the matter of abortion to the states” https://t.co/77A3bLovVK","date":"Fri Jun 24 13:24:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The drive towards renewables must continue. Governments must improve the reach, capacity and storage capabilities of their grids and remove the obstacles that continue to make it harder to add renewable capacity than it should be https://t.co/0mCYh0CF62","date":"Fri Jun 24 13:10:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s national anthem served less to reflect than to encourage unity, writes the author of “O Say Can You Hear?” https://t.co/1CxMoaAsdy","date":"Fri Jun 24 13:07:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Boris Johnson insisted they were nothing more than run-of-the-mill results. In truth, they signal serious difficulties for Britain’s government https://t.co/wD6ToPab2D","date":"Fri Jun 24 13:05:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Western countries still interested in building nuclear power plants have increasingly looked to non-Western companies to build them. Then came the war in Ukraine \n\nhttps://t.co/J6JLC63Mqp","date":"Fri Jun 24 13:03:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Our son wants to be a soldier.” Ukraine’s First Lady chats to @olliecarroll, on “The Intelligence” https://t.co/ASySBGOrCL https://t.co/spSvnLw0NW","date":"Fri Jun 24 12:43:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A country is at risk of a doom loop when a shock to one part of its economic system is amplified by its effect on another https://t.co/uC0Impuuzs","date":"Fri Jun 24 12:40:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The country’s civil service is full of dangerous radicals, according to the government. But claims of state capture by extremists are overblown https://t.co/xMg9xj0gOB","date":"Fri Jun 24 12:26:41 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The task will be to show that its investments can graduate from experiments and vanity projects to being transformative for the firm—and for Americans’ health https://t.co/Jdb7HGDG6D","date":"Fri Jun 24 12:11:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Afghans were already being tormented by hunger, poverty and the aftermath of war when this week disaster struck once more https://t.co/y7hXU2x7G1","date":"Fri Jun 24 12:09:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Poor dam management, climate change and El Niño are all thought to contribute to the river’s problems https://t.co/kmf6t52ce6","date":"Fri Jun 24 12:02:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One pre-pandemic estimate put their annual economic impact at $3.7bn a year, making them the most valuable pop act ever. The announcement of their break has had an instant effect https://t.co/zCgtjGEpWz","date":"Fri Jun 24 11:57:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Bangladesh has managed to reduce the toll of extreme weather by encouraging families to build houses on mounds of earth and by developing warning systems https://t.co/hkfpsHOI68","date":"Fri Jun 24 11:57:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“The type of acceleration in house prices that we’ve seen...over the past two years is unprecedented,” says @dallasfed economist Enrique Martinez-Garcia. On this week’s “Money Talks” podcast: is a crash on the way? https://t.co/4ZXVgFcPZS","date":"Fri Jun 24 11:56:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The Intelligence”, @stevenmazie analyses the Supreme Court’s striking down of a law that restricted concealed carrying of guns https://t.co/wnC2HVyv1d","date":"Fri Jun 24 11:46:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Labour migration is so central to the economies of Kyrgyzstan and Tajikistan that even the pandemic barely disrupted it. But the war in Ukraine might https://t.co/BAc7R38Wci","date":"Fri Jun 24 11:43:17 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If Roe v Wade is overturned, “much of America will transform, in an instant, from having one of the world’s most permissive abortion regimes to having one of its most restrictive”, writes the @ColumbiaLaw professor https://t.co/xzy7NaHhsg","date":"Fri Jun 24 11:28:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For states to govern themselves on the vexed issue of abortion “wisely, justly and humanely will require the practice of civility, charity and honesty”, @cartersnead writes in a guest essay for The Economist. “We’re not off to a good start” https://t.co/fDmHfW5miS","date":"Fri Jun 24 11:14:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The stimulative effect of bond-buying is unhelpful when inflation is too high https://t.co/ymqFfUhjb9","date":"Fri Jun 24 11:03:20 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Interested in helping us cover the mid-term elections on social media? We want to hear from you https://t.co/tvwRKLypJN","date":"Fri Jun 24 10:43:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As a teenage activist he learned that even if you were trampled and dispersed you could still set something going. Small acts of defiance could grow https://t.co/B9INLjhPB0","date":"Fri Jun 24 10:28:19 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"♦️ America’s Senate and Supreme Court make contrasting decisions on gun control.\n\n♦️ Floods in India and Bangladesh force millions of people from their homes.\n\n♦️ What will stop British shoppers shopping?\n\nCatch up on the global stories that matter 👇","date":"Fri Jun 24 10:20:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"There are two explanations of the mismatch between the British chip designer’s size and the covetousness it elicits https://t.co/GfB9kz3zWv","date":"Fri Jun 24 10:09:54 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The cost of making hydrogen from renew­ables is high—but it is also plunging. Analysts predict that by the end of this decade green hydro­gen will be cost­-competitive with hydrogen from fossil fuels https://t.co/AlnYcEFVL7","date":"Fri Jun 24 09:54:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Pet Shop Boys’ best songs at once echo your woes and make you feel better—a feat that only words and music can perform, and only rarely https://t.co/QC7ViX8nPo","date":"Fri Jun 24 09:38:43 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In 1972 Portugal’s dictatorship tried to suppress a book by three feminists. The international backlash was extensive https://t.co/fQ6QjWvkrX","date":"Fri Jun 24 09:23:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Over the coming months the government will consider recommendations from eight pay-review bodies, and then haggle with an array of unions over the amounts https://t.co/cSQVO4iYsL","date":"Fri Jun 24 09:05:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“There exists a Goldilocks path where we do get the inflation down without a really major rise in unemployment.”\n\nListen to the Nobel prize-winning economist @paulkrugman, on “The Economist Asks” https://t.co/J715anJAPf","date":"Fri Jun 24 08:50:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"When an electric grid wobbles around off key, equipment attached to it can be badly damaged. Now some renewables have developed perfect pitch https://t.co/PXlqvuu4mr","date":"Fri Jun 24 08:35:45 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The World Ahead” podcast, @tomstandage travels to 2042 to find out about the future of education.\n\nHow might personalised learning assistants, powered by AI, change the way schools work? Listen now👇 https://t.co/poXJc8Z0tr","date":"Fri Jun 24 08:19:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If you’re an experienced producer with superb news judgement an eye for narrative storytelling, we’d like to hear from you  https://t.co/8mJU2oy1Pi","date":"Fri Jun 24 08:14:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The row over the Northern Ireland protocol has soured any hopes of a new era of friendship with the EU, and the economic damage to Britain is plainer by the day. As a result Remainers are finding their voice again https://t.co/ZEb3qau2By","date":"Fri Jun 24 08:01:50 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As British firms grow, the capital they need dries up along the way. Reallocating pension assets would help https://t.co/Tt9453ZYVx","date":"Fri Jun 24 07:42:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Mitigation and preparation has helped Bangladesh to dramatically reduce the number of deaths associated with extreme weather events https://t.co/S0UGWE1Xy6","date":"Fri Jun 24 07:25:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"We’re looking for an audio producer who is keen to find new, creative ways to tell the big stories in business and finance. Sound like you? Apply by July 1st https://t.co/JC9idgTv33","date":"Fri Jun 24 07:10:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"EU leaders have agreed to grant Ukraine and Moldova candidate status. In a recent opinion piece, @nicupopescu explained why enlargement of the union is “the best way forward for all” and why he believed his country deserved inclusion https://t.co/65jX3cnfMY","date":"Fri Jun 24 06:52:39 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Less methane leakage is something gov­ernments want, it is something investors want and it is something which often pays its way \nhttps://t.co/XW2Ta7ZT3x","date":"Fri Jun 24 06:35:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"This month a French engineer declared that he and a collaborator had identified the landscape in the background of the “Mona Lisa” https://t.co/Gc3i81eULj","date":"Fri Jun 24 06:19:54 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The ECB has a formidable new problem to solve: working out how to fight inflation and support indebted countries at the same time https://t.co/OKx38O47k6","date":"Fri Jun 24 06:02:23 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"UN agencies that have been feeding Afghans and running hospitals have swung into action. But for many of those whose homes have been obliterated, help will come too late https://t.co/S6YlhQLaPy","date":"Fri Jun 24 05:47:20 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Electrifying all processes that now require fossil fuels—such as powering cars, or heating homes and steel foundries—where electrification is clearly possible. It does not deliver everything that is needed to solve the climate crisis. But it delivers a lot https://t.co/tBUF93Klrl","date":"Fri Jun 24 05:27:29 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Emmanuel Macron needs to embrace a new political style: no longer Jupiterian, controlled and analytical, but open, transactional and instinctive https://t.co/P2qvXKguXV","date":"Fri Jun 24 05:10:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Briefly united by Ukraine, Europe faces divisions on the home front https://t.co/LOTeNJOfcQ","date":"Fri Jun 24 04:51:55 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"KAL’s cartoon https://t.co/6f8M7L5FSV","date":"Fri Jun 24 04:33:39 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The publication of Alaa Abd el-Fattah’s book, which describes torture and police brutality, is itself a major act of defiance https://t.co/fLvqCkjo3Y","date":"Fri Jun 24 04:15:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The ruling should not pose a problem for the gun-safety bill that a bipartisan group of senators are advancing in the wake of recent mass shootings. But it casts a pall over blue-state efforts to rein in guns https://t.co/GOu6PfuxXD","date":"Fri Jun 24 03:55:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In principle it is possible to scrub the CO2 out of a gas turbine’s exhaust and stash it away, yet the degree to which this has failed to happen is quite spectacular https://t.co/6bTOI66lq1","date":"Fri Jun 24 03:34:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Economist's new model finds that rising food and fuel prices have been good predictors of political instability. If that pattern holds this year, many countries can expect a doubling of unrest \nhttps://t.co/psIjRawn1c","date":"Fri Jun 24 03:12:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Joe Biden’s troubles are mostly attributable to a horrendous set of socioeconomic and political circumstances. To rise above them would take a politician of genius, which he wasn’t even before he started visibly slowing https://t.co/Yv2gHIJLhY","date":"Fri Jun 24 02:49:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s national anthem served less to reflect than to encourage unity, writes the author of “O Say Can You Hear?” https://t.co/ixqP1hD7Zs","date":"Fri Jun 24 02:28:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Using electricity to do things currently done with fossil fuels means generating more of it. Here’s how hydrogen can help https://t.co/sK7fnjgphc","date":"Fri Jun 24 02:08:15 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Food vendors are not a nuisance, argues our food columnist. They reflect the pattern of immigration and evolving tastes in a city https://t.co/NyMoils4wB","date":"Fri Jun 24 01:52:13 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new book tells the story of the Lazarus Group, state-sponsored hackers who are thought to have netted billions of dollars of precious foreign currency for the North Korean regime https://t.co/YgLwbWjsB3","date":"Fri Jun 24 01:35:44 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In cases where infertility is caused by blockage of the Fallopian tubes, which carry eggs from the ovaries to the uterus, unblocking the tubes in question might seem an obvious alternative to IVF https://t.co/yYcfkKjGF0","date":"Fri Jun 24 01:18:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The decision by FINA, swimming’s global governing body, and that of International Rugby League, deepens an existing split in the sporting world https://t.co/cDFkGKLcGP","date":"Fri Jun 24 00:58:12 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For the third time in the past five years, Vienna has ranked top of the @TheEIU’s liveability index. Find out where your city sits on the list https://t.co/EUapSI70P5","date":"Fri Jun 24 00:41:23 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"American citizens should be “troubled” by the broad implications Justice Alito’s draft opinion has for “the protection of a broad range of personal and familial freedoms”, argues the @nyuniversity law professor in a guest essay https://t.co/B6uakBbJAP","date":"Fri Jun 24 00:24:21 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For most temperaments, buying and holding for the long haul is usually the best policy https://t.co/RaPFdIGCsi","date":"Fri Jun 24 00:03:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Demand management for the electric grid—adjusting capacity based on customers’ needs—is a breakthrough long discussed and just as long deferred https://t.co/EbA0GnwPT2","date":"Thu Jun 23 23:44:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Within a few years, batches of waste from Finland’s two nuclear-power stations will be sealed off permanently from the world https://t.co/JuyQVUvssS","date":"Thu Jun 23 23:29:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Ukraine and Moldova have both been granted candidate status to join the EU. Moldova’s deputy prime minister recently wrote a guest essay for The Economist on why expanding the EU is important https://t.co/Ahctn6zIV2","date":"Thu Jun 23 23:12:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Reducing methane losses would help lower the natural-gas industry’s emissions. But there is a world of difference between lower emissions and zero emissions https://t.co/xptuFEBItM","date":"Thu Jun 23 23:01:15 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Nuclear energy’s long-standing cost and schedule issues used to make it hard to compete with natural gas and coal. Now they make it hard to compete with ever-cheapening renewable energy \nhttps://t.co/RXz5OXfqhT","date":"Thu Jun 23 22:23:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"There may be smarter ways to use unguided rockets. But what both sides really want are modern guided missiles \nhttps://t.co/vVyG829Ews","date":"Thu Jun 23 22:19:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The use of renewables for the majority of a grid’s electricity supply is the basis of a widely accepted decarbonisation strategy https://t.co/Ee4I8cNTkV","date":"Thu Jun 23 22:06:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“What we’re really worried about, always, is inflation that feeds on itself.” \n\n@paulkrugman speaks to us on “The Economist Asks” podcast https://t.co/6p2l0hmStL","date":"Thu Jun 23 21:50:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"North Korea is technologically backward. So how did a group of hackers from the “hermit kingdom” become some of the world’s most prolific cybercriminals? A new book explains https://t.co/XfNLHiw1OF","date":"Thu Jun 23 21:48:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The suppression of “New Portuguese Letters” became the first international feminist cause. Women round the world put pressure on the country’s government by signing petitions and writing letters https://t.co/bhkz7qzBNa","date":"Thu Jun 23 21:46:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The streets of metropolises like New York City and Los Angeles are likely to see a surge of people carrying hidden guns in their pockets and handbags https://t.co/nK9d1DLcy3","date":"Thu Jun 23 21:43:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"There is no real doubt that leaks of methane substantially increase the amount of warm­ing associated with using natural gas. Russia is a particular worry \n\nhttps://t.co/t40y5LiF21","date":"Thu Jun 23 21:36:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Naftali Bennett, the prime minister, who recently told The Economist that he had “learned the value of compromise during the past year”, will cede his job to Yair Lapid during the election campaign \nhttps://t.co/WEcTorotsm","date":"Thu Jun 23 21:18:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In January if you had a $100,000 deposit and wanted to pay $3,000 per month you could buy a house in America valued at $850,000. Now the equivalent value would be $600,000. On this week’s “Money Talks”: what rising rates mean for property https://t.co/rKzgVVsKjw","date":"Thu Jun 23 20:56:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Manhattan’s halal carts offer more than a sizzling skewer and a smile: they are living records of New York’s changing habits and demography https://t.co/Immtz8k6QY","date":"Thu Jun 23 20:53:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The remote areas of Afghanistan hit by the earthquake, home to poor settlements on steep slopes prone to landslides, are particularly ill-equipped to cope  https://t.co/NXG6RzaQkr","date":"Thu Jun 23 20:52:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Who performed “The Star-Spangled Banner” best? The author of a book about the song reckons it was Whitney Houston at the Super Bowl in 1991—but salutes Jimi Hendrix’s rendition at Woodstock https://t.co/lE2IkK0X1R","date":"Thu Jun 23 20:51:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"With each anniversary of Brexit, almost everything Remainers feared would happen has come to pass. It is vindication, but it does not taste sweet https://t.co/2F5T2825Ic","date":"Thu Jun 23 20:49:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Hits such as “It’s a Sin” and “West End Girls” teleport Pet Shop Boys’ older listeners to their youth, a thrill even if those years were hard https://t.co/uT2TV7oUxY","date":"Thu Jun 23 20:42:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Energy Dome is one of a promising crop of ﬁrms seeking to up­end the ﬁeld of long­-duration energy storage \nhttps://t.co/XcShOedR5z","date":"Thu Jun 23 20:34:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Alaa Abd el-Fattah, a computer programmer, rocketed to fame as the voice of a new set of tech-savvy revolutionaries in Egypt. He has spent much of the past decade in prison https://t.co/naRoRHjS6m","date":"Thu Jun 23 20:32:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Breaking the “doom loop” running between indebted sovereigns and the local banks that own their debt would ease the burden on the ECB https://t.co/CmtgGPLC6g","date":"Thu Jun 23 20:18:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The World Ahead” podcast, @tomstandage talks to @salkhanacademy and @majohns about the future of education, and how teachers and technology can best work together https://t.co/w6hoUlvEhW","date":"Thu Jun 23 20:18:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The last time the WHO declared an emergency was on January 30th 2020, when SARS-CoV-2 started spreading in China. Its alert system has since been criticised as ineffective https://t.co/zGhZJPQHoW","date":"Thu Jun 23 20:00:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The French gave him his job back, but they also decided to strip him of much of his authority. Clearly, Emmanuel Macron will need to do things differently https://t.co/sAdwJky9id","date":"Thu Jun 23 19:46:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Some states will now have much less autonomy to decide whom to entrust with a concealed weapon https://t.co/7RVQvwRshr","date":"Thu Jun 23 19:44:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Can novel lenses and glasses slow the progression of myopia? We explore the short-sightedness epidemic, on our science and technology podcast “Babbage” https://t.co/Vdq5s9oiTR","date":"Thu Jun 23 19:44:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Abortion rights are under attack in America. These are four books you need to read to understand the debate https://t.co/BoOe5KyAlx","date":"Thu Jun 23 19:30:43 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Still fuzzy on what Brexit really means? These seven books may help the interested reader to learn more \nhttps://t.co/YEI3Q7Ai3i","date":"Thu Jun 23 19:09:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Auckland, which ranked top last year, has dropped by 33 places https://t.co/D1h2LLDWSI","date":"Thu Jun 23 19:06:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Alaa Abd el-Fattah has spent most of the last decade locked up on spurious charges. The Egyptian blogger and activist’s hunger strike makes his recent book even more urgent https://t.co/crQzuOWPPF","date":"Thu Jun 23 19:00:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In 2020 Cyclone Amphan—thought to be the most powerful storm to form in the Bay of Bengal in two decades—killed around 30 people https://t.co/U7X9Jvk5FJ","date":"Thu Jun 23 18:56:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"How can governments fight inflation? The Nobel prize-winning economist @paulkrugman talks to @AnneMcElvoy and @Henry_Curr on “The Economist Asks” podcast https://t.co/98SnewBVte","date":"Thu Jun 23 18:49:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Joe Biden is even more unpopular than his twice­-impeached predecessor. Only 39% of voters think he is doing a good job, and his chances of recovery look slim https://t.co/BUU60lONng","date":"Thu Jun 23 18:47:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“New Portuguese Letters” was published in 1972. A section on abortion might profitably be read by American judges today https://t.co/MNCwiWhjyz","date":"Thu Jun 23 18:46:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Even therapists who work outside government settings feel pressure to promote “positive energy”, one of Xi Jinping’s favourite terms https://t.co/1xO17MyJwd","date":"Thu Jun 23 18:45:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain is a good place to be a budding entrepreneur. But it is not a good place to turn promising startups into titans https://t.co/TVko67PX4C","date":"Thu Jun 23 18:44:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"You might say that not much has changed with regard to the attractiveness of American shares. That would not be quite right https://t.co/TdEr1Rpe5F","date":"Thu Jun 23 18:43:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On the referendum’s sixth anniversary, the damage from Brexit to Britain is obvious. But the remedies are not https://t.co/vFFr05xeLt","date":"Thu Jun 23 18:42:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"If governments respond ineptly, they could trigger a relapse towards fossil fuels that makes it even harder to stabilise the climate. Instead they must follow a perilous path that combines security of energy supply with climate security https://t.co/9GshDS7r7c","date":"Thu Jun 23 18:38:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"More nuclear plants would be good for energy security, geopolitics and the climate. Yet big plants are hard to build. This is how to make it easier \nhttps://t.co/HoIVrc6zRm","date":"Thu Jun 23 18:21:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Relying on the ECB to backstop the debts of the euro zone’s governments leaves the currency union intolerably fragile https://t.co/h8Wkp2DXWA","date":"Thu Jun 23 18:17:51 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Still fuzzy on what Brexit really means? These seven books may help the interested reader to learn more \nhttps://t.co/jBWC7p5tLz","date":"Thu Jun 23 18:01:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Want to work with the team that runs this account? We’re hiring for a one-year paid fellowship—with a focus on North America https://t.co/cxFp7ln7aL","date":"Thu Jun 23 17:42:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Beyond the expense, the government fears that giving in to unions’ demands would encourage workers in the private sector to raise their pay requests, risking a wage-price spiral https://t.co/QHwz0ppHmt","date":"Thu Jun 23 17:21:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The FDA has announced that Juul will no longer be able to sell e-cigarette products in America. How harmful are they? We explain https://t.co/JKtZZjCf4a","date":"Thu Jun 23 17:17:44 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The WHO’s highest alert is meant merely to spur member countries to put their own preventative measures in place https://t.co/NaBk1z6yhu","date":"Thu Jun 23 16:59:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Soaring food and fuel prices are the most excruciating form of inﬂation. If the prices of furniture or smartphones rise, people can delay a purchase or forgo it. But they cannot stop eating \nhttps://t.co/7fw9ocWAKB","date":"Thu Jun 23 16:55:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One of Egypt’s tragedies is that many of its most brilliant minds are locked up or in exile. Alaa Abd el-Fattah is one of them https://t.co/XzKoT7U9Wz","date":"Thu Jun 23 16:32:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In a major blow to campaigns for stricter gun control, the Supreme Court has bolstered the right of Americans to bear arms. \n\nCatch up on the latest updates ⬇️","date":"Thu Jun 23 15:46:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Although tech stocks have taken a hammering everywhere over the past six months, those listed in London have fared especially poorly https://t.co/DEyjAp3EvQ","date":"Thu Jun 23 15:44:17 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"This week’s episode of our “Checks and Balance” podcast explores how to think about a new era of nuclear threat, with @shashj, @jonfasman and @johnprideaux https://t.co/R4z6DCtyOR","date":"Thu Jun 23 15:26:53 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For centuries, two of the most intriguing questions about Leonardo da Vinci’s painting were “Who?” and “When?” A third conundrum “Where?” is still in dispute https://t.co/ZMQc7fOvXG","date":"Thu Jun 23 15:11:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s Supreme Court has voted to expand the Second Amendment right to bear arms. The nine justices are increasingly at odds with a majority of the country’s citizens, as we wrote last month https://t.co/iTJyCUZa0w","date":"Thu Jun 23 15:05:49 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The disease, which is usually confined to Africa, is spreading across the world. A total of 3,337 cases in at least 53 countries have been reported https://t.co/4Ey4nHDrzB","date":"Thu Jun 23 14:59:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The disaster comes at a time of crisis for the country and will test the Taliban’s capacity to govern  https://t.co/Qtk0xNIB2b","date":"Thu Jun 23 14:46:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It is not quite impossible to govern without a majority in the National Assembly, but for the next five years Emmanuel Macron will be scratching around for the votes he needs to get anything done https://t.co/wQVIHxsXKS","date":"Thu Jun 23 14:46:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"This year’s energy shock is the most serious since the Middle Eastern oil crises of 1973 and 1979. We explain how to fix this global emergency without wrecking the climate https://t.co/DeoOlfLvT1 https://t.co/BumLDUreWI","date":"Thu Jun 23 14:36:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Economists are worried about a so-called “doom loop” between different parts of the economy. We explain why https://t.co/NFBBqj3NcG","date":"Thu Jun 23 14:30:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Today on “The Intelligence”: China’s LGBT crackdown, floods in Bangladesh and the world’s most liveable city https://t.co/oSG4ROvwLB","date":"Thu Jun 23 14:10:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The show questions American and European representations of Arab women, though some Emiratis point out that the characters on screen do not reflect real housewives https://t.co/hMchBt7Reb","date":"Thu Jun 23 14:08:23 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Which city topped @TheEIU’s Liveability Index this year? Find out on “The Intelligence” https://t.co/epPUjedCS6 https://t.co/o0DetmEhNx","date":"Thu Jun 23 13:51:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Justice Alito argues that the right to choose abortion is neither mentioned in America’s constitution nor deeply rooted in America’s history and traditions,” she writes. “But he speaks without regard for the country’s post-Civil War history” https://t.co/ihFWVzcR93","date":"Thu Jun 23 13:38:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Die tote Stadt” (“The Dead City”), a dramatically sinister but musically glorious opera of 1920, is leading a renewed interest in Erich Korngold’s non-Hollywood output https://t.co/X3SedJEaA0","date":"Thu Jun 23 13:36:37 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One reason change has been slow to come is that many athletes and sports administrators who might have disagreed with allowing biological males into women’s sport have felt too frightened to say so https://t.co/nZNelM5mVG","date":"Thu Jun 23 13:16:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The WHO will decide whether to declare the disease a “public-health emergency of international concern”, its highest level of alert https://t.co/IthuPFelQH","date":"Thu Jun 23 12:59:36 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Bangladesh is getting better at coping with floods, as @itsracheldobbs tells “The Intelligence”\nhttps://t.co/pQCzJOEXDn https://t.co/iJFkqS1DVd","date":"Thu Jun 23 12:57:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Every city in China has slipped down the rankings https://t.co/eAf5OAPHOf","date":"Thu Jun 23 12:50:42 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"⚡️ Life is getting back to normal, if not quite everywhere. Explore @TheEIU’s ranking of the most liveable cities 👇 https://t.co/jSRCx39he9","date":"Thu Jun 23 12:38:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Tech giants, governments, trustbusters, investors: all eyes are on the much-anticipated stockmarket listing of Arm https://t.co/BvUxyrhcEb","date":"Thu Jun 23 12:33:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China is cracking down on its LGBT community. On “The Intelligence”, @aliceysu explains why  https://t.co/FosrezQ8HV","date":"Thu Jun 23 12:13:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As the political power of Asian-Americans rise, both parties have work to do https://t.co/gCIUYocEFr","date":"Thu Jun 23 11:56:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Public-sector employees want their pay to keep pace with rising prices but that would require offsetting spending cuts, higher taxes or more borrowing https://t.co/5JsCsR6dBc","date":"Thu Jun 23 11:37:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Does this map surprise you? Factors such as the pandemic and the war in Ukraine have weighed on liveability. \n\nExplore the index in more detail here👉https://t.co/FNwfAz7ti5 https://t.co/x01NOId76U","date":"Thu Jun 23 11:34:50 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"It takes nerve to buy when markets are plunging. Delay always seems advisable. And delay often ends up meaning not making a decision at all https://t.co/mE46wzpVfd","date":"Thu Jun 23 11:19:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Even a partial return would lessen the strain on surrounding countries making huge efforts to provide for Ukrainians. But families heading back to their hometowns know that they may have to leave again https://t.co/NH2g3KRvko","date":"Thu Jun 23 11:01:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The world is facing a growing waste problem, with 2bn tonnes produced last year alone. \n\nIn Taiwan, one company has an innovative solution: upcycling local plastic waste into entire buildings.\n\nRead our climate coverage: https://t.co/9I3nTzLdhu https://t.co/r1TUJymbqN","date":"Thu Jun 23 11:00:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Anyone who can hum a tune from “Star Wars”, “Indiana Jones” or the “Harry Potter” series has absorbed the sound-world that Erich Korngold largely forged https://t.co/PEXyxHnx3m","date":"Thu Jun 23 10:40:45 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"England’s health service handles 10m clinic appointments for eyes every year. Artificial intelligence could help speed up and improve diagnoses for patients. Film supported by @Maersk\n\nRead more: https://t.co/l89psgWh9X https://t.co/Wz3f4UWAdX","date":"Thu Jun 23 10:31:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Can it finally shake up the stodgy multi-trillion-dollar industry? https://t.co/xudbTZ6jjC","date":"Thu Jun 23 10:22:43 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Less Jupiter than Icarus, Emmanuel Macron came crashing down this week https://t.co/jF2tPiOOL3","date":"Thu Jun 23 10:03:57 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"♦️ EU leaders are expected to grant Ukraine candidate status for membership.\n\n♦️ Britain’s Conservative Party faces a pair of parliamentary by-elections.\n\n♦️ Our index of the best cities in the world to live.\n\nCatch up quickly on the global stories that matter 👇","date":"Thu Jun 23 09:49:22 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"English uses “-in-law” to describe relationships through a spouse. The rather cold term implies a bureaucratic shackle. Other languages treat it differently https://t.co/U6IukcVG1t","date":"Thu Jun 23 09:43:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"They're rich in protein, sustainable, and easier to farm than livestock. But could insects really become a staple food of the future? https://t.co/46PrUq6aEJ","date":"Thu Jun 23 09:35:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The rival influences of the United States and China https://t.co/iN9UXlsVnk","date":"Thu Jun 23 09:23:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Elderly Japanese are discovering the benefits of cannabis products https://t.co/BAb18AzKWw","date":"Thu Jun 23 09:03:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China’s elites think feminism is a foreign plot https://t.co/IItidRtqyp","date":"Thu Jun 23 08:43:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The real test of the government’s Rwanda policy https://t.co/lYobcKwVN0","date":"Thu Jun 23 08:24:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The continuing process of Brexit, and the deep divisions it has entrenched, can make it hard to understand or follow the forces that drove it. Start with these books, curated by our Brexit editor \nhttps://t.co/UEN4tjbHgD","date":"Thu Jun 23 08:05:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"El Salvador’s government is gambling on bitcoin https://t.co/qJNoYjDq6P","date":"Thu Jun 23 07:46:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"How will technology redefine education? \n\nTom Standage travels to the year 2042 to find that “learning assistants” powered by artificial intelligence allow pupils to progress at a pace that suits them. Listen to “The World Ahead” https://t.co/M1YbazdP62","date":"Thu Jun 23 07:26:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Six of the eight big economies featured on our indicators page that have inflation below 4% are in East or South-East Asia. What accounts for this Eastern exceptionalism? https://t.co/DE3K4UsVJ7","date":"Thu Jun 23 07:07:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“Cooling the housing market is almost a precondition to be able to tame inflation,” @dallasfed economist Enrique Martinez-Garcia tells @Alice_Fulwood on this week’s “Money Talks” podcast https://t.co/fpD2TaUWgA","date":"Thu Jun 23 06:47:51 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The high cost of schools closed by covid https://t.co/S7n3fPv58j","date":"Thu Jun 23 06:28:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Central banks urgently need to convince people that they are serious about getting inflation down. Changing the public’s mind could be extraordinarily difficult https://t.co/jqy4NJUqmt","date":"Thu Jun 23 06:08:51 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The subjunctive in English is considered to be an “Americanism”. In fact the grammatical form was born in England—and used by many of its greatest authors for centuries https://t.co/nKow4sWzWW","date":"Thu Jun 23 05:51:33 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Heating, cooling and powering existing offices, homes and other property accounts for 27% of global energy-related CO2 emissions. However, landlords, homeowners and the construction industry have a rotten record on climate change https://t.co/taAurO9169","date":"Thu Jun 23 05:32:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The decision by FINA, swimming’s global governing body, has been misreported in some quarters as an outright ban on transgender competitors. It is not https://t.co/geWCBBEgjr","date":"Thu Jun 23 05:15:16 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Where does your city rank? https://t.co/VNkf4uDcQe","date":"Thu Jun 23 04:59:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Those who track Nayib Bukele’s tweets, and take him at his word, reckon the government has lost about half its investment, or $50m to date gambling on bitcoin https://t.co/JAQRbG2aqS","date":"Thu Jun 23 04:40:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Can short-sightedness be prevented in childhood? @tcross81 tells @alokjha what causes the condition, on “Babbage”, our podcast about science and technology https://t.co/otS0jreO7f","date":"Thu Jun 23 04:23:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Afghans were already being tormented by hunger, poverty and the aftermath of war when, in the early hours of June 22nd, disaster struck once more  https://t.co/StpDfGi7XF","date":"Thu Jun 23 04:07:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Years of your life have been lost to utterly pointless activities at work. Here’s how to save more time https://t.co/uvukqlsvE7","date":"Thu Jun 23 03:50:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Busier sections of road that required drivers to pay the most attention had the biggest proportional increase in crashes https://t.co/tvW7AZKrSk","date":"Thu Jun 23 03:28:22 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“It is nearly impossible to find any right of personal or family autonomy guaranteed by the terms of our original constitution,” argues Peggy Cooper Davis. “This is explained in part by the founders’ choice to protect slavery” https://t.co/5hCvpyEBjd","date":"Thu Jun 23 03:06:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Overall, Asian-Americans identify with Democrats over Republicans by two to one   https://t.co/3hFREGCPm8","date":"Thu Jun 23 02:47:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The British chip designer’s modest size belies its central role in the digital revolution https://t.co/Gapd9V1U0V","date":"Thu Jun 23 02:39:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The weakness of the rule of law in Latin America is demonstrated by a chilling statistic: with 8% of the world’s population, the region accounts for 37% of all murders according to the UN \nhttps://t.co/txBk1uwzFH","date":"Thu Jun 23 02:21:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Before the pandemic, 15­-year-­olds in Latin America were on average three years behind their peers in the OECD in reading, maths and science, according to PISA international tests. They now lag even further behind https://t.co/fz5JuORdqA","date":"Thu Jun 23 02:00:35 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"After more than two years of remote working, people have grown used to it. Few miss the commute. Some continue to worry about catching covid-19. And some worry about crime https://t.co/0CJrWrg5Aj","date":"Thu Jun 23 01:43:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“During slavery black people's bodies were controlled by others and their reproductive autonomy was nonexistent,” writes the @nyuniversity law professor. Challenging Roe v Wade is “without regard for the country’s post-Civil War history”, she argues https://t.co/vkERDDikKq","date":"Thu Jun 23 01:39:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"After nearly half a century the Supreme Court seems likely to overturn its most famous—and arguably consequential—ruling, Roe v Wade. What should you read to understand the debate on abortion rights in America? https://t.co/00vc5pbWw6","date":"Thu Jun 23 01:31:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China’s collective mental health seemed to be declining even before the pandemic. In Shanghai the suicide rate has been rising since 2009. Covid, unsurprisingly, has not helped https://t.co/Y8UVvHbBfC","date":"Thu Jun 23 01:15:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Where is the best city in the world to live? @TheEIU has released its latest rankings https://t.co/yYSfs5T5IM","date":"Thu Jun 23 01:04:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Across the world, negative emotions reached a record high last year, says the head of @Gallup. But the problem began long before the pandemic. In a guest essay, he urges policymakers to respond https://t.co/6wj3Okkbvy","date":"Thu Jun 23 00:44:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Everything Store now has too much of everything https://t.co/ZMmuhjOYU3","date":"Thu Jun 23 00:29:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Want to learn more about Brazil ahead of its elections this October? Our correspondent has compiled a list of her favourite books on the country https://t.co/KN4jDDu7NH","date":"Thu Jun 23 00:25:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"His second term now looks very difficult. Can he get anything done? https://t.co/YZhU9sd0xU","date":"Thu Jun 23 00:13:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A vicious cycle in countries’ financial systems has analysts worried https://t.co/2stLukq5jC","date":"Thu Jun 23 00:02:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“I don’t see how we're going to have co-operation in today's political environment.” @SiegfriedHecker shares lessons from 60 years of preventing nuclear catastrophe, on “Checks and Balance” https://t.co/qhhGJmPTps https://t.co/ikm4Tkonvy","date":"Wed Jun 22 23:52:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Tech firms perceive mainstream British asset managers as being somewhere between indifferent and hostile, prizing earnings today over the promise of growth tomorrow https://t.co/SXSo7AVrvE","date":"Wed Jun 22 23:31:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Just as it is impossible to unboil an egg, suppressing testosterone after it has done its work does not remove all the advantages it bestows https://t.co/OzvcZYicfh","date":"Wed Jun 22 23:13:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For the third time in the past five years, Vienna has ranked top of the @TheEIU’s liveability index. Find out where your city sits on the list https://t.co/jSRCx39he9","date":"Wed Jun 22 23:06:15 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"So, where does your city rank? Let us know below https://t.co/FNwfAz7ti5","date":"Wed Jun 22 23:00:36 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"🇳🇿 Auckland, which came top last year, has dropped 33 places\n\n🇨🇳 Every city in China has slipped down the rankings","date":"Wed Jun 22 23:00:36 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"🇦🇹 For the third time in the past five years, Vienna has ranked top of the @TheEIU’s liveability index https://t.co/FNwfAz7ti5","date":"Wed Jun 22 23:00:35 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The index rates living conditions in 172 cities based on more than 30 factors, including indicators related to covid. These are grouped into five categories:\n \n🕊 Stability\n🏥 Health care\n🌳 Culture and environment\n📚 Education \n🏗 Infrastructure","date":"Wed Jun 22 23:00:35 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Want to live well? Head to the capital of Austria👇 https://t.co/FNwfAz7ti5\n\nPhoto: Getty Images https://t.co/2PiwugLI3w","date":"Wed Jun 22 23:00:34 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“This time the housing crash will be engineered rather than uncovered,” says @alice_fulwood on this week’s “Money Talks”  https://t.co/yrDcEwFOxk","date":"Wed Jun 22 22:55:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Isotopic analysis means scientists were able to trace with reasonable confidence whereabouts their mastodon was living when a pertinent bit of a tusk was growing https://t.co/CQUmDjES6c","date":"Wed Jun 22 22:17:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Painting became her way of making sense of the world, and revenge was not all she used it for https://t.co/TsMTvCh3qL","date":"Wed Jun 22 22:02:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Swimming’s world governing body has voted to restrict the participation of transgender athletes in women’s events if they have gone through any part of the process of male puberty. In 2020 we explained the science behind why biology matters in sport https://t.co/URSqhYoSYr","date":"Wed Jun 22 22:01:39 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The legal case against Donald Trump is looking stronger https://t.co/FERXjiiT5o","date":"Wed Jun 22 21:46:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The justices require Maine to include religious schools in a tuition programme https://t.co/clReUBWcGB","date":"Wed Jun 22 21:36:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Eight days that shook the markets https://t.co/BI34HrxEI5","date":"Wed Jun 22 21:30:06 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"How one journalist exposed the Wirecard scandal https://t.co/tqr5Bqnt3G","date":"Wed Jun 22 21:16:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Amid all its other pressing tasks, the region needs to reconcile itself to its history and refine a fresh narrative capable of emphasising the many things that Latin Americans have in common https://t.co/X9OQjCX0N0","date":"Wed Jun 22 20:59:16 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Binyamin Netanyahu, who failed four times in a row to secure an outright majority, clearly thinks he can do better this time by campaigning against the unlikely coalition he has just helped to bring down \nhttps://t.co/92sg4ldOzJ","date":"Wed Jun 22 20:44:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For decades, Erich Korngold’s influential film music eclipsed his concert and operatic works. In recent years that has changed https://t.co/nXfMwzoNXv","date":"Wed Jun 22 20:36:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The World Ahead” podcast, @tomstandage travels to 2042 to find children being taught by personalised learning assistants powered by AI, and funded by corporate advertising. What does this mean for teachers? https://t.co/Nz3Z8aA1oB","date":"Wed Jun 22 20:18:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s rail network was halted in protest at a below-inflation pay offer, among other things. The underlying problem: high inflation is eating into incomes https://t.co/ECmJyoXFJ7","date":"Wed Jun 22 20:12:33 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The @nyuniversity law professor urges readers to “think more deeply about the proper limits of the control that individuals and families should have, and the control that state legislative majorities may have, over our bodies and our bloodlines” https://t.co/k6WFEQ9gJ2","date":"Wed Jun 22 19:57:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The speed with which the reported death toll rose, even in an area with few communication links, is a sign of how deadly the tremor may have been https://t.co/idfxQfXQRI","date":"Wed Jun 22 19:45:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America’s five tech behemoths collectively spent more than $3bn on speculative health-care bets in 2021—and may have invested more in undisclosed deals https://t.co/rH3Iysh27v","date":"Wed Jun 22 19:33:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Aircraft that fire rockets are protected from their own weapons, but lofting helps keep them out of range of enemy defences. The technique often comes at the expense of accuracy \nhttps://t.co/XCb0oJZvLg","date":"Wed Jun 22 19:15:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"There will be lasting harm from the pandemic. The World Bank thinks the future earnings of affected pupils might be 10% lower than they otherwise might have been https://t.co/fDf5w1tzOm","date":"Wed Jun 22 18:58:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"She used to write her husband’s comedy scripts. Now Olena Zelenska critiques his war-time videos and helps evacuate vulnerable children. Read 1843 magazine’s interview with Ukraine’s first lady https://t.co/686e8PeBxP","date":"Wed Jun 22 18:42:30 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Do you love podcasting and have a deep knowledge of financial and business news? Apply to be a Senior Audio Producer on “Money Talks”—our weekly podcast on markets, the economy and business—by July 1st https://t.co/zvvIsCMirD https://t.co/MuVFWFfSxv","date":"Wed Jun 22 18:24:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Gustavo Petro has a reputation for authoritarianism, derived from his time as mayor of Bogotá and his perceived closeness to the regime of Nicolás Maduro. But he will have to seek alliances in Colombia’s congress https://t.co/kUduvH2sXa","date":"Wed Jun 22 18:24:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Are you experienced in video journalism, current affairs and television production, as well as managing large teams and production schedules? Apply to join our BAFTA award-winning films team by July 1st https://t.co/mBk1xNmWjz","date":"Wed Jun 22 18:13:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Mortgage rates across the world are rising, as central banks try to rein in inflation. So is another housing crash on the horizon? Find out on this week’s “Money Talks” podcast https://t.co/37A6vKNQep","date":"Wed Jun 22 17:55:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Anyone who can hum a tune from “Star Wars”, “Indiana Jones” or the “Harry Potter” series has absorbed the sound-world that Erich Korngold largely forged https://t.co/MjG0qdX2T7","date":"Wed Jun 22 17:35:57 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Moscow has threatened to retaliate against Lithuania after the Baltic state blocked the transport of some goods to and from Kaliningrad. We explain the history of the exclave https://t.co/cIS279LEOa","date":"Wed Jun 22 17:16:29 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Israelis used the technique in the Yom Kippur war to stay clear of surface-to-air missile systems. Russian and Ukrainian air forces use the technique to similar effect \n\nhttps://t.co/iOMiOTI0Jj","date":"Wed Jun 22 17:01:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"You might say that not much has changed with regard to the attractiveness of American shares. That would not be quite right https://t.co/yIKOKKSxQJ","date":"Wed Jun 22 16:40:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Harold Gillies established the first specialist maxillofacial unit in Britain. “The Facemaker”, a new book, recounts how he rebuilt the faces of soldiers maimed during the first world war https://t.co/RaSBh3FtEC","date":"Wed Jun 22 16:26:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Alphabet thinks that some of its health offerings will become central to humans’ physical existence. Is that an accurate prognosis? https://t.co/Jj01LjHPvL","date":"Wed Jun 22 16:08:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“One of the big lessons of the Cold War is that if you have nuclear weapons and you’re fighting a nuclear armed state there are going to be constraints on you,” @NinaTannenwald argues on our “Checks and Balance” podcast https://t.co/PZMGepwUof","date":"Wed Jun 22 15:52:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Democrats outnumber Republicans among every group of Asian-American voters except Vietnamese-Americans, according to AAPI Data, a polling group  https://t.co/WSLK6hZXfh","date":"Wed Jun 22 15:45:43 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The subjunctive is a feature of old-fashioned English grammar. It has not only survived in America, but made a comeback in Britain https://t.co/Q26SxUFHvx","date":"Wed Jun 22 15:30:37 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America and its European allies almost all want to see Ukraine emerge as a secure and sovereign state. But what that means in practice is not always clear https://t.co/zcBR3dM5qV","date":"Wed Jun 22 15:01:48 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"His most lucrative source of revenue is drugs. So large is the operation that Syrians call it the niqabeh, or syndicate https://t.co/bhjHWBojDk","date":"Wed Jun 22 14:42:25 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The government itself is a big part of the problem. It is not just that lockdowns and oppression lead to anxiety and depression. The Communist Party is also trying to use psychotherapy to mould compliant, socially conservative citizens https://t.co/AJqQTMYk7E","date":"Wed Jun 22 14:25:56 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Today on “The Intelligence”: a tactical update on the war in Ukraine, inside Britain’s pioneering prison-radio network and the weed rush among Japan’s elderly https://t.co/8euF2ej0Nr","date":"Wed Jun 22 14:10:03 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"To see where the problems lie, look at the typical life cycle of a company https://t.co/FiP7KFcfUz","date":"Wed Jun 22 14:04:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Of the 42 big economies featured in the indicators page of The Economist, eight still have inflation below 4%  https://t.co/UFKnHQ76Zb","date":"Wed Jun 22 13:47:40 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Why Japan’s elderly are turning to a cannabis product, on “The Intelligence” https://t.co/I0LWNKqSsQ https://t.co/VBtDzYcsk4","date":"Wed Jun 22 13:29:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Why, when it is a settled matter in most of the rich world, has abortion remained such a controversial issue in America? These four books help to answer that question https://t.co/rWqvzQL4Xu","date":"Wed Jun 22 13:10:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The Intelligence”, @UnChainedP and @JamesPhillipsR1 discuss the legacy and global impact of @prisonradioUK, a pioneering broadcasting service https://t.co/fWEb8e318s https://t.co/WgnbSd0zhy","date":"Wed Jun 22 12:54:47 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"In an interview with The Economist’s 1843 magazine, Ukraine’s first lady shares her fears for her children, thoughts on homeschooling and how Volodymyr proposed  https://t.co/p3P5lCUjuE","date":"Wed Jun 22 12:37:26 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Given the daunting arithmetic of cobbling together a majority, it is hard to imagine that the centre and left will not turn to Arab parties again \nhttps://t.co/TezqPXsZFg","date":"Wed Jun 22 12:17:23 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Ukraine’s need for Western weapons is growing, as @shashj explains on “The Intelligence” https://t.co/834segtdsU","date":"Wed Jun 22 11:59:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"We are seeking a Social-Media Fellow with a knowledge of North America to assist with our strategy to extend the reach of our journalism on digital platforms. Applications close on Sunday July 10th 2022 https://t.co/yUjuBfBUlN","date":"Wed Jun 22 11:55:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Erich Korngold was a prolific and esteemed musician who went on to become the star in-house composer at Warner Brothers https://t.co/TvdAgrVLvO","date":"Wed Jun 22 11:46:46 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One approach is to use the equity risk premium as a guide \nhttps://t.co/o85fxYEoDT","date":"Wed Jun 22 11:28:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The writing has been on the wall since 2017, when the Supreme Court ruled that public grants for cushier playgrounds must be open to secular and church-based preschools alike https://t.co/QrxFWbMvBo","date":"Wed Jun 22 11:09:14 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Short-sightedness, which used to be rare, is becoming ubiquitous in East Asia. Our technology editor explains why on our “Babbage” podcast https://t.co/YpZ80w1ok1","date":"Wed Jun 22 10:49:21 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Are you an audio producer passionate about communicating what developments and trends in finance, business and economics mean for the world? We’d like to hear from you https://t.co/4bh13iPntW","date":"Wed Jun 22 10:31:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"You have probably lost days of your working life correcting typos. Save time by giving up - thnak us later https://t.co/PIWZxuOsRr","date":"Wed Jun 22 10:12:34 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"One approach is to use the equity risk premium as a guide https://t.co/AjouxUYw9h","date":"Wed Jun 22 09:54:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Thailand’s military ruler is on the back foot https://t.co/RC8shlSutk","date":"Wed Jun 22 09:33:52 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"♦️ America’s Senate votes to accelerate the passage of a bipartisan gun-control bill.\n\n♦️ Germany’s first shipment of heavy weapons arrives in Ukraine.\n\n♦️ Why cryptocurrency markets face a summer of discontent.\n\nCatch up on the global stories that matter 👇","date":"Wed Jun 22 09:27:50 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Brexit is a case of two sides, Remain and Leave, who remain bitterly divided six years after the referendum. Our Brexit editor picks seven books that get to the heart of the issue \nhttps://t.co/1e1DveYoma","date":"Wed Jun 22 09:13:42 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Germany is rethinking its China policy. Critics fear that it will prioritise pragmatism over principle https://t.co/z9gCxY7w9N","date":"Wed Jun 22 08:53:44 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The show has yet to find its footing. The fights are overly choreographed and at times, the women act as an extension of Dubai’s tourism board https://t.co/q9nOmLlqkK","date":"Wed Jun 22 08:36:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"On “The World Ahead” podcast, @tomstandage travels to 2042 to find out about the future of education.\n\nHow might personalised learning assistants, powered by AI, change the way schools work? Listen now👇 https://t.co/WDEGD6mdsV","date":"Wed Jun 22 08:18:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A reader’s guide to understanding the events of the past six years  https://t.co/Sd3KYoZyZt","date":"Wed Jun 22 08:10:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Hollywood giant may now lose 20m subscribers, according to Media Partners Asia https://t.co/bW6i7JVrbg","date":"Wed Jun 22 07:54:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A new theory about the landscape in the “Mona Lisa” draws on multispectral imaging—a method that can detect the drawing below the surface of a painting as well as intermediate layers of work https://t.co/1mX9TtaG6f","date":"Wed Jun 22 07:37:19 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Progressive voters now outnumber Conservative voters in Britain by two to one, according to some polls. But marshal­ling this into an anti­-Tory force is easier said than done https://t.co/pJ5FP6CwIJ","date":"Wed Jun 22 07:17:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s scientific success comes in part because of the opportunities for co-operation that Horizon membership brings https://t.co/RuwIfCMqjV","date":"Wed Jun 22 07:01:27 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"But some crossings are only quick trips to evaluate conditions, check on family members and help others to leave https://t.co/EvW8D5X69n","date":"Wed Jun 22 06:44:29 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Britain’s financial-services industry employs 1.1m people, generates 7% of the country’s economic output and contributes a tenth of the Treasury’s tax revenue. But this clout is not harnessed to build the industries of the future https://t.co/NcswJtAbff","date":"Wed Jun 22 06:27:10 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Why did the hedgehog cross the road? France is building new motorway crossings for wildlife https://t.co/YkSgbAGx4V","date":"Wed Jun 22 06:07:08 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Turkey will probably remain a headache for NATO, even when Recep Tayyip Erdogan is out of the picture https://t.co/4v8IX7lNWi","date":"Wed Jun 22 05:51:52 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Civilisation is a “thin film torn very quickly,” says Ukraine’s first lady. Her immediate fear about what the Russians might do turned into a dawning realisation of all that mankind is capable of https://t.co/WgEReyRFJ6","date":"Wed Jun 22 05:36:51 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The one exception to China’s gloomy consumer data is online sales, which grew by 7% last month, compared with a year ago \nhttps://t.co/TckqYPMh3B","date":"Wed Jun 22 05:19:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Like everywhere else, Japan is getting a bite of inflation. Its central bankers want to sink their teeth in even deeper https://t.co/5FDje0UWHE","date":"Wed Jun 22 04:59:40 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"For now Germany, Italy and France are focused on Ukraine joining the EU proper. But this process requires unanimous approval from all members https://t.co/rylBafGlHC","date":"Wed Jun 22 04:43:51 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"There are two reasons to think the Republican Party could make big gains among Asian-American voters  https://t.co/g4X1XuYz7i","date":"Wed Jun 22 04:28:11 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“We have about 10% of what Ukraine has stated that we need,” complains Ukraine’s deputy defence minister https://t.co/d4jYbQQlN3","date":"Wed Jun 22 04:12:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Heating, cooling and powering existing offices, homes and other property accounts for 27% of global energy-related CO2 emissions. However, landlords, homeowners and the construction industry have a rotten record on climate change https://t.co/VuMEKd7M1S","date":"Wed Jun 22 03:54:30 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"As tensions mount over Taiwan and alliance-building in Asia, America and China are trying to stop their close encounters from flaring into conflict  https://t.co/n3XUnFPHvL","date":"Wed Jun 22 03:36:19 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The dizzying speed at which a vibrant and free-spirited city has been brought to China’s heel is depressing. It is also undeniably fascinating \nhttps://t.co/yaxATfHjbd","date":"Wed Jun 22 03:17:59 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The great game in Asia is in full swing. Many in America are only dimly aware of it https://t.co/01f1KPt4qF","date":"Wed Jun 22 03:02:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Powerful tools bring mighty responsibilities. But the benefits to humanity of using tech to tackle mental-health problems could be enormous https://t.co/dlVdzdnCfw","date":"Wed Jun 22 02:43:00 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“No one wants to be at the epicentre of these terrible events,” Ukraine’s first lady tells 1843 magazine https://t.co/Lq1KbNvKeL","date":"Wed Jun 22 02:35:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A list of books that introduces some of the characters who populate the sprawling, multi-faceted country, curated by our Brazil correspondent https://t.co/y059Uo5bMD","date":"Wed Jun 22 02:19:18 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The positive case for bitcoin mining from hydro-power plants relies on the idea that clever financial engineering can increase green electricity production by more than the computers use https://t.co/2ax2ndmrau","date":"Wed Jun 22 02:04:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The Supreme Court has come out against James Madison, the chief author of the Bill of Rights—as well as Thomas Jefferson’s vision of a “wall of separation between church and state” https://t.co/z52J55qB2z","date":"Wed Jun 22 01:52:32 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"With more than 11m eligible voters (nearly 5% of the total), Asian-Americans are the fastest-growing of all the country’s main ethnic or racial voting groups https://t.co/jgKI1Gcj8g","date":"Wed Jun 22 01:32:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"This month a French engineer declared that he and a collaborator had identified the landscape in the background of the “Mona Lisa” https://t.co/bHqlf00sAc","date":"Wed Jun 22 01:23:27 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Central banks urgently need to convince people that they are serious about getting inflation down. Changing the public’s mind could be extraordinarily difficult https://t.co/kUKLS2qQrI","date":"Wed Jun 22 01:04:15 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The world must also ensure that Vladimir Putin does not prosper from his aggression today. Otherwise he will issue more nuclear threats in the future \nhttps://t.co/MVtbfaZmqd","date":"Wed Jun 22 00:46:24 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Years of your life have been lost to utterly pointless activities at work. Here’s how to save more time https://t.co/gHTXkI83NQ","date":"Wed Jun 22 00:29:22 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"So far this year the company has injected $1.7bn into futuristic health ideas, according to CB Insights. Its fellow tech giants, which spent around $100m all told, have been left in the dust https://t.co/cxBflIVzwX","date":"Wed Jun 22 00:11:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"“The US will have to lead the rest and that means working with the Chinese also to try to re-establish a global nuclear order.” Listen to “Checks and Balance” with @SiegfriedHecker, former director of @LosAlamosNatLab https://t.co/NBG58wkPJF https://t.co/el0vLbmwKc","date":"Tue Jun 21 23:52:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"After nearly half a century the Supreme Court seems likely to overturn its most famous—and arguably consequential—ruling, Roe v Wade. What should you read to understand the debate on abortion rights in America? https://t.co/mybscR2j3M","date":"Tue Jun 21 23:42:45 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"China’s collective mental health seemed to be declining even before the pandemic. In Shanghai the suicide rate has been rising since 2009. Covid, unsurprisingly, has not helped https://t.co/wYTtpPt0oD","date":"Tue Jun 21 23:25:02 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Last year Juneteenth—a portmanteau of “June” and “19th”—became America’s 12th federal holiday. But it was already widely observed https://t.co/CLrzvmZ056","date":"Tue Jun 21 23:04:05 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Lithuania has blocked the transport of some goods to Kaliningrad. We explain how Russia came to control the exclave, and ask whether it is an asset or a liability https://t.co/a30CC6uPIl","date":"Tue Jun 21 23:03:09 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Latin America’s problems are partly those of success, since they reflect the fact that it has more educated people. After more than 30 years of democracy, younger generations take freedom for granted \nhttps://t.co/PM9onCpTQH","date":"Tue Jun 21 22:37:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Drug maﬁas have spread throughout Latin America and diversiﬁed into extortion and human traﬃcking. There have been some successes against them, but they tend to be local and hard to sustain \nhttps://t.co/DSaNrml6ic","date":"Tue Jun 21 22:32:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The legal case against Donald Trump is looking stronger https://t.co/m7h59fezse","date":"Tue Jun 21 22:22:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"Russian and Ukrainian aircraft have adopted an unusual tactic for firing unguided rockets \nhttps://t.co/oqcaZIIR4F","date":"Tue Jun 21 22:05:07 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"A long period of relative economic stagnation has brought frustration over lack of opportunities, along with marked political deterioration. It all adds up to a vicious circle and a development trap https://t.co/uefvBKWQBT","date":"Tue Jun 21 21:57:04 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"America is undergoing a “rapid transformation” of religious liberty, Justice Sonia Sotomayor concluded in her dissent https://t.co/OEBTkZeuG8","date":"Tue Jun 21 21:36:01 +0000 2022","user_id":"5988062"},{"handle":"TheEconomist","text":"The share of Asian-Americans saying America is on the wrong track rose by more than among other groups between July 2021 and March 2022  https://t.co/i1Po3m8HNn","date":"Tue Jun 21 21:31:24 +0000 2022","user_id":"5988062"}]